{"id": 29220, "submission_id": "17bdveb", "title": "AITA for expecting someone else to pay for food?", "selftext": "I live with my partner and I've started noticing that things don't really seem equal. By that I mean I seem to do a lot more for my partner than I get back. And example of this was this week. I had planned to order us food since we hadn't ordered out in a while. I told my partner this and we ordered pizzas. This came to around £35 which I was happy to pay.\n\nA couple of days later my girlfriend said she felt like ordering Mcdonalds and asked if I wanted anything. I asked for a burger and fries. Straight away my girlfriend told me how much it was and asked me to transfer her the money. At first I thought she was joking but she said she was serious.\n\nI told her that I thought she was paying and doing something nice since I paid for food a few days ago. She accused me of guilt tripping her into paying for the food. I told her it's not guilt tripping and that I'm just pointing out that it's upsetting knowing that I'm happy to do something nice for her without a second thought but that she won't even consider spending £5 on food for me. \n\nShe again said I was guilt tripping her and I just repeated that it's not guilt tripping and if she's feeling bad because of what I've said then it means she knows I'm right. She said she wasn't ordering food anymore since I have started an argument over nothing. I told her I didn't start an argument, I just told her how I felt and she got annoyed at being called out on it.\n\n She said I was being unfair and that I shouldn't have expected her to pay for the food.\n\nAITA for expecting her to pay for the food?", "created_utc": 1697702356, "permalink": "/r/AmItheAsshole/comments/17bdveb/aita_for_expecting_someone_else_to_pay_for_food/", "score": 634, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Expected my partner to pay for my food when I paid for us a few days ago and it was her idea to order\n\nShe said I was guilt tripping her and that I was unreasonable for expecting her to pay\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "i don't think you two should be partners. especially you, you should find someone else who treats you better than \"accused me of guilt tripping her into paying for the food\" when you literally paid her part a few days ago.", "NTA.\n\n&#x200B;\n\n>She said I was being unfair and that I shouldn't have expected her to pay for the food.\n\nUrm what ? If so why is she expecting you to pay for your share of the food ?", "INFO I think you’re NTA but the only way I could get my head round her behaviour would be if your incomes are vastly different, or if household bills aren’t otherwise shared fairly. Is there a big disparity?", "NTA and next time she wants you to order something for her, tell her to transfer the money over first 🤷🏼‍♀️", "NTA she is an adult she wants to order she needs to pay asking you if you want something doesn't mean you need to pay", "I agree with everyone saying break up. \n\nNta\n\nGoing forward, if you make the bad decision to stay together, make it clear that things like that are split. \"In ordering myself a pizza, want to throw some money in and get something from (pizza place), or to make the pizza a shareable size\" or \"wanna go halves of takeout\"? Anything that makes it clear that, if she doesn't pitch in, then she needs to plan her own food. \n\nBut you're better off dumping her.", "NTA. This is highly weird behavior. My partner and I alternate with whomever can cover / wants to cover it. No need for paying back as it's for us anyway. \n\nAdditionally do you really want someone to accuse you of gaslighting for asking some question?", "NTA. Seems fair that she pays now for the Mac considering you paid for the pizza.", "NTA --- Next time that you want to order food tell her up front she's paying half as that is what was expected the last time from you.", "***She said I was being unfair and that I shouldn't have expected her to pay for the food.***\n\nBut shes happy to let you pay for food? Red flag OP red flag. She was trying to gaslight you here and its clear she doesn't ever expect things to be equal \n\nMe and my partner split food costs 50/50 all the time unless its a special occasion and someone is treating the other to a meal.", "Nta Leave her asap, she doesnt care about youre feelings and it seems like she expect you to Pay for her", "NTA, if she wants you to pay for your share of the food, then she should when you buy. If she doesn't, then just order your own food and she can order hers.", "NTA\n\nIn what universe does someone ask you what you want from the takeaway they’re ordering and then tell you to pay for it?", "NTA. Sudden shift in attitude and the whole guilt tripping thing sounds like she found friends/tiktok/FB group that do that and wants to see if you can be manipulated. Setting up boundaries, especially financially, is extremely important in a relationship. If she decides to not respect them then she needs to be single and you a better partner.", "I had a friend like this. We weren’t dating or anything so I never expected a meal or anything from her, but every once in a while, I would get her bubble tea or a cookie or something without asking for any repayment, like I do with all my friends. Or get her dinner on her bday/when she had a rough day. Little stuff, you know? Over three years, she never once reciprocated. If she bought me a cookie, she had me Venmo her the $2. We’re no longer friends, for unrelated reasons, but looking back, I do see it as a red flag for how little she cared about me in general. \n\nBetween £5 and you, your gf chose £5. Just remember that.", "Only the start of a long miserable relationship.  RUN!!!", "NTA. She initiated and offered. Is she financially stable? If not it might change the dynamics, but otherwise why shouldn’t she pay sometimes.", "You need to sit down and have a proper chat about expectations. I've been in relationships with women like this before. They have the attitude that my money was our money but her money was her own. I never have a problem with someone with an attitude like this, it's just something to toss into the mix in deciding whether it's a relationship to continue with. In my case, the answer is no.", "Definitely NTA. You'd do well to find another partner. Seems petty, but this type of behavior typically only gets worse.", "NTA your gf sounds like a [insert bad word here]", "You are right, she shouldn't expect you to pay. And definitely there is an unfairness going on here. If what you said upset her, yea she just doesn't like being called out", "NTA. She sounds like a narcissist", "INFO: Do you two normally pay for your own food when you order for each other?", "NTA. This is a relationship, not a contract. She’s showing some red Flags with the fact that her first thought wasn’t simple, “ Let’s get us food, I’m starving,” but rather, “ We should split the cost. It wouldn’t be fair on me.”", "Does she guilt trip and gaslight you about other things? This would be a red flag for me.", "NTA, modern women don't need a man, except when the dinner bill arrives.", "INFO It sounds like you pay for your girlfriend a lot. What does she do for you a lot? Like is she running errands for you or does she cook most days? Or alternatively do you split bills 50 - 50 but you earn 3x as much as her?\n\nCouples have their own ways of evening things out. We need a bigger picture to see if everything is fair.", "Info: How are household finance split? As in rent, food, utilities etc", "Expectations uncommunicated are a problem. If you feel like things are unequal and issues with financial stuff is coming up then yall need to have a talk about expectations. YTA if you don't communicate clearly", "ESH if you want it to work that way then speak up! You didn’t ask her for Pizza money so just because she didn’t offer you any is on you, she asked you to pay for your own food this time, it’s not a big deal", "NTA\n\nBut seriously. £35 for pizza! No way would I pay that. I’d rather make my own (it’s really fun!) or get a couple of £5 ones at the supermarket", "What are each of your finances like? Would it be a hardship for her, but not for you? Have the two of you had any discussions about expectations around paying for things, ordering out,  etc? Without knowing that, it's hard to judge. I'm guessing you've at least not directly discussed your expectations, or your discussion during this incident would have been different.  You can have feelings,  but unless you've actually talked about things, YTA for expecting that your expectations are the way things should happen.", "ESH - while I agree that there should be financial balance and equality in a relationship, it also sounds like you're not communicating with your partner. How is your partner supposed to know what your expectations are for the relationship unless you sit down, have a discussion, and come up with an agreed-upon plan for dividing financial responsibilities?", "I N F O\n\ni want clarification \n\nShe said SHE wanted McDonald's.  Then asked YOU if you wanted anything, you said yes, and she asked you to transfer her money \n\nWas the money she asked you to transfer her for just YOUR food or BOTH of you?\n\nEdited, based off of ops responses to my post so far, I have to vote NTA \n\nThis seems like there might be more going on though\n\nEta ya'll can down vote me and be salty if you want to.  \n\nI really don't care.   I have no issue asking as many clarifying questions as I need to to actually get an accurate judgment.  Which none of ya'll would have gotten because you think his gf is grubbing for his money when he clarified in other comments that she is financially stable, that they have similar incomes, and that this isn't normal behavior between them.\n\nBut, you know, financial stability be damned, apparently asking for 5 bucks for someone else's portion of a SHARED meal automatically means your out for their money, and that you're desperate \n\nLadies, be careful, don't go out on dates unless you can pay for BOTH of you now /s\n\nEdited again lol\n\nThe absolute sexism is showing here and its hilarious lol\n\nI get down voted for asking for clarifying information, and op gets up voted for answering the questions I asked, that wouldn't have been answered otherwise \n\nI stand by what i said in my earlier update lol\n\nLadies beware 😂", "ESH. Y T A for expecting her to pay for the food when you didnt make it clear that you expected her to pay for it since you paid the last time. Your GF is T A for going straight to guilt tripping instead of having a conversation", "ESH because you should have discussed things like this before moving in together", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI live with my partner and I've started noticing that things don't really seem equal. By that I mean I seem to do a lot more for my partner than I get back. And example of this was this week. I had planned to order us food since we hadn't ordered out in a while. I told my partner this and we ordered pizzas. This came to around £35 which I was happy to pay.\n\nA couple of days later my girlfriend said she felt like ordering Mcdonalds and asked if I wanted anything. I asked for a burger and fries. Straight away my girlfriend told me how much it was and asked me to transfer her the money. At first I thought she was joking but she said she was serious.\n\nI told her that I thought she was paying and doing something nice since I paid for food a few days ago. She accused me of guilt tripping her into paying for the food. I told her it's not guilt tripping and that I'm just pointing out that it's upsetting knowing that I'm happy to do something nice for her without a second thought but that she won't even consider spending £5 on food for me. \n\nShe again said I was guilt tripping her and I just repeated that it's not guilt tripping and if she's feeling bad because of what I've said then it means she knows I'm right. She said she wasn't ordering food anymore since I have started an argument over nothing. I told her I didn't start an argument, I just told her how I felt and she got annoyed at being called out on it.\n\n She said I was being unfair and that I shouldn't have expected her to pay for the food.\n\nAITA for expecting her to pay for the food?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta me and my partner split all costs from the day we meet I am a independent women and was taught by my nana that women should pull there own weight think it stuck a bit to well as I hate anyone paying for me", "NTA - You now know how things are, in future don't buy her any food without getting the money.  Hopefully she'll realise the error of her ways or she won't but you won't be out of pocket so a win either way", "NTA\n\nShe expects you to do for her but not vice versa. Even if she's making less money than you, this needs to be a mutual agreement, not a decision she comes to by herself and expects you to adhere to.", "NTA. But simply start requesting money every time you order food.", "You don’t gotta leave her that’s a bit dramatic if the rest of your relationships good just do the same in return. She set the rule of paying your own so let her do the same, simples", " i think it should be about equal. NTA but i also think you need a new gf. this one seems malfunction", "NTA -  she just openly showed that your money is hers and her money is hers. \n\nSo unless your happy with this then leave her.", "Ask for the money back, if she says no, tell her she is guilttripping you\n\nNTA", "Nta", "NTA", "Definitely NTA. My partner and I have an understanding that whoever offers food or asks if the other wants something, that person is paying. It keeps things fair. The only exception is if they are financially struggling at the time. Talk to your partner and ask why they wanted you to pay. If it's 'just because' then don't pay her back. If it's cause of financial problems, then pay back and offer her help. Not saying this covers all potential problems, but it may help.", "NTA. I do not understand the bit about guilt-tripping. If anything she's guilt-tripping you. If you're both earning similar amounts then unless one person has a big debt they're trying to clear it's pretty obvious to share and share alike especially for a cheap takeaway.\n\nIf we're ordering a takeaway then it's generally on the person who first moots it to pay for it unless there is a further discussion about how it's being paid for.", "NTA. Sounds like your GF has been spending time with the unhinged women on this sub who claim everything is <insert incorrect use of random buzzword>.\n\nDitch the GF and order yourself a nice takeaway.", "NTA you need to have a larger conversation about her role in this relationship.", "I wouldn't order food to share again, period. \"I'm ordering pizza. If you want to, place an order for yourself and they can bring them together.\"", "NTA. But I don’t know if you’re going to continue to get on well with someone who has this attitude", "NTA. But, if you decide to be kind and pay for something I think you should generally not expect to get it back. Example if I pay for drinks for a friend, I do it as a nice gesture, if he repays me sometime with drinks - that's fine. If not, I will probably just not pay for him again, I won't bring it up though.", "NTA- she sounds selfish af.", "Nta she for the streets lol sorry about that . \nBUT relationships are two way give and take not just take take take. Take a hard look at your relationship and if you are doing all the heavy lifting... might be time to lay down the law or show her the door.", "NTA I think seriously look at your relationship, does she make you pay for everything?", "NTA\n\nThat’s a weird double standard and super weird that she tried to blame you for the whole thing.\n\nDoes she usually treat you like an ATM?", "NTA\n\nGet rid of her. Clearly she doesnt respect you", "NTA. I think she kind of deserved the guilt trip for being so stingy and rude. You bought her food a few days ago, and she has the audacity to ask you for money for your meal from McDonald’s?", "NTA, She's 15 right? Who else would do that?", "NTA - to me, the issue is her shutting down a discussion by accusing you of guilt tripping more than anything", "NTA. If this is a common theme in the relationship then I’d end it personally because I don’t like unequal relationships. However, you could always communicate to her that this conversation made you realize her expectations of splitting everything equally so I’m the future you’ll be sticking to this and expecting her to cover her own expenses when it comes to food. If she doesn’t like that, then you can discuss, again, how she’s treating you unfairly since she expects you to do this for her but she can’t do the same for you.", "NTA. You're not partners.", "Should have replied “that’s fine you owe me 12.50 for the pizza the other night then, how would you like to get that to me?”", "NTA \n\nMy partner and I track expenses in a shared app, and since we're partners, we split things we're both involved in and whatever is just for us, we pay out of our own budgets.\n\nIf your partner is unwilling to pick up a cheque, doesn't agree to split costs semi-equally and is immediately asking you to transfer her money like you're some kind of flaky aquaintence, your relationship concerns are bigger than this fight over 1 food order.", "[removed]", "Bills are split 50/50 and we earn very similar amounts", "Why engaged with a petty back and forth with somebody like that? Find a new place and bail. Find somebody who isn't a cheap ass.", "this, I mean I understand people seeing OP kinda the AH for assuming the GF would pay if she asks if OP want something (also GF should've said in front if OP has to pay to be fair)  \nbut to escalate it like this, GF is kinda manipulative or something.  \nshe could've just said no she won't pay and not making it OP's fault and all.  \nNTA for me.", "Yeah, my husband usually pays for takeout and delivery, but if I'm out and getting myself something and ask if he wants anything I always pay. All relationships are give and take and the gf is being so weird.", "Yeah she is financially stable", "If we decide together to get food we tend to split it but if I for example decided I wanted to order food, I'd ask my girlfriend if she wanted anything and I'd pay for it all", "🙄 dumb af bruh", "Our incomes are very similar which is why bills are split 50/50. I do the majority of the cooking and the rest of the chores are split evenly", "We split finances 50/50", "It was £35 for 2 pizzas, some sides and a couple of drinks and delivery costs.", "We earn very similar amounts and are both pretty comfortable financially", "She wanted me to pay for my food", "Could be but that seems to be a bit of a stretch.  Odds are she is just TA", "Might be her mind set that the man pays for food that you order in.", "Since you live together, how do you split other bills? Do you have a joint account that you pay into? If so, include food in that budget. That’s how my now-husband and I did it when we first moved in together (we still do)", "Fair point", "Is there something else going on? Perhaps leave the subject alone for a bit, then circle around to it. And start with asking questions. How is she feeling, what's going on in her life. If nothing comes up, come back to her payment request and asks if this is how she prefers to do things in the future.\n\nDifferent people need different things in relationships. Some want to the feeling of \"being taken care of\". This could be her way.\n\nYeah, it's not equal, or fair. But a lot of things aren't fair in relationships, and overall they could be worth it.", "So why did you think it was a joke when she asked you for money for your food? If the pattern has been \"we usually split it\" when getting food together, you shouldn't have been surprised by the request OR thought it was a joke.\n\nYou've mentioned when you decide where you want to order on your own, you ask if she wants anything, then pay for it all. Okay. How often does she decide where she wants to order then ask you if you want stuff? Is it a common occurrence? Or is it possible this is the first time that's happened?", "Except it's right up there in black and white. I'm just literally summarising what OP posted in one sentence.", "Then NTA.", "Have you guys ever talked about this before, or was this the first time?\n\nIs there an income difference between the two of you?", "That is so stupid. I do understand that men paid in times women had no income or they were paid less than men. But if the income is similar, paying your own stuff should be norm. In this case I would pay the food if my spouse had paid previous time. NTA.", "The bills come out of my bank account and my partner transfers me her half of the money.", "Why are you people trying to find any way to justify or excuse her behavior? Grow up!", ">So why did you think it was a joke when she asked you for money for your food? If the pattern has been \"we usually split it\" when getting food together,\n\nI said we usually split when deciding to order food together. I said if it was my idea for example I'd pay. We didn't decide together to order food together in this example. My girlfriend decided to order food and just asked if I wanted anything.\n\n\" How often does she decide where she wants to order then ask you if you want stuff? Is it a common occurrence? Or is it possible this is the first time that's happened?\" I can't remember the last time she decided to order out on her own tbh", "Our incomes are very similar and normally when we order food, we'll split the cost if we decide together to order but for example if I decide I want to order something, I'd ask my girlfriend and then I'd pay since it was my idea to order food", "I have plenty of female friends who expect the man to pay but those friends are cooking them special meals, remembering their mother’s birthdays and keeping a nice house. So it’s only unbalanced if you are the man and you are taking the woman’s contribution for granted.", "Depends how your brought up", "I'm pretty grown up by now and I have kids.\n\nI'm not going to nuke a relationship from orbit, because my SO was acting weird for a moment over five quid. No, I'm going to find out exactly what happened.\n\nNow, if I find out that I'm being financially abused, and it turns out it's not one of my kinks, then I'll revisit the question of whether this relationship is worth it.", "So you essentially invented an unspoken rule and expected her to follow it, *without having ever discussed it* with her before hand? \n\nAnd when she did what - in her mind - was what you guys *always* did with takeout, you acted like it was a *joke*. And then when she was like, \"No, not a joke. This is what we do all the time.\" - you  proceeded to tell her that you thought her asking what you wanted now *implied* she would pay for your food - worse, you said her asking you what you wanted was her \"doing something nice\" by paying for the food as a way to reciprocate for your food purchase a few days ago.\n\nInstead of expecting your girlfriend to be telepathic, you need to actually talk about things. She didn't accept the pizza with the expectation that it somehow changed the previous ordering-out arrangement you've had for however long.  You decided that she needed to follow this invisible rule of yours, and when she didn't, you  absolutely for sure guilt tripped her to high heaven with this line: \"it's upsetting knowing that I'm happy to do something nice for her without a second thought but that she won't even consider spending £5 on food for me.\"\n\nDid it not occur to you, OP, that she may not have the funds to cover both of your foods right now? Had she known about your hidden rule, perhaps she wouldn't have brought it up to begin with.\n\nYou were the one who decided that the rules changed, OP. You were the one who didn't bother talking to your GF about this total change in expectations, OP. And you also assumed that her unwillingness to spend £5 on food for you *in this one particular instance* was about **about her not caring about you**. (That was a guilt trip, in case you didn't recognize it.)\n\nSorry, dude, YTA. \n\nIf you want to keep score, go ahead, but **you don't get to complain about her not keeping up with you if you don't tell her you're keeping score**.", "Has she had any recent expenses like medical bills/car expenses, the like?\n\nI'm very confused as to this sudden shift", "Correct. Some people are brought up to be assholes.", "Tbf, every decent person who appreciates their partner and relationship at least a little bit will think in this instance \"oh, they invited me a few days ago, i should invite them back\". \n\nPpl who have the mindset \"they invited me but that doesn't mean i'm going to invite them back next time i order\" is a cheap user with bad manners. Sorry. \n\nOp, i think your gf just doesn't appreciate you the same as you appreciate her. Make with this what you want.", ">And when she did what - in her mind - was what you guys always did with takeout,\n\nExcept I've said repeatedly this isn't true. How do you fail to understand that?\n\n\"She didn't accept the pizza with the expectation that it somehow changed the previous ordering-out arrangement you've had for however long\" Like I have said in multiple comments this wasn't a one off. \n\n\"Did it not occur to you, OP, that she may not have the funds to cover both of your foods right now? \" She can afford it. Why do you just assume I have no idea of my girlfriends financial situation?\n\n\"That was a guilt trip, in case you didn't recognize it.)\" No it isn't", "Ohh God stop white knighting this women dude, you look f0cking desperate. It's clear as crystal she is cheapo and using OP for food.", "No there are no recent expenses", "One-for-one reciprocation is not the only way to appreciate your partner. For example, maybe to show her appreciation, she handled the cleanup and leftover drill for the pizza and then handled the recycling when he normally would.\n\nSometimes people don't have funds to spare. To act like \"oh the only way to reciprocate is by *returning the same favor*\" is a pretty crap way to run a relationship.\n\nObviously, I don't know the OP or the GF. I have no idea if she did any kind things / extra things for him because of the pizza or not. But your take on it (that it's expected she behave exactly this way OR she's cheap and has bad manners and doesn't appreciate her BF) is a bad one.", "Your Own Words, OP:\n\n\"I said we usually split when deciding to order food together. I said if it was my idea for example I'd pay.\"\n\n\"I can't remember the last time she decided to order out on her own tbh\"\n\nSo, to be clear:\n\n\\- you expect the person who decides on their own to pay for the order because *it's what you do*\n\n\\- you c*annot remember* the last time your GF decided where to order (before this situation)\n\nSo, did ***either*** of you ever specifically say out loud \"if you choose the restaurant without input, you're paying\"? Because you seem to think that's an established rule because it's what YOU do.", "Also, your use of the term \"white knighting\"  was clearly meant to cause outrage/defensiveness\n\nLuckily I know English \n\nAnd I know you used it improperly \n\nI don't think that she should have asked if he wanted food, if she was going to ask him to pay her back for his portion but I also don't think it makes her an asshole\n\nBased off of ops replies that they normally split costs if they agree on a place beforehand, or one person suggests ordering food, and that person usually pays outright, it makes me think there may have been a change that he was unaware of \n\nBut yes, obviously \n\nEvery woman who asks a man to pay for HIS portion of a SHARED MEAL is DEFINITELY the asshole, and definitely grubbing for his money, totally. /s\n\nEdited grammar and clarity", "She asked him to pay for HIS food \n\nReading fully would help you out a lot lol\n\nThis is why I asked so many clarify questions", ">\"I said we usually split when deciding to order food together. I said if it was my idea for example I'd pay.\"\n\nYes and like I have stated in the post, we didn't decide to order out together. How are you failing to understand that?", "It's because you're a man. For some people that means you *must* be the culprit. They'll continue inventing scenarios to make you look like the sphincter.", "You have **never once said that you discussed and agreed** to the \"if you pick the restaurant, you pay\" rule. Did you and GF lay out this rule? With words?", "Actually, becuase he's made it seem as if he invented this rule in his head, never communicated it to her, and expected her to have gained it via telepathy.", "Do you never do anything for your partner unless you have both explicitly discussed it? Does every little thing you do have to be discussed first? If your partner buys you both some food, would you never think to buy them some food next time you're ordering if they don't explicitly ask you?\n\nAnd your comments are just laughable with the amount you've made up instead of just sticking to the post btw", "With all the infos you gave in comments NTA. \nShe’s using you, and was upset she couldn’t get away with it.", "NTA\n\nBut you and your partner need to have a long conversation about money, splitting costs and budget expectations.", "One of the purposes of dating is for people to determine if they share the same values. \n\nIf your gf wants her bf to pay for her, and you emphatically do not, then you two are unsuitable. \n\nMy sister dated a guy, where they split absolutely everything. He made about 10 times more money than she did. They split every meal they had on dates, concert tickets, vacations...everything. My sister thought that she was being a strong, independent woman. \n\nShe married him, and splitting the bills continued. He paid for most of the mortgage, since she could never have afforded a house in that area, but she split everything else. They lived in a high cost of living area. She went into credit card debt, and had trouble affording hair cuts. He would go on vacation without her, because she couldn't afford it. He would pay for a vacation if he wanted her to come see his family, otherwise, he would just vacation with friends or relatives. It got pretty extreme by the time they divorced. She just couldn't financially afford to stay married to him. \n\nI sincerely hope that you do not fall into the same class of man. \n\nI'm very traditional. I think it's a bad idea to move in with someone you're just dating, because it creates pressure for unsuitable people to remain together when they should have gone their separate ways. If you break up, one or both of you have to move, forced to live together until that time. I think a man should pay on dates, and for the most part, pay for vacations. This shows that he will provide for her, if they do get married. He will take care of her while she is pregnant, for example. A couple also needs to discuss if they want kids, or not, and if they do have kids, is the plan daycare, stay at home mom, part time work, or full time career with lots of overtime. They have to be aligned on values, religion, politics, what to do in the event of an unplanned pregnancy, and all sorts of issues that can lead to major disagreements. \n\nNow, you can have every right to expect your gf to show she cares. Have you determined if this is going to be from splitting bills 50/50? Or doing acts of service for you like making you a lunch to bring to work everyday, showing loyalty, or in some other way? You need to figure out how you want to feel loved and supported, communicate that, and see if you're compatible. \n\nIf you're not compatible, then you have no business living together.", "Definitely a two-sided coin here - On the one hand, she didn't ASK you to pay for her pizza, you did it yourself and now are treating it like a transactional affair - you'll never be able to do something nice for each other moving forward if you're keeping tabs on stuff like that.\n\nBut also, she could have definitely paid £5 considering you bought the food for her and it's definitely wrong to say it's guilt tripping.\n\nPersonally, I think you're NTA. But I could also see why she thinks you are.", "ehhhh i want to say NAH.\n\n**It's not really a nice deed if you expect something in return.** But we might need more info. Are you often buying her gifts without her ever paying for gifts in return? Was this a situation where you wanted to do something nice for her and then you expected her to do the same for you? Some people care more about money than others. Do you both *usually* split food costs? Is it possible she assumed this was normal in your relationship while you assumed it was normal to cover each other?\n\nThis actually sounds a lot like my relationship. We tend to disagree on whether or not we should cover each other or split the cost, so we make sure to always discuss beforehand how the food will be paid for. \"Do you want to get sushi?\" is always followed with \"Who's paying?\" If I ask my boyfriend if he wants to get food, I'll always clarify if I'm paying or if I expect him to split it with me. Some people think these things should be assumed rather than discussed, but there really isn't anything wrong with needing to communicate these things. If you have an expectation for someone you need to tell them! If they continue to not meet that expectation afterwards then you have a problem.\n\nI definitely don't think you're an asshole, but I can't comfortably say that she is an asshole without you talking to her about the problem. Some people just won't understand why you have a problem with this until you talk to them about it.", "YtA for keeping score in a relationship", "YTA- Let me get this right, you chose to cover pizza for your girlfriend even though you normally split things and then when she didn’t automatically do the same thing that means she doesn’t appreciate you? You did give her a guilt trip and you also decided to throw a little fit because you couldn’t bother actually communicating with her. It is entirely possible that she feels like she does a lot for you that isn’t appreciated or returned. Put your big boy pants on and have an adult conversation", "YES OMG YTA.", "Nta", "NTA…charge her for the pizza next time and see how she likes it. Your partner is a real peach, recommend you use catch and release on her.", "Just leave, if she can't spend her money on you without crying about it unironically, its not worth staying, if theres no equality.", "NTA.\n\nDifferent people have different views especially with money. I am happy to pay for food for gf or even friends here and there. I don't expect they pay half and if they offer I usually round down i.e $52 bill just give me $25 close enough. If it was a constant issue though I would probably start asking GF for half still the rounding down though.", "Without more context (like income disparities, if partner regularly pays for other things, if this happens regularly…) I’m going to say NTA", "NTA, she suggested getting food. She ITA for assuming you'd pay.", "Huh? NTA that is very one sided. She needs to accept that it’s not guilting to ask her to split things.\n\nAlso-request half the money for that pizza.", "NTA\n\nYou're not her ATM", "If you ask someone for food out; you should be paying.", "NTA \n\nEnd it now. This is just the beginning and you're fighting like this? End this before you hurt each other.", "NTA, a partnership should be both ways not one sided.", "NTA.  The one doing the inviting pays.", "Dump her now!! It’s only going to get worse", "NTA over pointing out she wants to be paid when you fronted way more a few days ago. You do need to have a serious talk with each other to figure out the why. Does she make a lot less than you and 5 has impact of you spending 20? Is she just selfish? Are you more vested in the relationship than she is ? If the relationship is fairly new then she may see your pizza as a expectation of guy pays for date night (dated concept but still happens) and her fast food buy was seen more as a pay for what you get situation rather than reciprocal.", "NTA, your girlfriend is a huge red flag", "NTA\n\nHow me and hubby roll is basically whoever asks to do the takeaway is generally the one paying for it so like you ordered pizza you paid, she asked if you wanted maccies then to me that means she’s paying. Why ordered takeaway if you’re asking someone else to pay their portion? It sounds like you need a sit down to figure out the ground rules of ordering takeaway and see where her head is at because tbh, she sounds like a bit of a taker, has she never paid for takeaway before?", "NTA\n\nYour idea of partnership and mine are kinda the same. If I am the one getting food and ask if you want anything, I'm picking up the tab (unless I'm cash strapped and say so and am asking you to get me something!!! But that would be an ask, you know?)\n\nWhen I've dated folks that are much better off than I am financially, they almost always OFFERED to pay. But I never expected it, if I was the one offering to get food. \n\n(This applies to friendships, too. My bestie and I came to the conclusion the friendships are working well when BOTH parties feel like they get our more than they put in... \"It's my turn, I got this, this one feels easy\", we show up for each other and everyone feels supported, cared for, etc.)\n\nYou guys may be on different pages about what relationships mean. Is she the kind of woman that thinks men always pay? And thinks that's why she is in a relationship? (And if so, does that work for you? Or is that a deal breaker? It would be for me, even as the woman. Because that's not how *I* view partnership.)", "NTA and stop paying for her. You're being used!!", "My husband and I don’t share finances, if I ask him to order food I pay for it, if he asks to order he pays for it.", "NTA, i would assume the one asking “do you want something” would be paying, especially if you had just treated them to a meal. Otherwise they can just go get their own food and eat it in the car or whatever. \n\nWhen I order Doordash for my kids when they’re at a friend’s house I order for them and whomever is there, sometimes even the parents. I pay because I’m the one who suggested it and it’s the polite thing to do.", "NTA\n\nI dont know how you live, But it’s only a Mcdonalds.  I mean if we were going for a special meal at times we would share the bill.", "NTA.  Hit eject.", "NTA. I'm thinking that instead of making the comment right then, I'd have waited and then brought it up to discuss at a neutral time with examples. Like hey can we talk, I've been feeling xyz and I wanted to discuss it with you. If you just suddenly come out like this and in the past you've never had a problem, it's confusing.", "You realize this relationship is destined to fail, don't you?", "🚩", "NTA.\n\nYour girlfriend is acting like a child.  She doesn't want to spend her own money on anybody but herself, but expects you to pay for her.\n\nHer money is hers, and your money is ours.", "NTA  but you should be happy she only asked for the cost of your food. Now I could see being upset if she ordered McDonald's just for herself and didn't ask if you wanted anything. Or if she asked you to pay for all of it . This is all part of learning to live together , now if she does it every time that's different.", "NTA. If it was her idea to order food why would she expect you to pay, especially if you just paid for a more expensive order a few days back? Sounds pretty toxic.", "Entitled little girl you have there,  better think this one through if you want a future with her.", "It is guilt tripping in a sense.\n\nIf she doesn't want to buy you food the fact you bought her food previously doesn't entitle you to her buying you food.\n\nRealistically you can only really stop buying her food if you don't like that it doesn't go both ways.\n\nOr consider if someone not willing to spend £5 on you is really a great catch", "NTA.  She's deflecting and gaslighting you.  She has no ground to stand on.  Your concerns are perfectly reasonable.", "NTA but...\n\n>She said I was being unfair and that I shouldn't have expected her to pay for the food.\n\nIf this is the precedent your partner wants to set than next time you order food be sure to ask her to send you her portion of the payment. I stand by my previous points but also IF your GF is setting the example it's not unreasonable to  reciprocate those expectations. \n\nY'all have terrible communication skills, clearly haven't discussed your expectations/needs/desires for your relationship, and you're probably too young/immature to be in a long term relationship, which is perfectly OK.\n\n>I live with my partner and I've started noticing that things don't really seem equal.\n\nYou and your GF are partners, not roommates, and being partners doesn't mean equal in all ways. Think of it like being part of a football team mate: some players are offensive, some are defensive, and some protect the goal. They do not contribute equally, they do not exert equal effort, but they are all equally important parts who contribute to the success of their team.  \nIf you treat your relationship as transactional or keep a mental score board you try to balance out you're setting yourself up for disappointment, resentment, and failure. Source: Been happily married for 20+ years, my partner is my best friend, and we love each other more now than ever before.", "NTA, me & my partner take it in turns to pay for take out to make it fair. Your not guilt tripping her, you were just letting her know that you thought she'd be paying seeing as you paid last time to make it fair. If she continues to say your guilt tripping her, leave it, then next time you get take out, tell her how much she owes you for her share.", "NTA, but your relationship is done. Once you start counting costs, it's on rocky ground. You're past that.", "NTA. You have a leech, not a gf. Dump her mooching ass.", "NTA\n\nIt's a red flag that the conversation never had a chance of being gentle and open, that it was shut down with hostility and accusations right away.", "NTA but if you choose to stay together you have to have a conversation on what you are willing to split vs \"gift\". Me and my BF split groceries in half but ordering out or restaurants (unless madly expensive) is always a gift with the understanding the other person gets it next time.\n\nIf you always split things 50/50 she might have thought the pizza was just a gift. Idk your girlfriend or you and I'm trying to offer an alternative to \"just break up either her\" so again if you are staying together have a conversation about take out/restaurants for going forward and stick to it.", "Did you get your burger?", "NTA if you offer to order food you pay doesn’t matter what your gender is.  If you both decide you don’t want to cook and want to order something then you decide how the order is going to be paid.  My kid and I would order and we would rotate who would pay.  Other times we would just pay for our portion of the order.  This was discussed before we ordered.  If I didn’t want to get something from the same place I would place my own order.  We would combine orders so we didn’t have to pay extra fees for a small order.\n\nGF seems happy to mooch of OP but doesn’t like it when he calls her out on it.  So I suggest from now on meals are Dutch, each pays for their own, this will alleviate  the problem.  It’s just common courtesy when living together to work out a fair system.", "NTA. Tell her that in that case, neither of you will pay for each other's food, and she can take the cost of the McDonald's out of what she owes you for the pizza", "So if you have feelings you're \"guilt tripping\" her and \"starting an argument\"? She sounds immature at best and toxic at worst, you sure she's worth it? If you think she is just make sure she knows that this is an *equal* partnership and from now on she will be paying for her own food, just like you have to pay for yours. If she spent too much and can't afford it, then I guess she can't afford to eat out. You shouldn't have to save your money to treat her if she's not willing to do the same. NTA and good luck.", "Go out by yourself for a while, perhaps a sit-down restaurant, and let her know when you may be back.", "ah yes the petty argument, the sign of a doomed relationship", "NTA. You are being taken advantage of if this is truly her viewpoint.", "NTA - That she won't even spend a tiny bit on you should tell you even more than her words.  I think it is interesting that she thinks you were starting an argument with her when you were trying to have a discussion. Is this how it is usually? It's her way or the highway? Make it the highway as you will always be paying and keeping your mouth shut otherwise.", "I hope you made yourself something incredible after this and didn’t share. It’s petty, but justified.", "NTA. You paid for pizza a few days ago so expecting her to pay for fast food when you have similar incomes isn't out of the blue especially since it was her idea. Is she a your money is y'alls money but her money is her money person? That's what this feels like.", "Stop paying for her food....  She can pay for her own, just like she wants you to pay for yours", "You spent $35 and she couldn't spend $5.  She's cheap.", "If I invite someone to eat/drink,... I don't expect them to pay, as it was me who invited them. The same goes the other way.   \nIt's true that sometimes when my gf invites me out to eat, I'll pay anyway (because I want to, not because she asks me to). But it was her idea and her proposal to do this, so she has no problem paying.  \nNext time when you order for both, demand money from her...I bet that she will be insulted why aren't you paying for her too.", "NTA - if make a point or asking for her share on any future purchases", "We are getting a snapshot here--in the example you give here--you are clearly NOT the AH.\n\nHowever, there could be extraneous reasons why she feels that you should pay for her meal and not pay for yours.  \nDoes she buy all/most of the groceries?  Does she do all/most of the cooking?\n\nDoes she have considerably less earnings and the majority of her earnings go to paying bills while you have a much larger \"fun\" fund.   All these things could contribute to a sense that she pays her way in a greater proportion via her income and her labor.  IF any of the above conditions exist, you may want to reconsider your stance.\n\nin all, I cannot truly assess if you are the AH or not.\n\nThat said, if you feel you are being treated unfairly, then do as she does and require the money for her share--before you order.  Whether or not that makes you the AH(see above) again is dependent on the circumstances\n\nHowever, Her method of discussion, seems not to be helpful and that definitely sucks(Tho it is possible again that since we are only seeing your side--her method may be because she feels she has NO choice but to respond the way she does--again we see too little to be sure).", "Unless you can deal with a cheapskate, you may want to rethink the relationship. Her turning the table & blaming you is a glimpse of how she responds to something she doesn't like.  \n\nNTA", "NTA Your GF is a mooch, but doesn't like it pointed out.", "Guilt tripping isn't the same as holding her accountable or communicating completely reasonable expectations. NTA she sucks.", "NTA. You want a partner, she wants an ATM.", "This may be unpopular but... NAH.   \n\n\nI can completely  understand feeling hurt or puzzled about how you doing something for your partner one day is done one way (you paid for first meal), but then there's a double standard when your partner does the same, the behaviour changes (she expected you to pay half).   \n\n\nIn my experience, this happens a lot because expectations are not communicated. Especially with money. Especially if the expectation is that everything else is 50/50.  \n\n\nI would suggest you talk to her about it, maybe even use this as a template: I felt (taken advantage of, hurt, angry or whatever) when you asked me to pay for half the meal, when last meal we ordered, I paid for it in full. I would like it if going forward we could pay for take out alternating (me one, you the next) or we split all our bills 50/50.", "NTA. She likely feels that the man should always pay for the meal, but like I don't understand that. I get so excited when I can afford to treat my husband (I'm a SAHM, running a small business part time for fun money). Don't get me wrong I love being treated to a nice meal too, but like, what happened to being happy doing something nice for others too?", "Nope. But from now on you know what kind of person she is when it comes to this and it's entirely on you if you choose to stay with her.", "Nta but stop buying her food. \n\nThis is also may be a what’s yours is mine and what’s mine is mine situation.", "NTA, \"Hey you still owe me for the pizza the other night! Take my part out of that and send me the rest.\"", "got the feeling that long term it is not a thing\n\nNTA", "NTA, she offered food, and it isn't an AH move to expect the same as you did.  In the future, if you want pizza, McD's, etc, and she wants some, ask for her to transfer the money.  Don't offer to pay, when she complains, just say \"I thought these were the ground rules you established.\"", "Don't buy for for her anymore either without letting her know how much she owes you.  NTA.", "He needs to stop paying for her things now. If she questions it, use the McD as the prime example", "[removed]", "[removed]", "[removed]", "This is a no-win situation because come next time and he does that, she'll accuse him of being petty lol.", "[removed]", "I don't think it was just \"pay for your share of the food\", to me it seemed more like \"I'm ordering food for you to pay all of it\".\n\nBut maybe I'm just reading into it what isn't really there (but is in sooo many other stories).", "This!", "Pizzas come in shareable sizes?", "This is the way !", "So funny since I currently have a friend like this lol... me treating her out doesnt sound as often as you treating your friend but same concept. I got her something from Tokyo (she asked) and I'm seeing/hoping she pays for lunch since I denied payment (lunch and the item from Tokyo would be about the same cost) if not, I'm gna possibly discontinue the friendship...we will see in 3 days  l o l", "He's not", "The ones with the lower score always say this lol", ">Let me get this right, you chose to cover pizza for your girlfriend even though you normally split things\n\nWe split things when we both decide to order out. I covered pizza because it was my idea to get food. \n\n\"You did give her a guilt trip \" Telling your partner how you feel isn't guilt tripping them", "So cranky", "So why do you think my girlfriend should not pay?", "Nice explanation", "Exactly. Start splitting meals with her, and if she asks about it tell her to stop guilt tripping you. NTA", "Or.. she's broke rn and didn't wnat to cover it", "This is not gaslighting. Look it up.", "Or at least someone willing to communicate... maybe she had no money rn, but op won't know because she's too immature to discuss.", "OP’s girlfriend.", "Then it’ll start a massive argument because he responds by saying, ‘oh so it’s ok for you to do it, but not me’ 😂", "Med maybe, large def, but if op orders the size they plan on eating by themselves, no.", "They do, but not equally.", "You say bills are split 50/50 - I am assuming now that you live together if you have joint bills?\n\nThis may be a good time to discuss opening up a joint account that you each contribute a set amount into each month - if you earn about the same, you could both contribute the same. All bills, groceries, household things like soap, toilet paper, cleaning products, new fridge etc. can come out of there. Have a credit card for that account that generates reward points and put everything on it then pay it off in full monthly. When going out for dinner, or picking up takeout for both of you - the joint account pays. Just consider it \"50% off everything!\"\n\nYou still have personal accounts, can use it for personal things like grabbing yourself lunch, buying your clothes or shoes, video games, crafting supplies, whatever, or even to treat each other once in a while with food/presents. If a breakup does occur, the joint account can be split 50/50 back into personal accounts - but this may avoid the whole \"tit for tat\" issue.\n\nI do think you are NTA in this case, but if this relationship is worth saving in your opinion, I feel like this may help the situation.", "Just split the food equally then too. I was in a similar spot as you and we just did 50/50 on food too, made these issues go away fast", "My boyfriend and I have been together for 4.5 years, living together for 3 years. After maybe the 3rd or 5th date, we discussed that we would handle restaurants and delivery by alternating who pays. I know people who split the bills in an app. Just have a discussion about it and set some ground rules. If you guys can't come to a solution that suits both of your preferences, you'll need to think about whether or not this relationship is right for you. Finances are an important part of relationships.", "Is she usually the one cooking or planning meals? Trying to wrap my head around where her entitlement is coming from here", "How are chores split?", "You’re not.", "If she is broke she shouldnt be ordering food in the first place and just expecting her bf to pay for it", "Then that’s a discussion she needs to have. Talk about things instead of flying into a rage", "What are you on about? All pizzas are personal sized pizzas if you just believe in yourself!", "What I have been lied to this whole time. I thought 1 pizza = one serving, I thought it was precut just so you didn't have to use a knife/fork to eat it, didn't realize it was to share the pizza. \n\nI owe soooo many people an apology and money for their hospital bill hand stab wounds.", "At least that would be a reason. I find it more annoying that she can't even say why she thinks she shouldn't pay, and keeps trying to flip the blame onto him. So manipulative.", "In which case she's TA.", "I had the same issue with a guy I was dating. (I was paying for food and dates almost always even though we were making the same amount, not living together) He started asking for crazy expensive gifts and expecting me to clean his home too.\n\nAppearantly he thought he was above my league and that was the least I can do to sweeten the deal.", "No I do the majority of the cooking", "some people are just that entitled. there doesn’t have to be a deeper meaning to everything", "Lol you suggest empathy, communication, and compromise and get down-voted. Reddit is wild", "This is the real reason they shouldn't be partners. As presented neither of them seem to have the necessary communication skills or maturity to create a successful relationship. \n\nThe conversation about who covers the cost of meals and how finances are managed should have happened WAY before moving in together.", "Same stance I took, until my Dr told me to stop believing in my self so much lol.", "🤣🤣🤣🤣🤣", "I feel like it grows out of the widely accepted view that men should pay for the first date, which then sets the tone for the relationship. I don't agree with this view, and it causes me considerable difficulty in my dating life tbh, but it seems to me that the majority of people still believe that the man should pay for the first date (for context I'm 38).", "It’s not that stupid. It’s how I grew up and I admit I had this mindset a bit. When you never see a woman pay, you don’t really think about it until it smacks you in the face. I was out off at first but now I like it.", "Yikes OP. I don’t think this is a partner.", "Yes. I’m aware. Which is why I asked if there could be anything, or if she’s just this entitled.", "Start including the cost of eating out.", "Get the Splitwise app and both just put everything you spend on that.", "Nobody is excusing her behavior. Most of us are trying to see her side of things and see why she may be acting that way. \nYou may not be aware of this but every action typically has a reason. Sometimes it's stress and sometimes it's because they suck. These things require some thought. \nJust because you think the behavior is inexcusable doesn't mean everyone agrees that it's not worth looking in to.", "i was thinking the exact same thing. This sub stresses me out sometimes! The overwhelming majority of the people who post on here should probably consider communicating their feelings with their partner before they post on reddit. SO MANY of these problems could be solved by them saying \"hey, I feel like maybe this dynamic in our relationship is unfair. What do you think?\"\n\nWhy is everyone's first thought \"You should never order food for her again and also you should break up because she doesn't care about you.\" That is SO toxic....", "It’s not always. It’s just that once the discussion goes into a particular direction, everyone piles on.\n\nIn this case, it doesn’t matter much. I’ve got karma to burn. Fuck the haters.", "Why do you say neither of them have the communication skills? OP seemed to explain himself clear enough.", "I understand where you're coming from, I've been there, now I think of it as whoever asks for the date pays for the date.  Of course, I've been married a long time so it's kind of a moot point now, lol.  However, my husband and I take turns paying for food - basically whoever decides to order food picks up the tab.  We have an allowance system for spending money, we each get the same amount each week (even though he makes significantly more than I do) and big expenditures are discussed and paid for out of our joint account.  It's worked for 30 years.", "You are right. But people these days don't even know where it is coming from. Women were either not working or had smaller salaries and it became some kind of standard that gentleman always pays. If couple's income is similar or man earns less they shouldn't pay everything in my opinion.  It is just difficult to change this especially these days when everything is gender war or militant lesbian feminist ideas.", "You’re", "You may not be aware of this, but that has nothing to do with the question “am I the asshole”. There is no justifiable “reason” to behave the way she did. You can act pretentious and pretend you know it all, but you don’t. None of us do. We can only go off of what was told. And what was told was that she was an inconsiderate, selfish individual. We don’t need to look into why that is, cause there’s no valid excuse for it, despite your insistence on there being one.", "THANK YOU!!! \n\njust because he treated once doesn't mean she owes him", "The \"whomever asked pays for the date\" take is also BS in my opinion, because in our culture it's men that are expected to pursue the women. I believe dates should be split 50/50 in the beginning, except for obvious exceptions (ie widely disparate income, if one person is between jobs, etc). The way you and your husband manage your finances sounds very balenced and fair to me, but it's hard to go from expecting one party to pay to the fully balenced situation, and navigating the in between time is hard. It seems much more reasonable to just start off balenced", "I can see why you’d think this, but I think you’re ignoring a major part of the conversation from a modern feminist/equality standpoint. Often when I see women demand for their man to pay more for things, it’s because she’s performing a lot of unequal, unpaid labor in the household. Despite working equal hours for less pay (pay gap is still a thing in many industries), women get home and have a second shift of childcare, chores, and the emotional labor of managing the household and social community.  This emotional labor includes things like managing children’s calendars, remembering relatives’ birthdays and events, making choices about the kinds of products used in the house, attending to the stocking of these products (“we’re almost out of toilet paper”), choosing healthy balanced meals, etc etc etc. the inequality of unpaid labor is why some women will demand men to step up in other areas. According to the UN, women do 2.5 times the amount of unpaid labor as men - even in developed countries where men will insist things are equal now: https://www.unwomen.org/en/news/in-focus/csw61/redistribute-unpaid-work. \n\nMaybe stop being reactive to modern feminists and listen and logically assess the content of their arguments?", "I totally agree, and the gender pay gap is very much a thing still. But it also gets unbelievably frustrating when you pay for a first date and literally don't even get a thank you.", "I want that job that sounds amazing \"free pizza if you close the pizza box after being done and carry it over to the trash\""]}