{"id": 29253, "submission_id": "17bgtp4", "title": "AITA for making a joke about my SIL", "selftext": "I (14F) have a sister in law (21F) who is pregnant. I have never met her when she wasn’t pregnant. I met her at her and my brother’s wedding and she didn’t like me at all. About a year later it is my birthday again. I have silly names in my phone for each of my family members. Hers happened to be ‘perpetually pregnant’ as she was already pregnant again. I didn’t mean for her to see it, but she took my phone at a family dinner and proceeded to say she was just checking the time. I let her, but then she started crying and screaming, saying why would I do that and I’m the worst person in the world. She left dinner and my brother went to check on her. He came back in after 20 minutes and said that they are leaving. About 2 days later and we still hadn’t heard from them. We got a call from them saying they never wanted see me again, and everytime my parents wanted to meet with them, i was supposed to stay outside or in a hotel. So, AITA for making a joke?", "created_utc": 1697714538, "permalink": "/r/AmItheAsshole/comments/17bgtp4/aita_for_making_a_joke_about_my_sil/", "score": 51, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I made a joke to my sister in law that caused her to want to never see me again.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA lmao that's funny. Crying and screaming at a kid for that is ridiculous, you're fourteen for Christs sake. You never meant for her to see it and you never called her that to her face.", "NTA, if all she wanted to check was the time, why was she going through your contacts? I feel sorry for your brother.", "NTA\n\nShe was snooping through your phone for sure. Idk why though. It's her fault she saw that hilarious contact name and both her and your brother are overreacting.", "NTA \n1. Why did she see what she was saved as in your phone if she was just checking the time?\n2. Losing it like that at a 14yo when you’re an adult is ridiculous \n3. It’s a funny nickname", "Your phone. You can label anyone how you like.\nI'm terrible with names usually. For some of my clients, their dog's names are their label (because I watch their dogs).", "SIL snooped. Tell them to go pound sand. They have no right to tell you you're excluded from family events. It's your family too.", "NTA, and if she's had back to back pregnancies, the nickname is accurate. It's also funny as hell. Maybe it's hormones. Maybe she just doesn't have a sense of humor. Who knows. \n\nBut to anyone wanting you to apologize, ask them how she saw your contact list if all she wanted was the time. Every phone I've ever had or seen has the time right on the lock screen and at the top of the regular screens. You don't even need to open the phone. You sure as hell don't need to open any apps! \n\nSo SIL found something by looking at private information without permission, and she's having a hissy fit? Nope, anything you find in those circumstances is your own fault.\n\nAlso, if your phone isn't locked with a password, or better yet, your fingerprint, do it NOW! If you aren't using it, get in the habit of shutting it down so it's locked. If someone makes a grab for it, all you should need to do is hit the power button to lock it.", "NTA I do the same thing! \n\nMy partner is Supreme Asshole, \nMy bestie is Evil One, \nMy sister is ButtCrack Nazi, \nMy nephew is EliTwin, \nMy ex's mom is Bonus Mom\n\nLol", "NTA...if you'd done it anywhere other than your personal phonebook there would be an issue.\n\nSorry not sorry to sil, going through a kids phone and having a temper tantrum at what you find is not acceptable. Imagine how she treats your sibling :\\\n\nPretty funny tbh", "NTA- better just stay away from her as requested. She may come around in time.", "Lmao definitely not they are over reacting", "Something's not adding up here. It takes literally two seconds to check the time-all she has to do is tap the screen. So why didn't you ask for the phone back immediately? How did she have enough time to open contacts and swipe through to find hers? And how did she know it was hers? Unless you click on them, contacts don't show the #s associated with them. So she had all that time before you asked for your phone back? Also, you don't have a lock on your phone?", "I giggled🤣 \nthat's very funny! \nI can see why she didn't like the name.. but it's just a joke\nand you're 14...", "LMAOOO wait for her children to start talking, they can be quite…blunt. If this is how she is handling this, she is in for a tough ride\nNTA", "NTA...She was looking through your phone which is your private property. I say let them go and never speak to them again. Actually you are lucky that they said they never want to speak to you. Because now in a few years you don't have to worry about them expecting you to babysit all the time. This could be good in the long run.", "So \"perpetually pregnant\"'s code for snooping in a 14-year-old's phone is : <checking for time>.\n\nAnd now \"PP\" (sounds like peepee..) wants said 14-year-old to remain outside or go to a hotel whenever PP and OP's parents want to meet up...\n\nAnd your brother is OK with that....\n\nNTA\n\nStart taking notes; when you're an adult you can turn this sh\\*t into a hell of a book...", "NTA  \nIt was kind of dumb but you're 14, that's what 14 year olds do.  \nShe had no business going through your phone. It's absurd for them to expect you to \"hide\" every time they wanted to visit with your parents.   \nYour brother and his wife are both AH's.", "NTA, totally a mind your own business thing, she was clearly snooping on your phone. \nMy running joke was naming my exs “person I dont like” after we broke up.", "NTA - People need to lighten up", "Why was she looking into your phone? Looking Time does not necessitate checking peoples contact info.", "The lady has learned two lessons. Peep not at keyholes, lest ye be vexed, and that what other people think of her is none of her business. NTA.", "Well, it’s pretty rude and a bit childish to put mean/silly nicknames (and yes, that IS a mean nickname, not a silly one) for people in your phone. But it IS your phone, not hers, and you ARE a child, so NTA.\n\nWhat do your parents say about the situation?", "NTA. This is a serious overreaction, and their demand that their 14 year old sister/sil stay in a hotel because she made a joke they didn't like is just bizarre.\n\nI'd apologize for making a joke that offended her, and now that you know that pregnancy is a touchy subject for her I'd avoid it (and change her name in your phone) but overall you're definitely not the one out of line here.", "yeah not very nice of you, but you are a teen, I think an apology should do it in this case. She's majorly overreacting, might be the hormonal imbalance contributing, but your brother should know better. + why the hell was she snooping, dying to know that one\n\nINFO did you ever mention this nickname habit to anyone ?", "NTA. Thats not anything offensive and the reaction is pretty extreme.", "NTA and that is a brilliant name for her lol. Tell them you are more mature at 14 than they are as grown adults!!!", "NTA. Thats hilarious btw and nothing to get offended about (fellow always pregnant woman since getting married). I feel like she was just looking for something to be upset about to pull this stunt about not wanting to see you - checking the time takes quick glance at the phone screen & she had to go through your contacts to find that. Good luck to your brother!", "Nta. I would ask her in a group chat with your brother and parents. Id ask her why she was going through your phone. Then I would say ur sprry for the joke but she wasnt intended to see if and you give joking nicknames to everyone in your contacts.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (14F) have a sister in law (21F) who is pregnant. I have never met her when she wasn’t pregnant. I met her at her and my brother’s wedding and she didn’t like me at all. About a year later it is my birthday again. I have silly names in my phone for each of my family members. Hers happened to be ‘perpetually pregnant’ as she was already pregnant again. I didn’t mean for her to see it, but she took my phone at a family dinner and proceeded to say she was just checking the time. I let her, but then she started crying and screaming, saying why would I do that and I’m the worst person in the world. She left dinner and my brother went to check on her. He came back in after 20 minutes and said that they are leaving. About 2 days later and we still hadn’t heard from them. We got a call from them saying they never wanted see me again, and everytime my parents wanted to meet with them, i was supposed to stay outside or in a hotel. So, AITA for making a joke?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. She had no business going through your phone. She was obviously looking for something to be offended at and voila some nice thin ice appeared.", "NTA - Your SIL needs to grow up. And what you call people in your phone is your own business. Her nosey ass shouldn't have been going through it anyway. \n\nI would say maybe extend an apology though just to try to keep down the family drama. But at the same time I'm petty so it would probably go something like this \"Hey SIL sorry that you snooped through my phone and found the name that I jokingly put in there for you. I have what I believe are funny nicknames in my phone for everyone and I'm sorry that yours seemed to offend you when you took my phone and went through it without my permission.\"", "Imagine being a grown ass adult and throwing a fit over what a 14 year old calls you in their phone. NTA", "Time to change her name to something about snooping. Nta, it takes a certain level of asshole to invade someone's privacy and get mad at what they find.", "NTA\n\n&#x200B;\n\nIgnore their drama. She was the AH for snooping through yoru phone. Never allow that, and protect your devices.", "At 14 all of my friends had funny names for people in their phone. Mine were all anime references. I can’t tell you how many people had spawn point or birth giver for their parents. And even weirder for their friends. It’s part of being a middle teen", ">For some of my clients, their dog's names are their label (because I watch their dogs).\n\nHonestly, this is how I have my neighbours on my phone. I don't remember the humans' names, but I will remember what the good pups are called!", ">I wouldn't apologize until SIL apologized for being rude for invading her privacy.", "Why should she apologize, SIL shouldn't have been snooping on her phone, WTF! I wouldn't apologize until SIL apologized for being rude for invading her privacy.", "Excellent question!!!!"]}