{"id": 29265, "submission_id": "17bs886", "title": "AITA for not supplying more vegan options at my wedding?", "selftext": "so i'm getting married in a few months, and my fiancé and I have been working tirelessly to plan our dream wedding. We've been trying to accommodate our guests' dietary preferences, including vegans, by offering not one, but two vegan menu options. However, one of our guests, my cousin (let's call her Lila), has become quite vocal about wanting more vegan choices, and it's causing a lot of drama.\n\nLila went vegan a year ago, and we respect her dietary choice. In addition to our regular wedding menu, we made sure to have a vegan main and a vegan dessert option, thinking that would be sufficient to cater to her needs. But she recently reached out to us, expressing her disappointment that we weren't offering more vegan dishes and insisting that she NEEDS to have a wider variety of options.\n\nNow, here's where I'm confused. We've already made considerable efforts to accommodate Lila's dietary needs, even though she's the only vegan attending. She's suggesting that we should add more vegan dishes to the menu, which would require significant changes and additional costs at this point. Our budget is already stretched, and we have limited time to make significant adjustments.\n\nWe don't want to be inconsiderate, but it feels like she's being unreasonable and demanding more than what's practical, given the circumstances. AITA for not providing more vegan options at my wedding when there are already two, or is Lila out of line for making this request at the last minute?\n\n\nUpdate:\n\nThank you for all your input, Reddit. Unfortunately, things have taken a rather unexpected turn. After the initial post, my cousin Lila, who also happens to be my Maid of Honor and has contributed to part of the wedding (not catering) , has become even more insistent about having more vegan options at the wedding. In fact, she dropped a bombshell on us.\n\nLila contacted us and said that if we don't provide a more extensive vegan menu, she won't attend the wedding at all and she expects a refund on what she helped pay for. She told us that we “care more about this stupid wedding than her” I am heartbroken and I’m thinking about giving in because of this.", "created_utc": 1697745945, "permalink": "/r/AmItheAsshole/comments/17bs886/aita_for_not_supplying_more_vegan_options_at_my/", "score": 72, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) should I have implemented more vegan options?\n2) I didn’t want to cause an argument so I didn’t respond to her latest message asking for an update\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Good news, you have one less person to feed at your wedding now. \n\nAnd no need to include a vegan potion now.\n\nNow that's some savings!\n\n😊\n\nIn all honesty though, NTA, it's YOUR wedding, you have already done enough to make her feel welcome, I don't mean to make her sound obnoxious but she is coming off as a tad ungrateful.", "I'm wondering if Lila is trying to use your wedding to push an agenda. \n\n >She's suggesting that we should add more vegan dishes to the menu, which would require significant changes and additional costs at this point.\n\n\"Lila, we are already towards the end of our budget and have included options for a vegan main dish and a vegan dessert.  If you want more options you are welcome to contribute to the budget.\" \n\nNTA", "How much food does she actually plan to eat at this point?\n\nShe's attending a wedding, not going to a restaurant for F's sake. Just tell her the catering is finalized and she's free to not attend if she finds this unbearable.\n\nIf she continues her fuss, please un-invite her as she would only sour the wedding with that attitude. You are already doing more than you have to to accommodate her.\n\nNTA", "NTA - what does she want, a menu?", "NTA\n\nIf she's the only vegan, then ask her what she wants and call Uber Eats.  Everyone else gets what you intended in the first place.  If she's not happy, then she doesn't know how to order for herself.", "NTA, but why is this even an issue for you?\n\nYou are already making a specific dish for her. Why not just ask her what she wants since she is the only vegan. Find out the meal she wants, have them make that meal, and be done with it. I'm not sure what wedding she's been to where she gets to pick and choose her meal at the wedding, but unless it's a buffet, that's not how it usually works. And even if you're having a buffet, you can have one dish made for her with whatever food she wants. Tell her you will order whatever specific meal she wants, but if she doesn't choose it now, she won't have anything. It likely won't cost you more than what you're already planning on spending.", "NTA you’ve done more than enough. Congratulations on your upcoming nuptials.", "NTA. Tell her that you're sorry that she can't attend your wedding.", "NTA  \nYou're being very accommodating to offer any vegan options at all. \n\nI eat a plant-based diet (minor difference from 'vegan') and unless it was my wedding, I'd be prepared to either A) take a cheat day and eat whatever I want, or B) just eat the side dishes and whatever available that fits my diet. \n\nShe could even bring a couple of vegan granola bars or something if she's worried about being too hungry. This is your day, not hers. She needs to just roll with it best she can.", "NTA - you mean to tell me that a vegan is trying to get everyone to eat vegan because they are so much better than everyone else?  You're pulling my chicken leg.\n\nYou've done enough and she is just grand standing.  You're good, OP.", "NTA. It’s your wedding you didn’t even need to invite her. You should not demand to “need” something at someone else’s happiest day. If 100% necessary, she should buy her own crap. Congratulations OP!", "NTA - you very kindly added a vegan option already. Most weddings so have been to have either 1 or 2 options for non-vegans…. That’s 2 if you’re lucky.\n\nLila is very much out of line. You only asked for her to attend, it’s not a demand or mandatory requirement. She can either attend with the options given or not. Personally I’d rescind her invitation, and if she is the only vegan, cancel the vegan option.", "NTA - Why should 1 person get more options than rest of us? Most weddings that are plated have a chicken, beef, fish and vegetarian options.", "NTA. \nSorry but I don’t even need to read what you wrote to know you’re not in the wrong. If someone has dietary restrictions then there’s no reason why they can’t bring their own special diet food or eat before the event! \n\nIf I was a vegan I wouldn’t expect anyone to supply vegan options. I’d know that vegan options are common and maybe I’d even deviate from being a vegan for one day and grow up and eat whatever you are nice enough to be serving! Or eat before arriving! \n\nPeople are just so entitled. The day is about you, it’s your wedding not theirs", "NTA. Tell her to pack a salad", "NTA\n\nIf the vegan option you have available is disgusting to her and she would never eat it, that's one thing. I imagine in that case you could change the offering to something more palatable and vegan. But if she just wants to cherry-pick from a wider variety of choices, she can get over herself. As long as there's something tasty for her to eat, what is the problem?", "NTA\nYou’re being very accommodating.\n\nI’m a vegetarian, and it’s pretty common for there to be only one vegetarian option, unless it’s maybe more of a buffet style where multiple dishes are offered. \n\nShe should graciously accept the vegan option and eat beforehand or after if she wants more variety.", "You’ve accommodated her need, she should be grateful. NTA.", "NTA she sounds like the kind of person who has already decided that whatever you do won't be good enough. Just say no and ask her to confirm whether she is coming or not in advance seeing as you've gone out of your way to provide multiple vegan items already for her benefit.", "NTA. You did your duty of telling her what is going to be on the menu in case she needs to pack extra to accommodate for her diet. If she wants more vegan options at your wedding, then she should at least offer to pay for it.", "NTA. Wedding food is expensive af. I insisted on having a vegan option because we both have family and friends that are. I cannot imagine criticizing somebody’s wedding catering/food options. How tasteless.", "NTA - she’s being an ass. 2 options is 1 more than people usually get. I have allergies and I usually only get provided one and I’m happy for the consideration and people adding to their expense instead of just having to eat bland salad. \n\nPs: even if she’d made the request 6 months ago she’d have been an ass, short of giving you the money for the extra options", "NTA— a vegan option— singular— is perfectly reasonable and generous. It is kind, rather expected but kind, to accommodate dietary restrictions such as vegan/veg/allergies so that everyone can eat something that won’t make them sick or uncomfortable. Almost every vegetarian or vegan I’ve known is gracious that they’ll eat anything so long as it fits that criteria. A wedding it’s similar etiquette to going to someone’s house for dinner— you’re not entitled to a variety of opinions.", "NTA\n\nShe has two options. That’s more than necessary imo. Some events just have a menu and you’re served what you’re served. Within restrictions, but still without options.", "you're nice to even allow a vegan into the building, and this post shows why i hold that view :-)\n\ntell her to put some fucking salad in a bag if she doesn't like it", "NTA.  She can go one meal without having a variety of choices.  You are being very generous for supplying one vegan meal for her.", "NTA you were nice enough to give her an option. She shouldn't demand MORE OPTIONS from you. That's entitled and ridiculous. It's you're wedding not hers. If she wants more options then send her the bill for more options.", "NTA Ask her sure ask her how much she is willing to spend for the options.", "NTA.  How many entrées is she going to have? At usual weddings, a guest gets one choice. At a buffet,  there would be a few. But hey, I like chicken.  Should I demand there be fried, grilled, baked AND Kiev just because I want more options?", "NTA. \nshe is an entitled person", "NTA.\n\nI'm a vegetarian myself, and can say from experience that it's actually common to have one option for vegetarians/vegans, unless a large number of the guests are veggie.   You made sure her dietary needs were accommodated, but it's not reasonable to expect you to incur an even larger cost to expand the menu even further.", "NTA.   She is only eating ONE meal.  Not a whole day's worth of food.  It is ONE plate, for a limited time event.  If she is still hungry, then do what everyone else does and eat more later.  It is not your job to feed her for a week.  Why does she need more than one meal for YOUR wedding?", "NTA. If it’s that serious for her than she can pay for the changes herself. She also potentially has the option of stepping out to grab something to eat or just going to the ceremony.", "NTA - Disinvite the cousin. Problem solved.", "I have seen the same vegetarian/vegan plate of pasta with boiled/roasted veggies at just about every catered event and fruit for dessert if they were lucky.  You have gone above and beyond. She has the invitation and knows what will be served. She can RSVP yes or no but you don’t owe her anything else. NTA", "NTA. I daresay there are vegans who'd be absolutely thrilled that you're offering a choice of two different entree options (lots of time there isn't even a vegan option, only vegetarian), so your cousin can chuff off.", "NTA\n\nFFS, most weddings have two choices for entree for *everyone*. I'd say \"no, but also fuck no, but also if you really really want this you pay up front *and* *immediately* the full cost of the additional options no negotiation\"\n\n&#x200B;\n\nOr just \"no\". It's easier and it's your wedding. She's being a guestzilla", "NTA. Unless it’s a buffet I’ve never been offered a wide range of options as a non-vegan without allergies. It’s usually just chicken or beef. I’m not a huge meat eater but I just deal. You know because it’s one freaking night and I’m an adult.", "Lila, i totally understand, if you want to just eat before you come, thats alright, we understand your frustration with the options afforded to you. \n\n&#x200B;\n\nyour wedding\n\nNTA", "NTA\n\nI am a lactose intolerant pescatarian, and it seems the list of what I can eat gets smaller every day.\n\nI would be delighted if you had one vegan option, and if it wasn’t to my liking, I’d eat before your wedding.", "info: how much money did you contribute towards your wedding?", "NTA. Tell her your are sorry but you have accommodated her as much as you can afford.  When she gave you money she didn’t say it was with strings. Remind her of what she said when she gave it to you.  If she pushes it tell her “you are upset over a meal and ending our friendship over a menu choice you’ve had for only one year.  Nice to know what your priorities are, Lila.”  Wash your hands of her and walk down that isle and get married and enjoy your wedding.", "“Dear cousin, its not your wedding so nobody gives a crap what you need” If she doesn’t like it she can stay home.", "NTA. It's a wedding, not a restaurant. Providing ONE vegan option is being accommodating to her needs. Providing two vegan options is considerate. Her wanting more than that is greedy. Unless she plans to fork out the money for catering, she should be happy with what she gets. It's a single event, she can survive without having a full menu available to her. If she's that butthurt about it, she can pack a lunch for herself.", "NTA. My vegan SIL had one vegan dinner option for her wedding, so I would assume she found that to be sufficient as she planned the wedding.", "Why are you bending over backwards for a selfish person? Get her a meal she can enjoy, and if she's not happy, she can skip the event. NTA", "NTA. \n\nDo not engage in this conversation anymore. I am fully of the belief that events with food should take in to account the dietary restrictions of guests, but if everyone has ONE thing they can eat (like a substantial thing) they can shut the F up. I've been to weddings where all the food is spicy and I don't like spice- I eat what I can, I smile, I get fast food on the way home. I've been to weddings where there is one vegan option, and I've been to weddings where all the food is shit so no one has a good meal. The point of going to a wedding is not to get a free meal, it is to celebrate the union of two people. \n\nTell Lila- \"there are two vegan options for you, I look forward to seeing you at the wedding\" and then simply do not respond to anything else. If she brings it up face to face, just look her in the eye and say \"come or don't come, I'm not having this conversation anymore\" and literally walk away. And continue to walk away from any conversation about the menu. This is someone making an event about them, and the best way to stop it is to not engage. Laugh it off with a brief \"oh there's a vegan option\" to anyone who asks and change the subject.", "Nta - she’s trying to control the narrative here. You have made accommodation for her and this isn’t a restaurant, it’s a wedding. Just be firm and tell her you’ve made all the concessions you’re going to make for her and when/if she gets married, she can have an all vegan wedding. When it comes down to it, she doesn’t have to attend.", "Lila sounds like the most entitled, self-centered jerk to ever jerk. She is the reason why people poke fun at vegans to begin with...how many options does she need? How much is she planning on eating? If its that much of a problem she should bring her own food. Why have multiple options if she is the only one eating it? That would just be a waste of food unless she consumes all of it.\n\nI have seen several posts where someone who is vegan holds an event and invites non-vegans, but doesn't provide any options that have animal product in them, but if a non-vegan holds an event they are the devil if they don't provide any vegan options.  Like where is this sense of entitlement from?\n\n&#x200B;\n\nEDIT: \" She told us that we “\"care more about this stupid wedding than her\".\" Its YOUR wedding, this sounds more like \"why cant your big day be about me\". If you didn't care at all you wouldn't provide a vegan option to begin with.", "What specific options is she asking for?  Is this a buffet or a sit down meal with preplated food?", "NTA. Though I think you might need to have a sensitive conversation with Lila about finances. Where you ask if she needs the money back - and if she says yes, I would try to return what you can. \n\nSometimes in life we want to be generous, but we get an unexpected bill or misfortune and can't afford it. I worry this could be something like that - in which case Lila will just keep finding excuses to get what she paid back. \n\nIf this is the issue, and you have a conversation about it, you might be able to find a decent compromise where you return some money and maybe get to keep some. Rather than the current situation where Lila just keeps nitpicking until you return the money.\n\nThere's also a separate conversation to be had about the menu. Does Lila, specifically, want something else to eat at the wedding? Is it that she truly wants more options, or is she just trying not to sound petty that she doesn't like the option you've selected.\n\nAlso... Does the vegan option contain anything that has alcohol in it? Like white wine in risotto? Or rum in cake? If there's any chance she could be pregnant I would just look out for that. Cooking burns off a lot of alcohol but typically not 100%. Don't ask about this!! Just a consideration. \n\nShe's the only vegan guest, so if she's not happy with the options it's probably more straightforward for you to amend her order or switch options than to expand the entire menu.\n\nFinally, does she not want to be MoH? If it's become too much of a burden, this could be an attempt to quit. So find out if she needs to take a break, or become a regular guest, or can't come anymore. \n\nIf she doubles down and insists you either offer more vegan options or refund her then it's up to you. I would consider refunding just to not have it hanging over me. But either way, make sure the cost to refund her would be more than the cost to pay for additional options - otherwise you're just robbing Peter to pay Paul.", "After reading your update, here's what I would do. Ask the catering company  for a quote on how much more it'll be to add more vegan dishes to the menu. After that, send Lila the bill. Considering she's the only vegan, and she's adamant about having more options (even though you were nice enough to give her a dish and a dessert), she can foot the bill for making a change in the menu this late after creating a menu.", "NTA\n\nI am a vegan and have been for going on a decade. One vegan option for each course is great. Some vegans can't eat certain vegan foods due to health reasons (allergies/intolerances) but if they told you in time you could try to find one vegan option that works for all vegans (in this case just Lila). You were considerate enough to find a vegan option, Lila should be appreciative.\n\nI would just message her back: \"Hi, sorry you are not happy with the vegan option we arranged for you. You are the only vegan attending our wedding and we have specifically included a vegan main and a vegan desert just for your benefit as no one else requested a vegan option. If you do not like these options, you are welcome to bring your own meal and we can request the caterer that they heat up your food in a microwave, if you prefer that over the vegan options available at the wedding. You are also welcome to order vegan food in and have it delivered to the venue.\"\n\nBTW: If you have a vegan main and a vegan desert, you have ONE vegan option, NOT two. Saying 'two vegan options' suggests there are two vegan options PER COURSE.", "Of course OP fails to mention in the original post that this person was helping PAY for the wedding. If you accept money from someone that entitles them to a little more consideration. \n\nYTA for taking her money and not mentioning that crucial bit of info when asking for judgement.", "Was NTA until the edit. If she contributed a significant amount (doesn't matter if it was \"for catering\"), then yeah feed her whatever she wants.", "YTA - if she is helping pay for the wedding and is the only vegan, just let her chose what vegan option for entree and dessert that she likes. That way she doesn't need multiple options, she will have the thing she likes for sure.   \n\n\nBut also, why is she helping pay? I'm so confused...", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nso i'm getting married in a few months, and my fiancé and I have been working tirelessly to plan our dream wedding. We've been trying to accommodate our guests' dietary preferences, including vegans, by offering not one, but two vegan menu options. However, one of our guests, my cousin (let's call her Lila), has become quite vocal about wanting more vegan choices, and it's causing a lot of drama.\n\nLila went vegan a year ago, and we respect her dietary choice. In addition to our regular wedding menu, we made sure to have a vegan main and a vegan dessert option, thinking that would be sufficient to cater to her needs. But she recently reached out to us, expressing her disappointment that we weren't offering more vegan dishes and insisting that she NEEDS to have a wider variety of options.\n\nNow, here's where I'm confused. We've already made considerable efforts to accommodate Lila's dietary needs, even though she's the only vegan attending. She's suggesting that we should add more vegan dishes to the menu, which would require significant changes and additional costs at this point. Our budget is already stretched, and we have limited time to make significant adjustments.\n\nWe don't want to be inconsiderate, but it feels like she's being unreasonable and demanding more than what's practical, given the circumstances. AITA for not providing more vegan options at my wedding when there are already two, or is Lila out of line for making this request at the last minute?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You're being more than accommodating. Maybe check with your mom or aunt — since Lila's being unreasonable — to see if it's something she absolutely loathes? I always double check with the catering staff that they were actually serving me a vegan dish, but I would never say a word if it isn't something I like ¯\\\\\\_(ツ)\\_/¯ \n\nThis is your reminder to not share the menu ahead of time :/", "NTA.. You have 2 vegan meal options with only 1 vegan attending? Wow. I'm celiac, if someone offers me a safe meal I am nothing but greatful. Usually, I eat first so I am not hungry, then I can enjoy the salad or sides that are safe.", "NTA- This is why no one likes vegans or invites them to places. In fact it might just be easier and more cost effective to uninvite your vegan \"friend\".", "NTA, tell her to Uber Eats something and give her a $10 gift certificate to Uber Eats LOL", "NTA your wedding, your money, your choices. Would it make a difference if one of the other guests said they didn't like your food choices, would it matter? For example, let's say you offered Steak, Chicken, or Filet of Sole. Auntie Ruthie says she does not like any of those and would you please offer more choices? Would you? If the answer is no, then you're NTA. She Vegan girl) is being an entitled brat. Best to tell her those are her choices or she could choose to fast.", "NTA.  You providing any vegan option at all is more than enough.  If she doesn’t like it, she can eat something else beforehand.   Don’t change a thing.", "Nta generally for special diets, they'd get a plate.  Like, the choices are chicken, beef, or vegetarian.", "One less mouth to feed. Don’t give in to her. It’s your wedding not hers.", "25 years a vegan and I have never pulled a stunt like this. You’re already serving a vegan main and desert? That’s awesome. NTA.", "NTA- you are  catering to her by having a vegan option. She doesn’t need more choice because it’s only for one day! One meal! Cut her loose.", "Nta in any way. It's your wedding not hers", "Enjoy your wedding without the drama that Lila will bring.\n\nNTA.", "NTA :D When it's about vegans - no matter what you do there's never enough. Cut your losses and refund her.", "She is absolutely 100% the asshole.  Plain and simple. \nI feel like she's trying to get out of being in the wedding at all and to get her money back and using the only having 2 vegan options as an excuse.   \nPersonally, since I'm not an ah, i don't expect people to cater to my diet.  If I can't/won't eat what's provided, I bring a snack for myself.  Because I'm not a selfish prick expecting others to pay a bunch of money just for my special food.", "As a vegetarian/occasional vegan, NTA. NTA a million times.\n\nWhat else does she go on about, that's what I want to know ... since her behavior is narcissistic enough thinking that everything should be about her, and she's not even a bride(zilla)...", "NTA \nif she's the only Vegan, then have her specify the dish she wants and that's all. Her request could be reasonable if there were quite a few with the same dietary needs, but multiple options are not needed for literally one person. \n\nIf she chooses to drop out over this then I would tell her she's choosing to forfeit what she put into the wedding to that point.", "NTA. Don’t give in. Why is she paying for your wedding? Can you not afford your wedding?", "NTA. Pretty much every wedding has like, two different meat options and then if you're lucky a vegetarian/vegan option. Like if everyone else is having starters then it would be nice of she had a starter option? But a main and pudding is plenty. Also I maintain it's good sense to have back up food on hand for any wedding you attend as a guest in case the portions are tiny/you don't like what you picked after all/it gets stolen by a giant seagull/as a nice midnight snack after the wedding if you're peckish. This has been my philosophy at every wedding I've ever been to with the exception of one of my friend because I know her and she has never let anyone go hungry in their lives and there was no way her caterers weren't going to make sure everyone was well fed and in the end I was lamenting how I didn't have a bigger stomach to eat more. But yeah. You've done plenty and she's being a dick", "Lila is a walking, talking, sanctimonious time bomb. If she attends the wedding there is an excellent chance that she will create of fuss of some sort, and it may have nothing to do with food. Accept her offer of un attending the wedding, and be glad you aren’t going to get a mushroom cloud of crazy. NTA", "Didn’t even read it NTA", "NTA\n\nAnd your update about her threat is insane.  I don't know how much she has contributed but if it was me, even if it was more than adding on extra menu options i'd still just reimburse her and cut her out of my life.", "She told you that you care more about YOUR WEDDING than HER DIET. What that means is she cares far more about herself than you on a day that is about you. NTA please just let her go away.", "Based on your edit, I don’t blame you for adding more vegan options, but it would probably be the end of my friendship after the wedding", "NTA. She's the only damn vegan at your wedding and you are providing her a vegan main and dessert option. Now she's trying to blackmail you into putting more vegan options in. I'm sorry if she cares more about making YOUR wedding about her but she is completely out of bounds and doesn't seem like a very good friend to me. I'd give her the money she spent back and tell her to take her vegan options as is or leave it as I will no be held hostage over my own wedding!", "NTA. Let her stay home and enjoy *your* wedding without all the theatrics.  Your cousin is a drama queen with major main character issues. It's a wedding.  Not even hers. You don't have to cater to her ridiculous demands.  In fact, you'd be a fool if you did.", "Most weddings have pretty limited non-vegan options. NTA", "\"She expects a refund\"\n\nIt's nice to expect things. I don't see how or why you should feel forced to give in, though. Did you have a written contract stating that her money was a loan, or contingent on X number of vegan options?", "NTA\n\nThis is a wedding, not a five star vegan restaurant. I remember the days of \"will you be having the chicken or the fish?\" Vegetarian options were rare. Now everyone expects vegan, gluten-free...", "NTA. Tell her she can have as many vegan options as she wants at her wedding, but this is not her wedding and she can shut the hell up.", "I am a vegan and I have been to numerous weddings. I have only been given one choice, vegan. It is always a surprise when I get my meal. All the meals have all been delicious.", "NTA.  I am a vegetarian, not a vegan.  I am great full when someone makes accommodations for me, but would never demand it.  \nAfter reading your update, if you want to accommodate her further, in addition to the options you already made for her, I would suggest having a veggie platter and hummus brought in for her.", "This is absolutely ridiculous. She sounds deranged.", "NTA\n\nMost weddings I’ve been to only have 2 meal options for everyone. \n\nSimply start saying “I’m sorry but this is what is being offered. We’ll understand if this means you won’t be attending.”", "NTA. Please polish your spine. As a vegetarian, you have provided her with an option, and it is Enough. She is a maid of Honor-zilla", "NTA. Providing a menu item that only one person will take advantage of is going beyond reasonable. It is YOUR WEDDING not hers. If she cannot make it thru one meal then she has other problems. Don't let her even try to hijack YOUR WEDDING.", "Oh, what a surprise, a vegan feels slighted somehow, and needs to make something all about them 🙄 (Apologies to all of the vegans who aren't self-centered attention-seekers.) \n\nNTA, Lila will just have to die mad, I guess.", "NTA. It’s a wedding, not a restaurant. My sister had 3 main meal options at the wedding. 1 fish, 1 vegetarian, 1 vegan. The vegan one was great and everyone seemed happy with their dishes. I think she’s being quite petty and I wonder if there’s something deeper going on with her but you should let her know how hurt you are by her behaviour and how much effort you’ve put in to make her happy. Explain you can’t afford more options. Maybe if she hears how saddened you are, she’ll reconsider.", "How many meals is she expecting to eat? You've provided an option. Grow a shiny spine and tell her to do one.  Its your wedding, not hers, so tell her she can choose not to attend if she's not happy with the food options. You've got more important things to think about,  like your husband and wedding.", "NTA, and Lila sounds horrible. Sorry she is trying to financially and emotionally manipulate you.", "Here is what I say:\n\n1. Kick her out of the wedding and pay her back.  You do not need thus drama.\n\n2. If #1 is not an option, go to a local grocery store and buy vegan food.  Make a BIG deal about having all this vegan food at a SINGLE SPECIAL table labeled Lila ONLY!!!!\n\nNTA.  The wedding IS about you.....NOT her.", "NTA. Lila is being a brat. You have already accommodated her wishes enough. If you need to enlist other family members to help her realize this.\n\nHow can you tell if somebody is vegan?  \nYou don't need to; they'll tell you.", "OP, do not give in. Lila is being a completely unreasonable AH. Is she planning on eating more than one meal? Your wedding is not the time or place for her vegan grandstanding. NTA", "I would write her a check and say buh bye", "What?  Who demands multiple choices at someone else’s wedding.  Even non-vegans accept that options tend to be limited at weddings. Sounds to me more like she’s wanting to force others into taking vegan options.  Let her skip out on the wedding.  If this is the stupid bill she wants to die on, she’s doesn’t really care about you or your wedding.", "NTA. It’s your wedding, not hers. One fewer person on the catering bill!\n\nWe made extra sure our whole menu was Kosher (foregoing the delicious bacon wrapped shrimp the caterer offered) because a decent portion of my husband’s family is Jewish. They pulled a no-show. I’m still salty a decade later. Those shrimp were GOOD.", "[removed]", "NTA gifts of money for weddings always have strings attached. Just let her drop out of the wedding, take back the invite, and pay her back the money she put into the wedding. She is acting nuts, and the fact she is making demands is insane and I'm sorry she is putting all this stress on you. It's not okay. Seems she only wanted to put money in so she could dictate the wedding.\nIt feels like she wants everyone to get vegan options, not just her, which doesn't make sense.\nAs ypur cousin and MOH, she shouldn't be threatening to drop out and make this about her. She has already left a bad taste in everyones mouth and has already dampened the mood about the wedding. I dont see your relationship with her coming back from this. If you give into her demands, it will just seem fake her being MOH at your wedding. Let her drop out to cease the drama. \n\nWeddings I've been to cater to dietary requirements. However, you still only get the one choice for vegans and vegetarians, even with the meat eaters. Chicken or beef and you don't even get to choose, the food is placed in front of you depending on where you are sitting.\nThe ive only been to one wedding where they let you pick one option of meal to return with your RSVP and one where there was a buffet.", "Your entitled, manipulative cousin is making YOUR day all about HER. Flip the script and tell her she cares more about food than celebrating your wedding. \nNTA.", "NO! NO! NO!  \nNTA in any possible way.  \nYour cousin is unbelievably self centered, demanding, rude and obnoxious. ONE person expecting multiple vegan options is absurd. You're accepting that this is somehow on you. She has shown you absolutely no regard and no respect. You're so concerned about her feelings you haven't stopped to realize how little respect she has shown to you and your fiancé.  \nThis wedding isn't about her. It's her job as MOH to shut up and make your life easier, not to cause drama and stress. If she wants to bow out let her. And don't return her money, you owe her nothing.", "NTA Your friend is being manipulative. There was always going to be a line in the sand. You should consider writing up an agreement to pay her back, follow through with the reimbursement, and go your separate ways.", "Reading the update is so sad, J genuinely would find another maid of honor and uninvited Lila at all. She doesn’t appreciate y’all, she doesn’t need to be there. Especially if she’s going all crazy over the “limited” vegan options when she should be grateful there’s some at all. NTA", "NTA her dropping out shows she thinks this day is more about her than you. Honestly this is such a gift. Don’t pay her back either since she’s the one dropping out. She may be bluffing too, stand firm and she if you call her bluff. And if not, you still come out on top by not having to deal with her.", "NTA. Don't give in to her unreasonable demands.", "NTA. Just give her the money back wish her well. Your wedding should not be about her.", "Lila cares more about the food than you or your wedding. This day is about you but she’s making it about what she eats. You’ve graciously provided a vegan option and it’s outrageous that she’s asking for more food. I was a vegetarian for ten years and never asked anyone to cater to what I wanted to eat because other people’s celebrations are about them, not my dietary restrictions.", "She can step outside and have access to the largest buffet in the world. How are people so self centered?", "Do not give in to her! Even after her ultimatum. She is trying to make your day about her and being very inconsiderate. Making sure there were thing she could eat when she decided to partake in a very restrictive diet is more than enough.\n\nIt sucks, but you clearly need to drop her from the wedding and pay her back, though she is showing her poor character by putting you in this position. People like this are why vegans get a lot of hate online. It's almost like if you treat people like shit, you get treated like shit.\n\nNTA.", "OMG. I’m vegetarian, mostly vegan and I never expect anyone to cater to me. If I know there won’t be anything I can eat I’ll bring something to snack on beforehand or just eat the vegetables that are offered. This is absurd. NTA", "NTA for the love of god what is wrong with this woman? I am vegan and am happy with one thing (as long as peppers are not involved). She needs to behave herself.", "One compromise would be to pick up a bunch of vegan food at a healthy food grocery store or restaurant and have it there at the reception. It doesn’t have to come from the caterer and it doesn’t have to feed a bunch of people. You can say “we are adding XYZ vegan items, that will be there for you during the reception.” Have someone pick up that stuff from Whole Foods on the way to the wedding or something like that. Otherwise I’ll tell you this, I have both a food allergy and diabetes, and I do not expect people to cater to me. I always bring my own food or eat ahead of time or something like that. She’s absolutely being unreasonable. She’s emotionally manipulating you. Do not refund any of her money and if she doesn’t wanna come let it be. She will learn that behavior does not get rewarded. Hopefully she’ll learn something good.", "I mean how many entrees does she plan to eat? If she is the only vegan she gets ALL the options: \"Lila, what would you like to eat at the wedding?\" \"Vegan extravaganza with extra cheese!\" \"Done, that will be our vegan option.\"  Any more than 1 option and it's not being eaten tbh.", "Nta.\n\n\nWell, you will get your money back, and you are hereby uninvited as it seems you care more about what YOU have to eat alone than the wedding and my day. As such, because of your entitlement, we want nothing more to do with you. \n\nIf anyone has anything to say, respond. \n\n\nWell, since you don't have the manners to get both sides. Because you think you have a right to interject yourself in something that does not involve you, you can just not come or have anything to do with us. To support someone making demands that they ALONE have multiple options to eat and make enough of a fuss, make demands. And threats when this wedding isn't about them. It shows you are not a friend or family, and I am glad to be rid of dead weight. \n\n.sorry, but don't give in. She is so in the wrong, and you will hate yourself and look back on your wedding with resentment of you allowing anyone to make you change your day. She isn't a friend. She isn't family she is an entitled brat.", "Why the heck are you heartbroken? If Lila wants to play victim then let her. If she does not want to go to your wedding then tell her she will be missed. This is YOUR wedding. NOT HER WEDDING. \n\nYou are not saying no Vegan options. You have two. Which is more than what most people would do. Why the heck are you catering everything to a single family member? \n\nTHIS IS YOUR WEDDING!!!! Stop with the theatrics. Stick up for yourself. Tell Lila that you will only have the two options. If she does not like it then too bad. Do not argue. Do not \"be heartbroken\".  Block her. Be done with her. \n\nShe contributed to the wedding? Give her the money back. She does not want to be a maid of honor? Then just say goodbye!!!!!", "NTA but I’m genuinely curious: how much money has she given you for your wedding?", "I would tell.Lila to pund sand and she is making the choice to leave the wedding and will forfeit any contribution. \nDon't negotiate with terrorists", "Why would you feel you need to give in to her now? She is being completely unreasonable and you need to let her walk away. This is your day and you do not need this drama NTA", "NTA. Don't give in. Pay back what she paid for, she thinks she now gets to control your wedding.", "NTA. Lila being MOH is a bigger deal than being just another guest. And even more reason to drop her from the wedding entirely!\n\n“Lila your requests are untenable, and your behaviour is unbecoming. You are hereby removed from duties as MOH and your presence at our wedding is no longer desired”", "NTA. If you can, refund whatever she paid and forget about her. What a jerk", "NTA and don’t give her a dime.", "NTA but Lila sure is!  Look at what adding ANOTHER vegan option would be and tell her \n“Lila it will be another $20per guest (or whatever) to offer x as a third option.  We do not have the money for this!”   Is there a salad that can be served undressed?  Maybe have a vegan dressing available?  That would be another option.  Most people only get one choice unless it’s a buffet.  Why does she need two?", "In life, you provide your boundaries (We will not be changing the menu).  Others get to decide their responses to your boundaries. You have no control over how they react. Only how you react (We will not be changing the menu or offering refunds, we’ll miss you). \n\nI can’t imagine at this point having such a person at my wedding, much less in my wedding, and absolutely not the MOH.  You may well have dodged a wedding-day-drama-bullet here. \n\nI would accept her statement at face value, no drama, and get myself a new MOH, STAT. \n\nShort answers, (We took you at your word when you resigned), on repeat, (We took you at your word when you resigned) to everyone, (she resigned as MOH, Alice has taken her place) and do not converse about it beyond that. To anyone. They can’t create drama if you refuse to participate. Go do your wedding your way. Have a beautiful day.", "It’s not a restaurant, it’s a wedding,", "NTA- can you afford to refund what she has spent or do without her contribution? If it isn’t a huge amount, maybe you can make it up elsewhere.", "I would just be stoked you had an option for me lol", "Well, you’re under no legal or moral obligation to pay her back, so good luck to Lila.\nIt’s pretty reprehensible that she’s holding your wedding hostage.  She gets ONE vegan dish for herself and that’s that!", "You don’t have to give her the money back, it was a gift 🫣 She’s being selfish. It’s not her wedding and catering is expensive.", "NTA", "Don't be heartbroken. Be happy you didn't have this unsupportive and selfish person at your wedding.", "NTA give her money back and get on with your lives. Weddings bring out the absolute worst in people.", "As a vegetarian, I would say you have gone above and beyond. I am usually appreciative of people just having plenty of sides I can choose from. The fact that you made not one but two meal choices is incredibly generous.", "NTA for this issue. But why is she contributing to your wedding?", "When people show you their true colors, do yourself a favor, and pay attention", "I've been a vegetarian since 1996. You just make it work. She's a selfish dick TBH", "Ask your caterer if you can make an exception for outside food, grab her some take out form a restaurant and ask them to serve that to her, and remove her from being your MoH. She doesn't deserve it after what she's putting you through.", "NTA. As many have said, she seems to be trying to make a statement and coerce others into her choices. I would ask her directly if this is the point she is trying to make. If she claims it is only for her benefit, you could offer to have some home-made options just for her. I offer that as a solution only because she helped contribute financially to the wedding and she’s your MOH, so clearly she’s really important to you. (However, she’s being an AH and a pain, so you may want to rethink your relationship with her.)", "NTA. I have been keto for 5 years and people have made sure there is suitable food for me at events but i have never asked or expected it. To have a choice and she still whines is ungrateful.", "That is ridiculous. Normally there are two meal options to pick from. The fact that you’re giving two menu options and a dessert is amazing. She needs to pull her head out of her ass. You’ve gone over and above for this person. \n\nNTA", "A friend who would blackball you is no friend.", "You were already extremely kind in providing a menu option (including dessert!) for her. I would be so flattered if my friends did this. Whether it was vegan, kosher, halal, etc. She is being weirdly selfish for an event that she is attending, trying to make it HER event. NTA of course.", "I’d have a special separate plate of vegan snacks at her seat, go through with the wedding with as little stress as possible and then never talk to her again. But that’s just me. Sorry to hear this, wedding guests are so stressful sometimes it’s terrible", "NTA and after your edit: Don´t give in to her. She is beyond selfish, do you even want someone like that at your wedding? She already had food catered to her. Give her a finger and she will take the whole hand.", "Don't give in to a juvenile tantrum.  Tell her you'll happily return her money when you can. You were kind enough to even put a vegan entree and desert. Unfortunately many people who go vegan seem to grow a stick up their ass because they feel special.", "How many meals was she planning to eat?", "NTA. Cya Lila! It’s your day not hers. Get rid of her and anyone else that becomes toxic mold on your special day.", "Perhaps allow her to choose the one vegan option that will be available for main and dessert….but don’t budge on expanding the number of options available…..that being said, she’s behaving like an entitled monster….I know many vegan peeps and they are decent, kind, fair humans and would be appalled at her entitled ways. They are always very appreciative if someone is kind enough to organise a single vegan option at a function that is mostly made up of  omnivores", "NTA - She's the ONLY vegan and you're shelling out the money to have that as an option. She should be thrilled. My husband is vegan and he feels lucky/loved when someone takes that into consideration in group events. Weddings are hella expensive. Tell her if she wants more options she needs to pay for them.\n\nAnd let her know that there were originally no strings attached to the financial contribution she already gave, and you're hurt that she's now adding strings to try and get her way in YOUR wedding. This is the ONE DAY where it's not about her, it's about you. If she loves you she'll realize that.", "NTA Lila sounds very self-centered and rude. I just had a wedding in September we had mashed potatoes, green beans, pork, ham, corn, rolls, sweet tea, un-sweet tea and lemonade this might seem rude but I was putting enough money into the wedding that if someone complained about my food options just dont come to the wedding at all, I don't care (which nobody ended up complaining). It's your wedding you're not technically required to feed your guests. Also It's not about Lila it's about you and your partner's marriage. It's not \"Lila's wedding\" it's yall's. It's very irritating when someone takes a day that's supposed to be dedicated to someone else and makes it about them.", "Get a new MoH. In all honesty - “Lila” has a choice, she can choose to eat what she’s offered or not. \n\nNot sure if this is possible, but if she wants a “choice”, ask her what she wants and make that the vegan option. No other options need to be provided.\n\nIf she’s still pushing, tell her to stop milking her agenda. \n\nWatched something earlier, vegetarians are getting fed up of having meat - or vegan. No eggs, cheese, dairy, etc. \n\nDidn’t realise gifts to family are conditional - particularly if not mentioned at the start. Either tell her to swivel, or if things need to be dialled back, tell them why.", "NTA, please tell her to go eff herself", "NTA.  Lila is absolutely TA.  You've made accommodations and considered her.  She's the ONLY vegan?  At this point I'd tell her to pack her own meal.  She's being ridiculous.", "NTA. Don't give in. This person doesn't deserve to be your maid of honor. You ARE supposed to care more about the wedding than her, she is not the main person in this event. If she doesn't understand this now, imagine on the wedding day.", "I’m absolutely not suggesting you should compromise because she’s so out of line, I’m just thinking to save your heartache in the edit, if she’s the only vegan can you just ask her what she wants for the main and dessert? She gets her own bespoke meal then. It’s a wedding not a restaurant so she doesn’t need a tonne of options on the day obviously, she can just pick her favourite meal ahead of time. Any omnivore is free to order the same thing if they fancy but there doesn’t need to be options.", "I've never tried a vegan potion before. How do they taste.\n\nI hear potions in general can be kind of weird", "No need to make her sound obnoxious - she is obnoxious. This is clearly not about the food at all - she’s clearly jealous.", "Would it cost more to pay her back or to change the menu? Either way, I’d say don’t change the menu. Unless her added financial assistance came with the caveat that she has a say in the catering, you don’t owe her anything back. It would be a gift and not stand up in court. \n\nShe’s entirely out of line here. It’s your wedding, OP. She’s not being a very good maid of honor with this attitude", ">Now that's some savings!\n\nIt might not be - OP, INFO: \"she expects a refund on what she helped pay for\". What did Lila pay for?", "NTA, how old is ‘Lila’ ? It sounds like she is young and hasn’t the faintest idea how a wedding reception menu works. It’s not a restaurant. I would gently educate her that it’s not feasible. Should your catering service allow, I would also invite her to bring her own food for herself.", "Whoever heard of a vegan with an agenda? Vegans abhor talking about being vegan and never try to convince non-vegans to change their ways.\n\n/sarcasm", "Yeah. More than I’ve ever seen at a wedding.  Even if there were additional options, she can only pick one!  And she’s the only vegan too…I’d say OP has gone above and beyond.", "Vegetarian isn't necessarily vegan, though.", "Actually I’ve generally seen two, maybe three…chicken or beef not both, fish and a vegetarian.  I’ve never seen more than one vegetarian, or vegan, choice and others are only getting two choices.", "No shit I have a ton of food allergies. It’s my responsibility to feed me.", "Lmao dead. True Tho, it’s not your problem and it’s very accommodating to add even a single special dish for ONE person.", "Ahahaha I’m vegan and find this hilarious as literally I can’t argue, so many wouldn’t be able to see why Lila is in the wrong \n\nIt’s one meal, on one day she will survive just fine", "Seriously. I'd be tempted to tell her that since cows are herbivores, the steak she's getting is vegan, as is the butter on the potatoes.", "This is a really good idea. Get the quote and show her the price increase. She may well hate the other vegan options the caterers can come up with on such short notice and back down. It’s not like non-vegan guests get to customize their plates, aside from choosing the usual “Chicken, Fish, or Steak,” and noting any dietary restrictions (within reason, i.e., allergies). \n\nNTA - I have a vegan in law and have bent over backwards trying to be accommodating but it’s never enough.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Lol \n\nI believe they taste ok, just less tasty than meat based potions... Oh and with more sadness.\n\n/s", "Sure you have. It's called eating your vegetables.", "A lot of weddings only have one or two options *at all*. Asking for more than enough food that she’s able to eat is away pretty entitled.", "She wants to try and recruit more vegans.", "at least you have a medical condition, i met a lot of histronic vegans who'd use the choice as an excuse to skip meals. usually in parallel with not understanding that if your depression/anxiety stem from not getting to be a movie star just because you signed up to be an extra over and over it's not the same as being sad you had a death in the family, it's just narcissism", "Same. I'm impressed if I can eat anything at a wedding.", "It's okay if the joke went over your head, but maybe you should work on your reading comprehension or get glasses. The original comment had a typo and said \"vegan potion\" not portion. Hence the joke about potions, as in witches potions.", "Agreed. That’s why I am wondering if “Lili” doesn’t know if this and is a teenager/young adult", "thats what I was thinking - any wedding i’ve been to had one option for everyone and then an option for allergies or whatever else.", "That’s what I was thinking- most weddings I’ve been too there’s no choice at all. You get what you’re given or there’s like steak or fish to choose from", "Yeah that sounds like a mess. Vegans are like everyone else some are super cool some are awful. *We are many parts we are all one body someone has to be the AH*", "I usually correct typos in my head since so many people online can't type or spell worth sh*t.", "Please I'd love to meet one of the cool ones.", "I’ve met plenty but they’re usually vegan for medical reasons. Anti meat ppl are iron pill addled borderlines usually"]}