{"id": 29304, "submission_id": "17cb4pp", "title": "AITA for telling my girlfriend I don't want her to come camping with me", "selftext": "My girlfriend is real homebody and she doesn't really enjoy doing outdoor activities often. So every other week or so I like to take the weekend to go camping on my own cause there are some pretty great views to see where we live. So I usually head out around Saturday morning and drive a few hours out to a campsite and spend the night camping and ride my dirt-bike down some trails the next day and come back home around 5-6 the next day.\n\n  \nSo this weekend I was packing my bags to head out for Saturday and my girlfriend asked me what do you even do all the way out there. I told her what I do and she went \" That cant be all you do that seems so boring dont you go to a restaurant or something\". I told her nah thats really all I do when I head out and she didn't believe me so she wanted to tag along with me on this weekends trip.\n\n  \ni told her that I didn't want her to come with me since i know she wont enjoy herself and be miserable and also cause i like it cause it lets me disconnect and bringing people along with me kinda defeats the purpose. She got sad since she assumed that I was only doing it s=so taht i could spend time away from her which isnt true and refuses to believe me now.", "created_utc": 1697808011, "permalink": "/r/AmItheAsshole/comments/17cb4pp/aita_for_telling_my_girlfriend_i_dont_want_her_to/", "score": 1003, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > For telling my girlfriend i dont want her to come on my camping trips\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Eh, this is about sending a message. Bring her along for one trip. Tell her ahead of time that she can come with you, but you're not going to change your routine at all and show her your standard camping trip. Do exactly what you usually do regardless of if she complains and wants to do something else. If she complains, explain that you understand this is not what she enjoys, but you love it very much. You're not asking her to change her life to suit your ways, but she needs to be understanding of your hobbies and interests.\n\nNta as long as you turn this into a learning experience for her.", "Nah, I think if you focus on the fact you *think* she won't have fun on your camping trip, you're not having the right conversation. \n\nEvery second weekend is quite a lot.  It sounds like she's more upset at the lack of time together than anything else.   And the message I hear when you say \"Don't come you won't be happy\" is \"you're going to ruin it, I don't want to spend time with you *ever*\". When that's what the other person is hearing, its not much of stretch for that thought to go to 'This is about me not wanting you rather than what you'll be content with, and I would rather have you be miserable than compromise'. \n\nAnd I'm sure that's not the message you want to send. Or I hope its not - the fact you have asked this forum [twice already](https://old.reddit.com/r/AmItheAsshole/comments/17c7uce/aita_for_telling_my_girlfriend_i_dont_want_her_to/) because you didn't like when people pointed that out before is not a good sign. But when you're focused on trying to be 'right', you're not changing the message that people are hearing.", "NAH but you might not be compatible. I'd honestly be pretty upset if my husband went away every other weekend and didn't want me to come. You're not an asshole for wanting to spend time alone, but the amount seems excessive for someone in a relationship.", "Look at it from her perspective, she only sees you ever other weekend, and then when she offers to go with you so you can still be together, she gets told you would rather go alone. That’s going to sound like you just don’t want to spend time with her. \n\nI understand you want to take time just for you, but you are in a relationship now and you should also be as protective and proactive at carving out time for ‘us’. She needs to also feel like a priority in your life and you might have to compromise a little if she is important to you", "I know a lot of people who enjoy camping/hiking/etc. out in nature by themselves. Often these are introverted people who need time to recharge spending time on their own. That being said, your gf is trying to understand more about you and your interests. In this day and age, that’s hard to come by, lol. This is an opportunity to connect on something you love, or recognize this is something  that might end up being a dealbreaker. If she’s willing to try, she might find the importance of nature and the need to maintain and respect our environment. If I were you, I would plan a trip with her at a time that works for you, even if it is not the next trip. Do something easy, as that can help you both focus on enjoying it. If you plan biking on your own, let her know to bring a book, knitting, or something she enjoys doing while you’re gone. The more we understand our partner, the more successful our relationships can be. Sometimes however, this can also show that people are a mismatched fit. (Btw, if you never bring her, she will always wonder why and the mind is often more dangerous than reality.)", "That's kinda YTA to yourself and to her. \n\nTo her: it sounds like she genuinely wants to spend time with you. She only sees you every other weekend due to a *hobby* rather than a job. An awful lot of people wouldn't tolerate that. Instead of saying \"no, I don't want you there\", why not make clear that if she comes you're not going to change what you do there?\n\nTo yourself: you're pushing your girlfriend away.", "YTA\n\nYou go regularly, what's the harm bringing her for one trip? If she doesn't like it, she'll leave you to it. If she does, well you've just unlocked a cool new hobby for your partner, and it's something you can share together.\n\nYou can still take alone trips if that's important to you, by agreeing when and where. But deciding for your girlfriend that she won't like it and stopping her from joining you is a bit of a dick move. Let her figure that out for herself.", "YTA.  You’re going away every other weekend?  Do you even like your gf?", "YTA\n\nyou go every other weekend by yourself?\n\nand you wonder why your gf questions what you are doing?\n\nit sounds like you have a whole other life that she is not involved in and while you probably dont have a side chick, taking your gf out once and showing her what you do could make this all be benign in her mind.\n\nshe is a homebody you said, have her bring stuff to occupy her while you do your rides and make sure she packs food that she can eat as you have told her you dont go out to eat", "YTA - out of 52 weekends -26 of them you aren’t home. How would you feel if the situation was reversed. Spend more time at home or take her with you if you value your relationship.", "Think about it this way.  You are gone every other weekend, why so often?  I completely agree to alone time, it's important.  My boyfriend and mine's alone time is him going to the gym or me hanging out on the farm.  It's not for anything over night and usually not all day either.  \n\nDo you even like this person?  Because it sounds like you have her out of convenience when you want her, and you do your own thing the rest of the time.  I get she hates camping.  Maybe go camping one weekend a month and use the other weekend to do something she likes together.  Unless you aren't really that into her.  YTA", "I would let her come once and be miserable so she doesn’t think anything is going on and she never asks to go again lol", "YTA for not being able to read between the lines. She doesn't believe you which is not your fault but you are putting your relationship at real risk she thinks you are up to something fishy. You should let her come if she wants but still do your routine. If you take your dirtbike out for 2 hour rips tell her you are going for a rip and wont be back for a while and let her sit at camp doing whatever she wants. If in future she gets bored of that she won't come but you need to have open trip policy so she knows at any time she could last minute say she is coming and not think you are driving to the next city to go stay at your other girlfriends house. I know a lot of people will say bla bla trust bla bla trust well this is 2023 we all know that is a load of horse shit and lots of people have zero problems cheating and ya hopefully you can find that person you do trust unconditionally but she is obviously not at that spot with you so make her feel that way. To do that she can at any time come or give her your location and she can at any time show up and you will be there.", "YTA for not giving her a chance. You’ve told her what you do, so give her an option to try. Reiterate that you go to decompress. She is welcome to come but needs to be ready for sitting outside and everything and you aren’t willing to cut the trip short if she hates it. If she goes and doesn’t like it no worries, she doesn’t hasn’t to come again. If she complains the whole time the she is the A.H and needs to apologize and not bother you about camping in the future", "NTA. I’m so confused by these comments. Twice a month for ONE night is not a crazy amount. What is wrong with personal time? It doesn’t mean he doesn’t love his GF if he wants to do his own thing. Sure it would be nice to take her, but he shouldn’t have to. The fact that she can’t understand personal time and makes it about herself might mean they’re incompatible.", "YTA. Set expectations and bring her on one trip. Make a concession or two to your normal routine (ie, if she wants to watch one movie, do it with her! If she wants to bring the whole series of Dexter, leave her to her own [electronic, hehe] devices. Bring a boardgame or similar activity that you guys normally enjoy together)\n\nIf she enjoys herself, maybe see if there's a good rhythm for you guys. Like every 4th trip or something she could tag along", "YTA because you won't let her come with you even one time to check it out.", "NTA, my boyfriend loves camping, I do not. Boyfriend goes camping, I do whatever I feel like doing, we are both happy to have a weekend without each other. A relationship doesn't mean doing everything together.", "I think good, solid relationships should have time spent away from the partner/spouse. I've been with my wife for 20+ years and we definitely do not do everything together. I have my hobbies and she has her hobbies. \n\nThat said, I do think you should've brought her along so she can at least see what you do...and heck maybe she might be into some of the things.  I mean, just because you both go, again doesn't mean you have to spend every minute together...maybe while you're off on your bike, she can stay at the campsite and read or maybe she can take a short hike?  \n\n&#x200B;\n\nNTA", "Mild YTA. Let her try it at least once. It's ok to do your own thing and have your own hobby but I do have to say that camping once a fortnight does seem a lot!", "NAH. You aren't a bad guy for wanting to be alone. She isn't a bad guy for wanting to spend some time with you. \n\nSome advice though: relationships involve compromise. If you guys can't compromise with each other as well as not understanding each others boundaries, then you will struggle. Bring her along for a trip dude! If she brings you down, then maybe she isn't for you. If she loves it then you have found a new way to connect with your girlfriend! You go every other weekend, what is there to lose?", "NAH  She just wants to understand you. Maybe if you explain to her that you don't understand why she does some of the things she does but you love her just the same it would help. I have yet to understand why my husband finds cutting the lawn or ironing clothes to be relaxing. He still doesn't understand why I get a kick out of making bread and we've been married for 37 years. Sometimes partners just don't get why the other person does the things they do and that's okay. In fact, it's more than okay it's totally normal.", "Soft NTA - taking her just this once shouldnt be an issue if its a regular thing - by all means make sure that she understands that the solitary experience is an important part so you wont be taking her every time.", "Try camping with her, but arrange to arrive in separate cars so she can leave if she gets bored or uncomfortable.\n\nBecause if she wants to go in spite of not liking outdoor activities, she may just want to spend more time with you, or she may be wondering if you're seeing another girl when you're away for the weekends.  If the latter is at all correct, seeing you actually camping and hiking would set her mind at ease.", "NTA. Going to go against the grain here.  Sounds like they live together and see each other quite often.  I don't think there is anything wrong with wanting time apart, to recharge or whatever.  She also does not like the outdoors, she will not enjoy herself and will probably just make you miserable, I don't think we need to test that out.  You're not even gone for that long, maybe make plans to hang out with her when you get back on Sunday.", "NTA, thats your moment and she isnt doing it to have a time with you, she just want to see if it true what you said.", "Does she really only want to go because she doesn't believe you when you tell her what you do?", "I mean, she's right.  You're doing it to disconnect, so while it's not personal, you absolutely are \"doing it so you can spend time away from \\[her\\]\".\n\nHowever, what I think you meant is that you're not really aligned.  If you need to be away from everyone, which includes her, for 50% of the downtime that's available, every single month, and your SO isn't into that, it's going to be a rough relationship.\n\nETA: NAH, you just don't share hobbies.", "NTA, your reasoning is sound. But bringing her along once won't hurt. Maybe she is missing you on weekends.. She may like it. Or is that the fear? If you are really trying to get away from her and doing this , YTA.", "Clearly not compatible. I wouldn't put up with my partner heading out twice a month and refusing to include me, maybe compromise somehow.\n\nYTA.", "YTA. Don’t be in a relationship if you don’t actually want to be in a relationship.", "Every other week is excessive, imo. Especially when she’s willing to go and you don’t want her to.\n\nYTA", "Lol your girl was probably slightly suspicious and wondering if you're lying and your reaction was to be like \"babe no way you're coming with me. Im going there ALONE.\" Could have taken her with you and tried to make it a fun thing you do as a couple sometimes but instead opted for making her feel even more insecure. YTA in my opinion for not even trying to include her.", "Light YTA.\n\nJust take her on one trip to show her what it's all about. Show her what you like about camping, why all these things which are insignificant to her are significant to you. Does she have to come every time? No. And if she can't respect your desire to spend a bit of time to yourself, then maybe she's not for you. But I think you have to at least take her on one trip. If not, then suspicion will arise and that will cause more problems that one trip with her could probably avoid. Are you a massive AH? no. But I feel like if someone did this to me then I think I would probably feel similar to how your girlfriend feels.", "NTA, all she would do is complain, and just wait until she’s gotta shit in the woods, she will lose her mind. i would be thrilled if my husband went camping every other weekend. i’d have a blast at home alone with the dogs, spotify, and a lot of wine and weed.", "YTA\n\nShe asked to go with you one time. Just once. But you couldn’t deal with considering her request because it would disrupt your one time away camping. That’s selfish.", "Info why don't you try and plan a weekend of friendlier camping with her? A one time thing or a couple of times per year and you get to have the rest of the camping weekends for you. It might be worth a try.", "First of all, it kinda is true: you are doing it to spend time away from her, just not JUST HER.\n\nI'd also get her wanting to check out the things you like, but this is not the case. She wants to go because she doesn't believe you, not because she thinks it sounds fun. So NTA on not wanting her there.\n\nHowever, i do get her being frustrated that you choose to spend every other weekend away from her. That's a lot of your free time with yourself and not her. Maybe you appreciate your alone time, but she doesn't. It's not very compatible.", "By refusing you set off alarms with her. Take her with you once, who knows she just may enjoy it. You caused some unneeded drama here.", "NAH, but I think both of you need a change in perspective.  A very cool part of relationships is sharing hobbies and interests. \n\nI never liked videogames, but my bf downloaded some easy games so we can play together and I really enjoyed it. Likewise, I taught him how to sew and he had a blast. \n\nOf course it's fine to want to have some hobbies and time for yourself, but if your gf wants to go once, it could be cool to try. She doesn't have to go every time, but let her be a part of your life.\n\nAlso, you could adapt your weekend into something she would enjoy as well. Maybe plan a cool romantic camping meal she would like? \n\nBoth of you need to be able to adapt and be willing to approach it as something potentially fun. If you make no effort to introduce her to your life, or if she complains the whole time, you'll both be miserable. \n\nRemember joy is not a finite resource.", "I think YWBTA if you don't take her.  Let her see what you do or don't do, and if she doesn't like it, which is likely, she will probably not ask to go with you again.  I like to do solo camping a few times a year, and people also look at me weird and ask what I do all alone in the Desert/Mountains.  Luckily my wife enjoys occasional camping, so she knows I really do what I say I do.", "NAH but you did quite literally tell her that you do this to spend time away from her \" I like it cause it lets me disconnect and bringing people along with me kinda defeats the purpose\". There is no other way to take this sentence.", "Every other week? So you’re skipping every other Saturday night? Are you doing date nights on Friday? Are you spending time with her that’s actively dating? I think she may just be telling you she’d like more time together instead of you leaving her alone every other weekend. That’s a lot of time gone.", "YTA. So your girlfriend shares an every-other weekend visitation schedule with nature, and instead of complaining or trying to demand that you stop spending half your free time away from her, she nicely asks to sacrifice her comfort (as you said she doesn't like outdoor activities) in order to spend time with you.... and you were like \"lol, nah!\" 🤦🏼‍♀️ Dude, do you even like her?? Do you just want to be single? I think you should decide whether you value or her or want to let her go, because keeping her for when you don't have better plans ain't it.", "INFO: why are you with someone you repeatedly say you want time away from?", "NAH\n\nBut you are not compatible. You don't seem to like her very much.", "NAH - I think it's reasonable for you to take time every other weekend to decompress. If you were leaving her alone every single weekend I might feel differently. I also think it's reasonable for her to be curious and want to try going with you. \n\nI don't think springing it on you at the last second is the best way to handle it though. Ideally, I think she would have asked at least a few days ahead of time so you'd be expecting it and you'd actually have time to plan for how it could be enjoyable for both of you.\n\nIf she really wants to go, I'd offer to let her come with you the next time. Make an honest effort for it to be enjoyable for both of you. It might actually be something you both enjoy, or you might be right that she hates it and doesn't ask again.", "NTA. And even if you were spending some time away from her, this is nothing to take offence to. It is healthy to want to spend time alone no matter how much you love your partner and the other person should be understanding of it. Hopefully, she has some plans of her own too where she gets to spend time alone.", "NTA. Your trips also give you a break from talking, which you may not have considered as a side benefit you're getting. The opportunity for silence is what attracts some to silent retreats. Ask her if she would be cool with no talking.", "NTA\nYou are valuing the solo time, and that's reasonable.\n\nBut if she's expressing interest, pick a weekend when you can afford to cut it short, and let her come find out!\nRemind her to plan some quiet solo activities.... Bring a book, plan to go look for interesting plants/animals, sketch/paint or do some nature photography.\n\nIf she's miserable she won't do it again, but what happens if it turns out she loves it? And suddenly, if it's together, you can take longer trips.\n\nMaybe she wants to catch fish and make camp dinner while you're out riding.\n\nOr maybe she will say \"I *do not get it*, but thank you for not dragging me along.\"\n\n(Not instead of your solo retreats, but ALSO.)", "Have he bring her own car so she can leave when she wants to.", "YTA let her come for a trip or two. You do it so often what is the harm? 🤷‍♀️ prove to her this is what you do, maybe she’ll actually love it or she’ll hate it and not wish to go again. Are you concerned she will enjoy it and thus want to go regularly?", "YtA you could take her once", "I am going with YTA.\n\nYou've been doing this for how long?.. and you haven't thought just once that maybe she feels left out? And once she expresses her desire to tag along, you shoot her down?\n\nIDK - I feel like in a relationship you need to give and take. Let her come once. If she doesn't like it, she won't ever bother you again about it. If anything that would just reassure her that you're doing your 'boring' camping thing.", "Every other weekend? Why are y’all even together? Does spending only every other weekend together sound sustainable long term to you?", "Man, you're not a good bf. Unless you just really want this to be your alone time, you played this so wrong.\n\nWorst case scenario is she doesn't have a good time and you've \"wasted a weekend\" trying to accommodate her. In this case, she won't ask to come along again.\n\nBest case scenario, you preemptively anticipate what might make the experience comfortable for her, she has a great time and you two find a new activity you can do together.\n\nThere are many possible outcomes between those extremes.\n\nWhy is it so hard to just give it a chance with her?", "YTA. You go every other weekend. Spend some time with your girlfriend here and there. Bring her along once, she’ll hate it and won’t ask again.", "NAH necessarily. But you should be willing to at least bring her on one trip so she can see what it’s about, especially if you’re going that often.", "Try this.  \n\n“Camping is a hugely important part of my life.  I would LOVE it if you could  share it with me, but I’m afraid that if I take you with me you won’t make the effort to find the joy in the outdoors.  Do you want to try it, with the understanding that it’s a time to reconnect with nature and disconnect from the modern life?  “\n\nTake her with you.\n\nAs an outdoorsy person, I have no idea how you think you’re going to share your life long term with someone who doesn’t love it to some degree with you.  If you’re going to have kids do you expect to never take them camping or were you going to take them without her?\n\nNTA", "NTA. \n\nYou are doing it to get away from her. Not just her but she is some of what you are getting away from. The thing is that's fine. People need time to themselves some more than others. \n\nTo be honest I would be more worried that she suspects your doing something unscrupulous, and that was why she wanted to come with. Telling her you want to go anyway will likely not help suspicions if she has any.", "Nta. It's essential to a healthy relationship to be able to have different tastes and not force others to conform", "YTA\n\nYou go away every other weekend, for starters. \nAlso, the normal reaction in these situations would be to come up with an easy hike she can enjoy or that might at least not be completely miserable for her. Shorter, easier. \nIt seems like you are too self cantered and don’t even like your girlfriend tbh, since the thought didn’t even cross your mind \nAnd that’s what sane couples do. They try to compromise and make it work and then, if it fails, discuss how to split their time together and their alone time. They don’t make unilateral decisions). \n\nYou saying you want to disconnect and she would come in the way of that is just the cherry on top. You lack the emotional maturity to discuss boundaries for alone time. Couples can do their own things next to each other or separately, but at least they should AGREE to it. \n\nIn what would would your treatment of your girlfriend and the explanation ma you gave for not wanting her there wouldn’t make her feel awful? For crying out loud, people usually put on their best façade on AITA and the best you could come up with was “she’s a homebody”, “I told e I didn’t want her to come with me” “she won’t enjoy herself and will be miserable” basically told her having her there would defeat the purpose (=she’d ruin the fun). Not even trying to sugar coat it, are you?\n\nHas it even crossed your mind that maybe she wants to put an effort? Or maybe she doesn’t trust you and things you’re doing /other/ things behind her back?\n\n“She assumed that I was only doing it so that I could spend time away from her” why wouldn’t she think that? You gave two reasons for why you don’t want her and they boils down to “she’d be miserable/whiny” and “I want to be alone”. So yeah, it might not be the ONLY reason but it’s a pretty big one. \n\nAgain, it doesn’t sound like you hold them in high regard. Either grow up and start communicating better or set her free.\n\nETA: saw you posted it once already and deleted it and the only info you provided was “we already went camping once and she didn’t like it. She said it was probably just a bad experience and wanted to try again but I know she’ll hate it. \n1. Stop making decisions for her. \n2. You’re leaving out a lot since you apparently had more than one talk about it. \n3. The “that can’t be everything you do, surely you go to a restaurant” suddenly makes a lot less sense, since you said you already went camping once. So what is it? Is your gf suffering from memory loss? Or are you just incapable of having an adult discussion and sharing your feelings?", "i mean, she kinda is right that you are doing the camping to spend time away from her- you did say you enjoy camping because it allows you to disconnect from everything and from people. So she isnt entirely wrong.\n\nBut also, she wants to tag along. shes interested in seeing what you do. She also might be low key concerned that all your free time is being spent with someone that ISNT her.\n\nIts sweet that you dont want her to come because of wanting her to not be miserable but honestly, this is something she's going to have to learn the hard way. If she truly doesnt enjoy it, she wont ever ask to come with you again. Just let her go this one time to see what it is you do. And if she does end up enjoying herself, then you have a new nature buddy. And if she hates it, she'll never ask to go with you again. Either way, you win in the long run.\n\nmy verdict: NTA, but neither is she. But you might wanna reconsider and just let her join you this time.", "NTA. It's very healthy for couples to spend time apart as well as together. I used to do monthly solo camping trips, and my husband was always super supportive. It gave each of us time alone. \n\nI think the bigger issue here is that she doesn't believe you when you tell her what you're doing out there.", "YTA.\n\nStop trying to decide for her what she likes and doesn't like. Yes, you're probably right, but by preemptively deciding for her, you're not giving her the opportunity to learn or try something new. For all you know, it might end up being something she discovers she actually likes. Preparing ahead of time for a two person trip, being clear up front what the plan is, being clear up front that the plan will not change, and letting her tag along one time won't kill you. It will resolve the question in her mind of what happens and she'll stop asking about it.\n\nAnd who knows, if it turns out she actually enjoys it, maybe it will be something new for the two of you to do together in the future.", "NAH for this *particular* instance. \n\nYou *do* want spend time away from her; you said so yourself (\"it lets me disconnect and bringing people along with me kinda defeats the purpose\"). Not that there's anything *wrong* with that, but I'm surprised *you're* surprised that she's upset by it. \n\nHowever, since it's only every other weekend (according to your post, depending on what that \"or so\" really means), I don't think that's *too* many weekends to spend on your own. Others may disagree, which is why AITA isn't supposed to judge relationships. And if your girlfriend is the type that wants to spend all of her weekends with her boyfriend, don't be surprised if you're replaced. \n\nWhy not add an extra \"girlfriend\" camping trip to the roster? That is, you still camp by yourself every other weekend, but instead of spending the other weekends at home with her, only spend one at home with her, and the *other* other weekend, you take her camping. I expect she'll get bored and want to go back to the original arrangement.", "Nta - as someone who also hates camping, I do see what some people get out of it, so hey. More power to you.", "NTA, I'm 100% down for people doing things apart but every other weekend is a lot of weekends for her not to see you (50% of them!).  She probably just wants to spend quality time with you.  Especially if you both work full time, weekends aren't the same as the few hours after work.  Why not let her come and see if she enjoys it?  You never know, you two might have a really nice time together.\n\nMaybe say something like \"I genuinely thought you wouldn't have a good time, but okay let's give it a shot!\"  Try and turn it into something fun to do together.  If she doesn't like it you can go back to going by yourself next time, it's only one weekend.", "NTA \n\nEveryone needs some alone time so they can recharge and relax. This biweekly trip is your me time. \n\nShe isn’t trying to join your trips to see if she’ll enjoy camping (since she said it sounds boring) and if she does then it’s something that you guys can bond and enjoy together. \n\nBut her intentions are not so that at all. Her international are to fact check that you actually do the things you do on your trips and see proof that you actually enjoy camping. She can’t comprehend or believe that you or other people actually enjoy the outdoors. \n\nAlso she is assumption that you want time away from her specifically is wrong. You want time away from everything (her, family, work, city/suburb, etc.) \n\nI suggest trying to talk to her one more time before your trip and say something like, “The reason I have these trips are not about or associate with you in anyway specifically. I take these trips to have me time (compare it to her me time activity/routine). Also, I don’t appreciate you discrediting and wanting proof of my enjoyment for the outdoors because you don’t believe it’s enjoyable. I don’t want to go camping with someone who is going to question and analyze everything and complain about how much camping is boring.”\n\nMaybe you need to reevaluate this relationship because her fact checking that you actually like your hobbies and activities shows that she doesn’t believe you and only thinks that her values/idea of enjoyment are only right.", "NTA. It’s fine for couples to have activities that don’t include each other, and it can be healthy. Unfortunately, it sounds like your partner has a low self esteem and has gotten it stuck in her head that this is a sign that you don’t like her. \n\nI honestly can’t say if letting her come along once would get it out of her system, would be a disaster (with her complaining the entire time), or she might find out she would love it and you would lose your needed time alone.", "NTA, and if you were, it would be ok because everyone should have \"me\" time.  Time to decompress and get yourself together without being surrounded by people (if that is what you need).  It is not an insult. It is not a \"dig\" at her.  You just spend time doing something that she does not like to do.  Maybe she can pick up a hobby or something to do while you are gone camping.  Couples do not have to be joined at the hip 24/7.  It is OK to like to do separate things because you are, in fact, INDIVIDUAL people.", "NTA\nDon’t listen to the YTA comments. It is healthy and vital for people in relationships to have their own hobbies and interests. I didn’t bother buying my wife a Metallica ticket when I bought mine because I know she would not be interested at all.  She doesn’t invite me to her book club because she knows I would not be interested at all.  It’s also ok and healthy to want time alone and that should be respected.  Remember “absence makes the heart grow fonder” is very true.\n-happily married for 16 years", "NTA\nYou're a bit in the wrong too, it's an activity you do so often it's normal that your gf would want to come with you sometimes. But I say NTA because she didn't come to you saying \"idk if I will like it but I really wanna come with you because you love it and I want to experience that with you\", but \"ugh that seems boring as hell but still want to come so I can complain all weekend\". And I understand that you don't really want to bring her along with that attitude...", "ESH. Her for saying that your hobby is boring, you for making the decision for her. Maybe she would find the trip enjoyable.", "NTA, you have every right to want to do things by yourself. However, it means that you're never with her on the weekend, which few SO would be willing to accept. Also, I guess that she suspects that you're cheating on her.", "YTA. You couldn't let her tag along a single time? Come on.", "Despite other views, I will say NTA.  Your girlfriend wants to feel involved in your hobbies, but is not willing to sacrifice materialism.  Couples should spend time away from each other, making their bond stronger.  If not, then you're not truly independent.  This doesn't mean you can't sacrifice staying home some weekends to plan other activities with her.  It's all about communication and trust, brother.  And this is coming from a homebody myself.", "NTA. People are way too codependent. You can be a couple and have things that you do alone. I would go insane if I had someone tagging along to everything I do, especially during what is supposed be my \"me time\". Asking for effectively less than one day per week is not outrageous IMO. And the fact that she didn't believe you so had to come and see for herself whether you were lying or not is a bit wild. If she doesn't trust you that is a conversation to have, but doing the whole \"I need to go with to be sure\" is just over the line.", "YTA it’s worth letting her come once and decide for herself whether she likes it.", "Well soon you will be single, so you will enjoy all the weekends to yourself.", "I was with you until you said you wanted to get away and disconnect. That included her. I get wanting some alone time but it sounds like you do this all the time and exclude her. Wouldn’t it be nice once in a while to have her with you I’m not saying every time. Maybe once just to see how she would like it. I don’t understand it because I love camping and I would be very hurt if my partner would not allow me to come along.", "NTA, but you should bring her along once so she can find out for herself.", "Comments are just daft as predicted, NTA enjoy your time camping dude", "YTA.\n\n\nYou do this twice a month. Taking her with you once isn't going to ruin you.\nAlso you should ask her if she's unhappy with you spending so much of your spare time away from her. Because it sounds like she is.", "YTA, at the very least you could let her tag along once.  It seems like shes trying to take interest in what your doing. Sure, she could have said it nicer and not accused you of doing other things/calling you boring.    \n \n\nYou did say you go most weekends, so what the issue with letting her come once.  Either she enjoys it and you have a new camping buddy or she doesnt enjoy it, and probably doesnt come again.", "ESH- Your GF due to her insecurity. You because you won't admit that yes. You do go out to spend time away from her. Sure her and everyone else. But she is part of everyone else.\n\nThe question is, \"Why is this an issue suddenly?\"", "NTA\n\nIt’s your alone & connect with nature time.", "NTA \\~ If she wouldn't enjoy it , and only wants to go because she doesn't trust you, then it doesn't seem like taking her would be a good experience for either of you.  \n\n\nThat being said, she is right about you wanting to go to get time away from her...I mean if bringing people defeats the purpose. It may not be \"just\" her, but it includes her.", "She’s manipulating you. Tell her— she better brings her own car with you in case. If she doesn’t like outdoors, she can go home without you. 🤷", "NTA, I know that feeling of wanting to be alone and not worry about anyone, just enjoying the day.", "NTA\n\nTake her one time.  She will be miserable and make you feel miserable, too.\n\nThen dump her.", "I think you shouldn't listen to people on Reddit telling you how you're wife thinks. If you need to get away and have some unwinding time go, and in future just see if she fancies doing a more comfy camping trip as a separate thing together and you can slowly introduce her to the more real experience trip after trip, or at least find out she's not interested in the process.", "NTA but suck it up. This is what you do as a couple. Take her and she will hate it and never want to go again. You won’t get your usual break but it’s better then coming home to a GF who thinks your trying to get away from her or keeping secrets. Some people are a little more needy then others but you’ll get through it. Just take her this once. She just might surprise you.", "In going with the YTA group in this one\n\nShe's an adult. You don't get to just say \"oh you would like it\" and that's that. That's how you treat a child. You take her, do your normal thing, let her see what's up and maybe she gets more comfortable with doing outdoors stuff and is something else to bond over. She might also realize this isn't her bag, baby, and leave you alone about your future trips. Win either way. \n\nWith your approach you're going to deal with having to console her every time, defend yourself every time, and when you do finally give in you'll both resent each other and you've just done yourself and her to having a horrible time.", "I think YTA here. \n\nYou’re going on these trips every other week which is quite a lot. She’s curious about it, naturally. She said she wants to come along one time and you say no because you don’t think she’ll enjoy it. Maybe you’re right, but why not let her see for herself? I mean it’s not like this is a once a year thing that she could ruin for you. If she doesn’t like it, no big deal, then she knows and you can go back to being alone for your next trip. Or maybe she’ll end up enjoying it and this will end up being something you can enjoy together. \n\nI feel like you’re a bit of an AH here for just dismissing her all together.", "YTA, come on my dude, she wants to spend more time with you. You're going every other weekend. Take her with you. You might be surprised and she wounds up enjoying it.", "You're a bit of the asshole for just refusing. \n\nIf it was me, I would make the experience as nice as it could be for my partner without compromising what the experience is. I'm a big backpacker, and I definitely eased my ex into it through dump camping and short hikes rather than just jumping into my normal routine. Then she can decide if she enjoys that, and wants to do it with you more often. Or now understands this is your thing and she doesn't need to do it. \n\nAlso, her approach seems to reflect some underlying insecurity. Gotta solve them problem as well, and shutting her down on this isn't going to help", "You’re leaving half the weekends?", "Honestly I feel like since your car camping with some gear adjustments you might be able to make it pretty cozy, and dare I say, fun?", "She's going to keep being suspicious that someone can survive without interaction or amenities.\n\nBecause of this, she is going to escalate the pestering.\n\nDo it once, and you won't have to do it again.\n\nSubtle YTA for not making it easy on yourself be doing it once and getting it out of the way.", "Every other weekend? Wow-", "Jesus yta", "She wants to see it, show it to her.\n\nMake it boring so she doesn’t want to come again. I assume you really enjoy your “me time” out there.", "You're telling her exactly what you think of spending time with her. Enjoy losing her YTA", "Very gentle YTA.\n\nAssuming at least one of you has a regular Mon -Fri job, you are spending half of your available time off away from her.\n\nWhen she expressed wanting to not spend that time apart, you blew her off.\n\nIs it possible to bring her, and to slightly modify your usual activities to have a quiet weekend camping together, while also explaining what you usually do, and trying to have a good time together, and then in the future maybe you can camp together every other camping trip with slightly modified activities?", "YTA, it’s one night, either she won’t ask again cause she was miserable or she wants to go more cause she tried a new thing and realized it’s a good way to disconnect from the world. It’s not gonna kill either of you to try one night.", "NTA, but why are you gatekeeping something she might really enjoy with an experienced camper. She might enjoy sitting and reading in the fresh air while you get to bike.", "NTA at all.", "YTA \n\nSome men love complaining that women don't share their interests, so when the women do try, the men do this? I'm not saying all men, just some.\n\nShe wants to see what you do. She wants to understand. She is showing an interest in wanting to learn, so why not let her? This is a wonderful chance to bond and learn more about each other. And who knows, maybe it'll be enough to kick her into being more active outdoors. \n\nOr maybe she will learn that she has no interest in that part of your life and leave you to it. The point is, you won't know unless you try. You're missing out on opportunities by not letting her try.", "Is better she is miserable doing what you enjoy vs doubting you. Cuz she will bring it up until you breakup that you hid what you really do from her.", "NTA. She will ruin it, for sure. It starts with little suggestions of things you need to do - oh let's bring an air mattress, oh let's plan an elaborate campfire dinner, oh my great-aunt Mirtle lives on the way and we simply must stop in and say hello - and suddenly your getaway time is just another stress-bomb where you have to worry about your girlfriend's needs.\n\nYou're allowed to take time for yourself. Whether it's once a year or twice a month is a matter of opinion. You're allowed to decide for yourself how much time you need. And if it's not working for her, then you're simply not compatible.", "Absolutely NTA. Your girlfriend doesn't own you, or your time.", "Grown ass adult can’t act like one. I would hate to be in your position. NTA", "NTA. No is a complete answer. If she \"doesn't believe you\", that's her problem. I wouldn't even entertain her complaints.", "NTA but she should tell you she's always wanted to have sex in a tent.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy girlfriend is real homebody and she doesn't really enjoy doing outdoor activities often. So every other week or so I like to take the weekend to go camping on my own cause there are some pretty great views to see where we live. So I usually head out around Saturday morning and drive a few hours out to a campsite and spend the night camping and ride my dirt-bike down some trails the next day and come back home around 5-6 the next day.\n\n  \nSo this weekend I was packing my bags to head out for Saturday and my girlfriend asked me what do you even do all the way out there. I told her what I do and she went \" That cant be all you do that seems so boring dont you go to a restaurant or something\". I told her nah thats really all I do when I head out and she didn't believe me so she wanted to tag along with me on this weekends trip.\n\n  \ni told her that I didn't want her to come with me since i know she wont enjoy herself and be miserable and also cause i like it cause it lets me disconnect and bringing people along with me kinda defeats the purpose. She got sad since she assumed that I was only doing it s=so taht i could spend time away from her which isnt true and refuses to believe me now.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Take her so she can see.", "NTA (yet). Just take her. If she's so eager to learn, why not teach her the lesson and get it over with? Best case; she loves it, and you get to share something nice with your s/o (assuming she understands and respects the assignment). Worst case; she hates it, and you continue on without being pestered in the future.", "Bring her for one trip. See if she likes it. If she hates it, she won't ask to come again but she'll also be reassured that that's all you are doing", "NAH... bring her along but tell her she can come along as she entertains herself because you will be doing your usual thing. \n\nI once went fishing with my husband. The diesel made me sick, I got a migraine from the brightness of the sun off the ocean. A sunburn.  It was hard to read while sick... I didnt say anything because I went on his trip - but never again. I enjoy the ocean from the land.", "eh, NTA. but you should bring her anyways. let her see for herself. also camping sex is awesome", "Nta but take her one time to satisfy her curiosity", "“cause it lets me disconnect and bringing people along with me kinda defeats the purpose “\n\n“sad since she assumed that I was only doing it so that I could spend time away from her”\n\n🤔", "Take her. One time will show her that you are not fibbing. Maybe she will enjoy the solitude.", "Bring her and make her hang in. It will only take once.\n\nSource: I learned the first time.", "NAH - Take her once, maybe she'll find she really enjoys camping.\n\nI've heard it's fucking in tents.", "If your serious about her, she is going to have to start coming, whether or not she does everything up there that you do, or she finds her own thing to do up there.", "nta, but you probably shouldn't assume. if it's really her complaining about the trip, why don't you plan something for you to do together? you don't have to take her on the trip specifically meant for you to be alone but plan one together with things you'll both like doing so it won't be a burden on you to have her with and she won't have anything to complain about.", "NTA, but it’s one weekend. Take her with you. Do your normal routine if she doesn’t like it then it’s still only one weekend out if your lives. I think she doesn’t trust you so if you don’t take her, you’ll be dealing with this for years.", "Bring her with you, with the understanding that you will be gone for a certain amount of time and that you will do, what you want to do, with no whining from her, nor will you be coming home early because she can't comprehend ppl like to camp and run around in the woods", "NAH. I’d just bring her for one trip and let her decide if she hates it or not.", "YTA. You're definitely doing it because you don't want her there. She asked to go, so there's no harm in letting her experience it once. If you both have a miserable time, then don't bring her again.", "Take her camping. The real reason you don't want her along is because you like the alone time, but surely you can give her one weekend to see that it isn't her cup of tea. She is unlikely to ask again.", "NAH, but…I had a boyfriend like you a gazillion years ago. (I’m 62) Back then, I was nails, makeup, blow dryer, etc. You get the picture. I’d never done anything remotely like camping. My boyfriend too, would go camping off grid, every other weekend. I’d beg to go. \n\nFinally, he agreed to take me. Once. With the caveat. That if I complained, or wimped out in any way, I’d never get to go again. I agreed. \n\nWithin the first three hours, I’d broken a nail clear down onto the quick. It was hanging on by a little bloody chunk of meat. I gnawed that sucker off like a bunny with its foot stuck in a trap and I got to go camping ever after. I LOVED IT. We had some awesome adventures. \n\nIf you enjoy being alone, that’s one thing, but if it’s because you *think* she’ll hate it, let her try.", "My older daughter hated camping. When she and her ex went camping, his idea of a camping trip was him drinking beer while she did all of the work. Now, she loves camping. Her new beau loves camping and makes it fun. He’s an excellent cook and shares the work. Take your girlfriend on a simple camping trip to give her an idea of what it’s really like. You both may be pleasantly surprised.", "NTA take her. show her. than she can decide", "The fact that you won't let her go ONCE when you literally do it EVERY OTHER WEEKEND kinda makes you an AH. It wouldn't kill you to let her go once, unless she is right and you just don't want to be around her", "NTA but take her with you. Show her the real you. You are partnered with someone who wants nothing to do with a core life activity.", "\"I do this to get away from people. I don't want you to come. What do you mean? I didn't mean *you* are people. But I still want to get away from you. But why do you think I want to get away from you? That's not true even though it's exactly what I said\" lol\n\nYTA kinda.", "would let her go along if only to prove that you are doing in her mind boring things and not shagging anyone who is up for it\n\nshe will then be more accepting that you want to go off and do stuff solo", "YTA. I know you know she might not like it. But it won’t kill you to give her a chance to see what you love. She might like it or just understand you better. And if she hates it, no harm done.", "ESH if you see yourself being with her long term you should invite her to go at least once to see how it goes. \n\nYou should invite her and not change your regular routine and just let her learn what you do when you go first hand.", "NAH here\n\nShe should have asked ahead of time. But also, she's willing to try one of your hobbies. Maybe take her along and maybe yall will be surprised she likes it", "NTA. But you might have different expectations of your relationship to solve.\n\nI often leave for hiking 1 or 2 of the weekend days, for example, I went hiking overnight every Fri/Sat for the last month. My SO of over 14 years has no issue with this. I reserve some other time for things with her.\n\nShe's can't physically follow my pace, and even if she could, she wouldn't like the locations. Bushwhacking isn't for everyone.\n\nIn your case, you just need to find out if you actually want to be with your GF but really like the solitary outings or if you're coping with not liking hanging out with her", "v", "NTA\n\nYour allowed to go out and do stuff with the people you do and don’t want too. Their insecurities on that isn’t your problem, especially since those that pull this guilt trip shit have no problem dong the exact same thing when it suits them. Give it as much thought as she would, which I am guessing is none.", "NAH", ">So this weekend I was packing my bags to head out for Saturday and my girlfriend asked me what do you even do all the way out there. I told her what I do and she went \" **That cant be all you do that seems so boring** dont you go to a restaurant or something\". I told her nah thats really all I do when I head out and she didn't believe me so she wanted to tag along with me on this weekends trip.\n\n&#x200B;\n\nWhat I highlighted is another reason I also would not want her to go. She will 100 percent get bored and ruin your time away. You already said she is not the outdoors type.   \n\n\nNTA", "NTA. But I would invite her along just once so she can see for herself how much she hates it not so you can say I told you so. If you don't, it will become a sore spot in your relationship. And if by some miracle she likes it, you might have found yourself a camping partner.", "I kinda am not following why you wouldn't bring her to just put a pin in it for good. She'll tag along, you do the things you normally enjoy, she realizes she doesn't enjoy it. In the best possible scenario you find stuff that you both enjoy to do out there that maybe neither of you ever considered. Or at least that she didn't consider. \n\nYTA, not necessarily for not wanting her to come but for how you went about it. You could've used this to improve your relationship but you're choosing to be arrogant and stubborn instead and creating a rift in your relationship. \n\nAlso I'm someone who used to go hiking / camping every weekend because I feel more at home in nature than in the city, my girl understands that and knows if she wanted to come along I'd alter the entire plan to make sure we both enjoy it. Doesn't need to be all the time but here and there why would you not bond with the thing you're most passionate about if your partner is willing to try. \n\nYou're in a relationship, every other weekend is a lot dude so I don't know where you're trying to phrase it like it's just a little bit of time. We all need our alone time but a relationship is about balance and compromise. Currently the balance is tilted in only one direction and you've decided to remove all options of compromise when she was trying to experience the things you like. Maybe it's that she doesn't believe that's what you do, maybe she finds it hard to believe you could enjoy jus that so much and she wants to see how, maybe she wants to get closer to you because you're fuckin gone half the weekends of the month and she wants to build the relationship and feel valued. \n\nLike I'm a guy too with very similar hobbies, you're being stubborn and acting as an individual in a partnership.", "NTA and you absolutely deserve time to yourself without her there. There is nothing wrong with spending time away from someone even if you are head over heels in love with them.  Sounds like she is insecure and thinks you are up to something.", "I mean... you *are* kind of doing it because you don't want to spend time with her. You said yourself that the point is to disconnect and you can't do that with her there, so...\n\nYou're not wrong for wanting to do it. But she's not wrong for having her feelings a little hurt too.", "A little YTA and a little NTA, you explained it to her well but you should have at least given her a chance to see if she enjoyed it. Also it is true that you want to be away from her, you said it in your post that gives you a chance to disconnect, and be away from everything.  I think this would make any girl sad.", "NTA. Let her come the first time, but let her know she’s got to do the things. She probably won’t go a second time, and it’ll help her understand that you don’t go to restaurants or anything.", "NAH but dude read the room. She misses you and wants to spend time with you. Take her and let her be miserable this once.", "Ya", "NTA and it seems to me that a lot of people in this sub don’t get it at all. I’m a big outdoorsy person and camp quite often, sometimes by myself and sometimes in a group, but never with anyone who has made it clear that they would hate it (why would I willingly stress myself like that?). If I want time to myself, then I’m going to take it. My bf went camping without me last weekend and while I missed him I was happy that he got that time away and I enjoyed my alone time at home. It’s perfectly natural and healthy to have interests and hobbies independent of one another. \n\nI don’t think OP is in any way obligated to take her or should feel guilty/bad about it. Maybe he could consider planning a different trip with her, be it camping or something else, that is more catered to her and to them as a couple. But he shouldn’t have to sacrifice his alone time doing something he enjoys just to spare her feelings.", "Mostly YTA.\n\n1. That's a LOT of time away. It would be deliciously ironic if she met someone while you were gone so much and dumped you.\n\n2. You don't seem to be thinking of ways to include her. This sounds suspicious to me, like being apart is an important part of the weekend.\n\nSurely there are ways to include her sometimes. Rent her a bike. Go somewhere where she can go into town for a spa treatment. Help her adapt a hobby to the setting. Limit the biking time to a couple hours then spend the rest of the day together. (Sadly she couldn't do any quality bird or wildlife watching while bikes are roaring all around).", "What you said: no you’re no fun and I go to get away from you.\n\nWhat she heard: no your no fun and I go to get away from you. \n\nYeah my dude YTA", "YTA\n\nYou go every other weekend?  I am sure you can deal with her coming this ONE time, to at least ease her mind.", "Maybe she was actually trying to join in on something your interested in and trying to show interest, yeah YTA. She was sad for that reason you made effort and you were like nope", "Normally I would just say this is a simple matter of incompatibility, but in this case I think you cross into YTA territory. Look, I get that you want some alone time or whatever but you just totally blow off your GF and don't even listen to her concerns or anything. Like, do you even like this girl? She's obviously trying to spend more time with you, even willing to go do your hobby with you and you don't even try. And what she's asking isn't unreasonable, most partners don't just fuck off by themselves every other weekend. You seem extremely selfish and uncaring and have put absolutely zero effort or care towards your GFs needs and concerns. Good lucky with the relationship", "YTA - she wants to see what you are doing and spend time with you. This weekend might have been a bit early because I am sure she doesn’t have the proper equipment. But the next time you go she will be fully prepped and ready to accompany you.", "You said it was so you could spend time away from her.", "ESH. I'd bring her along for one trip--maybe she might actually enjoy it. You really don't know what you like until you've been exposed--maybe she'd like hiking, birding, waterfalls, photography, herping, etc", "I mean if you spend every weekend alone why are you guys even dating?", "INFO\n\nIf you're going solo camping every other weekend, do you and your girlfriend have enough one-on-one quality time together?", "Kind of OP but I see your point. Take her for a trial outing.", "NTA. Bring her and let her be miserable then flip tf out on her. Lesson learned.", "Seriously? YTA. She expressed interest. Unless, you know, you don’t really care for her, or the relationship, bring her. Make a trip of it, and let her see. Don’t be bad about it. Make a real effort to help her enjoy it and see what you see in it and why you enjoy it. Be prepared to cut the trip short if she truly doesn’t like it, and then she’ll know for the next time you go - or - she might like it, want to go sometimes, and you’ll have someone to go with.", "Your GF wants to go with you, you go every other weekend, and you're unwilling to sacrifice ONE weekend that might end early.\n\nWhat if your GF goes along and it turns out she LOVES it? But you won't even give her that chance.\n\nYTA.", "So they live together, they have jobs that allows them to have free time during the day, they go on dates on Thursday to restaurants (an activity the girlfriend likes). So is not half his free time.\n\nI think you need to show her your hobbies, maybe she will not like it, but she would know what you do when you are away. \n\nI don't think you need to change your hobbies for your girlfriend but I believe you need to talk to her about it, and that is important to you, but ask her opinion about it to, you both live together and have a relationship, need to communicate more.\n\nNTA", "NTA. But I agree with the people who say - take her, and then do exactly what you would do if she wasn't there. If she complains, remind her that she insisted and didn't believe you when you told her the truth. Best case, she'll enjoy herself. Worst case, you'll only have to put up with her for one weekend, and then you have grounds for not taking her again.", "ESH. You could have better handled it. She is too insecure and immature.", "ESH\n\nIt won't hurt you to let her tag along one weekend, if for no other reason than to prove your point. It sounds like you regularly do this (25-30 times a year), so if one such trip gets \"ruined\" by her misery, then it wouldn't be the end of the world.\n\nAlso, she needs to accept that you can do things by yourself without it being a slight of some kind to her.", "NTA. Why would 10 people even go to a wedding of someone they didn't know? They don't feel awkward about that? People are so bizarre in the things they do. Crazy.", "NTA... ppl need space especially couples.... she sounds kinda clingy and self-absorbed", "This, op. Bring her. Let her see for herself. Make sure she has warm stuff to be comfortable and good shoes and things (a book she’s been wanting to read, crochet project, whatever) to occupy her time. \n\nIt might be good to introduce her to the quiet and see what she thinks of it. \n\nSo, NAH here, but I think you could have tried a little harder to explain it.", "OP, you realize she thinks you are cheating on her, right. It might take a few trips before she is convinced that this is all you are doing. Good luck.\n\nNTA", "I would not want my camping ruined just to make a point, though.", "This is the way.  Give up one weekend alone to boost your relationship.  \n\nAlso nookie.", "And take 2 cars.", "Exactly!!", "Keep in mind that if you have kids, how much your life is going to change.", "As good as it sounds on paper, in terms of teaching her a lesson, it still defeats the purpose. Instead of trying to regain mental energy, he will have to spend that time wasting on her non-stop whining, and you absolutely will be her baby seater whether you like it or not.", "Obviously not compatible. I used to go out twice a month with my partner and wouldn't refuse to include me, maybe compromise somehow.", "Exactly. My husband used to do this all the time when he was single. I love camping tho and I like doing MOST of the things he does. If I don’t want to do something I just tell him I’m cool chillin at the camper with a drink reading that day and he goes off and does the thing he wants to do and I usually have the fire goin for him by the time he gets back. Camping doesn’t have to miserable. It’s nice to distress and have some alone time too.", "This 100%.", "This is it, I think she wants to spend more time with him. He should bring her along sometimes, maybe compromise a little bit when she’s there so that she can have some fun with it, or go a bit less frequently.", "Well said. There's a middle ground here too. Instead of bringing her along for two days, why not break it up and include her in individual activities. Go for a 2 hour hike one day. Do a trail run on bikes. Spend an evening stargazing for a few hours. That way you don't waste a whole weekend if she hates it, and starting with small doses, she may even learn to like it.", "lol. \n\nGood catch. Dude didn’t like the responses the first time so he went shopping again hoping for a different outcome.\n\nThat puts him in a hole territory right there. He doesn’t want an objective response. He just wants validation because he’s already decided he can’t possibly be the a hole.", ">And the message I hear when you say \"Don't come you won't be happy\" is \"you're going to ruin it, I don't want to spend time with you ever\".\n\nSpotted the woman.🤣🤣🤣", "This is exactly what I was thinking. I would be so sad if my partner left two weekends a month without me", "This was my thought exactly, and it's coming from someone who also needs alone decompression time.\n\nI don't take the majority of the weekend though (the weekend being when most people are already off work) I take every other Wednesday off and I still spend time with the bf in the evening.\n\nI don't think I could be with someone who wasn't accepting of my alone time, but if I didn't need alone time I don't know if I could be with someone who needs every other weekend in alone time.\n\nI agree with NAH and also that they might not just be compatible in that regard.", "My husband and I are the King and Queen of parallel play (separate activities but together).\n\nLike what if she just wants to read and chill out in the peace and eat with him.", "4 days a month of alone time is excessive when they both work from home? Then fuck relationships, I'm getting a cactus plant.", "Relationship doesnt mean has to do everything together", "They are around each other 24/7, as they live together and work from home.\n\nMost couples who work spend 40+ hours a week apart. I think that time away from a partner is healthy. He's gone 40 hours a month- rather than 40 hours a week. I don't see anything wrong with that.", "> she only sees you ever other weekend\n\nUnless they live together, which means she sees him every day except for part of every other weekend.", "> she only sees you every other weekend\n\nThey work and live together apparently, so really, the only time she doesn’t see him is every other weekend", "If you are ditching your partner nearly every other weekend for the entire weekend, you might be doing it because you don't enjoy hanging out with your partner.", "Sounds to me like the point is partly to get away from her. Whether the OP realizes this or not it's basically what they're saying. They want to disconnect from everything and that includes his girlfriend. So if his girlfriend likes it and wants to come along every time it's an issue and if she complains too much it's an issue.\n\nIt's a lose-lose to OP from what I gathered.", "Yes exactly! Like at least try it out once with her if she's asking to come. \n\nAlso I wouldn't be surprised if the GF thinks OP is cheating on her. He goes away every other weekend alone and then when she asks to come he comes up with a bunch of lame excuses why she can't... that would be triggering alarm bells in for me", "Regularly? He goes every other weekend. He’s gone half the time. Of course she suspicious and upset he keeps disappearing.", "If she goes, she will learn that he is really just driving into town to cheat on her with his other family.", "She doesn’t like it and will obviously complain the whole time. Why does he have to ruin his alone time just to prove this?", "Yeah this was my thought, every other weekend is kind of a lot to spend the whole time away from your partner. Of course she's feeling like he's trying to get time away from her or something, and even if that's due to insecurity, weekends (if you work M-F) tend to be the time to spend with your partner without the stress and pressure of work and nightly routines to prepare for work the next day, I'd miss my partner too if he was gone every other weekend for his own personal hobbies. And it sounds like he hasn't even given her a chance, I don't see any comments that \"she's come along before and been miserable and we both had a terrible time\" instead that \"I know she won't enjoy herself and be miserable\" - if he hasn't even given her a chance, he's TA to just assume she won't even try to understand the experience and not even letting her try it out.\n\nBest thing to do here is to take her along, but first prepare her for what to expect so that if she really doesn't have a good time, it's not due to unreasonable expectations or experiences she wasn't anticipating or prepared for. Such as packing the right clothes, knowing that food may be simple/cooked over a fire, that there might be bugs, the weather could go sour and you just have to endure it, there's going to be physical activity like hiking, etc. If he only had one dirt bike he might have to set that aside for her to come along one time, but maybe letting her try it out would help her see how he has fun is a good idea too. It just sounds like he doesn't want her involved at all, which I think anyone would be a bit disheartened about. I think he needs to give her a chance to see the beauty and peace that being out in nature can bring, and who knows, she might come to love it and then it's another thing to do together.", "Once every 14 day seems reasonable", "I like a lot of people doesn't mean I want to see them all day every day", "Your comment actually hurt my esteem of redditors.", "God forbid he takes a day every two weeks for himself, everyone deserves their me time", "Id be ok with it I mean after seing each other for 12+ hours a day non stop its nice to have some time alone", "Probably. I've personally seen this several times.", "Not spending 4 days together a month is „not compatible“?", "What are you, attached at the hip? Sounds needy and weird.", "Unless she really doesn't want to go and just wants to have control over him.", "Sounds like maybe you should evaluate your relationship too?", "And she absolutely does not trust him.", "Okay but he can force her to conform to his schedule of leaving twice a month because that’s different than what you’re saying somehow. Even though she didn’t try to force him to do anything, she ASKED if she could come and he DECIDED she wouldn’t enjoy it. He’s forcing her to conform to him and by you’re own logic that makes *him* an AH", ">Stop trying to decide for her what she likes and doesn't like\n\nShe literally told him it sounds boring, then only wanted to go because she assumed he was lying about what he was doing. This isn't her wanting to see if she will enjoy his hobby, it is her thinking that he is doing something else and lying about it so she needs to inspect it.", "Agreed, and I like this idea. OP isn't the AH for wanting time to himself doing something he enjoys but gf is also not the AH for wanting to spend the weekend with him. If OP takes her and she complains then he'll know this isn't for her and can plan accordingly.", "OP says every other weekend, not every weekend.", "And soon he'll be single so he can have every weekend to himself,.", "Bro, not for the other campers it's not, lmao", "Yes, the quiet of the dirt bike’s roar really is something everyone should try to enjoy. ;-)", "I feel like OP's girlfriend doesn't have any hobbies like that (or hobbies at all), if what she thinks he does when camping is \"go to a restaurant.\"", "Very important clarification. I think it's essentially that you try to help her be comfortable and still have a good time instead of just saying to suck it up. \n\nIt should be her decision that she's not interested rather than yours", "Why are you commenting like she’s a child or he doesn’t know about camping? Idk why I hate your comment 😭", "The best lesson is experience, Bring her, let her suffer and forever butt out of your weekends", "This! Bring firewood, and have a roaring fire. Do some s'mores, roast some hot dogs and all that. You might find that you end up with someone that you can share a lot of really amazing experiences with, and if you do take her she may understand why you try to get away to disconnect. She might even be okay with you doing it in the future. My wife and I are both outdoorsy people, we love to go hiking and paddle boarding and a bunch of other stuff to disconnect. Her being there does not mean I cannot do that, it usually increases the experience for me because she's my best friend, and I love spending my time with her.", "I'm going to go a step further and suggest you go in separate vehicles .and also yeah magicsusan42 I agree the explanation could have been a little smoother .", "If OP is cheating on her, this whole post is just to cover his tracks.", "If it were a once-a-year experience I'd agree. But he's doing this every other week. One less stellar weekend of it won't be the worst thing, and she'll either realize she doesn't like it or surprise both of them and like it.", "this. that way she can leave when she gets board.", "He can give up 1 weekend of his typical relaxation to clearly relay to his girlfriend that yes, this is what he loves. She thinks he's lying. It's the perfect way to show her that he's not.", "it's ok to have time to yourself. it's great that your relationship works like that, but it's not a requirement. there's nothing wrong with not sharing every hobby and every waking moment with your partner.", "yeah how about a mix of activities. also bring her along and have tasks or things to do so she feels involved if she wants.", "I dunno. I'm a woman and that's not what I saw.", "Shiiiit, I get sad when my boyfriend has to go back to HIS home. It's the crummy feeling like they've become unreachable to you somehow.", "Right and I clearly stated he's not an asshole for wanting alone time. But I do think that going away every other weekend is excessive if both partners aren't on board which is why they may not be compatible.", "I missed that they both work from home, but working from home and being around each other is different from being off work and being around each other.\n\nThe weekend is presumably when she has her free time and I don't blame her for wanting to spend it with her bf\n\nI don't think he's an asshole for wanting alone time and I don't think she's an asshole for wanting to spend time with him during their free time.  It just might be a compatibility issue long term.", "Even though they are working from home at the same time, that is not quality time spent together. I'm fully remote and my husband is hybrid so we often both work from home. We are not really interacting much during that time and neither one of us considers it time spent together. As to your point that he's gone 40 hours a month rather than 40 hours a week, there is a big difference on being gone during the hours that she is working versus being gone during time that most couples spend actually doing things together.\n\nAnd again, I did not say that he was wrong for wanting alone time, I said that they may not be compatible.  She isn't an asshole for feeling bad that her partner wants to spend half of his weekends away from her. If she isn't getting what she needs out of the relationship they are not compatible. Neither is wrong, they just need different things.", "Whilst that is true, I would argue you can’t really spend that much quality time together in the evening after work. Sometimes me and my girlfriend see each other for an hour or so, have dinner and then fall asleep on the sofa. It’s not the same as having a weekend. And saying part of every weekend is disingenuous too, she sees him when he gets home at 6 on a Sunday (if they live together) presumably the time when he needs to unpack all his gear from the camping. \n\nNone of that is quality time when you can actually do very much together, and if they don’t live together, very little time at all.", "Op said in a comment:\n\nI like a lot of people doesn't mean I want to see them all day every day", "Quality time vs quantity time. I see my partner often during the week, but it's usually after work when I'm decompressing. It's still valuable time, but we're not engaging as much. It's more having quiet time together, which is also nice. But the weekends or days off are when we have *quality* time and do activities, interact and talk more, and for me is really foundational to maintaining connection. \n\nI also hike and camp a lot so I totally get why OP wants and maybe even needs to get out as often as he does. But I can also see why his gf would be hurt that she's explicitly not allowed to share that with him and is sad about losing *quality* time because of it. \n\nRealistically, unless OP is able to compromise somewhere, this relationship has an expiration date.\n\nEdit: typos", "Working and Living together can barely be a relationship.\n\nA large chunk, let's call it a quarter(1 weekend out of 2 weekends+weekday free), of his free time is spent alone. That's a lot for most people.", "If he needs to get away from his girlfriend every other weekend then he should just lose the girlfriend altogether. They will both be happier.", "Sounds like he should find a GF he likes spending time with", "If she thinks he’s cheating and already thinks he’s lying why should he be all open arms.", "Every other weekend is 1/7th of the time, not half", "Since when are 4 days half a month? They both work from home and spend 10 hours together without sleep.\nYou do realize that if one of them had to go to the office they would spend a lot more time apart, like at least 8 hours.", "Imagine being every other weekend wife", "He goes every other week, it’s not like it’s “ruining” a precious and rare trip", "How do we know she won't like it? The only indication op gave that she wouldn't like it is \"because I said so\"", "because when you're in a relationship you should maybe care that your partner is trying to tell you she wants to spend more time with you.", "I believe that he wants to avoid that, it's like taking a small child to the mountains. He just wants to have fun by himself without being worried about other people, looks rational to me.", "You spend every 2nd weekend away from your partner. Do you even do stuff *with* her except for living together?", "Dude if you don't want to see your GF every day in general you shouldn't be in a relationship with her", "YtA", "It's not a day though, is it? He leaves Saturday morning and comes back Sunday evening. If they both work Mon-Fri jobs, that's him disappearing for a lot of their free time. \n\nEveryone does deserve their 'me time', nobody is disagreeing with that. But it becomes an issue when the 'me time' is excessive and is at the expense of the relationship.", "I am all for me time but when you are in a relationship going away every other weekend seem excessive. It isn't a couple of hours on a Sat. morning. It is leave Sat morning and come back Sunday evening. Pretty much gone for two days. If you need that much time away you honestly shouldn't be in a relationship.", "If you're in a relationship, a lot of the time your main time to do stuff together is weekends.\n\nHe's taking both days on said weekend for mystery solo trips. \n\nit's a bit much like.\n\nedit: obviously that depends on how hard of a \"homebody\" the girlfriend is. If they're doing absolutely nothing on the weekends he's not away that's gonna be a bit annoying like", "As much as I agree with you in principle here, if this is a relatively new relationship and both are working adults then once every two weekends is actually a fairly significant amount of time. When you don't live with a partner, and both of you work, weekends is usually the best (or even only) time to organise dates/activities and so basically half of the available time OP has for spending with his girlfriend is taken over with his hobby (and this is assuming that's all he does in his free time, there aren't other commitments too). It's quite a lot of time...", "You see eachother 12+ hrs/day? Do you include the 7-9hrs/day of sleep in that or do you gouy both work from hone or something? How is that even possible? And do you actually spend time together or are you just both existing in the same space?", "It sounds like she effectively said she can't comprehend that he'd enjoy that, and borderline accuses him of dishonesty. \n\nThis doesn't make him the asshole, but it does indicate there may be problems with compatibility. \n\nPerhaps they can both do better for themselves.", "why? some people like alone time and especially when you live together, it’s harder to get. even worse in a small living space.\n\ni love my partner, but i won’t move in together until we can both afford a place with enough space where we both a space for ourselves.\n\nwe already spend half the weekend apart and it works just fine, but we like doing our own stuff.", "Exactly. She sounds controlling/manipulative or mistrustful based on this interaction. \n\nAssuming there's been no infidelity (it wasn't mentioned) she likely has a history of cheating or being cheated on.", "I understand what you mean although a lot of people have preconceived notions about certain activities but end up growing to like them. I love reading and know a few people who found it extremely boring until they tried something that worked for them and now they love it. Even if OP's girlfriend was being suspicious, it doesn't make her wrong for wanting to know what's going on. I don't think OP is an AH for having a hobby. He's an AH because he was asked once by his girlfriend to join him and he refused. If he had taken her and she didn't enjoy the experience, she wouldn't have asked to go again. If she saw that this indeed was all OP was doing, she wouldn't have asked to go again either if being suspicious was her initial reason for asking. But OP seems to be the one making all decisions on this subject.", "Yeah, I spend a lot of time outdoors and actively avoid any areas that allow dirt bikes. Nothing ruins a day in the mountains quite like dirt bikes.", "When you're on a dirt bike, you  feel nothing, you hear nothing, it is pure bliss.", "Do you think he is going to ride his dirt bike hours straight around their tent?", "There is absolutely nothing to suggest that OP's girlfriend doesn't have hobbies just because she's not into camping.", "I said it in a comment further down, but she may not think he's \"going to a restaurant\" so much as \"banging someone else.\" Especially since she's asked to come along once and he immediately shut her down.", "She needs one, especially as she spends EVERY OTHER WEEKEND alone. Maybe a better boyfriend", "I get the sense there may be some insecurities at play with her. The restaurant question sounds like someone probing to find out if there’s an opportunity for inappropriate socializing.", "I think this is more like one of those moments a man just stares into the distance and his wife asks him 'what are you thinking about?' There is hardly a woman in the world that is able to imagine that sometimes that's all we do. Men need to press their reset button from time to time. \n\nFrom OP's story I get that his camping trip is just like one of those reset moments and his GF can't handle the idea. God only knows what her mind is telling her what he is doing, but she probably should see for herself.", "Yeah, she's going to hate it. Let her hate it. I do think it sucks for him because I also very much enjoy my alone time and I would be pissed to have my weekend ruined by someone who is obviously not going to enjoy themselves. But I think at this point it's better they both experience for themselves so the discussion can be laid to rest and he can just continue to enjoy having his \"alone in the woods weekends\" to himself.", "Exactly and one of the best things about camping as a couple is all the outdoor sex you get to have, risqué nude walks, when younger both me and my wife (girlfriend then) loved camping, skinny dipping, nude hikes (wearing boots of course, lol), and lots and lots of outdoor adventurous sex.\n\nI will admit that sometimes it is nice to do the hiking, (it is often hard to find other who can keep up with my pace) and camping thing alone (by alone I mean with my dogs), as you get to really appreciate the nature and solitude.", "I feel like people are missing a key part of the post, which is that he likes being alone on these trips. Whether she would enjoy it or not is ultimately irrelevant.", "I agree that it is fine to not spend every waking moment, but OP is spending half of his weekends basically completely away from his GF. That is a significant portion of your free time to do things. \n\nIn general, I think few relationships will last if one member only wants to hang out on half of the weekends.", "So the guy said they live together and work from home, they have enough time together", "\\>Whilst that is true, I would argue you can’t really spend that much quality time together in the evening after work\n\nThat greatly depends on schedules. My last gf and I had from 430 until 11 or so when we went to bed basically every evening. WE frequently were apart on weekends because I was doing things with my friends and she was doing things with hers. \n\n\\>And saying part of every weekend is disingenuous too, she sees him when he gets home at 6 on a Sunday (if they live together) presumably the time when he needs to unpack all his gear from the camping.\n\nAgain really depends on schedule. He leaves in the morning on Saturday, that could be 6am or 11am. He gets home at 5 or 6. Unpacking some basic camping supplies from a single night doesn't take long, maybe an hour tops if you really have to do a lot (though since he goes regularly good chance that most things just stay in a bag in the garage or something. \n\n\\>None of that is quality time when you can actually do very much together, and if they don’t live together, very little time at all.\n\nAgree to disagree. It can be harder if they don't live together, but many couples I know who don't live together still stay over one way or the other basically every night anyway.", "Which would explain wanting to get away on a camping trip if he lives with someone and would otherwise be around them every day.", "Or, you know, he's an adult who needs alone time to recharge. There's nothing wrong with that.", "Because she's not jumping to cheating, and instead being normal and asking to be included.\n\nIt only got weird when OP gave a hard \"No and I don't think you should ever come along\" that's such a weird response for something he does every other week. What's the harm in her coming along once?", "Most people work M-F dude", "My spouse and I do things apart from each other but that's like one weekend a month.  The rest we're running around or at home with our kid.", "I dont see how taking a girlfriend who clearly wants to spend time with you and is expressing curiosity about these every other weekend disappearances is like taking a child to the mountains. I still think he needs to at least give her the chance to see for herself if it's something she would enjoy it even grow to love. The frequency is still worrying, every other weekend seems excessive to be gone the whole time and also not letting his partner even try to be a part of it. He can absolutely take some time for himself now and again, but in a relationship it's odd to me that he wants so much time away from her and wont even try to get her involved.", "I dont have a problem with seeing her every day I just think spending some time apart every so often is healthy", "Nah we both wfh and since our jobs require us just to be available and not be constantly working we spend most days doing things together at home", "So many of my limited non-park hiking options have been torn up by dirt bikes and the like. Ugh.", "You might be losing your hearing from the noise of those dirtbikes. God those things are annoying to be around.", "But if you’re not the one on the dirt bike, it’s just noise.", "I hear my own screams in the helmet and my hands go numb from the vibration 🤣", "Read more about their schedules, they both work from home, only a few hours of work a day, they are spending 10~12 hours a day together, not counting sleep. They spend plenty of time together, maybe she has separation anxiety and sees him more like an \"emotional support boyfriend\"", "I was waiting for someone to say this. I can’t believe I had to scroll this far. \n\nDude is gone every other freaking weekend. Seriously? And he thinks that’s okay.\n\nI’m not clingy. I’m a very independent person. I like my alone time. But I think a lot of people might find their SO ditching them that often as BS.\n\nAnd the damndest thing is- she wants to come along. At least give it a try. \n\nAnd I’m sorry OP. When I started reading this, I thought you were going to be hiking Everest. Nope. You’re just driving out in the boonies to ride your mini bike. There’s no reason not to let her come along. \n\nHere’s hoping the girlfriend spends that time alone by packing up OP’s shit and then finding a better boyfriend.", "Or maybe an emotional support animal. It's ok for couples to spend some time apart doing what they enjoy as an individual.", "Or maybe she can get some friends when she is not with her BF. Where is it written that a guy has to spend every weekend with his GF?", "He likes being alone but his other reasoning is that she would be miserable. I just can’t see being in a relationship where you wouldn’t want to share one of your greatest hobbies at least ONE TIME with your partner… like does he hate her? Lol", "OPs hobby involves being in the woods and his girlfriend likes being at home. Are you suggesting OP gives up his hobbies to appease his girlfriend?", "Working from home in the same house isn’t quality time spent together. Weekends are pretty commonly understood as socializing/ relaxing/ etc. time that is typically spent together when people are in a committed relationship. Obviously everyone needs solo time, activities with friends that don’t include your SO, etc. but going away for solo time 50% of weekends seems excessive, and if I were the gf I would also feel as though my bf was trying to get away from me.", "It depends on the relationship. That may work for you but not for other people. It sounds like his partner isn't ok with him being away that often without her, and that's valid for her. If they can't come to a compromise then maybe, as I've stated twice now, they aren't compatible. Neither one is an asshole, they just have different expectations and needs.", "Every so often is healthy. 50% of your free time is not \"every so often\".", "You sound dismissive of how she thinks the relationship should be balanced. YOU think it’s the best idea for you both if you take off twice a month, even if you now know it’s clearly hurting her feelings. Have you asked how SHE thinks the relationship should be balanced? Maybe you could do one solo trip with your bike, and one weekend a month with her where you do some of your stuff, and branch out and find something for her too (she mentioned restaurants and stuff). As of right now you sort of sound like the 50 year old man who goes golfing every weekend to avoid his wife’s company.", "Right every so often if fine! It's totally healthy and normal to spend time away from your partner... but dude you're going away every other weekend, that's not every so often, that's quite frequently", "Man.  Even reddit thinks you're cheating and lying to them.", "Every so often isn't half of your free time, my dude. I am feeling really bad for her.", "Time apart is very healthy. Having your own hobbies is very healthy.  Every other weekend is not excessive. Don’t listen to these people. I’ve learned many lessons in my 16 years of marriage.", "You “don’t have a problem” seeing her every day?\n\nWake up call. You’re in a situationship. You don’t want to be with her, you’re just okay with it. If you don’t actively *want* to see your girlfriend, you should not be in a relationship. \n\nConvenient =/= desire. Just saying..", "What full-time job pays people to be at home but not working? I want in on this.", "Spending time at home while you both are working is not quality time. Even if there are lulls in the day that allow for some conversation or tv or whatever. Do you do anything nice together? Do you ever take a weekend trip together or vacation together? Do you ever prioritize a nice weekend with her and what she wants to do? Or is it only about you? Every other weekend seems like an awful amount of time to be doing this. Pretty selfish IMO.\n\nI see a lot of soft YTA but my feeling is this is a little worse and more selfish than you’re admitting.", "NTA for camping alone every two weeks, with this explanation. Doesn't your gf have friends she can see on those weekends? Or hobbies that she does alone? \n\nI love my husband, but if we were together at home all day on weekdays, I'd be looking forward to having the place to myself for 36 hours every couple of weeks.", "You might want to add this in an edit to your main post; it does have a lot of bearing on you going camping every other weekend. NTA but as others have advised maybe take her just once even if she hates it. She may be imaging all sorts of things (possibly involving another girl even) and at least she'll see that what you said you are doing is literally all you are doing. My aunt didn't believe us when we said what we did when we go camping until she joined us because it just isn't her thing and she couldn't comprehend not shopping or 'going somewhere' other than nature lol. She now just thinks we're boring. ;)", "You should have cleared this information 😅", "In that case, if you don't just actually work all day at home and just see eachother but also spend actual quality time together often: Doesn't your gf have anyone else to spend her time with like friends or hobbies she can do alone?\n\nAlso: is she generally clingy or could she perhaps even think you're cheating because she's insecure about you leaving every 2nd weekend? In no healthy relationship partners spend 24/7/365 together, that just doesn't work out, you're still different people.", "What?...", "Earplugs exist....which I would totally recommend to everyone who rides motorcycles or dirt bikes.", "Oh yeah!  We have neighbors who made a dirt bike course in a field behind our house for their teenage sons who are into dirt bike racing, and in the summer the RINRINRIN is fucking nonstop during daylight hours!  I hate that sound with the fire of 10,000 suns!", "I live literally across the street from the entrance to many dirt bike trails.\n\nI used to have dirt bikes.  I absolutely loved them.  I'd go everywhere on my dirt bike.\n\nI now hate them because of the noise it causes right outside my house, multiple times per day, all year.", "Thats why he goes ALONE", "Honestly I love the way a dirt bike sounds. Even if I didnt have mine I would listen with a tad of jealousy. But ive been riding since I was 8yo.", "Unclear.  I've heard people call bicycles \"dirt bikes,\" and I've heard people call motorcycles \"dirt bikes.\"  I wonder which one he's referring to?  Both are fantastic.", "Yep. If I spent that much time with my partner during the week I'd be gone every other weekend, too. It's not about how much you love the person, it's about having some time to yourself.", "If my boyfriend was leaving me every other weekend to go camping alone, after a couple of months I would start to suspect that he's actually cheating on me. So if I the asked to go with him once and he told me no, it would add forget fuel to the thought for me. I don't think that's what this guy is doing, but I wouldn't be surprised if that's what SHE thinks he's doing.", "Right? Doing it sometimes, yeah, cool, but every other weekend you *need* to do it? Then maybe there are bigger problems in your relationship you're running from.\n\nNot that he can't have hobbies. But he says he \"does it to disconnect\" and that bringing people would \"defeat the purpose.\" So then she asks if it was to get away from *her* and all of a sudden it's \"no, baby, it's not like that. i can't stand to be around anyone I love more than two weeks in a row without a complete break.\"\n\nThese two are just downright incompatible. He needs someone who would love to go on these outdoorsy trips and enjoy it with him, not someone who thinks there are restaurants at camping sites that he has to run away from on a biweekly basis.", "I agree, I was thinking once a month would be reasonable", "You say you're not clingy, but your comment says otherwise.", "This! He is gone EVERY OTHER weekend. Assuming he has a weekday job, that means he's basically spending 50% of all his time away from her. If she actually turns out to like the activity, awesome! Otherwise he might find out she doesn't like the compromise of having a 50% boyfriend. Or worse, she thinks he's out there with someone else.", "Right?\n\nMost of the time you’d expect the issue being that she doesn’t want to come camping. But nope. OP doesn’t want to share his passion for camping with her. He needs alone time. \n\nI’m an introvert. I’m not big on people. But I love my husband. I love camping with him. And it’s not the camping as much as sharing this experience with someone I love. \n\nI can’t imagine how I’d feel if my SO face palmed me about camping with him. \n\nGF needs a new BF.", "Nope. I am suggesting that relationships don't tend to last if one person wants to spend every other weekend doing something away from their partner.\n\nAs such, being as the GF has seemingly never tried camping before, it makes sense to at least give her one shot at it. Maybe she'll like it more than she thinks, such that perhaps she'll go camping with him once a month. Or, alternatively, maybe she'll hate it, in which case presumably they'll inevitably drift apart and break up eventually.", "Not really i mean we both work jobs that leave most of our day free and we wfh so its not that much of my free time", "I mean we work for a few hours and the rest of the day we are free since neither of us work more than 2-4 hours a day so i think it counts. We go out every thursday for a dinner date so I think every other weekend alone is okei", "We bought our property long before they started their little hobby, we own our property while they rent the field from a farmer, and finally we bought a home in the country because we wanted the peace of the country.  If I had wanted to listen to engines all day I would have bought a house next to a race track.  But seeing as how we are grownups and not oversized children, we've planted several rows of fast growing deciduous trees and shrubs as well as some evergreens to create some sound baffling because as grownups we recognize that others have the right to exist and enjoy their lives, no matter how irritating they are.", "You could always buy a house in a neighborhood instead of bitching about how people enjoy themselves out in the country on their own land", "They spend 10-12 non-working waking hours awake. They both work from home and only a few hours a day. Even with 8 hours of sleep, that's still 10-12 hours every day in the same dwelling with another person. You would need to disconnect too.", "They both work from home", "You do know that there are other days besides the weekend to hang out with your BF or GF?   \n\n\nSo twice a month he spends Sat-Sun doing something he prefers to be alone....he is half a BF?", "Your gf doesn't think it's \"okei.\" \n\nYou like her enough to live with her, you might consider her feelings every now and again. \n\nAnd how are you both working 2-4 hours a day and surviving? \n\nAlso, when you're spending time together at home, are you spending quality time together or just screwing around on your phone etc?", "It is in a field behind their house, not in the neighbors yard.  It is very likely that they trespass when riding.  Had this problem near my dads house.  Neighbors did not care if someone bought the property, they felt entitled to ride their dirt bikes on the property and wreck anything placed there by the owner.", "So? Usually when you work from home you are...working? Taking lunch break together it's not the same thing as spending quality time with your SO.", "we get paid a salary not hourly and she doesnt have a problem with me spending time alone she just has a problem with me not wanting her to check on what im doing", "Read some of OP's replies to comments on his previous posts. They only work a few hours a day. They spend 10-12 waking, non-working hours together. I would want to disconnect too", "I would love to know what you do salary that allows you both to work that minimally, but I don't want to go on a tangent.\n\nNever in your post did you say her problem was that she couldn't reach you. \n\nWhat, in HER WORDS, does she want? Does she want you to go less often? Does she want to accompany you at least part of the time? Does she want you to check in a couple of times so she knows you're safe?", "I think your attitude about this is the major problem. What you think is her “checking in on you” seems more like an attempt to take an interest in you. Let her decide she wouldn’t like it. You making the decision for her is majorly what makes YTA.", "You sound very contemptuous of her point of view. Do you actually like her, enjoy spending time with her and have activities you can both enjoy together?", "Oh, wow, I missed that. Thank you! \n\nI would definitely need a break, too.", "He’s just not that into her. My husband and I also both work from home, and we also spend time together throughout the day. We can’t WAIT for the weekend together.\n\nOP sounds like he’d be much happier in a lower commitment situationship, where he doesn’t have to answer to anyone or go out on more than one date per week max."]}