{"id": 29318, "submission_id": "17cgx8q", "title": "AITA for telling my SIL that she/BIL aren't middle class?", "selftext": "My husband's family has money. Both my husband and his brother John grew up with private school, credit cards, and nest egg to start their life. I'm going to stay away from real numbers but basically their passive trust fund income alone would put them in the top 90% in our country and the top 80% in our area.\n\nMy husband invested early and entered a high-powered career. John failed upwards into a legacy college and a management-level white collar job but his career is pretty stagnant. He and SIL live right on the edge of their finances and carry around a lot of debt. SIL freelances on and off for extra income.\n\nThere's a lot of friction between my husband and John over money. Both John/SIL have implied multiple times that we're out of touch and my husband got lucky while they're regular salt-of-the-earth people. usually we let it slide because it's true that we're much wealthier than they are.\n\nBut I was with SIL recently and finally cracked. She was saying John wants to take unpaid leave to change careers, but their lifestyle is at the top of their income and they barely have savings. SIL said they'd have \"no money\" and I said \"don't you still have the trust income\" and she said \"yes but that's barely enough to survive.\"\n\nI said there were a lot of people who \"survive\" on a lot less. She rolled her eyes and said that was easy for me to say and  that real middle class people like her and john were \"living paycheck to paycheck.\"\n\nI said your house costs [95th percentile for their city], I don't think that's middle class. She was offended and started listing off all of the expenses they had, basically the income from the trust alone would only over their mortgage much less all of the other expenses like private school. I said most middle class people don't spend on __ and ___. She said well you and your husband do, and I said yes but we're not claiming to be middle class.\n\nShe got upset and said she wasn't \"claiming\" to be anything and I was being a snob.\n\nObjectively like I said their passive income alone would put them in the top 10% which would disqualify them from most definitions, but maybe I should have just let it slide since we're significantly better off so maybe it's not my place to say.", "created_utc": 1697823594, "permalink": "/r/AmItheAsshole/comments/17cgx8q/aita_for_telling_my_sil_that_shebil_arent_middle/", "score": 876, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Maybe it wasn't my place to criticize that, even if I don't think she should say it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  They aren't middle class and your not an AH for pointing that out.\n\nFor reference, the middle class is defined to be from 2/3 of the median income to 2x the median income.  That's about $50K to $140K on average, but obviously higher in HCOL areas.\n\nI'm no trust fund baby; there was a time we got food stamps.  Now my wife and I each make over $100K and we have a hard time remembering that we are NOT middle class.", "Is unpaid leave to change careers a thing middle class people do? Especially when they are living paycheck to paycheck? \n\nNtA.  She sounds jealous and resentful because maybe she's living under the illusion that you and your partner have a bigger trustfund?", "Going with NTA - folks with trust funds should not be complaining. That alone probably puts them in the top 5% of income earners.", "NTA I think you gave her a taste of reality. Many live beyond their means and that is a huge problem worldwide. Not sure she'll listen to your advice on spending priorities though.", "Yeah, they don't understand that \"living paycheck to paycheck\" has nothing to do with getting a fat paycheck every month and spending it all. Like yeah, if I made 100k every month and spent it all because I'm a queen of expensive lifestyle. Middle class, sure.\nYou're NTA. They sound insufferable.", "NTA - Sounds like she needed some perspective", "The real problem is that the term middle class has become meaningless because for decades people have pushed its bounds at the top and bottom ends.", "People who live a lie never respond well to the truth. NTA.", "NTA. She not middle class. Good luck trying to convince her though: it sounds like she’s defined it as living paycheck to paycheck rather than as not having access to much money in the first place. It sounds like she’s got an emotional investment in being salt of the earth and/or middle class as an identity thing. You’ll never convince her logically, because identity is often more emotional than intellectual: she feels like she’s middle class and views herself as middle class, so anyone who says otherwise *just doesn’t get it*", "NTA - I think giving her a realistic perspective on what life is like for the majority of people, *especially* at the moment is something she really needs.\n\nImagine if she says this to someone who is actually struggling.", "NTA.  She's either a little dim about things or insanely entitled. I'm going with...both.", "NTA, I’m in a similar boat to OP, my spouse comes from an upper middle class background and his parents ensured he had a solid launch point (no trust fund income, but in other ways). I think the SIL needs to pull her head out of her ass and appreciate the fact that no one wants to hear about the “struggle” she and her husband created by unnecessarily living at the absolute maximum of their means.", "I'm confused by your numbers, I'm thinking you mean they are in the top 10 to 20% not 90th or 80th, that means 2 different things. Their house in the top 5% of the city, meaning it's more expensive, if it was the top 95% it would range from the cheapest to close to the most expensive. \n\nNTA your BIL & SIL are just living beyond their means.", "Maybe it's different in the US than in the UK. I wouldn't call them upper class or working class but would indeed consider them middle class. Inability to live within your income isn't a class issue for me.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband's family has money. Both my husband and his brother John grew up with private school, credit cards, and nest egg to start their life. I'm going to stay away from real numbers but basically their passive trust fund income alone would put them in the top 90% in our country and the top 80% in our area.\n\nMy husband invested early and entered a high-powered career. John failed upwards into a legacy college and a management-level white collar job but his career is pretty stagnant. He and SIL live right on the edge of their finances and carry around a lot of debt. SIL freelances on and off for extra income.\n\nThere's a lot of friction between my husband and John over money. Both John/SIL have implied multiple times that we're out of touch and my husband got lucky while they're regular salt-of-the-earth people. usually we let it slide because it's true that we're much wealthier than they are.\n\nBut I was with SIL recently and finally cracked. She was saying John wants to take unpaid leave to change careers, but their lifestyle is at the top of their income and they barely have savings. SIL said they'd have \"no money\" and I said \"don't you still have the trust income\" and she said \"yes but that's barely enough to survive.\"\n\nI said there were a lot of people who \"survive\" on a lot less. She rolled her eyes and said that was easy for me to say and  that real middle class people like her and john were \"living paycheck to paycheck.\"\n\nI said your house costs [95th percentile for their city], I don't think that's middle class. She was offended and started listing off all of the expenses they had, basically the income from the trust alone would only over their mortgage much less all of the other expenses like private school. I said most middle class people don't spend on __ and ___. She said well you and your husband do, and I said yes but we're not claiming to be middle class.\n\nShe got upset and said she wasn't \"claiming\" to be anything and I was being a snob.\n\nObjectively like I said their passive income alone would put them in the top 10% which would disqualify them from most definitions, but maybe I should have just let it slide since we're significantly better off so maybe it's not my place to say.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: don't dance around with percentiles, how much is the annual trust income?", "NTA\n\nMiddle class people do not usually send children to private school or have trust fund payments.  If they need to, they can sell the big house and get another in their means.  Problem solved.", "NTA\n\nLiving beyond your means doesn't make you middle class...it just means maybe your BIL and SIL should consider downsizing to I dunno...90th percentile? 85th? Maybe they'd be able to fit a nice Audi in their life to make up for it...\n\nEither way, your SIL is delusional and you weren't an asshole about it, you just corrected her foolishness.", "Well you just told her that her justification for mooching off of you isn't justified so no wonder she's pissed. She wanted to be the poor poor middle class living paycheck to paycheck but you HAD to take it away from her. How cruel.", "YTA. Well documented that nearly everyone thinks they're middle class. If there's someone poorer than you and someone richer than you, then people find a way to think they are middle class. \n\nThey're doing what the vast majority of humans do. Think that they are average. \n\nGood on you for recognizing your privilege. Just know that the worst way to change someone's mind is to point out how they are wrong with facts and examples. Counterintuitive at first, but we all do it. If we're told we're wrong, we immediately start coming up with reasons why we thought we were right in the first place.", "Some people just don't understand that \"I'm broke because I spent all of my money\" is **not** the same thing as not having money to begin with.\n\nNTA", "She did use 80% instead of 80th percentile in the first paragraph, so she was using the numbers wrong.\n\nEach percentile represents 1/100 of the total.  The first percentile would be the lowest, and the 99th percentile would be the highest in value.\n\nA percentile is the value at a particular rank. For example, if your score on a test is in the 95th percentile, a common interpretation is that only 5% of the scores were higher than yours. The median is the 50th percentile; it is commonly assumed that 50% of the values in a data set are above the median.", "Percent and percentile are basically the opposite there. If you are in the top 10%, you're in the 90th percentile. \n\n\nBut what OP meant was obvious.", "I thought so too, but I wasn't the one who was confused by her numbers.", "Then why are you explaining percentile?", "I replied to Use\\_this\\_1, who was confused.  Why are YOU explaining percentile?", "NTA. SIL and BIL are delusional about being middle class. Problem is, pointing out the obvious to them not only pisses them off, it's like beating a dead horse. You're just wasting your time and energy. Let them live comfortably in their delusion and inwardly laugh when they make dumb comments like that.", "NTA one of my college professors did an exercise where he asked anyone who thought they were from a middle class family to raise their hands. It was almost everyone (one kid who didn’t had a family jet).  He asked us to privately consider family income/education/marital status, then pointed out how unlikely it was that a classroom full of students with those kinds of families at a private school of the sort our university was were just middle class. But people like the idea of being middle class. I think it makes them feel normal or is in the safe zone - away from 1% but not poor.", "Every time my broke ass comes here and sees rich people bitching about being rich I chuckle. Haha! First world problems. How do you even judge this one? You're both kinda assholes here. But honestly, this is barely a problem. Let them sink their own ship.", "ESH - you both have big hang-ups about money.  \n\n\"John failed upwards into a legacy college and a management-level white collar job but his career is pretty stagnant.\"   You are clearly an entitled snob.\n\nStop talking about money.  No one wants to hear how much you have or your opinion on what others do and do not have or how they spend it.\n\nNow that your have freed up all this time which you used to devote talking about money, start doing some good in the world with the money that you married into (is that also considered failing upwards?).", "YTA.  For nothing else than asking the huddled masses of 10 per centers to weigh in on your very first world problems.", "ESH  \nI don't understand why you are so obsessed with each other's life styles and income. It sounds like they are barely living within their means - but their means are far more than the average middle class family.", "You aren't upper class, until you don't have to work. \n\nAnd then you aren't really upper class until your family hasn't had to work for several generations, you're just mere gentry.", "NTA \n\nBut you were never going to “win” the argument with her. She’s not going to say - gee whizz you are right \n\nBest to keep things more neutral or move to another topic next time", "Nta", "NTA, Your income has nothing to do with them being middle class or not. \n\nThey are not middle class. They are very well off. The fact that they have no savings and live check-to-check is 100% down to their spending priorities. \n\nYou should let her know that you and your husband know you are not middle class and that you are very fortunate but that you work hard for everything you have. If she does not like what you have to say about these things perhaps she should not bring up the subject.", "Shame. Such terrible problems", "NTA. Better she hear it from you than someone who lives on less who she’d insult with her cluelessness.", "No. NTAH if he can take an unpaid leave to find another job, they ARE NOT middle class. Middle class people wouldn’t consider that to even be an option. A middle class family would have a job already in place before going to another one because they can’t afford not to without proper savings.", "This reminds me of a parent at my child's (private) school. They had a big house in a super HCOL area, and a 3 bedroom \"cottage\" with private access to Donner Lake. They took a vacation to Europe almost every summer. They went on skiing trips numerous times each winter. They owned a speed boat for summer water skiing.\n\nShe insisted they were middle class because her husband had to work for a living (as a banker).", "NTA and what is this trend with rich people claiming they’re “middle class”???", "NTA No one with trust income that covers their mortgage is salt of the earth. If their careers don’t afford them to have what else they want, work harder/better or scale back the housing situation to cover those costs as well. NTA", "NTA... yeah I'm not going to look up the 'go fund me'\n\nThey can sell stuff and live within their means.", "NTA reality checks are though love.", "NTA. \n\nShe lives in lala land.\n\nProbably in one of the nicest houses on the block, too!", "NTA but it sounds like this is a very sensitive area for them.", "YTA\n\nfirst world problems, 2 rich people arguing about how rich they are. Sad really", "NTA\n\nThis is giving off “Posh Spice claiming to be middle class and Beckham calling her out” vibes. Your SIL is delusional.", "Math check.  “Top 90%” is anything greater than 10%.  So it could mean being in poverty.  I think you mean top 10%.  \n\nNTA", "NTA . Middle class is a big bucket, but they are way out of it. There are many super wealthy people who can't manage their finances and go broke. Eg. Many pro-athletes.  It doesn't make them middle class.", "NTA", "NTA", "I will say some of the wealthiest people can be some of the most in-debt people, especially if kids are involved and if there are expenses sponging up most of their income, that doesn’t mean SIL couldn’t live comfortably off of cutting back on a few expenses. \n\nNTA", "ESH. All y'all's obsession with money and how much everyone does or does not have is disgusting.", "NTA\n\nThough there is a difference between middle class as defined by earnings and middle class as defined by savings. There are about 7 other definitions that I am aware of (culture, education, occupation, etc). Essentially, almost anyone who wants to be middle class certainly has someone they can look to for proof of their own middle class standing.\n\nMaybe she wants to be thought of as middle class to explain why they're drowning in debt. Which is really an entirely different problem since not all middle class people are living paycheck to paycheck.\n\nI would avoid money discussions with her because they will turn into arguments.", "ESH, this is such a stupid thing to even give a second thought to so you're both TA. I can't even afford to eat every day this week and your wondering if you were an ass for telling your SIL she's not poor, she just spends too much money? Jesus Christ I wish i had your problems.", "NTA, but she'll never understand what you're saying so I'd avoid that conversation in the future.  No point in explaining that any financial problems they're having is due to poor planning and/or living beyond their means.  You pointed out why her thinking was wrong, but no need to go there again, it's a story she likes to tell herself.", "NTA", "ESH. I suggest you avoid ever talking about money with these people again. \n\nThey’re obviously out of touch. But telling them this wasn’t exactly the high road either.", "NTA. Top 10% you mean?", "NTA", "You probably still live like you are.", "Agree. Living \"paycheck to paycheck\" means that one skipped paycheck (or even a lower-than-usual paycheck) and you are in danger of not eating or being homeless. It do NOT mean \"I won't have money for extras\" because your housing is paid for by a passive income.", "Yes, they are confusing savings with income.", "Honestly, I pulled the equivalent of like 22k usd in a major Canadian city last year and I had to quit my job to find better employment. Finding work is a full time job - especially when you have a job that you can't just take breaks during to do interviews.", "Maybe they meant quitting to look for or start something new? Some middle class people do that; the smart ones plan for it, but not everyone is smart about it.", "A trust fund that generates enough income to pay a mortgage on a 95%-percentile home! These people need a reality check.", "In the UK as well. I think the difference is that in the US class is much more directly linked to income than it is in the UK. Here you can be upper class/posh, but have middle to lower middle class income as class is only partially money based - it's more to do with family background, education, cultural interests as well.", "To be fair we have no idea what kind of background she's from", "you mean, to people from the working class?\nhttps://youtube.com/shorts/zsWJ3YO-0oI?si=-VZrjZXIG80gSQjF", "Isn’t implying that privileged people like John get more opportunities than they deserve sort of the opposite of snobbery?", "[removed]", "As opposed to what, landed gentry? Lol.", "It goes back and forth.  \n\nI don't clip coupons anymore, but I still go for what is on sale. I mow my own grass and my car has 120K miles on it.   We recently cancelled all of our streaming services because they were \"too much.\" \n\nAnd yet we are planning a trip to Europe next year.  It's weird.", "That was a sarcastic question because I don't think you have that luxury if or when you're living paycheck to paycheck.", "If they are living paycheck-to-paycheck, they'll get one soon enough. Because life isn't static.", "We never had an aristocracy, so there was rwally nothing else to base class on.", "Income is central to it, but it's also a mindset. A lot of people in the US are very invested in the idea of pulling yourself up by your bootstraps/living the American dream/being regular, honest folk. And that usually equates with being middle class. There's a strain of people who are higher income and don't want to be viewed as out of touch rich people who might not have gotten there without at least a few favors. Because then they're not regular folk who made it all by themselves. So they cosplay as middle class.\n\nThe issue more broadly is people's steadfast refusal to acknowledge their income advantage or privileges that got them there, which often leads to terrible public policy. They pulled themselves up by their bootstraps -- why should they pay taxes to support schools, roads, and libraries, or support programs that help people feed our house their families? The mentality is dangerous.\n\nI grew up generally middle class income wise and privilege wise, but I also experienced economic instability that informed a lot of my life. I was not poor, and I won't say I was because I don't know the realities of poverty and that's an important distinction to me. I won't pretend to know something I don't. I'm high income now and I have no problem acknowledging that or paying higher taxes. I hate the bootstrap nonsense.\n\nEdit: grammar", "Yep I agree, although the presence of a trust fund income would possibly imply upper or upper middle class (not always of course, eg sometimes would be the result of being orphaned young etc, but that doesn't seem the case here) \nBut I agree income is only a part of the whole class system over here.", "I love this video so very much.", "HAHAHA so good! TY for posting this gem.", "Makes me so happy how he called her on it.\n\nWorking hard is not the same as working class lol.", "A friend of a friend one time called it the difference between \"need broke\" and \"want broke\", and I've never been able to forget that distinction", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "What we definitely are NOT is \"upper class.\"  We may be upper income.  I think that's the problem here.  No one has a problem being called middle class.  But both \"upper class\" and \"lower class\" have negative connotations.\n\nClass is not determined by income.", "It's such a mindfuck going from poor to a properly comfortable income. I randomly found a *great* deal on pads via Facebook marketplace yesterday and bought them to my husband's horror. \"We *have* money!\" was repeated a few times.\n\nSorry, my formerly dirt poor child self wasn't going to pay 60% more just to buy them from a store. But I'll shrug away that same $30 I saved on an essentially useless hobby and toss more money after it. It's so so weird.", "Not weird. We drive cars forever and clip coupons so that we can do those nice trips.", "All my streaming services together over my entire lifetime cost less than 1 month of my mortgage. I try to remember where I came from and save money. Usually when I think about cutting streaming services I realize that I make more money in the the ten minutes I would spend cancelling the service than I spend on it. Cutting housing costs and taxes are the only things that really make a difference anymore.\n\nI am also not middle class.", "Take it from me, Europe is much better than streaming services.", "Yep.\n\nIn the US, pretty much everyone from people living in a cardboard box to people living in a palace with multiple yachts thinks they're \"middle class,\" because they think \"middle class\" is a synonym for \"good person.\"\n\nThis is why our politicians pitch every proposal in terms of what it will do for the \"middle class.\" Because no matter who it really benefits, everyone will see themselves in it, think it's about them.", "My husband and I are in a similar income bracket. I've come to call us upper middle class. Do we have a lot of the privileges of the traditional middle class? Yes. Do we make more than the true middle? Also yes. Are we even close to being truly wealthy? No. The wealth curve is exponential and we're closer to the true middle in terms of buying power and the lifestyle that buying power supports than we are to the lifestyle and buying power of those in the top 10% of our area.\n\nI also feel like the only people who literally can't live at the edges of their means are likely the 1%. The billionaires for whom literally nothing is expensive enough to truly cause them to tighten their belts for even 5 minutes. Your ability to spend your bank account down to zero isn't indicative of how much cash flow you have, just at a certain point it's indicative of how expensive your lifestyle is. If your monthly expenditures are what some people live on for a year, there's nothing middle class about your lifestyle.", "hell yes, let's talk about class and its relation to the the productive forces in am i the asshole. i am here for this, as the kids say", "\"Class is not determined by income.\" Yes it is. That's literally part of the definition. \n\n\"class\n\na group sharing the same economic or social status\" - Merriam-Webster", "Maybe not solely, but once can't make 50K a year and 'claim' to be upper class.  The upper class, at least in the U.S., are almost always the highest earners.", "I’m sorry but only someone with money would say that. Lol", "I grew up middle class but also experienced a level of economic instability that stays with me even now. I know how quickly it can evaporate with a few bad turns and no backup. \n\nWhich isn't to say I'm not high income now. I am. But what I don't have is generational wealth -- I have family that could help a little in a pinch, which is invaluable and possibly life saving if things are bad enough. But I also remind my partner that even now, we have to be careful, we have to plan, and if we have chances to come into real money, we need to think carefully and save. It doesn't take a lot to drown in debt, one bad medical event really. But that does not change the fact that we have a lot more than other people and that's both hard work and luck, and I won't pretend otherwise.\n\nI think about this a lot because my experience was nuanced, and I think it would benefit this country if we were a little more honest with ourselves about this.", "Did you bring the popcorn?", "OR SOCIAL.", "Income, though, is only part of economic status. Wealth, including family wealth, is another part. When I was in graduate school, I was earning a poverty-level income, but I always knew that if I had an emergency, I could ask my family for help. Contrast that to the people – 57% of Americans – who [don't think they could afford a $1000 emergency expense](https://fortune.com/recommends/banking/57-percent-of-americans-cant-afford-a-1000-emergency-expense/#).", "the people's popcorn is popping as we speak", "Brag much?", "YTA for even getting to that point.\n\nShe was venting, sympathize and move on.", "ESH\n\nMiddle class has no agreed upon meaning, you're arguing semantics about something that doesn't have a clear definition\n\nFind something else to bicker about", "I think people who feel the compulsion to compare W-2’s like this are assholes. If you need to talk about your income, humble brag and drop percentages; you’re nouveau riche at best, tacky and a bit pathetic. Wealthy people don’t bring up their wealth.", "Info : why do you talk to them ? I'll 'ever understand adult who hangout with people that have nothing nice to say to them.", "NTA.\n\nShe was reverse humblebragging. \"We're *real* people.\"", "NTA. You need to send SIL the clip of Victoria Beckham claiming to be working class while her dad drove her to school in rolls royce. Poor money management doesn't make one middle class lol", "NTA. As someone who actually lives paycheck to paycheck, I appreciate your attempt to educated your SIL on the fact that that’s not her.", "Middle class - those of society that work 40+ hour weeks aspiring to one day retire and relax.", "Funny how they’re not middle class & somehow living paycheck to paycheck. I’m not sure what to make if that, classwise. But yes, even living beyond their means, it sounds like you’re correct in saying they’re not middle class. NTA. It sounds like SIL needs a reality check.", "NTA... I'm on 130k+ and felt like I was middle class when I was living pay to pay. But after doing my budget and watch what I spend. I'm surprised how much spare cash I have each month to pay off my debts plus saving.\n\n\nNow I think I'm fortunate enough to be able to get myself out of a financial hole quicker than someone who earns actual middle class income.", "The Middle classes (of while I am one and in a HCOL city, barely there), HAVE to work for a living. If we have the luxury of passive income, it is only a negligent part of our income and is for....luxuries.\n\nYour SIL needs a book on personal finance.", "NTA I have a family member who ended up with a very wealthy job and still has the balls to claim he's \"middle class.\"\n\nDude you live in a mcmansion and switch out your car every other year for a new expensive one. For fun. You fly to a different state at least once every month to sample different restaurants. And you are still financially secure after *all that*--You aren't middle class.", "NTA", "If you're going to be anonymous, just say the numbers.", "NTA, she just sounds like one of this people they like to bitch and loan all the time; because they have nothing better to talk about.\n\nI have a friend just like this, eventually if you tell them enough; they’ll get the hint and just stop talking to you about it.", "NTA. Anyone that can live off of a trust is not middle class.", "I was raised pretty up there in terms of class, and I have no trust fund. Trust fund is usually for like… big money. \n\nHaving more expenses does not make you lower class", "My parents always defined it growing up is that if you would lose your housing if you stopped working.", "Depends where you live. $200k in many parts of CA is not a lot and you won’t be living large in any way.", "In my area in 2018, $74k was considered the upper limit of low income if you were the sole provider for a family of 4.", "To show how out of touch the sil is: I get less than $2k a month and live on it. I'll admit it's not easy and I'm not going on any vacations but I survive.", "It really doesn't matter what \"class\" your BIL and SIL think they are. The truth is that they are living beyond their means, and that can be done at ANY price point. \n\nSo really, next time your SIL complains, point that out. It's not about \"class\", it's about having a budget", "No lie.  They aren't middle class.  They're just bad with money.  You can be a billionaire and be bad with money.  Just ask Elon.", "Believing she’s middle class feels better than acknowledging they’re fiscally irresponsible", "I'd argue that a trust fund that pays the mortgage on *any* home automatically removes you from the middle class.", "I get that. My parents recently retired after scrimping and saving themselves into financial comfort. When we were little, there were several years they didn’t buy themselves any new shoes. But now they’re in a position to comfortably care for themselves for the rest of their lives as long as they’re somewhat prudent. My dad is still a total tightwad in so many ways, but he just bought a $30,000 Tundra. WITHOUT us having to bully him into replacing his unreliable truck. This man has never sold a car: he runs them into the ground and then he turns around and buys something else reliable but old, and he is replacing his running truck with the most expensive car he has ever purchased. \n\nSometimes I tell him I think he’s been body snatched. But then he quibbles about throwing out freezer burnt bagels and fixes his shoes with duct tape and I know he’s still my dad.", "It's not weird. It's called having your priorities in the right place. Save money where you can, and splurge on the truly enriching things like travel. Especially Europe! Have an amazing time!", "That’s called priorities.", "My sister makes pretty good money and is single. She bought a $5,000 bike no sweat but then REFUSES to buy meat unless it’s on a good enough deal. She also only had one bath towel for awhile and would be like, “I can’t shower til my laundry is dry.” I looked at her and said, “You have money! Go buy another towel!” I make fun of her lots for her “spend nothing or spend thousands” style.", "I feel you.  Me and hubs both come from families that struggled and our household income is now solid mid six figures.  A few weeks ago he came home from city hall, delighted, because he found out the city gives out free tampons.  And he brought me one as a gift.", ">Take it from me, Europe is much better than streaming services.\n\nPossibly -- but can I binge Europe and animal crackers until 3 a.m. in just a pajama shirt with no bottoms?", "\"If your monthly expenditures are what some people live on for a year, there's nothing middle class about your lifestyle.\"\n\nTHIS 100%", "\" Go buy another towel!” I make fun of her lots for her “spend nothing or spend thousands” style.\"\n\nMaybe not to that extreme but that is just people in general. In that different people prioritize different things. \n\nStuff that I like prioritize I have no problem spending money on, but other things lower on the list, I won't buy unless I can find a good deal on. \n\nLike clothes I buy \"cheap\" clothes and/or buy clothes that fit okay enough, shoes half a size too big if it's on sale/clearance etc.... \n\nBut beer/video games/restaurans I have no problem paying full price and/or going to fancy places. \n\nI have friends/family who rarely go out to eat, and usually when they do it's fast food. But spend hundreds/thousands on x/y hobby no problem. \n\nSpending money in different ways is fine, nothing wrong with it if you can afford it and it makes you happy.", "Depends on where you stay but you do need to know the local idiom for animal crackers.", "And I should clarify, the making fun of her is all in good fun. We are a teasing family, and she absolutely took it in the light hearted spirit it was intended."]}