{"id": 29326, "submission_id": "17cic29", "title": "WIBTA if I tell my friend that her partner cannot be a +1 to our wedding?", "selftext": "I (f22) will be getting married next year. So far, planning has been a mixture of fun and stressful. Only a few of the guests attending have ever been to a wedding, making it a bit tricky to discuss boundaries and expectations with them.\n\nMy partner and I have agreed to give our friends who are in relationships a +1 as long as the couple has been together for longer than 6 months and we've met them.\n\nOne of my friends (f21) has been in a relationship with her partner (m22) for a year. I've met him a few times, and although I don't dislike him, he has a tendency to overdrink. This has led him being kicked out of bars, wetting his pants, falling down, and breaking things in public.\n\nOur wedding will have alcohol. We are having signature drinks and unlimited beer & seltzers. I asked her if it would be possible for him to keep his drinking to a limit, and she said she honestly didn't want to monitor his drinking because her telling him not to drink too much wouldn't work anyway. He's very much a person who does what he wants.\n\nI let her know that this is a wedding, not a night out. He can drink as much as he wants at a club or bar, but he cannot black out at our wedding.  This made her pretty upset and I let her know politely that if after she talks to him, he's still unwilling to change, he will not be permitted as a plus 1 for her.  She told me I could speak with him because he would take me more serious as I am the bride, but I told her again that this makes me uncomfortable because I've only spoken to him a few times. She said that if I'm unwilling to ask, it doesn't mean that much to me.\n\nShe thinks this is unfair because other people are bringing their significant others as +1 and they haven't been together as long she and him have. I told her that this is different because of the context of his behavior. She is still getting a +1, but she says she has no one else to invite.\n\nAITA?\n\nEdit: There's a comment stating that I'm forcing or pressuring people to drink. Nothing like that is going on. I only drink on special occasions. Same with my fiance'. Our wedding is a special occasion. ", "created_utc": 1697827433, "permalink": "/r/AmItheAsshole/comments/17cic29/wibta_if_i_tell_my_friend_that_her_partner_cannot/", "score": 305, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I could be the asshole because she has no one else to invite and doesn't know a ton of the other guests. She also technically isn't responsible for his behavior because he is an adult.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YWNBTA\n\nI feel like you are being logical and proactive. You are faced with a problem drinker who in all likelihood will ruin your reception and cause drama. Nobody wants that at their wedding. \n\nI would not talk to this person or set limits. I would actually just eliminate the problem and exclude him. It's not your responsibility to police your guests and make them behave. He is your friend's problem and she's apparently afraid to address his drinking problem with him, which is very telling. She is offended because she's in denial. This might be a wake up call for her, because this is a glimpse into her future if she stays with him. \n\nYou get to decide everything for your wedding, and this is obviously causing you stress. Nobody is entitled to a wedding invitation.", "NTA - If he cannot control his drinking and his behaviour, then yours will not be the only event he’s not invited to.\n\nHe’s a grown adult and needs to take responsibility for his actions. If he incapable of or refusing to do that, he absolutely cannot be surprised at being excluded.\n\nI’m finding it odd that your friend can’t understand that.", "NTA\n\nNobody likes a sloppy drunk. Signed, a former (reformed) sloppy drunk", "NTA.\n\nShe is your friend, not him. You spoke to her, and very politely made your boundaries known. If she isn't willing to impress upon him the importance of this request, she isn't that interested in attending your wedding at all really.", "NTA.\n\nThere is no need to allow anyone to attend that you don’t want there.\n\nYou’ve made it clear to your friend what your boundaries are.\n\nHer suggestion that you speak to him, not her, is ridiculous. He is her +1, ie, her guest, and she is therefore responsible for him. Unless you actually put his name on the invitation, then it’s up to you.\n\nThat said, even if she talks to him and he promises to behave make certain to have a couple of people aware to keep an eye on him and to escort him out if he starts to get sloppy.\n\nEven were it to go horribly wrong it doesn’t have to ruin your wedding or reception. Neither you nor your partner should engage, let others deal with it and keep your attention on one another and those there to truly celebrate with you.", "NTA, he pisses his pants he gets so drunk. you don’t need that", "Lol NTA. Boo this woman.", "NTA. I was in a similar situation for my own wedding, I didn’t listen to my gut and it ended with a fight in the parking lot and the police were called. It was an embarrassing blight on an otherwise beautiful night. I feel for your friend, but her boyfriend is not your obligation.", ">He's very much a person who does what he wants.\n\nNope. NTA.", "> This has led him being kicked out of bars, wetting his pants, falling down, and breaking things in public\n\nNope. NTA. \n\nIdk about you, but when I signed for my wedding venue, I took responsibility for the conduct of my guests. I’m not taking responsibility for anybody I know has habits like that.", "NTA. He has an issue with binge drinking and making a fool of himself. Why would you want him or your friend at that wedding for that matter if she won’t even talk to him about his problematic behavior?", "NTA. He isn’t YOUR guest, he would be HER guest, so it’s up to HER to talk to him about the event she would be bringing him to. Yes, it’s your wedding, but you have little to nothing to do with him.", "NTA \n\nShe is scared to confront him about his drinking and tbh, she probably fears she wakes it “worse” by bringing it up. \n\nTell her that he isn’t invited, she can feel free to explain it however she sees fit. If you want my honey opinion, he will make her choose her or you over this. I think she is in an abusive relationship.", "A possible solution is to not give this one friend a plus one at all.   \n\nIf she doesn't dare to talk to him about this, this isn't a good relationship for her anyway, and solves the problem for her of needing to talk to him about it.  \n\nShe can come alone.  She's already told you she doesn't have anyone else to ask. \n\nNTA.   You don't want someone at your wedding doing such things as this guy does.  You can't trust him.  So, not trusting him is a reasonable choice.", "NTA\n\nI initially thought of distributing drink tickets, but there's nothing stopping an alcoholic from stealing, buying, or trading for methods to access more.", "Maybe this will be her wake up call to ditch him.", "NTA. \n\nDoes her boyfriend even want to be there? Probably not. If he 'does' want to come it's probably because his girlfriend put pressure on him. \nI suppose you could talk to him if you want to be nice to your friend and if you want to save the friendship - but I think it's worrying she ignores his drinking behaviour in favour of telling the rest of the world they are big bad meanies for not supporting his right to black out, hurt others and damage property.\nYour friend will be very hurt he's excluded. Your friendship will most likely be over. But the alternative would be a stressful wedding, bouncers and probably a ruined party.", "NTA. You don’t want this guy to ruin your wedding.", "NTA. Your wedding, your rules. And your rule here is very reasonable given the context you shared.", "NTA - if he can’t control himself at a wedding then that might be another issue in itself. And if she’s really that upset about him not being able to attend then just don’t invite her", "NTA\n\nThe dude cannot control his alcohol intake and starts trouble. A wedding is no place for this. He shouldn't be permitted to attend. If the friend won't go, her choice. But that dude is not a good guy.", "YWNBTA. It's not unreasonable to want people to drink responsibility at your wedding. You're likely paying for photos to be taken. You don't want guests to be uncomfortable. It's also not your place to tell someone else's partner what the expectation is. She can address it with him. If he doesn't want to act like an adult, he doesn't need to come.", "NTA. getting so drunk that you piss yourself and break stuff is not normal and the fact that she can’t talk to him because he’ll ignore her is a huge red flag. hopefully this will give her the push she needs to reevaluate the relationship and his behaviour.", "I cannot understand why people are so nice about these things. I have straight up told some of my friends before that their significant other isn’t invited because they act like a fucking douche bag when they drink and I’m not dealing with it. 🤷🏼‍♀️", "NTA. She’s sounds like she’s in an an abusive relationship to be honest. Tell her he’s not invited at all anymore since she doesn’t seem to get it. If she protests disinvite her as well.", "NTA.\n\nIt's your wedding, if he's a trouble maker then he's not invited to ruin your wedding.\n\nyour friend needs to understand that its your wedding, you dont want it ruined or having a scene caused because one guest cant handle his drink, if she doesnt want to censor and limit his drinks then he isnt invited, it's that simple imho.\n\nenjoy your wedding and i wish you and your partner all the best!", "Anyone who consistently gets kicked out of bars and pisses himself when he drinks should not be invited to a wedding with alcohol, whether it's an open or cash bar - that would be a great big NO.  YWNBTA - NO plus one for her", "NTA. But the easier way would be to just identify him to the venue and tell them to monitor him or cut him off after a certain number of drinks. That way they both get to come, he will be limited, and you won't appear as the bad guy.", "Where's the bartender? Have them cut off anyone — not just this guy — who's over consuming alcohol.", "[deleted]", "So, the fact that you won't talk to him when it's YOUR boundary that needs to be set, is a problem.\n\nYou are making a specific rule for him, that goes against your stated rule about +1s. \n\nYou have every right not to invite him. Or to have a designated person whose job it is to kick out anyone getting too drunk.\n\nBut YOU need to communicate the boundaries for your own wedding to the people who need to hear them.", "Maybe this is the shot in the arm your friend needs. She is going to have to face the fact that if she stays with this guy, there will be more events they will be uninvited to, there will be humiliating scenes at other events, there will probably be legal bills and bail to pay. If her partner wants to continue to go on acting like an AH, maybe this will help her to wise up sooner rather than later.\n\nMany years ago at my brother's wedding, a family friend became exceedingly drunk and behaved inappropriately. It pains me too much even now to recite the details. The friend's wife was weeping in humilation, my parents were embarassed, and when he finally sobered up, the family friend was mortified that he had caused such a scene. The good news is that he immediately sought treatment and never drank again.\n\nAlthough OP's friend's partner sounds like too big a jerk to learn anything from  this, maybe the friend will....", "NTA - This is why ‘rules’ are a mistake. It’s your wedding invite anyone you have a personal (and positive) relationship with, even if it is only through their partner.    \n\nA good party - including a wedding- has to be planned to have a good mix of people. That way someone without a plus one doesn’t sit alone at your wedding.  I think the plus one concept  overhypes the singleness issue and plays into insecurities. \n\nAnd let’s face it, the girls will get on the on the dance floor as a group. Meanwhile the the guys are checking the game at the bar.", "NTA for not wanting him at your wedding if he doesn't accept your boundaries, however, YTA for asking your friend to communicate it to him, this is your job as the host, not hers as her partner....", "NTA. The bartenders should *not* be serving alcohol to anyone, but they can't control other people giving drinks to the inebriated.", "NAH. \n\nBut be prepared to lose her as a friend, at least as long as they are together.  \n\nHe is a sloppy drunk.   It happens.  I get you not wanting to have that at your wedding.  At the same time, chances are, there will be another sloppy drunk there if you have an open bar.  So you trying to put some kind of soft limit on him that you aren't putting on others, just won't go over well.  \n\nNow, truth is, if I was the boyfriend, I'd be happy to not attend this wedding, since you clearly don't want him there.  That said, in my experience, women care much more about going with their partner than their partners care about going.  \n\nAlso, I do think that if you are going to put some kind of restriction, you should be adult enough to communicate this yourself.", "[deleted]", "Unlimited beers and selters?\n\nYta for giving guests drinks that make gasoline taste better.\n\nNta for not inviting the drunk though. Its your wedding", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f22) will be getting married next year. So far, planning has been a mixture of fun and stressful. Only a few of the guests attending have ever been to a wedding, making it a bit tricky to discuss boundaries and expectations with them. \n\nMy partner and I have agreed to give our friends who are in relationships a +1 as long as the couple has been together for longer than 6 months and we've met them. \n\nOne of my friends (f21) has been in a relationship with her partner (m22) for a year. I've met him a few times, and although I don't dislike him, he has a tendency to overdrink. This has led him being kicked out of bars, wetting his pants, falling down, and breaking things in public. \n\nOur wedding will have alcohol. We are having signature drinks and unlimited beer & seltzers. I asked her if it would be possible for him to keep his drinking to a limit, and she said she honestly didn't want to monitor his drinking because her telling him not to drink too much wouldn't work anyway. He's very much a person who does what he wants. \n\nI let her know that this is a wedding, not a night out. He can drink as much as he wants at a club or bar, but he cannot black out at our wedding.  This made her pretty upset and I let her know politely that if after she talks to him, he's still unwilling to change, he will not be permitted as a plus 1 for her.  She told me I could speak with him because he would take me more serious as I am the bride, but I told her again that this makes me uncomfortable because I've only spoken to him a few times. She said that if I'm unwilling to ask, it doesn't mean that much to me. \n\nShe thinks this is unfair because other people are bringing their significant others as +1 and they haven't been together as long she and him have. I told her that this is different because of the context of his behavior. She is still getting a +1, but she says she has no one else to invite.\n\nAITA? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You don't want an obnoxious drunk guy at your wedding, and its not like he's some important person in your life anyways.", "NTA. I always say if you’re not going to give someone a +1, you should have a good reason. You have a very good reason. \n\nYou don’t need him vomiting and pissing all over your wedding. Be warned that this will impact your relationship with your friend and there really isn’t a way around that. But I think you really have to do it.", "NTA.\n\nHe drunks so much that he wets himself??? And he doesn't want to be told what to do.... Is he 15 years old? Tell your friend to grow the fuck up, this is YOUR wedding, if she doesn't sort out her loser boyfriend, then maybe she is also not invited.\n\nThis sounds insufferable at best.", "No, YWNBTA. Kudos for addressing this beforehand! If your friend wants to make this a problem between you, it's on her, not you. \n\nIf you're going to be with someone who has a drinking problem they're unwilling to address, then take your lumps when his presence is unwelcome.", "NTA. She has straight up told you that she will not even try to prevent him from drinking to excess. What does she expect? \n\nAt this point I would tell her to come alone or not at all. She wants you to risk having your wedding completely derailed.", "Your wedding, your special day, and your guest list and protocols.  You invite who you want.", "NTA, and good on you for getting ahead of it. \n\nI had a few friends that I was concerned about prior to my wedding. I didn't listen to my gut and they made absolute fools of themselves, to the degree that I really haven't spoke to them since.", "NTA.\n\nThe fact you have to even say it already means its a problem.  And yeah, either she gets him to agree (and security is aware that if his or anyone's behavior gets out of hand they can be thrown out), or he doesn't come.  Simple as that.  As the host you can exclude people for any reason.", "NTA- NTA!!!", "I think you should tell her if he is out of control, you will call the police. She can then decide how she wants to proceed.", "NTA. It's HER plus one, that means that she's responsible for bringing someone who will be respectful and won't start shit. If she isn't willing to talk to him about his drinking, she can't be mad that you don't want him there. No one wants to deal with someone who gets so drunk that they piss themselves, especially not at a wedding. It isn't your job to talk to him, it is your job to invite people who are going to make your wedding better, not worse.", "NTA. You do not need that kind of drama at your wedding!", "NTA, marriage is one of the happiest days of most people’s lives if not the happiest and a drunk guy crashing the stage would ruin it. Totally faur to let others be +1s if they are actually responsible with drinking.", "NTA. She'll bring him anyway. Either don't invite her or have security, give them his picture and have him thrown out if he shows.", "Can you have security or groomsmen escort him out if he overdrinks?\n\nIn fact, the original purpose of groomsmen was to protect the bride from evildoers, drunks, and other people crossing her.\n\nNTA", "NTA. It’s your wedding. And FWIW, he’s not gonna limit his drinking, even if he says he will.", "If this were a close relative like your dad or something you might have a quandary.  But this is an open and shut case.  NTA", "NTA you don’t  have to have them at the wedding", "I'd say it's pretty damn good sign you're dating an alcoholic if you can't trust them to keep themselves in check around alchohol for one night.", "Yep. Or a fighty (former) drunk.", "Agreed. Signed another former sloppy drunk.", "And she isn't a true friend. So, she is demanding to bring her loser BF who will cause a scene and potentially ruin the wedding, but making out like you're in the wrong??...", "This was my thought as well. Since friend can’t make good choices, friend doesn’t get a +1", "Yeah, we had that idea at first but the different bartenders I interviewed all advised against it as people take other peoples' tickets, steal leftover drinks, or just go buy booze from ubereats or somewhere nearby..", "It's an open bar and he's an alcoholic, he definitely wants to come. He probably doesn't care about the wedding part, but he'd for sure want to come for the free booze", "Until he makes a scene about how he isn't allowed more drinks. Sometimes there is no right answer...", "I thought about this too, but with an open bar it’s very, very hard to limit this. If his girlfriend enables him/if someone else procures drinks for him, this could easily spiral. \n\nIt’s so easy to say “oh, could you grab me a beer,” if someone says they’re going up to the open bar. I personally wouldn’t think anything of it.", "I think he would get his gf to get him drinks", "A good plan in theory, but cutting people off is rarely well received especially by people who \"very much do what they want\" and this is exactly the kind of scenario that could lead to a scene at OPs wedding.", "Yeah I’m not optimistic this would really work. He’ll find a way to get drunk.", "it’s an open bar, they wouldn’t be able to stop him from having someone else grab him a drink", "What? No. Regularly wetting your pants, breaking things, or getting blackout drunk are not at all typical. \n\nSingling someone out is appropriate because there is specific context. It is because his behavior is out of the norm.", "No, absolutely not. She is not obligated to say anything to him personally for anyone's sake. He isn't her friend. She isn't comfortable. It's as simple as that.", "The invite is for her friend, not him.\n\nYou don’t have to explain to someone why they aren’t invited.", "That would only be the case if he was actually being invited. But he's not. The friend is being invited and OP told her that if she wants to use her +1 for her bf, then he will have to abide by her rules and not get too rowdy with his drinking. \n\nAt that point it is on the friend to decide if she wants him to be her +1 and explain/enforce the rules with him. As a +1 the bf would technically be being invited by his gf, so it's the gf's job to communicate the boundaries and rules of the event to him, not OP.", "Disagree. He was not specifically invited he’s just a +1. He’s not particularly close to OP. If his girlfriend can’t control him, why should that be OP’s problem? She’s got enough to worry about planning this thing. And it’s not like it’s some weird personal boundary that OP has. I’m sure every person at the wedding would rather not have a drunken asshole pissing his pants breaking stuff and ruining the wedding for everyone.", "It is very reasonable to ask a friend to talk to her partner, especially since the bride barely knows the man. In a healthy relationship it shouldn't be a problem (apparently not the case here).", ">So you trying to put some kind of soft limit on him that you aren't putting on others, just won't go over well. \n\nWell, the difference is, OP *knows* this guy has a problem with alcohol, which means she *can* put a limit on him that she isn't on others bc she knows his behavior. Think about if you were hosting an event in your home and declined to invite a friend who was known to steal things. You're totally allowed to set that limit on that one specific person bc you know they'll most likely steal something of yours. Sure, it's *possible* someone else may do the same thing, but it'd be pretty ridiculous to set that same limit on everyone bc then there'd be no party.", "There are not - to our or OPs knowledge - other guests or +1s with a known history of overindulgence and poor behavior\n\nAlso putting another guest \"in charge\" of this guy makes them responsible if he sneaks drinks in the bathroom and then trips into the cake table...", "Most weddings have alcohol, why the fuck would OP not serve alcohol specifically for a friends boyfriend she has only met a few times? It sounds like you’re projecting big time here.", "This is ridiculous. She shouldn’t have to have a dry wedding just because of this one drunk that she doesn’t even know very well. And there is absolutely nothing here that suggests that OP has a problem with alcohol. She is just having a wedding with alcohol, like most people do.  And your suggestion that someone is pressuring the guy to get so drunk he pisses himself is crazy. The whole post is about people wishing he wouldn’t get so drunk.\n\nEDIT. And why do you keep talking about “so much alcohol”? She’s just talking about a wedding with an open bar. There’s nothing to suggest she is expecting or encouraging people to overdo it.", "You have never met an alcoholic have you?", "TBH, I though about that too, but getting the stink eye all night and OP looking into bouncers or something may deter him? At least that's what I hope. That guy sounds like a true nightmare.", "Also, if he knows he's going to be limited, 100% he will bring his own bottle(s) and stash it in the car or in her purse.", "Even with an open bar, there is a professional bartender.  They are trained to handle these types of stations and can identify other people procuring drinks.", "> There are not - to our or OPs knowledge - other guests or +1s with a known history of overindulgence and poor behavior\n\nI've been to a lot of weddings.  Probably 75% of them have had at least one person who got sloppy drunk.  They are in their early 20s with an open bar.  I'm speaking to what is likely.  \n\nAnd again, its not someone else's job to be responsible for this person.  Invite him or don't.  But don't make your issue into someone else's responsibility.", "While most weddings have alcohol, there are ways to limit consumption without being highly restrictive.", "I’m not projecting at all. I don’t drink. Not that I’ve never drank, but it is not something I need. And I’m not saying it from the perspective of OP doing it for the boyfriend, I’m saying it from the perspective of her doing it for her friend. Because as I and others have pointed out, if OP goes down this route, ultimately the friendship isn’t likely to last. \n\nAs someone who doesn’t need to drink, it seems like a small price to pay. And if isn’t a small price to pay for OP, then it makes me wonder because she’s only a year past the legal drinking age, and her friend is just at the legal drinking age, at least in the United States. Assuming this is where the OP is from. Thus, why all the alcohol?", "I actually have. I have multiple people in my family who were at one point. All of them quit the bottle though.", "If you need bouncers at a wedding you need to rethink your guest list. This guy doesn't need to be there.", "... Professional bartenders aren't psychics", "saying: “your bf can’t come if he cannot control his drinking to the point of pissing on himself” is not highly restrictive. what planet are you on?", "If there are ways to do that though then that makes OP and even bigger AH because then she’s banning someone over a non-issue…", "dude. changing how the wedding serves alcohol for ONE guest who she barely knows is unreasonable. you are way too heated up about this and i’m not engaging with you anymore, bye", "Yes you do indeed need to rethink the guest list. 'Hire bouncers' would only be an option if you are humoring your friend (or have other drunken or deranged relatives!). \nI think this friendship won't survive the wedding.", "Never claimed they were.  Fortunately, they don't have to be.  They can see how drunk a person is and whether people are continuing to feed him drinks.", "That is not what I said at all.  What I said is there are ways to offer alcohol to guests short of an unlimited open bar that are not highly restrictive.  This is a general availability to all of the guests and not the BF specifically.", "One can limit drinks with tickers or other methods, and set it to a number that would not restrict most people much.... and if he becomes sloppy later, is it really that horrible?", "They aren’t being paid to be babysitters,", "they don’t have the ability to monitor everyone and they can’t stop someone else from passing him a drink. it’s far better to just not have him there at all", "OP should not have to change how the wedding serves alcohol to accommodate one person she barely knows. there is so much planning that goes into a wedding and stuff to worry about. changing a set plan for one person is so unreasonable.", "What would Miss Manners advise? I'm guessing that she would tell you to invite your friend but drop the plus one. And make it clear to her that the numbers are fixed. I don't know of any rule of etiquette that says you have to invite a troublemaker to an event. If your friend chooses not to come solo that's her decision.", "NTA. My friend had a partner very similar to this, we decided to let him come to our wedding to keep the peace. We had beer and wine only- this guest was a large part of this choice. He snuck in a flask anyways and barfed TWICE at my wedding.", "NTA.  I dated someonenlike this.  No matter what you said he would deny it and say he could control it.  He would then proceed  to get so drunk that  he would still think he was fine till he had an accident, the change your clothes kind and it was everyone else's fault, because people didn't  stop him from drinking too much.\n\nHe won't change. Your friend isn't  being a good friend by trying to get you to tell him.  He will make a mess and she knows it.\n\nShe says she won't  have anyone to go with if he doesn't go, so you need to tell her that as much as you  would love to have her there you understand if she doesn't  attend because he is not invited to your wedding.  She can choose to come to your wedding solo, with a friend or not at all.  \nDon't give in because if you do you will spend the entire time worrying about how he will behave, etc. and you deserve to have your special moment without the drama.  You may also want to make sure you have people there that will keep him out if she decides to bring him anyway.", "NTA Though I would advise you follow her suggestion of being the one to speak to him. You claim this is not 'socially acceptable' because you've only met him a few times, and if this were just a generic gathering, weekend BBQ kinda thing, you'd be right. But it's not, it's a one-off special event: your wedding. \n\nYou are well within you rights to send him a message, or call him and say something like \"hey, I know you're expecting to attend our wedding as Friend's plus one, and we would love to have you there, however, I feel like I need to bring up something that's causing us some concern. We know you like to drink, and we're not judging you on that, but given this is our wedding, Groom and I would really appreciate it if you could practice moderation. We really don't want to be dealing with people who are black-out drunk at a night that is supposed to be a joyful event, and we will be stressed enough dealing with the day as it is. We're asking anyone who thinks they won't be able to control themselves and keep their drinking to a moderate level to really consider whether they might be better to attend the ceremony but not the reception, to think it over and let us know. We hope you'll be willing to make this concession and join us on this special day.\"\n\nMake sure you use 'we' and 'use' and not 'I' or 'me', so it doesn't make him think that he can get around you and \"well, you're just a prude and your fiance would agree with me!\" Also, make it sounds like you're not singling him out alone, make it seem like you're making this request of everyone. \n\nIf he then blows up, I suggest giving him a day, because let's be honest here, no matter how you phrase it, no one likes being told bad things about themselves, and our initial, natural reaction is usually defensive anger. But if, after a day or two, he's texting/calling you non-stop horrible abusive/insulting language, then you rescind his invitation altogether. \n\nOr if you really don't want to take the chance at all, maybe try and find a way to phrase it that is kind of passive-aggressive. Enough to piss him off, but not enough to make your friend angry on his behalf. \n\nGood luck. NTA.", "NTA.  If you decide to let him come, make it VERY clear that the moment he's seen exceeding two drinks, or shows any signs at all of drunkenness, he will be expected to leave peacefully before he has to be removed forcibly.\n\nAlcoholism isn't just drinking all the time; if you can abstain for weeks but are unable to control your intake once you start, that is a problem, too.  I hope she will take this as a sign to support him to find help.", "I mean she is right saying it might actually mean something coming from you instead of her. He’d probably just brush her off and do t anyway. He might even embarrassed you’re aware of him constantly pissing himself so much you had to have a conversation with him. I get it’s her SO and she should do it, but maybe meet her halfway or just not invite him at all because I definitely see her way of thinking. And if she does talk to him he’ll probably not care or actually listen and still get blacked out.", "NTA \n\nBut why don’t you just alert the bar tenders and servers to limit alcohol consumption for all guests to keep people from getting too drunk? \n\nI mean, nobody should be getting blackout fall down drunk at your wedding. Not just this person. The bar tenders should have plenty of experience with this kind of thing, and they should know that in a LOT of places if they overserve someone and that person causes an injury (knock on wood that doesn’t happen) then the bartender can sometimes be held liable. So a good bar tender will cut someone off without you even needing to ask them to.", "NTA no one wants a drunkard acting a fool, throwing up, or passing out at their wedding.", "YWNBTA at all. And I'm sorry, her excuse is just that, an excuse. Although I would be slightly worried why she is afraid to talk to her bf, it's still not your responsibility. This is something she is going to have to figure out or deal with. This isn't a hs party. People generally don't want or like to be around those who can not control themselves when they drink. He is an adult, and he needs to be responsible for his behavior. If he knows he gets out of control when he drinks, he either needs to monitor how, what, and how much he drinks or he needs to stay sober. This will not be the first, nor the last time, that her bf (and her by association) doesn't get an invite to events. It is also not your problem or responsibility if she doesn't have anyone else she can bring and doesn't want to go by herself. \n\nThis is what her future is going to look like if she stays with him. No one else is going to talk to him about it. That's not their job. Again, it's hers. \n\nYour choices are to tell her he can come but he is her responsibility, she needs to either monitor and control his drinking (which hardly ever works) or she needs to tell him to be an adult and behave properly at someone else's wedding. Or she can come alone or not come. The only other thing you could do would allow him to come, but have plans in place to kick him out the absolute instant he goes too far. It really comes down to how important it is to you that she be there. However, a wake-up call to her may not be a bad thing. Again though, her being afraid to talk to him (because that's what is sounds like) would worry me that he could potentially be abusive towards her and she doesn't know what to do or how to get out. That may not be the case at all. But it does concern me when a friend refuses to talk to their someone (SO, friend, family member whatever) about a known behavioral issue. She wants you to be the bad guy completely. She doesn't want to give him the chance to shoot the messenger. \n\nThe bottom line is if you don't want him there, he's not invited. If she doesn't want to come without him, you're sad she won't be there, but you understand. If she says he will behave, and you say ok, make it clear to her that he is her responsibility. That you will not hesitate to kick him out or call the cops if it comes to that. And you will not be responsible to any degree for any outcome of his presence", "NTA.\nThere’s no requirement that she bring a +1 if that’s the case. Does she know other’s who will be attending? She can tag along with some friends. I have a suspicion that she’ll also have a hard time telling her boyfriend he’s uninvited because I’m sure he will insist his drinking is not that bad…if he goes at all, then she should be uninvited too. It’s a hard thing to do, but the thing about weddings is…it’s not about the guests. It’s about you and your partner. \n\nShe’s still responsible when things get out of hand with him. I know it’s not fun for her, but it’s not fun for anyone. If she wants a night off from babysitting, she needs to leave baby at home. There’s no amount of “telling you to tell him” that will make you responsible for him instead of her, nor make him change if he doesn’t want to change", "NTA  \nHow are you possibly pressuring people to drink?  \nAnyway, I'm sorry your friend is unhappy but there is no way in hell I would invite a person who has a history as a sloppy drunk to my wedding. There is no chance that he will suddenly be able to control his drinking. Your every day, good time drinker does not get kicked out of bars, wet his pants, fall down and break things in public.", "I sure wish **I** would get invited to weddings.\n\nI don't drink. :-D\n\nNTA.\n\nThis is \\*her\\* albatross to wear, if she's dating someone like that, not yours.", "YWNBTAH. \n\nMy youngest sister just got married last month and she’s 27, her husband is 30.\n\nThey had an amazing wedding and spared no expense- open bar from start to finish. Busses to and from the venue from multiple hotels as well as tons of food and water being made available at all times. \n\nWe knew there would be people who really loved the open bar, and assumed that they would have a few people who would **really** take advantage of the free booze. \n\nWe had NO IDEA how much some people would actually drink, and there were truly at least 10 people who seriously embarrassed themselves that night. \n\nThe photographer and I walked in on a couple having sex, one of them fully naked, on my sister’s bathrobe (the bride) on the chaise lounge in the bridal suite. \n\nThen we found someone SHITTING outside in the garden. Wtf. \n\nAnyway, drunk people who can’t control their crazy behavior can really cause issues.", "NTA your wedding your choice", "NTA. Your friend better get used to being left out of invitations if she marries this drunk.", "Maybe don’t invite your friend and her alcoholic BF.    \nThat seems to be the easiest way to solve the problem.\n\nShe wants you to talk to him for her, and you have only met him few times.    \nShe doesn’t want to take responsibility for HER BF’s actions.    \nAnd she hasn’t learned that life’s not fair, because other people are bringing their significant others (who I am guessing are not alcoholic’s and won’t pee their pants in public)!\n\nSo, save yourself the hassle, and don’t invite either of them.\n\nGood Luck & Congratulations!", "My wife and I just celebrated our 25th anniversary a few days ago and there's one undeniable truth about weddings.  Within 3-5 years of your wedding you'll no longer be talking or spending time with half of your wedding guests.  People change jobs, move, life happens...don't invite her.  Think of it this way...let's say you'll have 100 guests at your wedding...you're going to be stressed and worrying over one person, a plus one at that.  It simply isn't worth it...enjoy your day with people that know when to say when.", "Your reasoning is appropriate.", "Definitely NTA, you set clear boundaries for your friend to communicate something to their partner (who could be potential problem, at your wedding). And it's YOUR DAY! You can choose what makes you most comfortable and happy. Period.", "[removed]", "“But I’ve put up with my blackout drunk longer than anyone else has been dating their SO, so I should get to bring him.”  🙄 I would uninvite these people from my life. They sound drunk and exhausting. NTA", "NAH, except the BF. He has a serious problem.", "Tell her she has a choice:\n\nHe stays away\n\nHe comes and behaves himself\n\nHe comes and starts acting like an ass and one of the 3 big guys you have at the wedding on alert for this kind of thing will quietly drag his AND HER ass out the door, and she will be forever shamed by all their friends for bringing this loser knowing his behaviour would risk the day.\n\nnote: of course #2 is impossible, but you have to at least put it on the table.", "NTA. Anyone who makes a habit of drinking until they wet themselves is an alcoholic.  Don’t bother with the “please promise to limit your drinking and behave yourself” conversation, an alcoholic’s word is worthless.  Just tell your friend he is not welcome because he’s an awful drunk.", "YWNBTA (you're NTA)   A person who gets drunk to the point of passing out/wetting his pants/being kicked out of bars obviously can't be trusted around alcohol.   Sounds like once he starts drinking, he can't stop.\n\nYou do not need to be worrying about something bad happening on your special day.", "YWNBTA. You're entitled to not have your wedding remembered for an obnoxious drunken slob of a guest. From what you're saying, this guy has some issues with alcohol. Maybe suggest some therapy or AA to your friend for him.", "NTA. Trust me, do not let him attend. He WILL cause a scene.", "NTA BF is an alcoholic and you talking to him won't change that. He will wreck your wedding.", "NTA You have valid concerns about your friend's boyfriend.  He sounds like a nightmare, and you just want him to control his drinking which he may be unable to do.  You have every right to not invite him.  Your friend should realize that too.  This is your wedding, not a frat party!", "NTA, but, do you really think by having unlimited drinks he will/would be the only one to get drunk? Cause that seems like an open invite to get hammered for free", "From what you've described, this person will not be able to control their consumption. Just don't let him come.", "Or a pukey, weepy (former) drunk.", "He can do what he wants, somewhere else.\n\nIt’s the “oh that’s just the way he is” argument — that’s how he is, and how OP is, is someone who will not have him at her wedding.", "There's not enough info to call it abuse, but at the very least, it's codependent. This friend is an enabler. I used to be one too.", "No - just don't let him come.", "That can ruin a wedding. My groomsmen were in guard against my father - he wanted to \"make jokes\" at the event but he's a complete dick and would absolutely have ruined it for us and almost made me late to my own damn wedding cuz he was pissed I did things differently than he thought I should - and thankfully there were no incidents beyond them shifting to glare him down at the objections part when he started to shift in his seat. Which was honestly both kind of funny to see and absolutely heartwarming for me to see them have my back like that. \n\nHer bridesmaids were on guard against her best friend, who I begged to be fired as MOA and my wife finally agreed to do. Because at her birthday party the year before, a month before I proposed, she got sloppy drunk, tried (badly) to seduce me, then sucker punched me and tried to tackle me while screaming about how I would never separate the two of them (neither is lesbian or bi. She was jealous of \"losing\" her friend and then did the exact same thing when she married the sucker who's marriage she broke up a few years later ..really messy chick). I actually wanted her to not be allowed to the wedding at all but she agreed to having her party members be on watch and to have her ejected if she stepped out of line. We also identified her to all bartender and catering staff to be alert for overdrinking and hired a security guard. There was an incident there. \n\nLimit the possibilities of someone doing this shit to you. NTA. Weddings are for the bride and groom, noone else.", "What kinds of weddings are you going to? I've never been to a wedding where they hired security.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Agree, as a recovering alcoholic myself, he has all the signs, over-drinks all the time, blacks out, gets kicked out of places, falls down and breaks stuff and wetting his pants (which is a sign of later stages of the disease).  He can’t control his drinking, he’s an alcoholic and it’s simply not possible for him, all or nothing and if he’s actively drinking he would be a miserable guest if he’s dry for the event and may even have a seizure if he is not drinking due to withdrawals. I’d simply tell her he can’t come, that’s the unfortunate consequence of dating an alcoholic.", "Signed, former sloppy drunk", "You forgot pissy", "My thoughts, too.", "Besides that, there's absolutely no need to punish all your guests because one person has no self control.", "Yes, the last thing you want at your wedding is to be worrying about how a +1 is going to behave and keeping an eye on how much he's drinking. Minus 1.", "All the weddings I've been to — open bar or not — have still had a bartender.", "You've met my sister, I see, lol.", "This guy doesn’t care how he looks to others, and won’t listen to his girlfriend to the extent that she’s afraid to bring this problem up to him. If he cares at all that he’s burning his girlfriend’s bridges with her friends and making both of them unwelcome, he relishes it.", "Why would she hire bouncers at her wedding to control one person who she barely even knows?", "Yes, if people are sitting or standing at a bar. But they certainly have no way of monitoring people all over a huge crowded banquet room.", "the point flew over your head. ofc there would be a bartender, that’s not what i was saying"]}