{"id": 29370, "submission_id": "17d4or4", "title": "AITA For Making My Dad Walk Out On His Own Birthday Dinner?", "selftext": "I’m going to preface this by saying that while I (22F) love my dad (60M), we have a complicated and difficult relationship, and it’s been made worse in the last few years for various reasons. Something he tends to do (with most other people, not just me) is act like he is always the most correct and fully informed person in the room. His facts and opinions are the only right ones and he will not hear anything else.\n\n2 weeks ago I flew back to my home state so I could visit my family and take my father to dinner for his birthday. I made us reservations at a steak place he loved. I bought him a beer, we got caught up with each other, and then it came time to order. He ordered his steak well done, and I ordered mine rare. The problems started immediately after, when he told the waitress that I don’t really want that and I’ll have mine medium well. I laughed because I was hoping he was just messing around, and I said no, I wanted rare. The waitress finished taking our order and left, and my dad started up with “well if you get sick tonight it’s not on me” and it turned into an argument about food safety and steak. \n\nMy father has this ridiculous belief that rare steak and rare ground beef are the same and that BOTH can get you sick, despite foodborne illness not working like that. I’ve had a certification in food safety since 16 and have worked on and off in food service for years (back on for the past year), but despite my experience and knowledge on this topic, he refuses to listen to me and always belittles me and says I don’t know what I’m talking about or something to that effect. That same thing happened during this argument, during which I tried to remain polite and levelheaded and steer the conversation towards anything else, but he wouldn’t let it go. Finally, when HE was ready to be done with it, he said that it’s not my fault I’m younger and don’t know any better. I told him it’s not my fault that he’s ignorant and hard-headed and can’t stand to listen to anybody else but himself.\n\nI guess he also hit his limit (he does have a history of anger issues) and he got up and left. We’d taken his car so I was stranded, but my mom lives in that town so I called her and she came and ate with me and we took my dad’s meal to my grandma (mom’s side) and we chilled the rest of the evening. I tried to just let it go until my dad cooled down, but he didn’t really. I’ve gotten one text from him since it happened and it was a long paragraph about how I disrespected him in public and embarrassed him. I left him on read. I feel like after so many years or acting like this that he had it coming, but a couple family members agreed that it was an asshole move because it was his birthday. I’m split. AITA?", "created_utc": 1697900967, "permalink": "/r/AmItheAsshole/comments/17d4or4/aita_for_making_my_dad_walk_out_on_his_own/", "score": 132, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I talked back to my dad and upset him on his birthday instead of just turning the other cheek.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. He also disrespected you in public but it sounds like he feels entitled to do so because you're 'young'. The distance while sad and painful, may be what's healthiest for you.", "NTA. The ages are wrong but his could be my idiot father, right done to the ruined steak. He’s a grown man. He went and had a pout. Grown men do not go off in a pout when he is proven wrong. They also don’t leave people stranded like that.", "NTA\nYour dad sounds obnoxious and exhausting.", "NTA.  You are right that he had it coming, just like most blowhards.  He wouldn't let it go and this is the result.  Honestly, I wouldn't spend much time with him in the future, especially in public.", "NTA.\n\nYour Mom divorced this guy, and I can't blame her one bit!", "NTA\n\nBut your father, on the other hand...    *oh boy*", "NTA \n\nStop hanging out with him, even if it's his birthday.  Yeah, yeah, he donated some sperm back in the day, however (read this and repeat until you see the simple truth if it) that act of horniness on his part, did not create in you any obligation to put up with his shit and abuse.", "NTA.  You took him out for his birthday and he was an AH.  Your response wasn't even rude.\n\nEnjoy the peace and quiet.  Leave him on read forever.", "NTA. Sounds like my dad, who is textbook NPD.", "NTA.", "NTA. You didn't \"make him walk out,\" he chose to walk out due to having a disagreement/meltdown over what his adult son chose to eat. (And left you stranded.) That it was his birthday is beside the point, it sounds as if he would do it any time. You put in the effort, he didn't. It's not your fault he can't comport himself in a respectful adult to adult conversation without making it \"thing.\" I'm glad you didn't let it spoil your night, it seems he's good at that.", "NTA your dad sounds like a narcissist or at least someone with some narcissistic traits. It’s not your fault he decided to make a big deal over this, and it was rude of him to leave you stranded over it. Don’t blame yourself; he’s clearly got some issues.", "If you tried to steer the conversation away from conflict, I'd lean towards NTA.\n\nInsulting each other at the end didn't help but we all have our limits. \n\nIf I were in your shoes, I'd tell him you understand how he feels embarrassed and disrespected by what went down and that you didn't want a public argument which is why you kept trying to steer the conversation away from an argument. You can also tell him that he is not the only one who feels disrespected by the situation.\n\nIt might not make a difference, but at the very least you can stand up for your feelings.", "Nta. He’s the one in the wrong in so many ways. Your dad sucks bro.", "NTA.  He's the one that started the argument, didn't respect your choice, then got up and left.  How is that on you??", "NTA.  If he didn't want to air the family laundry in public he should have kept his mouth shut and enjoyed a birthday dinner.  These folks dish out disrespect like it's going out of style and then cry foul when anyone calls them on their shit.", "NTA - good for you! He embarrassed himself. If he was right, half the world's population would be dead ; and rare wouldn't be served. I can't stand know it alls - plus he pulled the age card.", "NTA.  Your dad's an AH.  Good for you on standing your ground and him having to leave because he lost the (incredibly stupid - because you were right) argument.", "NTA.  People who order well done steaks should be banned from eating beef in general.", "NTA. He was so in the wrong. I used to have a friend like that. He could never just agree to disagree. That's why we're no longer friends, lol. I hope that steak wasn't expensive, if you're going to order a well-done steak, you might as well eat shoe leather.", "NTA, but there's a time and place for everything. Next time be a yes-man until after his birthday, then you can let it rip.\n\nDon't let important occasions be ruined by arguments that can wait. In 10 years you'll remember the dinner was ruined, but you won't be able to remember what caused the argument.", "Your dad is not wrong that a rare steak can make you sick; a rare steak can absolutely make you sick just like ground beef.  While the likelihood is much much less, it can and does happen.  As a former restaurant owner, food safety is a top priority and it would be misguided to say anything different.\n\nWith that said, NAH.  You were going by your own understanding and your dad his.", "ESH. Did you know it takes two to argue? You can simply choose not to participate. Your dad is totally wrong and unreasonable BUT if instead of insisting on his wrongness, you use phrases like “Agree to to disagree” or “I understand your argument and am taking full responsibility for the consequences of my rare steak eating actions” the fight simply can’t progress. I understand this can be frustrating in practice, but by choosing the fight you ensure that you spent a bunch of time and money only to get it thrown in your face. And for what? I come from a family that loves to fight so that seemed normal to me. But my husband flatly refuses to fight with me because he is secure in his opinion. Because of that if I get upset he will listen, state his position, and if he still thinks he’s right do whatever he was gonna do. If he thinks what I’m saying has merit, then he’ll change his stance. But he will not ever ever argue with me and it works like a charm. I get my frustration out and we never ever fight. I have since used this same tactic in other potentially fraught situations and I can tell you it works like a charm.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m going to preface this by saying that while I (22F) love my dad (60M), we have a complicated and difficult relationship, and it’s been made worse in the last few years for various reasons. Something he tends to do (with most other people, not just me) is act like he is always the most correct and fully informed person in the room. His facts and opinions are the only right ones and he will not hear anything else.\n\n2 weeks ago I flew back to my home state so I could visit my family and take my father to dinner for his birthday. I made us reservations at a steak place he loved. I bought him a beer, we got caught up with each other, and then it came time to order. He ordered his steak well done, and I ordered mine rare. The problems started immediately after, when he told the waitress that I don’t really want that and I’ll have mine medium well. I laughed because I was hoping he was just messing around, and I said no, I wanted rare. The waitress finished taking our order and left, and my dad started up with “well if you get sick tonight it’s not on me” and it turned into an argument about food safety and steak. \n\nMy father has this ridiculous belief that rare steak and rare ground beef are the same and that BOTH can get you sick, despite foodborne illness not working like that. I’ve had a certification in food safety since 16 and have worked on and off in food service for years (back on for the past year), but despite my experience and knowledge on this topic, he refuses to listen to me and always belittles me and says I don’t know what I’m talking about or something to that effect. That same thing happened during this argument, during which I tried to remain polite and levelheaded and steer the conversation towards anything else, but he wouldn’t let it go. Finally, when HE was ready to be done with it, he said that it’s not my fault I’m younger and don’t know any better. I told him it’s not my fault that he’s ignorant and hard-headed and can’t stand to listen to anybody else but himself.\n\nI guess he also hit his limit (he does have a history of anger issues) and he got up and left. We’d taken his car so I was stranded, but my mom lives in that town so I called her and she came and ate with me and we took my dad’s meal to my grandma (mom’s side) and we chilled the rest of the evening. I tried to just let it go until my dad cooled down, but he didn’t really. I’ve gotten one text from him since it happened and it was a long paragraph about how I disrespected him in public and embarrassed him. I left him on read. I feel like after so many years or acting like this that he had it coming, but a couple family members agreed that it was an asshole move because it was his birthday. I’m split. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Your dad embarrassed himself, picking the wrong hill to die on.   \nNTA.", "NTA. He was already the asshole in the story, then he doubled down.  Left you there, since he drove and it wasn’t even your town.", "NTA. Your dad needs therapy.", "ESH.  Rare is kinda savage.  But you should be embarrassed that your father ordered well done.  MED rare is the only answer here", "Any good steak house worth its salt should be prepared to serve the steak blue with zero health ramifications. I mean maybe if this was Denny's I'd be more careful, but a good steak deserves to be treated with respect and not turned into shoe leather.\n\nNTA, mostly because it sounds like OP tried to change the topic and dad kept gnawing like a dog with a (grossly overcooked) bone.", "NTA. He can dish it out but can't take it.  That's not your fault.  Him walking out is also NOT your fault and you DIDN'T make him do that.  He chose to walk out \n\nHe's shown you who he is.  He's not going to change.  You need to decide where your boundary is and if maybe it is time to go low contact.", "Like getting married, a special event doesn’t give you the right to be a total asshole.", "NTA cause ah are still ah in their birthday.", "NTA NTA NTA", "NTA.", "The idea that people should be forgiven for asshole behavior because it's their birthday is also stupid.", "I read \"well done\" and said \"oof, way to ruin a steak\". I worked with a chef once who would ding the pass bell and tell me to offer the chicken to anyone who ordered their steaks well done. I mean, it was 45 day aged angus ribeye.", "\"Grown men do not go off in a pout when he is proven wrong. They also don’t leave people stranded like that.\" \n\nThe foolish/childish ones do. NTA", "/r/raisedbynarcissists should have a perma-link on this sub.", "OP- tried to let it go, he wouldn't. You are sounding exactly like the dad . Your situation is totally different. OP ordered a steak - he tried to stop her.", "“ during which I tried to remain polite and levelheaded and steer the conversation towards anything else, but he wouldn’t let it go. Finally, when HE was ready to be done with it, he said that it’s not my fault I’m younger and don’t know any better. I told him it’s not my fault that he’s ignorant and hard-headed and can’t stand to listen to anybody else but himself” \n\nOp made an effort to prevent and end the argument. This take is irrelevant to the situation at hand. Arguing isn’t inherently wrong and ppl deserve the right to stand up for themselves.", ">“I understand your argument and am taking full responsibility for the consequences of my rare steak eating actions” the fight simply can’t progress.\n\nEspecially if that is ALL you say, using the \"broken record\" technique of dealing with conflict.", "A well done aged ribeye? That is a sin. That deserves tar and feathers."]}