{"id": 2944, "submission_id": "z1ons6", "title": "AITA telling fiancée not to come to thanksgiving?", "selftext": "TL;DR partner and i’s families have large wealth gaps, she’s rude and condescending to my family, she says  that she’s just trying to get me to think more like her so i don’t settle for less, i’m tired of her repeated unwanted comments and was gonna go to my families holiday dinner without her, she says i’m being unfair and punishing her for trying to help raise my standards before we marry and i just don’t know if i can handle being seen as an extension of my families less abundant money and indirectly degraded the entire day\n\nMy fiancée (F27) comes from a far wealthier family than i (F22), she graduated from an ivy league and has a very well paying job though she would never have to work if she didn’t want to, the type of wealth where she was given a property in college that an average person would never be able to afford, while my family is comfortable my family is still not at all on her level, i’m the first to ever go to college and only the 4th (after my siblings) to graduate high school, i certainly can’t imagine ever being gifted property.. \n\nShe makes rude condescending comments at the wealth gap between our families to the point she makes everyone including her own parents annoyed, some examples i can come up with are “you drive a *insert average car brand like toyota*.. mm that must be a great car, i think you drove a car like that and it was so hideous i made you get rid of it” and she’ll look at me and laugh as though we’re all joking, or “oh.. well, its cute, though it would be much better if we changed *insert some extremely expensive changes that my family could never afford and is ridiculously unnecessary* while its comfy we would never have a home like this” when i call her out she stops but just knowing she’ll say something like this is annoying.\n\nThanksgiving is coming up and it’ll be at my fathers home, he recently retired and bought a small home near a place where it snows since it’ll just be him now with me and siblings visiting often (i’ve loved the snow since i was a kid and he promised to take me snowboarding, it’ll finally be happening with the new home so this is important to me), its a beautiful house and being important to me i’d rather not have to argue my feelings against constant nitpicking so i just won’t invite her. She’s now mad and first insinuated me cheating and now says i’m being unfair and punishing her for trying to “raise my standards” before we get married and “prevent me from settling for less than i’m worth like they did”\n\ni don’t wanna deal with someone who thinks of me as less by extension and feels she has to “teach” me to be what she considers better on a holiday with my family, AITA for uninviting her?\n\nEDIT: this might be easier than responding to comments but idk. we’ve been together 6 years, she’s only like this around my family and a few friends, while i’ve asked why in the past she never gives me an answer, when we first got together she was much much nicer around them but slowly got colder and now well.. it’s like this. i’ve asked my family to see if anything ever happened and they say they don’t know why either. I have no idea if that’s a lie or if she’s just being like this for whatever reason but it wasn’t an overnight change and at one point we all thought she was just getting more sarcastic and bitchy joking around since i know her work is like that but clearly not.", "created_utc": 1669106829, "permalink": "/r/AmItheAsshole/comments/z1ons6/aita_telling_fiancée_not_to_come_to_thanksgiving/", "score": 30, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I called her a selfish bitch for accusing me of cheating and and told her i’m not a child or a pet that she can change no matter how young i was when we started dating since i believe a lot comes from that. Demeaning my family and me is not gonna make me become however she wants and if she wants me to act a certain way she can go find someone who is already like or go to therapy and get help because i’m not gonna put up with her snobby superiority complex\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but why are you with someone that’s constantly rude and nasty to your family? If she looks down on them, she looks down on you too.", "**She's right.** \n\n**You do need to raise your standards and not settle for less than you are worth.**\n\nDump her and find someone worthy of you. She will never change and you deserve better. NTA", "NTA, but why are you even with her? She sounds like a right prick.", "NTA for not wanting her there\n\nBut honestly, why are you with her? She’s showing you who she is, and it’s an entitled and disrespectful person. \n\nIt doesn’t matter what car a person drives or how many things they have - it’s about who they are and how they show up in the world. And that includes who they chose to show up with. By staying with her, and bringing her to things you are condoning her actions around your family - even if your words haven’t, your actions have.\n\nMaybe take this break to consider if that’s really who you want to be.", "NTA but why would you want to marry someone like this?", "No, you are completely NTA. \n\nShe sounds like someone with no compassion whatsoever for other people's circumstances, and I'm wondering why you don't uninvite her from your life.", "INFO\n\n>i don’t wanna deal with someone who thinks of me as less by extension and feels she has to “teach” me to be what she considers better on a holiday with my family\n\nWhy are you with someone you don't want to deal with?", "NTA. I imagine many people will ask this but I'll ask anyway: do you really want to be with her after thanksgiving?", "NTA.  I'm  confused.  Why are you marrying this bully?", "nta\n\nwhy marry someone like that\n\nits going to be worse\n\nshe sound horrible and vile\n\ni guess you love her but love only goes so far\n\nyour letting her get away with bulling you\n\nworse your letting her bulling your family", "NTA and get the hell away from her.\n\nWhat is next?  You get married and she either refuses to have your family there to support you or makes fun of them at the reception?\n\nOnce your married your opinions will be talked down because \"you just don't understand because you grew up poor.\"\n\nHon, you are currently in the honeymoon stage of your relationship and THIS is how she treats you and her family?  They seem to be dirt beneath her feet.\n\nAre you going to be happy never being able to see your family because they just are not good enough for her.", "NTA, but why are you engaged to someone like that?", "Wtf? \n\nJust read what you wrote, then re-read it until you start evaluating the real ‘quality’ of the person you a tying yourself to forever.\n\nNTA", "NTA you just said it yourself: \"i don’t wanna deal with someone who thinks of me as less by extension and feels she has to “teach” me to be what she considers better on a holiday with my family\"\nThis relationship does not seem to be based on respect for you and your values. Unless you want to be a trophy wife I'd seriously reconsider going forward with the wedding. You are only 22 no reason to marry this young.", "YTA for asking or agreeing to marry someone that you obviously do not like.", "NTA, why are you even still with her?", "INFO- If you can't have holidays together, what makes you think you can share a life together?", "NTA. You are not compatible, she will always see your family as the lesser one.", "NTA\n\nShe doesn't love YOU she loves the idea of what she can make you be. \"Only trying to make you think more like me\"? WTF... \n\nOne doesn't go into a serious relationship with the goal of changing the other person. First it rarely works, and second you either love who that person is right now... or you don't. \n\nShe's a snobby elitist who will never love and accept your family. Also, Gods forbid you don't live up to HER standards.", "NTA. But you realize this isn't going to get better, right? That you're going to have to choose between defending your family and your fiancee's money?", "YTA to yourself for not leaving her ass", "NTA. But why do you want to marry someone you don't seem to like?", "Jeez you need to read your post and imagine someone else posted it on relationship advice, what advice would you give them? NTA btw, your fiancée actually sounds awful!\n\nEdit to add her ‘raising your standards’ would seem to involve you becoming as rude and superior as her and believing that having money somehow buys you class…", "She isn't good enough for my dog to date, please OP you can do better. She sounds utterly exhausting. No one wants to be around someone like this so why do you? NTA", "NTA\n\nWhy are you with someone who belittles you, your family, and others? Have you thought about children? She will instill her values into them? Have you talked finances?", "NTA but she sounds rather unlikable. Why would you be with a person like this?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nTL;DR partner and i’s families have large wealth gaps, she’s rude and condescending to my family, she says  that she’s just trying to get me to think more like her so i don’t settle for less, i’m tired of her repeated unwanted comments and was gonna go to my families holiday dinner without her, she says i’m being unfair and punishing her for trying to help raise my standards before we marry and i just don’t know if i can handle being seen as an extension of my families less abundant money and indirectly degraded the entire day\n\nMy fiancée (F27) comes from a far wealthier family than i (F22), she graduated from an ivy league and has a very well paying job though she would never have to work if she didn’t want to, the type of wealth where she was given a property in college that an average person would never be able to afford, while my family is comfortable my family is still not at all on her level, i’m the first to ever go to college and only the 4th (after my siblings) to graduate high school, i certainly can’t imagine ever being gifted property.. \n\nShe makes rude condescending comments at the wealth gap between our families to the point she makes everyone including her own parents annoyed, some examples i can come up with are “you drive a *insert average car brand like toyota*.. mm that must be a great car, i think you drove a car like that and it was so hideous i made you get rid of it” and she’ll look at me and laugh as though we’re all joking, or “oh.. well, its cute, though it would be much better if we changed *insert some extremely expensive changes that my family could never afford and is ridiculously unnecessary* while its comfy we would never have a home like this” when i call her out she stops but just knowing she’ll say something like this is annoying.\n\nThanksgiving is coming up and it’ll be at my fathers home, he recently retired and bought a small home near a place where it snows since it’ll just be him now with me and siblings visiting often (i’ve loved the snow since i was a kid and he promised to take me snowboarding, it’ll finally be happening with the new home so this is important to me), its a beautiful house and being important to me i’d rather not have to argue my feelings against constant nitpicking so i just won’t invite her. She’s now mad and first insinuated me cheating and now says i’m being unfair and punishing her for trying to “raise my standards” before we get married and “prevent me from settling for less than i’m worth like they did”\n\ni don’t wanna deal with someone who thinks of me as less by extension and feels she has to “teach” me to be what she considers better on a holiday with my family, AITA for uninviting her?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Seems like there’s a huge dynamic issue.. not sure why y’all are still together. She seems like she can’t compromise with you. NTA", "NTA  Why are you with this person?  She's a snob and looks down on other people because she thinks they settled for something less!  Are you willing to settle for her?", "NTA, but if you can't even peacefully spend tg together, is it really going to work out?", "NTA She sounds insufferable and seems to know the value of nothing. You are being TA to yourself by being with this person. You are only 22 years old - do you have any clue what you are doing? Why are you engaged to someone like this? It's bizarre. Stop selling yourself short, and don't give yourself away for life to the first person that says hello (your choice is so bad I can only assume you've done this). Stand up for yourself, be more discerning, and find someone who values the things you do.", "INFO- are you marrying her for her money? Or did she groom you? Cuz you deffo aren’t marrying for love.\n\nNTA but OP you better not have signed a prenup lmfao", "Soooo you’re obviously marrying for money because it sounds like you hate her.", "From the fact that you are still with her despite these horrible traits, makes me think it’s only an issue when it comes to seeing your family? As otherwise I have no idea why you would still be with her at all.\n\nIf that is the case, you get to decide whether you believe she will learn from a very real sit down where you explain something along the lines of “I know you believe that you are just pushing me to not settle for less, because you care about me, however that is not how it comes across to me or too my family. I love you, but no one likes to be made to feel as if they’re less than, and my family is important to me. I need you to either show them respect, or not attend thanksgiving, because they don’t need to be made to feel bad about there life over a time for being thankful.”\n\nIn general though, if this is a representation of how she is all the time or isn’t something that she can learn is extraordinarily rude (I guess you really can’t buy manners) I don’t see how you would be able to move forward in this relationship if you plan on continuing to have one with your family - they don’t deserve that.\n\nNTA.", "NTA, can i ask how long have you been together and how did you meet? this dynamic had to come from somewhere and i’m warning you from experience get away before its too late", "I was confused by the \"she\" you mention at first. Her mother? Yours? But no. You mean your partner. Why are you with her?! She sounds awful. And you don't say a single nice thing about her. Is there any?", "[removed]", "NTA for uninviting her but I think you should consider if you really want to marry someone who looks down on your parents like that.", "NTA. Why are you with this person? To constantly harping on the different income levels is a big red flag. Like money is more important than love and respect.", "NTA …but like, what the hell does she bring to the table? Why do you tolerate her being so nasty to your family? You know she looks down on you too - or sees you as a home improvement project and not a person (hence why she made you get ride of a perfectly good car for no real reason).  Is she nice to anyone? Cause you don’t seem to have including any redeeming qualities in your description of her.", "YTA to yourself for wanting to marry an entitled asshole.\n\nIt's not a one time thing, you knew she is an asshole. At this point, it's on you.", "Also, NTA.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**"]}