{"id": 29487, "submission_id": "17efo7r", "title": "AITA for kissing my girlfriend in front of my little sister?", "selftext": "I (17F) was sat next to my girlfriend (17F) on the couch while my sister (8F) was in front of me drawing and my mum was sat on the chair. \n\nMy girlfriend said something really sweet to me and I kissed her on the lips. It was just a normal kiss I didn't stick my tongue down her throat or anything lol.\n\nMy mum asked me if I could come into the kitchen quickly and when I went in she just went sick at me. She was like really annoyed and told me not to do that in front of my sister and said how disgusting it was and that I should never do that in front of her because she too young for all of that.\n\nI don't really understand why she was so angry she kisses my dad In front of us all of the time. I'd get it if we were fully making out but it was just one quick kiss. I don't really understand what the big deal is.\n\nAITA?", "created_utc": 1698050434, "permalink": "/r/AmItheAsshole/comments/17efo7r/aita_for_kissing_my_girlfriend_in_front_of_my/", "score": 947, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I kissed my girlfriend in front of my little sister. I might be the asshole because my mum got really angry and said it's inappropriate.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">she kisses my dad In front of us all of the time.\n\njust say that then. she is wrong.", "NTA\n\nOP I hate to say it but this may be something bigger…is it the fact that you and your girlfriend KISSED??? Or is it the fact that you kissed your GIRLFRIEND???", "NTA, it was just a kiss. But does your mother really approves of your relationship? If she thinks it's fine for her to kiss your dad in front of you and your sister but you can't kiss your girlfriend, well, either she doesn't approve of you having a relationship at all or she doesnt't approve of the girlfriend part.", "NTA but sounds like mom has an issue with you being queer. Sorry.", "NTA\n\n8 years old is not too young to know light-kissing exists. Also your mother is a hypocrite.", "Nta. Either because she's overprotective mama and doesn't want to see her daughter kissing anyone--which is annoying but generally harmless. Or she specifically doesn't want you, her daughter, kissing other girls because of a more problematic reason.\n\nI would ask her why it's okay for her to kiss your dad in front of you and your sister or if she would have a problem with it if your girlfriend was a guy.", "NTA, sounds like homophobia", "NTA because as you said it was just a quick kiss not a whole make out session, your quick kiss won’t corrupt your sisters mind as your mum is insinuating.", "NTA. \nBest case scenario she doesn't like her kids growing up and she felt something bad she couldn't put into words and used your sister as an excuse.\nSo so scenario she feels uncomfortable with their kids having displays of romantic love in front of them (a lot of people does) and she used your sister as an excuse.\nBad scenario, she's actually you from the future and she knows how this relationship ends.\nWorst scenario, she is still a little apprehensive with you being queer. Let's not jump to conclusions on this one but you might want to have a calm conversation with her and probably another calmer adult.", "NTA\n\nYour mom thinks you're going to make your sister like you which is ridiculous.\n\nJust say I'm only taking after your lead with how you are with dad. You've shown me what a healthy relationship is and I respect you for that. \n\nWhat could she say back.", "Sounds like mom's not as accepting as she claims to be :/ I wonder what your dad has to say about this. NTA", "NTA - It's not clear why your mother reacted like that. You had no reason to think the kiss would be a problem.", "NTA \n\nYour mum is being homophobic. Keep kissing your girlfriend OP", "NTA\n\nthat's ridiculous. Eight years old should know what a kiss is. In my country kids are ten when they get their first sex ed in school, therefore yes, an eight years old shouldn't be disturbed by a kiss. I for sure grew up with couples showing affection like this as being normal. \n\nAnd honestly the way your mother handles it increases the chance that your little sister actually develops an unhealthy view on romantic relationships, physical affection between romantic partners and sex since seeing it as something bad, dirty or unnatural is unhealthy. Not to mention that one of the reasons for the high rate of teenage pregnancies in the US is that adults think they should keep away that topic from children and teenagers and therefore these are just naive and uneducated about these things when they experience their first love and relationship - and when your mother reacts like this about a freaking kiss I highly doubt she will be ok with educating your sister in the next few years.", ">she kisses my dad In front of us all of the time\n\nColud she perhaps \"disapprove of yor lifestyle\"? Did you ever ask her if she has a problem with you not being straight? Did you ask her why she made such a big deal of a kiss although she kisses her partner all the time which is just the same thing you did?", "Do you have any siblings or even cousins who are also in (straight) relationships?\n\nAlso, how long have you been with your partner?\n\nI see two camps within the comments. Those who think she may have internalized homophobia or those who think that she may just not like her teen child kissing their partner (regardless of gender).\n\nThe only was to truly know is to either ask her or to try to think of a similar situation and gauge the reaction there.\n\n----------------------------------------\n\nI initially thought it may be the issue of homophobia but the more I think of it, the more I'm conflicted. Your mother may see your relationship as unserious and doesn't want your younger sister to get the idea that short-term teen relationships are physical or whatever. 8 year olds are impressionable so your mum might think that seeing you kissing your girlfriend, your sister might copy your physicality with your partner, rather than there being an issue specifically with the partner. \n\nWhatever the case you're NTA.", "> I (17F) my girlfriend (17F)\n\nthat is the big deal. NTA", "NTA\n\nI think expressing love in small and sweet ways to our loved ones are something that even little ones should know and understand. It's not a big deal if it was not some intense kiss but rather a swift one which if anything will make your sister realise the love between you and your girlfriend which I don't think is wrong at all.", "NTA, I can see a lot of people are bringing up a lot of things for you to think of. It is very possible your Mom is not as comfortable as she’s says she is or wants to be with the relationship or, it could be that you are 17 a closer age to your sister and she doesn’t want you kissing in front of her. Sometimes parents don’t want kids to grow up. Anyway you look at\nIt you definitely are NTA", "NTA. She's being homophobic.", "NTA\n\nBut your mother gets to set the rules in her house, however conservative or stuffy she is about it. Just do what we all did - play nice in front of the olds, and keep it behind closed doors until you move out and spend half your lives naked.\n\nETA: didn't realise at first you're both girls. Double NTA if your mother's problem is due to your sexuality, though I guess it's possible that it's more because she is still protective of both her daughters and not ready to accept you're growing up.", "You're NTA here. What probably needs to happen from here is a sit down with your parents. What exactly was your mothers issue with the kiss? A show of intimacy, however mild? Or is she not as comfortable with you having gf as she says she is?\nIf you're unwilling to do that then you might have to do the tiptoeing around the issue until you move out. As much as that sucks.", "Has your mom seen you kiss before ? Might be just new to her and she wasn’t ready to see it ! Your NTA . Mom just needs to get over it ! But if she,s uncomfortable with kissing around your sister she needs address that properly and not go off on you for it !", "Your mother doesn't want you to grow up. NTA. Your mother needs to chill out.", "NTA but it's very simple. Your mother is homophobic.", "NTA, nothing wrong with showing love...", "I never kissed any of my girlfriends in front of my parents till I was 18 out of respect to my parents.. asp prob has to do with your little sister was there..", "NTA. The \"big deal\" is that your mother is not okay with same-sex PDA. It might give your little sister the idea that you and your girlfriend care about each other. Horrors, apparently. /s\n\nYour mother is acting like a hypocrite, and isn't as comfortable with you having a girlfriend as she has pretended.", "NTA ... is your mom projecting, is she the one who can't stand seeing you grow up or something?\n\nShe overreacted in my opinion.\n\n>she kisses my dad In front of us all of the time.\n\nFrankly I second the idea of telling her this - but also maybe ask her what's the difference, why she is allowed to express love for her partner that way but you are not, where she draws the line...", "NTA, it was a simple kiss.", "NTA \n\n8 year old probably saw this in her Disney cartoons already and understands it as a sweet romantic gesture without any sexualisation of it. Which is exactly what it is to be fair.", "Homophobia. Her reaction is 100% because she doesn’t want your sister to “end up like you”. NTA", "Public displays of affection (PDA). Some people are just not comfortable with that. Could be your Mom is one of those people and was using your little sister as the excuse to voice it. I don't know, I'm a live-and-let-live person but my daughter (17) and her boyfriend never kiss in front of us (parents) and I'm not sad about that. Different strokes for different folks I guess. Just let it go.", "NAH\n\nI wouldn’t kiss my wife in front of a little kid who’s not our kid. But you’re 17 so I can understand.", "cough homophobia cough NTA", "NTA but you need to realize that she’s trying to establish boundaries on how you interact physically under her roof in the presence of your family members. She just went about it in the wrong way because for the most part you are correct when you mention that she and your father show forms of affection and it’s okay. \n\nWhat’s probably really bothering her is that you are maturing and she doesn’t want to be reminded that you are not a child anymore because she does still actually have a child that is still too young to date like you obviously are. She also knows that one thing leads to another so you get where I’m going with her flying off the handle…", "She’s homophobic wether she admits it or not!!", "NTA  \nClassic case of double-standards.", "NTA normal PDA. my sons favorite quote applys nicely \"you are what you say\":disgusting", "NTA at all. Your mum sounds like she may be homophobic though. I’m really sorry you have to hear that :(", "Your mom sounds potentially homophobic. NTA.", "Hey OP, I've noticed from reading a lot of your responses that you may not understand how your mom is being homophobic. I'm a 26 yo genderqueer person, with a mother who is less than accepting of it.\nShe may not out right say she doesn't approve your relationship, because she still wants to try to be supportive. And she may not even realize she's being prejudiced, but this absolutely is nothing short of a microaggression that she may not even realize she's committing against you.\nIt sounds like she's upset you kissed your girlfriend in front of your sister, because she's worried it shows your sister that kissing other girls is okay.\nI could be reading that wrong, but I am speaking from experience. If you have a good relationship with your mom, I would sit her down and have a heart to heart with her about this. Some parents try to be supportive of their queer children, but need some help getting all the wah there.\nGood luck OP!", "NTA. She's probably reacting to something from her past that you accidentally triggered.", "Nta, this sounds like homophobia to me", "Definitely NTA, your mother is just homophobic and probably \"doesn't\" want to explain about homosexuality to your sister", "NTA, sounds like your mum is homophobic", "Your mom is a homophobe. NTA.", "NTA, your mum is just a homophobic prick", "NTA - this is NOT about your little sister, this is your mother having a problem with your relationship.", "NTA and I fear, OP, that this is how you find out that your mother is *just a little bit* homophobic.\n\nSomething I like to do when faced with something like this is plead absolute ignorance, as it often forces the other person to express their prejudice out loud, which can be enlightening for all concerned.\n\nHere's how this might have gone here:\n\nMother: \"don't do that, it's disgusting and not appropriate for your sister to see.\"\n\nOP: \"I don't understand, what is disgusting about it?\"\n\nM: \"you kissing <gf> like that.\"\n\nOP: \"why is that disgusting? You kiss Dad all the time.\"\n\nM: \"that's different and you know it.\"\n\nOP: \"I don't understand why it's different\"\n\nM: \"well... we're married.\"\n\nOP: \"oh, I see... so you never kissed Dad before you were married?\"\n\nM: \"of course I did. That's not why it's different.\"\n\nOP: \"so why is it different?\"\n\nM: \"well, your sister is to young to see that.\"\n\nOP: \"but she sees people kiss all the time - on TV, when we go out, when you do it, when we visit <relative>. And it was just a peck. I don't understand why that is ok and this isn't.\"\n\nM: \"you know why it is different.\"\n\nOP: \"no, I don't. Why is it not ok? Why is it \"disgusting?\"\"\n\nEtc etc until there is nothing left for her to do but admit it's a problem because this is 2 girls. \n\n(And maybe, just maybe, that isn't what the problem is here, in which case the actual reason can be uncovered along the way.)", "Homophobia. The problem is homophobia.", "You're mum's a dirty homophobe.", "NTA. Sadly, it seems like your mum is homophobic. If she has no problem kissing you dad in front of your sister, but when it's you and your gf, your sister is \"too young for all of that\"... Yeah, she's homophobic. Ask your mum what she means by \"all of that\".", "NTA - Mom is likely a homophobe... because when she (a woman) kisses her man its all good because thats natural and how god made them and such, am I right?", "I'm often amazed that shit like this happens in real life. \n\nMom's apparently doing you s huuuuge favor, accepting you for who you are, but there are limits you must adhere to as a second-class person 🙄\n\nNTA\n\nMom, on the other hand...", "Another case of mother jealous of her daughter…", "The deal is that she is homophobic and fuck her", "NTA - your mum is homophobic", "Your mom likely has been pretending you, and your gf are just friends so seeing you do relationship things like kissing freaks her out. She’s probably just homophobic.", "Christians. Gotta love em.", "NTA your mother is slightly homophobic whether she admits/knows it or not. it should not be a problem if she didn’t think that being lesbian was not normal", "NTA - oh boy the homophobia", "Your mom is homophobic, a quick peck is nothing.  She thinks you can make someone fat by seeing a kiss,  NTA", "I’m sure she’s tryin to be supportive it as a parent it would take time to digest an I’m sure she didn’t know what to do in that moment.  Your younger sister might have a harder time understanding in her little brain an get confused about herself.  I hope this doesn’t come off as judgmental or mean because sometimes my points come across harsh an I mean no Ill will!", "This got really dark when I realized that it was a kiss between two women… Yeeaaaah, you’re mom doesn’t seem to have a problem with kissing your partner but with kissing your female partner 😬", "NTA. I'm sure your mum has issues with your sexuality but is incapable and weak to not voice it. Also say when she kisses your dad your sister feels disgusted too", "Your mother is clearly at least somewhat homophobic. Make sure to teach your sister it's not something people should be ashamed of.", "NTA, mum's a homophobe though.", "NTA. Unfortunately, it's your mother's latent homophobia showing. A lot of people are all for supporting LGBTQ rights. Right up until \"my kid's gay? Oh, hell no.\" She needs to do some soul searching.", "I call bs on this. Nobody is surprised to note their parent is a homophobic “not in front of the children’s type", "Your mom is homophobic. She is disgusting. If it were me next time I would kiss in front of the sister again😂❤️", "It's different because your Mom is a homophobe.", "YTA, PDA is gross and you’re not your sister’s parent. Your mom still makes the rules.", "NTA mom is a homophobe!", "Your mum is a homophobe", "NTA, enough people have already told you your mom is a homophobe... so let me be another. Sorry", "NTA\n\nBut man, these comments here... Sure, OP's mom could be a closeted homophobe. Or OP's sister, as younger siblings tend to do, exaggerated a small smooch to a blown out make out session.", "Since you say you don't understand I'll spell it out for you.. your mother is homophobic.\n\nThe only difference is that you are kissing someone of the same gender.\n\nNTA and I'm sorry.", "I mean you are under her house so her rules..", "Her house, her rules!", "NAH\n\nYes, I understand where you're coming from. But it's also your mother's house and she's trying to set boundaries on what she feels is acceptable for her teenage daughter to do under her roof.\n\nYou're young. Just try to see eye to eye with your ma on this one, without turning it into some matter of \"but you do with dad...\" or digging your heels in and being a stubborn teenager, which is easier said than done I understand, but give it your best.", "YTA, ur really not the a hole, but for the fun of it ur are now", "Yes.", "YTA. You violated your mom's boundaries.", "Kind of the a-hole it's hard to say..  I had to edit because of the people who want to shove there opinions down peoples throats these days", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (17F) was sat next to my girlfriend (17F) on the couch while my sister (8F) was in front of me drawing and my mum was sat on the chair. \n\nMy girlfriend said something really sweet to me and I kissed her on the lips. It was just a normal kiss I didn't stick my tongue down her throat or anything lol.\n\nMy mum asked me if I could come into the kitchen quickly and when I went in she just went sick at me. She was like really annoyed and told me not to do that in front of my sister and said how disgusting it was and that I should never do that in front of her because she too young for all of that.\n\nI don't really understand why she was so angry she kisses my dad In front of us all of the time. I'd get it if we were fully making out but it was just one quick kiss. I don't really understand what the big deal is.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Is it OK because your parents are married, or because they are opposite sexes?", "NTA\n\nIt's just a simple way of showing affection towards a person whom you love.\n\nIf she finds it disgusting then the problem is her, not you. Also, she's probably homophobic..", "NTA. Your mom needs to chill", "Nta straight people do it I don’t see why it’s a big deal for you to kiss your gf", "NTA, but are you sure your mom isn't homophobic? Would she have reacted the same way if your boyfriend kissed you the same way?", "Your mum doesn’t like her little girl becoming a woman. Or maybe she doesn’t like your girlfriend (or that you like girls - is she homophobic?). This isn’t about your little sister, it’s about how your mum feels about you kissing your girlfriend. You’re NTA\n\nEdited to correct genders (sorry) - which makes this even more worrying behaviour from your possibly homophobic mum.", "If she doesnt have a problem with kissing in front of her in general as she kissed your dad all the time... I think her problem is probably with lgbt couples kissing... :/\nHopefully thats not the case but thats how it looks like to me at least..", "NTA\n\nI think your mother might be thinking you can rub you *gay*ness off on your sister (or something ridiculous like that). I think a quick kiss with your girlfriend is 100% ok. Just try not to get carried away ;)", "Smells like closeted homophobia. NTA!", "NTA. its Because ur gay  probably.", "NTA.. sounds like your mum may have repressed issues with you dating a girl..", "NTA - your mom seems to have different problems with herself and just put them on you quick kissing your gf....", "Don’t let her watch Disney movies then, I can think of a few with a quick kiss or two in them", "Ask her if she would say the same if you were with a male? Not in an aggressive way, but ask the question, because this is incredibly weird.", "So op how did your mum react when you came out", "I think your mom's problem is not with the kissing but actually with the GIRLFRIEND part. She might be homophobic.", ">she kisses my dad In front of us all of the time  \n>  \n>I (17F) was sat next to my girlfriend (17F)  \n>  \n>She was like really annoyed and told me not to do that in front of my sister and said how disgusting it was and that I should never do that in front of her because she too young for all of that\n\nNTA. Sounds like your mom has an issue with you being a lesbian and you might wanna ask about that. Just saying.", "I think what your mum is sadly getting at is that your sister is too young to see two girls kissing. \nCause if she kisses your dad in front of her she hasn’t got a problem with your little sister seeing heterosexual couples kissing just gay ones. \nYour mum prob doesn’t even think she’s being prejudiced but she is. \nYou’re NTA and you should have a sensible chat with your mum about it.", "NTA, but your mother is TA", "You know why she’s angry.", "NTA. Your mom sounds homophobic. She would likely deny it and might not even realize it. But her actions have made it blatantly clear.", "After reading the title I can say no u are not", "NTA. What’s wrong with your mom? Ofcourse you can kiss your girlfriend in front of your sister.", "Yeah either your mum has an issue with her little girl growing up and being in a romantic relationship, or she's a closet homophobe. Either way NTA. But the phrasing of \"your little sister is too young to see it\" makes me think homophobe", "Its defo not your big deal but that of your mums … she clearly not comfortable with your situation with your partner. I don’t agree that she made you feel bad for being who you are. As it is your mum and her home you have to respect it to a degree but she should have gone about it in a better way as it’s clearly not about the kiss but the fact that it’s a Kiss with another girl. Talk to her and explain it made you feel upset and that you don’t want to be made to feel any kind of way for liking women", "NTA\n\nI'm assuming you didn't know about this \"rule\" of hers before, so you can't be the asshole. That said, her and your dad kissing doesn't mean you can. \"Quod licet Iovi, non licet bovi.\" - their house, their rules.\n\nNow I personally don't agree with her, but again, it's not my house so I don't make the rules.", "Best way to determine if it's just her not wanting your little sister to see people kiss or if it's homophobia: watch a movie where there's a love scene or where there are 2 people kissing in front of your mom and sister and see if she has the same reaction. If she doesn't react and seems ok with letting your little sister watch 2 strangers kiss on TV, then I would side with homophobia unfortunately. If she gets pissed, then she is just overly protective. \n\nOr just go and ask her what the actual problem is.", "How it's inappropriate if mom kisses her husband all the time on top of that I can add that sister probably sees coutles of things like that on TV and online. So idk if she's just overreacting.\nThere is also argument that two of you are not married, but if that's the case your mom needs to adjust that in modern life celibacy before marriage is not a common thing anymore.", "NTA - you displayed normal relationship affection, you weren't being sexual in front of a minor.\n\nMaybe your mum is homophobic. Homophobes often over-sexualise gay and lesbian relationships, seeing even really innocent acts as lewd.\n\nAlternatively, it could be that she just isn't prepared to see \"her baby\" in an adult relationship.", "[removed]", "Nta", "Her house her rules...period!", "NTA \nMum and dad have probably kissed infront of you both before so it seems as though she may be again you and your girlfriend kissing because your both girls?", "NTA. Mom is both weird and hypocrite.", "NTA. Possible your mum has internalized homophobia.", "I went through stuff like this. \n\nWhen I was younger, my mother was openly homophobic. Coming out the first time was rough. I went back in the closet for years. When I came out the second time, I was living on my own in another state, and after a while my mother in THEORY came around. She’d claim to be supportive.\n\nThere have always been tells, though. Comments about how conversion therapy should be legal if people want it; her complete lack of actual engagement, activism, or support; getting visibly uncomfortable at any queer content in media; dragging her feet, being upset, and doing the absolute minimum when my wife and I got married (when she’d enthusiastically talked since I was 16 about how they should add a room to the house so my future husband and children and I would have somewhere to stay).\n\nOne of the ways this expressed itself was clear hypocrisy and different rules around public displays of affection. When my first serious boyfriend and I were dating, she’d go out of the way to facilitate us being able to be intimate in ways that were honestly pretty uncomfortable—for instance, making sure to tell me that when my boyfriend and I were in the living room at night and my parents had gone to bed, they couldn’t hear ANYTHING from their bedroom so we shouldn’t worry. There was other stuff along those lines I’d rather not get into. \n\nWhen I brought my first serious girlfriend home, she freaked out about us kissing goodbye in the driveway where the neighbors could see. \n\nWhen I brought my soon-to-be wife home, she tried to make us sleep in separate rooms. When we rearranged the beds so we could at least sleep close to each other, she made constant warning comments about how it wouldn’t feel like/be the same as being in one bed (they had a pullout sofa that they’d kept collapsed). I’d sometimes catch her glaring furiously at us snuggling or holding hands. The list goes on. \n\nIt’s…possible…this isn’t homophobia. But it also really, really feels like it, from my own experience with a mother who grudgingly tolerated my orientation while claiming to support it. As others have said, it sounds like, once folks are calmed down, a conversation is warranted. “Given that my girlfriend and I were chastely kissing and that you and dad do the same in front of (sister), it feels to me like the problem is our genders, that you’re uncomfortable with me being queer.” \n\nShe may deny it. That may or may not be the truth. She may not even realize it or be willing to admit it. It’s a sticky situation and one you may have to feel out by observing her and listening to what she says about other queer folks, or related topics. I wish you the best, and in the best case scenario where she’s NOT homophobic, I hope she can quickly come to her senses about normal PDA and appropriate, mature parental responses to it. \n\nAlso, NTA.", "NTA. Sounds like your mom is homophobic. I bet she'd have no problem with your sister watching a Disney movie where the main couple kisses. Or if her partner kissed her in front of your sister. She's only angry because you're two women", "Her home her very young child. She the right to decide what happens in her house. She obviously doesn’t expressly support your sexuality so next time hide it.", "NTA, your mother is off her rocker. People kiss in public, on TV, and even -- ***GODS FORBID*** \\-- at home, too. It's an act of love between two people. Far better for her to see loving examples of it and simply answer any questions about what kissing *means* than accusing you of being disgusting.", "NTA: Doubles standards, homophobia and more, on tonights news at 11", "I see nothing wrong in kissing", "YTA, it doesn't matter if ur parents kissed in front of you. Never kiss in front of children😭😭\nMy parents always did and is just fucking disgusting for the child.\n\nDoesn't mean that they did tha you can do it too.", "If mom has an issues with same sex relationship...daughter should respect that. Mom doesn't have to let girlfriend over to the house at all. Daughter not respecting mothers stance should be kicked out at 18. If rules are too hard. Welcome to the real world. People are too sensitive", "Can we maybe stop jumping to homophobia.  There’s a lot of reasons mom may not have approved.  The OP doesn’t think she’s homophobic, is it possible? Yes but so many here seem hell bent on creating the most drama.", "Not really a big issue, some people nhere are bloating the problem imo. Maybe she just thinks its normal for kids to see their mom and dad do stuff like kissing and hand holding or whatever, my mom used to cover my eyes during kissing scenes in movies until I was like 14-15. Talk to her but don't make a big deal out of it since even you yourself haven't gotten any signs that she disapproves of your relationship, I mean homophobia never even crossed your mind and you're comfortable with bringing your SO to yand showing public displays of affection in your family's house.", "NTA. Seems to me your mother just doesn’t want your little sister to be influenced/groomed accidentally into thinking she should also be in a same sex relationship in the future without finding out for herself.", "Nah she is definetly too young to be seeing a lesbian couple kiss YTA", "She sexualized a simple kiss. Basically she took a quick act of affection and made it like you were making out hot and heavy in front of your sister. She wicked overreacted.", "I think your mom has a problem with your sexual orientation. The real indicator was her objection to homosexual displays of affection in front of your kid sister. She’s afraid you’ll “turn” her gay.\nShe might not be insulting you directly (yet), but imo, this a sign that, deep down, she sees this behavior as wrong and abnormal, something that a child should be protected from exposure to.", "Well it's different to normal people kissing isn't it?\nStop ruining the innocence of the child.", "As a mom, your mom just really screwed up. I am glad you saw the ridiculousness of her request. A kid sees people kiss all the time. She has clearly seen her parents kiss. She has seen others kiss. If a random TV show is on, she’s likely seen and heard a lot more being alluded to. There is nothing at ALL wrong with a 7 year old seeing her sister kiss her girlfriend. I am sorry your mom did that to you and the core of what that means. I have two little girls. They know loving couples exist in all varieties and wouldn’t be phased by seeing anyone kiss. Maybe it’s because they have two loving moms. Hang in there, kid. You’re almost out of there. 🩷", "Hate to say it, sounds homophobic. NTA.", "NTA, she's just homophobic.", "Definitely NTA, there’s absolutely nothing wrong with showing affection to your girlfriend the way you did!", "She has a problem with you being a lesbian.", "NTA\n\nI’m not going to speculate on her reasons (because it’s not going to anywhere pleasant) but I am going to point out the general hipocrisy of her saying that when she frequently kisses your dad in front of you and your sister.\n\nNext time, just mention this and ask why it’s “rules for thee and not for me.” She’ll either explain herself satisfactorily, or more likely unsatisfactorily or outright refuse, and then you’ve confirmed bullshit and can decide how to proceed.", "Are the Disney classics banned at your home? Cause most of those have kissing.", "~~OH MY GOD IS YOUR SISTER OKAY????~~ \n\nnta, OP, you did nothing wrong.", "Your mom needs therapy. NTA", "To be fair, as a grown ass adult parent, I would not want my teenage kids kissing their partner in front of younger kids regardless of sexual orientation. It’s just how I grew up. And yes my wife and I would give a little kiss from time to time but we’re married.  Bottom line, you live in her house, she set the boundaries and you should respect them. If she’s a homophobe, then there’s not much you can do until you move out.  Crossing her boundaries will not help you.", "Your mother sounds controlling", "NTA but I wouldn't say your mom is homophobic, maybe she just doesn't want to see you grow up", "Ok so it’s more of a question of psychology, your mum wasn’t angry at you she was more worried about Chinese whispers and what her contemporaries think. On the playground that peck on the lips will soon become something raunchy, then there’ll be people who live by there no smoke without fire.", "She's probably homophobic.", "NTA. Mom's TA.", "NTA\n\nit sounds like your mum might be accepting of your relationship but not fully approving of it, she knows you like woman but doesn’t want you giving your sister the idea it’s okay to like woman.", "Her house fer rules. Her kissing hr husband is not the same thing as kissing someone random.", "NTA- but I don’t think she’s homophobic like most are saying. If I had to guess, and I don’t know you or the situation, so this is a guess, she just doesn’t like seeing her girl grow up. She’s not really upset you kissed infront of your sister, she’s sad your at that point in your life.", "NTA. Your mom is so in the wrong here with her double standards.", "Do you want your sister to grow up to be Honosexual too? This is how homosexuals are made - by being exposed to homosexuality at a young age. /s", "Sounds like your mother doesn't want to see it so she's using your sister as a way to try and get you to stop. Her problem tbh.", "Nta. That's honestly on your sister if she was watching you as you kissed your gf.", "alright thank you", "The best idea to get HOMELESS INSTANTLY!!", "[deleted]", "Big difference l, they are older then 18 and are married.. what a dumb comparison", "Do remember to add your vote.", "I COMPLETELY missed that detail", "sorry what? lol", "I kissed a girl and I liked it … but my mum doesn’t\nLike it", "Bingo", "Seriously what’s wrong with people it’s most likely that they are young and not married etc, if she had a problem with her daughter dating a female she would probably not allow her to come over to the house ?", "I don't know I thought she was okay with it", "Big jump to conclusions there, the fact that homophobia never even crossed OP's mind means that her mother doesn't display any hate towards it, even if we stretch things and say that she's subconsciously homophobic, OP was comfortable enough to bring her girlfriend in their house and show displays of affection (Kissing, handholding, etc.) so it isn't an issue. My mom for example used to tell me to close my eyes when people were kissing on tv when I was like 14-15, even though her and dad kissed eachother normally in front of us kids. She would say that \"We're your mom and dad its not a big deal to see us kiss.\" and stuff.", "maybe idk", "Queer what the hell is a queer mate. You mean homo", "Feel being a little spicy is genetic so perhaps the mum has some repressed feelings of homosexuality that society/her parents stomped on\n\nEdit: soz not understanding the downvotes, is it that homosexuality isnt seen as having a genetic component? Mean its a choice? \n\nOr is it that people who exhibit homophobic behaviour often have repressed feelings of their own, which people disagree with? \n\nOr is it that I said being a bit spicy which could be seen as being flippant/disrespectful?\n\nOr other", "The 8 year old probably doesn't give a flying fuck either", "thank you :)", "an 8 year old has seen their parents kiss I don’t think its new to them to see their older sis kiss her gf", "ok thank you", "That honestly is a dumbass question.  She's the adult and that's her choice on the matter.  When she is 18, she can do as she pleases and mom can decide whether to let her in the house or not.\n\nPart of the problem in society is we are allowing kids to think it's ok to challenge authorities, then they don't understand why they keep getting fired from jobs as adults", "To me, it's quite clear why OP's mother reacted like that.\n\nNTA", "This\n\nBut going forward OP needs to follow her mother's rules while she's living there.", "Or just having a hard time seeing her daughter grow up. OP indicated her mother never seemed to mind she had a girlfriend.\n\nIt doesn't have to be homophobic. It could be. But doesn't have to be. And based on the information here it's pretty much impossible to tell.", "yeah I honestly dont know, she cried when I came out to her and didn't talk to me for a couple days but she hasn't really been like that much since", "yeah I have a few cousins who are. \n\n5 months (best 5 months of my life fr fr 💪)\n\nAlright thank you sm", "yeah okay thank you :))", "This is the first usefull answer I found. The mother might be trying to figure it out and let it be. But she is still afraid that her sister is gonna catch it.  \nI would give the mom some benefit of doubt, she might be trying to change her views.", "alright I get that thank you", "maybe thank you", "Except mom was in the room when it happened. Mom is being homophobic, the disgusting is the tip off.", "This is such a weird take that Americans always seem to have. OP lives in the house too, therefore it’s OPs house too", "These are the kind of parents that wonder why they are in the retirement home with 2 stars in Google", "okay thank you I'll try", "Don't excuse homophobia", "I didn't know them boundaries existed", "Respectfully stfu.", "Being a homophobe isn't a boundary", "So it’s only okay if two married people kiss in front of children ?", "“which is her right”\n\nWtf are you talking about?? She’s a parent. It’s her duty to raise her child right. And raising the child right involves making sure they know that same-sex relationships are completely normal", "Why would it be a problem for the little sister to ask questions about being lesbian? \nIt's very easy to explain, it just means two girls or women love each other like mom and dad does", "I guess so thanks", "I think both and they are older so you must obey what I say...", "[deleted]", "Yeah, hate to break it to you, there's two options here. The *best* one is just that your mom can't handle her kid growing up and dating/being involved in romance. The other option is it's a problem because it's another woman, and she believes you'll \"turn your sister gay\" or some bullshit.", "She can’t handle you growing up. Logic won’t sway her.", "It's normal to show affection\nNta", "don’t argue. just say ok and move on. \nyou’re the child. you pay no bills to make an argument.", "How did that's stunt go?", "has OP given any indication that their mom will kick them out for such a thing?", "- 24 and - 27 Eh!! Guess I should have editted out the lucky part from the reply!! You asses are down right stupid to understand the joke 🤣🤣", "I mean yeaaaahhhhh but no i dont think so", "I'm not sure I think that's very much better", "Her mother just said she has a  problem with them kissing in front of the sister ,  age and marital status are inconsequential to what the mother is reprimanding her the daughter for .", "Thats mad. I thought that was the obvious immediate takeaway", "They’re asking if your mom has problems with same sex relationships", "I think he politely tries to say, your mom doesn't wanna know about your love life ( kissing, sex etc.)\nOr politely saying your mom doesn't like it that SHE is your girlfriend", "Your mom has a problem with your partner being the same gender as you. Ofc you’re NTA. It’s not about your sis. \n\nEdit: Unless she’s so weird (hardcore bigoted) in her head that she thinks being queer is contagious and she’s scared of daughter number 2 turning bi/lesbian/pan too.", "People who have a problem with unmarried couples merely kissing tend to be extremely homophobic. These things usually go together.", "Ask her why the big over reaction later today once you've both had some time removed from the moment.", "I mean that's definitely it. I'm really sorry.", "Whatever", "Why be sorry? The fact that homophobia never even crossed OP's mind means that her mother doesn't display any hate towards it, even if we stretch things and say that she's subconsciously homophobic, OP was comfortable enough to bring her girlfriend in their house and show displays of affection (Kissing, handholding, etc.) so it isn't an issue. Oh wait replied to the wrong person sorry.", ">Part of the problem in society is we are allowing kids to think it's ok to challenge authorities, then they don't understand why they keep getting fired from jobs as adults\n\nThis is what you got from the story? Seriously?", "\n>That honestly is a dumbass question.  She's the adult and that's her choice on the matter.  When she is 18, she can do as she pleases and mom can decide whether to let her in the house or not.\n\nPetty tyrants at home or in the office, neither should be encouraged. Children aren't property of the parents to be dictated around as they see fit. Yes, adults have extra knowledge and wisdom. Yes, to a certain extent, they can make rules. But they should at least be able to explain the reasoning to their child.\n\nParents are responsible for raising future adults. Kids don't learn when told \"don't do it cause I said so\". Just makes them learn to blindly follow authority figures, which is kinda a bad thing when authority ends up being wrong! It's much better for a parent to explain the reasoning so the child is better equipped to make their own judgement calls in the future, and therefore will be ready to be independent", "Here's the thing, one should ALWAYS question authority. Respectfully if need be, but only when needed.", "Soooo...because there's a chance mom may be homophobic it's totally fine for OP not to call her out \"because she's the adult\"? In cases like that, challenging authority is worth it because it either opens an opportunity to help someone change for the better or knowing when to cut ties. \n\nBecause someone is in position of power doesn't mean someone has to blindly follow their lead. Questioning it if it seems harmful (such as OP's potentially homophobic mother) or illegal (such as the cooks at old job of mine completely ignoring all health and safety for a care home for the elderly) should always be encouraged. If someone gets fired for it then it wasn't a boss worth working for and is a bullet dodged if worse things happen after.", "It *IS* okay to challange authorities, especially when said authorities are harming you. Just because someone's older than you doesn't mean that you should just bend over and let them do whatever they want. \n\nAnd I never got this whole american \"pay me or gtfo\" mindset between parents and children, do you guys feel nothing for each other? Do you see your parents as just two unquestionable wardens bound to take care of you until you become a legal adult and then they just become your landlords until you find your own place? That is so fucking sad.", "Youre only supposed to lick the boot bro, not turn it into a meal", "This is a fair take that I didn’t consider, it instantly made me think of homophobia as the mum and dad are okay with kissing around people bur no for OP to kiss her gf. I think it’s probably best for OP to chat with her mum and ask why she has an issue with it. I really hope I’m wrong as your reasoning is a lot nicer than mine", "I mean...if she cried like that and all then she sure as hell is not happy you're not hetero for whatever reason.\nMaybe talk to her, ask her what's going on and if she somehow thi ks you kissing your girlfriend xould make your sister gay or something. \n\nDoes she maybe come from a very religious family or has hopes of grandchildren and thinks you having a gf makes that an impossibility or something?", "You know your Mom and whether this is in character for her or not.  But, it's possible this was something she has prejudices about that she never even knew (from her own background).   It was obviously 'an issue' when you first came out and if she has been behaving better since she had been making a conscious effort to accept/adjust her thinking.   This isn't just an overnight thing so the kiss may have stirred up a lot of emotion she'd been trying to deal with and she lashed out.   It's like when we think we've dealt with something but then we hear/see something and it all comes back at once.\n\nOf course she may also be a horrible homophobe and was just hiding it hoping it would all go away and be a 'phase'.\n\nEither way, you did nothing wrong and it's not your fault.   \n\nDo you have the sort of relationship where you can sit down and talk with her about it and why she reacted like that?    It is not your problem if she is finding it difficult, but if you can clear the air it may help.  She needs to understand this is just affection, like between her and your Dad.  You need to know if this is going to be a problem for the future.", "It's likely worth talking to her about what boundaries she wants between your sister and *any* teenagers in a relationship, and compare it to those other relationships.\n\nShe should be more concerned with your sister learning that kissing (and any physical contact) should only be done with permission and that you're allowed to say no when want someones to kiss you. She already knows that teenagers sometimes kiss each other, and probably still sees that as gross and silly regardless of genders involved.", "Ah, didn't catch that.", "I would agree if the OP paid an equal share of the bills.  It's not like she was unreasonable with what she doesn't want done in her house.  Her mom didn't say she couldn't have her girlfriend over, just not PDA in front of her 8 year old sister.  Mom may not like her daughters orientation, but I know my parents wouldn't allow PDA in their house when I was a kid regardless of sexual orientation.", "two black stars not golden ones", "No please don’t. That’s terrible advice. Your a teen but you’re also 17. Kissing your partner is completely normal and natural. It’s your mothers house yes, but it’s also yours. Keep kissing your girlfriend under your roof", "Oh no, you violated another boundary by not knowing the previous one.", "That is what I read out of it too kinda. Total Bullshit for me.", "Probably wouldn't be good for married people to catch in front of children either... What this is too much of a complicated topic to talk about now n it will offend someone somehow always .. forget it", "Well maybe she doesn't want to teach your kid that at that young age yet... It's her right to wait until she's ready to talk to her children about that... I never said there was anything wrong with it.. I knew I would get a bunch of downloads from people like you who just want to shove down people's throat how they feel.. nobody can feel their own way these days people like you want them to feel how you feel and if they see any other way they're wrong for it... People like you aren't getting into heaven", "That’s what I think she thinks her younger daughter will turn out the same and clearly doesn’t want that … not nice either way as she isn’t accepting of her if that’s the case", "maybe homophobia?", "Seriously!! Either you're super lucky or stupid enough to not understand the joke.\n\nUsing logic in an argument with parents is just like throwing a pebble towards a flying airplane...", "Yeah, unfortunately I don't think so either.", "I feel like I'm having an aneurysm reading these comments. It's so obviously homophobia.", "err I don't really know she never said she had a problem", "Basically yes 🤣", "oh right yeah I honestly don't know", "She definitely thinks it’s contagious that’s why she has to “protect” the 8 year old from incurable lesbian disease. Mom maybe has never willingly confronted her own biases but they are there and she should work on it.", "Why be sorry? The fact that homophobia never even crossed OP's mind means that her mother doesn't display any hate towards it, even if we stretch things and say that she's subconsciously homophobic, OP was comfortable enough to bring her girlfriend in their house and show displays of affection (Kissing, handholding, etc.) so it isn't an issue.", "Yes.  Bottom line, her mom told her not to do it.  End of story.\n\nI'm not saying I agree with mom, just saying until she's paying her own bills and of age and her own place ...what mom says goes under her roof.\n\nWhat she does with your dad is irrelevant.  Kids are not equal to their parents", "Trust me, \"because I said so\", was my Mom's favorite line.  I learned plenty from it as when I got older, I understood exactly \"why she said so\"", "Again, questioning I never said was wrong.  But whether she likes the answer or not.   Mom's house, Mom's rules.  Challenging her on what she does with her husband is wrong.  It's her house and she is the adult", "No and I don't really know about that. She has always been really dramatic about everything though", "Why can OP not kiss her girlfriend when the parents kiss in front of the sister?\n\nWhy is everything so demented on money in the US. No wonder it’s such a fucked up country. OP lives in the house so it is OPs house too. Everywhere else understands this but Americans always say it’s the parents house. Honestly stay away with your weird money comes first values", "ok thanks :))", "You violated another boundary by not knowing that not knowing about a boundary is a boundary", "Look man, if we were talking about French kissing with groping and all, yeah I’d agree. But the fact that a simple act as a kiss is being oversexualized is just silly.", "Username checks out\n\nThere is no better time to tell children that same sex couples are natural. Kids aren’t born discriminatory. If OPs sister had any sort of issue with it, it’s learned (thankfully it’s seems she doesn’t). It’s best to make sure kids know that same sex relationships are as natural as opposite sex ones as soon as you can do they don’t learn bigotry\n\n(ps. I’m not religious so I don’t give a fuck what homophobe determines gets me into “heaven”)", "yea definitely", "It’s definitely homophobia. OP your mom has a problem with your sexual identity. It’s not your problem, it’s hers. NTA.", "Definitely.  Knew from title OP was likely female", "This is probably right.", "Oh shit missed that. Yeah 100% homophobia", "I don’t think it’s homophobia or surly the mother wouldn’t entertain op partner being in the house, could literally just be she doesn’t want her 8yo child seeing it at her age.", "[deleted]", "For bonus points, yep.", "Why do you write comments like a Facebook freedom fighter? Chill, homie.", "Maybe with *your* parents, but mine listened to valid arguments and acted accordingly. Like not all parents are facist.", "I am sincerely sorry that your parents suck.\n\nI understand the \"joke\", but even mediocre parents don't kick their kids out for such a small thing.", "You can have problems with things without voicing it", "A lot of straight people view queerness as innately more sexual for some reason: a light kiss between straight people may be innocent to her, but a light kiss between two women may read to her like you were making out even though it was *exactly the same act*.\n\nThis is bullshit, and you did nothing wrong. NTA. Your mom may just have some internalized homophobia. She might not even *realize* she holds that prejudice--a lot of people don't. If you two have a relationship where you can talk about this stuff, it may be worth having a gentle heart-to-heart. If not, it's probably worth keeping in mind and understanding that you might be judged more harshly around her, even if she doesn't intend to.", "Did she ever say she didn't?", "Don’t let Reddit put the idea into your head that your mum is homophobic. \n\nThere are lots of reasons she might not be happy, some people have issues with PDA’s in general when it’s not them! especially if they are uptight and think you should be married or something. It’s also a thing parents can have issues with as it’s showing their kids growing up.", "She doesn't have to say it. This was never about you kissing your GF in front of your sister, not really. This was about doing it in front of your mother and making your Queerness real. That's why she called it disgusting. Your mother was \"coping\" with it as long as she could convince herself it was just something silly, just this girl you called your girlfriend and held hands with. The moment you kissed her your mom could no longer pretend and her bigotry came out.", "this post is about her mother displaying hate", "\n>OP was comfortable enough to bring her girlfriend in their house and show displays of affection (Kissing, handholding, etc.) so it isn't an issue.\n\nAnd is now **being told** that those displays of affection **are** an issue \"in front of 8yo sister\".", "She's 17 she can ask for an explanation. What on earth makes you think otherwise. I'm glad I don't have to interact with people with your mindset.", ">Kids are not equal to their parents\n\nThat's definitely an opinion you can have.\n\nIt's incorrect, but you can have it.", "Sounds like she was too lazy to explain it to you and/or she thought you were too dumb to understand.", "Sounds like you didn't learn from it. You learned from your own life experiences after having gotten older. You weren't parented, you raises yourself", "And it's thought processes like that why some kids cut ties with their parents. Having an open relationship with parents by questioning double standards (potential homophobia side) is far more healthy than blinding accepting parents rule. \n\nI get some parents rules are there for the kids safety but a simple kiss? Nope, mom's rules are bullshit", "Wrong by what metric?", "Tjen maybe talking to her would be in order. At least then you either knos what's going on or at lesst tried", "Well, the parents are married adults, I would assume.  It's not about money as much as it is respect. I do agree mom didn't exactly handle it in the most diplomatic way and could have done a better job at it than she did.  Whenever you pay for all the bills in a household, you get to make the rules.  By all means, as soon as she gets her own place and pays the bills, she can make her own rules.  I'm actually in Thailand right now visiting my girlfriend.  We are both in our 50's.  She and her mother live together, and my girlfriend pays all the bills.  I certainly don't go into their home and plant a kiss on her.  I'm not exactly a big fan of PDA personally anyhow.", "Idk, it's her mom's house, not OP's. Even if you disagree with it, you should respect your parents' rules. If you don't like kt, move out", "But she’s fine with her 8 year old child seeing a man and woman kiss? (She kisses their dad.)\n\n… that IS homophobia.", "I’m a queer woman and had a mother like this. Would tell me when I had a boyfriend that she and my dad couldn’t hear anything from their bedroom so we should do whatever we wanted (and was generally not just fine with but happy about straight PDA), but freaked out about me chastely kissing a girlfriend goodbye in the driveway where people might see. Tried to make my wife and I sleep in separate beds and rooms when we visited and made many comments about it until I put my foot firmly down. \n\nShe’s not the only one, either. I never got comments from strangers when I was dating a man, but with women I’d sporadically get someone telling us we were being inappropriate when the activity in question was lightly hugging and one, again, normal, non-open mouthed kiss. \n\nSpeaking from extensive  personal experience (source: 37 years old, out since 15, gay married since before it was legal), this reeks of homophobia. People love to freak out about the mere visible existence of queer people corrupting children.", "A lot of people are homophobic and pretend not to be. Perhaps she is trying to be ok with her daughter's choices and that's why she let the girlfriend over. A lot of parents (especially religious) hope it is just a phase, and that their child will have a male/female relationship in the future.", "you know phobia doesn't just mean fear right?", ">homophobia\n\n>noun\n\n>ho·​mo·​pho·​bia ˌhō-mə-ˈfō-bē-ə \n\n>: irrational fear of, **aversion to**, or **discrimination against** homosexuality or gay people\n\nemphasis mine\n\nPeople aren't usually talking about phobias in the clinical sense when talking about homophobia, transphobia, xenophobia, etc. They're usually talking about the discrimination, the dislike, and the misinformation.\n\nThis is distinctly different from being a dick/asshole because there are PLENTY of people who are \"nice\" but uphold homophobia or other forms of discrimination", "Wow, the fact that this wasn't even on your mind shows how times have changed! Gosh, that makes me sound old, I'm 32.", "yeah guess so", "Unfortunately I think this is the issue.\n\nMum doesn't have a problem with mum and dad kissing in front of younger sister but has a problem with OP (F) and girlfriend kissing.\n\nHe's like she's trying to stop the younger sister from catching the gay...\n\n^/s", "maybe.she thinks that too, thank you", "Could be this.\n\nBut also many parents jut aren't comfortable with their children having a love life and accepting they are grown up - like the parents who wont let even their heterosexual their 30 something year old children share a room with their partner when they stay over...unless they are married. And sometimes, not even then.  They dont stop having a love life, but they see their child doing the same thing as gross. I dont think that's right of them, but it's weirdly common.\n\nA lot of parents struggle with accepting their kid has a love life and that might be feeding into this.", "no", "She could just be squeamish about those things, or cultural difference. Granted I live in a conservative country where most people here don't approve of teenagers doing affectionate stuff in public.", "She could just be squeamish about those things, or cultural difference. Granted I live in a conservative country where most people here don't approve of teenagers doing affectionate stuff in public.", "You clearly have a small penis", "I never said she couldn't ask for an explanation.  But people saying to confront her with the fact she kisses her husband in front of the kids like it's some gotcha, is foolish.", "You really think children are their parents equals?", "Nope.  It was her house her rules.  Just that simple.  Sometimes I was offered an explanation, sometimes I wasn't.  That's how it is.  I'm not her equal.  \n\nLike I said, as I've gotten older... A lot of those \"because I said so\" have come to make perfect sense", "Listen I agree and I never said what I thought of it.  I'm simply saying it's Mom's decision, not hers\n\nIve said multiple times I don't care if she questions the rule, but she is not her parents equal.  What they say goes whether she questions it or not", "That seems like a jump from \"I'm 17 and I don't understand what I did wrong\"", "Nope, homophobes don't get respect.", "100 is !", "That’s your opinion though, not everyone thinks like you. I personally don’t think it is homophobia. In her eyes she could be protecting her daughter from things she probably doesn’t understand just yet. At 8yo there’s a big difference between seeing your parents have a kiss then seeing your 16yo sister kiss another woman. I’m not saying there’s anything wrong with it, each to there own and if it makes you happy go for it. I just think there is a time and a place for it and around 8yo just isn’t it for me.", "What do you mean ?", "OP if your mum has never shown any issues with it before it could just be that she is overwhelmed by you growing up. In her head maybe it’s fine for her and your dad because they are grown ups and married but you’re a kid in her head.\n\nIf you have a good relationship I would ask her if she would mind if it was a bf. Then have an honest conversation.", "I would suggest you not give too much thought to all these reddit comments saying your mom is homophobic etc. It can be hard for a parent to adjust to their child growing up, and we all have certain stereotypes that can reflexively guide us despite our best intentions. If your mom has not actively made your sexuality an issue, don't let people who have no idea what theybare talking about convince you that she doesn't support you", "Just to say.  Food for thought:  there are varying degrees of acceptance/tolerance for same-sex relationships.  Not everyone is comfortable to the same degree. \n\nThe likliest explanation for your mom is that while she is cool with you and your gf, she is not comfortable with the affectionate display in front of little sis.  \n\nYou should be understanding that for your mom, this is probably a moral concern, which she is entitled to have.  That is, of course, the same as you are entitled to your own views on that subject.  To many, it is not morally equivalent on varying degrees.  It is her right to restrict that behavior in front of her younger daughter if she so chooses.\n\nNo, she is not 'homophobic'.  You can have a disagreement about the moral quality of LGBTQIAetc. relationships and not be a homophobe.  If she treats you and your gf well, she can disagree with the morality of your relationship and keep that to herself because she respects you as a person.  \n\nYou, however, must also be respectful of her feelings about how certain activities may affect your little sister.", "This could also very much be the case! It's worth it for OP to talk to her mom in a gentle, non-confrontational context for a lot of reasons, I think.", "I wasn't allowed to have sleepovers with guys in my room until my husband and I were actually married in our late 20s.\n\nWe later went on a self catered family holiday in a cottage and my mum casually asked about sleeping arrangements. I got the impression she was suggesting my husband would share with my brother. I pointed at my 6 month pregnant belly and said the ship has sailed on that one. She was shocked, and then laughed like I'd never heard before. It was a rare nice moment.", "Well...", "It IS a gotcha though. Because it shows that mom's explanation was bullshit. Mom's problem isn't actually that the 8 y.o. is too young to witness light kissing", "As human beings, yes, they are equals", "\n>Like I said, as I've gotten older... A lot of those \"because I said so\" have come to make perfect sense\n\nWouldn't they have made more sense sooner if you'd have been given an actual.explanation?", "So, you are aware that you didn't actually refute what I said right?", "And you wouldn’t have wanted it to make sense when you were younger?", "the moms decision might be her own but doesnt make it right  \n\n\nyes its her home and everything, but just because you brought a child into this world doesnt mean they are your little brainless-slave for 18 years", "8yo is definitely old enough to understand the concept of a girlfriend. Might be time to consider that you have some internalized homophobia bud. I see either a therapy bill or further willful ignorance in your future.", "\n> At 8yo there’s a big difference between seeing your parents have a kiss then seeing your 16yo sister kiss another woman.\n\nWhat is the difference?\n\nI can thing of: marital status, age, and gender/sexual orientation. Which one makes it inappropriate for an 8yo to witness?", ">then seeing your 16yo sister kiss another woman\n\nWhy is it specifically important to you that it's another woman here huh? I think homophobia miiiiight be at play buddy.", "Dang, sorry. Meant to reply to OPs comment above yours. Homophobia is what I meant.", "Yeah I would suggest talking to your mom for the root issue. This could just be she's upset at you kissing ANYONE romantically, and in front of your much younger sister. Kids growing up is hard on parents. \n\nYou're still NTA", "it's not a \"moral concern\", it's homophobia. no one's entitled to be homophobic. bet you have the same \"moral concern\" too. sorry you're too dense to understand that gay people are just people trying to live their lives.", "Gosh your mum! \n\nTradition is...weird.\n\nMy parents aren't even strict and I remember bring surprised when my mum said my now husband (then live in boyfriend) couldnt stay over in my childhood room - this was theoretical and we lived in the same town as my parents do, so we never stayed overnight. And the room has a bunk bed...so I don't know why she thought we'd be so desperate for sex that we couldnt just wait til we got home.\n\nMum and dad got married whilst they were pregnant with me. She was always very pro living with your partner and pro sex before marriage (she went with me to my first implant fitting years and years ago!) So it was wild.\n\nLike...she was very happily encouraging me to settle down and marry this man and have babies and my family love my husband. Every time I dated a guy she'd check in to make sure I wasn't being pressured and was happy with my sex life.  But she just had this weird belief that you just can't stay over at someone's house together until you're at least engaged. Because then the elders have to confront the reality you're having sex, I guess.  I think when she was growing up abroad, premarital sex was just so taboo that they still cant fully get over that in some ways.\n\nLike, I can get maybe not allowing partner sleepovers until college, teenagers have no subtletyor tact.  But once your child is an adult it starts to feel weird. \n\nHopefully when we have kids, I'd be like your partner can stay but I dont want to see any PDA more than a cuddle and a short kiss. If you have noisy sex i'll retaliate in kind. If you dont want to see your mum and dad getting frisky, they don't want to see you doing it! \n\nI would say that...but I think my husband would rather die than have anyone overhear our sex life lol.", "Doesn't matter.  Mom's house, Mom's rules.  If 17yr doesn't like it, she can move out when she is 18 and tell her mom she doesn't want her kissing her dad in her house while visiting", "But they did confirm that it was the second option", "I never said it was right", "All of the above, like I said this child is 8yo. If she was like 13,14,15 it would be different but she’s 8", "No problem buddy", "Aah, yes, the broad strokes.  The inability to tolerate anyone else's feelings on a subject that has such a wide range of religious and secular sensibilities.  \n\nAccording to your view, someone who is religious and believes that homosexual relationships are inherently sinful is a bigot regardless of how they treat those who partake of these relationships.  Of course, they can't possibly just let you live your life and not judge you because it's not their business.  When you do it in front of their children, in their household, they shouldn't be allowed to object.  It's not their right to care about what goes on under their roof.\n\nIs that about right?", "Ah yes, nothing like the bright blossoms of authoritarian regimes where unlimited power and strict pointless hierarchies exist", "Such a negative attitude. That would be pretty crap parenting.", "This is honestly such a depressing attitude. It requires OP to undergo a significant financial burden just to be treated like her own human person. And acts as if prohibiting her mom from kissing her dad in her house is at all an equal relationship to a parent micromanaging their child \"because I said so\".\n\nYou're demonstrating zero conflict resolution skills and very little empathy", "Holy fuck, I hope you‘ll never have kids.", "What’s the point of asking for an explanation if the explanation is bs? \nAnd what is the advice you’re giving here? Do not try to confront this with healthy communication? Place a huge strain on their relationship where nobody is comfortable… because mom’s house mom’s rules?", "the main point people are not agreeing with you is that you are defending the moms decision in a weird way \n\nJust because its her (the mom) house and \" her roof = her rules\" doesnt mean you cant call out parents bs. \n\n&#x200B;\n\nThis whole thing would be different if it wasnt a double standart on the moms side with a homophobic undertone. \n\nThe mam is basically saying \"rules for thee, not for me\".", "Yeah, and gay people exist. Oh the horror, an 8 year old knowing gay people exist!\n\nGay kissing isn't any more obscene than straight kissing.", "Well me and all my brothers and sisters turned out just fine.  So id disagree", "It's not a weird way, I am defending the moms decision (even if I don't agree with it)"]}