{"id": 29486, "submission_id": "17egjy6", "title": "AITA for telling my father's affair partner that she married him and she can take care of him now that he can no longer take care of himself?", "selftext": "My father was not a very warm and caring father when my siblings and I (all in our 20s now) were young. I'm the youngest and I was only 8 when we all found out he was having an affair with a woman he worked with. The affair only came out because the affair partner grew tired of our father staying married to mom and showed no signs of being willing to divorce mom for her. So she took measures into her own hands and confronted mom with the truth. My siblings and I were all home at the time. It blindsided my mom significantly because, while she knew our father worked a lot, he had always been attentive as a spouse to her and he could play pretend that he was invested in his kids. My mom's marriage to him fell apart and she moved out of his house with us and we started anew. My father fought for shared custody. I often wonder if this was to punish her or us or something because it's not like he had any role in our lives at all. But he was awarded shared custody.\n\nHis affair partner threw herself into this role of \"stepmom\" and she acted like she was some new person who had no bad history with us/our family. She even ignored the fact she destroyed our mom's heart right in front of us. We did not like her and within two years she told our father she no longer wanted us around anymore because \"all we did was bully her and make her feel like she was some unimportant mistake he made\" and she was also bothered by the fact none of us would acknowledge her as our father's wife or our stepmom. When asked we would always say she was our father's affair partner. This wasn't something she wanted following her around or thrown in her face a lot.\n\nSo we had no contact with our father for more than a decade. I'm 22 now. Recently the affair partner made contact to inform us that our father had suffered several health complications and he is now ill and disabled. My oldest brother confirmed this is true and is aware of which hospital he's currently in. None of us had any interest in seeing him and we expressed this, though not to her, to our father's sister. His affair partner decided my siblings would never give in but she knew a much younger me had a hope for a better relationship with my dad and she tried to say she couldn't care for him and the four young children they have under the age of 7 and that \"my family needs me\". I told her clearly that they were not my family and that she married him so she was responsible for caring for him now that he cannot care for himself and I told her I would not help and did not care how tough it was for them.\n\nHer response was full of anger but she in not so many words called me an asshole. I ignored her but she again insulted me and claimed that I was sick and cruel for my stance.\n\nAITA?", "created_utc": 1698054390, "permalink": "/r/AmItheAsshole/comments/17egjy6/aita_for_telling_my_fathers_affair_partner_that/", "score": 1284, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my father's affair partner that she married him and therefore is responsible for caring for him and that I would not help and did not care about her family's struggles. The reason I feel like I might have handled this in an AH kind of way is that I did not say no and move on. I was dismissive of the struggles they would have and she has kids with him and I don't care about those kids either so there's a chance that my whole flippant and aggressive response would be considered wrong given the circumstances.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, your dad made the choice to be shitty to your family & his affair partner chose to marry him. There's that whole \"in sickness and in health\" marriage thing she seems to have forgotten about.", "NTA.. she wanted your dad.. she took your dad.. she didn’t want his kids around and he obliged.. \n\nYou nor your siblings had any say in your relationship with your dad.. \n\nShe wanted him and now that things are hard she wants his kids back in his life.. \n\nBad decisions have consequences,, she’s now getting hers..", "NTA\n\nthis is Karma in action, she is reaping what she sowed.\n\nShe destroyed your Mother and your family. You owe her nothing.\n\nthere are 2 AH's in your tale, Your father and his affair partner", "NTA\n\nShe wanted him all to herself and now she has him.\n\nAll. To. Herself.", "nta\n\nplay stupid games win stupid prizes\n\nshe picked him made him chose her and now when its bad she needs help\n\nno she did this\n\nhope your mom is happier, and living her best life", "NTA. Fuck those people. She made the choice to upend your lives, and then cut you out instead of putting in the work needed to repair the damage she had caused. Again, fuck those people, let them lie in the bed they made. Do you have any relationship with your half siblings? Be there for them if you want, but you owe them nothing.", "You are not the A hole!  Life has consequences, and it's her problem to deal with those consequences.  Having grown up in a family broken apart by infidelity and then marriage to the cheating partner, I am consistently amazed at the mentality of we did what felt best for us but now we are due  your complete love, acceptance and support.  She dug the holes she now finds herself in, don't help dig her out.", "Don’t engage with her, block her and forget. Funny how tables turned and suddenly you should step in. It’s her husband so let her deal with it. Not a big price for destroyed family they caused.", "NTA\n\nShe got exactly what she asked for. \n\nShe destroyed your mother by confronting her with the truth IN FRONT OF HER CHILDREN. \n\nShe attempted to put herself into a role none of you were willing to offer in the first place. And then ordered your sperm donor to send you all away when it didn’t work out. \n\nShe made sure your father didn’t have anything to do with you all for over 10 years. \n\nShe paved this road to hell with her own shitty life choices. Let her walk it alone.", "NTA and it sounds like dad and his affair partner literally f'ed around and found out. It's not the responsibility of you or your siblings to help or care about the situation they've found themselves in.", "NTA 1000%\n\nPlay stupid games, win stupid prizes.\n\nShe broke up a family now she gets to feel what it's like to work her ass off to keep one together.", "NTA. You have absolutely no obligation to either your father or his wife. They made their choices and can suffer the consequences", "NTA.  Home wrecker #2 has some nerve asking you for help now that home wrecker #1 is sick.", "NTA \n\nActions have consequences.", "Nta\n\n\nTell her to ask the new sidechick for help, cuz marrying her opened up a new spot in his rotation.", "NTA.  Her husband and her responsibility.  This is the life she stole and she gets to have it.  This man choose to step away from his family and create a new one.  His new family gets to have all of him in good and bad.  Do not feel guilt, as you know he would not be there for you should you have been the one in need.", "She got what she wanted and sucks for her that it turned sour. Karma is really cool sometimes isn’t it? \n\nNTA", "NTA nope their made their bed, they have to lay in it", "NTA.\n\nThis is what follows from her past choices.", "NTA\n\nHis actions have consequences. You haven’t spoken to your dad in a decade, so you basically have no relationship with your younger half siblings?", "Why is it always the shittiest parents that have a dozen kids??", "The dildo of consequences rarely arrives lubed. Neither one of them seems to remember that they were supposed to be the adults in the situation and that they need to be accountable for their actions. NTA.", "NTA. To add to the rest of the reddit witticisms others have commented, she played a stupid game and won a stupid prize.", "What is it with parents having a shocked pikachu face when the kids they throw away want nothing to do with them?\n\nNTA.", "NTA simply put, your father is an asshole and doesn’t deserve your pity, empathy, sympathy or kindness.", "Well if it isn’t the old “fuck around and find out”.  NTA.", " NTA, karma is a btch", "NTA. I was in a similar situation with my mother. I noped the Hell out.\nYou don't owe your father or the affair partner anything.", "*\"What will get my friends, family, and kids to be disgusted with me, and my affair partner?\"*\n\n***DOES EXACTLY ALL THAT.***   \n*What, wait, they don't love me, care for me, and are really not anywhere near me or my new shiny family?\\`****WHY DID THIS HAPPEN?!***  \n\n\n  \nNTA. She chose to marry and be a pain, he chose to marry and step out, and be a pain. They made their bed, they might not like it, but that's their bed.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy father was not a very warm and caring father when my siblings and I (all in our 20s now) were young. I'm the youngest and I was only 8 when we all found out he was having an affair with a woman he worked with. The affair only came out because the affair partner grew tired of our father staying married to mom and showed no signs of being willing to divorce mom for her. So she took measures into her own hands and confronted mom with the truth. My siblings and I were all home at the time. It blindsided my mom significantly because, while she knew our father worked a lot, he had always been attentive as a spouse to her and he could play pretend that he was invested in his kids. My mom's marriage to him fell apart and she moved out of his house with us and we started anew. My father fought for shared custody. I often wonder if this was to punish her or us or something because it's not like he had any role in our lives at all. But he was awarded shared custody.\n\nHis affair partner threw herself into this role of \"stepmom\" and she acted like she was some new person who had no bad history with us/our family. She even ignored the fact she destroyed our mom's heart right in front of us. We did not like her and within two years she told our father she no longer wanted us around anymore because \"all we did was bully her and make her feel like she was some unimportant mistake he made\" and she was also bothered by the fact none of us would acknowledge her as our father's wife or our stepmom. When asked we would always say she was our father's affair partner. This wasn't something she wanted following her around or thrown in her face a lot.\n\nSo we had no contact with our father for more than a decade. I'm 22 now. Recently the affair partner made contact to inform us that our father had suffered several health complications and he is now ill and disabled. My oldest brother confirmed this is true and is aware of which hospital he's currently in. None of us had any interest in seeing him and we expressed this, though not to her, to our father's sister. His affair partner decided my siblings would never give in but she knew a much younger me had a hope for a better relationship with my dad and she tried to say she couldn't care for him and the four young children they have under the age of 7 and that \"my family needs me\". I told her clearly that they were not my family and that she married him so she was responsible for caring for him now that he cannot care for himself and I told her I would not help and did not care how tough it was for them.\n\nHer response was full of anger but she in not so many words called me an asshole. I ignored her but she again insulted me and claimed that I was sick and cruel for my stance.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I would’ve responded “wahh” nta", "NTA\n\nThis is a perfect example of fuck around and find out.\n\nI hope you dont lose any sleep over this. Just keep living your life without him!", "NTA. You could tell her karma is a bitch. You wanted our father, he is all yours. The audacity of your dad's current wife to call you an asshole.", "NTA- consequences of marrying an old man.", "NTA I would tell her “you made your bed, now lie in it. You didn’t want us around anymore. You don’t get to claim “we are family” now just because it suits you. I want you to look at this current situation. Understand this hardship is all because of choices YOU made. In the future, if you want peoples help, don’t treat them like options. You took great pleasure it breaking my Moms heart.. enjoy the fruits of your labor.”", "How is she able to repeatedly contact you?  Makes no sense.", "NTA", "NTA, consequences of consequences have a price, she needs to pay it.", "NTA\n\nHe chose her and she him, and discarded you when the reminder of this became too embarassing..\n\nShe - and he - made their bed (!) let them lie in it.\n\nTell her to pound rock, and block her.", "NTA hahahahahaha you where \"cruel\" yeah. F that b and your bio daddy. Don't contact him. Your kids and your momma need to do one thing: enjoy life. It's her hell now and not yours. He didn't took care of you while you were younger so you don't have to. The latest wife can change his diaper when he can't go to the WC anymore.", "Lol, he made his bed, he must lie in it. His wife wanted him when he was useful, now that she has to step up and care for him, she's pawning him back to your family. Exact same situation that I face right now. Tell her to f**k off.", "NTA. You don’t owe her or your father anything. He cheated and ruined your mom. This woman is cruel and heartless and didn’t care about helping destroy a marriage or the kids in it. Now she wants your help? Block her number and move on with your life. She wants you for your money.", "NTA", "NTA", ">she tried to say she couldn't care for him and the four young children they have under the age of 7\n\nYikes!!!!  NTA.  She made her bed..", "Gee, if it isn’t the consequences of her own actions… \n\nNTA", "NTA. She made her bed so she can crawl in. I've never been in her position but I don't respect it. It's devastating to be the parent left behind picking up the pieces. It was not only devastating to me but to my child also. She's never fully gotten over it and it's been YEARS. It sucks that your dad is sick, but it isn't on you or your siblings to swoop in and fix relationships they broke and certainly not on you to care for someone who was so willing to cast you all - his children he was responsible of caring for- aside...", "She got what she paid for. Or she’s paying for what she took. No obligations on you either way.", "The affair partner made her bed of betrayal and spite, she can bloody well lie in it and stew. NTA", "NTA. You haven't interacted in a decade, where was her concern for \"family\" when you needed your dad for the last 10 years?\n\nI also don't understand the logic of having a whole bunch of kids with a guy that threw his previous set of kids out at the new partner's  behest. What are his qualifications as a father other than fertile?", "NTA Karma is a bitch", "NTA.\n\nAs you sow, so shall you reap. Or, FAFO.", "She didn't care about family when she started doing your dad. Was she ever concerned when your mum had to care for your siblings all alone? You're SO NTA. What I think about her is going to get me banned...", "NTA, This woman destroyed your family and broke your mother. Your father did the exact same. \n\nFuck them both. They can be miserable together. You've no obligation to your father nor his AP.", "NTA - she took him in sickness and in health. She now has to deal with his sickness. He had no role in your life for the past decade, I can see why you wouldn't be involved with his. She also needs to care for *her own children* - none of this is your burden to bear.\n\nYour father made his choices and now you are making yours.", "NTA  \"she told our father she no longer wanted us around anymore\"\n\nShe got what she wanted.....enjoy", "NTA in the described situation but it does sound like you have some growing up to do.", "NTA.  She's the A.  Set aside them and their feelings, do have to think you should visit him for yourself? It hurts that he abandoned you guys, but sometimes to mend things for our selves, for our sake, we need to face the person and at least let them know how horrible they were to you (your father, not his so) Make decisions for you, not her and him.", "INFO: More than a decade ago you were using the term 'affair partner'? That's weird no?", "The current situation NTA, but a hard ESH for the story as a whole.", "ESH - apparently this is the woman he loved and chose for reasons that you will probably never understand. Your attitude should have been addressed when you were a little child and your step mother first came on the scene. They let it go this long, it’s on them. That’s what they get I guess. It’s a shame. There’s not enough information in your post to really explain why you are so hostile towards them but I’m sure there’s more.", " NTA", "She fucked around and literally found out. Block her and let her deal with the mess she is partially responsible for", "NTA you owe her nothing", "NTA She didn't want you around before, no reason you should be around now.", "NTA. Well, well, well the chickens have finally come home to roost!", "Nta your dad literally f@cked around and found out.", "Classic F***around and find out.\n\nNtA", "NTA. You deserved better from your father. You don't owe him or his AP anything after the way they treated you.", "NTA.\nThis is karma making a visit.\nThe only thing that may give you pause is whether or not you want to support (emotionally) or have a relationship with your half siblings - it's not their fault they got a double whammy in the shitty parent lottery.", "NTA.  Caveat emptor.  Buyer beware - yes that means you lady, Wife No. 2.  \n\nEveryone gets old, some get sick, that's the deal you struck. Everyone else paid a price for it.  Now you have a go.  Done well, many spouses find the hard years of dealing with their partners failing health to be very enriching spiritually.", "NTA", "NTA\n\nNot your problem. Hope your mum is ok.", "NTA They made their bed, now they have to sleep in it. \n\nMaybe tell her she should research if there’s another AP of his who’s willing to help her. It’s not like she’s some Wonder Woman who’d magically be enough for him.", "NTA\n\nI am so sorry for the loss of your father. No child should be treated as you were. He chose to disappear from your life a long time ago. You owe him and his new family nothing.", "Fuck that\n\nFuck them\n\nNTA", "NTA.  She might think it's cruel, but she did what she did and destroyed your family unit, and thought it was perfectly okay to do that, but your family won't fix her problems now that he's careably ill, and gosh what a terrible cruelty. You are not obliged to help someone who made no effort to you.", "NTA your father gets the care of his children he deserved. None from you. I hope you are in a country that cant make you pay for his care. In some they can sue for your help.", "NTA, the mistress and the husband should stay shunned. that's how my great grandma's family dealt with ours. Shunning. Shun them harder OP. Look at all you've all gone through because of her and she has the nerve to ask you of all people for help? As the kids say \"miss me with that shit\"", "NTA.  \n  \nMy mom married a guy younger than all of her kids, which isn't necessarily so bad, except that she excommunicated the entire family for him and only recently has tried rekindling her relationships.  I hope the due realizes he's on the hook in her old age as she's now 60 and he's not even 40.\n  \nBe prepared for her leaving and possibly your dad reaching out because he \"has no one\".  That's the decision he made and abandoned yall when you were little.  Let him see how it feels.", "NTA. She thought she'd get to play stepmom, that you would accept her,, despite the fact all of you were home and present when it happened. Of course it was gonna follow her around! What did she think was gonna happen? \n\nYour father made his choice when he had the affair. Made it clear when he chose the affair partner over his wife and kids. And twisted the knife when he gave you all up after 2 years when she realized her past would never go away.\n\nThis is now 100% HER responsibility. She is his wife now and needs to act like it instead of trying to manipulate someone she hurt.", "If my step mother contacted me and said my bio dad was sick, and wanted money, all I’d say is just tell me when the funeral is so I can spit on his grave. Most definitely NTA.", "Sounds like you already know exactly how you feel about the situation and aren’t really interested in hearing whether or not you were in the right.", ">My father fought for shared custody. I often wonder if this was to punish her or us or something because it's not like he had any role in our lives at all. But he was awarded shared custody.\n\nIt was about money. 50/50 custody often means no partner pays the other partner child support. A common scenario is that a father who was never very active in child rearing gets 50/50, then moves another woman in to do all the \"woman's work.\"", "NTA -  She (and him, of course) broke your family, hurt your mum in front of you, decided they wouldn't have a relationship with you when you were less than doting stepchildren... and now she wants your help? Even though she knew younger you wanted a relationship with your dad and she worked against it? Don't give her the time of the day, she does not deserve it. Ignore her anger, she's just entitled and surprised she can't manipulate you into doing whatever she wishes.", "Man. I'm in almost the same situation. Parents divorced cause my dad left his family to raise his nieces family instead. Came back and is now old/blind. Moved neice in with him, and he has the gall to ask me to be civil with her.", "Reap, sow..Reap, sow…", "Lol. NTA. Not by a long shot. Your father and that homewrecker are, though. Karma does do wonders when it hits. Enjoy your life knowing you made the right decision.", "NTA. The only person you should be taking care of is your mother. Sperm donor and his side piece can go f themselves.", "Morally you owe them nothing.\n\nBut in some US states, childrenhave anobligation tp support their aged and infirm parents. I know Pennsylvania does but am not sure of the others. Check with a real, non-internet lawyer.\n\nThe best bet is to Google the law schools in your state, look for teh ones with Family Law Clinics and ask there. It will be accurate . Ask whether the existence of a spouse makes any difference to your obligation", "NTA\n\nIn sickness and in health, until I get bored of you and run off with somebody else.\n\nHas now become\n\nIn sickness and in health, until it isn't convenient for me any more\n\nThey made their beds, now they have to lay in them", "I would tell her point blank, “You reap what you sow!”\n\nNTA", "Nta. I understand how their actions have hurt you and how disinterested you must be with his new family. They chose to have children. They chose to leave his oldest set of children behind. They haven't had contact in a decade. Op, I'm sorry for what's happened to you. I could never leave my children nor treat them like your father has treated you. I can't fathom not having a relationship with my own children. I hope if you haven't already had it that you get some therapy to process all that's happened to you. I wish you peace.", "NTA", "NTA\n\nHome wreckers get no consideration. They both made their bed and they are more than welcome to lie in it.", "This sounds like the plot to \"Diary of an Angry Black Woman\" The husband left a woman that gave 80% for some pretty young piece of fluff that barely gave 20% and as soon as his health deteriorated she drained the bank accounts and left his crippled ass high and dry. \n\nIMO you're NTA simply because she was a cruel and vicious bitch by destroying your home life the way she did so now she can deal with the consequences.", "NTA\nYou have had no functional relationship with these relatives for 10 years by your choice. (Not judging that choice.) Why would she expect a change now?", "NTA..she wanted him, she got him. He’s her problem now. Block her number.", "NTA\n\nI mean, let's be honest nothing this woman said to you was born of anything more than self-desire. She doesn't want to do this alone so she'll gladly demonize and vilify you until you break. However, neither your father nor her are deserving of the family treatment when he made no effort and she only made an effort when she thought she could get one over on your mother. She gets what she deserves.", "[removed]", "She doesn't want his kids. She wants the heavy lifting and grunt work they will provide so she can continue to enjoy her life.", "perfect summary", "\"Welcome to the 'worse' part of 'for better or worse '.\n\n\"You don't get to return him now he's broken.\n\n\"You made this bed, now you lie in it.\"", "[removed]", "Yep - she's getting exactly what she wished for, which is why you should be careful what you wish for...", "I do not have a relationship with them. I never met them and only learned they existed recently.", "I wouldn't get anywhere near these kids until they are grown-ups. They are not part of OP's family, their only link is biology. And OP said that mum's family are well-off. If OP tries to have a relationship with the little ones, not only will they be considered the de facto babysitter, but they will also be asked for money to (help) support them. After all, they have just lost their dad/their dad is so very ill and their mum can't possibly cope... Never mind that OP lost his/her dad as a younf kid bacasue of their mum.", "My bet is if OP did agree then the affair partner/current wife might bolt with the kids now that someone was there to claim responsibility.", "Nope. Never met them and have no interest in meeting them either.", "\"The dildo of consequences...\"\" LOL!! Thats hilarious!!😆😃", "Social media is how she contacted me. I have a few accounts.", "In what way do I have growing up to do?", "I don't think I should. I'm at peace with not seeing him. It's what I wanted really when I did have to see him per the custody order. It was a relief when I got to stay with mom.", "Is that not what she was/is?", "?", "Not weird. I had siblings who were teenagers and learned it from them.", "This question was so stupid it gave me cancer.\nDon’t be obtuse or condescending. \n\nFind OPs stepmom!", "Can I ask why for the story as a whole?", "The woman went to my mother and broke her heart in front of us kids. My father was not a good father to us and cheated on my mother.", "Not enough information to explain why he's so hostile towards them.......? Did you actually read the part where his father had an affair and destroyed their family and the affair woman turned up at their house and confronted his mother and destroyed her marriage?\n\nAnd the woman isn't his step mother, she's his father's affair partner.", "What do those reasons matter if the woman went to their house and revealed that their father was cheating in front of them and their mother 💀. \n\nShe did not intend to be a good step mother and their father is shit", "There is plenty to go on wtf. When you're 8 years old and you see a strange woman telling your mom in front of you that she's taking away your dad of course there will be resentment. \n\nI don't care if this woman and dad loved each other, the fact is he chose to have an affair instead of divorcing right away. He let that wound fester and play pretend until his affair partner decided to take it to the mom and kids.\n\nThat's more than enough reason to hate both dad and affair partners guts. Don't sugar coat it with \"oh but it must be true love!\" He did wrong, she did wrong, the kids never asked to be put in the middle.", "This is such a bizarre take", "Mot enough information?\n\nThe man left his family for a woman. Literally. She made him cut contact with his children for a decade. OP grew up fatherless. Then the woman contacted the family when she needs them because she doesn’t want to take care of the father of her children. Also, they are both cheaters. I think there’s enough information on why they are the very obvious AHs.\n\n\nNTA.", "I do not want a relationship with them. That's something I am very sure of.", "My brother looked into this before and that is not something we would be legally on the hook for.", "And AP has shown herself repeatedly as emotionally manipulative.  NTA to stay far away from that", "And maybe the money. Our mom comes from a family who were always very comfortable and I have no doubt that she knows about that too.", "And babysitters! 4 kids under 7 wouldn't be easy to manage with a disabled partner in the house. However, its still karma.", "When the children they discard want nothing to do with them, why do parents always look like horrified pikachus?\n\nN.T.A.", "And after that made his bed too", "Nta", "I understand your feelings on the half-siblings but remember, they are NTA either. I'm sure their world is crumbling much the same way yours did at their age. One day, you may choose to have a relationship with them. I'd consider this when they are adults though and not under her control and she would undoubtedly try to manipulate you with them as leverage.", "I agree, I wouldn't seek out a relationship with them because of this, but I would not cut one off because of it if one existed. Like I said, OP owes these people nothing.", "Good to check off that possibility", "She absolutely wants something from you, whether it’s money or someone to care for her husband and/or kids. She’s looking at having to raise kids on a single income with finances in a bleak state since medical issues are so expensive. If it was just “I want to give his other kids a chance to reconnect” she wouldn’t be raving at you, she’d just let it go. But she wants something from you that you have no obligation to give, given how they both treated you. You are free to block any contact from her if that helps.", "Keep away from her. Do not let her convince you into supporting her kids \"because they are your younger siblings and family helps family\".", "She wouldn't be able to access your mom's families money. If she thinks she can, she is delusional.", "Oh, I don't blame them at all for any of this. But I just do not consider them my family. Related by blood, sure. But nothing more than that. I don't see a time where that will change for me or for my older siblings.", "She could never convince me to do that. I do not consider those kids to be part of my family and have zero interest in changing that.", "She wouldn't but the assumption is probably we could access it and help her/them with it, which is a big fat no from me.", "Why would she think you all would do that after the way you were treated? Some people are pure idiots."]}