{"id": 29497, "submission_id": "17eithg", "title": "AITA for washing my hair once a week?", "selftext": "I live in a college dorm with a roommate. I have an extremely dry scalp that always gets those maddening tiny white flakes that people often mistake for dandruff (dandruff chunks are bigger and yellow and come from oily hair). I recently asked a hairstylist for advice and she suggested less hot showers on top of washing my hair less. I looked it up and found that many people wash their hair once or twice a week. Because of how itchy my hair is, I’ve decided once a week. \n\nNow here’s the issue of my roommate: she started noticing that every time I come out of my regular showers that my hair is dry. She asked if I’m not washing my hair and l said yes. She gave me a disgusting look and said “that’s gross.” I explained the dry scalp thing but she did not seem convinced that washing your hair once a week was hygienic. I continued on anyway. Every time I would consistently come out of the shower with dry hair she would go on about how disgusting it is that I don’t wash my hair. Reminder: I do wash my hair, just not often. \n\nTo me it’s very important I start getting these flakes under control because my hair is naturally jet black so it’s very obvious when they’re there. My roommate however insists it’s more important I wash my hair minimum every other day. She keeps insisting I’m being absolutely gross and making her uncomfortable almost every day now. I think this is ridiculous but it really seems to be bothering her. AITA?", "created_utc": 1698062909, "permalink": "/r/AmItheAsshole/comments/17eithg/aita_for_washing_my_hair_once_a_week/", "score": 157, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I’ve started to only wash my hair once a week\n2. It’s making my roommate extremely uncomfortable and it grosses her out.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta", "NTA.\n\nShe can move out if she is so disgusted with normal behaviour.", "NTA. My guess is roomie is over-washing", "NTA, if you have greasy hair then it needs to be washed more often but, frequent washing can damage hair as you're stripping the natural oils out and it gives you split ends and drys the hair out.\n\nI wash mine once a week with only conditioner and it's the healthiest it's every been and has thickened up.", "NTA. Tell her to ask her stylist if there's anything wrong with washing your hair once a week. I also only wash my hair once a week,  I have very fine hair, and more frequent washing really dries it out. My stylist approves of a once-weekly wash and says less frequent washing is probably the number one thing she recommends to clients. As long as you're not doing anything that gets you really dirty or sweaty, you're all good.", "NTA. What the hell does she do with her hair that she NEEDS to wash them every day, else it's gross ?!\n\nOnce a week is totally fine.", "NTA \n\nTell her it's none of her business how you care for your hair and to get a life.", "NTA. She has no right to interfere with your shampoo frequency.", "NTA. Your hair, your business.", "NTA. I shampoo twice a week and wet my hair on the other days to eliminate bed head.  \n\nTell roomie to mind her own business.", "NTA. Your roommate needs to get over it.", "NTA\n\nShampoo companies market how often/how you should wash your hair (not doctors)... and it's bad for you.\n\nMedical science supports washing your hair with cold water only (no shampoo) actually makes your hair grow healthier and keeps your scalp healthy. Harsh detergents are bad for your skin and strip your hair/scalp of it's natural oils. So essentially, shampoo is degreaser and conditioner puts the oils/minerals back on your hair/scalp artificially... causing your scalp to flake and become itchy. \n\nBottom line, your roommate is TAH for being misinformed and a busy-body jackass.", "Nta- I was washing my hair everyday because I have oily hair and developed dandruff. Then I cane to realize that I had greasy hair and dandruff BECAUSE I washed it every day. I have switched to every other day and am trying to stretch it out to every two days for a few weeks now. I think my flakes have nearly gone and my head feels a lot better.", "NTA! It’s none of her business what you do in the shower & her continuing to pester you can be seen as harassment. She can switch rooms if she’s so ‘uncomfortable.’ \n\nI use dry shampoo & wash my hair every 5 days or so. It’s actually much better for your hair to wash less often, unless there is a medical reason that requires frequent attention.", "NTA but you should probably still be wetting your hair down with cool water to rinse off dust and pollen and get some much needed moisture to your scalp.", "NTA, just be careful moving from I assume every other washings to immediately once a week. I did this and I gave myself basically adult cradle cap even though I was brushing my hair out every day. My hair stylist recommended extending out washes by a day so every other day, every three days, for 2-3 weeks and then increasing", "NTA. Plenty of people wash their hair 1-2 times a week. I wash mine once a week and it was the best decision I ever made.", "In this situation, it's important to consider both your need for hair care and your roommate's perspective on hygiene. You're not necessarily the \"asshole\" for trying a hair care routine that has been recommended by a professional to address your dry scalp issue.  \nHowever, it's also important to communicate with your roommate and find a balance. While washing your hair once a week may be necessary for your specific condition, there are ways to manage the situation without making your roommate uncomfortable. You could use a shower cap or shower at times when your roommate is not present to address her concerns.  \nThe key here is open communication and mutual respect. Discussing the issue with your roommate, explaining the reasons behind your hair care routine, and finding ways to accommodate both your needs and her comfort can help resolve the situation amicably. Remember, it's about striking a balance that respects both your needs and your roommate's feelings.", "NTA- not meant to wash you're hair too often as it takes away the natural oils. Ignore or tell your roommate to F off.\nI only wash my hair once or twice a week because if I do it too often it gets greasy on top and super dry at the ends and most of the girls I know are the same. She's actually a minority in my opinion.", "NTA. That's none of her business.\n\n>I explained the dry scalp thing\n\nYou don't have to tell her. She's your roommate, not your mom or your girlfriend. Tell her to leave you alone. If she wants to wash her hair every time she's taking a shower, that's on her. If you want to wash your hair once a week, that's on you. End of discussion.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI live in a college dorm with a roommate. I have an extremely dry scalp that always gets those maddening tiny white flakes that people often mistake for dandruff (dandruff chunks are bigger and yellow and come from oily hair). I recently asked a hairstylist for advice and she suggested less hot showers on top of washing my hair less. I looked it up and found that many people wash their hair once or twice a week. Because of how itchy my hair is, I’ve decided once a week. \n\nNow here’s the issue of my roommate: she started noticing that every time I come out of my regular showers that my hair is dry. She asked if I’m not washing my hair and she said yes. She gave me a disgusting look and said “that’s gross.” I explained the dry scalp thing but she did not seem convinced that washing your hair once a week was hygienic. I continued on anyway. Every time I would consistently come out of the shower with dry hair she would go on about how disgusting it is that I don’t wash my hair. Reminder: I do wash my hair, just not often. \n\nTo me it’s very important I start getting these flakes under control because my hair is naturally jet black so it’s very obvious when they’re there. My roommate however insists it’s more important I wash my hair minimum every other day. She keeps insisting I’m being absolutely gross and making her uncomfortable almost every day now. I think this is ridiculous but it really seems to be bothering her. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. She’s your college roommate. Unless it’s directly affecting her, your stylist-recommended hygiene habits are none of her business. If she doesn’t like it, she can move. If she doesn’t stop it, you can report her for harassment.", "NTA. Washing hair once or twice a week is fairly common. I don’t think your roommate realises that it’s different for everyone, and for a lot of people washing it once or twice a week is the best for them, and for others, daily works for them. She’s being ignorant and stupid. Ignore it.", "NTA. I have curly hair. It HATES being washed more than once a week. Your hair your business", "Well..depends, doesn't it? If I get sweaty at the gym, I'm washing that hair!", "Unless it ends up stinking.\n\nBut that also goes with having showers and general hygiene. \n\nI don't care if someone only wants to have a sink shower once a month, but the moment you smell bad and it's having an effect on me, then get away or have a real shower", "I’ve done that a couple times. I dry that while I’m in the bathroom so that could be throwing her off too.", "Thank you, I was already only washing it every other day and would sometimes end up skipping so I think I’m okay but I’ll definitely be careful.", "I did go in depth about why I need to do this with her. I explained how washing it regularly is stripping away the oils I need (another commenter suggested I shouldn’t have to explain this) and that washing it less is what’s working. She’s still not convinced and insists it’s gross. As for washing it when she’s not there that’s not really an option because when she’s not in class she’s almost always in the room and a lot of our classes line up time wise. Even if I used a shower cap she’d still know I’m not washing my hair. I don’t think it’s a matter of seeing my hair, I think it’s the idea that she knows I’m not washing it is the issue.", "Sure. But OP didn't mention gym or anything. So that why I said that once a week is fine.", "Like I said I still shower even if I’m not washing my hair. It doesn’t stink as my hair always smells the same way if no scented shampoo (no clue why, might be something in my genes) and it’s not a bad smell.", "NTA.\n\nSo a hairdresser told me once that sometimes those flakes are also from using too much shampoo & not rinsing all of it out. Then they see those flakes & buy anti-dandruff shampoo which is harsher & it makes it worse!\n\n It was supposed to be roughly a 1euro coin amount on the top of the head & massage in. Then rinse it all out, this moves oils & dead skin etc off the scalp into the hair. Then you repeat (it'll be foamier this time) & this washes all the stuff out of your hair. \nAlso yes, use cooler water.\n\nDepends also on your water hardness, soft water will need far less shampoo & lots more rinsing compared to hard water. \n\nHow often you wash your hair can also depend on your hair type! Mines very straight & oily, so I can go 3 days without washing it, I can push it to 4 if I braid it but it does usually look oily by then. \nThat might be the hot water use, but it's Ireland, it's damp, cold & rainy & I'm not giving up hot water even for hair health!! XD", ">I did go in depth about why I need to do this with her. I explained how washing it regularly is stripping away the oils I need (another commenter suggested I shouldn’t have to explain this) and that washing it less is what’s working. As for washing it when she’s not there that’s not really an option because when she’s not in class she’s almost always in the room and a lot of our classes line up time wise. Even if I used a shower cap she’d still know I’m not washing my hair. I don’t think it’s a matter of seeing my hair, I think it’s the idea that she knows I’m not washing it is the issue.\n\nIn this case, it's important to prioritize your health and well-being. If washing your hair less frequently is a recommended approach to address your dry scalp issue, and you've explained this to your roommate, it may be a matter of her needing to better understand the situation.  \nWhile you've been considerate of her concerns, you also need to prioritize your own comfort and health. You could consider discussing the issue with a residential advisor or housing staff who can mediate the situation and provide guidance on how to handle this roommate conflict. They may be able to help you find a resolution that respects both your needs and your roommate's feelings.  \nRemember that compromise and understanding are key in resolving such conflicts, but your health and well-being should also be a top priority.", "Like I said, unless it smells, then it's fine.\n\nHave my NTA", "NTA, your roommate is ridiculous. Many, many people, especially those with curly or coily hair cannot wash their hair more often than once or twice a week because it gets too dry and that type of hair needs the natural oils to be healthy. \n\nBecause it seems like she is refusing to believe you when you say that it is recommended, I'd go petty if it was me, just to prove my point... go online and find reputable sources where it specifically recommends less washing/no washing, print them and put them up all over your room. Or just keep asking her when she became a professional hair stylist and how she somehow knows soooooo much better than literally every ethnic hair stylist ever. She's an idiot and I'd drive it home until she gets the point. LOL but I have curly hair and this greatly annoys me and I'd go petty the whole way so maybe this isn't great advice.", "NTA - Just a tip - my fiance has the same thing. Clean hair, not oily. He uses Nizoral and it really helps.", "Nta - you can tell your roommate that you didn't ask for her opinion. Stop being too nice, she's being a jerk to you.\n\nGive a shot to massaging your scalp with coconut oil 2/3 hours before hair wash. I was skeptical but gosh no more itching!", "NTA. You mention that your hair is jet black-- black hair sometimes has much lower porosity than hair of other colors, largely depending on genetics. Porosity refers to how well your hair *absorbs* things-- which includes both products, and contaminants like sweat. Hair with lower porosity should be washed less frequently than hair with higher porosity, because it gets less dirty to begin with and also using products on it too frequently can cause the product to build up on the outside instead of getting absorbed. So even outside the issue with your scalp, it might be more suited to your hair type to wash less frequently anyways.\n\nYou can do a few different tests to determine the porosity of your hair, or just observe how it seems to react to products. But I suspect that if your hairdresser is telling you to wash less frequently, she probably has observed that your hair has low enough porosity for that to be an option for you. \n\nIf you do have low-porosity hair, you might benefit from hair care tutorials by Black women (who often have low-porosity hair) and/or hair care routines intended for people with curly hair (which is also often low-porosity). Even if your hair isn't textured in the same way, the porosity level might be the same and so you could still use some of the same techniques. I don't know much about Black hair care (I'm very fair and have fairly porous hair myself), but I do know that they have techniques for things like moisturizing the scalp with oils and protecting the hair from getting dirty while exercising, which might help you manage how frequently you need to wash your hair. \n\nYour roommate is probably speaking based on her own experience. I'd wager that she has more porous hair and her own hair thus needs washing more frequently than yours or it becomes noticeably greasy, so she can't imagine your hair NOT being greasy with less frequent washing. But I wouldn't call this a N A H because people with different hair types shouldn't use their own experiences as a basis for critiquing others, especially because there's often a racial component to the issue.", "NTA \n\nAs a fellow jet black/white flake member, this shit is mad annoying. I also wash once a week/ every other week. My hair is THICC. Like it’s hot all the time so if I start to wash daily my shit is dry and annoying. Use coconut oil to lightly oil the scalp. Make sure you get regular cuts too! It helped a lot for mine.", "NTA Your hair is your choice, but do look into what shampoo you are using. Might be a good and expensive brand, but sometimes those things are scum and actually have trash ingredients! I would look at Mane and Tail shampoo, don't let the name fool you, it's for people! They have much kinder ingredients with far fewer chemicals, and they have one that moisturizes the hair.", "is better for your hair to only wash it once a week. every day makes for some dry ass dandruff prone damaged hair", "NTA, I wash my hair once every 4-6 weeks. I also have an extremely dry scalp. If the only way she can tell it's not washed is that she sees you after a shower then there is no issue.", "NTA. I shower daily and wash my hair like at most once a week. I’m still clean and would take large offense to someone saying otherwise.", "Tell her there are different hair types and skin types. People with curly hair don’t wash as often for example because it’s bad for their hair. She must have an oily scalp and washes her hair more often - you have a dry scalp. ask her if she’s discriminating against you because of this? Tell her how easy it is google about dry scalp and how common it is for people to wash once a week and how embarrassing it is that she 1)doesn’t know that 2) couldn’t bother to take two minutes to learn about it if it bothers her so much", "NTA, but your roommate is. She should not be dictating your hygiene. It’d be one thing if you smelled, but you don’t. Plus washing hair less has been acknowledged as healthier for a while. Plus you have a legit medical reason (dry skin).  \n\nIf you just want to shut her up, you could start running a blow dryer for 10 minutes after each time you shower (she’ll have no way to know that you’re not really using it )", "NTA. It's not really any of her business and she seems a bit obsessive. Why is she constantly observing you coming out of the bathroom. Doesn't she have better things to do.", "NTA, but do be sure to change your pillowcase frequently to ward off the scalp oil smell.", "NTA and tell her to mind her own business. Prior to the 80s, most women only washed their hair once or twice a week. I had to wash mine more often due to very oily hair.  Now I wash it every other day. Works for me. BTW dandruff is from a fungal infection of the scalp.", "NTA I only wash my hair 1-2 times a week and have pretty healthy hair. Just can’t skip from washing every day to once a week. People have different hair types not sure what that is hard to understand.", "Nonsense! Unless you use a lot of styling products, hair spray or other stuff applied to your hair, you don't need to wash it more than weekly.\nYou're NTA.", "Unless you're wearing her hats or sleeping in her bed I don't get why she's so concerned with what you're doing. NTA. I also wash my hair once a week, I have dry everything (hair,skin,nails,humor). About once or twice a month I'll oil my scalp and let it sit for a few hours before showering too.", "NTA and she needs to mind her business. I wash my hair once a week. Always have. Frequent washing ie daily can strip your scalp of it's natural oils causing dry scalp and other hair issues. I won't go into ways to alleviate these issues as it sounds as you've got this under control or at the least a plan in place and advice from actual professionals. Don't let her issues cause you any.", "NTA. I wash my hair about every other week. Before, it got too dry and then quickly very oily. Now it's perfect for around 5 days, then it slowly becomes more oily. But even after two weeks, it's not more oily than some has it at the end of a day because their pil production level is extreme.\nI rinse with water around once a week. But I hate to dry it, so often I forget..", "NTA I spent 37 years washing my hair every day… I wash it every 3-4 days now & it’s so much healthier & overall glorious.", "NTA. \n\nTell your roommate you are following the advice of an professional regarding your hair and scalp hygiene. A lot of people can only wash once or twice a week to maintain their hair and scalp healthy. \n\nThere are also care products for extremely dry scalp, my son needed those as a child. His doctor recommended them. Maybe you should look those up.", "nta i have very dry and awful curly hair and i only wash it once a week. i dont have time to wash and straighten my hair every day.", "NTA but if you want to be an asshole..Do you have her email? I would start bombing her with information about why and how you figure out if your washing your hair too much. You could also start sending her info on water over use and if you have any water restrictions in your area. Just lay it on real thick. She will stop. Some people need to mind their own business.", "I ruined my hair after starting to wash it every other day, you're NTA, also it's none of her business even you wash it once a month, unless it smells or smth", "NTA. I have very oily hair naturally and am also prone to dandruff, thankfully my hair is lighter so you can't really tell. I only shampoo my hair once a week. I'll rinse it out every other day and scrub my scalp, but it only gets soap once a week.", "People give me the same kind of shit for not using soap on all of my body (only armpits, groin, and butt). I have severe eczema break outs when I use soap on any other body part. Just do whatever works for you and fuck random people’s opinion tbh", "NTA… I have dry hair.  Last hairdresser I went to was commenting on how healthy my hair was.  But she seemed weirded out that I only shampoo my hair maybe once or twice a month.  (I really do not need to shampoo often).  Why?  You just told me I have some of the healthiest hair you have ever seen?  I do condition my hair everyday though.  Some people do not have to wash their hair everyday.  Maybe your roommate has oilier hair, like my husband, who does have to shampoo daily.", "NTA, I have a routine where I wash my hair less than an an average person just like you. For me it works with my hair type and you should just do whatever works for you. Don't listen to your roommate telling you to wash it more than you would like do, just continue with a routine that makes you feel comfortable and healthy.", "NTA- apparently roomie doesn’t have friends of color with curly hair either", "NTA, just make sure you are washing your pillowcase at least once a week. Otherwise oils and bacteria can build up on it and cause terrible acne. I wash my hair once a week.", "INFO: Have you gone to a dermatologist? This might be beyond hairstylists' expertise and maybe there's a prescription shampoo/treatment that would work better.", "I'm a woman with short curly/kinky/wiry hair (I have all types!)  I only wash my hair once a week.  \n\nI used to have really bad dandruff.  The thing that worked for me was tea tree oil shampoo.  I swear it started working immediately.", "NTA but start wrapping your hair up with a towel when you leave the bathroom. Problem solved.", "NTA. But you can still rinse your hair, just dont use shampoo. I have a friend that stopped shampooing completely and after a week or so, he natural hair oils returned and he hair looks even more beautiful. Dont believe the marketing of the shampoo companies.", "Nta. I wash my hair once a week, sometimes once every 8 days when I'm busy. I wash my body daily. My hair doesn't smell (I use dry shampoo) and had been the healthiest it's ever been in my life. Many of my friends do the same. Everyone's hair/body is different, your roommate shouldn't be judging you based on what their needs are as your needs are different. Tell them to mind their business.", "NTA.  A lot of people are brainwashed over this.  You shouldn't strip all of the natural oils out of your hair and skin every day and call it \"clean\" and then try to put it back in with conditioner and moisturizer and then become confused that your hair and skin are messed up.", "NTA\n\nI only wash my hair once a week because it's fragile and breaks easy. Shampooing strips it. My hair has never looked healthier. There are plenty of beauty websites that recommend this. Ignore your roommate she's the gross one lol", "Yta ugh gross", "NTA\n\nI'm very similar. I wash mine about once a week. My hair comes to about my bra-strap in the back. \n\nI wash my scalp with shampoo and my \"ponytail\" with conditioner. I wish I had the fortitude to rinse with ice cold water, but I'm too much of a wimp for that. 😁", "Some people do need to wash their hair every day. There's not a one size fits all answer.", "I ride horses 5-6 days a week, and I DEFINITELY need to wash it after getting it sweaty and dirty underneath a helmet.  Not trying to criticize OP, but washing hair every day IS appropriate for some people - it doesn’t make us “gross.”", "Yeah, I completely stopped using shampoo and soap in the shower 3 years ago, my hair was a bit greasy for a couple months,  but after that I've had no issues.", "This is very cool and good to know. Thank you so much!", "My hair’s super thick too. Thank you for the tips!", ">However, it's also important to communicate with your roommate and find a balance. \n\n\nThe more I read this, the less sense it makes. Why does ANYONE need to communicate about their bloody hair with anyone else? \n\nTheir concern is fine and SHOULD END THERE. \n\n\n>The key here is open communication and mutual respect\n\n\nOver ANOTHER PERSON'S HAIR!!! \n\n\n>finding ways to accommodate both your needs\n\nWhat are these needs of her ROOMMATE over her hair??? \n\n>and her comfort can help resolve the situation amicably.\n\n\nResolve situation... \n\nI just can't", "I’ve been suggested tea tree for hydration which works well, thank you!", "It’s more that she’s almost always in the room if she’s not in class so she inevitably sees me come out of the shower and into the room", "Thanks!", "Yep, someone brought this up too. Thanks!", "I have not gone but had planned on going sooner or later because I have red itchiness on my abdomen and chest every time I shower and my elbows are patchy and itchy. The issue is my primary care doctor refuses to referrals with me (no idea if it’s just me or all of her patients) and would definitely not give me one to a dermatologist. For others who might not know, you in fact need a referral to see a specialist.", "Already replied to another comment that I rinse but dry it in the bathroom.", "NTA, do what works best for you. But if the dandruff is the only reason you’re doing this, an anti dandruff shampoo might help (assuming you haven’t tried that of course). Helped me, they were gone within 14 days.", "It’s really possible that your flaking scalp is because it’s too dry and you’re over washing. I have the same thing and dandruff shampoo and frequent washing just makes it worse.  I now wash once a week only shampooing once (no “and repeat”). My scalp no longer flakes or itches.   \nI also had freshman roommates who liked to comment on my hair washing schedule. It’s hard, but just ignore them. It’s none of their business anyway and I always felt it was a little odd that the cared so much.", "I wash my hair once a week. And even then, now with the weather getting colder I, once again get these shitty flakes. I'm really selfconsious about them. It helps to rub some Argan oil at my roots to hide them. So NTA, she is being a princess", "I used to do the cold water but only to rinse, hot to open up the pores then cold to seal everything in.", "Yeah if I’m going to the gym I’ll wash it right after lol", "I have a LOT of hair tips if you ever need it! 🩷 good luck", "Thank you lol", "Your primary sucks. Did they give you a diagnosis? I know some drs think they know everything but they don’t. Sounds a like like eczema. But I’m not a dr. You and/or your parents need to lean on this Dr to refer you out.", "What i have isn’t dandruff, it’s dry scalp flakes. They commonly get mixed up and mistaken for each other. Anti-dandruff on dry scalp actually makes it worse because anti-dandruff is meant to make your hair less oily as dandruff is caused by excessive oil, and if you put that on dry scalp it’s taking away even more of the oil that you need to keep your scalp moist. Thank you though.", "Yeah if it isn’t a smell-centered hygiene issue, I would INSIST she explain why she has a problem with it and how exactly it affects her. If her response is basically “ew gross,” she needs to MYOB while you sort your treatment out. Good luck OP!!", "It’s really non of your roommate’s business, but would just wetting it in the shower work for you - just to shut her up?  I get it if the water is enough to make it dry, so it might not work, but it was a thought I had.", "That whole pores thing is a myth, your body doesn't have the capability to open them up like that.", "I've got a hand- held sprayer in my shower now. Maybe it's time to try again!", "You asked what the roommate was doing - I was just offering a potential explanation because that's why I wash mine everyday! :)", "> That might be the hot water use, but it's Ireland, it's damp, cold & rainy & I'm not giving up hot water even for hair health!! XD\n\nI managed this by having the room warm instead. Turn on the radiator before getting in and shut doors and windows. Easier to have a non-lobster shower when you're getting out to a warm roam and toasty towel. \n\nI warm myself up a little too. Something small like a cup of tea or sweeping the floor before showering. Gets your temp up enough that you can turn the shower down a notch. Over a few months I went from needing a 10 to a 4/5 feeling comfortable.\n\nHelped my hair a lot but also my skin. Had no idea how dry my skin was (it always felt smooth) until I stopped blasting it with hot water. Another benefit is when you have an achy day and *really* need the hot water on your muscles, you can turn it up! Doesn't work as well if it's always on high to start with.\n\nRemember to open the window/turn the fan on when you're done though! Our cold, damp islands just love mould.", "Could it be serrisis? Completely wrong spelling but hopefully you can work it out from what I typed...try nizoral.", "I have the same issue and I only wash my hair once a week. I can go up to 2 weeeks in the winter and the hard water doesn't help either. I rub oil into my scalp the night before I wash my hair to help with the dryness and the peeling skin, especially in winter. \n\nI also wear a hair cover when sleeping and doing anything that might get my hair dirty. Your roommate is just ignorant.", "Just saying, I also don’t have “dandruff” but I do have dry flaky scalp as well. Dandruff shampoo still does wonders. Cant use any other shampoo. If you haven’t tried it might as well see.", "I used to have those same flakes, I ended up switching to sulfate-free shampoo and conditioner and it cleared right up! Not sure if that applies to your situation but if you use products with sulfates it's worth a shot.", "I had the same issue despite already only washing hair once a week—head & shoulders dry scalp care shampoo fixed it for me, so it may be worth a shot if you don’t already use a special shampoo", "While true that pores don't \"open\" from hot water, the heat does help remove excess oil, dirt, and grime trapped in your pores. I always assume that's what people mean when they talk about it \"opening up\" their pores.", "Our heating only works if we make a fire (On the back boiler & immersion system!), so funny enough the rainy cold days of winter it's more usual to have a warm bathroom in the evening. \n\nNow I do have hot water but not lobster hot (I remember my brother literally coming out pink, we worried he was scalding himself!), I did find out I had dry skin (assumed it was oily) & I have a lovely soft face oil for after showers that keeps my skin moisturised. Yeah about the damp, there's often a yell of did ye open the window/leave the door open after the shower! XD", "Ah psoriasis - my uncle has that and autoimmune disorders run in my family. It doesn’t look red or patchy like in pictures on Google but it’s a possibility.", "I’ve tried it, doesn’t really work for me", "I’ve tried head and shoulders. That’s more designed for actual dandruff and makes dry scalp worse.", "I'd buy that thinking if they didn't also say that they end it with cold water to close the pores.", "I think they're referring to seborrheic dermatitis. It definitely matches your description. Would highly recommend Nizoral and r/SebDerm", "Not head & shoulders dandruff shampoo. Head & shoulders “dry scalp care” shampoo. Different products", "Oh man looking at that on Google that’s a perfect match especially with some skin itchiness and redness I have. Thank you so much.", "Mine are a lot smaller than in some of the pictures though but I’m sure it’s just variance and Google showing the most dramatic examples. Sorry I keep replying lol.", "Concur on Nizoral.  I also tend towards scalp issues that aren't dandruff and it really works.\n\nThey also just came out with some kind of scalp exfoliating treatment.", "Ah. I assumed psoriasis because psoriasis actually can cause really bad itchy hair flakes and turn the skin red. This is interesting though, thanks.", "I'm glad someone more educated is able to explain what my brain fails to lol. Thank you.", "No no you're good! I'm glad you might have some answers! There's quite a few products out there for us like Nizoral, Selsun Blue, and MCT oil. I'm virtually symptom free now. Join usssssss r/SebDerm", "It doesn't really matter why or what it's called.  You're still showering, and this is what makes you more comfortable.  Your hair is, in fact, clean enough that your roommate didn't even notice it wasn't being washed daily until she saw you get out of the shower multiple times.\n\nThis would be a different issue if her concerns came after sitting next to or behind you.  This would be a different issue if get concerns came after finding bugs in your room.  That's not what happened.  She saw you do something different than what she does and decided to try to make you feel badly about it.", "Oh that's really cool. Have you tried MCT oil? I'm jealous of all the people that get amazing results. I have an allergy to the entire palm family 💀", "I would have thought that too, but I don't think Nizoral works for psoriasis. It specifically kills the yeast responsible for seb derm. (It looks like Nizoral also makes a psoriasis shampoo but it's got a special label and it's not their main product?) I'm crossing my fingers you have seb derm because it's WAY more easily treatable than psoriasis. I think you should get regular Nizoral off Amazon and see what happens. It shouldn't help *unless* you have seb derm, so that can narrow it down. Make sure you let it sit on your scalp for 10 minutes before rinsing it out.", "I wouldn't say educated - more like personally experienced via desperation. Also, tbh with you, I can't spell seborrheic dermatitis without autocorrect or copy/pasting from somewhere. I don't know why they have to name them all like this 💀 It's ridiculous.", "So OP’s hair issues sound a lot like what I’m also dealing with. Where can I buy these products?", "Oh I think we all agree that OP is NTA. I only think the type of scalp problem matters because different products can make a world of difference when it comes to comfort and self-confidence. Having an itchy scalp *SUCKS*.", "Topically? No, my hair is too fine for that. It's naturally dry, too, so it's a balancing act to find products that are moisturizing but not heavy!", "I’ll definitely try it, thank you!", "I buy my fiance the pink bottle of nizoral and he says he has the psoriasis (why do they make it so hard to spell)", "y t a \n\nyou aren’t a doctor, so how did you diagnose your skin condition \n\nyou have dandruff or an adjacent fungal skin infection. \n\nyou should be using selsum blue daily until it clears\n\nit’s not a “normal thing” for your scalp to flak, and it’s not flaming because it’s “dry” …\n\nyour hair is probably full of skin flakes which is why it smells like shit - get to a doctor ffs", "NTA at all, but wanted to offer a possible thing to try? I had something similar (and have very dark brown hair so like you, super noticeable) where I would get these almost scab-like flakes all over my scalp and of course it looks like dandruff. I was on a medicated shampoo from a dermatologist for about a year to first get it under control and after that I have able to self-contain it for the last \\~15 years with using T-gel shampoo (available at most major retailers, by Neutrogena). It contains coal tar and it helps treat dandruff, psoriasis and seborrheic dermatitis (the latter two of which are itchy scalp conditions). If you haven't seen a dermatologist yet I'd highly recommend they take a look and in the meantime try out T-gel (or another coal tar based shampoo) to see if it makes a difference. Be sure to read the instructions on the bottle too; you want to let it set! I also found using conditioner on my scalp made it worse so now I'm very careful to only condition mid-to-end. Best of luck with the hair and with the roommate!", "NTA at all. I have EXTREMELY damaged hair and a dry scalp (from.. you guessed it, overwashing), and even thinking about washing it more than once a week is enough to make my scalp itch. Also your roomate sounds borderline racist. MANY people of colour (and even those who arent, and just have curly hair) dont need to wash their hair as often because the sebum takes that much longer to travel down the hair, vs when its pin straight. I have wavy hair and that plus the dry scalp means i wash my hair every 2 weeks. And i promise you, within that first week my hair and scalp would be dry as straw (thankfully i oil it a little, not enough to make it greasy but enough so i dont feel like i have the end of a witches broom of my head). If your scalp is seriously dry like mine is, it wont be producing sebum at the same rate as others anyway. My scalp is still bone dry a few days later.", "I'm confused, why does your roommate think she gets to have a relevant opinion on your hair washing schedule?\n\nI would explain to her calmly and firmly that this could not possibly be any less of her business.\n\nNTA.", "NTA. She's too involved in your personal business and should mind her own. Unless your hair is causing odor in the dorm, which I sincerely doubt, she's just being judgemental. \n\nIf she brings it up again, I would just tell her that she's made her point, you're not going to change your habits and would appreciate if she keeps her thoughts to herself.", "100% NTA. Victorians considered regular hair washing to be once a month. Hair actually cleans itself it only stopped doing so because of 1930s commerial shampoos artifically wrecking up sebum production and now we have to continually wash it. The more you wash the more you have to wash. \n\nLook into co-washing and the no poo movement. Maybe leave her a few articles to read. What's important is what is best for you not your roommate if she has issues with it just her it's none of her business. \n\nI got alopecia and had to stop doing what other people did with their hair and really look after it. \n\nI'd recommend looking at shampoos that are SLS free. Use rosemary hair oil and get a boar bristle or bamboo brush.", "NTA nobody needs to wash their hair every single day", "boy would your roommate have issues with black people cause most of us dont wash our hair everyday either! its just not necessary. \n\nyour roommate is the asshole. she could have done a quick google search and see she’s proved wrong before being insulting. you didnt do anything to her", "I would try seeing a dermatologist. Sounds a lot like psoriasis", "I'm in exactly the same boat with dark hair and a very dry scalp (psoriasis runs in the family) and here's some really key info that should help.\n\n1) drinking water is really important. Like 2l a day minimum. Also make sure it's water and not just liquids. You'd be amazed how much this helps.\n\n2) there's a fungal issue that most people have on scalps, which exacerbates dry scalp real bad. Id get an anti-fungal shampoo to use once a week like Nizoral, and whilst it won't clear it, it should lessen the amount.\n\n3) I know your hairdresser said wash less, but it's important you clarify between washing and rinsing. You'll definitely need to rinse more than once a week, otherwise oils and dirt will build up and cause damage, but not necessarily wash more than once. You also shouldn't go cold turkey, but rather build up to washing once every other day, every three days and so on over a few weeks.\n\n4) baby shampoo is great for when you need to wash (gym etc). It's free of fragrances and is diluted normal shampoo, so is super gentle to your scalp.\n\n5) diet. Antioxidant rich fruit are also great at repairing the skin and scalp.\n\nObligatory NTA but make sure you look after your scalp properly.", "NTA. \n\nI get my hair professionally coloured every 8 weeks and my very knowledgable hair stylist recommends a once a week wash. It’s better for the hair, better for the scalp and literally causes no harm. I put it up 2 days before the wash if it’s a little greasy, but your hair gets used to it.", "NTA. I used to wash my hair once a week and it was fine. Now I do every 4ish days, sometimes longer. I did it to help my curls and not dry scalp, but it’s perfectly reasonable. Tell your roommate to mind her business.", "NTA. Different people require different hair care sometimes.\n\nI don't have a scalp condition but I do have very curly hair and I only wash my hair once or twice a week MAX. If I wash my hair any more than that it gets very dry and tangled and starts to resemble a pine straw bird's nest. \n\nJust keep repeating: \"My hair has different care needs than yours. I understand that you find that distressing but I will not be changing my hair care routines.\"", "NTA\n\nwashing your hair too often can be damaging to your hair. i personally wash my hair 2x a week and it's been just fine. if it works for your hair, then it works.", "NTA your roommate is the AH.", "She’s a weirdo who knows nothing about hair care. Once a week is fine. I do once a week and maybe two days of dry shampoo towards the end of the week", "NTA\n\nA few years ago, someone described my hair as \"curly\" (I'd never thought of it as such - and to that extent still don't) and a lightbulb went off in my head.\n\nI realized that maybe my hair is not \"unmanageable,\" it's *wavy.*  I'd kind of given up on it at some point (effort such as conditioner use felt wasted) and resigned myself to how it was, where within 30 seconds of putting a brush down it would look like I'd never heard of one.  It was healthy and not prone to split ends, so I figured whatever.\n\nWhen I started looking into whether I'd just been caring for it the wrong way even when I was still bothering, some of the most common advice I saw was that it should not be washed as frequently as I had been.  I used to wash it every day to every other day.  I got a shower cap, started consistently using conditioner, stopped dry brushing it, and washed it 2x a week.  These days I usually wash it 1x a week.  It's never looked better, and now it actually takes a *lot* longer than it used to to start looking/feeling a little greasy.\n\nI've found I do prefer that weekly shampoo.  But cowashing (conditioner-only) and then only shampooing much more rarely does work wonders for some people, too!\n\nSo long as your hair isn't getting dirty from outside sources such as a job, or very intense physical activity then once a week is perfectly fine for hair.  It's not \"gross\" at all.", "Yeah as another curly haired person, I just laughed at this post. Imagine doing a wash day every second day?! Yikes. It takes me like 5 hours just to dry my damn mop of hair.", "I wash my hair everyday. It’s a personal choice, doesn’t mean I do anything for it to be gross. It isn’t even that I need to, I just like how it feels it’s very relaxing for me and my hair is healthy and can handle it. Some peoples hair cannot stand everyday washes. But yeah OPs roommate is bonkers for being judgmental. NTA", "She might just have very porous hair. Porous hair can get greasy *quickly.* Mine is fairly porous and requires an every-other-day wash (it's in ideal condition on the second day but gets limp and greasy-looking on the third), and it's completely virgin. If she has color/heat-treated hair that already had high porosity to begin with, it might have made her hair more porous to the extent that she NEEDS to wash it every day. She might also have oily skin.\n\nBut yeah, still no excuse to judge OP's hair care routine because obviously OP's hair has different needs.", "1. I never diagnosed a skin condition\n2. I had multiple hairstylists tell me it’s not dandruff\n3. I never once said it was “normal”\n4. I never said my hair smells like shit. It doesn’t smell bad at all. \n\nDid you even read the story properly or any of the other comments?", "Also, to spin your own logic back on you, how did you determine I have a fungal skin infection if you’re not a doctor? Let me know if you are", "OP's hair does not affect her roommate. At all.", "I’ve used T gel before and actually got recommended another promising product in this comment section. Thank you!", "And if that sounds gross, then enjoy thin hair lmao. I used to wash my hair 2-3 times a week, and now have the hair density of my 50 year old mother :\") . VS my aunt who washed it every 2 weeks her whole life and has the hair of a princess lol", "I’d love to see one but my primary care doctor hates doing referrals and never gives them", "I also have long hair. At the end of my shower on wash days, I flip my head upside-down and rinse with cold water that way. It never hits my body but gives my hair a nice soaking.", "[you said OP so I’m assuming you meant me instead of the comment you’re replying to] I never once said it wasn’t appropriate for people to wash their hair daily. I just said this is what I do.", "I think you misread their comment. They said \n“What is she doing to her hair hair that she needs to wash it every day, or else is gross?” As in they’re asking why my roommate feels that washing your hair every day is the solution and everyone who doesn’t is gross. As in they’re asking why my roommate thinks that way.", "You 100% need to change primary doctors. What if you get sick???", "You're very welcome!\n\nAlso I saw your other comments about how your primary care doctor won't give you referrals to specialists, despite your family history of autoimmune disorders. Your PCP might just really suck, or you might be experiencing medical sexism in *addition* to your doctor really sucking. It's a lot harder for women to get care for various reasons, but one reason is the perception that we're \"exaggerating\" or don't know our own bodies. It's latent within the entire health care industry, including even among doctors who are women themselves.\n\nAs a woman with chronic health ailments myself, it's an unfortunate fact that sometimes we need to doctor-shop just to find someone who's willing to take us seriously. The right doctor can make a HUGE difference to your life, and you deserve adequate health care and you deserve not to be dismissed. So I think it's really important for you to seek out a new PCP. With a family history of autoimmune disorders and obvious physical symptoms, even the shittiest doctor should be sending you to a specialist.", "I have a really sensitive scalp and the brand Raw Sugar makes affordable scalp products that saved me from a constant cycle of flakes and itching.  I started with the pure scalp therapy hair masque (white bottle) and now I have their tea tree shampoo and conditioner in my rotation.  I only wash my hair every 5-7 days.  NTA", "You can usually buy applications sans prescription, it's probably got a different name but I've used both elocon and betnovate scalp lotions to AMAZING effect, talking like totally gone from 2 applications. Psoriasis is basically when the skin doesn't know when to stop growing so it just keeps growing and flaking off the surface to keep it right thickness, the creams/applications prevent the growth of the skin cells", "The idea of washing your hair every day or every other day is outdated - it doesn't work for an awful lot of people. The shortest time I go is once a week, it's often 10 days or so. Even when swimming in the sea regularly in summer I'll rinse with plain water then condition. Mind you, I get dry skin all over and use a shower oil instead of a gel - I'm itching within minutes from the dryness if I use a gel.", "Nope, I mean to reply to the other poster - I take issue with their stance of “you must be gross if you need to wash it every day.”  I was just trying to clarify that I wasn’t trying to suggest YOU were gross because you don’t.  Sorry if my meaning wasn’t clear.  I think your reasons for not washing it every day are completely valid.", "No diagnosis yet but eczema makes sense. Others suggested my scalp might be psoriasis which my uncle has and autoimmune disorders run in my family so it would make sense if it were to be psoriasis.", "I literally had blood in my stool at one point and she still wouldn’t let me see a gastroenterologist (found a way around it through urgent care). I’ll switch as soon as I’m able to.", "Thank you so much. I’m going to be looking for a new one asap, I’m just in a difficult position with being at college right now. Luckily I’ve already signed a lease for an apartment here next year so I can find one nearby hopefully. If it were more of emergency I’d definitely go to urgent care again but I do think it’d be a waste of an urgent care bill (my health insurance deductible is terrible lol). Thank you so much for this again.", "Oh, the soft water - I grew up in a hard water area and have long hair. The first time I washed my hair in a softwater area I ended up with about a foot of foam on top of my head! I now live in a soft water area, and when I visit my mum I have to remember to use a lot more shampoo than I'm used to.", "I think you misread their comment. They said \n“What is she doing to her hair hair that she needs to wash it every day, or else is gross?” As in they’re asking why my roommate feels that washing your hair every day is the solution and everyone who doesn’t is gross. As in they’re asking why my roommate thinks that way.", "Which is why you need to lean on this primary to give you a referral. There are probably varying levels of psoriasis and eczema that a derm would much better diagnose than a primary.", "You're welcome! Hopefully you're able to find good care soon, then. Good doctors ARE out there, and it gets so much better and easier once you find one!", "Ahhh that takes me back. We had a pot over the fire tipped into the bath when small. The day we upgraded to a back burner was like heaven. Then I moved for university and discovered civilisation and the combi boiler. \n\nThey don't make back boilers any more, my parents were unimpressed when theirs died. Couldn't get parts and no-one would replace it. The engineer won my mother round to a combi by saying she could have hot water *without mucky coal in the house*. We bought her a cream carpet that Christmas lol. The fire is ceremonial these days, still lovely in the winter. \n\nI shower in the evenings quite a lot in the winter. Then I can wake up, tuck my morning clothing under the warm duvet and get dressed before getting out of bed. I have a good combi but old habits die hard...still too stingy to put the heat on in the morning!", "Wales here, I feel your pain with the damp and the cold. Went through a winter without a functioning boiler once, and got so cold in the shower....", "Nizoral is the best! I suffer from seborrheic dermatitis and use it when I wash (twice a week). I also suffer from eczema and my dermatologist told me to use Nizoral as a body wash if I am out of my medicated stuff during a flare up on my skin. Expensive, but worth it.", "Oh huh haven’t heard of that one. Thanks!", "My mom uses  ketoconazole shampoo. My cousin uses coal tar shampoo. Both work well.\n\nBut strong ketoconazole is prescription only, and coal tar STINKS, so see a dermatologist.", "Seconding ketoconozale! Worth the rx and it’s been a lifesaver for me! Same issue as you - itchy flaky scalp.", "You can also get medicated shampoo from your doctor. It’s life-changing and it will make the itching stop. If your hair looks greasy between washes, you can lightly powder it with cornstarch.", "Np! Can’t guarantee it’ll work for you, but it does great with my hair. Best of luck with the annoying roommate situation too"]}