{"id": 29557, "submission_id": "17f98sp", "title": "AITA for refusing to pay my roommate’s medical bills after she fell off my raised garden bed?", "selftext": "Edit: some of this is me defending myself which is against the rules but I’m aware of that now.\n\nOriginal: I (21F) live in a house with 4 other girls. This spring in May, I found some of those thick security glass blocks on FBMP and used them to form a raised garden bed in the backyard. \n\nFast forward to July. New girls are moving into the unit below us (we live in a duplex). According to one of my roommates, we will call her Jane (20F), when the landlord came to check up on the property around the time of the new girls’ move in, the landlord told Jane that the garden bed I made should be taken down and she gave Jane a verbal warning. As of right now, I don’t know if there were any other witnesses to that interaction. But I do know that I did not receive an email warning about the garden bed, we did not get a group email or text either about it. So when Jane told me “the landlord says you can’t have that garden bed and gave us a warning” I’m like “oh that’s dumb. If we get a fine, I’ll take care of it, but until the landlord gives us a written warning or a fine, I’m leaving it up.” Me and Jane agreed that it’s dumb that I supposedly can’t have it.\n\nFast forward to September. While I’m out of town, Jane hosts a party. During the party, Jane (drunk, not sure if that affects the legality of this) stands on the garden bed, falls off, and gets a cut on her leg. She goes to the ER and gets stitches.\n\nIn the following weeks she tells me how much it got in the way during the crowded backyard party and that it was a hazard. And I mean, yes. Having something that is just over ankle height on the ground while a bunch of drunk 20 year olds are dancing around it is bound to cause some falls. But how could I have considered that scenario before I made my herb garden??\n\nHer insurance is not covering the cost of her ER visit and now that she’s gotten the medical bills, her parents want me to pay up since it was my garden bed.\n\nEdit: I want to add that I learned her parents want me to pay via another roommate that Jane confided in. Jane nor her parents have not actually come to me personally asking for money yet. Other roommate told me to warn me.\n\nContinuing: One might say I should pay her bills because 1. I didn’t ask everyone in the house if they were okay with me having the garden bed (and why would I? I live here and the thing is three feet wide. Sorry I wasn’t considering how it would interfere with the parties we’re not supposed to have) and 2. Because I didn’t take it down after we got the warning (which there is no written proof of).\n\nAnd I read the lease today and didn’t find anything suggesting I couldn’t have a garden bed. We literally have a fire pit which is against the lease. We use it all the time. If one of us were drunk and fell on the fire pit, would there be the same attitude? Or if Jane fell onto some other object that was mine. Am I at fault just because that object belongs to me?\n\nAt the end of the day she was drunk (illegal since she is 20), hosting a party in our yard (against the lease), and got hurt falling off of something that, as far as I can tell and lack proof saying otherwise, am allowed to have.\n\nAm I wrong for not removing it as soon as Jane expressed that it is a hazard? Am I wrong for planning on saying no if she asks for money? Am I wrong for not removing it after this verbal warning from the landlord that I wasn’t present for and don’t have proof of?", "created_utc": 1698141973, "permalink": "/r/AmItheAsshole/comments/17f98sp/aita_for_refusing_to_pay_my_roommates_medical/", "score": 115, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I fear I may be the asshole because, after Jane got hurt on the garden bed, I did not remove it. She brought up many times how it is a hazard during parties. And I thought “okay but why should I have to remove it so that YOU can have parties?” Even though she didn’t explicitly command me to remove it until recently (because there is another outdoor party coming up, and I have since removed it) I fear I may be the asshole for not immediately taking the garden bed down after she got hurt falling off of it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYou don't owe her a dime.  Even if this were a legitimate claim, she's just as negligent.  She was fully aware of it's existence and location and she was drunk. Those two things make it her own fault.  Tell her parents that next time they try to get you to pay.", "NTA\n\nYou said Jane had AGREED with you that it was stupid that the landlord had 'supposedly' said the raised bed was not allowed.\n\nSounds like Jane was ok with it until it became inconvenient for her. Stick to your guns OP... It's not YOUR fault that Jane was irresponsible and this is 100% NOT on you.\n\nI would have ignored it without some kind of official notice either. If it was that important to your landlord, they would have emailed or called or contacted you. If they landlord had called you personally though, I would have taken that seriously even if it wasn't in writing. But they didn't call you or say anything else about it.\n\nI would assume that if the landlord really cared, or had really done this, they might have followed up the verbal warning to your friend with an email or something attempting to contact YOU if your roommate had told them it was your raised bed? Strange that they didn't", "NTA - Jane was drunk and fell. She’s responsible. End of story. BTW - This sounds like you’re being scammed. Why wouldn’t Jane’s insurance cover her hospital visit? The only time that’s happened to me is when my ER visit wasn’t considered a true emergency.", "NTA. The existence of the garden bed isn’t the issue - she **knew** it was there and **deliberately** stood on it before falling off. Intoxicated or not, she made the choices and took the actions that led to injury of her own freewill.", "NTA. \n\nShe was drunk, did something dumb, and injured herself. If she has climbed on your car while drunk and fallen off it, would she be trying to claim from you? \n\nJane needs to learn to take some personal responsibility for her actions.\n\nPS I bet the landlord didn't ever say a thing about the herb garden.", "No, absolutely do not pay her anything. If she wants she can sue the landlord bc it would covered under his homeowners, which they probably could argue bc she wasn’t supposed to be there drunk anyway - but homeowners will prob end up paying. I dont know, but I know it’s not your problem. It’s even better if your landlord told your other Roommate to move it, bc it shows he knew it was there, he knew it was a hazard and he never followed up on it or said anything to you. He could have removed it himself also. Now mind you, you don’t have to do anything- just bc someone says you have to pay for something, doesn’t mean you do. She would have to sue you- that would be a stupid case, no lawyer would be bothered, but gather all the pictures and videos you can from that night from your friends or social media that show her looking drunk. Nobody owes money to a drunk that fell bc they were drunk. Did she damage the flower bed? You can counter sue for damages-lol", "I'd talk to a lawyer. If the bed represented a tripping hazard, normally it would be the landlord's insurance that would have to pay. But as the landlord had instructed you to remove the bed, you very well could be found liable in court.\n\nThis isn't really an AITA question as much as you should get legal advice as to what you should do next.", "NTA, why she standing on your garden illegally intoxicated? She is an adult, she knew what she was doing. That’s what she gets.", "NTA. I dont believe you should pay. It was her fault she fell.\nHOWEVER, yes, you should ask every person who lives in the house if you can put something in the communal areas! Its common scense.", "NTA. The person responsible for falling off a thing while drunk is the person who got on the thing while drunk. Unless there was some particular negligence on your part that caused the fall, then I don't see what her claim is. As if she climbed on top of a picnic table while drunk and then fell or even if she just tripped over her own feet.", "NTA\n\nTell her parents that if Jane drinks illegally again you'll have to report her to the correct authority. Also ask for something in writing which states the garden bed isn't allowed. \n\nIf she was out on the street and slipped off the curb drunk would she expect the council to pay her medical bill, I don't think so.", "NTA if you haven't gotten a written warning ( this isn't legal advice ) I guess you don't need to remove it.\n\nAnd if Jane didn't express it was a safety concern beforehand, it is her own fault.\n\nAlso you say she fell off and not on? So she climbed it and fell? Then it is completely her fault.", "Feel like this should be in the legal advice sub", "it is only a hazard for drunk people. and for drunk people even a door frame is a hazard. ask your landlord whats what. and i dont think you are legally in a bind. NTA", "NTA, she was having a party she shouldn’t have had? (Lease or why no parties, this doesn’t sound right) and stood on something she shouldn’t have stood on.", "ESH\n\nIgnoring the warning because it wasn’t in writing was negligent. \n\nAt the end of the day though your friend’s medical costs are her own and it’s out of line to try and pass them to you", "YTA. Not because of the hospital bills but because everything seems to be hearsay and you don't even bother clarifying. This whole post is because you heard from someone that Jane wants you to pay up but somehow you don't even check if that's true before coming here and wasting everyone's time.\n\nWe are supposed to pass judgement on Jane for something you heard from some other room mate.", "Soft YTA, you were in some way warned but like a child said \"not until there are consequences!\". You also say she agreed with you about not taking it down, but im guessing it was more an agree to shut you up than an actual agreement. I don't think they have a foot to stand on legally, but that doesn't mean you're right in this. Like sure you don't have to pay, but at the very least learn from the experience.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (21F) live in a house with 4 other girls. This spring in May, I found some of those thick security glass blocks on FBMP and used them to form a raised garden bed in the backyard. \n\nFast forward to July. New girls are moving into the unit below us (we live in a duplex). According to one of my roommates, we will call her Jane (20F), when the landlord came to check up on the property around the time of the new girls’ move in, the landlord told Jane that the garden bed I made should be taken down and she gave Jane a verbal warning. As of right now, I don’t know if there were any other witnesses to that interaction. But I do know that I did not receive an email warning about the garden bed, we did not get a group email or text either about it. So when Jane told me “the landlord says you can’t have that garden bed and gave us a warning” I’m like “oh that’s dumb. If we get a fine, I’ll take care of it, but until the landlord gives us a written warning or a fine, I’m leaving it up.” Me and Jane agreed that it’s dumb that I supposedly can’t have it.\n\nFast forward to September. While I’m out of town, Jane hosts a party. During the party, Jane (drunk, not sure if that affects the legality of this) stands on the garden bed, falls off, and gets a cut on her leg. She goes to the ER and gets stitches.\n\nIn the following weeks she tells me how much it got in the way during the crowded backyard party and that it was a hazard. And I mean, yes. Having something that is just over ankle height on the ground while a bunch of drunk 20 year olds are dancing around it is bound to cause some falls. But how could I have considered that scenario before I made my herb garden??\n\nHer insurance is not covering the cost of her ER visit and now that she’s gotten the medical bills, her parents want me to pay up since it was my garden bed.\n\nI’ve been told I should pay her bills because 1. I didn’t ask everyone in the house if they were okay with me having the garden bed (and why would I? I live here and the thing is three feet wide. Sorry I wasn’t considering how it would interfere with the parties we’re not supposed to have) and 2. Because I didn’t take it down after we got the warning (which there is no written proof of).\n\nAnd I read the lease today and didn’t find anything suggesting I couldn’t have a garden bed. We literally have a fire pit which is against the lease. We use it all the time. If one of us were drunk and fell on the fire pit, would there be the same attitude? Or if Jane fell onto some other object that was mine. Am I at fault just because that object belongs to me?\n\nAt the end of the day she was drunk (illegal since she is 20), hosting a party in our yard (against the lease), and got hurt falling off of something that, as far as I can tell and lack proof saying otherwise, am allowed to have.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, tell Jane that it's a skill issue on her part.", "NTA. She got drunk and fell off. That’s on her.", "NTA. Jane doesn’t want to take responsibility for her own careless actions.", "NTA. You don't owe her a dime. She made the choice to get drunk. She made the choice to dance on top of the raised bed. She fell. None of that is on you.", "NTA. It wasn't a random person who got injured. Jane knew the garden bed was there and climbed it whilst drunk. That was her decision. She could have stood on a chair, the result would probably be the same or worse, as it's higher. If you really feel bad and want to do something, maybe offer to pay half, but no more than that. It was her silliness after all. But I don't think you have to pay anything if you don't want to. Just out of curiosity, did any of your roommates used the herb garden as well?", "NTA. Would her parents want you to pay her medical bill if she'd fallen off a raised deck or a picnic table? She was acting a fool standing on something she shouldn't have, and she fell and got hurt. I fail to see how her injury has anything to do with your raised garden.", "NTA and Jane should be going after whoever has homeowners insurance where you live.  That’s an accident on the property in which you don’t own so whoever owns the property is responsible for that fall. \n\nThe landlord should have sent you something in writing to remove those blocks if it was such a hazard. Therefore if the landlord didn’t follow proper procedure on their own property then that’s on them. Just like knowing it’s illegal to have a fire pit on your lease and you all are sitting there getting drunk all the time (that’s a bigger hazard in my opinion).", "NTA \n\nI would bet money that the landlord didn't ask to remove the bed (and this is why you haven't got a written warning). Why would you tell a new tenant to remove something another tenant has installed ?\n\nI would bet she was planning on a garden party or didnt like it for some reason and tried to get rid of it by pretending the landlord asked. When that didn't work she got annoyed and \"fell\" off the bed in hopes you would remove it and give her some cash.\n\nHave you even seen the injury? The stitches? Or the bill from the hospital??", "NTA.\n\nI believe the landlord's objection was that you altered their landscaping, not that you created a hazard.  Your modifications to the property should be limited to things that can be easily moved and don't kill the grass.\n\nEven if the landlord wanted it removed because it was a tripping hazard, Jane didn't trip over it.  She was standing on it and fell down.  Standing on it means she knew it was there.  She fell off because she was drunk, not because of the blocks.", "NTA\n\nYou are not responsible in any way for what someone else in their drunken stupor does.", "NTA. Her drunken mishaps is in no way your fault", "NTA", "NTA, but legally you might be screwed. Check your rental agreement. If she sues the landlord and the landlord sues you and there is a provision in your rental agreement you might be on the hook.", "Don’t forget that Jane actually stood on the garden bed. Those three things make it her own fault.", "I agree. And typically a warning is followed by a fine of the issue isn’t dealt with. I made it known to Jane and my roommates that I would pay whatever fine came my way, but a fine never came.", "I also was wondering why her insurance didn’t cover it. You’d think if you go in with a cut and need stitches, insurance would cover it even if it was an accident. Could it be because she was intoxicated?", "Maybe she told her parents and the ER a different story as to how she got hurt. That's why she hasn't approached OP yet to ask for the money.", "It's possible they are asking for information about the accident before they pay.  Many/most medical insurance plans have special procedures for when you are injured and some other party pays for your medical bills (think: you sue someone and get money).  To determine if these procedures kick in, they need more information, and sometimes withhold paying the bills until you provide it.\n\nI could see Jane's insurance requesting more info and Jane not giving it because she thinks she can get OP to pay, and the insurance therefore doesn't pay either.  From an outside perspective \"the insurance didn't cover it\" but the insurance fully *would* if Jane would cooperate.\n\nNot saying this is what happened, but I used to work in insurance paying claims, and this is how people interpreted the situation 9 times out of 10.", "I doubt the bill is even as much as the deductible on the home owners insurance. Also being drunk isn't going to help the injured person's claim at all. Jane is an idiot and so are her parents.", "There was no real damage to the garden bed LOL. It’s just blocks in a circle to hold the dirt in. A block falls down, I stand it back up. But I actually took it down today because I told her I would remove it before the next party and we’re having a Halloween party soon. It’s fall now and I’m not growing anything in it anymore this year anyway. And this whole situation came to a head today where Jane was really anxious and overwhelmed thinking about the medical bills and that her parents were talking to her making her anxiety about it worse. So that made me feel bad. And I think she’s upset that I never apologized and that I didn’t take it down as soon as she expressed her concerns about it being a hazard.", "If it's a rental that caters to college kids, which it sounds like, and possibly goes though the college for off campus housing, rules limiting parties and even gathering sizes are pretty normal due to liability, underage drinking being just one of them, and to protect the home.", "Disagree, if it was really that important to they landlord, they would have issued a warning in writing, AND even if they had, if it wasn't against the terms of the lease, they have no leg to stand on.\n\nI would ignore anything without a written warning in cases like this too. Or at the very LEAST, the landlord could have called OP or contacted OP personally if this was really such a big deal to them.", "It’s not “Not until there are consequences” it’s “not until the landlord tells me directly or the landlord gives us (and I do mean US, whether it be me hearing a verbal warning with my own ears or until we get an email/text).\n\nAlso when Jane told me the landlord warned her, this was before she got and she really didn’t seem any kind of way about it. After I was like “that’s dumb that I’m not allowed to have a garden bed” she was like yeah that is dumb and we talked about how we have made the yard so much better than it was when we moved in (it was disgusting and covered with litter when we moved in). She seriously do not seem like she wanted it removed at that point so I don’t think it was to shut me up.", "No one else used it, just me.", "It depends on her plan. She may have a high deductible or high cost sharing.", "Maybe Jane and her parents want you to pay for their out of pocket expense, whatever insurance did not cover.  But either way, it’s not your responsibility. \n\nI suspect that Jane and her parents are trying to scam you. They are not asking the landlord to pay, I mean, it is on the landlord’s property after all. But they are not. And I suspect it is because they know Jane broke several rules here. Also, they probably figured that you are younger, less experienced, and likely more easily intimidated. \n\nI wouldn’t give these people a penny.", "yup", "That’s right.", "Never apologize; do not admit fault in any way for her own clumsiness/stupidity. Could have just as easily been a coffee table in the living she tripped over, or a chair in the kitchen.", "So it was a bunch of stacked cinder blocks? That's an absolute hazard. Depending on what your lease states, you might legally be screwed, warning or not, pray to the gods that she doesn't sue the landlord for damages.", "Exactly, and for all OP knows the roommate may have wanted it gone and just told her the landlord said so hoping she would remove it. With no direct communication from the landlord im saying NTA.", "Hopefully you listen to the last line of that response, as it’s the only real takeaway. Learn from this so now you know not to let drunk 20 year olds around your garden bed. Next.", "Or she could have one of those Christian medical sharing plans. Those are negated due to certain activities, alcohol being one of them."]}