{"id": 29614, "submission_id": "17ftf7z", "title": "AITA for yelling at my husband for telling our friends my job status?", "selftext": "I (35f) have been married to by husband (37m) for 10 years. In that time I have been mostly working in an online job due to various health issues. I had a transplant some time ago, I have fibromyalgia, and a few other issues. \nRecently, I lost my health insurance and I started looking for new work. It was just too expensive for private healthcare and the meds to just stay where I was. Recently, I was offered a job pending a physical and a TB test. I filled out all my forms, got my physical, and am waiting for the results of my TB test (which will be read tomorrow). \nI didn’t want to tell a lot of people about the offer. I know the job can take the offer off the table if they think my physical is too many issues. I told three people total - my husband, my mom, and my best friend. \nMy mom quickly told a bunch of people. I asked her to stop and explained that I want to wait until they accept my physical to announce anything. My husband told me today that he told his parents in a call without me. I told him, calmly, that it bothered me. That I was waiting to tell people because of the physical issue and that when/if it went well I wanted to tell people. He apologized and we moved on. \n\nFast forward to tonight. He holds an online game that I play in. I bowed out tonight because I have just been stressed about everything, which he said was fine. When game was over he came down and told me that he told our friends about the job offer. I was livid. I asked why he did that. He said he didn’t think it was a big deal and just told them we were waiting for everything to come through. \nThis is where I may be the AH. I yelled. I actively yelled. I reminded him that I told him earlier that I didn’t want anyone to know until it was absolutely final. That I was concerned about my physical. And that I just wanted to wait. I asked him why he would do this. He just apologized, but I didn’t want to hear it at that point. I asked him to just leave me alone the rest of the night. \nAITA?\n\nEdit: I didn’t clarify. I actively told all three that I wanted to wait until I had the physical results to tell everyone that the job was 100% secure. As of now I have received an offer - which I accepted - but the physical hasn’t been accepted. ", "created_utc": 1698197873, "permalink": "/r/AmItheAsshole/comments/17ftf7z/aita_for_yelling_at_my_husband_for_telling_our/", "score": 62, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action - my yelling. Why I may be the asshole - I don’t know if the action he took warranted my yelling at him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I think NTA. Your yelling was probably counter-productive but your anger was justified.  You told him not to tell people, he did, you again told him not to and he did it again.\n\nIf he routinely ignores your wishes and does things you’ve asked him not to do (assuming your request is reasonable) then you should be very concerned.  If this isn’t typical behavior on his part, then maybe tell him that this made you not trust him and that in the future you may withhold info from him that he needs to know, because he can’t seem to keep his mouth shut.", "Nta- it was a simple request- do not spread my job situation.  He violated it.   Acknowledged YOUR LEGITIMATE REQUEST, said sorry; TURN AROUND AND DID IT AGAIN!!!! Like wtf?!?!?  This was make me angry for several reasons- he obviously lied when apologizing.  \nHe didn't respect you enough to think YOU SPECIFICALLY SAYING DO NOT do this was \"a big deal\"\nBig hugs\nSending you blessings", "NTA. You told him don’t tell anyone, he told his parents anyways. You talked about it, he apologized. How could he possibly think it was ok to tell his friends?", "NTA\n\nYou were so, so clear - and yet he told his friends. Sometimes people need a virtual slap in the face. Yelling isn't OK, and I'd probably feel differently if the genders were reversed.\n\nBut his actions were complete bullshit and disrespectful.", "NTA, but, and I don't mean to be disrespectful here, I genuinely don't see how it's such a big deal whether or not people know that you may have a job sometime in the near future, pending a clear physical exam. Even if you don't get the job, that doesn't reflect negatively on you, it just means you're one of several million qualified people on this planet who didn't get a job because of a bullshit reason. \n\nLike I said, you're NTA because, though I don't understand your reasoning, the fact of the matter is that it _was_ important to _you_ and your husband neglected to understand and respect that. I _do_ think, though, that if you're in a similar position in the future and it doesn't seem like he's understanding how much whatever it is means to you, then please just sit down and explain it to him. Speaking from experience, men can be _dense_ and won't always be able to pick up on how you're feeling unless you tell them.", "NTA - It was fine for him to tell his parents, but after when you made it clear to your husband that you didn't want him to go around spreading the news... he did it again anyway. Even if he's excited for you, that's no excuse to do the thing you told him already not to do. That's disrespectful. \n\nThat said, he did apologize. Don't hold a big grudge unless he does it a 3rd time.", "Asking someone to keep a secret and them continually, repeatedly, ignoring it and then acting like it’s not a big deal is messed up. This happens to me with my family all the time- and now I have to edit everything I tell them, and consider it it’s worth it in every conversations. Ask him if he wants that to be how your communication is in the future- that you have to worry about discussing stressful things with him because he can’t be trusted to respect your privacy? NAH do not listen to these people- maybe yelling was harsh but when your life parter repeatedly ignores your specific requests repeatedly what else are you supposed to do?", "NTA. People disrespecting boundaries in general is straight up disrespect. Your mother has no excuse, and your husband still shouldn’t have said it, ADHD aside, and then further try to sneak out if it by trying to justify it. \n\nIt’s medical news, it’s your news alone and even telling tonnes of people about job offers in specific cases can cause some companies to contemplate how well you could keep private information secure. It’s not your fault directly but it could impact you if it they ran a background check.", "ESH: Him for doing something you specifically asked him not to. And you for yelling at him.\n\nDoubt you never did anything he didn't like, would you be ok if after doong something wrong he yelled at you?", "NTA- you told all 3 people originally not to spread this information. Your mother told people, you told her a second time to knock it off. She did.\n\nYour husband told people. You told him a second time to knock it off, he didn't. You even told him a third time when you yelled and all he could do was apologize even though you gave valid justification as to why you waited. And he didn't even tell them it was an offer, he made it seem, from what you wrote, that you got the offer and are just waiting on paperwork. When in reality, that's not the case, and if it doesn't go through you have a shitton of people asking questions that was none of their business to begin with.", "INFO: Did your mother tell more people than your husband? It seems frivolous, but you are somewhat drawing lines here, so I wanted to know if it was the time, people, quantity, or combination that made your husband the AH but not your mother.\n\nI can see that the husband told 2 people, his parents, and your close friends after you spoke with him. Fair. But if your mom blasted it to 100 people, but just once woukd that be more ok? Sounds exhausting for everyone who is just trying to be happy for you.", "NAH\n\n> I asked him why he would do this.\n\nWhy do kids want to open their Christmas presents a day early?\n\nBecause he's excited for you.", "Not sure there is enough info to decide. I wouldn’t say you were the a hole if you had faced the disappointment of losing a job before due to the result of a physical and then had to suffer the disappointment over and over again bc you told people about your new job and for months you had people constantly asking how your new job was.  That is if husband was there to see the effects of that on you.", "So did you get the job sorry too soon?", "YTA. Your husband has been spending his life with someone who is chronically ill. Obviously that’s his choice but having a partner with health issues like that takes a toll on someone. He’s probably stressed as hell, especially with you needing to find new work. He deserves to vent about his situation", "[deleted]", "YTA\n\nGet a grip.", "YTA. If you wanted to wait for the results then why tell anyone? But since you did tell people, you should’ve told them right from the beginning not to say anything to anyone until it’s confirmed that you have the job. So I’d say majority of this is on you, because it could’ve been avoided if you’d just waited for the results. Although, they did say things to people, even after you asked them not to. Which leads back to my original question, if you didn’t want people knowing until you got the results in, then why bother saying anything? Now you’re mad for something that could’ve been avoided.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (35f) have been married to by husband (37m) for 10 years. In that time I have been mostly working in an online job due to various health issues. I had a transplant some time ago, I have fibromyalgia, and a few other issues. \nRecently, I lost my health insurance and I started looking for new work. It was just too expensive for private healthcare and the meds to just stay where I was. Recently, I was offered a job pending a physical and a TB test. I filled out all my forms, got my physical, and am waiting for the results of my TB test (which will be read tomorrow). \nI didn’t want to tell a lot of people about the offer. I know the job can take the offer off the table if they think my physical is too many issues. I told three people total - my husband, my mom, and my best friend. \nMy mom quickly told a bunch of people. I asked her to stop and explained that I want to wait until they accept my physical to announce anything. My husband told me today that he told his parents in a call without me. I told him, calmly, that it bothered me. That I was waiting to tell people because of the physical issue and that when/if it went well I wanted to tell people. He apologized and we moved on. \n\nFast forward to tonight. He holds an online game that I play in. I bowed out tonight because I have just been stressed about everything, which he said was fine. When game was over he came down and told me that he told our friends about the job offer. I was livid. I asked why he did that. He said he didn’t think it was a big deal and just told them we were waiting for everything to come through. \nThis is where I may be the AH. I yelled. I actively yelled. I reminded him that I told him earlier that I didn’t want anyone to know until it was absolutely final. That I was concerned about my physical. And that I just wanted to wait. I asked him why he would do this. He just apologized, but I didn’t want to hear it at that point. I asked him to just leave me alone the rest of the night. \nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I'm gonna go with NTA simply because there's this thing called 'invoking Murphy.'  \n\nHe's hell when you call him up and he actually bangs on the door.", "What does that mean you accepted their offer(Congratulations!!!!!!) but the physical wasn’t accepted?? Don’t understand that part does that mean they don’t offer you medical??", "Agree. Op was clear with both of them and had rational reasons, they did it anyway, she told them both that she was upset and they behaved inappropriately, then he did it again and says he didn’t think it was a big deal.\nI’m infuriated for OP (even though I personally wouldn’t care about telling others). He did know it was a big deal to her and decided he knew better.", "He just needed to wait one day for the results to come back! I really hope everything works out for OP, but if it doesn’t, he personally needs to contact everyone to explain so that she doesn’t have to.", "Yes and no. It would honestly depend on if we had a conversation beforehand.", "My mom told my sister, my uncle, and my aunt. My husband told his parents and 3 of our friends. \n\nI am genuinely glad people are happy for me. It’s wonderful. I am so grateful. I just don’t want to disappoint them if the employer doesn’t think I can handle it.", "Thank you. That’s a really good answer. I am genuinely happy he is excited for me. I know my anxiety is playing into the hesitation.", "I have lost a job before due to physical issues from my transplant. Especially during Covid. I am actively upfront and tell any interview about my physical ailments.", "So, for this job, I actively got an offer. I filled out all the forms needed. Then they asked for a physical and a TB test. I found out they can take back the offer if they think my physical ailments are enough to prevent me from doing the job.", "I actively asked him about this life. We started dating two months after my transplant. We talked about the life we would have. But, thanks for telling me that.", "I didn’t feel comfortable keeping it from my husband since it affects our finances.", "Can you please elaborate?", "I did. I actively told all three to wait until I had my ID to talk to people.", "> My husband told me today that he told his parents in a call without me. I told him, calmly, that it bothered me. That I was waiting to tell people because of the physical issue and that when/if it went well I wanted to tell people. He apologized and we moved on.\n\nHe told his gaming buddies after this calm and polite conversation.", "That sounds like a problem you should talk to someone about.  Because you shouldn't think that someone who loves you is allowed to disrespect you if they do something you don't like.  \n\nThat's why you think it's ok to yell at him because you believe that's how you express your feelings . Just know a lot of the times it doesn't end with yelling", "I don't think you will be disappointing your family and close friends by not getting a job. You have been through a lot and appear to have a good support network. You're kind of baiting them to be excited for you and then punishing them for it. Soft YTA.", "And I think this right here is why your the AH for getting so mad and yelling because he was so excited for you. Did he mess up, yes but was it something worthy of yelling at him.", "Then I say NTA. You did not go off randomly, he ignored you asking him not to tell anyone in a calm way, doesn’t sound like other then yelling why you were upset you started ranting about things that bother you about him in general or started berating him (if you did you are the ahole). You were mad and raised your voice at an adult in a non-threatening way. It’s not the ideal response, but an understandable one. I have a feeling if you didn’t make it a big deal he would continue telling people against your wishes.\n\nThat being said he apologized to you, and you should apologize to him for yelling. While I don’t think yelling at him in this situation is a hole territory, it is an action that requires an apology in my opinion.", "Even if this is the life that he wanted it doesn’t mean it can’t be stressful either", "[deleted]", "Sure.\n\nThe fight is completely insignificant. What he said to his friends are going to have absolutely no effect on if you're being hired or not.\n\nThe people *you told* are talking about it because you told them. Have you considered maybe they're just excited for you?\n\nInstead you have to be over here gnashing your teeth and yelling at your husband over something that doesn't matter.", "Again, from the very beginning, if you didn’t want anyone to know until you got the results back, you shouldn’t have said anything at all. You should’ve waited. Now it’s this whole big thing that could’ve been avoided.", "Her husband not being trustworthy or keeping his word to her is not her problem- she should be able to expect privacy between her and her husband.", "Thank you. I do go to therapy and I will bring this up with my therapist at the next session.", "I genuinely promise I had no intention of baiting anyone. I appreciate the feedback.\n\nEdit: Please tell me what I could have done differently. I am not being sarcastic - I really want to know for future reference.", "I understand. I have apologized. And I will again.", "Thank you. I did apologize for yelling.", "I fully understand. I have told him time and time again that I understand being with me is hard. I don’t know what more I can do on that front. \nShould it be so awful to be with someone who has physical issues as you say?", "This is the only time I have ever yelled at him in that way. But, okay.", "I totally get that. I know my mom and husband were excited. They told me. \nI did ask them not to repeat it. I just wanted to get to the end of the line, ya know? Get to the point where it’s absolutely sure so we could all celebrate together. I fully understand and realize that this is my own anxiety issues.", "The is fair. Let me seriously ask: Do you think this job offer is as serious as a pregnancy? That is the level you're raising it. I think that would be a difficult stance to take.\n\nThis isn't life or death but a setback many people face. People lose and find jobs every day. I understand you have had hardships, and they are discouraging, but perspective would have saved you a ton of trouble here. Hell, you may have even received a consolation cake if your perspective was different.", "You have already apologized… why continue to apologize?\n\nI’m not sure if it’s because I’m old but once should be enough.", "I didn’t not think it’s awful to be with someone who has health or physical issues but can be stressful (just like any relationship but maybe even more so) . I don’t think vent is the right word as I think it’s from happiness for you in getting the offer and access to the healthcare you need.", "I’m really not sure there’s much you can do to support him. That’s why I think he needs someone outside the relationship that he can talk to. Maybe someone will like a therapist or the like would be a better fit than his parents, but I think having a third party to talk to is generally a healthy thing. \n\nBring with someone with health issues and the like isn’t awful. It’s just more difficult and challenging and stressful. And this is coming from someone who is physically disabled, mentally ill, and neurodivergent dating someone who is neurodivergent and mental illnesses", "One time is still not acceptable. It’s never okay to yell. I don’t think what your husband did is right but yelling makes you TA. Not an excuse but sounds like he was just excited for you…just for you to yell at him..makes me feel bad for him.", "I agree with that first part. Perhaps venting wasn’t the right word in this instance, but the sentiment still applies. Her husband is probably more relieved than anything that his wife has access to better healthcare", "He’s actively in therapy - he has ADHD.", "Thank you. I have apologized. I genuinely feel bad for raising my voice at all.", "Good for him", "Everyone makes mistakes. Hope you get the job op!", "Thank you! I am super excited if I do. It is a job I wanted for a while. I am trying to keep a positive eye. Again - thank you!!"]}