{"id": 29621, "submission_id": "17fs23c", "title": "AITA for firing my brother-in-law and ruining my relationship with my in-laws", "selftext": "My wife (25F) and I (28M) have been searching for our starter home for the last three years. 6 months ago we found it, a small two-story home that would be perfect for us to start our family. The only problem is there are some major issues with the home, most would call it a fixer-upper. The kitchen is old and outdated and needs to be completely redone, there are two bathrooms that need to be redone and most of the flooring should be replaced. What made it perfect was the location and the price, since it was a fixer-upper. We had saved enough money to purchase a nicer home but since we loved this one so much we figured we would use the money we saved to make the repairs necessary. \n\nThis was a mistake. \n\nMy wife suggested that her brother, who had spent years in construction, could do the repairs for us since he was currently out of work. I didn't know my wife's brother very well since he lived in another state, but my wife's family said he was great at what he did and we would be doing him a huge favor by hiring him to work for us. We asked my wife's brother and he was immediately interested in working for us, but since we lived in another state he would need to stay with us while the work was being completed. Everything went well at first, my wife's brother was a good house guest and I enjoyed getting to know him. During the day my wife and I would go to work while he worked on the house. After weeks of this routine, I started to notice that our kitchen was still looking like it was in the demolition phase of construction, and didn't see any improvements being made. I don't know much about construction but I felt like the process was taking too long, that and the fact that every week we were spending more and more money on whatever he asked for, I started to question if my brother-in-law really knew what he was doing. \n\nI brought my concerns up to my wife and all she could say was to be patient, whenever I asked my brother-in-law he would make some joke about my cushy job and not knowing what real work was. I dealt with the lack of progress for a few more weeks but at this point, we were months into the project and over $20,000 into our $35,000 budget with nothing of any real value having been completed. I was at my end and I decided to sit both my wife and my brother-in-law down and tell them that I didn't want him to do the work anymore and that I was going to hire someone else, with the small budget I had left, to finish the job. My wife was pissed and kept defending her brother and saying I should have talked with her first before I made this decision. Her brother had some choice words but said he was leaving the next day and that he wanted nothing to do with us anymore. \n\nHe left the next morning and since then my wife hasn't spoken to me about anything that isn't essential. Her family on the other hand has been calling me nonstop, saying that I shouldn't have fired him and that I have created a rift in their family. Now I don't know what to do, so, am I the asshole?", "created_utc": 1698193864, "permalink": "/r/AmItheAsshole/comments/17fs23c/aita_for_firing_my_brotherinlaw_and_ruining_my/", "score": 29, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am I the asshole for not sticking it out with my brother and should I have let him keep working on the house?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA for firing the deadbeat BIL, but YTA for not talking to your wife about how her brother was taking advantage of the both of you by taking all your money for fixing up the house.   \n\n\nWas she going to take over the repairs herself when her brother proved to her that he wasn't going to finish the job?", "NTA\n\nFirst of all, a contractor who's out of work should have been a red flag... good contractors are booked solid for months in advance\n\nSecond of all you should have detailed invoices that show where your money is going... how many hours he spent doing what, or spent on what materials\n\nSounds like he planned to live there and get paid as long as he could, without having to do any real work", "NTA.\n\nYou were being swindled and you caught on, good on you for putting a stop to it.  I'd have gone further and sued to get the money back that he wasted (whatever percentage that is).", "Unfortunately, I'm going to say a slight ESH for not talking to your wife before firing him (though I think the brother definitely sucks way more for taking advantage of you like this, and the family totally sounds dysfunctional). \n\nTo be clear, he absolutely deserved to be fired and I don't blame you at all for being exceedingly frustrated with the situation.\n\nThat being said, I think there are some bigger communication issues here. If you were very clear with your wife and told her that you were unhappy, scared of losing tens of thousands of dollars, and wanting the brother gone, and she blew off your concerns, that's a big deal and a marriage problem.\n\nOn the other hand, if you weren't very clear with your wife and decided to unilaterally take action regarding her brother without talking to her about how exactly that would work, than that's also not cool at all.", "All remodeling projects have start and end dates. So, what's the end date? The progress meetings seemed to have yielded nothing? A reputable contractor brings receipts and detailed management plans to meetings.\n\nIf your BIL was successful in the past he's used to submitting a bid and a timeline FFS?\n\nSorry. This is is giving me The Vapors.\n\nNTA. Either this is handled like business, or you NEED someone else to complete the work. At the very least, your BIL needs a foreman to oversee tasks?\n\nThe error I see is that you did not tell your wife you'd decided to terminate this relationship with your BIL? That was wrong of you.", "for 20,000 dollars SOMETHING should have been fully completed. VERY soft YTA for not speaking with your wife first. I have a feeling it wouldn’t have gotten you very far as she most likely would have stood up for him/would not have agreed. But it’s hard to ignore your husband coming up to you and saying “I have spent 20,000 dollars. look at the state the house is. does this look or feel right?” But you are certainly NOT the asshole for firing him. Maybe just for how you did it.", "Absolutely NTA. Anyone that’s charged you 20,000 with a claim that he’s saving you money should have given you itemized bills for what he spent money on, and a statement of hours worked where he can show what you’re saving money on by hiring him. I do work for my family all the time, and it’s really easy to show this is what I had to purchase, this is how much I saved you in labor. It’s a point of pride. Likely he just stole 20k, and your wife will see by how much you get done with the 15 that’s left.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife (25F) and I (28M) have been searching for our starter home for the last three years. 6 months ago we found it, a small two-story home that would be perfect for us to start our family. The only problem is there are some major issues with the home, most would call it a fixer-upper. The kitchen is old and outdated and needs to be completely redone, there are two bathrooms that need to be redone and most of the flooring should be replaced. What made it perfect was the location and the price, since it was a fixer-upper. We had saved enough money to purchase a nicer home but since we loved this one so much we figured we would use the money we saved to make the repairs necessary. This was a mistake. My wife suggested that her brother, who had spent years in construction, could do the repairs for us since he was currently out of work. I didn't know my wife's brother very well since he lived in another state, but my wife's family said he was great at what he did and we would be doing him a huge favor by hiring him to work for us. We asked my wife's brother and he was immediately interested in working for us, but since we lived in another state he would need to stay with us while the work was being completed. Everything went well at first, my wife's brother was a good house guest and I enjoyed getting to know him. During the day my wife and I would go to work while he worked on the house. After weeks of this routine, I started to notice that our kitchen was still looking like it was in the demolition phase of construction, and didn't see any improvements being made. I don't know much about construction but I felt like the process was taking too long, that and the fact that every week we were spending more and more money on whatever he asked for, I started to question if my brother-in-law really knew what he was doing. I brought my concerns up to my wife and all she could say was to be patient, whenever I asked my brother-in-law he would make some joke about my cushy job and not knowing what real work was. I dealt with the lack of progress for a few more weeks but at this point, we were months into the project and over $20,000 into our $35,000 budget with nothing of any real value having been completed. I was at my end and I decided to sit both my wife and my brother-in-law down and tell them that I didn't want him to do the work anymore and that I was going to hire someone else, with the small budget I had left, to finish the job. My wife was pissed and kept defending her brother and saying I should have talked with her first before I made this decision. Her brother had some choice words but said he was leaving the next day and that he wanted nothing to do with us anymore. He left the next morning and since then my wife hasn't spoken to me about anything that isn't essential. Her family on the other hand has been calling me nonstop, saying that I shouldn't have fired him and that I have created a rift in their family. Now I don't know what to do, so, am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nope and when someone else comes in and gives you an estimate for everything your brother was supposed to be doing, she will see just how much her brother didn’t do, and just how much you two paid him not to do the work he was paid to do.  Be patient.  Math will reveal that her brother took advantage of the both of you.  Try not to be too mad, she didn’t rip you off she was just trying to be loyal to family.", "This is an ESH situation.  You really didn’t do your due diligence either before hiring him or before firing him.  BIL appears to be in over his head and should never have accepted.  Wife and other in-laws have their head in the sand.", "[deleted]", "Well it depends. On one hand your wife knew her brother and trusted him to do a good job on your house. On the other you have been very patient with his antics and he made the decision to not take this situation seriously. This is a complicated situation no doubt, but ultimately I would say that you are NTA since you didn't know that he wouldn't be taking this seriously, you trusted your wife and her family because they promised he was trust worthy.", "NTA.", "Don't feel bad, your wife knows exactly how her brother is.\n\nShe and her parents cannot help themselves enabling him. This is a pattern set down in childhood.  \n\nSorry you're down 20K, at least you put a stop to the freeloading as soon as you could. NTA", "I guess in all honesty I didn't give her a chance to come up with a better plan before I fired her brother. Thanks for the response.", "Ya i have learned a lot in this process. There are many things i would do differently.", "I've thought about it, but that might be a breaking point for the in laws. There might not be a relationship after that.", "Thank you for the response. I agree my communication was lacking here. The loss of money made me impulsive.", "I was way too trusting and didn't ask for the things you would ask a normal inspector. There was no real timeline and there was always some excuse for why things were taking so long. Thanks for the comment.", "Ya i agree, my communication was lacking here. I would definitely do this differently if i could go back. Thanks for the comment.", "Thank you for the response. It's good to hear from builders who know what they're talking about.", "Thanks for the response. I'm working on getting estimates from real contractors now.", "No, she is still trying to defend him.  This is a decision that needed to be made regardless of how she feels about it.", "Are you suing him to recover some of your money?", "Demolition should have taken a week at most and cost maybe a couple thousand dollars.  By the end of the first week he should have been ready to start building whatever was needed for the new kitchen.\n\nIf the in laws are saying you shouldn't have fired him, I'd ask them for a detailed invoice that shows where your money went.", "How many times have you spoken with her about obvious lack of progress? Is this the first your wife has heard you were extremely dissatisfied?", "[deleted]", "Maybe, that might mean the relationship with the in laws is ruined for good though.", "Ya i think that will be my next move. Thanks for the response.", "Having her deadbeat brother take advantage of them is not healthy for his wallet or his relationship.  It sounds like the rest of her family wanted the guy to stay there and keep scamming them.", "All I can think is that my husband wouldn't have been nearly as civilized about feeding, warehousing *and* paying a member of my family who seems to have absconded with some serious money? I am having trouble appreciating that OP's wife is defending her brother?\n\nMy husband wouldn't care that the relationship with his in-laws was damaged.   And if I defended my brother in wrong doing? snort. My husband would not be begging me to stay. Uh un.", "[deleted]", "I should have communicated better, but i can't see how she could continue to take his side. I'm getting estimates from real contractors to show her how much money he wasted. Thanks for responding.", "I do wonder that its reasonable to assume it was never discussed prior to OP calling the whole thing off, though?", "As per OPs comments, yes.", "*I started to question if my brother-in-law really knew what he was doing. I brought my concerns up to my wife and all she could say was to be patient,*\n\n&#x200B;\n\n?", "[deleted]", "But, he did talk to her about it. That was my point. She wasn't *totally* unprepared."]}