{"id": 29627, "submission_id": "17g29c6", "title": "AITA for telling my friend that just because her marriage sucks, mine doesn't have to?", "selftext": "Okay, I know that from the outside, my marriage looks kinda dubious, at least the start of it does. I (F36) met my husband (M45) when I was 21 and he was 31. He had just arrived in my country, and started working as head chef at the restaurant where I was a waitress.\n\nWe flirted heavily and had some great conversations about things I couldn't really talk to my peers about, like religion used as a political tool, cultural differences across Europe, classical vs current literature, historical views on women's and children's rights etc.\n\nI made the first move. He hadn't because he felt the age difference might be inappropriate. Once the ball got rolling he was all in though. We met in July 2009, he proposed in October 2009. In April 2010 I got pregnant, and we got married in June 2010 (unrelated to the pregnancy).\n\nAs all couples do, we've had ups and downs. Ups are the two children we have. Downs mainly being discovering the brain tumor I have. It's beneign-ish, but messes with my hormones a lot, it gives me frequent migraines, I have memory issues, cognitive functions are sometimes messed up and I have an increased need for sleep. On top of that, we also found out that I'm bipolar and I have PTSD. I am fully medicated, and have been stable for many years now, and the PTSD has minimal influence on our daily lives. I do stay at home though, and get disability due to the tumor.\n\nTo make up for me having a lower income, my husband works a lot. He changed careers and is now working in a very demanding field in another city which means that he's staying at a hotel from Sunday to Thursday, working 12-13 hour shifts. It's tough without him here, but I manage. When he's at home, we share household chores and childcare 50/50.\n\nMy friend's husband is a pos. He has cheated on her multiple times in the 4 years they've been together, he does nothing around the house, and she rarely gets out because he refuses to do childcare. She has left him many times but keeps going back for reasons unknown. \n\nShe does love to complain about him though, and is frustrated that I don't complain about my husband. Last weekend, she kept digging into things, calling him a cradle robber, insinuating that he was grooming and abusing me because I was so young when we met, and because I'm disabled, but the last drop was her accusing him of cheating on me when he's away from home.\n\nI lost it a bit and told her that just because her husband and her marriage sucks, she doesn't get to talk shit about mine to make herself feel better and that if she hates her marriage, she should just end it instead of using it as bitching material. Also, 14 fucking years later is a bit late to be showing concern. Then I left.\n\nI'm pretty sure I crossed a line as she isn't currently speaking to me.\n\n&#x200B;", "created_utc": 1698232163, "permalink": "/r/AmItheAsshole/comments/17g29c6/aita_for_telling_my_friend_that_just_because_her/", "score": 56, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my friend she should butt the fuck out of my marriage. I might have been an AH for the way I said it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Some people just can't bear to see others in a healthy and supportive relationship. Distance yourself from jealous and resentful people. Your husband sounds like a decent man.\n\nAlso: is a 10 year age gap seriously 'cradle robbing' territory? My parents have 14 years, my mum was also 21 when she met my dad, they're still together and happy. Maybe tell your ex-friend to focus less on age and more on whether the man is a total AH next time.", "Your 'friend' was fishing for a reaction and landed a good one!\n\n\nPeople like to point out what they perceive as flaws in others to avoid taking care of or owning their own crap.\n\n\nYou simply pointed that out very clearly, but only after she insisted.\n\n\nEnjoy the peace - NTA", "NTA…anyone who is just being ugly about your marriage 14 years into it is not your friend.  Consider yourself lucky she’s not talking to you and enjoy the peace and move on in your life to find new friends", "You’re friend’s comments were out of line. She can talk shit about her husband but she can’t talk shit about other people’s husbands. That’s pretty much the rule imo. \n\nYou don’t need to explain, defend, or even discuss your marriage with anyone. Ever. It’s no one’s business.\n\nWhen people try to put you down to make themselves feel better you don’t need to argue with them because they don’t control your life … Just tell her “I didn’t ask for your opinion, I am not interested in discussing my marriage with you & I couldn’t care less what you think about my husband. He’s my problem, not yours”. \n\nNTA", "NTA - I can't stand people that make complaining their personality.  Next time (if there is one) when your friend starts complaining about her husband just ask her  \n\"So what's your plan?\"  \n\"What are you going to do to make it better?\"  \nand if you're feeling a little passive aggressive...  \n\"What does the marriage counselor say?\"  \n\"Have you found a lawyer yet?\"", "NTA - normal response (calling her on her Shit) to an abnormal situation (your friend Shit talking your husband and marriage). \n\nYou’ve been together 10 years. Like, yeah, at the start I’m sure you got some looks and questions. At your current ages, no one would bat an eye. \n\nOn top of that, it sounds like you guys have a good thing going. Is she really your friend OP? \n\nAnd OP, im sorry you’re dealing with this really shit health stuff", "Nta. Your friend doesn’t have a right to try and hurt your marriage.", "What you said was harsh HOWEVER she started it with her very rude unsolicited comments about your marriage. She owes you an apology, if she did that, I might apologise for the things you said but not before as she started the whole thing. NTA/justified asshole", "NTA not at all! If anything you shoulda shut her up much earlier in the piece by the sounds of it.", "NTA,  she was disrespecting you and you reacted.  Misery truly does love company", "NTA", "NTA- you’ve put up with her complaining about this deadbeat for YEARS! It’s so difficult to watch a friend do that to themselves. But then she has the nerve to insult your husband? The one who stayed with you through a brain tumor, changed his career to support your family, is a good partner, and understands your mental health? \n\nTbh you should have said this to her years ago. Save her and her kids year of trauma", "Your (ex?) friend knows you have a good marriage. She can see that you are happy. She isn't trying to get you to talk shit about your husband, she is actively trying to poison your mind to damage your marriage so you are as unhappy as she is. So I don't believe she wants you to shit talk your marriage to commiserate with her. She wants you to want to shit talk your own marriage so she feels like less of a failure.", "1. YTA if you think we believe the marriage was unrelated to the pregnancy. \n2. YTA with the friend if this is the first time you blew up at her. NTA if this is the 30th time you’ve addressed it. \n3. Not sure why you included certain details. What does well-managed bipolar have to do with any of this?", "NTA, but a 31 year old dating a 21 year old is predatory and weird, so I get why she doubted your marriage", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOkay, I know that from the outside, my marriage looks kinda dubious, at least the start of it does. I (F36) met my husband (M45) when I was 21 and he was 31. He had just arrived in my country, and started working as head chef at the restaurant where I was a waitress.\n\nWe flirted heavily and had some great conversations about things I couldn't really talk to my peers about, like religion used as a political tool, cultural differences across Europe, classical vs current literature, historical views on women's and children's rights etc.\n\nI made the first move. He hadn't because he felt the age difference might be inappropriate. Once the ball got rolling he was all in though. We met in July 2009, he proposed in October 2009. In April 2010 I got pregnant, and we got married in June 2010 (unrelated to the pregnancy).\n\nAs all couples do, we've had ups and downs. Ups are the two children we have. Downs mainly being discovering the brain tumor I have. It's beneign-ish, but messes with my hormones a lot, it gives me frequent migraines, I have memory issues, cognitive functions are sometimes messed up and I have an increased need for sleep. On top of that, we also found out that I'm bipolar and I have PTSD. I am fully medicated, and have been stable for many years now, and the PTSD has minimal influence on our daily lives. I do stay at home though, and get disability due to the tumor.\n\nTo make up for me having a lower income, my husband works a lot. He changed careers and is now working in a very demanding field in another city which means that he's staying at a hotel from Sunday to Thursday, working 12-13 hour shifts. It's tough without him here, but I manage. When he's at home, we share household chores and childcare 50/50.\n\nMy friend's husband is a pos. He has cheated on her multiple times in the 4 years they've been together, he does nothing around the house, and she rarely gets out because he refuses to do childcare. She has left him many times but keeps going back for reasons unknown. \n\nShe does love to complain about him though, and is frustrated that I don't complain about my husband. Last weekend, she kept digging into things, calling him a cradle robber, insinuating that he was grooming and abusing me because I was so young when we met, and because I'm disabled, but the last drop was her accusing him of cheating on me when he's away from home.\n\nI lost it a bit and told her that just because her husband and her marriage sucks, she doesn't get to talk shit about mine to make herself feel better and that if she hates her marriage, she should just end it instead of using it as bitching material. Also, 14 fucking years later is a bit late to be showing concern. Then I left.\n\nI'm pretty sure I crossed a line as she isn't currently speaking to me.\n\n&#x200B;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nNo actual friend would say that to a friend. Moreover, it kinda sounds like she perfectly knows her marriage sucks and that she is indeed trying to ruin yours as well. Which is kinda sad, honestly.", "--- and you think *you* crossed a line!? *She accused your husband of cheating!* Your response was spot-on. A bit mild, even, considering.\n\n> she isn't currently speaking to me.\n\n​You say that like it's a bad thing. Sounds like a win to me.\n\nNTA.", "NTA. My wife has friends she no longer hangs with for this reason. They want to bitch and moan about their husbands and being the swell guy I am my wife doesn't have that in common with them. We all make choices in life and your friend chose poorly which has nothing to do with you.", "I think I would have been suspicious about your age gap at the start but at this point come on… like clearly he didn’t just get with you because you were young. We’re past that. Your friend is not being a good friend", "NTA\nShe's the one who crossed a line. She's unhappy amd wants you to be unhappy too.", "Some people were concerned about it when we first got together, especially with how fast things were going. My husband is an amazing man and I love him very much.", "It can be a red flag, and before anyone roasts me it doesn’t seem to be in this case. But 21 and 31 would usually have an unbalanced power dynamic.\n\nAt 21 you are just starting out, you might even be in college still. You wouldn’t have as much relationship experience so you wouldn’t recognize red flags as easily and fall into toxic relationships easier. And your brain is actually still developing and doesn’t finish until 25. I’ve heard a lot of people say they won’t anyone under that age because there is a noticeable maturity difference.\n\n31 you would be already established in a career, so you usually would be making more. You would be more settled in life with savings and an established home. And people like to say that if you’re older and dating someone that much younger than you it’s because you can’t get anyone your age to date you. They mostly say that because the older you get the more relationship experience you get and you know what red flags to look out for.\n\nBut while a 10 year age difference being a red flag is a rule there are exceptions to every rule. This relationship and your parent’s relationship are the exceptions to the rule. It happens, just not very often.", "It’s not like she was freshly 18. 21 is an adult. My husband and I have a 6 and a half year gap, he’s early 30’s, I’m in my mid 20’s. we met in our 20’s and are completely, annoyingly, stupidly obsessed with each other, according to our friends.", ">\"So what's your plan?\"  \n>  \n>\"What are you going to do to make it better?\"  \n>  \n>and if you're feeling a little passive aggressive...  \n>  \n>\"What does the marriage counselor say?\"  \n>  \n>\"Have you found a lawyer yet?\"\n\nI'm totally writing this down. I generally don't have friends like this any more, but my partner does. This will go straight in her toolbelt.", "We were 2 months into wedding planning when I found out I was pregnant. I've told her frequently that it wasn't like that and she's been making comments frequently over the past 3-ish years. I included the details because it has to do with my disability which is one of the reasons she accuses my husband of being able to take advantage of me.", "Every fucker has a condition these days & for some reasons loves to tell everyone about it😂😂(answer for 3)", "There you go. You are in a great relationship and absolutely don't let others knock it. Good on you. NTA"]}