{"id": 29632, "submission_id": "17g3jj8", "title": "AITA for not wanting to do a joint birthday party with my fiancé’s sister?", "selftext": "My (27F) future SIL (29F) never liked me. She’s best friend with my fiancé’s ex and so in \"support\" of her, she decided to not like me.\nIt got better over the years, not in a we’re friends way but in a we’ve learned to be civil with each other. \n\nShe moved out 2 hours away last year and she’s coming back to celebrate her birthday with her family and so obviously, my fiancé.\n\nThing is, our birthdays are 2 days apart, mine’s on Friday and hers on Sunday. \nI’m working so I also planned to do it on Sunday. \n\nMy fiancé’s can’t be at both (obviously) so he wanted us to do a joint birthday party so he could be at both. I told him no, your sister and I don’t like each other and I doubt she’d want to do that either.\n\nI told him that he could go celebrate his sister’s birthday and I’ll go celebrate mine with my family and friends and we’d do something together for my birthday another day. He don’t want to do that though and say it’d be way easier if his sister and I celebrate ours together. I told him my answer was still no and he got mad. He accused me of being selfish and of manipulating him into going to mine (??) \n\nI honestly don’t know if I’m losing my mind or if I’m right. I mean, his sister’s birthday is ACTUALLY on Sunday so it makes more sense if he goes to hers.", "created_utc": 1698236723, "permalink": "/r/AmItheAsshole/comments/17g3jj8/aita_for_not_wanting_to_do_a_joint_birthday_party/", "score": 10, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’ve refused to do a joint birthday party with my fiancé's sister so that my fiancé's could be at both\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Your fiancé is living in a fantasy world", "NTA\n\nAlthough celebrating birthdays after 18 never made sense to me.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (27F) future SIL (29F) never liked me. She’s best friend with my fiancé’s ex and so in \"support\" of her, she decided to not like me.\nIt got better over the years, not in a we’re friends way but in a we’ve learned to be civil with each other. \n\nShe moved out 2 hours away last year and she’s coming back to celebrate her birthday with her family and so obviously, my fiancé.\n\nThing is, our birthdays are 2 days apart, mine’s on Friday and hers on Sunday. \nI’m working so I also planned to do it on Sunday. \n\nMy fiancé’s can’t be at both (obviously) so he wanted us to do a joint birthday party so he could be at both. I told him no, your sister and I don’t like each other and I doubt she’d want to do that either.\n\nI told him that he could go celebrate his sister’s birthday and I’ll go celebrate mine with my family and friends and we’d do something together for my birthday another day. He don’t want to do that though and say it’d be way easier if his sister and I celebrate ours together. I told him my answer was still no and he got mad. He accused me of being selfish and of manipulating him into going to mine (??) \n\nI honestly don’t know if I’m losing my mind or if I’m right. I mean, his sister’s birthday is ACTUALLY on Sunday so it makes more sense if he goes to hers.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. It's your birthday and you should spend it the way you want. I think it's a great idea to spend your birthday with your loved ones and do something together with your fiancé on another day. Also it makes it something special to have a day together, that's a nice idea!\n\nAlso, it's unfair of him to say that you are manipulating him to go to your birthday. You explicitely told him to go to his sister's!", "NTA.  I'm sure it would be easier for *him* if you and his sister did a joint birthday party, but your birthdays are not about what's easier for him. Neither of you want a joint birthday party and you have offered a perfectly good alternative, so your fiance needs to get over himself.  If anyone is being selfish it's him.", "NTA. Your solution makes sense and is something that you, as the person with the birthday, is good with.  He is just being ridiculous.  Tell him to go to her party and have a great time. He doesn't want to show up with out you and say that he has left you alone to celebrate your birthday.", "NTA\n\nYour suggestions and reasoning sound completely reasonable to me.\n\nThe problem is he's putting words in your mouth you didn't mean.\n\nA solution might be to plan something specific for the both of you. Don't say we'll do 'something', pick a day and pick a plan so he'll believe you (it would be nice if he believed you anyway but yeah)", "NTA", " Ta. Sounds like he is doing exactly what he accused you of doing.  Isn't he using anger to manipulate you into a birthday party you do not want? Husband is the ahole not you.", "NTA. Yes, both birthday girls need to be uncomfortable so things are more convenient for your fiancé. Him getting so upset about this is sketchy", "So ge wants you to be unhappy at your birthday celebration because it's easier for him? NTA. It's your bday, Don what you want with the people you want to spend time with.", "NTA. She isn't really your friend and I don't understand why this was even a suggestion. It is more like this makes the situation convenient for your fiance to check the \"went to birthday obligation\" checkbox. \n\nI think that you should let him know that it is fine if he attends his sister's party since she isn't in town often. You could offer to meet up with him sometime that weekend if both of you could make it work.", "NTA, you communicated, you offered a fair a logical deal, your husband should stop to think his desires shall be the reality.", "NTA,  your boyfriend’s being an arse though.", "NTA whatsoever. You communicated he did not have to plan around you and he is too insecure to listen/believe what you’re saying. He seems to not be respecting your wishes and raises red flags imo", "I understand where you’re coming from but …. Well you’re not doing this to help your fiancé out. You don’t like your SIL. If you really wanted to be fair about this then do something on a day your fiancé can be there to celebrate with you. Otherwise, he’s screwed & stuck in the middle. He can’t win here. \n\nIf you’re 100% totally fine with him choosing to celebrate with his sister then tell him that & forever hold your peace. \n\nI’m curious — If it wasn’t your birthdays would you go to visit SIL while she is home?\n\nNTA — your birthday, go have fun!", "Because he recognizes this will come back to bite him in the ass. He will have to choose where he goes because at some point this will get brought up again. I get what he’s trying to do. Save himself & not disappoint either of these women. \n\n“Sure go celebrate with someone I don’t like instead of celebrating my birthday with me. My family won’t judge you in any way when I tell them you chose your sister over me.” Lol … \n\nHopefully, fiancé figures out how to be in 2 places at once because this is the equivalent of me (54f) saying to my husband “it’s fine. You do whatever you want to do”."]}