{"id": 29647, "submission_id": "17g9qc7", "title": "AITA? We got robbed in mexico by the mexican police and friends want reimbursement..", "selftext": "hey so i went to mexico on a girls trip with two of my friends we will call them izzy and rachel . and we had a pretty good time. when we were leaving our hotel it seems like our phones just stopped working like there was a blocker on them so our GPS’ was not working properly . we drove down the street and not too far there was a stop by the police so we stopped to ask for directions .. they noticed we were not locals and asked us to pull over to search the car. they found we had some disposable pens which was like cool we handed them over not wanting any issues . they demanded that we pay a made up fine or they would haul us to jail . when i told them i didn’t have any cash they ransacked through my purse until they determined that there was actually no cash ( i’m the only person who didn’t have cash ) they did take all the money out of my friends purses which was a little over $330. we are back in the states and they are asking that i reimburse the one friend $110 for the “mexican police fine” i keep telling them that it wasn’t a real fine and it was a robbery but my friend izzy was telling me it would be considerate to reimburse rachel of the money that was taken by the police . i refuse to do so because like you act like i took your money or that it was an activity that we had did and split . AITA for not wanting to pay that back\n\nlet me add the fact that i had to pay $140 just to get back to the airport even after i paid for costs of a rental because izzy never read properly and told me there was free transportation. i never asked anyone to reimburse for it either . they used the rental to get to the airport but nobody was willing to take me even though i put money in it . i also told everyone to bring a disposable card as well as no cash . ", "created_utc": 1698253744, "permalink": "/r/AmItheAsshole/comments/17g9qc7/aita_we_got_robbed_in_mexico_by_the_mexican/", "score": 40, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i don’t want to pay back money that was stolen from my friend, am I wrong for not wanting to pay for it ?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. This happens all the time in MX. Why would you repay them for getting jacked? Did you jack them? Did you organize the crime? No.", "Ok what is your \"friends\" deal? Are they playing dumb to get money out of you or are they really stupid and don't understand that they got robbed?\n\nIn any case \n\nNTA", "Is something missing here? I don’t understand why you would be responsible for giving the girls money that was stolen. Why would you be liable?", "NTA  \n\n\nUnless it was something you demanded of your friends, the trip was mutual. You are not responsible for other people, simply because you didn't carry cash.  \n\n\nQuick tip... Always have multiple cash stashes when heading into risky areas. Hollowed out shoes or hidden pockets. That way, if a gun is pulled you can dump and run.", "NTA, not your fault the police suck.", "NTA. unfortunate situation but it wasn’t a fine, it was a robbery. she carried cash, you didn’t. the cash was stolen from her, and it’s not your fault. you weren’t the one who robbed her. she’s just going to have to accept the money is gone.", "NTA. I do not understand why people here think you need to pay up. That's ridiculous. Crime by definition is not fair. If I am riding in a car with a friend and we get carjacked, I should not have to pay her for half the value of the car.", "NTA. Do your friends even know anything about Mexico?!💀💀", "NTA. Your friends are rightfully upset. That wasn't a legit fine and was a theft by corrupt police. But it's not your fault and it's not something you need to \"reimburse.\" It was just good luck that you didn't have cash and bad luck that they did. They're wrong to take their anger out on you.", "INFO, we’re the disposable pens yours?\n\nThis is a very well known tactic by police in Mexico (and many countries around the world). Life lesson, only carry minimal cash (but not 0 because some thieves get violent when they get nothing) in foreign countries", "was one of the pens yours? if so YTA", "Old golf joke:\n\nTwo guys are playing golf. When they are almost through, a robber steps out of the trees and demands all their cash. One guy pulls his wallet and counts out $1000, hands it to his friend, and says, \"there, now we're even!\"\n\nNTA, of course.", "ESH. It's not a robbery it's a bribe, which your friends all had to pay and you didn't. You should kick in your $110 for your third of it.\n\nedit: everyone saying it's not a bribe like...cops asking you for money to look the other way or to not shake you down is a bribe? a cop asking you for cash so he won't write you a ticket is him *asking for a bribe.*", "NTA. It's not your fault the cops were just being cops. If it had been stateside, they'd have called it \"civil forfeiture\".", "YTA. I genuinely don’t get this. Why would you want your friends to take the full hit? Why wouldn’t you want to spread out the cost so that everyone hurts a little, but no one hurts too much.\n\nHonestly, it’s not something they should even have to ask. IMO of course.", "Me and my friends would not want any of us to be hurt more for something that happened to all of us. If one of us did not have cash at the time, that person would have evened it out when we got back. Your friends are dicks for bringing it up, but you're definitely not a good friend. If I was the one who paid the most to keep us all out of jail, I would definitely remember, and you would not be invited again. YTA", "INFO: did you take a hit off of any of the disposable pens before the police took them?", "NTA and anyone else saying otherwise is wrong. you had nicotine, that’s not illegal. it was clearly a shakedown/robbery and not a bribe like people are saying, they had no reason to arrest you.", "Fucking Reddit.. you got robbed by the Mexican police just be lucky it was the Mexican police and not like a fucking cartel or something.", "Nta.", "Well, ain't that a classic case of \"not my problem, not my pesos.\" NTA, girl, you didn't rob anyone.", "NTA - What even?! Why would you pay them back? That makes 0 sense", "Well let's face it, paying the \"fine\" to the cops was cheaper than sitting in a Mexican jail because you brought in what sounds like illegal vapes. Now, unless none of those pens were yours and you had no knowledge of them, you did the crime but they paid for it so yeah, YTA.\n\nNow, that said, you are saying that you spent $140 on transport, so 140/3 = \\~$46 per person, so you owe Friend 1 around $65 difference and Friend 2 owes you for their share of the transport. Are you willing to lose the friend of these two people over less than $100?", "They do this all the time. You should never hD then the pens. Yes you owe your girlfriends a payback.  When you are in someone else's country you don't screw around w stuff like that. Consider your self lucky you still not there.", "NTA. But Y T A for not using proper punctuation and capitalisation.", "NTA. I think the Yta answers here come from people who have a very transactional view of friendship. Yes you are partly responsible for the pens (I’m assuming they’re weed vapes) in the car. But you not having money is just how it played out, it wasn’t like you saw this happening along the way and made sure you didn’t have cash on you.\n\n A good friend would just take the L and not ask for money like this, it’s really tacky.", "NTA. It was stupid of them to go to mexico and carry cash.  They must have been living under a rock to have not known that the police are corrupt in most of that country.  It is also likely that it was not real police that you had stopped at. No reason to give them money because they got robbed.  They tried to rob you but you were not dumb enough to carry cash.", "Morally I think you should split the \"fine\" between you all. Yes it was technically stolen but it does seem a bit unfair that you are the only one who wasn't impacted by it. \nSorry but YTA. Although obviously not as much as the Mexican police were.", "ESH. The Mexican police, your friends, you.\n\nIt sucks that your friends asked. It sucks on your part that they had to ask.\n\nNo, you didn't partake in the \"robbery.\" But this is how it works in Mx. You can either pay the bribe, or go to jail.\n\nAssuming you partook in the pens, you also broke their laws. If you wanted to go to a mexican jail and wait to take a drug test (if they even let you) to distance yourself from it, then you should've done that.", "NTA, but like everybody mention, your friend is right to be upset, but next time, probably plan a trip to a safer country. I would avoid Mexico like the plague especially some of their police forces are on the mafia's payroll. Try Fiji next time, the place is beautiful and the people are a lot more helpful.", "YTA. You need to split \"police\" fee regardless of whether it's legit or not.", "Learned your lesson don't ever go to Mexico", "Regardless of what people are saying, you should pay a proportional amount. Share the burden. Be a friend.", "NTA, but if you had been the one to lose $330, wouldn't you want (not expect, but want)  your friends to help defer your loss? Treat them as you would have wanted them to treat you under the same circumstances.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nhey so i went to mexico on a girls trip with two of my friends we will call them izzy and rachel . and we had a pretty good time. when we were leaving our hotel it seems like our phones just stopped working like there was a blocker on them so our GPS’ was not working properly . we drove down the street and not too far there was a stop by the police so we stopped to ask for directions .. they noticed we were not locals and asked us to pull over to search the car. they found we had some disposable pens which was like cool we handed them over not wanting any issues . they demanded that we pay a made up fine or they would haul us to jail . when i told them i didn’t have any cash they ransacked through my purse until they determined that there was actually no cash ( i’m the only person who didn’t have cash ) they did take all the money out of my friends purses which was a little over $330. we are back in the states and they are asking that i reimburse the one friend $110 for the “mexican police fine” i keep telling them that it wasn’t a real fine and it was a robbery but my friend izzy was telling me it would be considerate to reimburse rachel of the money that was taken by the police . i refuse to do so because like you act like i took your money or that it was an activity that we had did and split . AITA for not wanting to pay that back\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I've been jacked. This shit happens. You're not the asshole here.", "NTA This happens ALL the time in Mexico. Your friend should have either hidden her cash really well, or brought little cash and used a card while you were there. It was careless to carry that much money.", "YTA, if she hadn't handed that money over you may very well be sitting in a Mexican prison right now.  Go back, fuck around and don't pay this time and find out.  She literally paid for you to not be in jail.  WTF.  Friend?  My ass.", "Nta not your job to pay them back for all of you being robbed. It was clearly a shake down and its hysterical they used pens as an excuse since they seldom even bother with that", "Whose disposable pens were they? I feel like that may be the underlying issue here if they were OP’s they may feel like she is the reason they got jacked?", "that’s why i told them not to bring cash to bring a disposable card .", "Dude some chicks are so damn petty. How does this make sense in any reality ???", "that’s what i’m trying to figure out .. like i’m not to be blamed and i don’t understand why i would have to pay that back .", "they feel like we should split it", "Because if her friend's didn't have cash OP could've gotten stuck in jail for a day or possibly even gotten beaten up by the cops?", "It wasn’t stolen. They got caught with illegal drugs and bribed the police to not go to jail", "thank you for that tip i never thought of that . i didn’t carry cash bc i have a disposable card . i didn’t demand they give any money", "exactly how i feel i feel bad ofc and i was upset but atp i didn’t want that to happen so i don’t feel like that’s something i have to give back tbh . i didn’t carry cash but if i didn’t i would’ve been out of gas too and i wouldn’t have asked them to reimburse me for a fake fine . they keep saying it was a fine but it was a robbery", "tbh i don’t either . that’s a great example like if that happens while i’m there i have no control\nover that and the fact i had no cash i’m not understanding why they think i should have to pay that back . #creator", "no they didn’t do any research! they didn’t read or nothing and i’m so aggravated by it . i’ve been before so that’s why i told them not to bring any cash and a disposable card", "i agree i don’t feel like that’s it my fault and that i should have to come out of my money bc i was smart enough to not bring any cash #creator", "i’ll remember this and no just one of the pens everyone had their own pens", "yes one of the pens were mine , they were nicotine that was bought in mexico . they shouldn’t have stopped us for vape pens .", "exactly thank you 😭😂 i remember that joke", "what does esh mean ? and i didn’t have to pay it bc i told them to not carry cash to use a disposable card .", "exactly it’s not my fault that they were doing that to multiple people that night", "and because that’s how ROBBERIES work . you don’t go and give all your money to the next bc they got robbed . \n\nthey just asking for more money out of me like i didn’t just pay for the rental that they were using and had to pay for a taxi just to get to the airport . and because why would i want to do that ?", "idgaf what you don’t get . let me go ahead and add a part in this story bc .. i paid for a rental and had to pay $140 to get back to the airport i didn’t ask them to reimburse me even tho i paid for that rental . i should’ve been able to use it to get back to the airport , but you want me to make sure not everyone hurts .. girl tf is you talking about .", "good thing idgaf about being no good friend . if y’all definition of a good friend is this baby then that’s cool i just won’t be that 😂😂 . and don’t worry about inviting me , y’all don’t know this bc y’all dk me but IM THE ONE WITH THE MOTION . i’ve already been to mexico once without them before this you think i need an invite to go anywhere ? oh okay . #creator", "like in general ? or right before ? because i bought one of them they were $30 each .", "that’s what i’m saying it’s not illegal vape pens are not illegal . like we were lost and asked for directions and then they asked us to search us and stuff and we said yes bc we didn’t have anything illegal .", "we believe it was the cartel posed as the mexican police or just impersonators . and i am lucky so idk wtf you talking about .", "okay den !", "like i’m just giving away my money to make up for the fact that it was a robbery", "and i’m the only one who spent the $140 on the taxi plus $100 on my share for the rental. so i spent a total of $240 on transportation when i had transportation to the airport it’s just nobody wanted to drive the 2 hours there and back to tulum so i was basically forced to buy the taxi ..", "no we bought regular ones from mexico", "nicotine isn’t illegal that’s why we had the pens so tf are you talking about .", "so many people disagreeing with y’all so many people telling me i’m not wrong . and then like 25  people telling me i am .", "An English teacher has entered the chat.", "okay baby that’s fine i just like my stuff like this 😂", "that’s all i’m saying . they took my pen which i paid for , and then ranschaked my purse for cash and then they did the same to them and found cash in their purses and took it . i just didn’t have any cash but if i did it would’ve been took too", "No, my answer comes from the fact that OP thinks that not having cash is what saved her in this situation, but it was her friends' cash that saved them all from a worse fate.", "exactly!!!  they weren’t real police they were impersonating police officers . and that’s all i’m saying that we were all gonna get robbed of out cash but i don’t carry any in a foreign country for that reaosn", "How is it unfair? I don't understand this logic. So if my apartment is robbed, and they take my roommate's laptop - do I have to pay for half of the replacement?", "how is it unfair that i’m smart enough to not bring all cash in a different country ? i don’t carry cash and now it’s not fair bc i don’t carry it ? i travel all the time that’s why i tell people to bring a disposable card . now it’s unfair that i don’t carry cash .", "baby we bought the pens in mexico .. nicotine ain’t against the law .", "i’m not going back to mexico . that was my 2nd and last time that’s why i told them not to bring any cash and just bring a disposable card . and i will try fiji thank you ! 🫶🏻", "why? if i had cash in my purse they would’ve taken it too i told everyone to bring a disposable card .", "my 2nd and last time fr", "i get that , she’s saying that it’s considerate .. and agree to that but i’m saying like do i have to .. this was an answer i was looking for", "To be clear here, went to TJ with other Marines back in the day.  WE ALL TOOK CASH specifically to give to the cops WHEN we got fucked with to make sure they went away.  Cost us all $20 bucks each.  Stayed out of jail.  We know of other Marines that didn't have cash and went to jail.  Mexican jail.  Fuck that shit.", "she didn’t pay for me to do nothing ! they went in our bags and took our cash ! idk what y’all not getting about a robbery . speaking of asses .. you can kiss mine .", "we each had a pen #creator", "In future trips, always carry some local cash in a fake wallet. A token amount to get robbed for, because if you have nothing to give them it can turn bad", "Why did you have weed vapes on you?", "wym #creator", "It’s totally up to you then, but you’re NTA.", "Doubtful.", "Nicotine isn’t illegal in Mexico.", "that’s not what happened it was a nicotine pen . #creator", "Sounds like they fd around and found out. You tried preparing them and they didn’t listen so that’s on them", "It means everyone sucks here, and in this case it's ridiculous.  \nIt wasn't a bribe, you give a bribe to get something, if it's forcefully taken its robbery.  \nNTA.", "ESH means everyone sucks. And if none of you had cash, they would have arrested all of you so you should be grateful that your friends did have money", "You would have had to spend a day in a Mexican jail if you did. If your friend was driving you all around on vacation and got a ticket, you'd probably split it right? Because everyone is benefiting from their driving. Here, you benefitted from your friends carrying cash.", "I’m actually a guy, but whatever. And you are clearly a delight. Your former friends were lucky to know you.", "OK, so yes I think you owe the money / soft YTA.  I understand your frustration with the police and your friends for carrying cash, but I am not sure this would have gone better for all of you if none of you had any cash.", "If the disposables were yours (or partly yours)you should pay. Yes this was a robbery by police but your contraband gave them the excuse they needed to demand a fine", "Or paid and bought off police officers. I’m saying people here saying you’re the asshole don’t actually know how fucked that situation actually is and your friends wanting you to reimburse them don’t seem to realize it either.", "Then you should have asked to see the desk captain", "exactly 😂😂", "Grow up.", "Because her friends paid the cops' bribe! The cops demanded money or everyone was going to jail. Do you think they would have been like 'oh okay no cash? go on your way!'", "I'm looking at it more of a way to keep your friendship if that is what you want. Yes  your friends probably should have listened to you and you don't have to give them any money, but friendships have been broken for a lot less.", "If it's only nicotine, and it really was made up, then even moreso: still yes. It's the travelers tax down there. Pay your friends.", "now its \"our cash\", can't have it both ways love", "i’ll remember this tho", "People say this but if the robber WANTS to do more to you it doesnt really matter if you have cash or not", "This is exactly why she should pay her friends though?", "no nicotine", "thank you i appreciate it", "Why? Do you think corrupt cops are really nice guys?", "it wasn't nicotine it was thc", "that’s what it sounds like to me", "exactly that wasn’t a bribe that was a full blown robbery it was taken forcefully and we weren’t given much of a choice . it’s not like we were like “oh if you don’t take us we will give you all our money” they literally ran through our purses and emptied out the money .", "You say po-tay-to, I say po-tah-to.  Welcome to the developing world.\n\nYou can pay this money or spend the night in jail.  What you call it is semantics.", "You bribe a cop to keep them from arresting you.", "thanks for letting me know . y’all keep saying we would’ve been arrested like this was the real police .", "we all paid for the rental so we aren’t benefiting from anything we put in the money needed for the rental and we paid for extra drivers . if we got an ACTUAL TICKET from an ACTUAL officer i would have helped pay it but we didn’t we got ROBBED bc we all put in for the rental obviously we would all take care of the ticket . so i benefited from not carrying cash in a foreign country but since they did i owe them something for them carrying the cash ??? after i told everyone to get a disposable card for stuff like this ??", "well stop acting like a lil girl and i won’t get confused .", "i see where you’re coming from but not about the money . sorry like i didn’t set this up so", "they aren’t contraband . it’s a vape ! like that’s not illegal atf all .", "we bought them in mexico .", "exactly it was scary asf and i never expected it to happen .. but it’s like you’re asking me to reimburse a robbery like i’m insurance or something", "i did they acted like they didn’t wanna go back to the jail", "smd .", "Yes, they would have. If none of them had cash, the cops would have let them go. They weren't trying to enforce a law, just get some money, and taking the time to haul them in would mean they couldn't find someone else to shake down.\n\nThey wouldn't have believed them claiming they had no cash, but they'd have gone through their things and found no cash.", "This was a robbery, not a bribe", "that’s also a thing for me , idgaf about no friendship but i’m trying to be more open to caring about them so yeah i get where you’re coming from", "no 🫶🏻 . i’m telling you it was made up i didn’t get taxed last time i was there so idk what type of travelers tax you’re referring to i told everyone to bring a disposable card like a cashapp card or something of the sort just in case", "YTA pay your share of the tourist tax shakedown. The group gave the police ammunition for a bribe, the group pays. Your friends money kept you out of jail, pay your share", "why??", "Then they would not have had a problem with that. You even said that you let them have them because you didn't want any trouble, that means you knew it was not nicotine.", "You’re welcome. Take care.", "Because no one wants the international incident of detaining (I assume) Americans long term for nothing. It’s a shake down. You don’t cut down the tree when it doesn’t drop fruit, you move on to the next.\n\nEven when tourists are actually detained for bullshit charges in Mexico, it’s essentially a formal ransom for cheap bail. Or they let you walk within 24 hours if it’s more trouble than it’s worth to hold you, barring actual crimes were committed.\n\nI do think they were lucky, but not for avoiding jail. Three lost women abroad? Lucky it didn’t end in sexual assault, bodily harm, or human trafficking. $350 is nothing in the face of shit like that.", "Says who", "no it wasnt", "we didn’t have any choice and they forcefully took it by going through our purses", "no we didn’t bribe them we had no choice !", "This was a hypothetical. You did not benefit from not carrying cash, you benefitted from your *friend's carrying cash* because they were able to pay the bribe the cops demanded from you.", "Stop acting like a little girl and you won’t get confused??   So you make a public post to get opinions and when one opinion\nDoesn’t fit your reasoning. You go off?     Constructive criticism girl.   Do t ask a question for others to answer if you can’t accept both spectrums. ;)", "If you didn't want advice from internet strangers, you shouldn't have asked. Good luck.", "baby there was no jail to go to it was made up . even the locals told us that we would’ve been better going to the station and telling on them . what they did was against their laws and we didn’t break any laws .", "Because they are friends and it was a shared experience. The fact they had money may have saved all of you significant drama whereas you not having any cash put everyone at risk. \n\nAre you willing to lose these friends over $110? If yes than you were a shit friend any way.", ">A token amount to get robbed for, because if you have nothing to give them it can turn bad\n\nThe cops were aggressive and dug thru all your shit. Do you think they would have just been like \"Oh I guess you don't have cash, we'll let you go on your merry way, have a great time in Mexico?\" Or would they have stolen your shit instead of your money? Or potentially beaten you up? The fact that your friends had cash *to steal* prevented you from a worse fate then just getting your cash jacked. The money your friends had on them could have saved you from a worse fate than this one because they were able to *pay off the cops.* You should also kick in some money because you benefited from their cash.", "i didn’t want any trouble so we didn’t argue about it being nicotine !!!! we just handed it over bc we can buy more of those", "Well I agree with you there -- esp. since OP seems to think they could have been cartel members, so yeah getting your cash stolen would be the *optimum* outcome of that encounter. I think physical harm whether they are cops or not cops was still pretty plausible from people who are already rifling thru OP's shit though....which is why OP should kick in money, because her friends' cash helped avoid worse outcomes.", "exactly i was more worried about being human trafficked not jail this happens all the time in mexico that’s why when people telling me that we would’ve gotten hurt and it’s just like no . y’all better go look up the other reddit users this happened to .", "Yes, this happens all the time in the US as well, they just don't call it 'bribery' or 'robbery', they call it 'civil asset forfeiture'.\n\nIt's the second biggest form of theft in the United States, behind wage theft.", "then is it a form of blackmail?\n\nA bribe, i thought is when someone offers an asset/action in trade for something they want.\n\nblackmail, a request of an asset/action in trade, so someone doen't get something they dont want to happen?\n\nYou guys did not want to go to jail or whatever they were going to do if ya'll had no money on you.", "You could have gone to jail?", "that wasn’t a hypothetical that’s what tf happened . and that wasn’t a bribe , they went through our purses and took the cash that was a robbery .", "baby it don’t matter what y’all say ima do what i want regardless .. i just don’t be wanting biased opinions all the time .", "Baby…you would have gone to jail bc they only care about the money. They can take you to jail for breathing down there. They don’t care if it’s real or made up. You would have gone to jail for not having money on you. They would have made crap up to put you in jail for.", "Do you think jail is the only thing rogue cops could've done to you if you didn't have cash.", "like y’all acting like i set that shit up . shared experience that they thought was FUNNY .", "want me to pass out money i’ll be loosing money i never lost to begin with bc i didn’t bring any cash . i told them if they were going to bring cash to leave it in the room and not bring so much bc of shit like that", "and y’all want me to be the martyr because i didn’t have no cash ? 😂😂😂", "I am confused, are your OP or a different friend that was involved?", "so i owe them for ????", "no baby it was a robbery . when someone goes in your purse and takes the cash out of it without your permission it is a robbery", "no they weren’t even real police officers", "It really doesn't matter if it's a bribe or a robbery, either way your friends *having cash* could have easily been what saved y'all from being victims of a worse crime.", "Why even post it if yuh gonna do you anyway?  Genuine question.    Like, to me, what I see is trying to feel validated for something you may have questioned.   \n\nHere’s a real question to think about.  \n\nIs your friends relationship of yours more valuable then $130 bucks?   How you answer that should determine the severity of caring or not.     If you don’t care,  then 1- who cares then.  It if you do care, then, make it right and move forward.  It’s just $130 bucks.", "nah baby we wouldn’t have , they were saying these people weren’t even real cops when it was reported that they were impersonating them .", "ofc not but baby i did my research that’s why i didn’t have any cash but y’all on the what ifs and i’m on what happened .", "Hell nah you ain't a martyr, you're entirely in the right here. Stick to your guns!", "\"Owe\" isn't the right word.  Them having cash on hand is literally what kept you out of jail and frankly probably ended up costing less because the police would have forced you to have money wired from family to get released.", "So what do you think would happen if your friends had listened to you and none of you had money? Like they dumped all your purses and they found nothing but chapsticks and sunglasses?", "So you could have been murdered, beaten, or anything else.", "yes it does . a bribe is something where we said “hey if you don’t take us to jail we will give you all our money” and a robbery is straight up someone taking your shit without your permission", "Nah baby…you’re a young woman who is lucky all that happened is you ended up owing your friends $110. YTA", "You should have had a small amount of cash on you specifically for this situation. Your all idiots but such is life.", "so i need to give them money for ?????", "In one comment she says she thinks they were cartel so her friends' cash could have been what kept them from being like, murdered??", "so you want me to give them money for what ?? baby idk if it’s bc i’ve been in the hood and grew up in it but robbery is robbery .", "No, a cop can ask you for a bribe. \"If you don't give us all your money we'll take you to jail.\" is him asking you to bribe him.", "i don’t owe them shit and you can get in the field too about it .", "Baby it's bc I live in a high crime city that I think she's delusional if she thinks these dudes would've just bounced if none of these girls had cash to hand over.", "And we’ve found our narcissist for the hour. Yta"]}