{"id": 29673, "submission_id": "17gmwt4", "title": "AITA for not wanting my fiancés family to move in our new home", "selftext": "AITA for not wanting my fiancés family to live with us\n\nHello I (29) female and my fiancé (34) male are purchasing a home. His mother moved from Africa 2 years ago and has lived with him ever since. She works full time and is in great health. She is now sponsoring 5 of his siblings to come to America. The catch is she lives with him and has ever since she came to the US. I know in some cultures parents living with you is normal. I asked him that and he said it is not normal for a mother to live with her son. Maybe the daughter but she is not to live with the son. Well he wants her to move in with us to the new home and allow the other siblings to come in as well to our newly purchased home. Let me add we have 4 kids of our own to take care of.  She is really a nice woman granted but she serves him and does everything for him including cooking. I feel it’s a conflict of interest only because I can not be this fiancé or wife if his mother is doing all of my duties. He will eat her cooking before he eats mine due to it being more authentic. She has no motivation to get her own place for his siblings. She enjoys living off of him rent free. I tried to tell him it’s getting to the point where they are using him because he pays all the bills. She is bringing more siblings here and sadly to say doesn’t even have her own place.   I spoke with him about not allowing them to move in and he felt like I was trying to put them out or I disliked them. I am picking up the slack of his parenting due to him trying to take care of them. I won’t be able to have adult time comfortably with him with his mother in the next room or walk around my home comfortably seeing someone is always in our home. A lot of people at that. I don’t want to start off my marriage living with his mother & 5 siblings. (3 adults 2 children) I don’t want to seem rude or hateful. I just want to enjoy my home & family without 6 extra people we are responsible for taking care of. Am I the asshole for not wanting his mother and siblings to move in with us?", "created_utc": 1698289563, "permalink": "/r/AmItheAsshole/comments/17gmwt4/aita_for_not_wanting_my_fiancés_family_to_move_in/", "score": 605, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action I took that may make me look like an asshole was telling him I don’t want to live with his family and I feel they are using him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", " NTA,  maybe it is a good time to make a decision as to whether or not you want this man for marriage.  He is happy having his mother be his mother.  You will never cook as good, not that you aren’t able but no one cooks like mom.  You already have 4 kids but you didn’t say whose they are so that is hard to have an opinion on. \n\nIt certainly is not fair for him to expect you to contribute financially for all those other people.  Mommy needs to find another house or you need a new fiancé?", "NTA, but this is almost certainly a make or break point with your fiancé. If you're not okay with this, you should end the engagement. There is absolutely no chance that a mother planning to move five of her kids to the US is going to be okay with you saying she needs to support herself and those are all your fiancés siblings.", "INFO: who's footing the bill for the other family members to immigrate to the US? Does your fiance know that there's a minimum amount he has to make in order for the family to be sponsored? If his mother has applied for them, it's doubtful she makes enough due to her household size already, and will need a co-sponsor, which sounds like it would be your husband. Does he know he would be responsible for them for 10 years? Are you ok with this?", "NTA but I'd question marriage under these circumstances.", "Walk him through the numbers about what happens if you divorce him and get child support.  NTA", "NTA. Set your boundaries now, and enforce them, because once they move in, it seems like they have no intention of moving on.", "You are definitely NTA. I do worry for you though. Your fiancé should be putting a stop to this, but I’m sure he is struggling with a sense of responsibility to his siblings. But regardless, he has to understand that your marriage is going to be doomed before it even begins if he is prioritizing everyone else over you. If he can’t or doesn’t want to do that, he shouldn’t be getting married.", "info:\n\nHis mom has always lived with him.  Did your fiancee say that would ever change?\n\nHow long have you two been engaged?\n\nDoes hi mom help with your 4 kids?\n\nDid your fiance explain when You met him, that his and his mother's plans was to sponsor his siblings?\n\nEdited to add: NTA", "NTA… definitely hold off on purchasing that home if you can and you are going to have to sit down and have a serious conversation with him and tell him you are not comfortable with and do not want his family to move in with you guys. If that is a hang up you are better to just call it a quits now before you guilt yourself into a situation that is going to start breading resentment and cause issues later down the line. You my even have to give him an ultimatum and go from there. But seriously don’t force yourself into situation unless you are 100% comfortable with the outcome. If you have doubts it better to pause and serious think that to ignore your gut and regret it later.", "Tbd. I’m curious what part of Africa his remaining siblings are trying immigrate from? Is it a dangerous place?", "Absolutely NTA. But do not get married until your boundaries with your future husband are established.", "NTA if your husband does not stand up for you he never will and his family will never leave; while your kids will suffer loss of his attention, affection and loss of finances.\n\nI would give him an ultimatum and stick to it. What is the family’s motivation to move out of a rent free house with meals. Perhaps if it is sold as part of the divorce and their gravy train dries up. I’m not trying to scare you; it’s just concerning how he’s completely ignoring your wants.", "NTA for how you feel, but I’d put the brakes on this deal. His mom isn’t going anywhere and his entire extended family will be living with him.", "NTA. You definitely have enough on your plate without having to be concerned with his mother living with you and your family. She’s sounds overbearing and if it comes down to it, he may not bend on living with her and since she’s adding more family to the mix, he’s already on board .", "I would be out of my mind if I had 6 other people living in my house.  I would certainly reconsider buying a house with your boyfriend.  You should have a talk with your SO and ask him to make plans for his mother to move out as she has overstayed her welcome.  And then let her take care of the others, if that's even possible.", "NTA. But now you have to decide if you can continue to be 2nd class citizen in your own home. The first step is to file for child support, then once you’ve got the ball rolling you will have to find somewhere else for you and your children to live. Don’t have any more children with this man. Have you considered that you have effectively become his nanny/ bangmaid? Take a step back and look at your life from the outside. What would you say to someone in your situation? Wake up and get a life for yourself. Come on Girl!!", "If his mother is sponsoring 5 siblings she must be well off financially, or is your fiancé a cosponsor for your mother?", "Absolutely not, protect your peace", "NTA. It's not fair to you to be a single parent because he is too busy with his family. And unless you have a mansion, I don't see how a house would be big enough to comfortably accommodate 12 people!", "NTA. It's entirely reasonable for you to have concerns about your fiance's mother and five siblings moving into your newly purchased home, especially when you already have four children to take care of. This is a complex situation that requires open and honest communication between you and your fiance.  \nYour concerns about the potential strain on your marriage, your privacy, and your ability to enjoy your new home are valid. It's essential to maintain boundaries and create a living situation that is comfortable for both of you. It's not about disliking his family but about ensuring that your family's dynamics are healthy and sustainable.  \nHave a calm and respectful conversation with your fiance to express your worries and feelings. Try to find a compromise that takes into account both your needs and his family's situation. It's important to make decisions together that work for your family unit, and this might involve finding alternative housing solutions for his mother and siblings that don't place an undue burden on you and your children.", "NTA.\n\nI  would nooot marry a guy who does not respect my wishes regarding who gets to live in my home.\n\nAt the same time, i understand that starting out in a new country can be difficult. And they need somewhere to start out. Even if the mother got a place of her own, she couldn't afford feeding 5 extra people most likely, until someone else gets a job.\n\nSo i would probably suggest you set a \"Move in and move out date\" for them - like 6 months. And say that if they dont move out, you will.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAITA for not wanting my fiancés family to live with us\n\nHello I (29) female and my fiancé (34) male are purchasing a home. His mother moved from Africa 2 years ago and has lived with him ever since. She works full time and is in great health. She is now sponsoring 5 of his siblings to come to America. The catch is she lives with him and has ever since she came to the US. I know in some cultures parents living with you is normal. I asked him that and he said it is not normal for a mother to live with her son. Maybe the daughter but she is not to live with the son. Well he wants her to move in with us to the new home and allow the other siblings to come in as well to our newly purchased home. Let me add we have 4 kids of our own to take care of.  She is really a nice woman granted but she serves him and does everything for him including cooking. I feel it’s a conflict of interest only because I can not be this fiancé or wife if his mother is doing all of my duties. He will eat his cooking before he eats mine due to it being more authentic. She has no motivation to get her own place for his siblings. She enjoys living off of him rent free. I tried to tell him it’s getting to the point where they are using him because he pays all the bills. She is bringing more siblings here and sadly to say doesn’t even have her own place.   I spoke with him about not allowing them to move in and he felt like I was trying to put them out or I disliked them. I am picking up the slack of his parenting due to him trying to take care of them. I won’t be able to have adult time comfortably with him with his mother in the next room or walk around my home comfortably seeing someone is always in our home. A lot of people at that. I don’t want to start off my marriage living with his mother & 5 siblings. (3 adults 2 children) I don’t want to seem rude or hateful. I just want to enjoy my home & family without 6 extra people we are responsible for taking care of. Am I the asshole for not wanting his mother and siblings to move in with us?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. this is not going to be a sustainable situation. It may be normal for them but it would significantly cramp your living situation and add power dynamics that you will not enjoy. You will no longer be the co-captain of your own house, he will defer to her and expect by proxy that you are too. I dont know how you didn't know this was coming but its not a sustainable situation. If you want to keep your relationship you will have to accept it and the unfortunate impacts it will have on you. He apparently is OK with it and is ready to put you at a disadvantage in order to support his larger family as he believes he is expected to do. It truly sounds like a great time when it's going good, but potentially a nightmare many other times. This sounds royally fuct. Tell him to man up, go make that crazy good money and support this plan elsewhere. Not saying kick him out but there needs to be boundaries or you're just delaying the inevitable disaster crisis. So very sorry :(", "NTA... he wants his mom and his wife because he wants all the work to be done for him. You will definitely be lower on the priority list and it will eventually ruin your relationship.  This should be your hill to fight on. Say no", "Nta. \n\nMaybe explain this way.\n\nI love mil but I need my home to be mine. If she is living here, then it's hers, and you have shown you choose her over me every time. I can't cook or clean, I can not make my home mine as she is the one you are letting run the house. I get no time to myself. I am taling on more parenting duty because you spend all your free time for her. \n\nI understand you wish to help your family, but I and our children are the family you CHOSE to have. We are not even first in your thoughts. We are not put first in our needs. \n\nI did not marry you to be a bedwarmer. To be a guest in my OWN home. And this is how it is. And now you want to add more people to our home. What of your children then? Less time as you help everyone else. \n\nI am sorry, but you are not listening to me and my feelings. Instead, you turn it to I don't like them. You need to listen that I need this from you. If you can not give me this, then it's time for a break from our relationship. It's time for therapy while I and the children get our own place. Because I refuse to not have them put before all others. I refuse to be a guest in my own home. I refuse to be pressured and guilted into letting more family move in. \n\nSo you need to think long and hard. Are my and the children's needs more important than you supporting extended family? Do you love us enough to give us what we need? Or will you continue to have your mother as your wife in all but the bedroom and expect me to accept that?\n\n\nHun it's time for the serious talk. It's time to make him decide if you and the kids' needs are going to be put first. It's time to be ready and willing to walk away with the kids if he refuses. Because all this is teaching your kids is MIL comes before everyone else. That their aunts/uncles will be more important. That they get whatever scraps are left of attention. And that is what will happen. His focus will be to help them adjust and whatever else and your kids will suffer. They will see they are not important. Not loved by their dad. They will grow up thinking this is ok and they deserve it. Unless you become a mama bear and show that this is not acceptable. You and the kids are important. That you refuse to let others make them feel less. From even their father. \n\nSo it's time for you to think and decide. What are you willing to put up with and accept. What line are you willing to draw and follow through on. If you are not willing to walk away, then honestly, he has shown his mom is first in his life, and you should give in and try and shield the kids as best you can. If you are willing to walk away you need to make sure he knows that you will do so and make sure he knows that you will take him to court for everything you can because mommas boy needs to grow up. That you will find a true man to love and support you and the kids both emotionally and mentally. Because you deserve that.", "You knew about his relationship with his mum before you married him and had kids.  \nWhy did you choose to have kids and buy a house with him ?", "YTA if you purchase a home with him and marry him.  Mom is staying, he wants mom to stay.  No way to know when or if his siblings will move out.\n\nHe is showing you who he truly is and how he will treat you and the kids.  He didn’t consult you before telling his mom she can move in to your new joint home, nor before he told her to bring his siblings.  A real partner would recognize he must discuss these matters with you. He neglects his children to attend to his mom.  His money goes first to his mom and siblings.  He doesn’t treat you with respect or love BEFORE you buy the house and move in and get married.  This will only get worse AFTER you buy the house.  He prioritizes his mom and siblings over you and his own children.\n He isn’t a good partner or a good dad, and you know you want both qualities in a man.", "NTA! Heeellll no. Unfortunately this might be a very difficult fight with both your husband and his mom.", "NTA", "NTA. You need to put yourself your kids and your sanity before your fiancé’s family. You shouldn’t buy a home yet. He will always be his mother’s boy. His mother will take over your everyday’s life, and the stress place upon your kids is it worth their happiness and yours?", "Nta sounds like absolute hell", "NTA.  Of course, he wants mom to live with him since she does everything.  And as you stated, she's happy because your fiance is paying for everything. \n\nIt's natural and normal for you to want a home for your family without all the extended members.  If that's what you really want, hit the pause button.  Now.\n\nDo not continue with the purchase of a new home, and don't proceed with marrying until you sit down with your fiance, hash things out, and get on the same page. Going forward before the situation is resolved is not a smart idea.\n\nYour fiance's mom has made it clear she has no intention of living on her own, and he's fine with that. Buying a house now is just going to leave you stuck.", "NTA. You need to decide for yourself if you really want to stay with him or not. Your fiancé seems that he will always put his mother above you so you have a lot of thinking to do.", "NAH\nThis could be a cultural difference. He prioritizes family, your extended family if you marry him. This is his mom and his siblings. His mom has lived with him since she came to this country. What made you think he would change with marriage? In a sense, THEY are his immediate family while you are potential family. You are not in agreement that a nuclear family of you, him, and your children IS the ideal situation. You both have strong reasons for feeling the way you do.\n\nI don't think expecting him to shift his perception of immediate family from what it is to matching yours is realistic. There's a significant incompatibility here. Neither of you will be happy if you give up your position and align your life with your partner's. You would be overwhelmed, overcrowded and have no privacy or real control over your household's routines and boundaries. He would feel selfish and cruel, abandoning his mom and sibs to live his own comfortable life with you and the kids while the rest of his family struggles.\n\nI think it was unwise to buy a house together when this glaring incompatibility has been there all along. Were you expecting him to change so drastically? Did you think you'd force him to your preference using the house or marriage as your leverage?", "NTA but you should set it with him long time a go.", "NTA. If you haven’t purchased a home together yet I would have a very serious conversation with your fiancé about this. Your at a point where you can explain that you aren’t willing to living with his mother and siblings. You don’t really have to have a reason you just don’t want to do to it so the choice would appear that he buys a house with you or stays where he is. I don’t think that’s is one to make any concessions over.", "NTA\n\nBut do you truly want to marry someone far more beholden to his family than his future wife. And it will only get worse and be more demanding and entitled after marriage.\n\nGranted, the is from a US/western perspective, but the path you’re following now feels unbearable to most of us. \n\nI don’t mean that as judgmental - only that I greatly sympathize with your situation if you really don’t have a choice per made up “customs”. I hope you’re ok.", "NTA and I'd think twice about marrying him.\n\nFYI when you sponsor relatives (if in the US, you don't say where you are) you usually have to be financially willing to take care if them if necessary (they can't get any benefits) as part of the agreement.  How is his mother able to sponsor all these folks?  Also, these days that can take YEARS.  Are you sure they're not just coming to \"visit\" and plan to overstay their visas?  Again, if not the US I may be way off here.  I wish countries were given in all posts, quite honestly.", "NTA whatever you decide you need to talk to your fiancé", "Wait, you have 4 children with this man, yet he still lives with his mother and not with you and your 4 children?  Am I misunderstanding this?\n\nIf this is, indeed, true, then your BF's commitment is to his mother, and now to his siblings, far exceeds his commitment to you and the children you've created together.  \n\nThe notion that you're supposed to have six people in addition to your FH and the 4 children is when you don't want that is ridiculous.  This level of disrespect of your desires is pretty far over the top.\n\nIf your BF wanted to live with you and have that intimacy, he would already live with you, not his mother.  \n\nGet out.  Get out now.  And get to court and get some court-ordered child support before he also has the burden of supporting not only his mother but 5 additional people.  \n\nNTA!", "I have 2 from a previous relationship and we have 2 together", "I dont think its the mom lol", "We got engaged this past march. When she originally came it was supposed to be short term until she was able to get on her feet. Now she is financially stable nothing has changed. She doesn’t help out with the children often at all. \nWe never spoke of his family migrating here until we got pregnant with our first child. Then that’s when the talk of his mother coming was brought up. I was okay with his mother coming to America for a better life but now it’s been 2 years at least and she has no motivation to be independent.", "No it’s not dangerous. They are from Congo but very far away from Goma where everything is going on.", "This is a big ask of him.  I certainly would take some time alone with your kids and have a very open talk about it with them, several times.  It will affect them greatly.  You have to be sure that this arrangement won’t impact your children’s lives in a negative ways.  Just two new siblings will be a big adjustment for all four kids.  Then for more to trickle into the mix?  Five more siblings (who’s siblings, grown or kids, ages, genders). That is 12 people living in a house.  How many rooms and who will have to share?  Do you know any of these things?  These are essentially strangers to you and your kids.  Moving to where you are, are they culturally aware of the changes or how things work?  How much support are you going to be expected to provide for these people? \n\nMaybe move inwith them for a while before buying a house to see how it goes, before the others arrive.  Ask for a year trial before making a marriage and buying a house.  \n\n Am not trying to rain on your parade.  I am just trying to be helpful.  This is a really big deal and I truly wish you all the best.   I hope I have helped some.", ">We never spoke of his family migrating here until we got pregnant with our first child. \n\nSo... once he baby-trapped you?", "His mother is never going to leave, this is a fact, and your fiancé will be responsible for his entire family for 10 years. Get out while you can", "Your fiancé has no motivation to be independent either.", "I don’t think Yta for having those feelings…but I don’t think you have the high ground here, and I don’t see any way for you to achieve your goal in the short term without it eventually coming to an ultimatum where your fiancé has to choose between you and his mother/siblings.", "Girl why are you on here wasting people's time knowing you're gonna stay with him and this is going to happen anyway?", "Girl your in trouble!!!!\n\nI am african, its ok for mothers to live with their sons.....but daughter nope( culture thing, it is assumed girls get marriend, and and wifes parents can not live with their inlaws, its shame t\nBut your husband is seen as a bread winner ( of his mothers family) they will depend on him, even if they are adukts if you don't put your foot down.\n\nAnd when they move in with you believe me the troubles will start......\n\nAnd you say she's cooking for him? That means there is a competition..... and you will never win against her never....\n\nAfrican man ( most of them) always choose their mother first before their wives..........", "NTA. How is it that it's your home (and your fiancé's) but in the ranking of who has the the right to make decisions & be comfortable in your own home, you matter far last? Is he really that fine with your being inconvenient? Also, in case of potential conflicts in a house, are you certain he would take your side?", "you have 4 kids and he wants to move all those people into your house as well? this sounds like a rather big receipt for desaster. **especially reading this:** spoke with him about not allowing them to move in and he felt like I was trying to put them out or I disliked them. I am picking up the slack of his parenting due to him trying to take care of them**. NTA**", "Don’t buy a house with him. His family will never leave his home. Mom is the gateway for immigration. Which is fine, everyone needs a sponsor and help getting settled. But if this is not the lifestyle you want don’t buy a home with him.", "Well, your options are:\n\n1. You all move in together\n2. You and your husband move together without the MIL and siblings\n3. You get divorced\n\nI'm pretty certain 2 isn't happening, so you've got a big decision to make. I'll be honest, you having 4 kids, you're pretty trapped at present.\n\nNTA, but you shouldn't have let it get this far.", "Call off the wedding and the purchase of the new home.  Yesterday!  Then run!", "NTA\n\n📣🚩🚩🚩🚩🚩\n\nYou will simultaneously be paying the bills and the least valued member of the household.", "YTA for not understanding what you got yourself into before you got engaged to this guy. \n\nIn Africa is very common that families stay together.  Children are expected to look after siblings and parents, and they live together. \n\nHow in God's green earth was this not a topic of conversation before you got engaged or before you fell pregnant? Just a quick, by the by how do you guys do things over there?  \n\nWe can have a long debate about this, if it's wrong or right, but this would be exactly the same if you married most people outside of western culture.  Westerners forget that not all people on this planet think like them. \n\nI don't blame you for wanting things the way you want them but being so naive and not asking questions before all of this is what irks me.  This is a very important thing for people from Africa and you will not be able to convince him.  \n\nIf this is a big contention for you, I suggest moving on.  He will not change to the degree that you want.", "4 children at only 29 and with a man that selfish and immature? His family will never leave and he will be the one supporting ALL of them as he's doing already.RUN if you can but you don't seem to be very bright: You are screwed.", "ESH\n\nYou let her do all your cooking then complain? \n\nYou have four kids and that's a problem?\n\nYou can't tell me any of this is a surprise, four years later.", "29 with 4 kids. Insane.", "NTA because your feelings are justified, you arent asking for things that are unreasonable or extra needy.\n\nBUT and it is a big but, I would likely prioritise getting my family to the country Me and my Mom were in. Like you arent being rude or selfish, its just a case of relativity. Helping siblings come to a different country to give them a better life is a beautiful thing.\n\nI think you should be looking to compromise.\n\nLook for place with seperate dwellings. Like have a basement suite or something for you and your husband to have privacy, and let them take care of upstairs.\n\nTalk to him about what his plans are, be direct and fair, you understand how important getting his family to where you guys are is. You are willing to make sacrifices for him because you love him. But you also have wants and needs. When will your family of You, Him, and Your kids, be the focus? \n\nIf he sidesteps or doesnt want to answer or thinks your not being fair, while you are communicating in a healthy loving manner, then I feel bad for you and I hope it all works out.\n\n\nEDIT: Also you shouldnt say his family is using him unless you are sure that its negative like that. Supporting your family is life fulfilling.", "YTA It sounds as if this is a necessity.  You can't pay rent and sponsor 5 kids so you are asking your husband to not support his family and leave his siblings behind.  I think in this case you accepted a package deal.\n\nI think it's reasonable to set limits such as that they move out when 2 or 3 of them are financially independent, what alone time you do get etc  and set a goal in terms of years but it is unreasonable to ask him to basically abandon his family when they need him.\n\nOn the plus side I would think that you would be an integral part of the family if you did this with grace and accepted it is a 2-3 year period.  But I think it sounds like you aren't communicating openly with each other about this so I'm not sure how that is going to work out.", "NTA for not wanting to live with his extended family, you don’t seem like his priority & neither are your children. I definitely wouldn’t tie myself to a mortgage or marriage until you figure this out. Stop having anymore kids with him!", "NTA, first:don't buy a house until this is resolved. If you end up ending the relationship it will be much easier if you don't have a house together. It sounds like you will never be a priority in his life, his mom is. You have to decide if you're OK with that or not.", "NTA, it is totally unreasonable and unfair to expect you to be ok with that.", "NTA but this is probably a conversation that should have been had prior to the “shall we buy a house” one… maybe backtrack slightly…", "I am confused that you said you have 4 kids together but you live separately and it sounds like he is financially supporting his mother and soon will support 4 siblings. \n\nIs he the father of your kids? If so, he probably can’t support 10 people. You are going to be very poor if he is responsible for this many people. Do you work and support your kids now? \n\nIf he is going to support his mother and 4 siblings and all live with him, no way would I live with all of those people and support them. \n\nNTA. \n\nI personally would not be ok with this situation.", "Remember you marry him, you marry his family.  A house is cramped enough with 4 kids. I'm sorry, but what he's asking of you is ridiculous. NTA.", "NTA - the saying goes \"if he could, he would\" and in your case he is doing that for his mother, not you. He has priorities but you aren't included. \n\nReconsider your relationship because it's not going to change.", "NTA\nYou have a major culture clash. You need to decide if you want to live in a multi generation, extended family home forever as it appears that's what your husband expects. Don't buy a house together until you decide.", "You are so screwed.", "NTA- she has no plans of leaving….\nShe plans to mooch as long as possible she’s even bringing more family to take over your house", "You’re the meal ticket OP. \nThink hard about what you are getting into.", "HUGE RED FLAG, my advice to you is please do not purchase a home with him. Since he wants to house his entire family, he and his mum should purchase the property together, while if are able to afford it, get your own home and live there . How do you expect to live with 5 siblings in your new home? You need to put yourself and your kids first and also establish healthy boundaries with your partner, it's better for you to do all this now before you get married!", "Not easy being the 3rd person in a a marriage, based on what you have described your future fiancé has not grown up, this is the time to reconsider staying with him or moving on your own. I suggest you consider seeking professional family therapy to help you make an educated decision .\nVery good luck to you", "Nta. But this is a bigger issue. You have different views on what your married life will be. Is this waht you want, because cancelling a wedding is cheaper than divorce. I know it's easy to say leave than do it, but do you want you and your kids lives to be secondary to his mums and siblings? I understand your fiance doesn't want to turn away from his family, but your views on family life are different and may simply be incompatible", "It is clear you two have different priorities. It sounds as if neither of you wants to live by the others preferred lifestyle. It also sounds like a large % of his income is leaving the nuclear family to support his extended family. At a minimum, I would not sign a loan with him as you may be stuck with the payments when he decides to spend on the extended family. Also, keep you bank accounts and credit card accounts separate. Personally I would grow very resentful of the situation and the marriage would not survive. You have to decide if you can live his way and your wants don’t matter. If not, you should end this now and not move forward with purchasing a house together and marrying. NTA", "NTA.\nBut first this:\nIf you married him and he is (co) sponsoring his siblings then you are financially liable for them too, and will be for a long time. You can’t just sponsor for them to come to the US and not provide for them.. and if they make debts then you are also liable.. so ask yourself if you want this financial burden having 4 kids already. It can bankrupt you and make your life financial hell!!\nAlso I don’t think your fiancé is ever going to be ok with not living with him mom and not sponsoring his siblings.. so you need to make a difficult choice", "Run, how old are these siblings sounds like you are going to be stuck with a load of leaches taking all your money. I am guessing they are all adults. Who’s financially sponsoring all these siblings. Not to be unkind but I assume your an American citizen and he wasn’t.", "Why did you have one let alone TWO kids with him?!\n\nPull the brakes on EVERYTHING & get out. Pretty sure he’s only sleeping with you because most societies frown on sons & mothers sleeping together. \n\nIt’s Oedipus Rex in the flesh!", "Good grief!!!!   It sounds like you didn’t set boundaries in the beginning of this relationship.   It may be very hard to live in a new home with so many extended family members moving in with you.  Only you know what you can live with.    However. I will say if this actually happens you need to accept that you won’t have personal time, either with your partner or even alone time?", "Nta but it sounds like your not compatible, he isn’t going to change. It’s up to you if you can accept it or not", "\"I don’t want to start off my marriage living with his mother & 5 siblings.\"\n\n\"we have 4 kids of our own to take care of.\"\n\nIt sounds like for all practical purposes you already started off your marriage some time ago.", "NTA in any capacity, but I am willing to guess that both he and his mom are sponsoring the siblings as they’re financially responsible for a set number of years so that they don’t become of burden on the US (public assistance etc). \nThey may have to live with you for this and based on the wording of your post, you’re the only one who doesn’t know it. I’m an American born child of immigrants who was married to an immigrant so I have seen this play out firsthand. \nYou need to sit down with your partner and find out how involved he is in the process and you can go forward from there. Good luck", "NTA but this is also not the man for you. He has clearly indicated that his birth family will always come before any family you have together. Call off this marriage before it's too late. It will never change.", "NTA Good luck, I really have no advice. But I sympathize with you. I don't see this relationship lasting. Are any of these other people going to work. I'm getting claustrophobic just thinking how crowded it will be", "Simple do not buy a house with him. Move out with your kids. He can choose to live with you and marry you or choose to live with his mummy and siblings. NTA  but stop talking and act.\n\nYou are a mother of 4, 2 of the kids are from a prior marriage. Its your duty to protect them and give them a good upbringing - and not be crammed in a home with 6 other people fighting for attention from their dad/step dad.  Your first two kids will get even more lost in all this.  Move out or kick him out - absolutely do not buy a house with him or marry him.", "NTA- it’s not hateful to want your home for you, him and the kids. He was figuring that having children and then marrying you would trap you into supporting his entire extended family. Do not allow this, eventually, you will be pushed out of your own home and they will completely take over. They’ll make your life a living hell. He won’t care because his objective will be complete. I’ve seen it many times and if the woman complains, she is made out to be some sort of racist to make her back down or she gets kicked out/alienated till she leaves.  Magically, he and his family have the house you worked for.\n\nTell him you are not willing to get married or buy a home together if this is the path his choosing. I’m guessing being married, immigration will also take your finances into account. This is a hill to die on !!! Once here, it’ll be impossible to undo.", "NTA but he’s already told you basically what your life is gonna be like if you stay with him. He WILL choose his family .", "NTA but this marriage was clearly a mistake on your part.There should have been boundaries set right from the start OP.Leave and buy a house with ONLY your name on it.Stop funding this thankless family", "NTA. Do not marry this man. You will be responsible for ENTIRE family. They will consider you their servant and will be financially responsible for the expenses in their sponsorship and living while they are in this country.\n\nYou definately need to discuss this with your fiance and have him choose. Either you and your nuclear family or his family without you.\n\nThis is an invasion. You don't want you and your children to be collateral damage during the siege.", "NTA. Don’t buy the house with him , it’s a big mistake. He is a momma’s boy. Kids or no kids you will always come last . Think long and hard if you could truly live like this .", "My sister has a house with a guest house.  Dad and Mom lived there for years, and each had their privacy.  Is it possible to create a guest house or cottage  on a part of your property? It would separate the family units, and give you more privacy in your home.", "NTA is nope that too. dump mummy’s boy and get child support", "NTA how big is this house? It's you and your fiancé with 4 kids plus his mother and they want another 5 siblings coming? so that's 12 ppl and he's supposed to support them all? That feels like a cramped house. 4 kids plus you and he make s full house. That's a min of a 4 bed already where all those siblings supposed to go? 3 are adults right do they have jobs there them plus the mother should move into s place with 2 non adults. And your right with so many of them your children would get neglected I feel. I would sit down and talk long and hard", "NTA but I fear that you have arrived at a dead end. You won't be able to get mommy out of the house, same with the rest of his family. That's basically a given. You need to decide if you want to spend the rest of your life with his family around. Other than that I would strongly advise against buying a house together with him. That would have disaster written all over it.", "NTA.  Don't buy the house. Even if you put money towards it and you're on the deed, it will never be your house because his family will be moving in no matter what you say.  I would seriously reconsider the marriage also", "NTA but I see both sides\n\nYou guys are just not compatible. Your MIL cooking traditional food for him doesn't diminish you as a wife. See that as the blessing that it is. Sponsoring takes a long time so they are likely not going to move in next month.\n\nAre the 4 children bio kids of both you and him? Maybe it is time to walk away from this relationship as you are not culturally compatible", "NTA.  You may have to rethink this relationship.  His priority is his family and that family is not you and your children.  He's obviously not hearing you or just doesn't care.  You say you are \"purchasing\" a home.  It this process is not complete, then PLEASE stop, drop and roll.  You'll be locked into a house that you have no say in who lives there, no privacy and you'll be run ragged.  You and your fiance need to resolve his family issues before they just get bigger in the form of an additional 5 people living with you.  Good luck.", "Yes, this is what I wondered - who is on the immigration paperwork to sponsor all of these siblings? Is it Mom (with what money?) or husband? \n\nIf husband is the one who signed as sponsor, did he discuss it with OP or just do it on his own? That is a massive commitment and potential risk to their marital finances, and should definitely have been discussed with OP.", "He is the cosponsor and did this without speaking to me", "Maybe she wants permission to be angry?", "The thing is though, it’s not likely that they’ll move out. OP will never be the woman of the house. She’ll have no authority.", "Can you afford to buy a house by yourself? For just you and your 4kids? I don't think this man is ever gonna choose you. So you have to choose yourself and your kids. Don't buy a house with him.\n\nYTA to yourself if you continue with this relationship.\n\nEdit: After the siblings, it's gonna be extended family. Aunties, cousins, etc. You will never truly have the house to yourself.", "Please don’t buy a house with him and that arrangement will definitely impact your kids negatively.", "Don't buy anything with him until you solve this issue. Though I see an entire Forrest od red flags and can't imagine you didn't see any until now.\n\n\nNTA but make this a Hill to die on cause otherwise you will never have free reign in your own home", "Get a hobby. Jeez.", "It is not acceptable to put your kids through this chaos. Can you afford to live alone? Look into it. He’s telling you- you can handle his actual responsibilities while he takes care of adults who can care for themselves.", "Regarding “with what money?”: OP mentioned that she works full time, but pays no rent.", "So he lives with his mother not you? How does it work?", "Please do not buy a house with your fiancé. One of the requirements to sponsor an alien relative is having a place to live. If you buy that house your mother in-law and family will not leave for at least 10 years. The truth is she will never leave. Save yourself the headaches, heart aches, fights and stressful life that is ahead for your and your children. You and your children come first.", "It doesn't even feel like an ask to me, he seems like it's going to happen whether she wants it or not", "You are marrying into a family, and this is the culture of their family. If you don’t like it you will likely have to part ways.", "When you sponsor someone you have to prove you can support them financially for like 10 years or something. OPs mom would have to make like 6x what it costs to support someone (as defined by USCIS). So it's possible but unlikely", "Leave you mean?", "I wonder if him marrying you has an upside for the immigration paperwork. Is it easier I’d the sponsor is a married person? Just curious.", "I actually got it rock in the pit of my stomach when I read this story.  I genuinely feel bad for you. This relationship is never going to be what you want it to be. \n\nUnless, and until his mother moves out, you will not be his wife. She will. And why would he want to have her leave? She does everything for him, and takes care of him like he is a child. On the other hand, you will expect him to do his half of the household duties. As he should. There is no incentive for him to grow up when he is being treated like a baby himself. \n\nYou are not married yet, that’s a good thing. You may want to reconsider getting married to someone who does not consider your feelings on such an important and life-changing matter. If he intends to do what he wants, no matter what you think, that would be an untenable relationship for me. \n\n1. You will not be the woman of your own home. \n2. He will defer to her on major decisions. \n3. There are already seven people living in that house.  When his siblings come there will be 12. How will you have any privacy at all in your own home?\n4. He is trying to guilt and manipulate you. You can like his family just fine and not want them all living under your roof.  \n5.  How in the hell can you take on the financial responsibility of six extra people in this economy? You don’t mention what your financial situation is, you may be able to do so, and if so, good for you! But that is a lot of resources being taken away from your own core family.\n6.  His mother is fully aware that she sits higher on the list of priorities than you do. She felt comfortable enough to invite five other people to live in YOUR house. Because she feels that her sons house is more HER house than yours. It doesn’t sound as though she came to you and asked you how you would feel about it. That’s because she doesn’t care.\n\nI would be very clear with husband that not only are his siblings not moving in, his mother needs to go as well. This is a new chapter in your lives, and it is time to form your own family unit. If he is not on board with that then you have some big decisions to make.  One of you is going to be very unhappy in this relationship because your dreams and ideals for the future do not match up.", "NTA . OP , I'm African and I can assure you that your man is a mama's boy who will always chose his mummy before you. DO NOT BUY A HOUSE WITH THIS MAN AND DUMP HIM NOW!!!!", "As an African, all I’ll say is there’s a reason I do not gravitate towards certain African men. It is cultural to have your entire extended family living together in many different cultures in Africa. I was born and raised here therefore I could never do that hence why I do not waste my time risking a relationship with one. I do not think you’re the AH but I can’t really say he is entirely one too for believing what he does, cause again it’s cultural. \n\nI do not think this is someone you should marry though. This is already going downhill and it’ll only get harder from here. African in laws can be HARD, his mom might be nice but his siblings might not be. I would pull the plug if I were you.", "NTA - Nobody in their right mind would want their spouse's family living with them!\n\nBut it looks as if your boyfriend is a special kind of hobosexual - he's not looking for a home for himself, but for his family. I assume the house where he lives in now is too small for all those people, and he wants OP to pay for half of a huge house for all his relatives to live in.", "NTA, but your biggest mistake is staying with someone hoping things will get better. He is always going to choose his mom and siblings over you and your children. \n\nIf this is not the life you want to live, acknowledge that you made another mistake and move out. Don’t complicate things by going into debt together and having even more children with him", "Y T A to yourself if you A) buy a house with this guy B) have any more kids with him. In fact YTA to your kids right now since you let him not be a father to them. You and your kids will never ever be his priority. Never be in the top... what is is currently?... six? Soon to be even farther down the list.", "ESH- you have some hard decisions to make, OP. His family is coming to America and they are going to live in his house. Full stop. He is sponsoring them and has financially committed to that. Full stop. His mother will cook for the 7 of them (because it’s more authentic) and you and the children will either learn how to eat that cuisine or you will cook separately for you and the children. You get one guess who will clean it all. Your 2 biological children with the husband will be raised according to the African family’s heritage and culture. Your 2 children from before will be ignored in the same way you are. \n\nYour one question that you have to dig deep and answer yourself is this- if you and your two earlier children leave, can you support yourself on what you make? Because his children won’t be leaving and with that many co-sponsors, there will be no child support. Or, you stay there because of your two younger children and you and your two earlier children become second class citizens in your own home.", "ESH.\n\nWhy do you have 4 kids with a guy that you haven't married yet and who made it clear that his mother is staying with him permanently?  This is something that should have been discussed and decided at least 2 kids ago, preferrably 4 kids ago.", "It’s not a great situation but you knew from the start that his mother was living with him. Going further in your relationship knowing this was fully your choice.\n\nYou lost me… you said you have ‘4 kids of our own’. Who are the bio parents? Because you say about his family taking advisor him. I suspect those kids aren’t his bio kids. And if they are, you’ve known about him living with his mum so you can’t be surprised.\n\nIf you didn’t want this living situation then you shouldn’t have had kids with him. \n\nIf they’re not his bio kids then who’s paying for them? If he is then you’re also using him, like his family.", "NTA.\n\nKnew a lovely woman years ago ... grown daughter still keeps in touch with her. American born, Phd, federal employee. She became engaged to a Nigerian man (naturalized citizen). He planned to bring his \"family\" to the US. \n\nThey bought a small starter home together, married, honeymoon. The night they returned home from their honeymoon, his mother and all five sisters were already in the house. She was in shock; never talked about it, no hint whatsoever. He had no intention of allowing or forcing them to leave, so she did. Divorced ... never remarried. That was 15 yrs ago?\n\nUnless you plan on living with this situation the rest of your life you have a choice to make.", "What do you think you should be doing as his wife? You must cook and clean? What about him? \n\nDon't have a definitive answer here but also worth looking at it from different perspectives. How can she be an asset instead? I'd love if I had someone cook and clean and remove those jobs from me. \n\nYou're still a competent mother and wife even if you're not cooking and cleaning\n\nIn what ways is your husband taking care of his family? His mother sounds very self sufficient, working and doing the chores at home as well", "NTA\n\ndon’t marry this man, pull out of the house purchase as soon as possible. This will not end well and you will be financially worse as well as being mentally rundown", "NTA \nYou already know that you don’t want to do this. You already know that this is a terrible idea for your family. \n\nIf this is truly the life your fiancé desires, maybe it is time for you to both go your separate ways.", "That house purchase would be coming to a screeching halt. NTA", "NTA, but it's time to decide whether you really want to marry someone who will make major decisions (including financial ones) without allowing you input.\n\nI would not.", "NAH.\n\nThis is a communication issue and a compatibility issue. There's nothing wrong with what either of you wants. But it just doesn't fit together. So you really need to figure this out BEFORE getting married and buying a house.", "This is not going to work. NTA.", "At the end of the day, NTA for not wanting this arrangement for yourself. You are entitled to that. However, I would add that this is the norm of how people immigrate and are able to get a start in a new country. My dad immigrated and lived with my mom’s family for a while. Then my mom and dad bought a place, and my grandparents and 3 of his siblings lived with us. I have grown up with constantly having new relatives who have recently immigrated over the course of my life.", "I wouldn't buy a house with him", "NTA. No. I would put my foot down here. Time for her to be self sufficient or she shouldn’t be sponsoring others to come here.", "NTA\n\n&#x200B;\n\n\"Well he wants her to move in with us to the new home and allow the other siblings to come in as well to our newly purchased home. \" .. tell him the day they move in he will be served with divorce papers.", "NTA but you need to have a candid conversation with both of them about the expectations going forward.  If they’re both assuming that all the siblings will be living with you guys on top your own children…well good luck changing their minds.  You’ll have to decide what’s right for you, which means you might need to seriously consider ending the relationship and moving on if you can’t handle living with all of those people.\n\nI wouldn’t be able to.", "ESH. \n\nHow do you have kids with someone and are buying a house but haven't had the most basic conversations about compatibility. You both probably knew you weren't a good match years ago but you both thought you could bully the other into living your way. It's not going to happen. His family will stay forever and you will hate it forever.\n\nNext time, choose a partner who shares your lifestyle and goals.", "Nta. I wouldn't tolerate it. Not at all. It sounds like a recipe for disaster and he's the cook.", "You and him have different perspectives bcs you come from different cultures. If you aren’t willing to live in that situation, and from what you described it will continue and will be getting worse, then break up and move on. You can co-parent. Also is he a permanent resident in your country or will marriage with you provide him that? It’s weird to say the least that he mentioned his mom coming migrating to your country to live with him only after you had a child (baby trap?) and now mentions his siblings coming that you are abt to purchase a house and possibly get married. This seems suspicious and I would run from this relationship if I were you.", "NTA but I would break it off.", "NTA and are you sure fiancé isn’t signing off on these visas? They are for 10 years FYI - I can’t see MIL would make enough money to secure 5 visas", "NTA\n\nBut do not rush into buying a house with him. This is a hill to due on, not sharing your house with 11 other people. Five other people is still a lot.\n\nIf he will not agree, decide actions will you take on your own behalf. Will you move out with the children?\n\nBecause frankly, I think mommy can keep him. This is not a fair ask or fair of her to take over everything you want to do for him. If he picks mommy, let him stay with her, but don't you stay.", "NTA. You are entitled to your own life. You are purchasing a home, not running a hostel. Are you sure you want to marry this man?", "NTA. He planned and committed to this without your agreement.\n\nPlease **do not** buy a house with him. He's already shown he'll make decisions affecting your life without consulting you. A house will tie you to him financially and give him the physical space to house his siblings. It sounds like that was his plan all along.", "Given your description of the situation, I wouldn't have bought a house with him OP.   Now you're stuck with multiple people living with you and crowding you and invading your privacy plus you've got your interfering MIL.  Too late now to correct this. \n\nOP, there is zero reason for you to support and cater to three additional people in the household.  If he won't agree to the two of you and children only living in the home, you can do one of two things:  1) accept this situation or 2) tell him you want him to buy out your interest in the home as you have no intention of moving in and supporting a multitude of people.\n\nHe may not agree to buy you out and at that point, you need to pursue legal avenues to resolve this.", "Tell him if he wants his siblings to move in they have to pay rent. As does his mother. She can afford to sponsor 5 of her kids to come from another country she can afford to pay her way. Ask him who is he marrying. Does he understand what marriage entails? That HIS WIFE and CHILDREN come first. Not his mommy or his siblings. If he is not ready to do this say you will not buy a house with him where you have no say. He needs to get his priorities in order you and the kids not his mother and siblings. NTA", "YTA if you marry this momma's boy. He clearly is not ready for an adult relationship and if you purchase a home with him you will be running a chaotic zoo of humanity. So many red flags get out before it's too late.", "Not the Asshole...\n\nBut You need to stand up for yourself and your children..\nPut your foot down that No one will be moving in with you.\nIf he still does not get the point maybe it is time to leave.", "NTA, but think of how much time his mother might make free for you if she does the cooking and maybe helps you with chores, or in the garden, or with kids. As far as I understood, she is nice in general, so you and her might team up. You can also enjoy her authentic food. She might also look after your 4 kids when you and your hubby go on holidays. Whatever works for you. \nDon’t get me wrong, I personally would hate living with my own mother (I love her, but she is not an easy person, and neither am I), unless absolutely necessary, so I can understand your unwillingness. I am just looking for some positive opportunities, as your MIL seem to be a nice character.\n\nBut all the other 5 people she wants to get into the country should live separately. That’s a clear no.", "INFO\n\nThe mom came from Africa 2 years ago. How long have you been with your fiancé? Are the 4 kids his or from a previous relationship?\n\n> I don’t want to start off my marriage living with his mother & 5 siblings\n\nThen wait to get married and buy an home until everything is sorted. You don’t have any leverage to stop him from sponsoring his family members emigrating.", "NOPE NOPE NOPE RIGHT OUT OF THERE", "NTA\n\nBut you are the anchor baby for his whole family now. \n\nYou have a decision to make. Because he will keep fucking you and getting you with kids and bringing more and more people over putting YOUR citizenship on the line in addition to your family life and your financial security. \n\nUgh .", "NTA.\n\nAfter reading your comments as well as your original post, I think you need to pause both the wedding and buying a house together.\n\nHe's sprung this on you at times when you were vulnerable (pregnancy), constantly changed the goalposts (mother until on her feet, now mother without end, now increasing numbers of siblings), imposed a legal and financial burden on you without consent (cosponsor), and you will find it increasingly hard to escape the greater your entanglement becomes (via marriage and home ownership)... and your lack of agency or voice will keep getting worse.\n\nRight now, you need to halt both the marriage and new home plans so that you can take some time to decide what you want from your future. Don't proceed with either until you know exactly what you want from the life your fiance is inflicting upon you, what you'll actually get and how much you can tolerate the difference between the two. If you have any doubts, you need to address them and make your decision before marriage and home ownership make things even harder.", "Paragraphs", "NTAH but you’re not gonna win this one either. He may love you but everything that’s important to him is tied into his mother and his “other” family. He sees himself as the successful man of the family who receives ego stroking from his mother for providing the family a good life. Mom has no respect for you but tolerates your presence because you haven’t caused any problems for her or her children. Wake-up and see what is really going on in your life.", "NTA.  Ultimatum time.  Tell him it's his choice.  He can either live with his mommy and 5 siblings or he can live with you and the kids.  He can't have it both ways.  It's one or the other. This would be a hill to die on.  And don't give ANY money to this house without being married!!!  (I wouldn't marry this guy either).  Sound like it's going to be HIS house and you get no say so.", "NTA. But you made your bed...", "NTA. He went ahead and co-sponsored his family without consulting you. No to purchasing a house with him.", "NTA - do not marry him or purchase a home with him if this is what he wants to do.  This is not a good situation for you or your kids.", "Definitely NTA. If you are a part owner in the new property then stick your foot down and say NO.  You are not accommodation outlet for his family.  You are under no obligation to provide somewhere for them to stay.  His mother is an adult who can sort out her own accommodation.  His family can also get their own accommodation and pay three own way if they are trying to move to your country.  Stick your foot down on this and a big line in the sand.  Otherwise you may wish to reconsider both buying a place together and getting married.", "Nta but very naive. You got honey dicked by a black mamba straight out of Africa. He's going to do whatever he wants. Your gonna either have to leave or accept it. But that man is gonna do what he wants.", "NTA That’s a heck of a lot of people in one house. I could never do it and stay sane 😬", "I’m guessing you are not from Africa (neither am I) but I am close to the culture. His family is coming to live with you but will not be permanent. They will get job, established and move out and his mom will most likely go with the family who needs her assistance.  You have to pick and choose your battles.  You didn’t marry a family, you married a community, everyone will have a role; laundry, cooking, cleaning, school, transportation…. Speak to your husband or friend and get an idea of what to expect. Also if mom cooking, let her!  It’s most likely her love language and the role she has in the family. Don’t take it as an insult.", "NTA. Girl... this is not a time to walk. You need to be **full on sprinting** away from this dumpster fire of a relationship. YOU WILL NEVER BE PUT FIRST. YOUR CHILDREN WILL NEVER BE PUT FIRST. Think hard on that. Is that the kind of life you want for you all? This sounds absolutely miserable!", "Stop. Stop purchasing a home with him don’t get married to him… We have the culture where he’s expected to support his family which is fine, but if that’s not what you want then you’re not compatible", "NTA.  But honestly, you should have seen this coming from the very beginning.  Do you want to marry into this?", "Are you African? If not, you need to carefully consider what a cross cultural relationship with this man would look like.\n\nYes, you are expected to live with the mother and/or the siblings. Depending on his culture. it's not even a question about not doing this. You need to find out what other cultural expectations there are and if you can live comfortably with them.  You need to have some serious talks before committing to marriage. Are the 4 kids both yours? Did you not talk about cultural expectations before you had them?", "Do not purchase a home with him. You two do not have the same needs and expectations. He wants to have *12* people in the house? That's definitely way too much to accept if you don't want it. And you don't. You're better off getting child support for your 4 children and letting him come visit when he wants to. If you put your money into buying a house for his family, they will never need to leave, because he doesn'twant them to. And if anything happens that changes his ability to earn, you'll be financially responsible for everyone, plus the mortgage and home maintenance. Don't do it. Lock down your finances. \n\nNTA.", "NTA but let me just say this: your wife \"duties\" towards him are not cook or clean... your duties are to respect and care... not feed him.", "I will never understand why people don’t sit down before they marry and go over expectations and literally write them down so they can show their spouse what was discussed.", "Please do not sign for a loan on a house with this man. He’s using you and your money to get his family here. He’s already \nlet you know he doesn’t respect you by allowing his mom to stay and putting her first. So many red flags. 🚩🚩🚩🚩 get out of the engagement and run!", "He trapped you", "100% do nor marry him. Do not purchase this house with him. His family comes with him and always will. It is indeed the cultural norm for many men from Africa who move to North America.  And there is nothing wrong with that. But this man has lied to you. He will be supporting his whole family, and his mother will never move out. You need to decide what you need in a relationship.  NTA", "NTA because you don't want her to move in, but why is he still your fiancé? This is not going to change and will be a sore spot for you or him going forward. If she stays, you will be upset. If she leaves, he will be upset. Time to move on.", "Are you in process of buying or have you already bought the house?  It's unclear from your post if you are currently living with your fiance--you mention his mom has been living with \"him\" for two years rather that \"you\". \n\nHow many bedrooms does this house have?  Whose names are on the deed to the house (if you've already bought it.  Who paid the downpayment and how will you be splitting the household expenses?  \n\nIf you haven't completed the purchase of the house put the brakes on that until this is settled.  \n\nI don't see any version of this that ends well for you and your kids.", "NTA but this may be the make or break point for your marriage. Between the two of you, 4 children, his mother, and his 5 siblings, that's 12 people he's planning for the two of you to support. (His mother is working but you say she enjoys living with him rent free. Do you think she will help you with with your kids or with household chores?)", "NTA, also, it sounds like youre not changing his mind. this is HIS mom so hes going to help her. \n\nGirl, personally, I would leave. If you have enough to go half's on a house with him then take your half and RUN. Get a cute apartment, a town house and leave. \n\nPut him on child support - that way he HAS to make time for his kids, and you'll be much happier I think.", "You are not the AH. Take your kids and get your own place. Your husband and his family are so unreasonable that there are no words to describe their entitlement. How in the world did you make 4 children with this guy? Were there not any clues that he would do this?", "NTA, I’m curious as to how they can afford the costs involved in this. Not just housing the sibs, but legal costs and all that, PLUS the costs of children. Is it financially feasible? Is getting a second place for mom an option?", "Break up with this man and sue him for child support.\n\nRight now you are signing up for living in hell. MIL and all those siblings will never move out. Husband will prioritize them rather than you and your kids. You will resent them all. You will hate your life. A decade from now you will be seeking therapy for depression and going through an expensive divorce.\n\nRun while you can. If you stay, your life will only get worse and worse from now on.", "Don’t continue this relationship. It isn’t going to work. You aren’t compatible especially when it comes to family and culture and you will never have control of your house. NTA. Time to prioritize you and your kids", "Her living with you and not having sexy time, is the lest of your worries.  You said \"sponsoring.\"  From what I understand that means your 100% responsible for them.  Google it, but.. it would be a hard no from me...  You might actually  be better of living in to different homes or just separating..  If you work, separate your finances asap", "No matter who you are, 11 people under one roof is way too damn many.\n\nEdit:  Or is it 12?  Double digits = too many", "NTA who WOULD want 6 other people moving into their home?  If they move in, they will never leave, and I don't see how there's a place for you in this relationship/family.", "NTA.  Do not do this!!  This is a recipe for disaster and you will be the odd one out in all situations in your own home.\n\nReconsider this whole relationship and consider keeping this man as a fiancee and not a husband.  Speaking for myself, there is no way in hell I would commingle my finances or assets with this man.  Marry him and you may find yourself financially responsible to support his entire family.\n\nAnd no, a prenup will not protect you, courts throw them out at will.  Your best self protection is to not marry this man his baggage is cumbersome and it will drag your life down to a daily grind.\n\nHe will go along with your way for now but once the marriage is done and he is the husband, things will change….they always do.", "5 Years, 10 years down the road, where do you envision yourself if you let his Mother and siblings and random family members move in. If what you see upsets you, then you know you need to either put your foot down or call off this relationship..  NTA", "How does you have 4 kids in 2 years?", "Idiot", "NTA\n\nThis sort of expectation would put any marriage plans on hold. No freaking way I am letting 7 people move in to my home.  I need peace and there would be none in that situation.", "NTA\n\nShe needs to get her own act together.", "NTA maybe you need to find a duplex or a house with a suite in the basement do you can run separate households. Then set visiting hours.", "NTA!\n\nThat is a LOT of people. How big is this house?? I've also recently learned that if you sponsor someone to come to the US, you are responsible for all they do, and that includes financially. Does your fiancée know this? What is his expectation? Because it would be bonkers to go into arrangement without a LOT of boundaries being set and a time line for when they are going to get jobs, their own places, etc. \n\nNah bruh. They gotta go somewhere else. Mom is one thing, but 5 other whole people? And you already have 4 kids?? There definitely needs to be conversation about expectations about your future lives together BEFORE you are legally tied to this man.", "NTA\n\nHaving 6 additional people, in addition to your own family is a problem. \n\nHe needs to decide, you and the children, or his mother and siblings.\n\nIf he won't choose you and the children, then DO NOT sign the closing documents on the house, find your own home, and sue him for child support.", "Agreed, and adding: the most unromatic thing about marriage is the fact that it is a contract.  The fiance is now attempting to modify that contract in a massive way.  It's not what OP signed up for.  OP needs to find another fiance because she'll never have equal footing in this marriage.  At best it's 2 against 1.  At worst, it's 7 against 1.  NTA.", "This. NTA, but this.", "6+ 4 kids and the fiance so 12 people including OP", ">Are you sure they're not just coming to \"visit\" and plan to overstay their visas?\n\nI wondered that myself.  Unless OP's fiance is very well off financially he wouldn't be able to sponsor five people.", "Are they even married? She calls him her fiancé.", " *You got honey dicked by a black mamba straight out of Africa.*\n\nExcuse me?", "I understand culture. I really do. It is just it now has started to take away from our family and the support he is providing to us.", "Household chores yes she will help. We ended up having to pay to put our children in daycare and after school programs due to them not wanting to watch the children any longer. She has no desire to learn how to drive to assist in picking them up or dropping them off at school. She will watch them every once in a blue moon.  When we  originally spoke of him sponsoring her years back it was to come for a better life and help with the children. She stated she wanted to be an active part and help but it has been nothing but the opposite.", "Our finances are separate and maybe I’m wrong but I am 90% sure he is paying all the fees if not all sold for his siblings documents and paperwork He spent $4000 on plane tickets for his sister after she won the visa lottery and was upset that I was upset.", "I said she has lived here 2 years not I had 4 kids in 2 years", "If you let mil move in then she will have the siblings over all day long and her and husband will claim the house is hers too so she can have people over whenever she wants. \n\nYou need to drop the relationship and focus on you and the kids. \n\nYour husband doesn't want to live with you or Tae care of you and the kids. \n\nYou really need to think if you want to keep living like this. You let mil in they will all come. \n\nIt's your house not hers. She can live on her own.", "You may consider cutting your loses. It may sound callous, but when those siblings !I've in with you and anything happens especially health wise or otherwise its going to fall on the household and mom seems very content to let that happen. You will also never be apart of the decision making if he makes these life changing decisions without your input. If she's a grandmother and not helping out with the kids what's the point. Your going to continue to incur more loss than gains in that relationship. Best not to make it permanent instead of changing it while you can. What would happen if you were on your own and he has the household responsibility of mom and his siblings? Maybe a trial basis like that before the marriage is a good idea!", "will you have room for all of these people? without sacrificing space for your own kids?", "And nothing will change.  Don't get married.  Don't sign anything, not on a house, not on a marriage license, not for any loans.", "Bestie while in this situation you're NTA you're a big TA to yourself having a second kid with this man *knowing he already has plans to pull shit on you*", "No buying a home. No marriage. Just no.", "You should not marry him if he is cosponsoring anyone, let alone 5 people. He is financially on the hook for them for years. It could destroy his finances and you could lose your home. \n\nMarrying this man is not a financially smart decision.", "😳\n\nGet out.  Get a lawyer.  Do not sign anything with this man.", "Once you marry him he will make his family your responsibility, he already doesn’t help with the kids…like literally what benefit is there to even being with him", "Done. That’s a form of cheating. He was unfaithful to you and betrayed you by cosponsoring relatives behind your back. If you marry, you will be equally responsible for these relatives, any and all debts brought into the marriage and accumulated during the marriage. As many have also commented, this should be your hill to die on. Cosponsoring behind your back will not be the only thing he will do without consulting you. It’s not fair for you’re children to live in a house of 12+ people that are essentially strangers.", "How are you engaged to this person? His family is the most important thing, not you or your children. He’s T A and you know where you stand but what are you going to do now?", "Yeah, this isn't a situation you want to be stuck in.   Don't marry, don't buy a house with him.", "Have you already purchased the house or is in just in process?", ">to see how it goes\n\nshe already knows how it's going to go. even just his mother, she'll be the mistress he sleeps with while mommy and son play husband and wife. she's going to be the outsider in her own home.", "Or he assumed this was obvious the same way she assumed the opposite was obvious. No need to trap anyone, just 2 people not understanding that cultural and familial expectations aren't universal.", "Maybe she's marrying him.  Maybe after reading some of these comments, she'll realize that's a terrible idea.", "She said its not part of the culture. She asked hi", "yeah, that would be my concern- that Fiance signed as cosponsor.", "Op just confirmed further down that yup, fiance is the cosponsor and did it without her knowledge or approval clearly.\n\nOp also wrote that the discussion on his family coming to the states didn't occur until she was pregnant with baby #1. That's when he broached the subject.", "This is why he wants to marry her, it sets the hook in deep.  She’s already been caught and doesn’t even know it.", "oy. just oy."]}