{"id": 29711, "submission_id": "17gwk90", "title": "WIBTA if I asked my future SIL to take off her noise cancelling headphones for our wedding photos?", "selftext": "Basically what's in the title.\n\nThe wedding is next year but we are knee-deep in planning just now, and I'm in discussion with our photographer on what type of shots we want to have. Our FSIL will be in some of the family shots, and she usually wears very large noise-cancelling headphones when she leaves the house because she can sometimes find noise quite overstimulating. (AFAIK she has not been diagnosed with autism, she has FND).\n\nI'm worried that the headphones would stand out too much in the posed family photos, so I floated the idea to my fiance of asking if she would be able to remove them for that short period of time (I'm not sure how long it would take but I'm guessing aproximately 5 minutes). He said he would feel very uncomfortable asking her to remove them as they are a disability aid - I replied to say I would be happy to facilitate this discussion with her and ask if she could maybe use earplugs, or if we could find smaller headphones that maybe aren't so noticable. After this he was more clear and said it's a 'no' from him on asking her.\n\nMy argument is that it would only be for the posed photos after the ceremony (again, there wont be many that she would be in), and I would be happy for her to keep them on for the ceremony and rest of the day. If we got the headphones edited out, it would be £40 an hour for additional touch ups and editing done by the photographer.\n\nWIBTA?\n\nEDIT: To be clear FSIL is not my fiances sister, she is his brother's girlfriend (who will probably marry at some point)\n\nEDIT2: Fiance came back into the room and said he'd be open to talking about it with her next year in advance of the wedding.At the same time, I hear the response from you all! IWBTA. I really liked some of the other ideas presented here, maybe doing a private photoshoot so that its quieter for her, or offering to customise her headphones a bit so she can feel more festive - we havent picked out our colours yet, but what if she wants to wear a flower crown (as an example)? The possibilities are endless.Thank you everyone for your feedback.\n\nEDIT3: Just making it clear I'm not going to ask her anything or say anything to her until fiance and I are aligned. ", "created_utc": 1698326983, "permalink": "/r/AmItheAsshole/comments/17gwk90/wibta_if_i_asked_my_future_sil_to_take_off_her/", "score": 628, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > )I am thinkingn of asking my FSIL not to wear hear noise-cancelling headphones during the posed family photos at my wedding\n\n2) The headphones are considered a disability aid and she usually needs them to reduce noise which can be overstimulating for her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n????\nIts ok to ask. Ywbta if you push it.", "YWBTA if you handle it as you've said here, asking her to remove them specifically for the photo. This *could* be a N A H situation *if you handle it correctly,* though. \n\nConsider the noise-canceling headphones to be a necessary piece of removable medical equipment, like glasses. \n\nSome people with glasses prefer to take the glasses off for photos. Others, like me, prefer to keep them on because they're part of my face and I feel like I look very strange without them. They make my nose look a LOT smaller lol, and like it actually fits on my face. I have anti-glare coating to make photos with my glasses easier so as to not cause glare problems. I always wear my glasses every day, so I feel like \"not me\" when I go without them-- like my face just doesn't *look right* to me. I still take them off if requested simply because even with the anti-glare coating, there can still be physical issues with lighting of glasses in photos; but I prefer not to. \n\nIf your FSIL wears the headphones *all the time,* she may consider them part of what she normally looks like. In this case, asking her to take them off would be asking her to *change herself* for your photos-- meaning you don't want HER to be in the photos, but you want someone who looks good according to your standards. Do you want photos with your family and loved ones, or photos with attractive people who meet your visual standards? If someone had a hair color you don't like, would you make that person wear a wig for photos? Would you make someone cover up a meaningful, non-obscene tattoo for photos? \n\nOn the other hand, if she *herself* prefers to take photos with the headphones off, then it's fine to ask her, because they're not part of her visual identity. \n\nDisabled people often consider our disabilities to be part of our identities. If you ask us to \"cover up\" those disabilities for a photo, it feels to us like you're rejecting *who we are* and preferring some version of us who doesn't actually exist.\n\nFor this reason, the way you need to ask the question is this: \"Do you prefer to wear your headphones for photos, or do you prefer to take them off? Either way is fine with me; I want you to feel most comfortable.\" If she wants to wear them, then you can ask clarifying questions about if she'd like a flower crown or other decorations in wedding party colors etc., or if she'd like to wear them as-is.\n\nBut if she prefers to keep them on, and if she prefers not to decorate or hide them, then *let her keep them.* In this case, it would probably be unacceptably rude to photoshop them out, too-- like you're rejecting who she is. Would you photoshop out a wheelchair user's wheelchair, or a prosthetic-wearer's prosthetic, and expect them to be okay with it? \n\nThe key part here is to *respect her preferences.* \n\nTl;dr It's fine to *ask her preferences* when it comes to wearing headphones for photos. It's NOT okay to *request* that she remove them if she doesn't want to.", "I think bedazzling or creating a flower crow is a great idea.\n\nPeople of Reddit please don't jump all over but I would like to ask an honest question because I truly don't know. I've never used noise cancelling headphones so could still hear normal conversation but extraneous back ground noise is blocked out? Or do they create a cone of silence? Are there different levels of noise blocking you could choose to use? I apologize for my ignorance but I'm truly curious. I'll probably ask Google in a few minutes but would love an explanation from someone familiar", "YWBTA — If you asked her prior to taking pictures. How would she know if she can or cannot without being in that situation. \n\nYWNBTA — if you politely letting her know during pictures that it’s her choice if she would like pictures taken with or without headphones on. Maybe she doesn’t want to have pictures taken with them on.\n\nedit spelling", "Are you asking wheelchair users to stand? Any amputees removing their false limbs? Are your elderly guests forgoing their walking sticks?\n\nYTA.", "NTA.  Simple solution.  She is NOT your SIL.  She is your fiancé's brother's GF.  She is NOT family YET!  Don't include her in photos.  What happens if they never get married and you're stuck looking at her in your wedding photos forever.", "Photos are to register a snapshot of a event. That includes how people are.", "This is who she is and will most likely always be. Is it worth potentially damaging future relationship with his family over earphones ?  If she has a birthday or something before then buy the ear buds as a gift and see if she likes them or they work for her .", "YTA. As you said, she has FND. She wears them for medical reasons. You are asking her to forgo wearing medical equipment because you don’t like how they look.", "YTA. \n\nWhy do you want your SIL in the wedding photos at all? Because she’s part of your new family, right? And she’s important to your fiancé? You care about her as a person? Of course you do! The thing is that the person you care about, the person who means a great deal to your fiancé, the person who you want to be present for your wedding and remembered in your photos, HAS A DISABILITY. Your SIL is a whole person, and her disability is part of her. If you ask her to not use her disability aid so it won’t be visible in the photos (and honestly, even if you pay to have the headphones edited out), you’re effectively telling her that you don’t want her whole self at your wedding.\n\nAnd honestly, you won’t even get what you want; you’re worried about them standing out, but it’ll stand out much more to anyone who knows her if she isn’t wearing them in your photos.", "NAH. She may consider taking them off during photos. You can ask her if she wants to have some photos in a quiet area, but 100% don’t ask, leave it up to her.", "As an alternative to big headphones, would they wear the in ear noise reducing plugs like calm etc? I know some people can't tolerate in ear, especially if they have sensory issues, but it's maybe worth a try?", "When is her birthday?\nMaybe buy her some https://us.loopearplugs.com/pages/homepage-lp1?gbraid=0AAAAACj0PVwSnX4FDv57i-JsnQIQ2zFyl&gclid=CjwKCAjwnOipBhBQEiwACyGLuirdWQnmJwOs8AWGdT0w8h3TO_-jTVvh2BilPwp7BJakcAPREeE6lxoCgc0QAvD_BwE", "YTA. It's just a wedding, you don't get to play god for the day. Would you make her try to stand up if she was in a wheelchair?\n\nAs for not being diagnosed with autism, it's so difficult in the UK many people just give up as they can't cope with the multi-year process and the crushing realisation that they won't get any support at the end of it anyway.", "YWBTA if you asked her to take them off. She will remove them voluntarily for the photos if she is willing and able to. You can’t ask people to remove medical equipment.\n\nIn the long run, wedding photos are not that important. Your relationship with SIL is.", "YTA - why not ask a wheelchair user to stop using their wheelchair for aesthetic reasons while you’re at it?", "If there's time till the wedding, you could think of gifting her something like these [earplugs ](https://www.loopearplugs.com/)\n\nOr maybe just show it to her, maybe she's interested. They're quite good.\n\nOtherwise Photoshop ftw but be kind and respectful when talking to her.", "I see your edits, but I just want to say since she isn't engaged or married into the family yet, you have the option of not including her in photos at all. In fact, I've been to weddings where photographers won't include partners that aren't engaged/married/living together because of potential break-up issues.", "NAH, but if she’s just going to be in “the two photos of extended family we see once a decade”, I’d be inclined to just roll with the headphones, since those are unlikely to be your most treasured photos of the day. \n\nThe ones you’re going to frame are probably the ones with just you and your spouse, the ones with your parents, or the ones with your wedding party. You’ll be potentially creating bad will over the headphones while crazy great-aunt Erma is holding a smuggled-in pet raccoon on the other side of the shot and making things weird anyway. 😄", "Offer to buy her noise canceling ear buds or ear plugs to wear during pictures. She may not like them for long term wear, but might be able to tolerate them for the brief time of picture taking.", "NTA to just ask. Take photos with her in it in the large group photo, then do just current family and have her not in it", "YTA\n\nYour fiance explained his reasons, and they are genuine and valid.\n\nThe fact that its vanity reasons makes this even worse. According to you, she wears them whenever she is out of the house, so going by that logic anyone who knows her is aware she wears these - what's the issue?\n\nAlso, posed photos do not \"just take five minutes\", there is a lot of moving people about, banter, laughter etc. One of the many reasons why it would be wrong to ask her to remove them.", "Yta. You even asked your fiance and he said no he won't be doing that. This is a situation where you're putting the wedding above the marriage, because I guarantee if you go ahead with asking this, it will change the relationship with your future husband and in laws", "YTA - she wears the headphones, that is who she is. If you are so worried about someone standing out in your photos, hire actors to be in the photos.  If you actually care about your guests, don't ask them to change who they are just so your get likes on social media.", "Yta let people be who they are on your wedding day. No one is going to linger on the grooms sister wearing ear muffs they're going to be looking at the bride and groom.", "‘Hey can you hide your wheelchair for the photos?’ \n\nThat’s what it sounds like.\n\nYWBTA", "YTA. You asked, they said no. Drop it.", "YTA. I agree that would look weird but just have the photographer edit them out. No wedding photographer work their pay can't do that. She shouldn't be in many photos anyway so it's an easy fix.", "YTA for being more concerned with having perfect wedding photos than you are with the wellbeing of your wedding guests -- who are actual human beings with actual feelings and emotions, not some props in your staged show.\n\nYour fiance is right: it *is* a disability aid, and whether it's a diagnosed disability or not really isn't relevant. Would you ask her to get up out of a wheelchair for the photos, too? After all, it's only a \"short period of time... approximately 5 minutes\". \n\nYour fiance is also quite right in flatly refusing to pass along your entirely unreasonable request. You want perfect photos? Pay the photographer to make them perfect.\n\nThe photos are a lot easier to fix than your lack of compassion.", "YTA - She’s not wearing them for shits and giggles. Have a conversation with her and discuss your concerns. Ask *her* if she can tolerate taking them off for short periods to take photos, or if she is able to take them off for certain posed photos. If she can’t, discuss photoshopping them out. You can work with your photographer to schedule times for photos and then communicate with her ahead so she can mentally prepare. \n\nHonestly if she wears them all the time already, no one who knows her or your family will think anything out of the ordinary if she’s wearing them in photos.", "Put your brother in law’s girlfriend at the very end of all the photos so it will be easy to cut her out when they eventually break up. This is insane.", "YWBTA, that is a disability aid for her and even if it’s just five minutes it could really be detrimental and extremely overstimulating.\n\nHonestly, do you need to include her in the photos at all? In my sister-in-law & cousin-in-law’s wedding they only included the family & their spouses or fiancés. My husband’s cousins were in photos, but not their boyfriends. If the headphones would bother you that much there is always this option, plus it’s be less photos and less of a hassle overall to try and gather everyone.", "YTA. It's amazing how shallow some people are.", "Ok YATA for even wondering about this. \nNow to remedy this \n\nYWBTA if you just ask her to remove them\n\nYWNBTA if you talk to her yourself and find out about her comfort with them. For example is she embarrassed to be photographed with them on or not. There are 2 options.\n Option 1 she is embarrassed. Then you help her feel comfortable either way that makes her feel comfortable. By offering to make it a private shoot so it’s quiet so she can remove them. Or by helping her make them look like a flower crown to match her dress or give her the iconic Princess Leia buns. \n Option 2 she isn’t embarrassed conversation over and don’t try to hide them in any of the photos otherwise YWBTA and when she sees the photo on the wall all she will ever be able to think is that you’re embarrassed to be seen with her thus ruining her self esteem even more.", "YWBTA. She has a disability and needs the headphones to cope. Would you ask her not to use a wheelchair to look better for photos? It's the same thing, they're both medical equipment and you don't ask someone not to use them for the LOOK of your wedding pictures. DO NOT EDIT THEM OUT! That would be highlighting that you think her medical equipment is ugly and needs to be removed. Stop thinking of your \"wedding aesthetic\" and start thinking of the comfort of your family and guests. You are starting a battle you won't win and will have lasting repercussions.", "YTA\n\nYou asked your fiancé, he gave you an answer. This issue should be resolved. The needs of actual human beings should take priority over creating the illusion of perfection. And yes, it will be just that, an illusion.\n\nWant her headphones not to stand out? Ask her if you can get her a pair that match your outfit or the wedding theme colors for the day. DO NOT make her deal with the world without her head phones.\n\nYou are being ableist and trying to force a neuro-atypical person to fit your pretty little version of \"normal.\" Boo.", "Yta, you're fine for asking.  You're the ahole for not accepting the 'no'.  Do you know what it's called when someone 'asks' but won't  accept a 'no'?  It's a demand.  Ask yourself 'am i the ahole for DEMANDING someone remove a disability aid to look pretty in a picture?' \n\n\nPick the ONE pic you're going to hang up and have it photoshopped out.", "NTA\n\nIt's not wrong to ask her in a respectful way and get her thoughts... prior to the wedding\n\nIt would be wrong to push or bring it up last minute", "Kind of leaning towards yta on this. I get where you are coming from and understand the look would be off from your point of view but your sil has a reason why she wears them. You could take special photos ahead of time at a quiet location that would allow sil to be comfortable without the headphones for a few minutes. It's her decision of what she's comfortable with. She may not be able to tolerate the chatter of others on the actual wedding day. I'd have a honest conversation with her and listen to her wants and needs on this subject. It may not be possible at all and the day of the wedding may be too much auditory stimulation for her to be without the headphones.", "I don't think it's wrong to ask if she can take them off for the photos only but in case she doesn't want to, just ask your photographer to photoshop them out of the picture and get both set of photos.\n\nNAH", "[deleted]", "NTA\n\nThis far in advance, I don’t see why it would be a problem. \n\nIf she genuinely cannot due to her condition, she should then state that, and you should be prepared to accept it. \n\nBut it seems reasonable for a few moments for a picture, if she’s able to do so. \n\nJust approach it with genuine respect for her condition, and be understanding if that isn’t something she can do in that situation. The headphones aren’t going to break the picture, after all.", "YTA. Just ask the photographer to edit them out of the final photos if it means that much and eat the cost.", "NTA for wanting to ask and have a discussion. You’re not demanding or giving an ultimatum but asking what she is comfortable with and trying to find a possible solution.", "Why doesn’t she just get AirPods…? Or other small headphone with ANC? They’re now just about as effective as full size headphones…can’t imagine having to wear those all the time", "She’ll be wearing headphones at the wedding? Won’t they make her deaf?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBasically what's in the title.\n\nThe wedding is next year but we are knee-deep in planning just now, and I'm in discussion with our photographer on what type of shots we want to have. Our FSIL will be in some of the family shots, and she usually wears very large noise-cancelling headphones when she leaves the house because she can sometimes find noise quite overstimulating. (AFAIK she has not been diagnosed with autism, she has FND).\n\nI'm worried that the headphones would stand out too much in the posed family photos, so I floated the idea to my fiance of asking if she would be able to remove them for that short period of time (I'm not sure how long it would take but I'm guessing aproximately 5 minutes). He said he would feel very uncomfortable asking her to remove them as they are a disability aid - I replied to say I would be happy to facilitate this discussion with her and ask if she could maybe use earplugs, or if we could find smaller headphones that maybe aren't so noticable. After this he was more clear and said it's a 'no' from him on asking her.\n\nMy argument is that it would only be for the posed photos after the ceremony (again, there wont be many that she would be in), and I would be happy for her to keep them on for the ceremony and rest of the day. If we got the headphones edited out, it would be £40 an hour for additional touch ups and editing done by the photographer.  \n\n\nWIBTA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Not quite clear why your husband’s brothers wife would even be in your pictures for this to be an issue if I’m honest.", "[deleted]", "Yta", "Either buy her iPhone earbuds that are noise canceling\n\nOr get matching color wig and rubber cement patches of wig to said earphones. No one the wiser.\n\n\nOr ask photographer if it's easy to photoshop it out.  And how much extra.", "YTA for putting VANITY photos above her litteral medical need. News flash: your photos won't be picture perfect anyway, there will always be something you don't like about them. Your wedding photos should not come at the cost of your guests well-being, and in this case it would be.", "Here's the thing, if she always wears these headphones then won't she look really weird without them? It's like when I see posts about people asking bridesmaids to dye their hair for the pictures - it's not going to look like them. Why would you want a bunch of pictures of people you don't know? Surely you want to be able to look at the pictures and think how happy everyone looks rather than not being able to recognise people.", "Since it’s your picture you’re concerned with I would approach her about noise canceling earbuds and if she agrees then you, as the concerned party, pay for them. They’re not bothering her. There’s a brand called Loop specifically made for people with Auditory Processing Disorder. Good luck", "Editing the headphones out in photos hop would be a 2 minute job", "There are many alternative earphones that won’t be too noticeable for the photoshoot and it’s only 5 minutes. I under how quickly one can be over stimulated but this is 5 minutes with a different set of noise cancelling earphones for the best day of your life and start of your marriage. I don’t think it’s asking too much for you to want a very quick thing on yours and your future husbands day.", "NTA - It’s okay to ask, it’s not okay to push it. \n\nHowever, I will add look into “loops” they’re not as good as noise cancelling headphones but for a short stint they may be an acceptable compromise for the photos, super discrete, reasonably cheap - it could be a nice gesture to offer to get her a pair as and when the conversation about it happens kinda a “we know that you’re uncomfortable with noise, just for the photo part would you feel comfortable enough to maybe try these, there’s lots of different options in terms of noise reduction levels. If you are happy to we would love to gift you a pair as a thank you for accommodating our request.”", "YWBTA if you ask her to not wear something she needs because of a disorder. Could you ask her to try ear plugs or something more subtle for the photos instead", "Can always get the head phones photoshopped out", "Thanks for your feedback :)", "Not necessarily. A person might be self-conscious she has to wear them in public, and such ask could be very hurtful, pointing out that others indeed see it as freakish.\n\nOne needs to thread very lightly here. It’s perhaps a better approach to consider those headphones as a natural part of this person, such as you would consider wheel chair for a paraplegic, and act accordingly. \n\nYou wouldn’t ask paraplegic to hide their wheelchair. \n\nJust respect persons natural appearance in the wedding photos, it’s just normal.\n\nTBH it’s hard for me to reflect on how shallow you must be to rack your brain about how to make your disabled relative remove their medical equipment for photos…\n\nYTA", "> Its ok to ask.\n\nNo, it's really not.", "Thank you for such a detailed and considerate answer! I really appreciate how youve laid things out here, and youre absolutely right that the major thing I havent considered is her own agency. (This is exactly why I was trying to open this discussion now and not spring anything on the day!! I need to know what Im missing!!) \n\nI also hear what you're saying about identity, to my knowledge she doesn't wear them inside the house, but I've only met her 3 times so I don't really know her that well. That saying, I guess the only way to get to know her in this sense is to have a discussion, but as you say, do it carefully and respect her needs and preferences. I'll definitely think on how to approach this more carefully, and I won't say anything until fiance and I are aligned in our thoughts.\n\nThank you so much for your feedback.", "Thank you for your feedback :)\n\nHonestly I've never used them either, my understanding is that they help with filtering background noise, but you can still hear (I think). Maybe I need to google this too 😂", "Thanks for your feedback :) My thoughts were that I didn't want to optentially put her on the spot on the day, which is why I had hoped to talk about it before the event. \n\nBut, I like your wording in the second option, I'll certainly think on it, and I didn't think to ask her about her preference. Thank you for that.", "> Maybe she doesn’t want to have pictures taken with them on.\n\nIf she doesn't want to have pictures taken with them on, she will take them off without needing to be prompted.\n\n> politely letting her know during pictures that it’s her choice if she would like pictures taken with or without headphones on ...\n\n... makes it very clear that *OP* \"doesn't want to have pictures taken with them on\".", "omg I get the picture 😂 thanks for your feedback", "Some people have been mentioning this 😂 honestly not something I had thought about, thank you for your suggestion!", "To be clear I'm only asking about the posed photos, but the candid shots from the rest of the wedding I'm honestly happy for them to stay the way the are. It will be a 12 hour event so lots of opportunities to get brilliant/hilarious/awful photos of everything 😂", "I've only spoken to her twice so I honestly had no idea how FND affects her, and my understanding was that it was more related to her mobility than her sensory processing. Maybe I'm wrong.\n\nThank you anyway for your response, I appreciate it", "Thanks for your reply! After reading the comments here I realised I wasnt clear in my original post, FSIL is my fiances brothers girlfriend, who will likely marry in the future. No relation to fiance.\n\nStill thats defeinitely something for me to think about, so thank you for your feedback", "thanks for your feedback :)", "I thought about regular earplugs but forgot that there were specialised kinds like this! Thanks for the suggestion :) I'm hoping to facilitate a discussion with her where we can talk about alternatives if shes open to it", "Not a bad idea actually! Thank you for the suggestion :)", "Thats a good point! Thanks for your feedback :) Probably a discussion to have the photographer in tht sense then!", "Thanks for the feedback! Thats a good point about which photos are likely going to end up my favourite anyway  - and that last bit made me laugh SO much 😂😂", "Thanks for your feedback and for the suggestion :) I appreciate it", "In all honesty I have only met her three times, so I don't really know her that well outside of that, so I have no idea how affected she is.\n\nThat's a good point, thank you for your feedback", "After reading your comment I realsied I wasnt clear in my original post, FSIL is my fiances brothers girlfriend, who will likely marry in the future.   \n\n\nStill, I think you raise a good point, so I will think on that", "I dont really understand what you mean by the sentiment that the headphones are who she is? Isn't that a bit reductionist?", "Ngl \"ear muffs\" made me laugh 😂 Thanks for your reply", "Lol good point, thanks for the change in perspective!", "Right. \n\nAlmost everyone that is close to the bride and groom that will be in family photos likely know about FSIL disability, the headphones would not standout to them. What will standout to the family is that OP was so callous about that disability for the sake of a photo op. \n\nSeems like a weird thing to push and focus on seeing as you are going to have dozens of other photos to post for social media or non family members that don’t include her.", "\"Can you not just stand up for the photos? You'll only be in a few it won't take long\" -OP", "Thats a fair point! Thanks for your feedback :)", "I think you're making some assumptions here - in my post I also wondered if earplugs would be a suitable alternative, or smaller headphones, so I'm not saying she has to go without. The only thing is that they are really quite large.\n\nSomebody did suggest potentially having a private, quieter photoshoot, or offering customisations and accessories so she can feel more festive, and I think that could be something to consider. People here have given some really interesting suggestions, so that's something for me to think on.", "Thats pretty much what I was hoping to do, I dont know what her limits her so I'd like to get a good idea of what would be comfortable for her.\n\nFiances family have only met her about 5 times in the last 5 years, so we don't have a precedent for what's normal, if that makes sense.\n\nAlso, I like the idea of scheduling times and letting her know so she can mentally prepare, I might do that anyway outside of the headphone chat so things are easier for her. Thank you for the suggestion!", "😂😂😂\n\nThe family has only met her a few times.. maybe they can just take some without her honestly. Save everyone the trouble. I probably wouldn’t want a bunch of photos with somebody I barely know. It doesn’t make any sense", "Thanks for your feedback, honestly I was hoping to discuss it with her because I dont actually know what her limits *are*, and if there was a way to create alternatives I'd be happy to facilitate them (hence why i mentioned earplugs in the original post, i think since then someone mentioned you can get specialised ones).\n\nBut you raise a really good point, we havent really discussed exact arrangements so thats something to thinka bout", "Thanks for your feedback, I was hoping to facilitate a discussion with her about alternatives or compromises we can try out together, so these are some great ideas. Thank you. Those are fair points to think about.", "It's not that I'm opposed to her wearing the headphones, but I was wondering if earplugs were a suitable alternative, or even a smaller pair of headphones. AFAIK she originally got them online so I dont think a doctor gave them to her. \n\nSomeone else suggested maybe discussing with her to customise them, maybe add something colourful, or attach flowers like a flower crown. I'll definitely think on it and make sure fiance and I are aligned before suggesting anything to her though.", "Thanks for your feedback :) After reading the comments here I realised I wasnt clear in my original post, FSIL is my fiances brothers girlfriend, who will likely marry in the future. No relation to fiance.\n\nThats actually a really good idea about maybe customising her headphones to go with the theme, thank you for that :) I'll definitely think on it", "Honestly, it would probably be rude to photoshop it if FSIL prefers to wear them in photos. It could very well seem to her like OP is embarrassed about what she *actually looks like* and what her actual physical situation is. Like, it's not okay to photoshop someone's physical appearance just because you don't like how they look, or to photoshop out a disability aid because you dislike the aesthetics of it when it's part of their daily life. You wouldn't photoshop out a wheelchair or a prosthetic leg without asking, and expect the photoshopped person to be 100% a-okay with it. \n\nThe only appropriate thing to do is to ask FSIL's *preferences* when it comes to wearing the headphones in photos.", "Thanks for your feedback, to be clear i havent actually asked her", "Thanks for your feedback :) I also didnt want to bring it up at the last minute because I didnt want to put her on the spot, hence wanting to facilitate a discussion in advance. People here have given me some interesting alternatives to think about as well, so I definitely won't say anything until fiance and I are more aligned on what we can offer / what to ask", "Thanks for your feedback! I really aprpeciate your suggestions here", "I’m surprised there aren’t more NAH responses. I am autistic, I wear noise cancelling headphones near constantly and this would not be a big ask for me. I have varying styles and sizes and I wouldn’t mind at all if I were asked to switch to a less obvious pair for a few photos or even to wear none at all. I would probably plan to wear small less visible ones for such an event anyway, as I just don’t like people to think I’m ignoring them. If OP had indicated an unwillingness to accept “no” or even help cover the cost of some less obtrusive ones (some of my nicer ones are on the spendy side), I would say she was the AH, but that doesn’t seem to be the case. \n\nJust a note to OP, some nice noise cancelling headphones may be more expensive than the photoshop fee so it may be a wash. I still don’t think anyone’s the AH.", "Thanks for your feedback :)", "Thats a really fun idea! thank you :) I like the thought about creating memories with her because honestly i dont know her that well so that sounds really nice", "Thanks for your feedback! I was hoping to have a genuine discussion with her, but I really dont know anything about her needs so I figured the only way to know was to talk to her about it. Thanks for your kind words.", "But what if the girlfriend finds that offensive???", "Fair point! Thanks for your feedback", "Thanks for your feedback :)", "Did you even finish reading the title? They're noise cancelling", "Hello! Your comment is really thoughtful and meaningful, did you mean to post it in this thread?\n\n(Just dont want your lovely comment to go unseen!)", "Honestly we've all only met her about 5 times max in the last 5 years, so it wouldn't make her look any more or less 'herself' if that makes sense", "I've been seeing a few recomendations for Loop! I will check them out, thank you for the suggestion :) And yes I would be happy to facilitate & pay for the alternative if it works for her", "Thats what I was thinking, and I'd be happy to source them as well if its easier for her. Thank you for your kind response and your feedback :)", "Thank you so much for your kind and thoughtful answer, I really love the way youve worded the request here, it sounds like the most compassionate way to approach the conversation!", "Thats what Im hoping to discuss with her, I wondered if suggestion earplugs or smaller headphones could be an option, lots of people here have been giving some really helpful suggestions", "They have noise canceling ear buds. I feel like asking her to switch might be awkward", "Maybe earplugs would be an option", "Yes it is.\n\nPeople can advocate for their needs. It's okay to answer and hear \"No\" and respect that.\n\nAre you able to advocate for your own needs? Or do you like it when people assume things for you without asking?", "It is as long as it’s an ask, not a tell. Asking if there’s something we can do to accommodate her needs in a way that work better with the photos is ok.", "Sounds like both of us need to borrow a pair and see what they are all about.", "As someone who uses noise canceling headphones, I can speak to my experience! \n\n&#x200B;\n\nI have very sensitive hearing, and right now, I can hear the water dripping from my kitchen sink, even though I am sitting about 10 feet away from it, and even though the fan is on (and very loud to me). Noise canceling headphones filter out the sound of the dripping, and dampen the sound of the fan, and I think they also filter out the sound of the refrigerator humming to me (the refrigerator humming is less of a sound and more of a tangible sensation to me, like, oh, there is something Big and Electronic working away in the background)  \n\n\nSo they do filter out background noise, but whether or not the average person even notices the background noise that they filter out in the first place is up to the individual user. Some people can tune out the noises I described above much better than I can, to the point that they do not perceive hearing it-- or maybe they do not hear these noises at all. Noise canceling headphones probably do not offer much protection. Other people can hear these noises, and it can be as overwhelming for them as something like... the sound you hear inside a moving airplane, for example. While a room might be quiet to you, they might be able to hear all sorts of noises you can't (air flowing through vents, the humming of the HVAC system, the sounds that fluorescent light bulbs can make, even someone else chewing or breathing, even if these are all sounds you cannot hear, or can tune out more easily than they can). \n\n&#x200B;\n\nMost of the time, I don't mind these noises, but when I am very stressed or ill, these noises can add to the other overwhelming physical sensations and cause upset. Even though these noises don't hurt me (some people experience physical pain as a result of too much background noise, even if it is low decibel, as a result of hearing sensitivity), it does take energy from me. Wearing headphones even on days when I am not overwhelmed makes it easier to navigate the world and conserves energy for things that truly matter, like cooking food or brushing my teeth before bed or even help me to fall asleep in my bed instead of on my couch (I work full time and am exhausted by the time I get home, so any scraps of energy I can save can go a long way!) \n\n&#x200B;\n\nThis is just my experience- other people have very different experiences, but I hope this information helps you.", "That was my immediate thought…\n\nIf FSIL is getting dressed up for the day, would she prefer to have minimum ear protection showing in the “official photos”? \n\nDoes she go out and about with friends and choose to have them on or off, if they take photos or she takes a selfie? \n\nIt sounds as if you’re thinking ahead and considering her comfort… hopefully you can find a compromise based on her requirements. \n\nAnd maybe tell the photographer closer to the time, to minimise noise and fuss? Wedding photos can be quite pressured…", "I would kind of advise *against* that wording if your strong preference is no-headphones. \n\nA neurotypical person would understand it as a polite version of “please remove your freaking headphones for the duration of the photo if at all possible”. A neurodivergent person might take it more literally and respond “ok, I’ll keep my headphones on!”", "An alternative solution maybe \n\nTake a photo of her now with headphones on and see how well your photographer can remove them through photoshop. \n\n&#x200B;\n\nThe photographer may be able to do a Quiet at home photoshoot of SIL before the wedding without headphones on - as that can sometimes help with the photoshop work. \n\n&#x200B;\n\nThis avoids the problem and should be a win / win for everyone.", ">... makes it very clear that OP \"doesn't want to have pictures taken with them on\".\n\nYeah? And that's fine.\n\nUnless you take it as a horrible, unforgivable, terrible slight and take it completely personally and blow it out of proportion.", "Yeah, but even posed photos are of people like they are. Are you asking fat people to loose weight?  The ones who use classes to take it of? People Will make try to look their best and maybe she Will take the earphones off by herself. But If she dont, then let it be", "have you even researched it at all", "[deleted]", "How bulky are they", "So she's just a much a part of the family as you? How does that make her needs for a disability any less important? And the fact you're still thinking about making her not use them after the conversation with your fiance really shows you don't respect him so don't be surprised if this implodes your relationship because you care more about a perfect wedding than him or other family members", "Also, maybe she’ll choose to do it on her own? People can be vain and insecure, and asking might make her feel worse about wearing them.", "If she's open to alternatives, maybe suggest something like Loop Earplugs for the photos. I have a few pairs and love them. They won't cancel out all noise, but they're pretty spectacular.", "omg stop 😂😂 I got it", "would you edit out a wheelchair or insulin pump without asking? this is medical equipment that keeps her safe & in less pain.  \nif it’s safe & she wants to take the headphones off just for pictures, she will. if she needs to keep them on or doesn’t care if they’re in the pictures herself, this is a you problem.", "> The only thing is that they are really quite large.\n\nNo, the \"only thing\" here is that you don't care at all about her disability, you just care about hiding it so that your photos will be perfect.\n\nYTA still.", "Definitely talk about who will be in photos before you even discuss anything with her because it could avoid a lot of awkward conversations and issues. Also, in my experience, headphones can provide comfort because of the feeling of them on your head. It can go beyond overstimulation with her hearing and the feeling of not having them on could also cause discomfort for her. Also, to be more blunt, it is not be your business what her limits are, because she has probably been dealing with sensory issues her whole life and has likely already gone through multiple options to cope and aid her in her disability. Think of it like this: let’s say a guest wears glasses, and you ask them to wear contacts instead because you don’t want glasses in your wedding photo. They probably have already tried wearing contacts at some point and don’t like the feeling of them, feel uncomfortable, etc. I wear glasses and tried contacts once - I felt very self conscious without my glasses and did not like the feeling of contacts. Plus, why would you want the photos to have a version of her that doesn’t really look like her? If she always has the headphones on, that’s her. It’s just a few pictures, and likely not the ones you are going to be displaying in your home. The family photos are more for the family members who are in them, and the photos of you and your future husband are the ones that really matter.\n\nAs far as thinking of if she is in the photos or not, her and your fiancé’s brother not are engaged or married yet and even though it seems likely, there’s still a chance they break up. Also, if the brother’s gf is in them, that means that other people may expect their girlfriends/boyfriends to be in them and then wonder why they aren’t. If you just don’t include boyfriends and girlfriends of family in the pictures, everything is solved. You don’t need to think about the situation anymore, nobody will get offended, and people will not question that decision.\n\nI don’t think discussing it with her is honestly a good option. It’s just going to make her feel self conscious about her headphones, which is something that currently brings her a lot of comfort and helps her get through overstimulating situations. Weddings can be extremely loud and overstimulating.", "Doesn't matter who she is.\n\nWhat you are describing is a coping mechanism for someone who is neuro-atypical. Ableist AH always feel that they have the right to take these things away so that they can maintain the illusion of normalcy. I don't care if you hate what it will do to your photos, you do not have the right to take the coping mechanism away. This would be tantamount to taking crutches or a wheel chair away from a disabled person.\n\nHowever, working with them to find a way to help them fit in while respecting their needs is different. It can even help form a bond.", "And the thing is, about wedding pictures.  You look at them  *occasionally*. I took videos of a couple friends weddings bc they wanted a wedding video, but honestly, they get watched, maybe *maybe*, once a year.  Same with wedding photos.  Other than the one you frame and hang up, you just don't look at them that often.", "Good. Don't.", "Thank you for your kind response, I really appreciate it! I'm a little surprised by how visceral some of these responses are 😅 \n\nThats a good point, perhaps someting for me to do a bit of research on! And thank you for sharing your perspective as well, it's really helpful", "Are either of you active/mutuals on any social media platforms? If you are, I’d check and see if she wears them in all photos because that could give you an idea of when she wears them. \nShe may take them off for special events/photos in which case you could open up the discussion that way as sort of a “hey, we’re going to be doing posed photos and I’d prefer if you don’t wear them, however, I do want to make sure you bring them if you need so you’re comfortable through the wedding. We can even make sure there’s earplugs just for the photos if that’s something you think would help for that short duration.” \n\nNAH…for now especially since it sounds like you’re open to a dialogue and different options. But if you do push it then YWBTA", "? Yes ie how will she hear anything the wedding?", "Oops", "I hope it works out for you. As long as she remains comfortable and you also get what you want it shouldn’t be an issue. I mean she can even switch back  to her headphones after using the “Loop” for the formal photos. Fingers crossed you can approach it delicately and she sees that you’re willing to compromise and not trying to insult her. Though it could be a cute pic of inclusion to have her in very visible but white headphones. Gosh, as a mom (who also has APD but l grew having to be uncomfortable…so now uncomfortable is my norm 😂😂) of a special needs babe to see inclusivity would absolutely melt my whole heart. \n\nGood luck either way", "As someone who also struggles with noise (as does my teen) loops have been a situation saver - life saver seems a bit too dramatic 🤣 \n\nIt may be something that plays on her mind anyway as most of the time I personally don’t like to appear different or have something people can stare at - I’m already self-conscious enough.\n\nGifting her a pair also means that she has them for the future as well if there are other situations she might not want the headphones but still needs the noise reduced. Personally I’m always much more open to trying to accommodate others if they’ve also tried to accommodate me/my kid. \n\nMy partner and I are getting married next year and we’re getting my kid a new pair of “wedding loops” - although it’s mainly an excuse to get her a spare pair, but they will be in her bridesmaid gift box along with some jewellery I’m taking the bridesmaids to make - I know your future SiL isn’t in the wedding party but if you can even roughly colour match (if she’s amenable to trying them) it could give them a slightly more special meaning. A rough timescale “we estimate no more than an hour, and you wouldn’t be in all of those photos just X-ish number” could help her gauge her comfort levels against the expectations too.\n\nIt honestly sounds like you’re trying to approach it with gentleness and care - I hope you have a fabulous wedding and a long and happy marriage 💜", "It’s understandable to not want massive earphones in the pictures, I’d definitely find a less unsightly compromise. My brother wears ear defenders a lot but will wear more discrete ones for events and stuff", "not everyone can tolerate earbuds/plugs. I wear ear defenders (I suspect this is what she's actually wearing and not large headphones) in part because ear plugs do not work for me.", "The soon-to-be-marrieds could always spring for a pair. The Bose ones are nice.  Problem solved.", "Right! And it's always possible that she WANTS to find a solution to take them off for photos. I participated in a wedding a while ago where the bride's father uses crutches (always, not temporarily for an injury) and HE wanted to leave them out of the photos although no one was asking him to. They arranged some photos with him seated, and I think there was a group one where a couple of groomsmen supported him for a minute or two to get the shot. It's worth giving this woman the opening to decide for herself what she would prefer.", "Thanks for your feedback :) She doesnt socialise that much so I dont have much to go on in terms of what she might find comfortable, and she doesnt take any photos herself. So I was hoping if it would be okay to open up a conversation with her", "This is actually an awful idea… What happens when FSIL sees the edited photo, and realizes that OP actually edited part of her out of the photo? What message does that convey… That your disability is unsightly to my wedding photos.", "Actually thats a really nice idea, thank you", "> This avoids the problem and should be a win / win for everyone.\n\nNo, it doesn't, and no, it's not.\n\nIt makes it very obvious that OP doesn't want the headphones appearing in the wedding photos, and that OP cares more about having perfect photos than she cares about FSIL's feelings.", "Okay I see your point, thanks for your feedback", "Yes, but my understanding is that it is a very different presentation for everyone. I've met 3 people with FND and its been so different, so I dont really know what to expect form FSIL", "I dont want her to suffer though? Thats why I asked if earplugs could be a suitable alternative, or if we could source her a smaller pair", "I dont know how to describe it, to me they are very bulky, which is why I was wondering if sourcing earbuds for her was a suitable alternative, or a smaller pair", "I think theres a misunderstanding here, I really added that because you mentioned it would change my relationship with the inlaws, but she's not actually an in-law, if that makes sense. I realise I wasn't very accurate.\n\nI said \"I will think on that\" because I am thinking about it. Isn't the point of this post to get me thinking?", "Thats certainly a possibility, somebody else suggested offering to help her customise it to wedding colours (maybe a flower crown?) and now that you both have mentioned it I really dont want to knock her confidence. I wonder if I offer that maybe it could build her up? (Am I overthinking this? 😂 )", "Haha glad you can take a joke! Just seen your thing about the photographer charging 40 an hour to edit them out.. I suggest using fiverr,  you'll find someone to edit for half that price and done in a day", "Thanks for your thoughtful and detailed response, I really appreciate it. I didn't think about the comfort of wearing headphones themselves (like the comfort of it on her head?) but I think I can understand that. I did wonder if having earplugs would be alright but I see your point about having tried things in the past, she will know what works for her.\n\nTo be clear she only wears them outside/in social situations, so most of the time when she is in her own home she doesnt wear them. I'm only mentioning this because it would still 'look like her' if that makes sense.\n\nThat being said, I hear you on what you're saying, weddings are definitely stressful and I don't want her to feel uncomfortable. And you point about what photos I'll likely treasure is very valid too!", "Thats also a good point, thank you", "We are mutuals, but unfortunately she doesnt often post photos of herself so I'm not sure what her preferences are in that respect. That being said, a big piece of feedback im getting here is not giving her enough agency to let me know what her preferences *are*, so hopefully we can have a genuine discussion about it and see if we can work something out together! Thank you so much for your feedback and your suggestion, I really appreciate it", "She won't hear much. That's the point, they want to muffle all the noise", "thats a really nice idea! thank you 🥰", "Actually yes, ear defenders are probably the correct term! My bad. If she was open to it id be happy to pay for the ear buds (many have been suggesting Loop)", "I guess that she may not even want to participate in photos. Certainly not something that I enjoy 😬 but I’m sure your brother will guide you ❤️", "It is OP'S WEDDING.\n\nNo you will not be the AH. Plenty of other solutions.", "No problem - glad to help", "No it doesn't.\n\nIf Op asks, she says no, and keeps them on, how does that make it \"very obvious\" he cares more about \"perfect photos\" than her feelings?\n\nYou're extrapolating so much here.", "I feel people are being unnecessarily harsh.\n\nIf I were you I’d get your husband or someone else who knows her better to ask, or ask through them, and if the answer is no, then leave it.\n\nIf you ask her in advance that’s probably fine too unless you push the issue.\n\nIt does seem a little vain but whatever. To me I’d find it quite funny looking back at photos with their being massive headphones on someone.\n\nI think excluding her from the photo would also make you an arse. If it matters that much, have her at the edge of the photo + cut her out later.\n\nAlternative ideas:\n\n- Ask if you can accommodate it (total silence during picture taking). It seems highly unlikely she wears these 24/7, and that total silence would be unbearable.\n\n- Hire a photoshop whizz to edit the headphones out if they really bother you\n\n- and as you said, earplugs.\n\nI’d say as long as you’re polite it’s fine.\nI’m autistic and hate loud noises and even close family members do not try one hundredth as hard as you have. I’m usually told to deal with it and if a small accommodation is made it will be in concert with people expressing exaggerated irritation at having to use a napkin rather than a horrible squeaky tissue.\n\nMaybe the other autists here are used to better treatment lol.\nBut as someone who occasionally wears noise cancelling headphones I would not be bothered by your request in the slightest.\nI have been told to accomodate far stupider things in far more annoying ways, and the person asking me to has done so without a shred of sympathy.\n\nSo to finish it off, NTA, so long as you don’t push the issue (ask more than once), exclude her from the photos (putting at the side for one photo is fine), mock, etc.\n\nIn fact I would be delighted to have a family member act with the respect you do.\n\nAs long as you’re kind about it, no problem here.", "I guess it’s does make you an A H because she’s using it for a disability. But for me it’s just hard to say because I don’t know: how often she wears them, if she wears them in formal settings/all photos etc. and photo shopping them out if she does wear them might be offensive to her and adds an extra cost on your end. \n\nPersonally, if you don’t know her very well maybe just photos with and without her. I personally wouldn’t be posting a bunch of photos with someone I don’t really know anyways. You could also do one with just the siblings/parents", "> she's not actually an in-law\n\nNot *yet*.\n\nWhat you don't seem to realize is that *neither are you* -- yet.", "Honestly, I wouldn’t even mention it unless she mentions it to you.", "[deleted]", "Thats actually a pretty decent idea, forgot that there are other options for retouching full stop!! My fiance gets really conscious about his breakouts so actually might look into this anyway 😅", "Reading your comment was so lovely, thank you so much for your kind response 😭😭\n\nI will definitely take on board everything you have said, and thank you for sharing your experience as well. That is really so insightful and valuable, I can't tell you how much I appreciate it", "Thats a fair point! Thanks for the suggestion and for your feedback :)", "I'm not sure what your point is (genuinely). I'm trying to give an accurate represntation.", "Hmm fair point", "I wouldn’t even say anything, they’re fine the way they are.", "Hi. I've got FND (also use a wheelchair but that's not why I'm commenting). I use the LOOP earplugs. May be worth seeing if your sil has tried them. Not because of the wedding although they are very discreet but just because they may actually really help her.", "Let us know the update!! Hopefully it’s good!", "Actually thats a great idea! I get adverts for these on instagram all the time (no idea why), I completely forgot that they exist.\n\nThank you for your kind suggestion, I actually have no idea if she has tried them before but it would be nice if she felt there was something that could help her when shes out and about", "It's definitely worth mentioning. They have a 100day warranty as well so if she doesn't get on with them or decides to try one of the other different types she can. I know not everyone likes having things in their ears but they've really helped me. Last I heard they were also planning to use different materials for the bit that goes into the ear so there are more options. Not sure if they've done that yet though.", "I would say NTA\n\nYou're not trying to force her to be unconfortable at your wedding, you're trying to find a way to compromise and get the photos the way you would feel better.\n\nIs comprehensible that you would want the photos to be in a certain style at your wedding.\n\nAnd asking her to either remove them only for a small period of time or to use a smaller version that would still help her with her noise issues does not seem unresonable to me.", "NTA to ask. Or you can do family only photos, since she is not married she is not family. Problem solved.", "NTA , I'd make sure the photos are in a quieter area though and suggest getting her the Loop ear plugs as a bridesmaid gift if she is one! There's 3 levels and better than regular earplugs (the foam ones suck ass)", "NTA, you're just asking.", "YWNBTA…she has issues but it’s likely that Sophie can manage for a few minutes for the photos…particularly if they can come off and on as needed…she’s not going to necessarily be in every photo. Ypu can ask…and she can decline…and hopefully ypu can come to an agreement that supports both her needs and your wedding day. If she refuses and won’t discuss a solution that works for everybody involved then you’ll have a decision to make.", "She isn’t your future SIL, she shouldn’t be in any posed family photos. (She might marry your future BIL someday, doesn’t mean she should be in the posed photos.) There would be no reason you couldn’t do one photo which included her when you take a pic with just your spouse’s family, and then one without her. She shouldn’t be in any of the other family pix.", "Heavy sigh. NTA, depending on how it's done. Here's the thing, there are DISABILITY aids and there are COMFORT aids. These are drastically different things. Also, the woman may be perfectly okay with doing it, if asked with kindness. It's not fair for others to decide FOR her.\n\nDisability aids are like seeing eye dogs, hearing aids, canes, and wheelchairs. Comfort aids are like purse dogs and noise canceling headphones, meaning they can make things EASIER and less stressful, and someone can get really used to relying on their comfort aids, but aren't really NECESSARY in the way an oxygen mask is necessary.\n\nA comfort horse may calm someone's anxiety, but they can't bring it with them on a plane. A comfort cat may calm one person's anxiety while triggering allergies in others. There's eventually a line to where a single person's comfort infringes on other people.\n\nThe concept of sensory overload has basically two levels: social anxiety and true brain disorder. Yes, a wedding is stressful and noisy and can definitely trigger anxiety. \n\nA true brain disorder is shown either in early life or after a brain injury; it's where the brain has too many neorons firing and the person struggles to focus. It CAN be part of autism, or it can exist alone or with similar issues like fibromyalgia.\n\nI have the actual brain disorder (and fibromyalgia), but I prefer to avoid all but necessary large gatherings, shop from home when I can, work in a profession that's mostly quiet, and to find quiet sanctuaries when I do feel overwhelmed (like at Thanksgiving). I don't find headphones or earplugs helpful, since they just make my own body's sounds much louder in my ears.\n\nGranted,  I only go to weddings of people I'm extremely close to, and the picture parts are stressful, but then I go find a quiet place to decompress alone or maybe with one person.\n\nIf she's approached with you saying how you definitely want to include her and would it possibly be okay to take the headphones off just for a couple of minutes, she may be agreeable, especially if you can get the other wedding guests to be quiet for those poses and the photographer to not be loudly demanding (like some of them can get).\n\nHonestly, her using the headphones every second isn't healthy anyway. I wonder how often she uses them when just around her boyfriend. My point is that making her feel comfortable with your family may calm her anxiety enough that they're less necessary for her.\n\nThere's a difference between yanking them off her ears and just politely asking if it might be okay, just for a few minutes, and how you could accommodate her to make that happen. (Even a blind person could be far enough away from their seeing eye dog for long enough to take a picture, so I don't see it hurting this girl just to ask.)\n\nThat being said, your approach towards those protecting her from your request is another thing altogether. You might say something like, \"If I'm perfectly clear that no is an acceptable answer, could I possibly ask her how she feels about taking them off for just a minute and whether there's anything I can do to help her that would make it work?\"\n\nOr yeah, give her a headpiece that covers them up. Or use editing software yourself on those photos. But no, you're NTA. This is different than taking away someone's walker, although you'd keep that out of photos, too. \n\nBut wheelchairs would stay in, so you need to politely determine the girl's reliance on the headphones. But they're usually an anxiety aid, so try to focus on calming her anxiety.\n\nYou could also approach her as saying it's what you'd like for your wedding gift, since you know it's asking something difficult of her.\n\nIn my family, people know my pushing through my various health problems is often quite difficult, so I'm asked just to show up, not bring gifts.", "YWNBTA if you asked politely  and she said no and left it at that. But honestly just hire someone to photoshop it out lol", "Just leave her out of the pics or give her the choice... it would be less adversarial that way i would think...", "Talk to the photographer and ask if he can remove them from all photos. A photographer recolored a dress in all photos that stood out in friend’s wedding pictures.", "I would be suggesting that a GF of a brother I wouldn’t want in my wedding photos they are not married yet and there is no way you can insure that future do you really want someone in your wedding photos of a failed relationship perhaps in the future just my opinion", "Nta", "Just have them airbrushed out.  It will save a lot of drama.", "NTA if handled properly!  It’s okay to ask if she knows she can say no.  If the problem is the color could you buy her a special pair in the same brand but matching your wedding party colors and say you wanted her to be comfortable but still match all the colors!or buy the same brand but get someone to paint/decorate it?", "NTA. But respect her boundaries if she says no.", "You should buy her white noise canceling headphones and bling them out with like rhinestones or something!!  That way she doesn't feel like she's standing out.", "Could you ask everyone else to be quiet while she takes them off during photos? \n\nCould she wear earplugs during the photos and then put on her noise, canceling headphones?", "Why is she in your pictures anyway? She’s your fiancés brothers girlfriend", "NTA you can definitely ask", "I don't think it's too big of an ask, but maybe front the money for some Loop earplugs for her if it means that much. the nice ones are $50 but they'd work great and provide similar effects", "NTA.\n\nNot married then she shouldn’t be in the photos anyway. The earplugs are a great solution to the headphones.", "I'm curious what FSIL will do at her own wedding.", "I'd personally pay the extra 40. I get it's your special day. She has a reason to wear them. I know it's for a short period of time, but you don't know how that would impact her. I think personally this is a pick your battles situation and some headphones for her comfort aren't a big deal. Especially if it's a family photo. Y'all are all family, it's not like the headphones are something new. You see them often I would imagine. It would probably be weirder not to have them. Idk. If I wanted them out of my pictures, I'd just pay.", "NTA if you ask once", "My sister bought skin colored ear plugs, that could be an option?", "Man I think YTA if you ask a disabled person to remove their aids for a photo. Would you ask someone to ditch their wheelchair cause it’s not “aesthetic”? Plus why would you want her to appear as “Not disabled” in the photos rather than be happy for her to show as her true self in those photos.. her wearing headphones isn’t going to ruin your photos, and if you think they will, then YTA.", "YTA", "Stop thinking about this. This is not important and this is not something within your control. The wedding is a year away and she could buy a newer, smaller pair by then, they could break up, or better yet, you could realize how ridiculously superficial and petty this is, that this is not a hill you want to die on and that accepting people's differences is part of blending a family.  \n\nYTA. Think of it as a back brace. Absolutely necessary, made for function not for form and not an option to go without when in public.", "Soo, if someone in a wheelchair was going to be in the pictures you’d ask them to what, try and stand up? Noise can literally make a person with this condition have a seizure. I’m assuming you know what an ableist is? If you don’t, it’s assuming that the disabled person needs to be fixed. Something the bride may want to look at too.", "100% the asshole", "Just leave her out of the photos, since she is just your fiancé’s brother’s gf. She isn’t actually family at this point.", "NAH.\n\nBut at some point before the wedding you should have a chat with your BIL to say you'd like to include FSIL in your family shots if she'd be comfortable joining and because you know she has sensory sensitivity, is there anything you can do to make her inclusion comfortable?\n\nI recommend you talk to BIL because he's the family member and you don't know FSIL well, but would totally expect this to be a discussion between BIL and FSIL if there was anything they wanted to share. \n\nIdeally, have this discussion with BIL (&FSIL) at least several days before the wedding so you can prepare and share what you need with the photographer. \n\nIn the event that FSIL wants to opt out of photos entirely, your problem is solved. And, it primes FSIL to be photo-ready if she has a preference regarding the headphones. If she chooses to wear them when she steps into the frame for the handful of pics she'll be in, I suggest you just let her be her and don't mention a thing.", "NTA, you're allowed to ask. I'm sure earbuds would work. Ignore all the mean comments, you seem like you're being really reasonable.", "Well this is 2023 - You can have them edited out.", "Soft YTA bc it sounds like you are taking the feedback well. I think it would be acceptable not to include her in the pictures at all considering the relationship. If you do include her and the headphones I think they will be pictures that aren’t your favorites or ones that you’ll blow up into a large framed photo. They’ll probably be tucked away in a photo album anyway. \n\nMany people are suggesting decorating them but I feel like that is a horrible idea. Would you ask someone to decorate their glasses or a cane?  I hope not. I don’t think they will make her “feel festive”. I think that would just make you feel more comfortable. Just let her be.", "Unless the noise cancelling headphones are emitting the words \n\n\"breathe in,... breathe out,... breathe in,... breathe out,..\"\n\nand without them she would die of a lack of oxygen to the brain, then there is absolutely no reason whatsoever that she can't take them off for all of five seconds for a photo to be taken.", "I might be in the minority, but I feel that family photos should really show the beauty and diversity of the family. You have a autistic sister-in-law, who wears headphones. Maybe, instead of hiding the headphones, you can give her beautiful ones that are decorated and white flowers That look like a headband.\n\nThat being said, let your fiancé ask, or decide, \n\nNTA\nBut you would be if she said no and you pushed it", "NTA ! \n\nI understand that she has a disability and she needs the headphones, but if she takes them off just to take pictures, I don’t see what the big deal is. It’s not like you’re asking her to take them off for the whole time, just a few minutes to take photos. If I were you, I would directly as fsil, instead of asking her through your fiancé.", "Sorry- if she's not engaged, then she isn't a FSIL. Not yet. But there is no such thing as almost- either she's been asked and accepted or she hasn't.  \n\nAre all bf/gf being included in 'Family' photos?", "Not reading all the above I've seen your  updates and edits and I think either a quieter separate photoshoot or even Photoshop I think most photographers nowadays will be able to handle that ❤️", "Photoshop is a thing, maybe talk to the photographer and see if that's something they can do.", "Nta if she says no uninvite her", "NTA. I'm autistic and struggle with sensory input.\nIf for some reason she is struggling through photos ( generally pretty quiet) and the ceremony ( also generally not alot of sound going on)  \nShe can put in some loops or ear plugs or honestly get a grip for 10 mins cause we all know how to mask and while its not healthy to do it all the time there are situations ( a close ones wedding) where its WORTH IT.", "just take a couple of extra pictures with her NOT in the photo.  You already said she won't  be in all of the photos anyway.  Post ones with her and ones without her.  And put on your walls whatever YOU want.  NTA for asking though.", "NTA. You're only asking to include her in photos if I read correctly. She can look like she lost her helicopter the rest of the day.  I may sound like an A, but I spent time working with people that suffer from strange afflictions.\n\nIt's okay to ask. They can say no. You can also get other snaps.  I think you will do the thing.", "YWBTA, yes. She has a disability. \n\nWould you ask someone in a wheelchair to abandon it just for your photos? It doesn't matter if you know if she has an official diagnosis or not. It's not your business unless she wants you to know. \n\nShe will be family (edit: and even if she isn't). She has an assistive device in order to meet the demands of a world that isn't built for her comfort. It sounds an awful lot like your esthetics are more important than her comfort and security. Her humanity. The proper perspective would be that you are fortunate that she's willing to accept the potential discomfort of being photographed and being around new people and noises just to celebrate your special day with you. \n\nAlso, it's not up to you, as someone else here suggested, to tell her that the choice to wear them or not is hers as if that were somehow more tactful. OF COURSE it is her choice. All that would do would be to bring it to her attention that it bothers you and put her in an uncomfortable position of having to decide between your want and her need. \n\nThe only thing that might be under your control is the dress she wears if she's in the wedding.", "I really don't see any problem in asking/discussing alternatives with her. They have lots of noise cancelling options and she very well might prefer to not have her headphones in the pictures. Pictures are generally a short, more private time when there wouldn't be anywhere near as much sound. Like, asking her not to wear them during the reception for the aesthetics would definitely be an asshole move, but your request seems very reasonable?", "What if you all wear some and make it part of the picture that she is in? Like a theme or something so it could be fun for her too?", "I'm just going to say that in the future, having people as you knew and loved them in your wedding photos, with all of their quirks, flaws, fashions, personalities, and as they lived, will be far more important than whether or not you could sneak it in as a stock photo in a frame store.\n\nReal life, real people, and family, are important than instagram trends and a perception of perfection that does not align with anything tangible or breathing in your actual existence.", "Idk just let her look how she wants to for the photos and have them edited if it bothers you? Maybe find a pair that match what she's wearing to the wedding? Honestly if you stress about the little things too much you won't enjoy the day as much. Try to go with the flow, good luck with the wedding!! 💒💍 💖", "Her headphones help and support her needs ….would you ask someone to hide their wheelchair, crutches or glasses in a photo because they offend you! Accept your family", "If you edit the photos, then you do not approve of her appearance???\n\nIf she had crutches or required a wheelchair, would you ask her to ditch them for the photos?\n\nIf she says \"no\" to your request, will she be removed from the wedding party.\n\nI'd say ditch the whole idea of asking her that question.", "NTA. BUT... Idk for me that would be like someone asking to not have my SD (service dog) in the photos. On one hand I get it and it's not a super big deal if she is off to the side for two seconds but at the same time it feels like you're saying how I access the world is inconvenient for you to look at. Honestly NTA if you ask. Maybe you can style them temporarily (like a adding flowers to them, or wrapping them (temporarily obviously) in ribbons the colors of your wedding?). Honoring that her headphones give her ability where she otherwise would have a disability, BUT still making the headphones look cute for photos. I do that with my SD all the time. Hopefully I explained that well. It rubs me the wrong way because people comment often how inconvenient my SD (figuring out car seating, getting to airport extra early, etc.) and act like I don't have to live with the inconvenience of a disability. It easy for able-bodied people to say why don't you do x because it would be easier for everyone else. It's not wrong to ask but imagine how often she probably gets told her tools are inconvenient for others to look at or deal with. At the same time obviously just because someone asks I don't get offended, but it can be annoying to deal with it repeatedly. It's also your big day so if you asked me to not have my SD in photos i wouldn't mind, personally but i can understand why someone else would say no. \n\nUltimately NTA unless you pushed it or phrased it in a way that she's less than or inconvenient (even if you don't intent for it to come out that way)", "YTA \"He said he would feel very uncomfortable asking her to remove them as they are a disability aid \"\n\nThe end.", "\"I would be happy for her to have them on during the ceremony and the rest of the day\" 🙄\n\nTell grandma to leave her oxygen at the door too while you're at it. #cringe", "YTA.\n\nTwenty years from now, you're not going to care about the headphones, you'll care that she looks like herself in these pictures.", "YWBTA if you didn't offer an alternative solution. But it sounds like you want to! There are some really great earplugs that I use called. The brand is called \"Loops\" and they are basically invisible but do a really fantastic job at making noise manageable. I get really overwhelmed and anxious around too much noise and they have been a lifesaver!", "She has a disability and you want her to stop using the thing that allows her to function... Would you ask someone with a hearing aid to remove it because you thought it was ugly?", "It’s a disability aid. Honestly are you going to hang a wedding photo of the entire family in your house? Probably not. Get one with her in it, get photos with just parents. A million photos will be taken. And your fiancé is just as much part of the day as you I’m sure he wants a family photo.", "YTA. The headphones are not an accessory, they are a part of her body. Asking her to take them off is removing a part of her. They make her feel safe within herself. Making her feel uncomfortable and unsafe just to please your photos and so they “look good” is selfish. If you are going to be her SIL you have to accept all of her.", "I ain’t reading allat but no", "I agree with everyone that says it depends on how you do it. My AirPods are fantastic with noise cancellation. Just make sure you’re bringing it up as a, let’s make everyone happy topic and I would think it’s okay", "Noise canceling earphones are the answer. It's minimal and serves the same purpose.", "I dont think it hurts to ask but I like the idea of decorating the headphones", "INFO what is the scene like, where the photos will be taken? Will it JUST be the party, and quite quiet? Or will there be lots of noise and stimuli? Edit to add: can you take family pictures w her that are in a quieter place?", "You never know what will happen between now and then. Why borrow trouble? She may not be in the picture literally by the time you get married. So many people strive to make this day \"perfect.\" In the long run, it's the people and relationships that matter. The rest is just window dressing. I too wanted the perfect wedding when I was 22. My parents and my ex's (get the reference \"ex\"?) were not having it. We were married for 25 years. Last year I through out the wedding pictures after my present husband and I had been married for 16. They were beautiful pictures but they didn't tell the story. Respecting each other's differences, embracing those who care about you and your future is what is most important. It's just a day,", "NTA to just ask, but if she says no, then YWBTA if you push the issue", "There is nothing wrong with asking, but be prepared for her to say no due to her being uncomfortable without them. My suggestion would be to let her wear them, then speak to the photographer & ask him to remove them from the pics via photos hopping. Many people do that today.", "You are kinda yta - I'm autistic as well as other issues. and my brother got married and I was a bridesmaid. He made his day the best he could by including me with me just being me. I was welcome to stim whenever and wherever even in photos. The headphones/ear defenders are part of her. You've said you haven't met her often. Maybe speak to her about her diagnosis and ask how it affects her and stuff BEFORE you approach the headphones. Maybe if you got a better understanding you would then know if it'd be right to ask about the wedding and stuff. It's possible if you approach it the wrong way you're gonna cause your family a lot of drama.", "Just customize them so that they match the wedding decor.  Make her feel more involved too.  My SIL left my sister and I totally out of the wedding, while my brother included her siblings.", "😆", "Yes YtA.", "Treat it like a wheelchair and let it go. You will get a million pictures most will be good.", "As someone who is autistic, I was asked the same for a wedding photo, I did because I felt I annoyed the person for having them on, but during that 5 to 15 minutes everyone was screaming and laughing making me have a mini stimulation overload of noise making me cause a scene, haven't been to a wedding or a big event since because I kinda ruined their day because of my own problems.\n\nI'm not saying YTA bc you're not, I just want to say to just make sure she's alright during that time, that's all, maybe see if she want a hug or to hold someone's hand to keep her calm, something that might help.\n\nI hope you had/have a wonderful wedding BTW!! Xx", "You kiddn? You have a wedding. Have a day. If ya don't  like your guest, don't invite em. If ya do, take em as they are.\n\nYTA and have a good life", "Isn’t the idea to have photos of the family? If this is her all the time, why does it matter? Why does your idealistic idea of aesthetics matter more than family pics? I swear I don’t get the narcissism of todays weddings. Are you getting married to be with someone and his family? Or just to show off for a few months ahead of time and one big final day?", "No, you wouldn’t. I would suggest you both talk to her and the brother. Tell her the photo shoot will be very private in a very quiet place and assure her everyone will respect her needs.", "YWBTA if you asked her to remove her headphones. They aren't just for comfort they can help prevent a myriad of symptoms including seizures.\n\nWould it be possible for her to just decorate them in a way that would make them stand out less, maybe like some type of floral headband look?", "YTA- why is this even an issue right now? You’re asking someone to commit to something months in advance because you are concerned about a visual for an event that is months away. YTA now for even thinking it.  This is no different than the brides who have a two year engagement and then get pissed that their friends get pregnant and will be showing/can’t drink at the bachelorette party.", "Um….yes you are. Asking someone to remove that out of their comfort zone is like asking someone to remove their prosthetic leg.", "Find a good Photoshop artist to remove them after, you could find a good one cheap on fiverr", "we got that photoshop nowadays", "I’d come to her from a point of understanding and maybe try to accommodate her needs by doing the photos with her separately from a larger crowd (strictly family) if that makes her more comfortable, and make sure the photographs are done quickly so as to not overwhelm her. But absolutely do NOT push it.", "I'm glad you're listening to feed back and are respective to a lot of the ideas you're getting it's always nice to see hope yall work something out", "Would you ask a physically disabled person to leave their walker, cane, or wheelchair out of the photos?\n\nYWBTA.", "I have an audio processing and sensitivity disorder. I have tried so many different styles. Loops are seriously a game changer and very discreet. \n\nYou're not an AH for asking, however, have you thought about asking photographer if they can photoshop it out? To me personally, it would be like someone asking me to not bring my service dog. Her headphones are a medical device, even if they are not \"normal\". Wouldn't you find it inauthentic for her headphones, something she uses every day of her life, to be taken off during photos? To me, you sound like you have some internalized ableism because you wouldn't tell someone they can't use their wheelchair or oxygen tank. \n\nYour FSIL is doing what she needs to in order to be there for your and her brothers big day. Please accept her as she comes. Maybe you can decorate one's with her or buy her a fancy set? My best friend bought me super discreet ones for a photoshoot.", "Are you going to ask people to take off their glasses too? It's a disability aid, and since it's his family I would go with your fiancé's lead. So if you did, yeah, you're kind of being the AH. \n\nThe other thing is that if you decide to ask, prepare to get a, \"No, I'd rather not,\" and take that graciously and still include your new SIL.", "How does she do when she does not wear them ? I’m overstimulated with sounds and love flying or grocery shopping with noise cancelling earphones but I wouldn’t act differently without.", "YTA", "It's 2023 people wear things on their ears and head all the time. \n\nWould you dictate the hair styles people in your photos will have or the shoes or earrings, necklaces, rings?\n\nThe headphones are just a personal accessory choice. I would choose other battles to fight, this just seems silly.", "[removed]", "Question: what is FND?", "They make special ear plugs that are for people who are noise sensitive and/or have ASD. You might check them out and offer to buy her some to try out. If they work for her, she may be able to switch to them for the photos! Two of my kids use them. The brand is Calmer. You can’t tell they’re in until you look straight into their ears", "Not a professional wedding photographer, but done a few weddings. Talk to your photographer, they may be able to do the posed photos between the wedding and reception where it's a calm and quiet environment. Actually the way I preferred to do them. This would also work if you are doing a photoshoot at a park or somewhere on another day. \n\nAlso talk to your future SIL, she may consider the headphones a part of her and want them to be included in the photos. Respect her choice and just go with it. Those headphones are part of what makes her the beautiful, unique, and wonderful person she is. I definitely wouldn't want to just edit them out of the pictures, especially without her knowledge.", "If you really like her u could buy her a pair of noise cancelling ear buds like AirPods Pro 2 or Bose. They’re pricey but not as noticeable.", "There are noise cancelling ear buds I've seen advertised. I think one was loop(s). They may solve this issue if she's willing to try them.", "How many photos are you wanting her in? If she is currently the girlfriend of your fiance's brother then likely not very many. Maybe photos with the extended family and one of your brother and her together? \n\nThe vast majority of your photos will not have her in anyway.\n\nI see no problem in asking, as long as you accept a No. Maybe phrase it \"I am not sure how much of a problem it would be for you, and I hope this question doesn't offend you and if you don't want to then it's fine however I would like to ask if you are able to remove your headphones for just a few photos at the wedding, it would be for just a couple of photos and should hopefully be for less than 5 minutes, but I will accept it if that's not something you can do.\n\nAsk her in advance so she has time to think about it, don't put her on the spot as you are taking the photos.", "I think asking kindly if she would mind, ywnbta. Standing firm and making her not be in the photos if she won't remove them... Yta. Maybe look into noise cancelling earbuds as an option if she is open to it. Unless she is unbearable it seems a reasonable conversation.", "You could ask, and if in the end it doesn’t work-I’m sure some pretty minor photoshop could hide them", "NTA unless you're pushy. Could she use discreet earbuds or plugs?", "[removed]", "Nta to ask.\n\nHaving alternatives helps.\n\nI cannot have anything in my ears,\nBut asking if they could take it off for your official pictures, or find a pair that matches like an accessory with her outfit.", "They have really subtle pretty ones that look like earbuds? You could buy her a pair as a nice gesture AND get what you want (I.e. nice pictures).\n\nhttps://us.loopearplugs.com/products/experience?variant=45556099776745&utm_source=google&utm_medium=cpc&utm_campaign=Multifeeds%20US&utm_content=Experience&currency=USD&gbraid=0AAAAACj0PVwsUywPu6lI2yj5m-6qaiQ0J&gclid=EAIaIQobChMI79H6y86UggMV59vICh0L_QEyEAQYBCABEgKi3vD_BwE", "Is there a way to have her find areas where she would be comfortable taking her headphones off for the photos?  That to me would be a great compromise and show both she and your brother that you are understanding, supportive and driven to have her be a part of the family in ways she is able to do given her condition. This may mean limiting the number of people in those photos or doing them in more remote areas of the venue but I think you will have phenomenal pictures if you work with her and your photographer.\n\nAlso, if we are being honest, been married for 5 years and haven't looked at more than 3 photos from our wedding...", "If she says no can she just wear ear plugs..no one can see those unless she's turned to the side", "NTA there is no problem in just asking. That opens the door to finding other solutions should she not be comfortable with that.", "NTA If you ask. You will be if you push.", "I maybe late to the party, but no, you would not be the asshole. \nIt's your big day and you want everything to look as nice as possible and you are willing to work out other options. This definitely takes you out of the asshole group.", "NTA unless you push the issue. Maybe you could get the photos edited?  They edit all sorts of stuff out.", "NTA for asking especially if you’re offering alternatives", "NTA", "NTA", "I think you can answer your own question by thinking about whether you would ask someone to remove their glasses, cane, crutches, or wheelchair for photos. The headphones should be seen in the same manner as the other disability aids. Some people may feel that they would want to remove their disability aid or use a less intrusive option for a photo for aesthetics and that would be their choice but it would be rude to ask them to do so. You could ask FSIL if there are ways you can accomodate her through the wedding (quiet spaces etc.), including doing the photos with her in it in a quieter, less rushed way. But that should be seen with her comfort and accessibility in mind rather than pushing the aesthetics.", "Can you ask your brother inlaw what he thinks about this?", "YWNBTA, but just note that if she refuses then it's almost certain that she is on the spectrum, or something similar. In which case YWBTAH if you pushed it.", "She’s the gf. Not family member yet. She should be able to take them off for the 10 minutes she’s needed for a few photos.", "Definitely WNBTA to ask\n\nIf you ask politely, phrase it as \"if you would feel comfortable\" and present her with the options you mentioned of smaller ones or earplugs for the time being. You could also talk to her if having a private photosgiit would be better for her. But as long as you make it clear that it's her choice, and if she doesn't feel comfortable with it, it's okay with you, I don't think it would be a problem to ask", "Can the photographer photoshop them out?", "Does  not matter who she is if she is important  enough  to be at your wedding  she should  be important  enough  to be as is for your pictures that is who she is and you should  accept  her as is. They are just pictures.", "NTA You asked your fiance first , which is appropriate. Navigating these things now will make things flow smoother. I'm sure you could do photos with her in them first or last to avoid her being over stimulated.  However , would you ask someone to take off their glasses or hearing Device or wheelchair for the sake of your photos ? This is who she Is,  headphones and all. You can ask her if she's comfortable,  the worst she can do is say I'm unable to do that and you adapt. Perhaps look up some wedding photos of others wearing headphones . I promise you it won't be as bad ad you think. If you want her represented in the photos then I think you should allow them .", "YWTA however there is also the option of loop earplugs are for those with noise issues but where you can still hear people talk and they are not noticeable at all in your ears, she may also have never heard of them so if you bought her a pair to try for Christmas or something?", "That is your wedding. She can take them off for a few.", "Good lord. YWNBTA. We don’t need to tiptoe over people. Why is your fiancé afraid to ask? Why are you? Asking isn’t a mean act. And it’s a totally fair request. Frankly, I bet that she would just remove them anyway - why would she want to see herself in formal photos wearing over-ear headphones? Can’t you just gently bring it up now so you don’t have to worry?”", "After reading your edits, (and before) I was going to suggest to somehow incorporate them aesthetically into the photo shoot. As a person who is neurodivergent, it would be hell to have to put my mask (as in pretend I’m not suffering in sensory hell) on for the comfort of someone else, especially because I do it everyday. 5mins can feel like an eternity. And sensory input is a lot more unbearable that you might think. So even if one of you ask, FSIL would be either very upset or feel rejected. The equivalent would be asking someone who needs crutches to stand up, to leave them at home because they “look tacky” So YTA.\nI find it a bit ableist and/or insensitive to make this request.", "What's FND?", "I love how respectful and helpful the replies AND OP are in this discussion", "Light YWBTA, Can’t the FSIL just be herself in the family photos?  Especially if she’s not in many photos.  I wouldn’t ask anyone to remove an item that helps them and that I see them wearing all the time.  That’s who they are and she’s about to be family.  I just wouldn’t think a few pictures would be worth telling someone that they need to remove an item they wear in public everyday because you don’t want it in your pictures.  I mean WHY don’t you want them in the pictures?  Because they look odd?  Affect the aesthetic?  What will you really be telling her if you ask?", "When/if you ask her if she might be okay with it (and it might be “I’ll see how I am that day”), you might also ask if there are other accommodations you can make to make it easier on her? Like, maybe a quieter spot, or before the wedding, or … I don’t know, but do ask her.", "NTA but it may be a bit much for her to take off the headphones.  I think they are kind of interesting actually, you'll look back at those and say, oh yes, that was So and so, and she wore noise cancelling headphones because.", "This is what I came to say. Asking with the caveat that it’s okay to say no (or even change her mind later) and not pushing.", "Just take double pictures. Some with her in them and some with her not in them if she doesn't want to take them off and decide which look better after.", "I would quickly like to point out that the bit about integrating your disabilities into your identity is not universal.\n\nIf somebody offered to photoshop all my pictures to remove my mobility aids I'd take their offer in a heartbeat.", "I love the idea of the flower crown or other decorations!", "This was really beautiful. I would like permission to reprint this and hand it out to my pre-med students.", "I would literally not give a single fuck if someone asked me to take my glasses off for their wedding photos. It's not a medical device that's needed 100% of the time, she isn't asking someone to forego using their wheelchair for photos. It's a bit ridiculous honestly. My 5 year old at the time autistic nephew wears noise cancelling headphones everywhere and even he was able to go without them for certain parts of my wedding (though I did not ask for this). If she truly needs it for the full duration, I don't see the harm in asking if she would be comfortable just wearing earplugs for the photos. It's like if someone asked me to wear contacts instead of glasses. I would probably opt to go without glasses all together tbh but I certainly wouldn't be offended by the ask. I'm neurodivergent and I fucking wish people would stop trying to coddle us like we cant handle the emotional stress of a simple inquiry.", "And photos can take hours!", "LOL. Yep. When my brother and his wife split after only 3 years, my father went around putting smiley faces over her face in the family pictures.", "Yeah she won’t be in any photos you will\nActually frame anyway.", "And what happens if they do get married?", "This was exactly what I was thinking. When my husband and I got married 22 years ago, his nephew was his best man. The nephew's on again off again girlfriend/future baby mama was included by my MIL in our family picture. I've only seen her maybe once a year since then and only in passing but I'm stuck with her in my wedding pictures. Also, NTA to ask. This is your wedding and this is the one time in your life that everyone involved that will be in the formal pictures, including non-wedding party family members, should look their very best. You, as the bride, deserve to have the pictures look perfect because you will be putting a lot time and money into having your dream day.", "This is an important point for OP. even if you decide to have her in some of the pics, she shouldn't be in the \"family\" pics. You're NTA for asking about headphones.", "This doesn't make sense. So wrong if you give her time to prepare in advance, maybe see how she handles being outside without the headphones, time to prepare.\n\nBut right if you do it on the day, and put her on the spot, making her feel like sht because now people are waiting on her to decide if she should take off the headphones.\n\nIf it was me, I would want to know in advance. Perhaps I could get noise canceling earphones instead of headphones for that day.", ">it’s her choice if she would like pictures taken with or without headphones on. \n\nNope. At least not for me. I'm ADHD and this sort of phrasing would either make me feel pressured not to wake them or like it's fine. \n\n>Maybe she doesn’t want to have pictures taken with them on.\n\nThat feels like a really weird assumption. If they make her that much more comfortable, she'll more likely want to keep them through something stressful and weird like a photoshoot.", "Depends on the headphones. I have a pair of in ear that will block the world out. No good conversation and I would end up shouting if I tried. \n\nMy over ear still block out most everything. Talking is mainly blocked and I would need to reduce the cancelling to be able to have a conversation without shouting", "There isn't really different \"levels\" of noise cancellation one can choose from (to my knowledge), but there's certainly different _quality_ of noise cancellation equipment.\n\nThe cheapest ones mostly just work like ear plugs - they dampen your hearing, it's like turning the volume down on life. It's not really blocking background noise - it's dampening all sound, including conversation. On the much more expensive end of the spectrum, you have devices with microphones that produce \"anti sound waves\" to cancel out the background noise - how well/what sounds it identifies as \"background noise\" and how effectively it blocks it, depends on the quality of the equipment.\n\nAs someone with fairly average hearing and sound sensitivity, with the cheaper ones I can hear normal conversations around me, albeit it's like the people are murmuring rather than speaking at normal volumes. And I will still be aware of the ambient background noise - it's just at a lower volume than normal. Honestly, I hate the experience a little bit - it's just plain _weird_.\n\nWith the more expensive ones, I can't hear normal conversations in the background, unless they're louder/more high pitched than average. I can however hear people speaking _to_ me/talking very near me - though it feels like someone put the TV at sleeping volume, and I have to strain to hear it. I am not aware of the ambient background noise with them on - the world suddenly sounds very loud when I take them off, but I don't notice the lack of noise with them on (which is not to say there's a cone of silence; it's kind of like going from the ambient noise of a densely populated city centre to the ambient noise of a library). Some background noise, like cars honking, does filter through - but the volume is turned way down.", "Or at lot of times people do family photos before, and it's much calmer/quieter. If that's an option, she may be happy about the opportunity or at least interested.", "Ding ding ding! we have a winner!!!", "Honestly, same", "Part of the family is debatable, she is not married. OP can take some photos of family only without this person BIL dates. People do it all the time.", "I appreciate your kind response! thank you 😭", "Oh please, it’s not like she’s taking away someone’s wheelchair. The hyperbole in the comments is really over the top.   \n\n\nMy glasses are medical equipment, but I wouldn’t throw a fit over taking them off for 5 minutes.", "Actually. You know what. \"We all know how to mask\" and \"she can get a grip for 10mins\". \nYou are fucking weird.", "She’s not autistic, she has FND - a neurological disorder. A loud noise can cause seizures or paralysis. “Get a grip”?? Are you serious?", "Because the thing that she needs to function and be part of the world isn't a fashion accessories or unwelcome prop that is up for anyone else's decision or discussion. That's why. Believing there is a right to bring it up for discussion in the first place is the problem.", "Thanks for your reply :) I appreciate it", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Functional Neurological Disorder. \n\nI was going to say not TA until I read up on it. Totally YTA. \n\n“Audio symptoms can be anything from ringing in your ears (not always a functional symptom) to heightened startle response to sound. The family dog may bark triggering a non-epileptic seizure, paralysis, or other movement.”\n\nHow the hell is OP going to control every possible situation? Seriously, OP, she needs the headset for her damn safety. It’s not a fashion choice.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Same here, I'm autistic and I wouldn't mind someone asking as long as I knew it was also okay to say no. They have to make that clear when they ask though or I won't know.", "Ask her to try Loops brand. My daughter has sensory issues, and these are our go to. And they fit comfortably against the ear. She wouldn't stand out, but she'd still be more comfortable. And for $20 to $40 on Amazon depending on style; it's easy enough to try them out to see if they work for her.", "So I have FND and also get really overstimulated by sounds. I can’t wear over-ear headphones. I have Apple AirPods Pro and their sound cancellation works wonders for me. \n\nI don’t think you would be TA for asking, but FND can cause seizures and other problems, so please be understanding if she isn’t comfortable. \n\nI mentioned the AirPods Pro (specifically the pro, not the standard), in case she has never tried them and maybe they would help her. Those of us with FND have to help each other out. 😊", "Could you ask your photog if they could photoshop them out? If your FSIL is uncomfortable taking them off for pictures, could you ask if she would be okay with you having them digitally removed? Photographers (especially good one) can do crazy stuff in photoshop. YWNBTA, especially if you’re okay hearing no. Good luck with wedding planning!", "Spurge a bit and turn the two pictures into the holograph prints that switch between the pictures at different angles for the full effect.", "So let's just exclude a family member because their disability doesn't look pretty enough? \n\nThat's a whole lot of ableist yikes right there", "As someone who is autistic with auditory sensory issues. And has also been in a wheelchair they are not the same lmao .  No ones gunna smash to the ground without headphones for a couple minutes \n\nIts not medical equipment its a support tool for regulation.  Were not incapable and become incapacited not using a tool for 5 mins 😭😬\n\nIts more like asking someone with a broken leg to hide theyre crutches. Unless theyre like 90+ they can manage that easy .", "The simple fact that OP even considers them obtrusive bothers me, tbh. Why does it matter if she’s wearing them, why does it matter if they stand out, people shouldn’t have to hide their disabilities/conditions and they shouldn’t be seen as something people feel justified asking you to remove. If she was comfortable removing them for photos I assure you she would do so without prompting, asking *is* rude.", "Just a suggestion, we did a photo without SO’s that weren’t married-engaged and then one with them. It’s pretty normal for the weddings I’ve been to in the US Northeast.", "You're very welcome! Thank YOU so much for being open to feedback, and recognizing that it's not a personal attack on you. A lot of people aren't great at that, so taking feedback like this on board quickly and willingly is part of being a good ally and I really appreciate it.", "Would you be able to arrange for pictures in a quiet space? Between the ceremony and reception with just family members?", "You only met her 3 times and youre gonna have that conversation?! Bad idea. \nHopefully no other disabled people show up for the photoshoot, hate to put you out like that.", "Oh absolutely! I tried to couch my declarations with words like \"often\" but it definitely bears repeating that these things are *very* individual.", "I can't take credit for that idea lol, saw it in one of the OP's edits.", "You're certainly welcome to! I would also include some of the other users' comments in response, though, to show that there's definitely a diversity of thought on the issue. Some disabled people would like nothing more than to have a photo where their disability aid isn't shown. Others care nothing one way or another. Some might object to it as potentially tiptoeing around too much, which can be infantilizing (although I would argue that providing a polite way to ask for someone's preferences tends to *reduce* tiptoeing behavior by enabling them to ask more directly than they otherwise might). Everything I said should be taken as tendencies or possibilities, and I would recommend running it by other disabled people before distributing it. \n\nMy own disability is largely invisible and so I have mostly written this based on what I have read and learned from others whose disabilities are more visible (and from the observation that many able-bodied/neurotypical people just happen to be very attached to their visual identities in non-disability-related ways, too; the issue only becomes more fraught when it is related to marginalized groups). So definitely run it by some other people first!", "I do get what you're saying, and I'm not trying to coddle anyone, but just to encourage general good behavior. The point I'm trying to make is one about kindness and politeness-- it's not about whether someone can *handle* a request, but more that it shouldn't be an issue of whether they can handle it anyways. I could handle someone walking up to me and telling me \"You're a stupid idiot and I hate you,\" and would be baffled rather than offended; but it's still not a nice thing to do, and I would advise someone against doing it. It doesn't say anything about my or anyone else's ability to handle things for me to say \"maybe don't do that.\" \n\nI also personally wouldn't be *offended* to be asked to remove glasses, even though it's not my preference and I do consider myself more \"me\" with them on. I tend to offer so as not to put someone in the position of having to ask, even. But it's worth noting that some people WOULD.\n\nBut some people really DO see their disability aids as part of their visual identity and, separately, many people also dislike perceived implications that their visual identity is not good or decent enough for formal photos. There is a real historical issue of disabilities being considered unfit for \"polite company,\" too, which might cause some to object on that basis. If you ask someone to change part of themselves for only photos, and not anything else, then does that mean that part of themselves is somehow too impolite or unworthy of being recorded and remembered? And since one can't know beforehand whether or not someone has that perception, it's only decent to ask their preferences first. \n\nWe have plenty of posts in this very subreddit of people being offended at being asked to cover up non-obscene tattoos for wedding photos, and those aren't related to disability at all. So the observation that people tend not to like it when you ask them to change part of their visual identity for photos is just that-- an observation. \n\nOf course, someone might not see things that way at all, or might *prefer* to have permanent records of themselves without reference to their disability. That's why the only way to know really is to ask.", "She isn’t autistic. She has FND, which can cause seizures from overstimulation. This is less like asking to remove glasses and more akin to not using a glucose pump.", "Yeah…for the bride, groom and wedding party. For formal shots specifically including FBIL’s GF (who isn’t in the wedding party, from the sound of it), it’s likely not such a time commitment.", "yeah definitely get a few with her in them but try to have some that have the people you know you’ll want in the pics forever without her in them just in case!", "I was asked to step out of family photos when my niece got married because I was not family. I had already started to move out of the photographers line of site. \n\nBoyfriend now hubby was pissed. \"We aren't even engaged yet and it isn't our wedding, so pipe down.\"\n\nNiece and her husband are now divorced and hubby and I are still together. irony. BUT it **was** the right decision at the time. I fully supported bride.", "I guess if you’re prepared to create the environment prior to pictures. Get all the people together & equipment ready. Sure try it out before hand. No guarantees it will be the same on the day of wedding.", "Potentially not very clear to someone who might be neurodivergent.", "Do those in-ear ones block out voices? Been trying to find a decent pair of nc headphones/earbuds lately", "Good luck! It’s a very awkward situation", "Yeah, this was my take, too. It's okay to ask her if she \\*wants\\* to wear them in the photos or not, but if she'd rather have them photographed as a part of herself, then it's weird of you to care very much either way. Some people come with equipment. That's not weird, and it doesn't actually hurt the aesthetic of the photographs unless you have feelings about it.", "You've only met her 3 times.\n\nShe shouldn't be in your photos anyway.", "You might also arrange things so that she would only remove them after everyone is arranged/ posed, so that her being without them is for as short of a time, as possible. She wouldn't have them off during the whole photo shoot. And, I would also recommend doing some with her in them, to show a realistic look of the day.\n\n It would go: \n\nCall people up. \n\nGet them arranged. \n\n\"That looks about right. FSIL, are you okay to take them off now?\" \n\n*Click, click, click!*\n\n\"OK, FSIL, we're good for a few minutes. Thank you!\" \n\nFSIL puts them back on. \n\nThen, go onto the next group or pose.  \n\nPlease note, this would of course only be if she was ok with the photos of her being without them. If she truly sees them as an extension of herself and is offended, then, of couse, apologize.  Btw, having whatever she usually wears decorated, etc, might still be the best option, as the stress of the day might make her unable to go without, even if she wishes to.", "Why not just accept her as she is?", "Wow telling an autistic person their weird how original never met a nancy who didnt suck", "Do you have a brand/type that works for you?", "I like the idea of suggesting and offering to pay for an alternative.\n\nAnd if it hasn't already been suggested, I would add...don't spring it onto her too close to the event. Bring it up several months in advance so she can try them out and get used to them first.\n\nAnother thought is to have a backup...maybe plan to do all the pics with her first...kick everyone out who is not in those pics (if that's feasible...may not be)\n..once her pics are done, then you can open the room.\n\nI like how you are asking your fiance first and getting him on board. He probably knows best how to \"handle\" his family for this situation.\n\n NTA", "I also have FND but I personally can't wear anything in my ears because I have ear problems, I'm far more likely to get inner ear infections (which are horrendously painful at worst or hellishly itchy at best).\n\nBut then you likely know that us FND lot have a wiiiiiiiide range symptoms so, yes, totally agree about us helping each other our! ❤️ my suggestion to OP would be to have a chat with SIL and discuss how to keep her comfortable at the wedding ^_^ \n\nYou never know, OP, FSIL may already be thinking \"oh gee, what should I do at this wedding, I don't want to be wearing my best dress with this cans!\" Talk to gee and get to know her :)", "WTF dude. No one at any wedding is in every single picture! It is perfectly normal to have different parties and different people in all the pictures. My entire point of suggesting this was for her to look at the pics with the headphones on and say.... ohh this doesn't bother me as much as I thought I did.", "FND can cause seizures. Your experience of disability isn't the only experience.", "\"No one's gonna smash to the ground without headphones for a couple minutes\".\nWell, really, for some people on different ends of the spectrum, yes that can happen.", "Would you ask someone to just stand if they are usually in a wheelchair? It's really not ok to ask. She already knows that most people don't wear headphones and will look \"weird.\" This is extremely ableist.", "In the midwest it's super normal here too. Immediate family, then SOs with immediate family.", "That's where I am.", "🥰💖", "yup.  seen this a lot. the wording absolutely matters to the response.", "I’m only diagnosed with ADHD; I never related to the autistic experience of never intrinsically picking up on social cues, but shit, this might make me consider whether I’m actually AuDHD. 😂 This has to be one of the most obtuse “take the hint” moments I’ve ever heard from neurotypical folks.", "Right but the point isn’t to manipulate or tell her to remove headphones. It’s the equivalent of telling someone they have to remove their glasses for photos because they’re not “aesthetic” she absolute should ASK because it doesn’t matter what’s aesthetic, these are a disability AID. And it’s up to the disabled person to CHOOSE if they’re comfortable going without their aids for a photoshoot. Not a fucking decoration.", "It's not fine. These headphones are apart of who she is and by requesting that she remove them, you're essentially saying that you don't want any disabled people in your photos. Would you politely ask her to get out of a wheelchair if she needed one? I'd hope not.", "And that's supposed to be better somehow? \"It's ok to be rude, she doesn't know she's being insulted.\"", "Thank you so much for sharing your perspective. I'm one of those people that can't operate in silence, because it's never true silence. I hate the weird noises of everyday life but I thought I was the only one. My first go to is music. I can't really explain it but playing shows like Midsummer Murders or Vera at a low volume allow me to concentrate on my reading.", "Frankly I’m not sure. My old ones did. Bose quitecomfort 20. They were wired and simply the best noise cancelling I’ve had. \n\nThe others block some but not as good. \n\nMaybe ask on the Bose subreddit to see if anyone has new experience with the new ones", ">yet you still wanna ask her to take them off and suffer for your vanity.\n\nDamn, chill out.", "> Are you asking fat people to loose weight?\n\nI wasn't aware fat people could take off the fat for 5 minutes and then put it back on.", "Wow, playing the victim card then blocking me. Lol\n- signed, an autistic person who thinks you're actually ableist, and that's why you're weird.", "Yeah, ear buds fall out of my ears and are very uncomfortable.   I wear earphones when I need noise blocking.", "Bose Quiet Comfort II or III would be perfect.\nNoise cancelling, Bluetooth, TF card and FM radio. Discreet and extremely comfortable.\nI think Bose has a sale on ATM, and they make some of the best speakers in the world.", "Your first comment reads to me as though you're suggesting that pictures be taken both with and without FSIL and then OP decides if she's ok with how the pictures with FSIL in them look. Then choosing which pics to keep based on whether FSIL is in them. Therefore either including or excluding her based on looks.\n\nDid I misunderstand you?", "And unless we're assuming bad faith on OP's part, that would have been mentioned if it was the case. Come on.", "If that was a possibility dont you think the bride would know that ?  Seizures are serious and talked about with people close and around often to they people know how to help and what to do so im 99.99% sure this is not the case in this situation ....", "Honestly I say this as someone with a psych degree who is diagnosed with ADHD and autism and I have PTSD if she cannot manage that she is probably not able enough to be in a relationship. I think people without this diagnosis or proximity to this diagnosis has an issue with infantilizing people. A few minutes will bring nobody to tears but keeping those headphones on could you see those of us with autism no matter where on the spectrum it is understand we still understand we might struggle but we understand that there are times you can or cannot do things and if for some reason this grown girl which we're all just assuming is going to some reason fight back on this cannot do that she is probably not sound of mind enough to be in a relationship with another adult I would worry about abuse in that situation and she probably isn't working can't do school blah blah blah blah blah right like realistically she will be okay photos take Max 5 minutes for people who aren't the mom and dad or bride and group", "Are all of this thread mental midgets? Leave her to the earphones. Sick in the head is what ya'll are and fk off", "This is nothing like the need for a wheelchair. Vastly different. Unless your ask someone to use their purple wheelchair today instead of their black one. I see many scenarios where that's not an AH move", "In ear, noise canceling earphones is the answer. It's minimal and serves the same purpose.", "This is not a universal experience.\n\nI was on crutches for a time. If someone offered to take all my photos from then and edit out my crutches I'd take their offer in a heartbeat.", "I’m commenting on how you said “it makes it very clear”. I’m just saying that it probably isn’t clear. Not commenting on if it’s better or worse", "Oh yes, I was hesitant about using noise canceling headphones at first because I like to hear what's going on around me and don't like total silence either (it's impossible to get total silence, and too much silence makes changes in noise levels even more jarring imo), but they really don't block out all sound, they just dampen the ones you don't wanna hear in the first place anyway :)\n\ni'm guessing having background noise that you like helps you filter out the weird noises of everyday life / covers up the everyday noises, and that's why it's easier to concentrate on your reading. I use a fan on full blast at night to sleep for a similar reason-- the noise of the fan is not irritating to me, and it helps to cover up other noise changes in my environment that might otherwise wake me up in the middle of the night.", "thank you", "I think an offer like \"Hey, can we add a flower crown in wedding colors to your ear defenders?\" would be a really good way to approach it. This shows that you are NOT expecting her to take them off, and that you're inviting her to be part of the festive wedding prep (one elderly friend who attended my wedding put flowers on her walker just to be festive--she wasn't even in any posed photos). It also gives HER the opportunity to say something like \"I was actually planning to take them off\" or \"I have earbuds that I use for formal situations\" or \"the photos sound too overstimulating, can I skip them?\" or anything else that might apply to her situation.", "You are correct. I have it too and although mine is extreme noise has never affected me", "Loop is good if you need to hear conversation but they're not as powerful as blocking noise because of that- it just focuses sound more than they cancel noise in my experience. They're also a wee pricy.", "Another upvote for loop here, my eldest uses them. They have a variety of different ones depending how much/what noise you want to block out. Don't know if they'd be suitable in this case, but just a general thumbs up for them. (I promise I'm not sponsored by them!)", "loop don't work how ear defenders work at all but I do think it's fine to ask. Once. and accept the answer", "The brand JBL has headphones that play music, a mix of music+ambient sounds that are around you, and just the ambient sounds. I'm sure they have earbuds with the same tech.", "to reiterate though, there are some people who *cannot tolerate* ear plugs. something in the ear canal is unbearable to me, it's ear defenders or nothing as far as I'm concerned. like someone else said, I think making that offer *once* is okay, but if she refuses don't push it. I'm autistic rather than having FND but I know what works for me and what won't, and I presume she will too.", "Loop sucks for this purpose", "One thing I don't entirely understand is, that you are willing to pay for nicer/smaller ear protection but not for your photographer to Photoshop the headphones out. You said its 40£ per hours and SIL will only be in a couple of pictures. That would take maybe two or three hours max for the photographer, so around 80-120£. Am I underestimating the time it takes to photoshop those pictures or overestimate the cost of a really good ear protector so much? Because if it's around the same amount of money it doesn't really Matter, does ist?", "even if they don't actually I am always, always aware of them and terrified they'll fall out. I did an  internship at a place that needed hearing defence when I was much younger and I was the only person who would always use the muffs instead of plugs haha", "Are you familiar with FND?", "No, I don't think that most people with seizures tell everyone. Many people live with seizures without huge fanfare, and folks with PNES prevent seizures through reducing stimulation, stress.", "That's cool. I can't afford a psych degree on account of being disabled by my autism and PTSD, so I'll just give my thoughts without a caveat. \n1. It is partially this subs job to explore the worst social outcomes. Questions and guesses are good, assumptions like you exampled are of course bad. I don't think it is wrong to wonder where she is on the spectrum personally in relation to this one question.\n2. It is actually quite weird to infer she shouldn't be dating/in a relationship, and then go on to talk about how other people infantilize us. \n3. \"A few minutes will bring nobody to tears\" Okay so from experience: wrong. I wear them for a reason. Keep an open mind about that kind of thing.  \n4. It is not infantilizing if someone needs more care. \"Those of us with autism no matter where on the spectrum it is we understand [we might struggle, but we understand] there are times you can or cannot do things\" - not inherently true, and I feel more that you may be projecting your experience with autism onto a random person we don't know. You and I may understand the social notion of what is 'appropriate' for a 'good picture' - many will not.", "It’s more like asking someone to go out and buy a new purple wheelchair even if it may not be as comfortable or even fit for purpose, because you don’t like their black one. The FSIL knows what best accommodates her own needs, and doesn’t need OP suggesting alterations she has no knowledge or understanding of.", "If she can tolerate them.", "I’ve heard the Sony’s are pretty good too. Might be worth looking into as well.", "I have the new ones that have three settings. Still not noise canceling, but the Switch Loops are a cheaper investment.", "Good point, I hadn't really looked into the cost of the earbuds, but one of the other main pieces of feedback I got here is that its a bit disrespectful to edit them out, certainly without telling her. It would also depend on how many photos she is in, so more photos = more retouching, if I were to take that direction.", "Are you familiar with written communication?\n\nAgain. If that was the case, and we're assuming OP is asking their question in good faith, they would have mentioned it.", "Right so you honestly think the sister of her boyfriend has no idea whether or not she has seizures you don't think if she gets seizures she would tell her boyfriend and eventually that would get to the family there's just like no logic behind that like sure it's a minuscule possibility but again just not even a logical jump as to why she would have headphones all the time it's like very random", "Im disabled too and in tons of student loan debt  it took me 7 years \n\nBut no one KNOWS she needs more care so it is as it stands infantilizing.   Lets be real", "yeah i was looking at a pair earlier but they are expensive!", "Before buying earbuds (other than Loop), make sure she doesn't have a nickel allergy. It's very common, and the reason why many people cannot wear earbuds. They actually make my ears weep and itch. This is because the earbud batteries are often made of an alloy that includes nickel. I haven't found any ANC earbuds where the contact points don't touch skin.", "OP may not be familiar with the nuances of FND, which is okay. I work with folks with FND, which is not a well known diagnosis. Seizures are one of the symptoms.", "It isn't her boyfriend's sister, but her boyfriend's brother's girlfriend.   I do think it's a possibility that this information may not have been shared. \n\nI don't know how familiar OP is with this diagnosis, it's not a common one. It happens to be one I work with.", "It's not about MORE care, it's about you assuming she doesn't need the supports she uses daily. And worse, assuming all sorts of other things about her based on that first assumption. That's a pretty crap approach to understanding people. \n\nAlso, she has FND, so I have no idea why you're discussing this situation as though she's autistic (which she could be of course, but is not the known issue) instead of considering the information we actually have.", "Congratulations - I imagine that must have been difficult. \nLet's be real. Neither of us know anything about her. Is your logic that if any of the rougher 'symptoms' or behaviors are mentioned, then it's automatically infantilizing? \nSo what if she is, so what if she isn't. That's the point of the questions.", "Yeah…. They are.  I have a pair of Bose 700’s. They will muffle speech. So not sure how much cancelling u want. They do a good job at cancelling noise like airplane noise when you are flying. \n\nI’ve heard they are on sale now. Since they are several years old. And Bose has new headphones out. No idea how good the new ones are.", "Sure. If they didn't know the person in question, I would agree with you.\n\nBut this is a future sister-in-law.\n\nLike, maybe if you assume OP's future family member is utterly incompetent at detailing that their disability could cause them to _unpredictably lose consciousness_, sure. But that, I think, is pretty unreasonable.", "I didnt say shes autistic. i was merely explaining myself as i deal with that adhd ptsd and with that mess comes sensory issues. I feel like i made myself pretty clear ?", "Muffling speech is probably fine, i don' think i could handle complete silence lol. I'll check out the Bose range too, thanks a bunch", "Just wanted to mention, if you would be TA to ask or insist, then you would definitely be TA to edit them out, especially without her permission.", "Photoshop exists. YTA", "I excluded my brother's girlfriend from the photos on the basis that she wasn't married to himmand therefore not part of the family. \nShe thought I WTA for that but then they broke up so I don't care. \nNot the answer you were looking for but I wasn't worried about being an asshole on that occasion.", "YWBTA.  If she were in a wheelchair, or had an artificial limb that didn't look \"dressy\" enough for your wedding, would you make her ditch those too for the pictures?", "This is a problem to deal with closer to the wedding, like 2 weeks before if that. First off, she is a girlfriend and alot can happen before your nuptials.  Secondly, you never know how they are going to react and who wants to spend the next year dealing with, You didn't accept me/my girlfriend energy. Finally, get to know the girl because if you want her to take them off, you need to ask her directly and not play telephone with the request. \n\nGoing with NAH cause I think you can do the right thing", "NTA  \nQuite frankly, I'm not sure why she would be in the wedding photos if she's not a member of the family. She's the groom's brother's GF. She has no place in the photos.", "YTA,/NTA. First off, I find this silly. Sure if  you are going for a wedding album in which every photo needs to be perfect. I get that, so that is the nta. BuT really, she is just  a future IL, it may not happen. Have photos taken of just the family. Figure out a way with the photographer how to do this. Inless you went cheap, its not their furst rodeo. Are you planning on a wedding photo gallery wing to your house? With the exception of the official bride and groom photo, nobody else is interested.", "NTA to ask, but honestly? She’s a girlfriend so just take some group photos with family only - that wouldn’t be weird or rude and it avoids the awkwardness completely. \n\nWedding photographers order everyone into and out of photos according to the list you provide them with ahead of time, so you don’t even have to say ‘family only’!", "NTA.  I have autism and have a pair of loop ear plugs.  They are fantastic.  But even generic ear plugs work on par with full ear covering head phones for short term.  I would offer to buy her a pair if she doesn't have some. But just for photos.  Some people have issues with things in their ears but not over them", "Nowadays photographers can airbrush out anything you don't want to see so I would talk to the photographer and say can you airbrush out a pair of headphones?  if yes tell her  \"Go ahead wear them no problem!\"\n\nPlus this kind of shows how that you're empathetic with others which is bonus points for a lot of people.", "If the wedding is next year I would just let it wait out and hope she moves past the wearing headphones everywhere thing? Worrying about it now seems pointless", "Can you suggest some Loop noise cancelling buds for here. They are discrete.", "There are some nice Loop earplugs, for noise cancelling. Help her do a little research, on these, and, she will probably love them.  They are fabulous. And, most people won't even notice she's wearing them.\n\nhttps://www.neurodiverging.com/my-favorite-earplugs-for-autism-sound-sensitivity/", "YTA for thinking her accommodations are somehow ugly and ruining your photos.  Would you feel the same way about a wheelchair, prosthetic limb or cochlear implant? \n\nIf the answer is yes, you're kinda gross.", "You wouldn't be for asking.  If you would like her to wear earphones other than her usual style, it would be nice of you to offer to pay for them.", "As a parent of a special needs child, I would 100% be offended by your request. It would depress and make me sad. People can’t help their disabilities. You asking her to take her headphones off is just a reminder of how this world is not good enough for the most vulnerable class in our society. Chances are you will know or love someone with a disability in your lifetime and only then you will learn that your request was an ignorant one even on your wedding day. YTA", "NTA. It would be ridiculous if she can’t not wear those headphones for posed pictures. If she got married would she be wearing them in hers? There are earth plugs she can wear if needed.\nIf she isn’t married into the family, maybe she shouldn’t be included in family pictures?", "Can they be photoshopped out?", "NTA \n\nI guess I'm most puzzled as to why your finace's brother's girlfriend would be in your wedding photos at all, though... unless she is in the wedding party, of course (which might be the case).", "NTA. But that doesn’t mean that you only have two choices. \n\nWhat I mean is why not just take photos with multiple variations of people. My family does this at events, where we first start with me and my grandparents, then another photo adding my dad and brothers, then another photo adding my cousins, or switching it so it’s me and my brothers only, etc. Yes it’s time consuming, but hey you’re already there. \n\nThat way she doesn’t feel directly excluded, while still being comfortable (if she chooses to leave headphones on), but in the end you can choose photos you like with the headphones in them or not.", "NTA - she might not even be planning on wearing them for pictures. My experience is that pictures are typically done in an area that's not really noisy, outside. It helps to hear the photographer's instructions.\n\nShe might feel like she needs them for pictures, but she might be comfortable taking them off.\n\nPeople have pointed out mobility aids in this thread - my MIL was adamant her cane not appear in any of the photos, she was very concerned about that. So I do think it's a good idea to talk to your FSIL, see what her comfort level is and then your photographer has a heads up as well - ie. remind FSIL to remove them if that's the plan, or be prepared to direct someone who may have trouble hearing the directions.\n\nAs long as you aren't demanding she does pictures without them and you are respectful one of you having the discussion can be helpful.", "NTA if you came at it from a point of view of finding out if this is a feasible request given that you don't actually know if her wearing them is a need or more of a preference. It may entirely be possible that she's OK not wearing them or doing something else for a short period of time. I feel as though making assumptions about what she's capable or not capable of doing is the more asshole thing to do.", "NTA. Perhaps suggest a compromise, and offer to buy her some cool ear plugs. Don't pester her about it though or push the issue, or YWBTA.", "I say have her decorate a pair just for the wedding. Maybe with the same type of flowers you are using.", "NTA, seeing a lot of comments in support of suggesting earbuds for the times you’d like her to not be wearing ear defenders and I fully agree, jumping on the Loop bandwagon and recommending those, specifically the sleep mode kind, as I use them for my noise sensitivity and they help a lot, but doubtfully as good as hers. If you get a no don’t keep pushing it but it’s perfectly fine to ask nicely. All the best with your wedding :)", "YTA. A formal diagnosis isn't necessary for someone to be autistic. It's your wedding but people get to be themselves. Wouldn't you want photos to reflect who people are and not just who you want them to be? (fnd has recently been found to probably be an autoimmune condition btw, even bringing up diagnoses here is a red flag honestly)", "NTA if only for photos. Only asshole if wanting them off at any other point.", "NTA tell her to manage her crazy", "i don’t usually comment on these but it made me think of “loop” earphones i think they’re called ? they’re little ear plugs meant for dampening concert noise maybe would be useful", "There is a subreddit that does photoshop request. Paid and unpaid. Could put the photos on there and pffer a tip. It would be cheaper and some of them are really good!", "Just have them photoshopped out.", "If she can tolerate earbuds try Bose or Sony x5 or Jabra 10 all of them have the ability to control how much sound you hear with ANC. You can totally block or make them transparent. When I want quiet I play white noise very low volume  with anc all the way up. I use Bose", "Why doesn't she get smaller ones for the wedding? My youngest has ASD and struggles with noise.  We found a good pair of noise canceling ear pods. She prefers them now because her huge Sony headphones were so obvious.\n\nThat's just in general. \n\nFor the wedding, you can ask, but up to her I guess.", "What part of the word “ disability “ do you not understand?  To this person noise can and does irritate or adversely affect her in some way.  To you it’s five minutes for her it’s five minutes of hell.  Those headphones can be looked at as medical equipment for her, if someone came to your wedding with a oxygen tank and they were supposed to be in your pictures would ask them to stop wearing that oxygen?  Think carefully about it because whether it’s headphones or oxygen the out come could still be life threatening.", "YTA in such a huge way.\n\nFND is also a neurodivergent condition. \nWhat the actual fuck is wrong with people that you want them to remove this, and possibly end up in a dissociative state for the rest of the night.\nWould you be ok with having that on your mind?", "And FND can cause seizures with certain noise stimulations so it's important to respect her no in case removing are a health risk. Maybe she's more concerned with a seizure episode happening on your wedding day just for the sake of aesthetics. I would argue that is more dangerous and disruptive than paying a bit more to edit them out. But so what if the very few photos that include her have her headphones showing. That's her. Would you photoshop someone's wheelchair out or ask if they can walk for just the short time of the photos. \n\nHeadphones are not a big deal and most of your relatives know her and why she's wearing them so seeing it in the photos I not going to scandalised anyone. \n\nPolicing what someone wears is always going to make you TA.", "My brother's EX-fiancee is in quite a few of my wedding photos....we don't display those.", "It's not that uncommon to include siblings and their SOs. I have wedding pictures with and without my sister's husband. Vice versa for her wedding photos.\n\nUnfortunately, the dynamic of my husband's side is different and there are no wedding pictures of him and his sister without her ex also being included.", "Your Edit#3 is indicative that fiancee is marrying a wise, judicious woman. Congratulations and best wishes on your wedding.  Let us know how you ultimately handle the situation.", "20 years ago my friend's parents had hair added to their bald son's head in their family photos. Why not have the headphones photoshopped out? You get the pics you want and she doesn't have to suffer.", "That's interesting. I've worn glasses daily for the past 20 years, and I'd think it quite strange if someone asked me to remove them for a photo shoot.", "I did NOT include my brother in laws girlfriend in any photos. For context, they had been together for 6yrs at that point. I gave him the option of still being in them without her or not being in them at all, but we made it clear that it was just family. It's a good thing because they split up less than 6m later.", "Then they have their own wedding with their own photos with the family if they get married . If I had family photos with all my my brothers girlfriends or my brother in laws girlfriends, that would be VERY uncomfortable.", "The photographer should be able to photoshop them out", "If you talk to her before the event let her know you'd prefer to have at least one photo without her ear defenders if possible and ask her what she needs / what you can do to try to make it possible on the day. Also let her know if you do everything she asks you understand that it isn't a guarantee she'll be able to go without them.\n\nShe might feel she can't go without them or she might want a photo taken without them when she's all dressed up, if she can go without them. It's not rude to politely have a discussion. If she is comfortable not wearing them for a photo I would offer to have a photo taken of just her and her boyfriend as well if she wants to, as a photo without ear defenders is probably rare for her and a professional one would be a nice gesture.", "I know very little about professional photo.editing, but by the price OP stated, the cost of airpods pro would buy several hours of editing.\n\nMight be worth checking in with the photographer to compare prices first. If they are comparable, obviously airpods would be a nice gift for a similar effect.", "That's the thing, I'm not disagreeing with what you're saying but I also don't think the way OP wanted to approach the situation is wrong either. OP stated that she wears them when she leaves the house, not all the time so I doubt it's a part of their identity. But I also wouldn't have a problem if my friend asked me to be in her wedding and then requested to remove glasses, cover tattoos, take out piercings, or change my hair color to a more traditional color. It all comes down to how well you know the person. If someone is going to be in family wedding photos you should already know well enough what will and wont offend them. And if you don't know them well enough to know that, maybe they shouldn't be in the family photos. 🤷‍♀️", "Asking someone with fnd to use earplugs instead of headphones is like asking someone with a glucose pump to cover their pump with their shirt. It's not a big deal.", "Or she could just ask? There's plenty of non-judgmental ways to present the question.", "I saw people who ask relatives to lose weight to be part of the wedding party", "Other option is... Plan for a winter wedding and gift everyone cute fuzzy earmuffs for a snowy themed shoot\n\nJust add fuzzy covers to SILs ear defenders and boom, everyone fits in", "Plus Loop can come in fashion colours so maybe a set to match your theme (my usual pair are purple and deep pink)", "If you get loops, one possibility might be adding the loop mutes - they're an accessory you can buy that extends the noise cancelling capabilities. Autistic and defo. agree that they're not SUPER powerful for the price, but for just the photoshoot (and for SIL to take home if you're ultra nice!) they'd do fine, I think :)", "It doesn't matter how fancy the earbuds are if you find having something in your ear uncomfortable (as I do). Just be aware of that, and that if she could tolerate earplugs/buds she would probably already be wearing them.", "Seeing it happen and it being a good thing to do are two different things.", "Anything in my ear canal triggers my gag reflex. I'd be dry heaving at best. Too much dry heaving triggers an asthma attack. So if it was me it would just be a cascade of fun.", "My last hearing test the audiologist commented that I probably had issues with ear buds.  Yes I do."]}