{"id": 29737, "submission_id": "17h8g6q", "title": "AITA for leaving sexually-explicit messages where my colleague could see them?", "selftext": "I (35f) am a teacher at a alternative school where each class has two teachers. My coteacher (34f) is very in-your-face, in-your-business and doesn't understand boundaries very well. She is always looking over my shoulder, she will straight up yank my laptop away from me and look at what I'm typing, if my phone goes off she goes \"oooh who is that?!\" and things of that nature. I've gently tried to explain to her that I don't want her touching my stuff like that, she'll say stuff like \"oh, well I'm an open book, it's no big deal!\" When I've explained less gently to her, she borderline cries and gets into an anxiety loop where she accuses me of being mean and/or mad at her.\n\nI'm currently in a long-distance relationship and my boyfriend and I rely a lot on sexting to keep our relationship fun. He's in a different time zone, so the things I send him at night won't get responses until the next morning some times. Today I noticed he was sending me (text) responses to photos I had taken last night about what they made him want to do with me. I want to point out quickly that there were no kids in the room at this time, and even if one had wandered in, they're too short to get my phone and too young to read. I decided to leave my phone on a tall standing desk by my own laptop while going to get a cup of coffee, knowing my coteacher would probably look at it.\n\nWhen I got back, my coteacher told me in a very serious voice that I need to be careful about what I am doing at work because she saw my disgusting and inappropriate texts. I told her she wouldn't have seen them if she hadn't been looking for them, and she said that wasn't the point, that she felt sexually harassed but wouldn't go to HR about it \"because the children wouldn't be able to handle a change in teachers.\" \n\nAITA?\n\n&#x200B;", "created_utc": 1698359010, "permalink": "/r/AmItheAsshole/comments/17h8g6q/aita_for_leaving_sexuallyexplicit_messages_where/", "score": 754, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I was confident my colleague would choose to look at texts that I knew would make her uncomfortable.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "It's not so much about whether you're an AH or not, but rather whether you'd be willing to lose your job just to be shocking to this woman.  \n\nProbably not a smart move, career-wise.", "ESH\n\nShe shouldn't have been snooping, but come on, don't sext during work time.", "NTA.   \nBut YOU can go to HR and say “She’s going through my private phone and laptop constantly. I have asked her to stop but she continues doing it. I need it to stop.”  \n\n\nAnd don’t sext on school time. That will get you in trouble. It doesn’t matter that the kids can’t read your texts it is inappropriate. \n\n  \nSo right now you both have dirt on each other… you are sexting at work, and she’s going through your personal stuff. Stick a password on your phone and laptop, and next time she asks just raise an eyebrow and say ”It’s personal”. And it won’t matter if she reports you because by then you will have stopped sexting at work and it will all be clean and professional. If he’s texting you (and you aren’t responding) during work hours then your phone should be on silent and put away…", "ESH- You're inappropriate for sexting in a classroom/leaving it in view and she shouldn't be a snoop.", "Yta. And deserve to be fired whether children saw it or not.  Leaving that available to anyone to see in a school is a fire able offense.", "Textbook hostile work environment sexual harassment. You could be fired for that.", "Yes.  At least use a dual sim phone to keep this from happening again.  Come on now. You know your job comes with certain expectations.  There should be not a shred of that kind of behavior in the classroom on the part of anyone.", "Definitely could be construed as sexual harassment, even if you didn't work with children. ESH because sure she shouldn't be reading your texts but the fact that she was able to read your sexually explicit texts while at work is still on you.", "ESH.\n\nShe absolutely should not be looking at your personal phone.\n\nBut unless she has your unlock code, these explicit messages were visible to anyone. There are a LOT of ways that could go wrong at work. Look at your phone settings and figure out how to hide the text of the messages on your notifications screen.", "ESH. You for purposely leaving your phone there for her to find that; and her for constantly invading your privacy.\n\nYou should have reported her for her behavior, instead of what you did. Now she has the whip hand over you. Not smart of you.\n\nAlso, you're in a school ffs.", "ESH - your coworker is certainly rude for not respecting your boundaries, but as others have said, time and place. Your coworker could have been doing you a favor warning you, tbh.", "I'm going to say YTA as you were clearly baiting co-teacher to look, no, she should not be looking, but you are at work in a school, that's neither time/place for that.", "Fellow teacher here. ESH. Your colleague was absolutely in the wrong for always being so snoopy, but I mean, seriously. Leaving dirty messages out in the open, at a school, for your coteacher to find, is just nasty. Like, if I did, that, I know for complete fact that I'd get in major trouble, if not fired.", "Esh", "ESH. You should have had the maturity to have dealt with this properly, by telling her that if she doesn't respect your privacy and boundaries, that you'd seek HR advice.", "Esh. Your action was totally unnecessary. You should have contacted HR a long time ago and telling them how your coteacher behaves. Because her behaviour is also non-professional and I do agree with you that she must be terrible to work with. But her awkwardness doesn't justify you. Turn off your popping messages (especially when you know you are going to receive adult content) for God's sake you are at a school!", "YTA. You aren’t being paid for that.", "YTA.  \n\nLeaving sexual messages out in the open for your coworker to find absolutely can be considered sexual harassment.\n\nPlus, absolutely disgusting to be sexting at work, in your classroom, that you share.   \n\nYeah, she’s awkward and inappropriate, but your behavior is absolutely wild and will can get you fired.", "I would have just had \"STAY OUT OF MY STUFF\" on my phone, my laptop wallpaper, on my back, in my wallet, etc in the largest size available for her so it's easily readable.\n\nYou could report her to HR for her snooping, but your explicit texts could get you in trouble possibly.", "YTA - nope, not appropriate to sext at work.", "NTA, some are saying you are sexting at work, you are not sexting at work. You said he is in a different time zone so sometimes he replies to messages you sent the night before on your own personal time not the schools time. You cannot help when he replies. I have actually been in that situation, where I was awake while my love one half a world away was sleeping so sometimes emails she sent me would get replied to later where if someone at her work had been snooping would have seen them. Your coworker is an asshole because it’s your phone, your business and she’s violating your privacy.", "Turn off text previews easy fix. Both of ya’ll are assholes", "YTA, you admit to leaving it open for her to see? What did you expect?", "YTA. You shouldn’t be sexting at work but especially when you work with children.", "NTA\n\n1) fuck your nosy coworker\n\n2) turn off notifications for that app you use with your bf so that they won't show up on your lock screen\n\nConsider talking to a labour lawyer about how to handle the situation with HR. Might cost you a few hundred bucks in a retainer and advice.", "Congratulations, YTA! Sounds like you're starved for attention and wanted the messages to be seen by your co-teacher and/or anyone else. Inappropriate and unacceptable to leave your phone purposely unlocked and easily accessible (especially at a school) knowing what you have open for viewing/reading. Disturbing and sad.", "NTA \n\nBut turn off your lock screen previews for messages, at least during work hours. No, you're not sexting at work but you are getting sexts while at work. \n\nAlso, tell your coworker that you did that on purpose to teach her a lesson in snooping.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (35f) am a teacher at a alternative school where each class has two teachers. My coteacher (34f) is very in-your-face, in-your-business and doesn't understand boundaries very well. She is always looking over my shoulder, she will straight up yank my laptop away from me and look at what I'm typing, if my phone goes off she goes \"oooh who is that?!\" and things of that nature. I've gently tried to explain to her that I don't want her touching my stuff like that, she'll say stuff like \"oh, well I'm an open book, it's no big deal!\" When I've explained less gently to her, she borderline cries and gets into an anxiety loop where she accuses me of being mean and/or mad at her.\n\nI'm currently in a long-distance relationship and my boyfriend and I rely a lot on sexting to keep our relationship fun. He's in a different time zone, so the things I send him at night won't get responses until the next morning some times. Today I noticed he was sending me (text) responses to photos I had taken last night about what they made him want to do with me. I want to point out quickly that there were no kids in the room at this time, and even if one had wandered in, they're too short to get my phone and too young to read. I decided to leave my phone on a tall standing desk by my own laptop while going to get a cup of coffee, knowing my coteacher would probably look at it.\n\nWhen I got back, my coteacher told me in a very serious voice that I need to be careful about what I am doing at work because she saw my disgusting and inappropriate texts. I told her she wouldn't have seen them if she hadn't been looking for them, and she said that wasn't the point, that she felt sexually harassed but wouldn't go to HR about it \"because the children wouldn't be able to handle a change in teachers.\" \n\nAITA?\n\n&#x200B;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. But you need to get ahead of this and go to HR immediately. A lot of people are going to be up in arms because how dare you be an adult around their precious babies but you weren’t sexting and you have no control over what people send you. \n\nReport what happened to HR immediately. Act super apologetic like, it’s been so hard being away from my partner and he sent me something very personal and she violated my privacy. It’s just awful knowing that she is now a part of my relationship and I didn’t want her to be. \n\nI have asked her several times not to touch my personal items but she insists on constantly being in my personal space. Is there any way you can help me reinforce this personal item boundary.  I would hate for the children to hear something they shouldn’t because she is violating my privacy.", "Probably not first time. She’s likely been waiting for moment to see and say. Your lucky to have such great opportunity. Focus on the kids.", "This right here. \n\nOr turn your detailed notifications off so all you see is his name. FFS.", "She wasn't. She was receiving them.", "I don't sext at work! My boyfriend responded to texts I had sent the night before and I let the previews stay on the phone while I grabbed a cup of coffee. I usually just keep my phone away and don't respond until I'm home in the evening.", "What is ESH?", "So she's a...master baiter?", "I am not sexting at work! I sent messages the night before, he's in a different time zone and sees them in the morning, I never respond at work, my phone is usually in my pocket.", "If you know you are getting/might get racy responses to racy messages while you are at work, keep your phone away. My husband and I will flirt heavily via text while at work, but I make sure to keep my phone away or face down and won't respond while I have anyone in my office. I work from home now, but when in the workplace, that is common sense. Your job is not worth a shock factor to this snoop.", "Knowing that's probably going to happen, it's a terrible idea to leave your phone lying around where anyone walking by and glancing at it can see your NSFW content. Keep the phone with you or put it on the lock screen when you're not reading it.", "Turn off lock screen previews!!! While it's an ESH, your response of purposefully letting sexual messages be viewable AT WORK which is a SCHOOL is highly inappropriate.", "My boyfriend/husband used to do this.  So I changed my settings so any inappropriate messages didn’t pop up on my phone, only a notification that I had received a message. It’s not difficult.", "Everyone Sucks Here.\n\nThere's a little key off in the upper right of the screen (under the rules) that explains all the abbreviations.", "ESH = Everyone Sucks here", "Except this time you deliberately left it out, knowing, in your own words, that your coworker “would probably look at it”. That’s wildly inappropriate.", "It’s absolutely gross for him to be sexting you while he knows you’re working in a school.", "I have no idea why people are downvoting your comment and unable to grasp the fact that you were not sexting at work. You need to tell hr/someone in charge that your co-teacher refuses to stop snooping despite being told several times to stop. But also, tell your bf to maybe save the sexting for when you're not at work.\n\nNTA", "And turn off Lock Screen message previews", "The snooping, absolutely!", "And deliberately leaving provocative material out in the work place, absolutely.", "I addressed that in another comment. \n\nKeep your nose out of other people's stuff, and you won't see anything that you don't like.", "Retired teacher here, I would never open or share private information between me and a romantic partner  while I was at school because I want to keep my job.  If your co teacher is touching your possessions and will not stop. report her to your principal.  Do? NOT try to embarrass her or teach her a lesson by   leaving your phone or laptop available to see if she will  violate your privacy .  You are not an AH, but you are asking your job.  kt", "This doesn’t seem like a good strategy. Maybe go to HR spin it as “my boyfriend sent messages and she read my phone without permission” and then turn off message previews.\n\nYou’re playing with fire with this type of coworker, get ahead of it and be straight up with the “if you touch my stuff again I’m reporting you” message that she needs to hear", "ESH but you’re much worse. Your coworker is nosy and obnoxious. But you intentionally left sexual material in the workplace so she could see it, with the intention of making her uncomfortable. People get fired for stuff like this.", "ESH.\n\nLeaves sexually explicit stuff in plain view on purpose.\n\nGets told off for leaving sexually explicitly stuff in plain view.\n\nSurprised Pikachu.", "ESH\n\nAnd you're setting yourself up for a big fall.\n\nNo one is going to care if she was peering over your shoulder or whatever when she tells them what she saw.", "YTA - I'm all for leaving something shocking to get someone to leave your stuff alone, but something like 'mind your business before I report you for stalking is appropriate where sexual messages are not.\n\nHaving a phone lock screen of one of her phobias, where she'd only see it if she bothered your phone, is appropriate. Sexual messages are not.\n\nHonestly, you're very lucky she hasn't reported you. I would expect she's made a note of it, or reported it under the condition that you be dismissed at the *end* of the school year so it doesn't destabilize the classroom.\n\nThe only potential benefit of this is that she may learn to mind her own damn business. I absolutely do NOT tolerate people doing that looking at my personal stuff nonsense and would have had HR involved long before it got to this point.", "ESH, coteacher for being nosy, you for literally sexually harassing you. Literally the definition of sexual harassment you risked your career to be petty.", "\" I decided to leave my phone on a tall standing desk by my own laptop while going to get a cup of coffee, knowing my coteacher would probably look at it.\"  \n\n\nYTA. and a petty one.", "YTA put a passcode on your phone, like you’re a teacher. Be serious. Her behavior is weird but you need to be a little more responsible", "ESH for pretty clear reasons.  But come on - are you *trying* to get fired for violating sexual harassment policies?  Yikes.", "You left a phone containing lewd messages unattended inside a school with children. You assumed they wouldn't be able to get ahold of it, which was grossly negligent. If I were your administrator, you'd be gone, and I would make sure your case made the news.", "YTA. Leave the relationship stuff at home, it can wait until after work. Doesn’t matter whether kids are in the room or not, work is not the place for that.", "YTA.\n\ni understand your frustration about your nosy coworker but imo that’s not actually relevant to the situation. for the separate issues from your coworker, you should have already reported her. \n\nin regards to your sexts being visible in public: tell your bf to not respond during work hours. or, phones have this cool new feature where you can hide all the actual words from a text when they show up on your home screen. you should set that. \n\nyou also deliberately  left it out where someone could see when you knew you were being sexted.", "ESH- you work for a school, and since it's an alternative school likely one for either very gifted kids, or troubled teens. Either incredibly smart and curious, or known troublemakers. Lock your phone. \n\nObviously your coworkers shouldn't be snooping. I'm sure she's rude and nosey and generally really difficult to work with. But if you're expecting a maybe not so clean text and you work with kids? Or frankly anywhere except from home or private office? Accidents happen. Lock. Your. Phone.", "Your co-teacher absolutely sucks but I’m learning towards YTA here. If you knew responses like that would come in from your boyfriend, then turn your phone off in school. It doesn’t matter that the kids aren’t tall enough to see and has nothing to do with your nosy co-worker, or that you weren’t actively engaged in sexting at the time. It’s unprofessional in the environment itself and at 35, you should know better. \n\nI know the judgement should probably be ESH because your coworker did go through your phone and that’s shitty. But you might want to think about it this way. You were petty enough to leave it for her to take. Now if she does report you, remember there’s nothing that says she would tell the truth. You were immature in the moment and it may have made you vulnerable to losing your job. \n\nAll she’d have to do is say something like a kid came in and grabbed your unattended phone, or that you were deliberately sharing those messages with her to make her uncomfortable. You know that’s not true. But it’s a hell of a gamble to risk a complaint against you, when you could’ve just documented details of her behavior and reported it in the first place.", "ESH - not only is this asshole behavior, assuming you are in the US, this can easily fall into the realm of sexual harassment or creating a hostile work environment. This is regardless of your line of work. Her behavior is inappropriate and can be reported to your principal. However, now, I wouldn’t suggest opening that can of worms. \n\nDon’t even get me started on sending or receiving sexual messages while you are responsible for someone else’s children…", "ESH. if a coworker is spying on your phone over your shoulder you can file a complaint and go from there. this was really risky and not worth it", "ESH. You should have warned her about personal space, told her that she’s might be an open book but you prefer not to be. If she kept it up, then warn her that it’s an invasion of your privacy but you won’t go to HR unless it continues. That was a dumb move in a school. Upside, she might stop looking at your phone now?", "ESH she’s a nightmare but “they’re too young to read” is not going to help anyone’s defence if you get accused of leaving any kind of sexual written material around unlocked and readable at a school. Is this your first Clinical Prac or what?\n\nYou don’t sound quite common-sense enough to be a teacher. I’m just a Speech Path and they drill that Child Safety Etiquette into us so we don’t find ourselves at risk of ridiculous yet also life-destroying accusations such as this.", "YTA.  You shouldn’t be doing this at work, let alone if you’re a teacher.", "ESH \n\nI get why you did it  but this is not the way to be handling this situation at all. You’re both adults but neither of you are acting like one. \n\nYou need to be straight up blunt and make her stop snooping on your personal communications. If she doesn’t, you go to HR. Why on earth are you accepting this in the first place? Snatching your laptop off you and you just let her? Sorry…?! As much as your co-worker is wrong for snooping, you’re risking your career and you’ve stepped more out of line than she has by deliberately leaving sexually explicit messages available knowing and intending for her to see them, and risking others seeing them. Again as much as I get why you did it, you did something very inappropriate. \n\nWhole situation is messed up and one of you needs to act mature about it to make it stop.", "YTA.  You know the time difference means your bf will be returning your texts during the school day.  Turn off your notifications.  And YOU should be going to HR about your coworker’s repeated violations of your privacy, not trying to teach her a lesson about snooping.  Her behavior is inappropriate in general, but you shouldn’t be receiving sexts at work, no matter who might see them.  You know that.", "If a male co-worker took a picture of his dick, left it open on his phone and left the phone on the table in the room for their female co-worker to find, that’s 100% sexual harassment.\n\nYou did the same thing, just with your boyfriend’s sexts (and presumably the pictures you sent him).\n\nThis issue was an easy conversation with HR or your supervisor, but instead you decided to shock her? Her behavior was annoying, sure, but you took it to another level. YTA", "ESH. Why are you even texting at work, nonetheless sexting? Shouldn’t your phone be put away? Why would your partner sext you knowing you’re at work with children. He wants to get you hot and heavy at a school?! That’s sick.\n\nYou work at an alternative school, so unless they’re throwing kindergartners in alternative school, your students can read. \n\nYour co-worker is rude and inappropriate, but you are also unprofessional for using paid work hours for personal matters. I wouldn’t put it past the population of students you work with to steal or hack your phone. If your students ever see your sexts, which I imagine also include pics, you’re going to be charged with child abuse.", "ESH. She shouldn't snoop, but you absolutely shouldn't be sexting *in a school*. JFC.", "ESH. Tell your boyfriend not to sext you while you’re at school. That’s pretty weird even if the kids can’t see. Tell your coworker to mind her own business or you will report her. Both of you are going to end up in trouble if your actions continue.", "ESH - she ofc shouldn’t be such a snoop, that is annoying and if anything YOU should go to hr to complain about her going through your personal things. \n\nbut seriously? you shouldnt leave out sexting messages for everyone to see, what if it was your boss who saw that instead? that was inappropriate and you probably shouldn’t do that again", "ESH. You should have reporter the snooping coworker to hr as soon as she started snooping.\nAnd you shouldn't have your phone out in a work place when you are sexting your partner. You knew you would be getting a reply during your work hours, so yeah, you were sexting at work.\nIs anyone in your work place a functional adult?", "ESH. You could be fired for having sexually explicit material at school.  But yourcolleague shouldn't be snooping either. Don't be an idiot; be more careful. Turn off your phone and have it password protected.", "YTA.\n\nYou should be more professional at work and not type or read things you don't want her to see", "ESH Sexting at work (a school!) and acting like it isn’t a problem", "ESH\n\nYou should not be sectinv in a classroom or in a method where others can see by being casually nosy. \n\nCo-teachers sounds awful. \n\nBetter just to set and hold boundaries I would think.", "INFO\n\nAre you sure the best way to handle this situation was to act in a way that may get you fired?\n\nTell your coworker to keep her grabby hands to herself, that while she may be an open book, you arent.", "ESH — With such an awful coworker and given the kind of texts you were expecting, you should keep your phone with you at all times. Also, trying to make her uncomfortable on purpose was a stupid and childish idea.\n\nAnd what's the point in reading arousing texts at work. Are you gonna masturbate? Is there no way for you to deactivate notifications and read that later?\n\nIf you were fired, I wouldn't be surprised nor sad for you. And your coworker indeed has an infuriating nosy behavior.\n\nYep, everyone sucks here.", "Working with children you need to have a better duty of care for them \n\nYta", "You are the a hole don't sext at work especially around children tell him not to send pics or nasty messages when you are working I've been in this situation with long distance relationship we did sext but there's a time and place in private", "ETA \n\nShe shouldn't be snooping and you shouldn't be sexting while at work especially since ur a teacher. Hopefully ur not doing while ur pupils are around or that is just weird.", "Not an asshole, but definitely a stupid move (if any of this scenario isn’t fantasy).", "ESH.\n\nWhile yes, she shouldn't be snooping at your phone whether or not you left it out on purpose. But you shouldn't have left it out on purpose for her to find. I've done my share of LDR, and sexting at work, but I never leave it out. If I'm expecting something, my WhatsApp is not open on my screen and left unattended, or open on desktop.\n\nIf she's snooping over your shoulder, grabs ur phone and sees the the sexting responses or msgs from last night etc, that's fully on her.\n\nYou could have gone to HR to make a complaint about her not respecting your personal privacy, which you are entitled to, sexting or not.", "YTA, you can easily get fired for the behavior regardless if others say nta or yta here. Call me crazy but people constantly around kids should probably have more sense than this. I used to coach middle school children and I'd be damned to hell if they had access to my phone. Nudes wouldn't be the worst of it lol", "ESH\n\nShe sounds annoying, but you can’t leave stuff like that just lying around at work\n\nI am not even sure how this is a question. Lock screens on phones exist for a reason", "Why would you leave them there or even it sis at least should have take care of them.", "YTA", "ESH\n\nTime to put your big girl pants on and tell your coworker to stop snooping in your private life or you will file a formal complaint. When she starts \"crying\" remind her that you work with children every day and crocodile tears don't move you.\n\nThen follow through when she continues to snoop.", "ESH\n\nObviously,  your Nosy Parker colleague needs to learn to respect other people's privacy & boundaries.  The behavior you described was worth a sit down with an administrator to mediate a discussion about appropriate professional boundaries. \n\nBut you gave up the moral high ground when you decided to set her up to see your boyfriend's explicit messages and the fact that you apparently receive explicit messages routinely with visible previews, while you are at work at a school says that your own grasp on the line between professional & personal is a little shaky", "YTA. Seems like you wanted to show off to your colleague about receiving ‘sexts’.", "Sexting at work when your work involves children can get you in legal trouble. “I keep it out of reach”.  Nothing is out of reach for kids, especially on a desk. They easily climb. \n\nESH bc come the fuck on, don’t sext or risk that kind of stuff being visible to kids in your care. She sucks for obvious reasons.\n\nEdit: “I’m not sexting at work!” You’re receiving sexually explicit texts in class that are responses to sexually explicit texts and images of yourself. What if your partner sent a pic of his junk as a reply? And a kid was curious about the phone notification going off and saw it, or saw your nudes being responded to? You’re 35, be better. Turn off content preview for your messages all the time or at least when you know you’ll be getting sexual replies. Don’t believe you that you ignore those messages until you’re home at night.", "Neither of you are right. \n\nThey are AH because they are a snoop\n\nHowever, according to federal law... if you purposely expose another person to sexually explicit materials (regardless of how they see them) you're committing a sex crime. \nYes, they shouldn't be looking. But the fact you left that in plain view with the intent for them to see it is in fact a crime. \n\nI know. Many will disagree. I didn't write the law. You purposely exposed them to sexual content. It's a sex crime\n\nSo. She's TAH and now you committed a sex crime in a school. Be proud. I wouldn't be", "Change it to where your notifications don't actually show on your lock screen. Or like...it'll say \"bf texted\" but not what he texted", "YTA\nThis is incredibly unethical. You are at risk of exposing your colleagues and students to your personal life. You need to adjust your settings immediately. \n\nIf you are engaging in sexting in your work hours, even on your break time, you could lose your job and be held accountable if someone sees your messages. Even if they are peeking over your shoulder. If it is within your contract hours, and you could lose your license.", "Left my phone on my desk.  Coworker picks up phone, opens Tumblr (back when they still allowed porn).  Goes to HR claiming I \"Watch porn on my phone at work\".  Fired.", "You're willingly getting yourself horny at work when you teach kids who aren't even old enough to read? You just seem kinda creepy in that regard if I'm being totally honest. Find another time to sext and do stuff with your LD boyfriend, a school is not an appropriate spot whatsoever.", "Why are you gentle? Tell the creepy stalker \"You're being creepy, snoopy and you are violating private space. I do not have to or want to tell you who texts me, what I'm writing on my laptop, what I ate yesterday or who's dick I sucked this weekend. It's none of your business.\"   \n\n\nHonestly ESH. But you are being an asshole to yourself for not standing up for your own human right to privacy with this woman.", "INFO: Just how “alternative” is this “alternative school?” Because leaving sexually explicit content around small children is, in usual cases, frowned upon.", "Are you stupid or something?\n\nThis other girl is violating your privacy and doesn't respect personal space..your first move should have been to report her behaviour.\n\nSecondly you are at an alternative school with two teachers per class and you sre spending time on your phone?\n\nYou are the AH.", "INFO: was the “snoop” just being passive aggressive and pointing out you weren’t doing work on work time? Like she saw you doing some shady stuff on your phone or laptop and was “heyyy what are YOU doing” - like if you are doing your business in line of sight at work, that kind of is making it everyone’s business. \n\nI think there are ways to keep her nose of if your stuff and it probably involves you being really mindful of what you are doing in your classroom and what is and isn’t visible to her and your students.", "ESH.\n\nShe sucks but you’re dumb for sexting during work. That’s HR nightmare", "You need to block notifications at work, especially in alternative ed settings where the students tend to be savvy and snoopy (in my experience). I won’t even read smut on my breaks when I’m at work because I’m worried of the optics.\n\nESH", "Let's break this down from an HR perspective. Shall we? \n\nFirst and foremost, ESH!!!\n\nLet's break down the touching and looking \nthrough/at your belongings. The first thing you should have done is ask her at least twice to stop. If she persist thats when you should go to HR or the director. At that moment, you should have just simply explained she's making it difficult to concentrate at work. Then there you go, problem solved. \n\n\nNext, let's break down the \"I don't sext at work,\" but you technically do. Your boyfriend is a grown man who needs to learn how to Google time zones and how they work. YOU need to learn how to respect your coworkers and place of employment and not allow him to respond to dirty photos when you're SUPPOSED to be working. It's inappropriate no matter where a person works. I suggest finding a time when you're both off work. This could be an hour or two before you/him go in to work or after. You can also just do it on the weekends. You one-thousand percent should NOT be allowing him to respond in any sexual manner while you're at work. \n\n\nNow, let's break down the fact that you PURPOSELY sexual messages open on YOUR phone in a CLASSROOM. That is most definitely sexual harassment and your coteacher should most definitely skip her self right to HR and report you. You could have staged anything for her to see literally anything, and you chose to sexually harass someone for what touching your belongings. This was ALL done with intent, making you the BIGGER asshole. \n\n\nFrom a personal perspective, I hope you get everything you deserve from this. I truly do, and that's just what happens when you play childish games! You are way too old to be acting like a vindictive child.", "I have no words! You’ve played a really stupid game with an annoying coworker. \n\nInstead of just reporting to her supervisor her inability to keep her nose out of your personal belongings, which would have likely gotten her reprimanded you now have a situation where the school is going to hear the word sexual and it isn’t going to matter worth a damn why she was in the wrong. YOU have out your job on the line. You work in a school ffs.\n\nDon’t you have a morality clause ? A lot of kid related jobs do.\n\nESH", "Why don't you go to HR about her behaviour?", "NTA", "This right here is why my children will not be going to public school. She’s an asshole for snooping, you’re just nasty for doing that shit AT SCHOOL", "ESH. Her for being a snoop and you for having sexually explicit material sitting out in a classroom. Just FYI, I message follows your appleID so I hope you don't have it signed in on a work computer and I hope you're not using school wifi. FOIA can and will bite you in the ass.", "ESH.  You weren't very mature on your part and could have had some bad consequences.\n\nHOWEVER...\"she will straight up yank my laptop away from me and look at what I'm typing\".  You should have reported her immediately.  In some places that's borderline assault.  She's an AH for that, but you didn't act in a professional manner in how you handled it.", "You’re not an asshole, but this seems like a risky way to prove your point because if she wanted to report you, she could, and you’d be held accountable for leaving sexual material where kids presumably could find it", "ESH. She shouldn't touch your things, but sexting during work hours, especially with kids around (even if they can't read), is highly inappropriate.", "She felt sexually harassed after snooping on your private device? 🤣", "NTA but you need to do the following:\n- write an email to your coteacher that clearly states under no circumstances do I consent to you touching my personal cell phone, Cc or bcc principal or manager. Seems harsh but you can never have too much documentation in a school believe me \n- make your phone automatically lock after 5 seconds & require pin to unlock\n- remove banners from notifications or do focus hours during school that automatically turn on. Boundary pushing coworker aside, it’s best practice when working with kids so things don’t pop up. \n\nYou really need to be careful with a coworker you’ve described. After putting this in writing, everytime she crosses the line, clearly state that you don't give her permission to touch your personal cell phone & have a short meeting with your boss (nothing deep, just say xyz co-worker tocuhesmy phone but I've clearly stated i don't consent to that.no need to provide context of bf texts bc that’s not the point coworker should never touch it regardless)", "NTA - but I would go to HR and report her behavior, this is borderline blackmail. You’ve asked her to stop snooping and she blatantly ignored your requests, now she’s not even subtly threatening your job?!", "YTA to yourself.  Turn off the preview messages to your phone and keep you personal items off limits to others.  You risk losing your job if a child were to see any of those preview messages, or another adult wanted to spread misinformation about you.  Make sure you don't keep any private information/messages on any school computer equipment, etc. \n\nYou also need to firmly restate to your colleague she needs to stay out of your business altogether - she may be an open book but you aren't.  Then I would go to your boss and HR and report her harassment/eavesdropping/grabbing of your phone and personal laptop to view private messages, without your consent.  Going forward, act professional but keep an arm's length away from her.", "Sexting is fun.  Especially at work.  Kind of keeps things spicy.\n\nYour coteacher is a snope.  Shebjust threatened you with a sexual harrassment charge.  F her.\n\n You should report her for snooping on your private messages on your phone.", "Idk why everyone's saying you should hide your messages. YOUR COWORKER SHOULD STOP FUCKING SNOOPING. Why haven't you reported her?", "NTA.  \nCan't believe a lot of people saying YTA.  Every time a thread pops up about a spouse or partner looking at your phone, it's always, privacy, privacy.  How is this any different?  \n\nGo to HR and report this woman for harassment.  Her going through your stuff constantly and manipulating you with almost crying is textbook harassment.", "NTA because if you left the phone on lock screen while getting coffee that means the phone turned itself off like 2 seconds later, meaning your coworker actively turned the phone back on to snoop through your notifications on your private cell phone \n\nYou weren't actively sexting, so only crime you could've committed was not deleting the notification", "NTA. I’d report her for violating your privacy.", "OP: I'm not sexting at work, I'm just receiving stuff.\n\nEveryone: Ew, don't sext at work.\n\nReading comprehension took a big L today.", "NTA", "NTA in general your workmate sounds like a nightmare. I'm trusting you when you say that no kids could have seen your messages", "NTA. Not in the slightest.\n\nDespite what some of the more puritanical redditors on this thread seem to think, you have every expectation of privacy re: your phone. You left it to give her a good shock, and she judged and implicitly threatened you, almost certainly bc she hasn't had a good screw in much too long. \n\nOverall, reddit is a bit prudish when it comes to consenting adult activities. You did nothing wrong, so long as you protect your job. People love nothing more than to throw a good fuss over nothing these days, and I suspect she may do that.", "I fail to see how what she found while snooping on your phone constitutes \"sexual harassment\".\n\nBut why wasn't your phone locked?", "So…you gave a nosey busy-body leverage over you by leaving your phone visible and displaying suggestive/explicit material on it…where kids, no matter how remotely the possibility, might be exposed to it?\n\nDon’t see how that might backfire in you at all.\n\nEdit:  NTA, but…", "NTA - She needs to stay out of your stuff. I would set up at a camera in my classroom, leave my phone and laptop there, and let her sink herself, and then report her to HR for going through my things after having been asked REPEATEDLY not to. Put a password on your phone and your laptop, and take the previews off your phone so she can't see anything. And when she's ON camera, trying to get into your PERSONAL information, the SHE can take the heat for being inappropriate. When she whines about you \"sexting\", ask her how she knows what is on your phone when the screen is locked. (Archive his messages) and show them \"OH! No sexting messages!\" But PLENTY of video of her trying to break into your phone and laptop! Advise her IN FRONT OF THE HR PEOPLE that you do not want her looking over your shoulder when you are on your computer or your phone. The fact that her life is an open book doesn't mean that yours is and your information is not her business. It is inappropriate for her to read it over your shoulder or take it out of your hands to read it, and ask her if she understands that completely. Then leave and don't look back, and if you catch her doing it again, record her and take it back to them and get her rear end fired.", "She should not have been snooping, but you admitted to knowingly leaving the phone where she could see it and “let the previews stay on the phone” as stated in a comment. If you knowingly did that, then you can be accused of creating a hostile workplace.\n\nYou should **always** lock your phone and hide the previews on the lockscreen, especially in a workplace with small kids around. \n\nYTA because you knowingly did that", "Phones in class and sexting = fired. YTA. Also she is an AH.", "YTA\n\nThat is inappropriate at work. Full stop. Do what you need to do to make sure your colleagues don't see your texts.\n\n&#x200B;\n\n>I decided to leave my phone on a tall standing desk by my own laptop while going to get a cup of coffee, knowing my coteacher would probably look at it.\n\nThis is specifically why YTA. Take your phone with you.", "ESH - I’m willing to bet your boyfriend didn’t have the opportunity to consent to his private messages to you being used as bait or seen by somebody else. You could’ve just gone to HR or admin yourself about the issue, or been straightforward about your boundaries and let her cry if that’s how she wants to feel about it. Pretty immature move on your part.", "idk how teachers are sooo unprofessional and you guys work with children. only the older ones act like educators.", "going against the grain, NTA. You weren’t actively doing anything like all are claiming. And frankly, your co teacher needs to stop snooping. You’re lucky she’s not reporting though. Something needs to be done about her.", "YTA.\n\nAs someone that works with kids, I know they can be anywhere at anytime, even if you don’t think they’ll be there. As a teacher, you should know that too. In an attempt to prove a point to your coworker, you could’ve harmed a child. While this would be unintentional, the act itself is completely childish. If you have a problem with a coworker, take it to your boss and/or HR. Don’t do anything that could even potentially put the children as collateral—you might just end up with your mugshot on the local nightly news.", "NTA. You need to firmly state your boundaries to her, at work, in front of witnesses, preferably a supervisors office, and if she flips out just remain calm. You've tried to be civil in a private manner and now she is THREATENING your JOB to prevent you from having personal boundaries. Manipulative behavior at it's finest. That is the most direct route to problem resolution.\n\nA less direct route is to just ignore her, flat out. Let her read over your shoulder and do what she does, but give her no emotional reaction. Don't let her snatch things out of your hands either, deathgrip that shit or read with your arm over it. That's all I got, good luck 👍.", "ESH. Don't sext at work, especially around children. You say you knew she'd see it, you know she's a snoop, so you basically did it on purpose. No she shouldn't be snooping but are you *trying* to ruin your relationship with her and your reputation at that school? Teachers have lost their careers for stuff like this.", "ESH. Her for obvious reasons, you for intentionally leaving your smut out in the open for her to find. Doesn't matter if kids weren't there or can't reach the phone. It is disgusting behavior that anyone would intentionally leave shit like that for others to find without their consent at their job. She could have easily told someone that you were doing something inappropriate in class, or reported you in such a way that would get you in trouble. \n\nShe's a lousy, annoying snoop. \n\nYou both suck and shouldn't be working together, lmao. \n\nI'm not really sure what you thought was going to happen by leaving your phone out for her to find.", "ESH \nHer for obvious reasons but you’re gonna get fired over this if you’re not careful.", "Nta- turn off your text previews during work hours to solve this problem (if you have an iPhone this is in settings> notifications> show message previews)", "You go to HR and report several violations of privacy including her reading intimate texts from your boyfriend.  She's not allowed to touch your private property, open book or not. She's not allowed to comment on your texts. Shes the one you need to report.", "U should be fired and probably arrested. You don't do that at any job. Especially a school. You're a sick individual.", "If you were doing your job you wouldn’t be here.", "Is OP too dumb to figure out how to turn off notifications?  And/or to lock their phone?", "Yeah, no. YTA", "ESh\n\nYour boyfriend had an expectationof privacy that you have violated to prove a point to your coworker while you sext in a school.\n\nYour coworker needed a very firm \"No. Do not touch that. Stop looking over my shoulder. This is important to me. You need to respect my personal.space and boundaries.\" You had every right to lay those boundaries and to ask admin to help you enforce them if need be. But what you did is gross and unprofessional and could have cost you your career.", "YOU need to go to HR. This isn’t okay and will bite you in the ass. Tell HR you are being constantly harassed by the teacher and your belongings are repeatedly being messed with despite telling her no. NTA", "NTA but you are an idiot for leaving your phone out knowing someone would see it. \n\nMake it clear to her to not touch your shit and apologize for leaving those messages open.", "Was the phone open or closed? If it was open, Y T A. You don't leave sexually explicit content laying around at work.  If it was closed and she opened it, then she is a huge A H. If that is the case, you should report her.", "If I were you, I would cut her off at the knees and go to HR before she does. She could easily change her mind and try to throw you under the bus. If you go and explain what happened and that she is constantly invading your privacy, it would go a long way to protecting you.", "NTA. Co teacher needs to learn the art of staying out of other peoples business. I’d def bring it up to HR as a breach of privacy because that’s what it is tbh.", "NTA and how haven't you done this yet to teach them boundies?", "NTA. If anyone should go to HR, it’s you. She’s harassing you.", "Is your coworker Ms Bunker?????", "NTA buuuut you could easily get fired or worse if parents hear about anything remotely sexual in school.", "“I don’t care that you’re an open book.  I am not.  Get off my ass.”", "Politely inform your coworker thatig she is incapable of minding your privacy,  then you would be happy to have a conversation with hr about it.  \n\nWhen taking to hr deny leaving your phone unlocked and say you've caught her before going through your things.", "She won't go to HR because she has essentially been spying on you and not respecting boundaries.", "I get where everyone is coming from - inappropriate sexting in the workplace, more security on her phone etc.  But really isn't the co-worker a total asshole for making a point of looking at someone else's personal messages??  Is that not a invasion of privacy that SHE had no right to?  Why is everyone beating up on OP?  The co-worker is the total asshole in this scenario not the OP.  I would not even consider looking at someone's personal messages, like WTF?  And one of the respondents to this thread who is in a supervisory position and is often reading employee's personal phone information.  Not only extremely creepy but you should be up on charges.  Scary as fuck dude, get some help!", "She felt sexually harassed by reading your private messages?\n\nWoah boy.", "Go to HR. You should have already. Go and say that they violated your privacy and are accusing you of sexually harassing them when they snooped through your phone and didn’t like what they found. \n\n1. Best to be first. Trust me. 2. You should have done this before and it’s best to stop waiting for it. You have made a mistake by even participating in activities like that during the work day. Depending on the policies it is possible just using a personal device on work time is enough to get in trouble. Don’t elaborate or explain. Just say she violated your privacy, spotless you she didn’t like what she found and threatened you.", "P", "NTA! It was a bit provocative sure but in some cases it’s ok to be provocative with people like your coworker. I find it mind blowing how uptight and conservative most people are here.", "NTA but dumb. You could lose your job.", "NTA.\n\nShe's the Asshole.", "You would have been better off just reporting her for going through your personal things and forcibly taking things from you", "NTA \n\nYou don’t control what other people send you and she has no business looking at your phone", "NTA. But, as a teacher. You need to be very, very careful. Teachers have gotten fired because others have tagged them at parties. Any word about a dating life that doesn't conform to expectations and the wrong parent getting up in arms can ruin your career. Instead of trapping your colleague, another option is to just put up a partition in your workstation.", "How are people actually against you? What you do on ypur personal cell os private amd nobodys business.", "A million times NO.  🦜", "NTA - but go to HR instead of whatever youre doing, her behaviour wouldn't be tolerated in 99% of workplaces", "NTA. i mean yeah we are all humans\n\nshe on the other hand is very nosey. the first time someone yanks a laptop out of my hand to snoop around i am very in THEIR-FACE. not that i have something to hide, but privacy is privacy", "Your coworker is ridiculous and needs to learn to mind her own business, she invades your privacy then gets upset and jealous and throws heat at you.", "You should probably go to HR about her harrasment of you by taking your things and reading your belongings and how it's making you feel.\n\nESH you don't sound mature enough to teach young children if this is how you handle things and she sounds mentally unstable", "You’re NTA but I’d be careful of what you do at work. I worked for a school district for 24 years and I don’t think my higher ups would have been very understanding if they discovered that I was “sexting” during work hours. Just don’t lose your job or get written up over Nosy Nancy.", "If a co-worker touched my phone, we're fighting.\nProbably why I can't work with people, but seriously, if she doesn't want to see personal information, stop looking at people's phones.", "So she went into your phone and then wanted to go to HR? I'd say you go to HR yourself and get rid of her.", "I keep replying to fucking idiots in this post but let me say, no you are NTA. \n\n\nSadly, a lot of people in these comments ARE sad, lonely assholes with nothing better to do than try to shit on you.", "NTA - your phone, your business. Since the Kids can't get to your phone, I don't see a problem in sexting at work.", "you need to go to HR and demand they do something about her, if i had a kid at yalls school i would not want them to be taught by someone that rips things from others hands, looks through others phones without permission, and gets all over someone and on their business all shes doing is normalising that behavior to the kids, and like others said dont sext at work no matter what the job its not appropriate", "Report her to Security, IT, and HR. That busybody psycho is just trying to empower herself by trying to use guilt and fear.", "NTA\nEveryone saying YTA is insane. The only way these texts can be viewed is if you’re snooping on other peoples stuff. The kids can’t do it and the staff shouldn’t be snooping.", "Males.... They _always_ seem to find more cunning way to sexually harass innocent ladies. He made s trap out of your phone and now she become one of this male's victims. Eventhough she was just casually reading someone's personal messages. Another day at the office. There are predators everywhere. /s\n\nNTA.", "I got lost at the part where you said you're in your 30s and a long distance relationship. Just...why?", "Go to HR first and tell them she’s going through your personal belongings and you feel harassed, then tell them she’s been bringing up your sex life.  Her sexual harassment claim is then retaliation and will be dismissed quickly.", "Not the asshole", "Just tell that woman to fuck off", "I’m going to need to see the photos to decide", "NTA for having a sex life, but you are TA for leaving it open for her to see. There's such a thing as setting your lock screen so message previews aren't visible. But definitely you're TA if you left it unlocked for her to see as you definitely knew what you were doing.", "Fuck that shit!! That is none of her business!!!", "NTA. This person has no boundaries so why would you leave your phone unlocked and in a spot where she could look at it knowing that is exactly what she would do? If you want your boundaries to be respected you need to have some common sense.", "Turn all the security features on your phone and locks quickly once u stop using it. Yes it’s a pain in the ass buf it will end the snooping and you and boyfriend can still have fun while your at work. I dated a grade 6 teacher for awhile was a bad girl. She would be in class with kids sexting and sending me pics of her fingering herself \nWhole kids were doing text book exercises. She was awesome but damn she took some risks I would never take. Have fun.😬👍", "\nQ", "I think your co-teacher has autism", "Seems like an insanely bad idea to have your phone with explicit notifications on it in a classroom unattended at all. NTA because no kids saw it.", "Sounds like you need to discuss your coworker's lack of boundaries and anxiety issues with someone higher up because she needs a serious talking to about this from someone else.", "It should be fine, but you know how people get about teachers being consenting adults so lock your devices and lock your damn door when you’re out of the room so Mrs. Sneaky cant come cause problems for you", "YBTA Her for being a snoop, you for being a degenerate with an \"in public\" kink", "ESH sexting is wildly inappropriate whether sending or just “receiving stuff” while teaching small children. There’s no question co teacher is in the wrong, that doesn’t make your participation in this any less inappropriate", "[removed]", "Both assholes \n\nI’m just surprised your allowed to have a device with a camera near children. That’s a big no no AND it’s got explicit materials on it, are you for real? That’s insane", ">whether you'd be willing to lose your job\n\nThis.  Oh lord this. I get the reasoning, but man oh man, teachers have been fired for things the kids saw on teacher's phone when teacher had it put away in a drawer and they stole it. \n\nThat kind of firing makes newspaper headlines and makes finding a future job hard, too.\n\nESH.", "Text messages arent the problem. Op should have a lock on her phone. Who doesnt lock their phone these days??", "Especially when teaching kids. That's just weird to me.", "Wtf? OP literally said they weren't sexting, but the SO replied to old texts?! Damn, y'all some judgemental idiots", "I love sexting at work. My the day go by faster to be thinking of something naughty", "> don't sext during work time\n\nWhy not? Work don't pay well enough to be policing my actions.", "I don't think the \"you both have dirt on each other\" hypothesis works. \n\nSchool administration (and parents and the board) will not view these two things as the same, at all. Looking over your co-teacher's shoulder at their work computer during work hours and receiving sexually explicit messages during work hours are different levels of offense.", "Yeah. My brain was screaming out the policy number this is violating. Co-teacher sounds awful but sooner or later, if she continues to check these messages at school, it’s going to blow up.", "Screw fired. That's a sex crime! She had intent to expose someone with sexual content without their consent. She's committed a sex crime... in a school ffs", "OP can’t even report her for snooping now because they have something on her", "Yup. Agree with all this.", "And maybe not leave a bunch of sexual texts out in the open on purpose so you don’t also get fired", "This. My manager always tried to snoop on my phone, I made a screen saver calling her out by name. The first day it was up, I got into some super petty trouble lol", "No? Is she not allowed basic privacy?", "And where there are kids around as part of the job. What a disgrace", "Definitely disagree, kids aren't stupid, they don't go into adults property and when they do they know its wrong. Somehow this adult teacher hasn't gotten the memo yet despite warnings not to snoop.", "People get Arrested for stuff like this. OP is wild out of control", ">Leaving sexual messages out in the open\n\nIn your private phone = out in the open 😂 lmao you guys are nuts\n\n>absolutely can be considered sexual harassment.\n\nAbsolutly not and you obviously known nothing about law if you think that ! How come so many redditors agree with this nonsense?\n\nHere is a non exhaustive list of what can qualifies as sexual harassement and - how surprising - spying into someone's phone and reading an explicit message is not part of it, and not even close of any of it :\n\nMaking conditions of employment or advancement dependent on sexual favors, either explicitly or implicitly.\n\nPhysical acts of sexual assault.\n\nRequests for sexual favors.\n\nVerbal harassment of a sexual nature, including jokes referring to sexual acts or sexual orientation.\n\nUnwanted touching or physical contact.\n\nUnwelcome sexual advances.\n\nDiscussing sexual relations/stories/fantasies at work, school, or in other inappropriate places.\n\nFeeling pressured to engage with someone sexually.\n\nExposing oneself or performing sexual acts on oneself.\n\nUnwanted sexually explicit photos, emails, or text messages.", "Omg an adult sent explicit messages to their significant other on their private device. You're an idiot, there is zero grounds for a SH charge here.", "Is it absolutely disgusting? Cause I think it’s kind of hot. It is pretty easy to turn off Lock Screen previews so I’m leaning towards ESH, but come on, we’ve all done something like this and if you haven’t I feel sorry for you", "The hostile work environment is the coworker tapping OP’s phone screen and snooping through the notifications. OP should report her ASAP.", "One can hope 🤞. Maybe they’ll replace her with a legit teacher", "You know there just like one setting to change here right? It’s not hard", "HR isn’t going to give OP a sympathy pass. If she admits to having inappropriate messages out in the open at work then she’s put herself up for disciplinary action. Coworker may or may not also be in hot water, but HR is there to protect the company first and foremost. They won’t care that it’s *so hard* being away from her partner.", "Because leaving sexually orientated anything on display in a school of all places is way worse and would probably get her fired", "I see your point about sending an email to coworker so there’s a paper trial but coworker could easily reply with “I saw dirty texts on your Lock Screen during clock hours” and that’s a paper trail no one wants.\n\nI suggest talking to admin in person. If this is going to snowball, it’s better they hear it from OP first in person. Say they were private messages that crossed the screen when BF sent them, nothing you could control. And it was up high away from students. AND THAT YOU THEN CHANGED SETTINGS FOR THE SCREEN TO NOT SHOW THE ENTIRE TEXT AND NOW KEEP IT LOCKED IN A DRAWER OR PURSE.\n\n\nTrust me, it doesn’t matter if the kids can read. Parents who get wind of this will make it spiral into something it’s not, and mobs never want to give the benefit of the doubt.", "Bad advice leaving sexuallt explicit anything on display inside of a classroom could result in her being fired", "It's not that she should hide her messages—it's the fact that she *intentionally* set this entire encounter up. She knew that her boyfriend would be responding in a way that's totally NSFW so, as an attempt to get back at her co-worker for being nosy, she left out her phone for the co-worker to stumble upon the message previews. \n\nYes, the co-worker shouldn't be snooping, but it's super weird that she'd risk her co-worker stumbling upon something really racy—something that could cause the woman to go run her mouth to HR—just to be petty. Grow up. Open your mouth and set clear boundaries. If that hasn't worked, go to HR yourself and tell them that your co-worker doesn't respect your personal space and it's making you uncomfortable. Don't risk your job/livelihood over something that can be easily resolved with proper communication.\n\nESH", "Because she’s WORKING in a SCHOOL. It’s so inappropriate for her to leave her phone sitting around so someone else sees her sexually explicit texts.", "Because she’s AT WORK in a SCHOOL.", "You think that would go well? How would that conversation even start? This woman harassed me by looking at the inappropriate pics I---\" You're fired.", "No, it didn’t. These readers analyzed further by making the clarification that by not setting the Lock Screen to privatize the messages rather than displaying them, OP is compliant in the sexually suggestive texts. And that’s not good in any workplace but especially a school.", "Consenting adult activities should happen during adult free time.   \nNot in a SCHOOL in front of a fellow teacher. \n  \nIf OP gets reported, they will absolutely get fired.   \nThis would be headline news in my town.", "Her phone was locked. They were notifications on the lock screen. Like, the place notifications go to.", "The fact that she purposefully left sexually explicit material on her phone to make her coworker uncomfortable is sexual harrassment. Yes coworker shouldn't be snooping, but OP shouldn't knowingly expose someone to sexual content without their consent.\n\nIt doesn't matter what Reddit thinks or people think it's not a big deal or coworker is a prude. In the corporate world, it's a big deal.\n\nAlso this is not how mature adults handle situations. I'm sure as a teacher she knows that two wrongs don't make a right. And if HR found out about this situation, OP would most likely be more in trouble.\n\nSexual harrassment isn't limited to unwanted sexual advances or touch.", "She’ll come back with a post in a week comparing about being fired and wondering why it happened", "I love how she says there is no way they could reach it. I'm not a teacher and don't have kids but I know those fuckers are ingenious at coming up with plans to get into things out of their reach.\n\nHad a party this weekend and me and my husband debated several minutes where to stash our edibles and weed from it's regular spot so there was no chance for them to find it accidentally. And a lot of the kids were good kids.\n\nOp, sounds hella immature. And her coworker wasn't off base by warning her what she has on her phone in work. I don't believe she's not looking at it when she thinks no kids are around if she thinks kids won't ever find a way to get into her unlocked phone sitting out unattended.", "What does this even mean lmfao", "Is their coteacher too dumb to not go light up someone else’s phone and read through the notification previews?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Especially when in much of the world, employees can be fired for outside of work conduct, too. Assuming OP is an American teacher (which the context seems to imply) she could literally be fired on *rumors* of sexting alone if it made waves in the student body or community.\n\nI've seen teachers let go, even in unionized districts, for way less.", "A local teacher was fired for sexting on her school laptop during school hours. She didn’t seem to understand it was the fact she was using School property during school hours that got her fired.", "But the point was to make her nosy coworker uncomfortable for snooping. Solution: Next time, OP should come up with some other highly personal topic (other than NSFW) that would make Ms Nosypants utterly freak out. **Any ideas, people?**", "Wait wait wait. \n\n\nWhy the fuck is the TA looking at the Teachers phone? Regardless if this is kindergarten or not. That has nothing to do with OPs personal conversation. You're fucked in the head if you think OP is wrong. GTFO of here\n\nETA: if you couldn't read and see OP had messaged the SO the previous night, and they are in different time zones. You can't be saved from your own stupidity.", "OP why didnt you just talk to HR? Or the principal or whomever?", "It’s a mistake to have previews on your phone if your bf sexts you. Turn those notifications off and lock your phone! A ding is enough to notify you and keep naughty texts out of the hands of minors. But now that you know what she’s like, don’t allow her near you to read over your shoulder. Lock your devices and make an HR complaint if she keeps snooping around your room. She’s the real problem but you’ve done nothing to prevent her from snooping", "Have you told him \"don't reply between hours X and Y? If not, yes you are sexting at work. It was not a surprise, you are a willing enthusiastic participant in the sexting exchange.", "But you shouldn't have left it open, knowing she would read it. Only because (and I mean only!) you're at work and you might have landed yourself in hot water. Usually I would applaud this response, but you're at work. It wasn't a smart move and you ended being an AH to yourself! You could have gone over her head to complain about the snooping. It seems juvenile but it's better than getting reprimanded or even fired bc it APPEARS that you are indeed sexting at work, even though you are not", "You should get a privacy glass screen protector that makes it so only you can see your screen when you are looking at it and others from different angles just see a blank screen", "You should definitely change your settings so these messages don't appear unless you unlock your phone. I don't think you're TA and your coworker should mind her business, but I could definitely imagine your higher ups/HR would have a problem with this as well.", "you can't control what someone else send you, but i can't imagine a reason why you have a detail notification. or if you say you respond in the evening, notification at all.", "What if a boss or parent saw your phone screen? By not turning off the message previews on the Lock Screen, you are complicit with it. \n\nTeachers are held to super high standards for behavior. Tread lightly and tell your admin what happened before your coworker does. It’ll be better coming from you. Frame it as “coworker saw messages my BF in another time zone sent, I wish they hadn’t as they were intimate in nature, I’ve since changed phone settings to private and will lock phone in my desk drawer all day.”\n\nIf you’ve been a teacher for any amount of time, I’m sure you know how the rumor mill flies. It doesn’t make it right but the tiniest little flame can start a forest fire. And by fighting with your obnoxious coteacher (she’s not innocent in this, either), there’s already kindling.", "Well, receiving and reading sexts is totally part of sexting, you know?", "You admit that you left the phone out knowing they’d snoop. Your colleague needs to learn boundaries, but you should protect yourself by turning notifications off while at work. \n\nIf she grabs your phone or stares over your shoulder that’s on her. If you leave your phone out like you did that’s on you, and unfortunately in this society you’d be the one in trouble.", "Regardless it is still inappropriate to leave your phone around children unattended especially when you know that you are going to be getting messages like that. Also, the idea that kids cannot reach it is laughable. My nephew and nieces loved to climb up things when they were younger and they frequently managed to get to places that were far to high for them to normally reach. So whilst your coworker should not be poking her nose into your business, it's really not a clever idea to have those sorts of messages come through around kids.\n\nAgree with the ESH judgement.", "So your coworker went through your personal phone and then created a hostile work environment with a veiled threat to blackmail you. You need to report her.", "Personally I think it's fine, but as the others suggested it's probably best to secure your phone so they can't see it without you unlocking it", "For me no problem, I sext during work or while attending familly parties with children trying to snatch your phone. Still I live in countries where sexuality is nothing to be ashamed, however snooping through others phone is shamefull.", "Then turn your phone off if you think that you are going to get explicit messages and respond on your breaks. Leaving your phone on in your classroom shouldn't happen anyway.", "Lock your phone! You're sending nudes on an unlocked phone with a nosy coworker?", "Lol don't listen to the people blaming you for that. It's THE SAME THING if the neighbors were staring into your bedroom window and creeping on you. Or your breasts or objectifying you wearing a sexy outfit out for a nice night and then saying it's your fault because you wore that. \n\nSAME. EXACT. PRINCIPLE, CONTEXT JUST DIFFERENT DETAILS. anyone here that says otherwise is just a hypocrite lol", "Shitty, selfish teacher who doesn’t understand tech, like most of them nowadays 🤷‍♀️. Literally just a setting change needed and you can’t bother", "Sext at work, for crying out loud. Not in a way where you risk somebody’s safety or don’t do your job, but work doesn’t own you and so on. I don’t believe the people saying they never would, if they’re not totally against sexting. Her behavior is horrible and I wouldn’t stand for it, I also wouldn’t let your colleague read anything dirty because that’s a violation of the person I’m texting with. I would take it to my supervisor.", "Oh I agree.   \nSadly Sexting is going to get into more shit than being a nosy whiny snoop.   \n\n\nBest thing the OP could have done was raise the snoop behaviour when it was first a problem. Worst thing the OP did was leaving her phone out for snoop to find the sexting in the first place.", "I think they mean it more in terms of what can be *proven* but I don't think they understand that when it comes to schools/teachers, even the allegation is career ending.  The allegation of being a snoop isn't anywhere near as problematic.", ">Looking over your co-teacher's shoulder at their work computer during work hours and receiving sexually explicit messages during work hours are different levels of offense\n\nYep. At least here, reading someone else's messages without consent is a crime, directly forbidden in constitution. Messaging during work hours is worth at max a warning.", "Um, a teacher, who is at school!", "Receiving sexual messages while on the clock is considered sexting at work.", "You intentionally left your phone out in the open ***knowing the messages would be visible to anyone***.  Even if kids weren’t there, it was possible someone else could have seen it by accident.  You put yourself in jeopardy for a really stupid reason.", "you left your phone out, in public, visibly, when you knew you were being sexted, and you didn’t turn off lock screen previews. \n\nthat’s what makes YTA", "Your phone needs to stay in your pocket. You’re at work. And if you know he’s replying to sexy messages then you absolutely should NOT be reading those at school regardless of whether kids are in the room at that moment. Plus you did this on purpose. Wildly inappropriate regardless of your annoying co-teacher.\n\nEdit to fix typo", "Is he in a time zone where they don’t have clocks?", "God you’re dumb. If you can’t do, teach, like they say I guess", "The fact your partner is so comfortable sending you sexually explicit content while you’re working with kids, and knows you could be leaving it out for it to be seen… you two are gross and sketchy. As wrong as your coworker is, that is sexual harassment if you and your boyfriend are trying to be caught by her, want her to see and read the things you both say. To the point you’re both fine with risking kids seeing it. I would like to report you at this point.", "Da dum tis", "Why not both?", "It’s a school. She’d be lucky to not get fired and her annoying co-worker would just be told to stop acting like that.", "No one would see it if you didn't invade privacy :)", "How dare she receive texts while at work.", "So she has no right to privacy?", "So if you're on break at work, and your phone is out, and you get a notification for a game, and someone looks at your phone and sees it...you should get in trouble for playing games on your phone at work? Even though you're not playing games and it's this other person invading your privacy? Wild.", "The phone was locked", "Exactly! Not to mention that kids are giving cell phones as pacifiers at a young age so they are magnets to kids!", "You can’t control what other people do. All you can control is what you do. \n\nIf you refuse to control your own behavior, like the OP, resulting in things like happened to the OP, then you’re as ridiculous as they are.", "“I think I might have tuberculosis”", "Can't be fired for having bum guts. Graphic details about poop usually work too", "“I heard one of my coworkers talking about how they intentionally poisoned my nosy coworker because she wouldn’t stop snooping. Should I call poison control? She could just die any moment now……”", "The point is that OP did that on purpose, because OP knew the other teacher would look.", "She said she left it where she knew her colleague would look at it. She doesn't care.", "? Why? Are you telling me you're okay with anybody at work looking at your phone? That's your phone. It's private. It has nothing to do with anybody. No person would know, unless the TA said something. \n\n\nI swear some of y'all just hop in here to echo chamber and be assholes", "Teachers get fired for posting bikini pics on their private social media. Purposely leaving explicit sexual material out where you know a coworker will see it is waaaay worse and would definitely get her fired for cause.", "Purposefully viewable to who?! The people who pick up someone else's phone? Lmao that's not the look you think it is dude, don't touch someone elses shit. Period. Wait let me Cardi B it up PERIODT. What about that don't you get, or are you happy letting me go through your phone as a complete stranger?\n\n\nDense. Ass. Fucking. Idiots. \n\nAll of you.", "And her work is teaching young children. If they saw her or her boyfriends nudes, or know how to read, and repeat what they see on her screen, she could so easily end up on a sex offender’s list and lose her ability to ever work with kids again. OP is a petty idiot. Petty is fine, but this tactic in a setting for children is disgusting.", "If I gave you a beer with your car keys in your hand, would the cops believe you when you told them I made you drink and drive? I can assume a lot, that doesn’t make you not culpable if you do it.", "Europe?", "So? Texting is designed for not immediate answers: you text someone whenever you have the opportunity, they open it and answer when they have a chance. You, as a sender, don't need to worry about your sendee's current environment, if anything, it's up to them to take care about notifications and sounds. Which OP specifically did to set her collegue up, great job! Maybe it will be a lesson.\n\nThe bf answers when he is able to and this arrangement worked fine, it's just that OP got fed up of her coworker's behaviour, and rightfully so. She says she doesn't sext at work, her behaviour is not indecent, while her coworker's is. It's only a problem because the said coworker has a habit of snooping around and has the audacity to blame OP for that, even though it all occured due to her awful habit. Maybe, just maybe, in order to not be shocked by the content of others' phones you need to stop reading stuff on said phones? \n\nTalk about teacher's behaviour, though, the collegue is setting a much worse example. She's actively showing it's okay to violate boundaries, while OP has the decency to keep her conversations private, she doesn't placate them around. Who's at fault for snooping through *private* stuff?", "And what's your point? She mentioned the kids aren't tall enough to rech the desk and they can't read, plus they weren't present in the room at the time", "\"THERE ARE CHILDREN HERE, YOU FOOL!\"", "If you literally pick up and snoop in someone elses phone who you're not even friends with HOW is it inappropriate for them to have private content on it? She did not need to look at her personal phone?", "\"Wildly inappropriate\"? Why is the other person looking at her private phone in the first place?", "I think she did the right thing. She wasn’t texting. She was getting responses from the night before, words only, and only co-teacher would see them. Co-teacher annoying af and doesn’t know bounderies. She gave her a fable lesson, adult edition. NTA.", "I know, right? He's a grown man. He's capable of calculating the time zone difference and not sending stuff that could get her fired if the wrong person happened to see it. \n\nBoth OP and the husband seem a bit immature, and tone-deaf about how a school may be different than other workplaces in this regard.", "\"Gross\"? \n\nHas it been that long since you've had a proper one?", "How could she be found culpable for someone else messaging her “unexpectedly” inappropriate messages. She is not actively participating at that time so she is not sexting. It is on her to not let the kids see it. She had thought about them potentially stumbling upon it with this plan and placed it out of reach and mentioned they can’t read. Hopefully there are no pictures cuz u don’t have to read those lol but this is a matter of invasion of privacy not OP being a horn dog. I wouldn’t have done it personally but I respect the approach because u considered the children. Make her cry OP tell her she needs to mind her business. Lie to HR and say she said the n word.", "Agree with all of this.", "It's simple, stay the fuck off of someone else's phone. To see it, the shitty coworker had to pick up her phone and turn it on. Meaning she was actively breaching her privacy", "Don’t insult an entire profession because OP made an error in judgment.\n\nOP, I get that your coteacher is nosy and that’s annoying. But teachers are held to such high standards that you needlessly risked your livelihood with this. Why??? Is that a choice you will look back on with pride in a few years? Two wrongs don’t make a right. Keep your phone out of sight.", "Thank you, thank you!\n\nI'll be here all week! \n\nTry the calamari!", "You’re saying OP created a hostile work environment by receiving texts she had no control over and leaving her private phone, locked, for a few minutes? Yeah no. The person going out of their way to snoop through someone else’s private belongings is the AH.", "But wouldn't you consider those txts NSFW?", "It’s not private if you have sexts flashing across your Lock Screen 😂", "Who’s claiming that?", "False equivalency. Not even close.", "All the people downvoting you and saying OP is N TA never had any sexual harrasment training at their job. I have to take a course every year.\n\nAnd I do believe the coworker said something to her to warn her because having that readily available on her phone in a school is serious and she has no idea whether having sexts on her phone is a regular occurrence or if she did it once to annoy her. And if she knew it was the latter, she knows what OP did is sexual harrassment and would bring it to HR.", "🏆🏆🏆", "Perfect - OP returns to find nosy coworker retching into the trash can! Love it.", "Outstanding", "What if her boss walked in and happened to glance at the phone screen lighting up with a new message and saw inappropriate content on a phone lying about? Some of us have just that luck.\n\nNot to mention, OP should know better than to underestimate kids’ ability to get places they shouldn’t be to grab things they shouldn’t have.", "But anybody else could have just as easily.", "which is actually, legally sexual harassment, in the states at least.", "Did you even read the post, or are you being deliberately obtuse?\n\nPeople who aren't okay with others looking at their phone usually don't purposely leave it unattended where they know other people will look at it.", "This would be headline news in my school district. She’s really lucky the other teacher didn’t report her.", "\"Teachers get fired for posting bikini pics on their private social media.\"\n\nwow that is insane, so effing victorian (as long as they dont have their students on social media following them, which they shouldnt)", "💯", "I’m assuming you’re implying the colleague shouldn’t have snooped, which I agree with. \n\nMy point is that if this gets to HR the focus is probably going to be on OP leaving out their phone knowing NSFW messages were incoming. They should have first reported the invasion of privacy.\n\nIf a person is arrested for drunk driving they are primarily charged with the crime, but if it becomes clear they were over-served and the establishment knew they were driving home that establishment can also be investigated and/or sued. This is especially true if the drunk driver is in an accident resulting in death/injury.", "Slovakia 🇸🇰", "You’re fired! -DJT", "Really. every kid is so short they can’t possibly see something on a table 😂. Thankfully she won’t have her job for long", "Whatever, another shitty teacher, another soon to be fired teacher", "Or maybe, that's when he can respond and then go about his day/sleep to continue the conversation later?", "people are in these comments acting like she was caught getting one off in front of her students, absolutely insane lmao. Like have none of these people ever sexted? It’s not hard to look at a message and go “oh, that’s hot!” and…. that’s it. You’re busy, deal with it later, think about it/answer it later. As if a couple horny texts from her partner suddenly make her a uncontrollable nymphomaniac?? I’m so lost as to what y’all think sexting is. \n\nLike sure, what she did wasn’t a great idea, but that’s not what 90% of the people here seem to even have a problem with lol", "Yes that’s what I’m saying.  Intentionally displaying graphic sexual content so that others can see it is literally the example HR depts give as creating a hostile work environment.  Don’t blame me.  Take it up with the law.", "How is that false equivalency? I literally just changed it from sexting to a game. That's about as close as you can get. Nice try to use buzz words you've heard elsewhere but not understood.\n\nReading comprehension took a big L today.", "I've got multiple people working for me and have seen text messages pop up. If I actually read them I never comment and definitely wouldn't chastise them about private conversations.\n\nIt's like reading someone's diary and having a go at them about what you found while violating their privacy. You don't. If you do, you just keep that shit to yourself.", "Also \"they can't read yet\", ok. But what if bf replied to her naughty pics with a picture of himself? Kids don't need to read to be able to say \"I saw a peepee on teacher's phone!\"", "[removed]", "Lmao it seems like you're trying to be obtuse. \n\nSo under your logic, anybody can unlock your phone and go through it right? Anybody within eyesight can see your private messages and do whatever right? Your life is my life right?\n\n\nIt's not about being \"okay\" with it. \n\nIt's about shit that's \"YOURS\" and shit that \"ISNT\" \n\n\nI know thats acute way to put it, I hope you aren't too obtuse to get it.", "Unless they're doing something very provocative in said bikini, this would not be the case in the UK. At most you might be asked to make sure your socials are set to private.", "I know you say that ironically, but still it would probably be for the best. If the workplace isn't going to treat OP like a human she is and help her protect her boundaries right, it's not actually that big of a loss.", "It's a standing desk you coagulated gravy hot dog bun. Also, yeah, kindergarten kids are quote short, you're also ignoring the fact that children weren't present, and she specifically left the phone KNOWING the snooper would look. \nBut by all means please tell us how someone can get terminated for recieving a text.", "To me it sounds like you had to actually look at the lockscreen of the phone to see it. That would 100% be on the person actively turning on someone's phone to see their messages", "She deliberately left her *phone* out in the work place. It could have been anything, actually, a store notification, a weather forecast or a dirty text from the SO, but you have to be actively looking to find out. Why would you look at someone's phone to the point where you actually read the content, in the first place?", "But the coworker would have had to open the messages and read them to see truly inappropriate content.\n\nWhat pops up on a lock screen would be maybe one message that could be read without looking at the rest. Coworker had to deliberately go in and read them.\n\nHow is that on OP?\n\nNTA.", "Is text graphic now?", "“Nice try to use buzzwords you’ve heard but don’t understand.”  Thank you for the chuckle. \n\nI suppose being AP Lang certified which focuses in rhetorical strategies, including logical fallacies, makes me highly unqualified to understand your comment. Along with a BA in Lit and an MA in Education. \n\nIt’s a false equivalency because they’re different in purpose and in nature.\n\nIllicit texts are real-world, with real world consequences and communication, and possible legal or ethical ramifications.\n\nVideo games are not real world, and are meant primarily for entertainment. Unless you’re suggestive a live game, which still isn’t the same.\n\nSexting at work has real world consequences in ways that playing games on a break does, and it’s important to note that OP doesn’t say she was on a break, just that the kids weren’t in the room. Not the same thing, either.\n\nComparing illicit text messages with video games is a false equivalency because of the significant differences in legality, consequences, intent, responsibility, and social implications between the two.", "If every boss is like you then I guess there’s no problem.\n\nIf someone leaves their diary on a desk and open then it’s at least partially their fault if another person reads it. Keep your private shit private.", "Also unless these are literally babies OP should never underestimate that some of them might well be precocious and have started reading already. Like, I started reading simple books on my own when I was around 3 or 4.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You’re fired -DJT 🦅", "This is like looking in someones windows then getting mad and saying you were sexually harassed because you saw them having sex lol.", "Yes in this context", "If it is sexu1", "Of course sexting and video games are different. That's not the point being made.\n\n\r  \nThe point being made is that consequences are being directed at someone for something that is not workplace appropriate, but that they aren't even participating at that time and others are only aware of because they are invading their privacy. It could be a game, a porn app, someone wanting to buy drugs from them, or a plethora of other things. The teacher only had the phone only accessible to adults, and would only be investigated by someone invading her privacy - it is a crime to access someone else's private communications without permission.\n\n\r  \nIf you care to address the core of my argument, I'd be glad to entertain your discourse. If you're going to quibble over minutiae in an attempt to save face, I'll let you enjoy your self acclaimed reddit comment supremacy in solitude.", "Well, if you worked in HR and had someone saying they were reading someone's private text messages and did it all the time, so they should expect you to and you should hide your phone from them, you would be internally groaning about what a shit storm the person was creating. \n\nYou aren't allowed to go through a person's personal devices, especially not a coworkers when it has nothing to do with the job. \n\nMy HR would actually caution the woman reading the messages on another person's phone and make an example of them for having the hide to do that and then complain. \n\nIt's like peeking through the bathroom door and complaining about the underwear someone is wearing. What are you doing peeking through the door? \n\nOP's phone has nothing to do with the class or what they are doing for work. There is zero reason to be looking at it.", "I used to do this as a kid. My mom would, without fail, close it and *not* read it while she was cleaning my room. It's not partially your fault for someone else's actions, because they are their actions. I don't touch shit on people's desks. It's not mine. Neither should you. Or anyone else. And if they do, that's on them. Not you", "That's fucking stupid. So if you accidentally left your diary open, with your logic if I read it and posted your most personal thoughts you would automatically assume it was \"your fault\" fuck outta here with that whataboutism type shit", "Absolutely! Anyone who goes looking at someone else's text messages deserves what they get!", "What if you looked through the window to their classroom and saw them having sex? Is it sexual harassment then? 🤣🤣🤣🤣🤣", "Extra credit points for your use of “minutiae.”\n\nYour original comment went from the “heart” of what you said (based on the similarities between it and this last comment) about someone not being culpable for receiving a text or a dirty ad, etc. \n\nYour first comment also said people lacked reading comprehension, which I replied to and disagreed, stating why I felt that way. \n\nYour next comment was the example of playing a game but didn’t address that “heart of the issue,” as you put it. It just said “imagine playing a game at work on a break” with nothing about culpability. I pointed out the false comparison, get belittled and accused of not knowing the term, and then when I break it down and address it, you tell me I’m not addressing the heart of your argument?! Which wasn’t present at all in the video game analogy comment.\n\n\nMaybe learn to organize your writing.\n\n\nFurthermore, I think you do make good points buried in there below plenty of disdain for \nsomeone disagreeing with you. Those good points are also hidden under elevated vocabulary, another tool used to mask incompetency. \n\nHowever, the issue is the same: in my opinion, obviously not yours and we can see how you react when people disagree with you, is that OP is liable for not blocking the text previews on the Lock Screen while at work.\n\nThe lynchpin on my opinion is the setting: it’s a school. If this were a slightly older kid, say a 4th or 5th grader who can read, and they saw these texts, would a judge side with the teacher? Maybe. But maybe not because it’s a school and there are legal and ethical components to working there.\n\n\n\nIf you disagree, maybe discuss some of the “heart of the issue” topics I’ve presented in several of my own comments, rather than whining that I didn’t address yours. Which I did, when possible.\n\n\n\nOverall comments score: C+. Great discussion points, organize and develop in detail. /s obviously and meant as a JOKE! I truly do think you have good points and clearly see your side. In a fair world you would be right. But we don’t live in a fair world, we live in one where teachers are regularly fired for stuff like this.\n\n\nETA- save face for what??? Being belittled by someone who is clearly annoyed that someone debated with them? The horror.", "Sure, so OP should have gone to HR instead of pulling this scheme. Now if she tries that she gets herself in trouble along with her coworker for leaving sexually explicit messages out where anyone could see them (since she purposefully didn’t hide her notifications).\n\nI’m not defending the coworker at all. I’m saying OP’s response was not a great way to go about handling it.", "But just because they were wrong to snoop at your sexts doesn't mean HR couldn't also act on the sexually explicit text left out in a classroom.\n\nTwo people can get in trouble from an HR report. It's not either or.", "Welllll,\n\nAt work there is no expectation to privacy if it's on company time.", "If I were an administrator, and OP came to me, the first thing I would think is that there are way too many opportunities to \"snoop\". This implies that there's a lot of personal stuff happening on OP's devices that shouldn't be happening during work hours. \n\nAside from a very rare confidential HR email or family health emergency, there's not much that you should care whether or not colleagues see. The apparent frequency of this \"snooping\" tells me more about OP's work habits than coworkers'.", "Lmao no. TA should've minded their own business in the first place, and there would be nothing after the fact. \n\n\nHow do you not understand that?\n\n\nLet me explain, there would be no issues at all. If the teachers phone was left where it was, and the only person that looked at it was the teacher. \n\nYou act like she hopped on the projector with her nudes? Tf is wrong with your logic dude? Or are you trying to impress somebody? You know it's okay to go against the majority when you're right, regardless of the consequences right?", "[removed]"]}