{"id": 29757, "submission_id": "17hjbil", "title": "AITA for not giving my sister an invite to my wedding?", "selftext": "My partner and I are getting married in a years time. We sent out the \"save the date\" cards with a nice note saying that it will be adults only event (18+) as most of our friends and family members have kids. Our friends and my partners family don't have any issues with this. They all are happy to have a night away from the kids and were grateful for a years notice to find babysitters. My family however, weren't. My sister has told me that she and my BIL won't be able to attend as their kids (ranging she from 7 to 13) won't be allowed to attend and she can't find a babysitter. I suggested her inlaws (as a possibility) who regularly look after her kids and explained my reasons for having an adult only event (cost being one of them and we were going to do a separate day where we have a mock wedding after we get back from the honeymoon) but she still refused to attend. I said that's fine and I respect her decision, and said I won't send her an invite as to not rub the wedding in her face. Now my parents and brother are angry at me for not going to send her an invite (which will have the location (local) and time of the wedding) and are refusing to attend also. Last time she was invited to an adults only wedding, 2 years ago, she brought the her kids along (against the bride and grooms wishes) and they ended up screaming through the service and destroyed the cake. I want people to relax and enjoy my wedding without having to worry about crying kids or wondering where they are. My partner supports me but thinks I should not send out invitations to either my sister, my parents as well my brother. So I'm wondering AITA for not sending them invitations? They can still come to the \"kiddie\" wedding as that's going to be more kid friendly. Please note that no invitations have gone out yet and will be going out in the next 6 months.", "created_utc": 1698397327, "permalink": "/r/AmItheAsshole/comments/17hjbil/aita_for_not_giving_my_sister_an_invite_to_my/", "score": 796, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am I the a****** for not going to send my family invitation to my wedding?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA -  Your sister has a year to try to find a babysitter, yet she knows instantly that she can't get one?  Clearly she doesnt care enough to try, or is hoping you will change the policy and accommodate her. \n\nAs for not sending her an invite,  of course you wont send one.  She has specifically already told you she cant come. Sending an invite to someone you know cant make it is a waste of time and paper. \n\nI don't know what the rest of your family is thinking. Are you sure they heard the same verion of events from your sister? Because I cant see why they would overwhelmingly support her in this.  Hopefully you can at least fix whatever is happening there and have some family at your wedding.", "NTA but the entitlement of your sister is amazing. To have witnessed her kids ruin someone’s wedding and still insist she get to bring her kids…Although she probably blames everyone but her angels.\n\n\nDon’t invite her or your family of enablers, so you can have a stress free, nut free wedding. Perhaps someone at the door to bar them from entering if you think they’d go there. \nEdit word", "Sometimes I wonder if people were raised in a barn?\n\nAn elegant evening dinner dance is no place for children.\n\nYou need to do everything you can to prevent this woman from ruining your function and further more, tell your family to get a book on etiquette. Then they can understand what is correct and who is right in this situation.\n\nI am always shocked when I see these entitled people dragging their entire family to functions that other people are paying for.\nNo class at all.\n\nGlad you are addressing this early and upfront", "NTA\n\nA year out and she claims she can’t find a babysitter? \n\nIf she has a habit of disrespecting people’s wishes and you think there’s a risk she will show up with the kids then don’t invite her\n\nSounds like she enjoys stirring up drama and then playing the victim", "NTA , if you don't want kids there that's a choice you made to enjoy your day! If your sister can't understand that then she can settle for the mock wedding! Same with your brother and mother. That's very silly to be that upset about not getting an invitation if you refuse to come without kids. Don't let them ruin your day! If they can't be grown ups they are acting just like children anyways and shouldn't come. Good for you for standing up for yourself! You deserve to have the best wedding day exactly how you want it!", "NTA. \n\nShe’s already shown that she shows up with uninvited “guests” (the kids). If your family won’t respect your wishes, why the heck would you invite them?", "NTA , but your sister is , it's a power grab on her end and can't fathom you enjoying your day without her kids . she needs to grow up and understand she is not the center of the world .", "NTA. And it’s clear where your sister gets her sense of entitlement from with your family behaving that way in response. I’m really sorry that they are acting this way, but you deserve a day filled with people who love and care about you, and that are only concerned about celebrating you.", "NTA, but you are also not thinking this through.\n\nAs has been said, she'll find out where it is, so if she wants to show up not sending an invite won't help \n\nSending an invite and maintaining an adult dialogue seems the minimal disruption way to deal with it", "NTA\n\nYour wedding your rules.", "NTA. Don’t send invites to your family. They will crash it. Hire some security.", "NTA. Your entire family is being manipulative. I wouldn't send any of them an invite so your sister doesn't show up with her kids anyway", "Nta. Don't invite her. She's the person who is always like but I got leave my babies. Ugh give me a break. It sounds like your sister is very bratty and immature. Classic golden child. Don't invite her", "NTA. I love my kids, they would hate weddings. Some things can just be for grownups! I would invite them, put child free in massive letters, then ask your partners family to be bouncers on the day and not let any children in. Hire a bouncer if you have to!", "Nta i would ask your parents and brother would you lime her kids doing the same at your wedding and theirs.", "NTA.\n\nmake sure you have someone at the entrance that will prevent from anyone with kids entering. your sister might still show up", "NTA\n\nSo basically you know your sister will probably take her kids and attend the wedding even after she told you she can't if you gave her a courtesy invitation? That's a valid concern since she did it once before. Stick to your guns, no invitation for a sister with a history of destroying weddings.\nAlso why are your family mad if she already declared she won't attend? Or do they already know of her plan to crash your wedding and are supporting her? Good! Now you have another three invitations you no longer need to bother sending!", "NTA\n\nYour wedding, your rules. I'm a fan of children at weddings. I think they're adorable, hilarious, and a lot of fun, but I would never think of showing up at a wedding, with kids in tow, after being told it was child-free. That's just insane to ignore the happy couple's wishes like that.", "Wait, your sister has already stated that she can’t find a babysitter for a wedding that is happening *a year from now*?? Wow, guess she has a magic crystal ball or something.\n\nIf this is all true then NTA and your sister is clearly trying to make excuses so that she can bring the kids.", "NTA. Why waste invitations on people who have already said they're not going? You're calling their bluff. When they ask, tell them exactly what they told you. They said they weren't going so why should they expect an invite?", "The thing is, that she will still find out where and when it is. If you not sending an invitation is to avoid her being able to crash, that won’t work.\n\nPersonally I’m conscious that some people love to be included and invited, even if they won’t attend. It shows thought, care and being the bigger person.\n\nI’m also thinking that the shouty squally children will be older and (hopefully) better behaved by then - not to say you should include them, but that holding behaviour over them from a couple of years ago isn’t fair - though holding adult behaviour from your sister absolutely is.\n\nIf it were me I would still keep an invitation for her and mail it. Because if she sticks to your rules she *is* welcome, right?\n\nBut I would include a covering note reminding her of your conversations, that it’s child free, and that you will be engaging security at your wedding to ensure it stays that way.\n\nThen the ball is in her court, you aren’t preventing her from attending at all.\n\nOBV if you have a problem with her attending anyway the above is redundant.\n\nIn any case, you are NTA.", "NTA if you know about a childfree event one year before it happens and you cant find a babysitter for your shitlings something is wrong with you and possible them.", "Don’t send them an invite. \n\nDo invest in security, to divert family members with kids away. \n\nNTA", "Weddings are family events. Children are big part of families. Draw your own conclusions.", "NTA, since she told you she wouldn't be coming already. However, if you are worried about her actually showing up with kids, not giving her a physical invite won't stop her if that is her plan since she likely knows the info already and other family members could easily share theirs with her. I would probably just send her an invite to avoid this battle with your family knowing it won't actually change anything.", "Crazy seeing these comments. Ytah. You don’t want to invite your entire family to your wedding?!\n\nWhat do you think a wedding is exactly? You are joining your families, but you don’t want yours to come. Do you want to cut your family out of your life? \n\nI mean if you do, sure, that’s your prerogative. But if you care about your family, and you want them in your life you should know that not inviting them to your wedding is not how family treats one another.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy partner and I are getting married in a years time. We sent out the \"save the date\" cards with a nice note saying that it will be adults only event (18+) as most of our friends and family members have kids. Our friends and my partners family don't have any issues with this. They all are happy to have a night away from the kids and were grateful for a years notice to find babysitters. My family however, weren't. My sister has told me that she and my BIL won't be able to attend as their kids (ranging she from 7 to 13) won't be allowed to attend and she can't find a babysitter. I suggested her inlaws (as a possibility) who regularly look after her kids and explained my reasons for having an adult only event (cost being one of them and we were going to do a separate day where we have a mock wedding after we get back from the honeymoon) but she still refused to attend. I said that's fine and I respect her decision, and said I won't send her an invite as to not rub the wedding in her face. Now my parents and brother are angry at me for not going to send her an invite (which will have the location (local) and time of the wedding) and are refusing to attend also. Last time she was invited to an adults only wedding, 2 years ago, she brought the her kids along (against the bride and grooms wishes) and they ended up screaming through the service and destroyed the cake. I want people to relax and enjoy my wedding without having to worry about crying kids or wondering where they are. My partner supports me but thinks I should not send out invitations to either my sister, my parents as well my brother. So I'm wondering AITA for not sending them invitations? They can still come to the \"kiddie\" wedding as that's going to be more kid friendly. Please note that no invitations have gone out yet and will be going out in the next 6 months.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA --- You have decided to have a child-free wedding with the understanding that in doing so some people either can't or won't attend, you have also let people know a year in advance so that they can organise babysitters should they need them, that your sister has already declared that a year away from your wedding that she can't find a babysitter and won't attend so to try and manipulate you your parents and brother have now also stated that they won't be there, sounds like a them problem and your response should be, sorry you can't be there I'll make sure there are lots of photos to show you of the day.", "NTA\n\nThis is YOUR wedding and your special day, she said she couldn't attend, have her explain it to your parents as it's something decided by her completely.", "Nta your sister is an ah I can't imagine her kids showing up to a wedding there weren't allowed at and destroying the cake. I'm scared if I get married what will happen at the wedding.", "Wait they have a year and half to find a baby sitter", "Nta", "NTA\n\nAt first, I thought - just let sis decline; you don't have to not invite her. Then I read about her behavior last year. You are absolutely right to not invite her.\n\nYour fiance is also right about not sending invites to the folks you know will give her the address. The only other option is to hire security to keep her and her kiddos out.\n\nShe assumed her in-laws would be invited; now she knows that is not so. So her in-laws should be available to babysit. Babysitting covered! Except that's not what she wants. And she's going to get what she wants. You and your plans for your own wedding mean nothing to her. It's your sister's world, and your family are her \"yes-foks\".", "NTA. It is YOUR wedding, you get to decide what it is like.", "If you're just trying to keep the details away from her, you know your parents/brother will tell her where and when. I'd send her and her husband an invite and then invest in security for your wedding.", "NTA", "NTA\nBut she will try to crash your party, get security!", "\"Can't come, can't get a babysitter\"  \n\"It's in a year's time, surely you...\"  \n\"Nope! Babysitters globally are all booked that day\"\n\n&#x200B;\n\nNTA", "NTA", "\nNTA\n\njust get a bouncer specifically to stop people with children entering. Then station another bouncer between you and everyone so no one can bother you to tell you they aren't being let in. Then, after the fact, just say if sorry it was child free. We did warn you.", "NTA family always trying to guilt you into doing what they want.. stand your ground its your special day", "NTA. But, to keep the peace, invite her AND hire security.  Make the photo of security dragging her and her kids away the centerpiece of this year's Christmas card. Bonus points if you end up with a mug shot", "I handed out the \"save the date\" at a family dinner. So parents, brother and sister were all there. This was where the conversation started. I did mention that her inlaws would be happy to babysit, and she thought that her inlaws were going to be invited to my wedding. They aren't. I've met her inlaws twice. Once at her engagement party and once at her wedding.", "OP should have the family sign a contract that if she turns up with the kids that the family will be charged the cost of the wedding. Let them put their money where their mouth is. If they're upset and feel she won't turn up with the kids but should still get an invite let's see how much that feeling holds when they could get a massive bill.", "Cool, Christmas presents sorted! Emily Post Wedding Etiquette for all!", "Yes, everyone has 15 months to find a baby sitter.", "I agree with you on the kids and not holding over their heads, which is why I planned a second \"wedding\" for them where they can see me in my dress and where they can run around and with more friendly children food. (Think kids party vs full back tie ball) I remember being a kid and wanting to see the bride but the ceremony and reception were boring\n\nAbsolutely if my sister leaves the kids at home, I'd love her, and the rest of my family that are saying they aren't going, to attend.\n\nI am beginning to think security, or people acting as security is probably going to be a good idea in this case.\n\nThank you for your suggestions.", "I would love my entire family to be at my wedding, but I know that sometimes adults would love a \"kid free\" day to celebrate and kids can be bored at adult events. That was why I'm having two \"weddings\". One for the adults where they can relax and let loose and one that is more suited to the kids where the \"ceremony\" is short and the food and entertainment is kid friendly. (Like ice cream cake and pinata vs black tie ball).\n\nI'd love my sister, and the rest of my patents and brother,  to attend if she leaves the kids at home. Otherwise they are still getting an invite to and is more then welcome to attend my second \"wedding\". No cutting anyone out of my life here.", "Can u fuckin read?🤣", "Lol your a fool", "Do they regularly take her side on things like this?  Because I'm not seeing any logic in picking her side. She has qmple time to find a babysitter and you framed not sending an invite as not rubbing the event in her face since she can't come.  Thats about as diplomatic as its possible to be in that situation. \n\nSorry theyre making more drama,  in general I agree with your fiancees stance of not inviting the lot of them if theyre gonna act like this but I understand that you may want to share your special day with your family.", "All weddings should have some sort of security - for people who show up uninvited and for people who act up (fighting, announcements, drunks, etc). This is for both the ceremony and the reception. It should be someone who can handle things so the bride and groom do not have to get involved themselves. Could be the wedding planner, an usher, a couple of scary looking friends, or even private vendors.", "Yes, it is normal for the parents to take her side and expect me to either cave or apologise. I am the \"problem child\" as I'm not religious and they all are.", "Well that explains that.  Unfortunately it also leaves me with zero suggestions about how to approach actually fixing the issue. Unless you feel like just embracing the new family you're aquiring who know how to book a babysitter and are willing to be there to celebrate your relationship with you.", "NTA- Two words: door staff. Your mother will tell her the details. She's clearly determined to have these Exact Reasons Child-free Weddings Exist wreck your ceremony like she did the other one. I don't personally know why anyone thinks time with children under any circumstances is actively enjoyable in a way that would make people choose it, I didn't much enjoy being a kid, and I get joy neither from reliving it nor from seeing other poor wee souls trial and erroring their way through a confusing world. Under circumstances that would make any kid either bored or hyper, which lord knows if you asked the kid to choose between and 'spoiled into a coma by grandma' they'd be halfway to her house before you finished the words 'or come to the wedding', it's a hellscape for everyone. Including the kids!", "Just don't invite your famly. If you don't really see it as a family event, then don't invite your family. Just invite the smart and pretty and professonal colleagues and stuff.", "I think it's wrong to make your immediate family have to figure out childcare. Brothers and sisters should be able to bring their kids. Now cousins and further out can get sitters as it's not your immediate family.", "Hire security. At this rate one of your relatives might give out the location to your sister so she can party-crash to prove a point about kids and weddings. NTA", "She can't find a babysitter for an event that's a year away..\n\nNTA", "NTA. Send your parents and siblings ( minus the sister with kids who said she can’t come) invitations. Let everyone know you hope they come. Hire security to ensure sister who can’t find child care a year in advance doesn’t crash the wedding. \n\nI can’t believe your family is willing to die on this hill or the entitlement of your sister.", "NTA.  She's proven to ignore the no-child rule at other weddings, has already said she can't attend yours without them, so there's no reason to give her one. \n\nYou also need to tell her, and your parents,  that if she shows up with children she WILL be made to leave.  She will not be allowed to stay \n\nDedicate sometime at the wedding, though that will make her leave if she shows up. And, be prepared to call the police if she will not leave your private event to which she was not invited \n\nBoundaries are healthy.  Toxic people can't stand them, but stay firm.", "If your family doesn't want to come, let them sit home and sulk. Why would you waste an invite if they are telling you they won't come? Focus on yourself, your partner, and what will make you both the happiest. If your family can't get on board, leave them at the station and enjoy your life. NTA", "NTA. They’ve decided not to attend which is their right and you have the right not to invite them. \n\nBut don’t use “cost” as an excuse not to invite kids to the real ceremony then throwing a whole ass fake wedding after you get back from your honeymoon…who would want to go to this? Presumably all the parents of these children would have been at your real wedding? You want people to dress up and show up for you twice? That’s annoying. \n\nJust say you don’t want kids there. Kind of makes you look like an asshole to claim it’s about the “expense” when you’re throwing an extra party. \n\nJust be honest and own your choice.", "Why can’t their oldest watch the kids?  I was babysitting on a regular basis when I was that age.  The parents may not pull an all nighter but it would definitely be a solution and who invites someone else’s in laws to a wedding that you really don’t know?  Ntah. Sometimes people just look for a reason to be offended!", "NTA. There is no way your sister can say she is unable to find a babysitter this far in advance. She doesn’t want to get a babysitter, or pay for one. Too bad there is no footage of her kids behavior at the other wedding. She needs a good shaming in front of all of your relatives giving you grief.  Her kind of kids are 100% the reason child free weddings were invented.", "NTA. Send her the invite to the kiddie friendly wedding. For the adult only event, Hire security and don't be afraid to use them.", "My concern is she will know where the wedding is going to be and will she show up anyway? This is gonna be real sticky. If she can’t go she can’t go that’s not on you.\n\nThe way the family is being, I have a feeling they may try to sneak her and her kids in. Again this is why I hate big weddings even small ones too many hurt feelings. Don’t do a mock wedding what does that mean. Maybe do a nice Reception Somewhere where kids can go, but to go all of that effort for a mock wedding doesn’t even make sense.", "I agree with your husband, no invites for anyone in your family.  They will tell your sister when and where it is and she'll show up with her kids.  I would hire security, give them pictures of your parents, brother, sister and her family and if they show up have them removed.  NTA", "NTA for wanting a child-free wedding.  Send invitations out to all the family and those who choose not to come cannot later say \"well, we weren't invited\" because that will be held against you.  By issuing an invitation, non-attendance will be on them.  It might be worth having security to ensure guests who decide to ignore the \"no children\" request, and bring their kids anyway, will be turned away at the door.", "hard NTA", "It may save you peace of mind to hire a door person/security to disallow uninvited people entry to the wedding. Give them a picture of your sis.", "NTA. Can always send them an invitation with a handwritten note:  “So sorry you and husband can’t make it, but we totally understand that you can’t find anyone willing to watch the kids.”  Subtle snark.", "Unfortunately, OP may need to have some security to not allow kids into the venues. This puts a paid person to deal with the arguments and people who can not follow the rules. The friends and family can be relaxed and enjoy themselves and not stressing who might show up and cause a scene.", "Your sister already declined the invite, why does she need an invite if she’s not going? Definitely NTA, sister was invited but declined.", "NTA. She has a 13-year-old why can’t a 13-year-old babysit? I was babysitting other peoples kids when I was 12. She’s using this as an excuse not to come to your wedding. And based on her previous actions of bringing her kids to a wedding I wouldn’t give her that information either. But be prepared for the rest of your family to tell her where the wedding is and what time. You need to have security, or somebody you trust that will escort her out if she shows up uninvited with or without her kids. Because until she’s given consequences for showing up with her kids, nothing will change.", "NTA. The fact that she’s upset about not receiving an invite after already saying to you she can’t make it is telling because she knows she’s planning on showing up with the kids anyway. Good on you for thinking ahead!", "NTA  ... your wedding is about what you and your fiance want ... no one else ...you are giving plenty of notice that for that event they will need to find a sitter and confirmed the all age party compromise for after the honeymoon ... the fact that they seem certain despite a year's notice that they won't find a sitter implies they have no intention to look ... you are right to take them all at their word and kindly not send the invites ... because I'm not sure they can be trusted to stay away\n\nInvite people who will keep your day special and about what you and your fiance want ... not make it a drama based on their perceived entitlement ... above all enjoy your day and congratulations", "\"Last time she was invited to an adults only wedding, 2 years ago, she brought the her kids along (against the bride and grooms wishes) and they ended up screaming through the service and destroyed the cake.\"\n\nWhat is wrong with parents??\n\nNTA.", "NTA Ruined your wedding cake..WOW! That had to be absolutely terrible! The entitlement is real with your sister. I think it's absolutely wonderful you want to do a mock wedding when you get back from your honeymoon so the kids can be involved. I have seen it mentioned in this sub a few times and I think it's the perfect way to include the kids and not have to worry about ruining beautiful, formal decor and the food. Since your parents and other family are enabling this behaviour I would definitely not invite them. I know it will hurt as a family should all be included on such a special day, BUT, not if they are going to act so disrespectful to you and your hubby-to-be!", "I was questioning how she couldn’t find a sitter with a year’s time but I suppose this\n\n>  2 years ago, she brought the her kids along (against the bride and grooms wishes) and they ended up screaming through the service and destroyed the cake.\n\nmight answer that. Little hellions that no one is willing to take on?\n\nAlso, you mention this\n\n> Now my parents and brother are angry at me for not going to send her an invite (which will have the location (local) and time of the wedding) \n\nlike you’re concerned she’ll crash the wedding. I would definitely look into security or something if that’s the case because she might end up getting that information from someone else even if she doesn’t get an invite with it.", "Nta have security at your event she will probably try to crash it", "NTA. Why waste the invitation on someone who has said they aren't attending? \n\nThey ~~can't~~ won't get a sitter, even with 12 months' notice that it's a childfree event. She isn't trying because she has got away with it before, then allowed her kids who was 5-11 at the time and old enough to know to sit quietly and not touch the cake, to disrupt the ceremony AND destroy said cake. \n\nTell them they'll be missed at the main event, but you look forward to seeing them at the kiddie wedding.", "\"I've done everything right and want to do something that the other person agrees with. It's a decision backed up by outrageous behavior by the other person. AITA?\"", "NTA.  My opinion is to send invitations to all of them and let them figure out what they want to do at that time.", "Take the high road. Send invitations anyway. One of three things will happen:\n\n* They decline\n* They accept and come without kids\n* They accepy and come with kids, in which case you need to assign someone to play bouncer and make them leave", "Nta- your fiancé is right don’t send the invites to your family because they will just bring your sister and make a scene if you kick her out.", "I would send everybody invitations, properly  addressed to just the adults.\n\nI would hire someone to be “security” To not allow your sister with the kids if they come\n\n“ mom, I can invite her, but she still can’t bring the kids because they’re not well behaved.  If that makes you not wanna come to the wedding, that’s your decision.”", "NTA\n\nbut someone will tell her location of wedding, so not sending invite won't prevent that.\n\nBest you can do is have security/bouncer to BOUNCE her A$$ if she shows up with kids.\n\nSorry that your parents are showing a clear preference for your sister.  Don't put up with that sh\\*t.  Be firm, say sorry that you can't make it and enjoy choose two new people from your \"b\" list LOL", "NTA\n\nBa Ba Black sheep. Obviously your sister is the golden child. None of it makes sense. They can’t find a sitter with a years notice? That’s complete bullshit. \n\nEnjoy your wedding, and if these people don’t come, that’s fine. I suggest some strong security though.", "NTA. Your wedding is not a 'family vote' event.  Their track record of behavior caused them to be struck from the guest list.  Enjoy a peaceful, quiet, romantic wedding filled with those who know how to behave.", "You may want to consider having a friend or other relative stand guard at the door in case she shows up with the kids and not let them in.", "NTA and save the price of the postage on sending invites to your parents & brother and put it towards your day. \n\nI'm betting this isn't the first time that your sister's wants have been put before yours but I'd certainly make sure it's the last time, do not let your family emotionally blackmail you, your sister had her day, this one is about you and your fiancé.", "Invites go out about 4 months before the date, so you don't have to think about this right now. Your sister doesn't care that this isn't her event and she doesn't get to choose the guests, especially after ruining someone else's wedding in the past. Your family is trying to pressure you into submission. Just ignore it. If they choose not to attend, fine. But this is a ridiculous overstep and they're 100% wrong. A year's notice is more than enough for anyone who WANTED to support you to find a sitter. For someone who doesn't? No amount of time is enough to plan to not get what she wants. You've seen how she lets her kids act. Don't back down. Stop discussing it. \n\nNTA.", "NTA especially for the fact that your sister has shown up with kids in tow and they ruined someone else’s wedding! What the hell is wrong with her?!\n\nAnd if your family is siding with your sister and threatening not to come, which is very manipulative, then I wouldn’t send them one either! \n\nGood luck!", "She can't find a babysitter with a years notice? What she means is she refuses to. \n\nSave money on invites; don't send them out to her or your family and make sure the venue know not to admit anyone not on the list.", "Nta do you have someone on your husbands side that’s big that can act like security and throw them out if they show up with their kids?", "NTA\n\nDid your sister say why she won't be able to get a babysitter? That just seems so strange to me. It sounds like her in-laws already babysit on a regular basis. It seems like she is refusing to go out of spite. Also, why are your parents and brother not attending? Why would they be angry at you because she declined the invitation? It sounds like your relatives are all behaving so irrationally. I have no idea how you deal with that.", "NTA", "Am I reading this wrong or did you invite the sister verbally, get her RSVP verbally, and somehow this is still causing drama? NTA.", "Your wedding means your rules...  If your sister refuses to make a minor adjustment by finding a sitter for one day it's kinda sad on her part.  Congratulations on your upcoming wedding and I hope it's absolutely beautiful for you!  NTA.", "Nta.  \n\nGet a bouncer/security.  She will crash this wedding.", "NTA but hire security to send them away (calling the police if necessary ) if they show up. Then you could send the invitations telli them they will be thrown out if they come with kids. Or you book an adult only venue and let them deal with the ah", "NTA. Sister told you she wouldn’t go which sounds pretty firm. Your family is being weird by saying she should still get an invite for whatever reason.", "NTA\n\nAnd your husband is correct, if you send your family invites they are sure to tell your sister when and where. If you really want them there, you are going to have to talk it out and let them know that no matter what, kids are not allowed. I'd go one further and beef up security at the venue (the cost of a bouncer would be less stressful than a bunch of disruptive kids.) The fact that they so quickly jumped on your sister's bandwagon doesn't give me much hope. I'm really sorry your sister is so clearly selfish and that your family are being idiots. I hope your wedding is awesome!! 🌻", "I would say you need to have some sort of security or something because I’m sure she’s gonna find a way to invite herself and her kids", "NTA, but I'd go ahead and send an invite.  Put hand-written notes in the ones that says \"as a reminder, the wedding is 18+ only.  I'd love for you to be at my wedding, but understand if you are unable to attend because of this rule.\"  And then hire security to deal with it if anyone shows up with children.", "NTA - but presumably people in your family have phones and talk to each other.  Not sending her an invitation isn't going to prevent her from knowing where the venue is.", "NTA, your sister already declined the invitation.  Period.  SHE is choosing not to attend,  even though she has options to have her children minded,  she's just pushing her will on others. \n\nWhen she has her next wedding, she can decide if kids can be invited. \n\nStay rational, kids don't need to be at every event, especially ones that don't know how to behave.", "NTA. They're going to help her wreck your wedding.", "They have expressed they will not attend. What's the point of sending an invite and receiving a declined response? NTA", "NTA Invitations cost money and she already said she isn't coming. Your family is definitely going to tell her where it is and she's definitely going to show up with her kids so you are going to need security and a plan of action.", "NTA.  Tell everyone that you will be happy to send them an invite but no children are invited and if anyone shows up with children, they will be turned away.  No exceptions.  Make sure they know 100% of children will not be allowed to stay.", "Looks like you have 4 fewer invitations to send out and 4 fewer dinner plates to provide. This should save you money or give you an opportunity to invite good people instead. I'm on your fiance's side. NTA. Have you considered just blocking them for the time being?", " *Last time she was invited to an adults only wedding, 2 years ago, she brought the her kids along (against the bride and grooms wishes) and they ended up screaming through the service and destroyed the cake.* \n\n**This person has** ***already*** **ignored a similar invitation, and let her kids scream and destroy things at that wedding.**  Why in the world wouldn't you protect your wedding from her doing the same thing?  \n\nI'd make place in your wedding budget to hire security, and give all the security people this sister's photo, so they can keep her and her kids out.  And to check the doors for other relatives trying to let them in.  \n\n*Now my parents and brother are angry at me for not going to send her an invite (which will have the location (local) and time of the wedding) and are refusing to attend also.*\n\nOkay.  \"Sorry to hear that.  We will miss you.\"  is all you need to say to them.  Don't chase them.  Don't beg.  **They are trying to make you give in** and let your sister destroy your wedding, too.  It's wise of you, to not give your sister the time and day to something that she's already said she won't attend.  \n\n**NTA.  Protecting yourself from relatives that have horrid behavior isn't wrong.**  It's protecting yourself.", "Cut them all out. She's used to getting her way isn't she? She's the flying money in this scenario and everyone is mad at you for not acquiescing to her like everyone else does. Read up https://www.reddit.com/r/raisedbynarcissists/comments/77w8lf/dont_rock_the_boat/", "Is your family angry your not sending her an invitation or that the wedding is kid free?  You should send them invitations but make it clear it's kid free,  they can choose to come or not.  (Make it clear that children will not be allowed to enter the venue or wedding site.)  It sounds like you are refusing to invite her after what she said and that's why your family is upset.", "She might find out where it is so my guess is you should probably hire some kind of security so she can’t get through the door with her kids.", "The frequency and insanity of these wedding drama posts on this sub makes me wonder why more people don't elope...", "What gets me is her saying that she won't be able to find a babysitter *with a year's notice*.", "Every single wedding I've been to that had kids had a toddler or baby screaming or crying over the vows. Every goddamn time. The people who can't stand to leave their precious dumplings with a babysitter for a night are also the same exact people that don't make any attempt to quiet or remove a loud child.", "Not on the same scale as a wedding, but a mom I knew used to bring all five of her kids to birthday parties when one was invited. Her kids stopped getting invitations because of that.", "My kid was invited by name to an elegant wedding at a fancy venue. I had already secured somewhere for him to spend the night and everything, but he saw the invite and it was game on. Little dude rocked his fancy clothes, behaved himself, and had an absolute blast. No screaming or cake destruction. He thought the food was terrible (he wasn't wrong) so we hit up a late night spot on the way home. \n\nAn elegant evening can absolutely be a place for children. Where else are they supposed to learn about elegant evenings? \n\nIll behaved children aren't that way because all children suck, most of the time (neurodivergence aside) it's because their parents suck. \n\nThat being said, whoever pays for the wedding decides who attends the wedding. Done and done. NTA.", "OP NTA your family is delusional", "It depends on the families and the kids.  We've always had kids at my family's weddings and there have never been any problems.  We have plenty of fancy weddings too.  Everyone keeps an eye on their own kids.  If a baby starts fussing, they take them outside, it's really not that big of a deal.  I'm not saying child free weddings are wrong, everyone should just do what they want for their wedding, but it's a little silly to go in the other direction and claim that children just don't belong at weddings.  A lot of people view weddings as a family affair.", "na the barn is for religous ppl only, well or more their worship targets", "Also, TORTURE on the kids", "This. I bet if she sends the parents and brother the invitation with address sister will show up, kids in tow.", "Not to mention that one informs the caterer exactly how many people need to be fed, and the cost of the meal is based on that number.  \n\n\nThe sister bringing a few extra humans means that there is no food for them, and how do you think she would react to that?", "Her kids are so badly behaved that they've already ruined one wedding, and very likely are used to flouting anyone trying to corral them (are they homeschooled? Because otherwise I'm scared for their teachers)..I'm guessing no babysitter in their entire state would be willing to sit for them.", "Hire security and give sis the warning that if she brings her kids, they will be escorted off the property. Tell your other family members that you have offered an invitation to sis and BIL, but not the kids, and you will have security to enforce it. They cannot claim that she would never violate your boundary, and then get mad when you don't allow her to when she does just that. Actually they can, and probably will, get mad at you when you kick the kids (that they said would not be brought) and their entitled parents out. If they too choose to make a scene, security can escort them out too. NTA", "They made the kids.  They get to figure out childcare for occasions that are kid free.  Or stay home.  Sick of parents whining.", "Depends on where they are.in my state you have to be 14", "If her sister's kids are so badly behaved screamed throughout a wedding and ruined the cake two years ago when their age range was 5-11, I certainly wouldn't be interested in babysitting them.", "And knowing she has active in laws!!!", "Why would she expect her in-laws to be invited? It's like she thinks this wedding is all about her rather than and your fiance.", "do it. it couldn't hurt.", "It’s pretty clear his sister is not a great parent.", "I have to agree (my first big wedding was when I was four. All my uncles danced with me - and the bride and groom did too - and I got my first taste of caviar. The older kids - 12 to 15 ish - sat with the younger kids and rode herd on us so we didn't misbehave too much, and my mom made me the prettiest dress I've ever owned).  \n\n\nBut it's the B&G's day - if they don't want children there, guests need to shut up and respect that, and make arrangements for their kids. They aren't paying for this event and catering is a cost-per-person deal.", "My brother had a handfasting. The priest formed the blessing circle outside and spotted several worried mums were trying to surreptiously control their very young kids. So, he told all of us that a wedding is a time for freeing yourselves to embrace the joy of celebration, that we were outside, in the sun and on the grass, and to not worry if children want to run around and be children. Relaxed parents make for relaxed kids. He was right. The parents relaxed and so did the kids.  \n\nAs he was walking round the circle to bless it, one little toddler suddenly bolted out of the circle and started following him; it was the child of the most worried mother that had triggered the priest's speech. The priest stopped dead, crouched down to the kid's level, explained to the kid in simple terms what he was doing and asked him if he'd like to help by holding the Very Important Water Vessel. The toddler was thrilled and helped him out with biggest shit-eating grin on his face. His parents got some unexpected great photos that they show off with enormous pride to this day (the kid is now 14 and super embarrassed that his parents won't stop telling everyone).\n\nMy SIL also did one great thing for the kids, too... the (very elegant) venue banned confetti, so everyone was handed their own little bottle of bubble water to blow instead of throwing confetti. I think the adults loved the bubbles even more than the kids did!\n\nEither way, OP is NTA. His wedding, his rules, and his detractors are tools.", "One of the main reasons for having child-free weddings is the parents who suck at raising their kids.", "My son was also a saint when it came to behaving in public, but I also know he was an exception to the rule and he was just 1 kid.  Sister needs to obey the rules.", "Not a wedding, but the golden anniversary (50 years) of my parents.   \nThere were kids invited - my sister's teenage daughter, my brother's and mine daughters (both ca 6-7 yo) and my youngest sister's son (ca 5 then).   \nAll three of the younger kids were super nice and good behaving. They were eating, dancing with our parents and other family members, sometimes were playing together downstairs in the reception hall or upstairs in our hotel room (there was the whole small hotel rented by my parents for the ocassion, with the bar in a separate room, reception hall and rooms upstairs). No issues at all with them.   \nBut I agree, that's up to hosts to decide if they want kids on their reception or not.", "Don't ya know there's a 16 month waiting list for babysitters? /s", "Seriously, hire security and give them pictures of your sister.", "To be fair, there are always leftover meals at weddings. People cancel at the last minute all the time and the food has already been charged to the happy couple. Still, that's no reason to ignore the bride and groom's wishes.", "That would look good in the wedding photos, a load of security guards. And a great use of funds. Spend money on extra flowers or extra security guards. Seriously?\n\nThere is a far less confrontational approach through adult dialogue", "NTA.\n\nYour plan for a child-friendly post-wedding party is one of the nicest things I've ever heard of - and it's actually something I've never heard of. It's wonderful of  you to think of the kids. If that's not good enough for your sister, then it's clearly a power play.\n\nI've known people who refuse to go anywhere without their children; this doesn't appear to be the case since your sister has her in-laws babysit. Her excuse is ridiculously transparent. She really doesn't like to be told to abide by others'rules, does she?\n\nWhen I was growing up, absolutely no children ever went to a wedding. We'd be so excited whenever my parents went to one. We imagined a Cinderella-like ball and looked forward to the wedding cake my mom would bring home for us. How fun it would have been to attend an event like the one you're planning for the kids.\n\nYou sound like an outstanding individual.", "Well if the wedding is a year out she /him should be ok by then.  I know laws change and I’m 53 now so that was years ago, but l can’t imagine not being able to find a sitter a year away and expect someone to host a wedding with your kids already having behaved badly at a previous one.", "We were invited to a wedding when my son was 2 and a half. We had to travel for the wedding and stay in hotels so no chance we could leave the little one that long. With the age of him I didn’t like the thought of leaving him. We’d have happily just arranged my husband to go alone if it had been childfree but no they added my son onto the invite. He may have only been young but he knew manners. We took quiet things to keep him occupied in the church and he knew to sit quietly. So he was happy and loved the camera and took some of his own photos, usually cropping the heads. At the reception everyone loved him as he sat at the table and ate when supposed to and danced happily when it was time for everyone to join. We got lots of comments how great he was being and even the bride and groom said he added to the day.   \nIt comes down to respecting the bride and groom, if my child wasn’t well behaved I wouldn’t have taken him nor expected anyone else to have their time ruined. If they did not want children then I would have accepted that. It was on me as the parent to ensure I had things to entertain my son and snacks to keep his hunger sorted until the late wedding meal.   \nIt comes down to it being the bride and grooms day and what they want is all that’s important. Saying a year isn’t enough to find a baby sitter is ridiculous and shows her entitlement.   \nHeck I went to a family members hen night when I had a 9month old. It was being held in a big suit in a hotel, multiple rooms off of one sitting room specifically for the hen night party. As I was breast feeding my husband came with the baby and we had rented a separate room away from them. He happily watched the baby who went to sleep early and watched films all night. When the baby was due to be feed I’d quietly leave to their room and feed the baby. No one at the party was interrupted and I had already checked before hand that the bride didn't mind me slipping away when needed. There is ways of of attending things even without hiring a babysitter.", "I don't know...have you read very many AITA posts?  \n\n\nI mean, I've only been on here for about 6 months and this is about the 25th time I've seen this exact scenario, and then there are the 100+ posts about the family member who turned up with their entire family after being warned repeatedly \"no kids\".", "Adult dialogue only works when everyone is behaving like an adult. \n\nSister has priors. She’s already brought the kids to a wedding to which they were not invited, and allowed them to disrupt the event. At this point it’s pretty much a given that invitation or no, she WILL crash the event, and bring her children along for the ride. \n\nI think security is pretty much mandatory at this point.", "I think she just doesn’t want to go. And wanted to start drama, I could find a babysitter in a month", "NTA - we had a perfectly lovely wedding without my MIL who didn't condone same-sex marriages.  Drama free.  MIL once joked that not coming was her wedding gift to us.  We'd been making that joke for years.  Stick to your guns and have a lovely drama free wedding!\n\nETA - about 10 years into our 21 year marriage my MIL said \"I was wrong, (wife) picked the best spouse.\"  Everyone else is divorced, we are still going strong.", "Ahhh, that explains it. She (and possibly your brother) are the Golden Child/ren.\n\nSorry they're treating you that way, OP. But please stay strong and call their bluff. IE - Don't send any of them invites.\n\nI hope your in-laws are awesome. They can hopefully be the family you deserve.", "Stay firm.  Boundaries are healthy, even if people that like to trample on them throw fits", "They don't seem to like you. You don't have to cater to them. People who don't really care for you aren't the best to have at a wedding or in your life in general.", "Sorry that your parents choice in religion has caused them to treat you like that. Just know you are not in the wrong.", "OP don’t let them ruin YOUR DAY. Glad you have a supportive partner and other friends and family who will show up for you.", "Well then, it honestly sounds like you're better off with them not coming.", "Hire security. NTA", "Security is absurd. That's escalating the situation. This is the sort of thing that needs a sensible family dialogue. Security will just heighten tension and not solve anything unless are suggesting a massive exclusion zone around the venue? Because that's what you'd need if you are seriously suggesting someone would crash the event. \n\nLife isnt the same as TV soap opera.", "Right", "Success is the best revenge", "What about this woman’s behaviour sounds reasonable to you?\n\nWe’re not talking a SWAT operation here. You could have 1 or 2 people positioned discreetly by the door to the venue acting as security, whether professionally hired or friends roped into the role.", "A couple of discreet people isn't going to stop a scene. So it's pointless. \n\nSomeone intent on scene could easily make one in that situation. \n\nSo you'd spend the money, create the tension and solve nothing", "Yes, but the scene could be contained outside the venue, and hopefully not disrupt the event itself. In fact this is where professional security is preferable, as they can provide people who are skilled in de escalation.", "You dont descalate on the day. You do it now, and save wasting money on security", "Neither of us know this woman. My take on OP’s post and comments are that OP’s sister will not listen to reason, will insist on attending with her children regardless of how many discussions take place prior to the event, and will cause as much disruption as possible because she feels entitled to do so. \n\nOnly OP can determine whether that’s accurate.", "I was a single mom of 3 with almost no support and got invited to and went to dozens of kid free events-It was nice, but your family isn't. They are entitled asses who don't even really deserve to be at your special day. I cant believe how  they are acting over something so understandable. No excuse for their awful behavior. I hope they all apologize to you and attend the wedding. NTA", "YTA if you don’t send invitations to your family, after you sent them a “save the date” card. You asked them to save the date because you intended to invite them. All jawboning thereafter aside, a written invitation is expected, and a clear instruction that it is an adults-only event puts it in writing and on record what the invitation is. This way you can say you did your best; they can and should RSVP that they will not attend if that’s their response.\n\nI’m not sure what the point is in not sending them an invitation.  Do you think that would keep your family from finding out the where and when?  Because they are going to find out. Invite the adults but make it clear that children are not invited. If anyone says they won’t attend - for any reason or no reason- the only response necessary is “Sorry you can’t attend; we will miss you.”  A response of “we will attend but only with our children” should be met with “Sorry you will not attend.” Also make it clear that anyone attempting to attend with children in tow will be turned away. \n\nHere’s where the couple getting married and having a wedding reception often screw up. They don’t know the purpose of a wedding party, or they simply assume those who have accepted a position in the wedding know their job.  Most do not, and need to be instructed. They are there to protect the bride and groom, and make sure problems and troublemakers are dealt with quickly and efficiently, with as little disruption of the affair as possible. This ranges from making sure the bride’s lipstick is camera-ready, to cutting off drunks and throwing out party crashers. Being best man; groomsman; maid of honor; bridesmaids; ushers at the church, etc., - it’s more than an honor; it’s a job. If the affair is “adults only,” the bridal party needs to enforce that (with the assistance of the authorities, if necessary).", "NTA.  And I'm just trying to imagine how anyone could actually say \"there's no way I can find a babysitter for my kids even with a year's notice\" with a straight face!!  What the hell is wrong w/your family??  LOL!", "It’s your wedding so you need to have it as you wish so first NTA. But I don’t understand child free weddings. I went to countless weddings as a kid and there was never a problem. I do come from the Balkans so for us having a childfree is unheard of and I would never have one myself as I believe that kids make the wedding. But the amount of weddings that people went to where kids make issues is confusing me as I’ve never seen it happen (even as an adult).", "NTA\n\n&#x200B;\n\nBut you should send them an invitation, and hire security to turn away anybody showing up with kids.", ">My partner supports me but thinks I should not send out invitations to either my sister, my parents as well my brother.\n\nI think that's the most sober decision. If your family cannot notice the problem here and they don't want to come, just do the wedding you dream of, not a babysit night ruined for you and your future spouse. \n\nIf they have ruined weddings before because of their kids, their inability to control kids is their own fault. If your sister cannot make an effort for you, why should you make an effort for her?", "Anyone who has told you they won't be coming to your wedding does not need an invite sent to them \n\nInvites are sent to find out if they will or will not be attending --  you know the answer,  you don't need to send an invite\n\nYour family are using blackmail and I agree with your husband to not send an invite to them. No need, they already told you they won't come.  Glad your husband has your back and is protecting you. \n\nAt the time your sister's children were 5 to 11 years old.  Old enough to know not to touch a cake, let alone a wedding cake,  and yet they did and destroyed it. That's on your sister and you have every right to keep those kids away from your wedding day. \n\nSeems like they will probably show up anyway. Hire 2 people to act as bouncers and bar children from the event for however many hours it will last.  It will be worth the peace of mind and it'll be stress-free. \n\nStart a you intend to go regarding your family.  You and your fiance are a family,  that's your core family. Everyone else are extended family. You bend on this and they'll continue to walk over you. \n\nHave a wonderful marriage.\n\nNTA", "Not sending her an invite to avoid her knowing where it is and prevent her showing up with the kids...wont work. Do you really think nobody is going to tell her where and when your wedding is?", "NTA", "Nta, the sister cant find a babysitter because she chooses not to. But...seriously? Yes a toddler screams during a wedding, but...they are screaming or laughing or judging you all the time. And i cant imagine a kid actually destroying the wedding cake. Your fiance is right. Dont invite any of them. Literally they are just enabling the sister.", "NTA - Also why is it the people with the \"problem\" kids that want to bring them to an event that they are not wanted at?", "NTA   I love how the sister knows she won't be able to find a babysitter in a full year.", "NTA.  No is no.  So she simply doesn't attend.", "You can always mention the venue will have security to make absolutely sure minors cannot get in. (Even if it is a lie. Maybe just ask a few friends to make sure she cannot slip in.)", "Wait, this woman can't find a babysitter for something that's A YEAR away? Nonsense, she wants it her way or nothing. Don't invite her. If your family starts giving you grief, tell them she will be invited only if she's willing to pay for the entire dinner. She's trying to make her problems your problem, which is ridiculous.", "It seems your sister is the entitled golden child. It’s ok to have a child- free wedding.  It’s even better to give a years notice. She doesn’t want to come so why waste the paper? Your family can all just RSVP no if they want. Just send invites as a formality.  I hope your in-laws are cool and you get to go L C with your family.  They are disrespectful and obviously have a favorite.. you deserve an amazing wedding and a positive happy life.", ">What do you think a wedding is exactly? You are joining your families,\n\nIt's funny the common script for a civil wedding ceremony in my country is \n\n\"Marriage in this country is the union of two **people,** voluntarily entered into for life, to the exclusions of all others.\" \n\nNotice it says people not families", "I was thinking if I invited one couple's kids, then I would have to invite them all as my partner and I are god parents to a lot of our friends kids. In total there's over 30 kids (from close friends and family) that we would have to invite. My partner and I are the ones paying for this wedding. Family isn't chipping in at all. And yes it is cheaper to have a second \"wedding\" (which is what they do in my culture) when we get back from the honeymoon. Although we are pushing the date out a few extra months. People don't have to get dressed up unless they want to. The only ones who would dress up is my partner and myself. The second wedding will be held in my back yard like any kids birthday. And no they aren't expected to bring any presents.", "NTA \nDon’t allow your entitled family manipulate or gaslight you into inviting your sister and her kids. \nYour wedding your rules. \nDon’t be a doormat. \nUninvite anyone that threats to not attend. \nCongratulations 🎊🍾🎉🎈 \n\nNTA", "I agree that some children can be a joy - I would have loved to have your son at my wedding.  We went childfree for two reasons\n\n1. cost, by the time I was married, I already had 10 nieces and nephews and we were having a very small wedding - we only had 30 people total at our wedding so we couldn't afford adding 10 children as well\n2. 4 of those 10 children just didn't listen - they were like OP's nieces and nephews, they were loud, run around, spill, get into everything and would definitely have ruined the cake and probably have managed to get it and whatever they were drinking on my dress\n\nSometimes you have to go childfree at your wedding because some of your siblings are simply bad parents, smh\n\nOn the other hand, I had the wedding of my dreams and all the parents had a peaceful, relaxing night off.  None of them complained about getting babysitters, lol", "Right?!? I still remember the fit my younger brother threw the first time I remember eating at a sit down waitress comes to the table restaurant. Now to be fair it was Sunday after church and they were slammed, but he was so horrible waiting for the food to arrive, then and there at the age of about 11 I decided I was going to introduce my kids to something other than fast food while they were little so as not to repeat that scene!", "MelodramaticMouse is right hire security but also give them photos of your parents and brother so they'll be unable to open a side door and let them in.", "Take the money you’ll save from the cost of feeding them (which is a lot, depending on the caterer), and hire security for your wedding. Congratulations and enjoy!", "> My brother had a handfasting.\n\nhello what is this? what's a handfasting?", "Yeah, it sounds like the child-free decision was because of how the sister's kids behaved at the prior wedding.", "Also your cousins were decently well-behaved. Her sister has already proved that hers are a menace screaming through the wedding and taking the cake previously. That’s when a parent steps in and prevents the kid from running for the cake and takes them outside to scream to their hearts content without bothering anyone", "This is how all of my dad’s family weddings worked. Including when the adults at one uncle’s wedding were starting to get a little more drunk and outrageous than we, the teens, were comfortable with, we all bailed to the hotel across the street and set up the littler kids in one room with a movie while the older kids were in another room with our own movie and took turns checking in the kids till the parents came in a few hours later.", "I still remember the two kids (around 7 or 8) who tried to jump on the trailing back of my dress to rip it off. They failed because the back was way longer than it looked, I had the excess folded and held with a few points. So the thread broke but not the dress. Thank goodness. I was furious, the mom had barely glanced at what her sons were doing.", "Time to stand up for yourself.\n\nThere's no need for further conversation with your parents and siblings regarding this topic. \n\nDoes having a relationship add any value to your life?  Or is it that is just become a habit?  Habits can be broken you know.\n\nYour fiance is your family now. He comes first.", "Plus the wedding is next year. Yet sister is saying \"we can't get a babysitter\"? She doesn't WANT to get a babysitter. \n\nEven without how they all acted at the last wedding they crashed, this \"can't find a babysitter in a year\" act is BS.", "Give them sisters picture to kick out wholesale or the more *questionable idea* - let her stay if she's alone, but tell security, \"if she has any kids with her, she's gone\"\n\nId personally go with the former all around.", "I mean, if her kids are as bad as they sound, the family could be basically blacklisted for childcare services...", "A lot of venues to have their own security already, it’s really not that absurd and makes it so the guests and guests of honor don’t have to deal with it. OP can stay on the dance floor while her idiot sister is dealt with by professionals since she can’t listen to logic ahead of time."]}