{"id": 29867, "submission_id": "17inwzd", "title": "AITA for demanding money from my uncle for using up my cosmetics?", "selftext": "My dad’s brother has been staying with us for a while. We went on a family holiday over the half term and stayed in a 1 bathroom cottage.\n\nI have a makeup cleansing balm that’s pretty pricey for me but it’s really good for my skin. I use it sparingly because of the cost. It was about 3/4 full when we left home which should’ve lasted ages.\n\nI was on the sofa bed so parents told me to leave my toiletries in the bathroom and my clothes in my hand luggage between the sofa and the wall. \n\nNobody was meant to use my stuff.\n\n2 days into the stay (Day 1 I didn’t wear makeup) I realised that the balm was nearly gone! You could actually see most of the base of the tub!! There was just a bit left at the sides!\n\nI went and asked everyone and it turns out that my uncle used it because it “felt like a nice moisturiser” according to him. I asked him to pay me back and when I told him the price he straight up laughed at me and now my dad is even telling me I’m being greedy and I shouldn’t have left stuff in a shared bathroom! AITA?", "created_utc": 1698529444, "permalink": "/r/AmItheAsshole/comments/17inwzd/aita_for_demanding_money_from_my_uncle_for_using/", "score": 36, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Asked my uncle to repay me for an expensive cleanser he finished\n\n2. He’s saying I’m an AH because he didn’t know how expensive it was and I left it in a common space so I should’ve picked it away if I didn’t want it touched\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA-If you leave your toothbrush in a shared bathroom it doesn’t mean it’s free for anyone else to use. It’s the same with your cleaner.", "He knew it wasn't his, so it hardly matters what it costs. He knew he was stealing from somebody, after all. And tell your dad if he thinks its fine for someone to abuse your trust - your dad can pay you back. \n\nNTA. WTH? He just used up your stuff and thinks its OK to never once have asked? What an a hole!", "Nta send him a venmo request", "NTA. As a grown adult your uncles should have known not to use something that wasn't his without asking. And your dad is a bit of an AH himself for not backing you up.", "NTA", "NTA. People shouldn't use others' things without permission. He's an adult and should know that. He can and should replace it accordingly.", "NTA. It wasn't his to use.", "NTA. You were told to leave your toiletries in the bathroom. He is a grown ass man who knows that wasn’t his. He’s an AH and should replace the item.", "NTA. No one should be using someone else’s cosmetics. If only for health reasons. \n\nIf you were told to leave your cosmetics in the bathroom, you had and expectation they would be left alone.", "NTA. It was your stuff. He owes you for it.", "NTA. If it’s not yours, don’t use it. It’s not hard. Get that money, OP. You deserve to be reimbursed.", "I have used shared bathrooms a lot in my life, but it never occurred to me to use someone else’s products.  NTA - but don’t leave anything out in the future.  Thieves life there I fear.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy dad’s brother has been staying with us for a while. We went on a family holiday over the half term and stayed in a 1 bathroom cottage.\n\nI have a makeup cleansing balm that’s pretty pricey for me but it’s really good for my skin. I use it sparingly because of the cost. It was about 3/4 full when we left home which should’ve lasted ages.\n\nI was on the sofa bed so parents told me to leave my toiletries in the bathroom and my clothes in my hand luggage between the sofa and the wall. \n\nNobody was meant to use my stuff.\n\n2 days into the stay (Day 1 I didn’t wear makeup) I realised that the balm was nearly gone! You could actually see most of the base of the tub!! There was just a bit left at the sides!\n\nI went and asked everyone and it turns out that my uncle used it because it “felt like a nice moisturiser” according to him. I asked him to pay me back and when I told him the price he straight up laughed at me and now my dad is even telling me I’m being greedy and I shouldn’t have left stuff in a shared bathroom! AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA  Your uncle should understand concepts like \"Don't use other people's stuff without their permission\" and \"If you do so, pay to replace what you used.\"", "Piggybacking the top comment to add- OP was **TOLD** to leave her toiletries in the bathroom. This doubles her reasonable expectation that no one would use her cleansing balm- any more than her toothbrush.\n\nIf OP's thieving uncle isn't adult enough to pay her back, then the parents who set up the situation where thieving uncle could help himself should repay her.\n\nNTA", "I so agree. I've had other women ask me to loan them a tampon. Personal item for personal use. And no one would just assume you wouldn't miss it. That's why they ask and don't just take your stuff.", "I would take one shoe from each pair he brought with him without saying a word. You can have your shoes back when I get my money. Or consider your account paid in full and I'll just throw your crap out and go on about my business. \n\nBut, I'm not nice when people treat me poorly. sigh."]}