{"id": 29878, "submission_id": "17iujdy", "title": "AITA for moving away knowing I’m my cousins only form of transportation?", "selftext": "For starters me and my cousin are the same exact age. We currently work together due to me getting her a job. She does not have her own vehicle and solely relies on me to get back and forth to work. We make the same amount of money at my job so her not being able to afford a vehicle is not the issue she just chooses to waste her money. My dad and stepmom offered to let me move in with them and my stepmom offered me a great job that will really help with my future career that I am in school working on. My dad lives 2 and a half hours away so that means my cousin would have to find her own way to work and my friends who I have discussed this situation with have suggested Uber and or buses for her to get to work but Uber would be super expensive (we work 40/45 mins away) and there is no buses around where we live and work. When I brought up the situation of me moving my whole family is calling me inconsiderate for “not giving her a chance to find a vehicle” although she has had MONTHS to do so. Pretty much my whole family is trying to make me feel bad because then she is going to have to quit her job. She has had as many chances as I have if not more to have a vehicle. AITA??", "created_utc": 1698550908, "permalink": "/r/AmItheAsshole/comments/17iujdy/aita_for_moving_away_knowing_im_my_cousins_only/", "score": 42, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole because I’m only giving her a few weeks notice but at the same time like I said In the post she has been working for months. She has no other bills besides her $200 rent and $80 phone bill. We make almost $3000 a month.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA The whole point of growing up is to learn and grow, not to taxi our cousins to work. You are doing all the right things. She planned to fail by not saving for a car. This is not your responsibility. She’ll have to get a loan, buy a car and pay the loan payment. This is quite common. I’m surprised that you do not have banks or no one in your family has heard of car loans. You must live in a very, very rural area. 😜", "At some point we all have to prioritize our own needs and manage ourselves. So, NTA. You aren't moving forward with your life to spite your cousin. You are simply moving forward in spite of her needs. Not the same thing and nothing to worry yourself about. She will figure out a management plan for herself. She has to now. Its unfortunate to be without resources and hampered by need. But, it does happen to lots of good people and we all just have to figure it out for ourselves.", "What the fuck is the matter with your family?  Unless this person came from your own loins, you can't possibly be responsible for their future.  Your cousin will be better off in the long run without you giving her such a crutch.", "NTA your cousin is a freeloader.  They’re expecting you to put your whole life on hold and miss opportunities to look after and baby another person your age who’s perfectly capable of organising transport or getting a car etc (you did it!!). Did cousin even pay you for your time or transportation to and from work?\n\nThe reason why people are calling you names is because THEY don’t want to help her, they’d rather be nasty to you and get you to do the work then get off their own backsides and help cousin.  If someone asks… turn it around on them… why aren’t THEY willingly to help.  You’ve done your time, how about THEY step up.\n\nCousin isn’t your problem.  Cousin isn’t your responsibility.\n\nYour whole family is showing you who they truely are.  Believe them.", "You do what’s best for you, if the family is so concerned about cousin well they can help her out.", "NTA. You aren't married to her, and you have no special obligation to her. Live your own life and do what's best for you.\n\nIt's been convenient for her to ride with you, but it has never been your obligation to be a long-term chauffeur for her.\n\nTwo week's notice is ample for her to make other arrangements, possibly with some of the family that's been giving you a hard time.", "NTA ... cousin has to make her own choices. You get to make yours. Her procrastination is not your problem to solve.", "NTA. You need to live life for *you,* and not for the convenience of others. If your family thinks cousin having a ride is so important, they can start being her taxi. When you put in your notice, also give cousin a 1 week notice. She is an employed adult; she can put those \"problem solving\" skills on her resume to good use.", "NTA\n\nEven if you didn't give her so much time to get her own vehicle, you're not her mom, it's not your business and you most certainly don't need to plan your life around her, if she can't keep the job, well too bad, she better start looking for another one then, it was already nice enough of you to help her get this one.\nYour family are being entitled, and you need to put your foot down, because they will keep taking advantage of you if you don't make it clear that non of them has any say in your life choices, and that you will always prioritizing your needs over making there lifes easier.", "Why is it the families of folks in OP's situation, or people who expect someone to share their inheritance or insist that someone tolerate a toxic relative at their wedding- why do these families ALWAYS gang up on the person and side with the toxic/greedy/lazy one making demands??!!", "NTA not your monkeys, not your circus", "NTA. You can buy a car in an afternoon. It doesn't take months of prep. You aren't responsible for providing transportation for your cousin for the rest of your life.", "NTA\n\n> (we work 40/45 mins away)\n\nFor the price of just a few Uber rides, she could buy an old motorcycle.", "OP it makes no sense why you are supposed to be responsible for other grown folks business when you have enough to worry about your own business.  If your other family members are so worried about taking care of your cousin's transportation needs, then they can deal with it instead of dumping on you and please put out either a mass text or a mass social message for all of them and leave it at that.  Just because she chooses to manifest that she'll be provided with transportation that won't cost her any money is her problem, not yours.", "NTA\n\nYou've been helping your cousin with rides, but she's had plenty of time to get her own vehicle. You shouldn't hold back your own career and future opportunities because of her choices. It's okay to focus on your own life.", "NTA. She sounds like a narcissist. It’s not your job to get her to work. She needs to figure out her own life.", "NTA\n\nThis is just part of being an adult and life. If my livelihood is dependent on someone else to get me around, that doesn't feel very sustainable.  It's on her if she doesn't want to fix that situation.", "NTA…why are you responsible for your cousin?  Where are her parents? Any siblings?   You do not owe anyone anything just because they cannot drive.  I assume they have had the same opportunities as you have.  Move and further your career.", "NTA. Your family is over reacting. You can get a car for nothing down in a weekend. It’d be nice if you took her to a dealership though.", "Info: how long did you give between moving and changing jobs?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor starters me and my cousin are the same exact age. We currently work together due to me getting her a job. She does not have her own vehicle and solely relies on me to get back and forth to work. We make the same amount of money at my job so her not being able to afford a vehicle is not the issue she just chooses to waste her money. My dad and stepmom offered to let me move in with them and my stepmom offered me a great job that will really help with my future career that I am in school working on. My dad lives 2 and a half hours away so that means my cousin would have to find her own way to work and my friends who I have discussed this situation with have suggested Uber and or buses for her to get to work but Uber would be super expensive (we work 40/45 mins away) and there is no buses around where we live and work. When I brought up the situation of me moving my whole family is calling me inconsiderate for “not giving her a chance to find a vehicle” although she has had MONTHS to do so. Pretty much my whole family is trying to make me feel bad because then she is going to have to quit her job. She has had as many chances as I have if not more to have a vehicle. AITA??\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA she's gotten very complacent using you.  Time to change that.", "How ridiculous. Of course you're NTA.", "NTA Who assigned you to be her designated driver? What about all the family thats making you feel bad, why cant they chauffeur her around. Just because she is your family does not mean her lack of a car your problem.", "NTA and not your problem!", "Nta", "I have a friend whose sister drove her daughter back and forth the entire time she was in COLLEGE. Then the niece graduates and my friend and her husband help with a down payment to BUY HER A HOUSE in the small town she stayed living in in PA. She finally got a license and her car. I mean, shit. My parents didnt drive me to my high school job at the movies, for crying out loud, must be nice to have a house that quickly. ANYWAY, like all the other redditors have commented, do you. \n\nYour cousin might thank you for the push and not being an enabler drinking the family koolaid. Smh", "NTA. Sounds like a Cousin Problem, not a You Problem.\n\nBefore reading your post I assumed your cousin was unable to drive for some reason--but that's not even the case. Cousin will need to work this out--she needs to learn to save, and maybe she can get another coworker to help her out in the meantime.", "NTA - go make the most of your opportunities. It’s nice you’ve been helping your cousin but she’s not your dependant/ responsibility.", "NTA\n\nI bet she also doesn't pay for gas or anything towards your car maintenance.\n\nYou absolutely do not need to stay in what is--for you--a dead end job when you have chance to work IN YOUR FIELD(plus It sounds like you can save on expenses while living with Dad and Stepmom). \n\nJust how many years of your life are you supposed give up to be your cousin's personal Chauffeur?????\n\nTell flying monkeys in your family, that if they believe she needs a car OR daily rides then it is ON THEM to do the family thing and provide.  Because you've done your share and now you are focusing on you and your life.", "NTA. Your life isn't contingent on driving your cousin. She needs to get a car and drive herself", "NTA Your cousin has had plenty of time to save her money and buy a car, she chose not to. Not your fault. Your education and future are more important.", "NTA \nDid you sign some sort of contract where you said you would be your cousins driver for life? No?  Then move and forget about it.  If your cousin is old enough to work they are old enough to figure out their own transportation. Oh and the reason family are upset about this: they will be guilted into giving her rides now.", "No actually I live right outside of a big city but yes I work in a rural area that’s why she can’t take the bus. But my family’s issue is that she has no credit so her interest rate is gonna be super high but I also got a loan for my vehicle before I had credit it’s possible.", "At this point--if I were OP--I'd be taking a McDonald's job out of spite, JUST so I didn't have to Chauffeur her ungrateful bum around.", "I haven’t done it yet. But I’m hoping on Monday I can put my 2 weeks in and move once my 2 weeks are up", "I was just teasing you about that. But, it’s possible for her to get a loan and a vehicle. She’ll never get credit if she does‘t start now. It‘s crazy that you managed to do all of these things, but for some reason your cousin’s family continues to discourage her. Well, that’s on them. It must be so exciting to start a new job in a new place. Good for you. Best wishes!", "So if your family is so concerned, surely they can step up and help out rather than pressure you into derailing your entire life so that your cuz can get a ride to work?", "Your giving her 2 weeks to find a car and while yes it's going to take a little bit for the car to get there (depending) that's way to much time for her not to find a car"]}