{"id": 29874, "submission_id": "17iqtvf", "title": "AITA for saying my dad is dumb for thinking I gave him herpes when he drank my drink?", "selftext": "I(19f) do not have herpes. My dad recently revealed that he had a girlfriend, he leaves me with the dog nowadays to go see her, calling it a \"business trip\". Recently, he admitted to accidentally drinking my water and said he had a sore on his lips saying have herpes, I asked my doctor if do and he said no and that have no infections. He also said that its impossible to get it from sharing a drink, doctor was shocked when told him my dad accused me of giving him herpes.\n\n\nI have not had a sore on my lip since was 8 years old. He definitely got it from his new gf. AITAH if I said he was a moron for thinking he got herpes from his own daughter?", "created_utc": 1698538230, "permalink": "/r/AmItheAsshole/comments/17iqtvf/aita_for_saying_my_dad_is_dumb_for_thinking_i/", "score": 10, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole here since my dad may not know much about herpes and was possibly misguided, and I agree that it's possible you can get sick from someone's drink.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You can't transfer herpes to someone without having an active sore, which obviously you didn't. Hopefully your Dad knows not to go \"downtown\" if he has a sore and vice versa with his GF.", "The truth can hurt, and sometimes really isn’t necessary. But your dad is a f*cking moron and this is so stupid, I have to give you a pass.", "NTA. You have to have an active sore to be able to pass a cold sore on to someone else.", "Also never share chapstick/lipstick with anyone ever.", "NTA I would tell him to ask his new gf to get checked out because the doctor cleared you. If he gets huffy, that's when you say, \"Well, no use pouting. Better rip the bandage off now.\"", "NTA lol. Your dad is so weird for blaming you for that. Idk why he can't fathom that it came from his girlfriend who he's been intimate with but instead from his daughter who he had no physical contact with. He's delusional blaming you.", "NTA\n\nEven if you had herpes that’s on him for drinking unknown drinks. \n\nYou can get herpes from a glass though as long as it hasn’t been sitting for too long without the infected person drinking from it.", "You absolutely can get herpes from sharing a drink, but only if the other person has an active sore.  It’s extremely rare without an open sore, though.\n\nUnless your doctor actually tested you for herpes, they can’t know you don’t have it.  It can lie dormant for many years.  It’s also very rare for people to clear herpes - once you’ve got it, you generally carry it for life.  You’re less likely to transmit it when it’s dormant, but it’s still possible.\n\nSo you have herpes, but it’s unlikely you gave it to your father.  NAH, but you’re both misinformed, and I’m concerned that your doctor doesn’t know better.", "NTA but I definitely wouldn't drink from ya dad and get tested just in case.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(19f) do not have herpes. My dad recently revealed that he had a girlfriend, he leaves me with the dog nowadays to go see her, calling it a \"business trip\". Recently, he admitted to accidentally drinking my water and said he had a sore on his lips saying have herpes, I asked my doctor if do and he said no and that have no infections. He also said that its impossible to get it from sharing a drink, doctor was shocked when told him my dad accused me of giving him herpes.\n\n\nI have not had a sore on my lip since was 8 years old. He definitely got it from his new gf. AITAH if I said he was a moron for thinking he got herpes from his own daughter?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "It’s entirely possible your dad had it before. Oral herpes is so common, and for the most part benign, they don’t even test for in STD panels. At least half the population of pretty much every country is estimated to have it and you can get from your grandma kissing you as a baby.\n\nNTA. He may have had it for decades and be like the majority of people who don’t experience regular outbreaks.", "Um, noooo.\n\nNTA, but dont let him kiss you on the lips when he has an active flare up. It will be even more awkward to explain to your friends, that your dad gave you herpes.", "I get fever blisters, cold sores, whatever. And I hate them. So, I don't play games and don't drink from other people's glasses, bottles, whatever. The virus has a really short life span, though. So, its me - not the glasses, bottles and jars. I am just likely hyper vigilant. \n\nAsk your dad where else his mouth has been because you have no active sores and obviously he did not get a mouth sore from you.\n\nNTA.", "NTA\nHowever, I don’t think that you have a firm understanding of herpes, cold sores, etc. Even if you had a cold sore when you were at, if that is in fact what it was, your father knew about it. Therefore, he should’ve been more mindful. Frankly, he remembered that you had a cold sore when you were eight enough to latch onto the idea that you’re the one that gave him herpes. \nAlso, a significant number of adults have Herpes Type 1, which causes cold sores. People don’t exhibit symptoms very often, if at all. So it’s not always as obvious that you are having an outbreak as it might seem. You could have a sore inside your mouth that you’re not really noticing. It’s possible that you were contagious at that moment in time, however, it’s unlikely. \nGenital herpes is something else altogether. It is Herpes Type 2. It’s a sexually transmitted disease. They can do testing to determine which type of herpes simplex type he has your post was a clear on that so I’m not sure whether he just has a cold sore or he has “down there.” It’s a sexually transmitted disease. They can do testing to determine which type of herpes simplex type he has. Your post wasn’t clear on that so I’m not sure whether he just has a cold sore or he has herpes “down there.” I don’t know about everyone else but that’s an important factoid that I would like clarification on. Because if he’s claiming to have acquired a sexually transmitted disease through your drinking glass, then that’s absurd. \nAt the end of the day, there is a possibility, if not a probability that you would’ve transferred your cold sore to him at some point over your lifetime. It’s extremely common. If he just developed a cold sore, that doesn’t mean that he got it from your glass last week. He could’ve gotten it from your glass 10 years ago and it’s only manifesting now. So there are a lot of flaws in his logic. At the end of the day, Herpes Type 1 or cold sores are very common and a lot of people get them. I don’t think it’s fair for him to “blame” you. However, just like you may not have a firm bras on how all of the stuff works, he may not either. So I wouldn’t be too upset with him because he’s ignorant on the subject. Lots of people don’t understand herpes and that’s common too. Don’t let your feelings about this situation with the girlfriend, color or interfere with how you see the possible (or not) transmission of herpes. You may be quick to blame the girlfriend based on some implied misgivings you have about their relationship. I recommend being aware of that possibility so that you are seeing all the details of the situation with clarity. \nYou’ve done nothing wrong. You shouldn’t feel bad. If you do have a history of a cold sore that doesn’t really mean anything. You have nothing to feel bad about in this situation, as far as I can see.", "NTA. I think we all know how he got herpes.", "The doctor is wrong about not being able to get it from sharing drinks, and couldn't have possibly cleared OP unless they actually tested for HSV1 and 2, which I truly doubt they did. OP said themself that they've had a cold sore in the past, which is from HSV1, herpes.", "You are correct about this.", "\"So you have herpes\"\n\nHow can you know OP has herpes?", "Where has dear old dad been putting his face? It seems highly unlikely that he got that short lived virus from his daughter's water bottle?🤣", "Eeeew id never kiss a parent on the lips", "Do you take a lysine supplement daily? It really helps prevent outbreaks. I take one every day and I haven't had a breakout in over a year.", "OP didn’t get tested by their doc, and it’s extremely rare to clear a herpes infection.  I suppose I could’ve said that it’s 99.99% certain OP has herpes, but at that point…what’s the point?  OP has herpes.", "Depends on your culture but herpes dad...ew no way", "I do, but not daily. Its hard on my stomach.  It seemed like my relationship with mouth sores got much better when I stopped actively working in the early childhood wing of our school buildings. I might be wrong, but I have less contact with the little ones and they get everything and bring it to school, plus you work in much closer contact with them because they are so small.", "I hadn’t heard about taking lysine for this. I get an outbreak every time I’m stressed so I’m going to have to start this. Thanks for the tip.", "But where did OP say she ever had the virus?\n\nShe said she had a sore on her lip when she was 8 years old, not that the sore was from herpes", "As ridiculous as this sounds to people - so do I. Stress exacerbates everything.", "If she had a cold sore when she was eight then she has herpes. They’re the same thing.\nEDIT: But she only said a “sore” not a cold sore so I’m connecting dots of my own there.", "Cold sores are herpes. As are chickenpox, mono, epstein-barr virus.\n\nUsually HSV1 (herpes simplex virus 1) causes cold sores, but it can also be from HSV2 (which is usually associated with genital herpes)", "If it wasn’t a cold sore, why would OP have mentioned it?  So obviously, OP meant she had a cold sore then.  Ergo, she got herpes 1 when she was 8, and humans can’t clear herpes, so she has herpes.", "Yes, unfortunately it does"]}