{"id": 29927, "submission_id": "17jdm7j", "title": "AITA for telling my sons family secret?", "selftext": "\r  \nMy husband (54M) and I (54F) have two sons, Leighton (13M) and Weston (11M). My father (92M) has been living with us for the past year as his dementia has been getting worse. \r  \n\r  \nOver the past 3 months, my father has been increasingly referring to Leighton as “Russell”. Russell was my father’s brother. I never met Russell, as he and a friend, James, along with James’s parents, died in a car crash in 1956 when Russell and James were 15. My great-grandparents were wealthy enough to have color photos of the family back then. I’ve seen photos of Russell, and I will say Leighton looks like he could be his great uncle’s twin.\r  \n\r  \nMy kids have been asking who Russell is, and I’ve just told them he was my uncle who died young. When they ask for more details, I just tell them I don’t know much about him and that my father/their grandpa was not in a state to talk about him.\r  \n\r  \nMy father never talked about Russell to the grandkids, and when I was a kid, rarely brought him up. About 8 years ago, my father and I were in the bedroom and were talking about gay marriage due to news around it. That’s when he told me he had a secret he wanted to tell me. He told me that when Russell and James were 13, his family had caught the boys acting romantically. After that, Russell was scolded by the family for his homosexuality. He told me the only reason they let the boys remain friends is they didn’t want this information to be public. He told me Russell was always “effeminate” and how his family would mock him for that. My father admitted he participated in the mocking and how he regretted it later in life. He said Russell would cry over this often, and looking back later in life made him (dad) feel terrible.\r  \n\r  \nLast week, I was at the doctor’s office with Leighton for a minor injury he had from baseball when I got a call from Weston’s teacher that he had been saying some homophobic things in class. She explained he was using the f slur, “gay” as an insult and mocking a boy for being “fruity”. In the car after we left, Leighton told me he’s heard some of the kids in his grade from the robotics club (which Weston is in) use that language. \r  \n\r  \nAfter I picked up Weston from detention, Leighton and I tried talking to him and telling him to stop, he said it wasn’t that big of a deal. I had my husband/his dad talk to him, but Weston ignored him too.\r  \n\r  \nI then decided to sit both of the boys down, I got photos of Russell and explained his story. How badly the family treated him, my father telling him the story of how Russell would cry in his bed. \r  \n\r  \nThe boys just sat there, I don’t know how it affected them, but I hope it left an impact. \r  \n\r  \nLater that night, I was talking to my older sister (58F) about this, her kids are in their mid 20s. She told me that I shouldn’t have told them about Russell, or at the very least, waited until dad died and I was not considerate of him. She also said they weren’t old enough and it was too dark of a thing for them to know. AITA?", "created_utc": 1698616218, "permalink": "/r/AmItheAsshole/comments/17jdm7j/aita_for_telling_my_sons_family_secret/", "score": 1085, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) After my younger son got in trouble for being homophobic at school, I told them about their great uncle, who was caught as gay at the age of 13 in the 1950s, because he died just 2 years later, they didn't know much about him besides that he existed. I taught them about how he was hurt and degraded by our family, including their grandpa/my father, who is 92 and has dementia\n\n2) My older sister is saying that they are too young to know, and that I shouldn't have told them, and at the very least, waited until our father/their grandfather had passed away to tell them\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA and your sister has no say in when you discuss that with your kids. She needs to stay in her own lane.", "“Too dark for them to know”? What part was too dark? That Russell was gay? That bullying hurts people? That when you hurt people, sometimes you regret it for the rest of your life? Those are just the facts.", "NTA it was a teachable moment and the appropriate time.", " NTA. They needed to know the consequences of homophobic behavior, especially if the one son wouldn’t listen to reason. I think you did the right thing.", "NTA\n\n This was an excellent way to teach them about empathy and kindness, especially knowing that a family member went through the same struggles as the kid they were bullying. I really hope how they treat and act towards people in the LGBTQ+ community changes for the better in future.", "NTA. Also sometimes with boys, it’s not about right or wrong, but more so about fitting in/not standing out/being a part of the group. Might be worth revisiting those lessons with him if this one doesn’t stick.", "Seems like a really good way to teach empathy to a kid struggling to understand the error if his ways.  \n\nNTA.", "NTA\n\nyou wanted to teach a lesson about compassion and this was a great way to do so, making it personal.", "NTA. Good parenting.", "NTA. It was perfect both because of your sons current ages and your uncle's age when your parents caught on. It gave your son a concrete example of who his words could hurt and how they would hurt.", "NTA - This was literally the perfect time to share this story and I’m pretty sure your dad will be happy to have used his own experience to prevent further homophobia in the family.", "NTA\n\nYou used the story to teach your kids about why they shouldn't use those derogatory terms and be more tolerant of other's differences. Your older sister is in the wrong here.", "NTA. If a kid is old enough to be bullying others for being or seeming gay, they are old enough to learn why they shouldn’t be acting that way.", "Your sons are 13 and 11 respectively. The first time I heard about a situation of someone dying due to homophobia was when I was your youngest sons age. A man beaten to death in a park by a group of guys who were drunk and \"looking to beat someone up\" specifically someone gay. Your sister is ridiculous for thinking this story was way too dark for them to learn when they themselves are dismissing how their actions could hurt or impact someone. They needed to know.\n\nNTA", "NTA\nYour sister is TA.\nYour dad is an AH.\n\nThis story may keep you kid from becoming a homophobic AH.", "I support gay rights. But if it were me, and my sibling died tragically at a young age, under the cloud of something considered scandalous especially at the time, then I wouldn't want those old wounds reopened when I had dementia and couldn't even properly address it. Everyone talking about it today never knew Russell, but grandpa did, and apparently in his dementia he's reliving those memories of Russell more vividly than ever.\n\nHere's the thing. I get it, we have an era of civil rights very unlike those of 1956. But if you were born in that era, you stop learning new tricks after awhile. Everyone becomes cemented at some point in the era they came from. Grandpa's suffering a fatal disease, not in his right mind, and doesn't have too much longer. It's kind of callous to talk about the most embarrassing scandal of someone you don't know, who grandpa knew, whose death and circumstances he deeply regrets, and in fact is reliving in his dementia.\n\nThere's no reforming grandpa or teaching grandpa  lesson. Grandpa's mind is too far gone now to learn anything. All he can really have at this point is comfort. So yes, I see where the sister is coming from.\n\nPicture the most embarrassing thing you know about somebody close right now. Maybe you somehow made fun of or otherwise participated in that. Now picture if that person died tomorrow, before you ever got to amend that. Let that be long buried, and exhumed moments before your death. Maybe what you did by the standards of tomorrow was frowned upon. You have no way of knowing that today. It's just unfortunate.", "I think everyone involved is an asshole", "YTA. If your son is 11 and still doesn't know not to slur or discriminate against gay people that is on YOU. Seems like you just used your dad to whitewash your own guilt here.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\r  \nMy husband (54M) and I (54F) have two sons, Leighton (13M) and Weston (11M). My father (92M) has been living with us for the past year as his dementia has been getting worse. \r  \n\r  \nOver the past 3 months, my father has been increasingly referring to Leighton as “Russell”. Russell was my father’s brother. I never met Russell, as he and a friend, James, along with James’s parents, died in a car crash in 1956 when Russell and James were 15. My great-grandparents were wealthy enough to have color photos of the family back then. I’ve seen photos of Russell, and I will say Leighton looks like he could be his great uncle’s twin.\r  \n\r  \nMy kids have been asking who Russell is, and I’ve just told them he was my uncle who died young. When they ask for more details, I just tell them I don’t know much about him and that my father/their grandpa was not in a state to talk about him.\r  \n\r  \nMy father never talked about Russell to the grandkids, and when I was a kid, rarely brought him up. About 8 years ago, my father and I were in the bedroom and were talking about gay marriage due to news around it. That’s when he told me he had a secret he wanted to tell me. He told me that when Russell and James were 13, his family had caught the boys acting romantically. After that, Russell was scolded by the family for his homosexuality. He told me the only reason they let the boys remain friends is they didn’t want this information to be public. He told me Russell was always “effeminate” and how his family would mock him for that. My father admitted he participated in the mocking and how he regretted it later in life. He said Russell would cry over this often, and looking back later in life made him (dad) feel terrible.\r  \n\r  \nLast week, I was at the doctor’s office with Leighton for a minor injury he had from baseball when I got a call from Weston’s teacher that he had been saying some homophobic things in class. She explained he was using the f slur, “gay” as an insult and mocking a boy for being “fruity”. In the car after we left, Leighton told me he’s heard some of the kids in his grade from the robotics club (which Weston is in) use that language. \r  \n\r  \nAfter I picked up Weston from detention, Leighton and I tried talking to him and telling him to stop, he said it wasn’t that big of a deal. I had my husband/his dad talk to him, but Weston ignored him too.\r  \n\r  \nI then decided to sit both of the boys down, I got photos of Russell and explained his story. How badly the family treated him, my father telling him the story of how Russell would cry in his bed. \r  \n\r  \nThe boys just sat there, I don’t know how it affected them, but I hope it left an impact. \r  \n\r  \nLater that night, I was talking to my older sister (58F) about this, her kids are in their mid 20s. She told me that I shouldn’t have told them about Russell, or at the very least, waited until dad died and I was not considerate of him. She also said they weren’t old enough and it was too dark of a thing for them to know. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. That's a great way to educate them.", "NTA.  It was the right thing to do - regret is hard to bear, but its often too late to do anything about whatever it is you regret doing.  Sometimes because the hurt party isn't interested in your regret, and sometimes, because that person is gone and you just have to live with it forever.  \n\nYour sons should understand how their words hurt people, and may one day bite them back.  Its a good lesson to learn.", "NTA you did exactly the right thing. while very tragic, it is also very real. and if it allowed the boys to see the true harm to these slurs, and the regret their grandad now has . it will have been worth it.  \nand if  your father does ask. you can say that you wanted to make sure that the boys learnt from his lesson about insults and regrets.", "NTA. That's bloody good parenting, and that's all it is", "My finger was poised above the Y when I clicked this. People who can’t keep secrets are fairly high on my shit list. In this case though,I think it was the right thing to do. It would be nice to think that maybe great uncle Russell would have been glad that some good came from that awfulness.", "You’re seriously asking reddiit this question?", "NTA", "What I got from it is that the dark part was that the homophobic way grandpa treated his brother, not realizing he was about to die, was one of grandpa's deepest regrets and a shameful secret, and he's got dementia so he can't really properly even address it.", "Bullied then died young.   Between the lines could mean suicide.    \nTelling an 11 year old he could be responsible for another death could be a little dark.", "That’s a terrible way to look at this. Is it bad that he’s saying shit like this? Absolutely, but coming at someone for their kid being like that when OP is clearly trying to correct it is ridiculous. \n\nWhen trying to get people to be more considerate and accepting of people, one of the worst things we can do is act like bad behavior is a failure that can never be moved on from. We have to understand change if any kind is difficult and support any attempts to do so while also not making excuses for any slip ups. This won’t work on everyone obviously, but demanding perfection only drives people away.", "NTA and thank you for hopefully educating those young boys into not speaking like that in the future. Please remind them not to talk to Grandpa about Russell, and assure Leighton that grandpa doesn't think he's \"like\" Russell, just that they look very similar.", "NTA. Your sister is wrong. You’re trying to teach your kid to not be prejudiced and behave like a decent person. Using your family history to show him how that kind of bullying hurts people for years is smart. I hope you kid learns your compassion.", "NTA, you handled this perfectly. Tell your sister to raise her kids and you’ll raise yours.", "Nta. Your son needed something like this to show him how his words impact people.  As a gay man, I know the hurt and pain these words cause. We need kids to see that this is as bad as using racial slurs. You did the right thing,  and I hope it worked.", "NTA- this is a great lesson about how the words we use matter, how bullying is wrong and how sometimes we say things we can't take back. How we need to apologize and treat others with compassion before it's too late.\n\nYour father's memory is too far gone to teach these lessons still. But if on your death bed, you could say something to prevent your worst mistakes from repeating themselves, wouldn't you?", "NTA. Wtf is wrong with your sister?", "NTA. This not only teaches Leighton just how wrong his actions and outlook are, but it also honors Russell's memory.", "NTA. And you did a great job teaching your children about hate, regret, love and understanding. I wish there were more parents like you. Keep up the good work.", "NTA. They are old enough. Particularly the one using slurs.", "NTA\n\nThe boys need to understand why using those slurs are wrong and how they can damage a persons confidence and mental health", "...Some family secrets teach us to be better than the pasts we have participated in. Whereas I have never so much as ever had a dialogue about sexuality in my family (outside of defending my own heterosexuality as people were confused about my nurturing personality), I think this secret was worth sharing to dissuade the past from occurring once more.  \nGenerational curses are a real thing, and they manifest through the lives we live and past down to the next generation.\n\nNTA. You're trying to save your sons. Your father has acknowledged how terrible he felt treating his brother this way; it's now time to let this present be the path forward. To come away from the shadows and to put into the light how we move forward together. I'm not trying to be poetic, but it is very true. I hope the positive lesson given will help them grow closer and up together. As Grandpa regresses, may the lessons not dissolve as he relives his fading past as the present.", "Good parenting. Rip the cover off this stuff clouded in shame and tradition and make it so this is a dialogue that changes lives and people for the better. I am a fan of not hiding in the shadows - and connecting the dots. Your children will eventually appreciate this -  but until then, I do. I get you and we fight the fight to make our kids understand right and wrong. It’s not always easy - and it isn’t always accepted. But it is the right thing to do. And those who stand in the background and stay quiet - or judge because they can’t do this themselves - need to know that there is power in the truth and that the right thing to do is the right thing to do and there is no gray area on that, ever. At the end of the day, it is all family - and it is messy and sad and happy and amazing and private but public and they need to know they are connected to all of it - so to open one’s mouth and hurt someone now is to hurt someone who you should know is part of you and you should know that - and life is love, and love is everything. We are all joined, whether we want to know this or not - it’s the truth. Everyone needs to grow. You did the right thing, and you helped, which isn’t easy. Good job. Keep going. Xo", "NTA for sharing, but you’re not doing enough. Little bigots like your son are why my kid is terrified to go back to school in person. They came out at 11 and have been too scared to go to school since.  He needs much more reeducation. There is never a time in either of my kids life where they would have ever thought it appropriate to say any words that your son did. And my oldest is an adult. We don’t care if they swear at home, but slurs are absolutely unacceptable and they’ve known this for years. You have 100% dropped the ball on this topic for your children if they felt comfortable saying it in a place where it isn’t even allowed (good on your school for their lack of bigot tolerance). So do better. Don’t let your son be the reason a LGBT kid is scared of school, or bullied, or worse. It’s past time to educate your son about the atrocities that LGBT folks have gone through since he seems to be lacking empathy. Maybe start with Jane Elliot and her racism teachings. The same principles apply for LGBT folks.", "YTA That's wasn't your business to tell.", "NTA and it sounds like some of the homophobia got passed down to your sister.", "NTA. I think what you told the boys will make them think and it is an important lesson.", "Nta. Your sister is part of the problem", "NTA. It's a realistic example to show them how their actions can affect someone", "I wish these had TL:DR but I understand why they don’t.", "YNTA, and your sister needs to keep her nose out of how you raise your children. \n\nAs for your father, contact your local alzheimers association or his PCP for in-home dementia care assistance.", "NTA - it is never to early to learn respect and empathy. They, obviously, hear and see things at school and your job as a parent is to nip that as soon as you can.\n\nGood job mom!", "NTA you made the right call.", "If they are old enough to use homophonic names, they are old enough for the conversation!!!!", "Idk but your dad is practically one foot in, does that even matter? It’s more of educating your sons. Good job for doing your best.", "Being gay is not a dark subject 🤣 what the hell - call her out on her obvious homophobia. Say gay. Gay is great. GAY GAY GAY normalize language.", "NTA, you’re a great parent for seizing this teachable, powerful moment", "If they're old enough to be carelessly and intentionally throwing around homophobic insults, they're old enough to know the impact of that.", "NTA. If they're old enough to use those slurs and bully others for their sexuality, they're old enough to learn about the effects it has on others", "NTA and your sister is just wrong here. You did the right thing by putting some real life perspective to his actions. \nI know he is young, but I would consider looking into having him volunteer in an LGBTQ shelter or club or something if his behavior doesn't change. He may think words don't hurt, but we all know they really do. I don't know if that would help, but you said talking to him didn't work, so maybe meeting the people he is badmouthing (like that commercial about Jewish hate, you know what I mean?) maybe meeting actual humans would change his thought process?", "NTA, but id make sure to not let your sons treat their grandpa badly for that or talk with him about it. with dementia, hes beyond tackling that issue and if he finds out you told your boys about it, he may feel betrayed.", "If they are old enough to make homophobic comments, they are old enough to know. Also, in the words of the great Morgan Freeman. “Homophobia is not a phobia, you are not scared, you are an asshole. “", "NTA.\n\nbullies need to be made to face the harsh realisation that their actions can have very severe consequences for the victim. An 11 year old is more than capable of understanding that what they’re doing could result in someone being hurt in a way that they might not come back from and being held accountable for it. \n\nWeston needed a wake up call and you gave it to him.", "Absolutely NTA but your sister is out of her mind. Your children NEEDED TO KNOW THIS. Being bullied causes irreparable harm.", "NTA\n\nYou did right. They won’t repeat your father’s life regret.", "If you’re old enough to be a bully, you’re old enough to know the repercussions of bullying.\n\nNTA.", "If they're old enough to use slurs against peers you think are LGBT+, they're old enough to learn what it means to be LGBT+, the good good and the bad. \n\nThey also urgently need to learn that LGBT+ people are not another kind of people, strangers they think they don't care about, but that they are amongst their family and friends. \n\nNTA", "“That when you hurt people sometimes you regret it for the rest of your life” is the kind of insanely prescient advice I needed growing up.", "I agree with you to some extent and this sub loves this thinking. \n\nThey are family, they talk, OP told her sister that she shared this secret/family history with her kids. I think it is very natural for someone to reply with their opinion. Imagine OP calls the sister, says what she did, then sister just doesn't reply. OP would be expecting a response. Where it can get messy and where people need to stay in their own lane is when they go from discussion/sharing their opinion to forcing it on someone. \n\nIn this case \"you should have waited until dad died\" vs \"you should have waited until dad died, since you didn't, I am not going to talk to you or your kids.\"\n\nAnyway, don't agree with the sister anyway, this is a unique story that clearly has educational value for the kid using homophobic slurs.", "Ugh. Especially when them being middle school age. Such a time that compassion is needed. I was waking behind a6th grader when I was on my way to work the other day and she kept kicking the fence as she was walking. All I could think was if she turned around I would smile as kindly as I could and tell her I hope everything was OK. What a difficult day and age to be a middle schooler. At least when I was, there wasn't social media cell phones or really even computers, at least not in every household...", "How is the 92 year old dad with dementia TA?", "No one is trying to change or teach grandpa anything. Plus he has dementia so it won't even sink in or matter that this story was told anyway. It's not about shaming grandpa. It's about teaching her kids. Plus, grandpa regretted it. And it was understandable since it was a different time and he was under a lot of pressure from family. The point is that grandpa already realized he was wrong. And as you said, he's too far gone to even register any kind of conversation like this.", "Tell your kids that it’s great their grandpa has regrets.  If your son keeps this up he may have regrets for the rest of his life too.", "That's still not dark for any kid over 8 or so.", "Except we do know the cause of death was the car accident in this case. So the lesson is to not be a bully because you could come to regret treating someone terribly and no way to ever even attempt to make it up to the victim.", "A fifteen year old dying in a car crash with his friend and his friend’s parents?  I didn’t get suicide vibes from that at all.", "Kids as young as seven are committing suicide due to bullying from their peers. It’s never too early for that talk.", "That's a massive stretch, especially since this kid died in a car accident. \n\nIn any case 11 year olds have been known to cause the suicides of other 11 year olds, so they are plenty old enough to know that bullying can have that consequence.", "But he could be. Even at 11.", "middle school was when my peers inflicted psychological scars on me that have lasted for over 20 years. they caused permanent changes to my personality that i now just have to live with. middle schoolers *definitely* need this lesson.", "The grandpa bullied Russell for being effeminate when he was younger."]}