{"id": 30029, "submission_id": "17kepf7", "title": "AITA for choosing a wedding date that my parents don't approve of?", "selftext": "I (29m) and my fiance (28f) are getting married next year. We've both always wanted a summer wedding so we chose a date in that season. Everyone agreed to help in any way they could, including my stepmother (Ava) who insisted that she helped to find a venue. We had a few site visits scheduled, but she usually came through for us so I trusted her. But if I'm being honest, Ava and I haven't always had the best relationship, because of how demanding, aggressive, and mean she can be.\n\nRegardless I always tried to keep the peace both as a child and even now as an adult. She's done a lot for me so I didn't want to be ungrateful. When she did something wrong, Dad often told me that it was just \"how she is\" but I never truly got used to her. My bio mom, while she couldn't do much for me financially, is the opposite of Ava, so it was hard to accept Ava because my own mom never stressed me out like that.\n\nA while back, my fiance and I went back to our hometown. We usually stay with my parents or hers. While we were with my parents, I asked Ava how the venue was going. She aggressively asked if we changed the date yet. The date we chose is the day after her birthday and she likes to travel during that time. \n\nI said no and explained that it was the tentative date we had for now. She angrily stormed off. Not a surprise. It was always her way or the highway, but I felt like just this once, they would make an exception for my wedding. When she came back, she immediately started telling us how \"disrespectful\" we were for choosing that date and not changing it. Before I could speak, she screamed, (with profanities) at us to get out of her house.\n\nWe felt humiliated, getting berated by her whilst packing. A few days later, my fiance wrote a discrete FB post about the situation, sharing her thoughts from the experience. I didn't really want her sharing it on FB but I felt guilty putting her through that. She was never comfortable around Ava and she always said this but I kept reassuring her that everything was okay. My mistake. She always tried to be chill but has always hated my family's dynamic of just sweeping Ava's behavior under the rug. \n\nI got a call from Dad shortly after because the post got attention. Even though he admits that she shouldn't have done that (since the house belongs to them both), he still tried to get me to see it her way (as usual) and proceeded to make the situation about the FB post and how we \"never included them in the wedding plans\". \n\nI politely let him know that there's no compromise here and that we want an apology. I don't know—I've just put up with her for so long, and I felt like this was the last straw. We had no issue reconsidering the date, it was just her usual \"bully approach\" that was unacceptable. My bio mom, my fiance's mom, and other people who know about this share our sentiments, but at this point, we both want to just take all our money and elope then travel—away from the drama. AITA?", "created_utc": 1698733822, "permalink": "/r/AmItheAsshole/comments/17kepf7/aita_for_choosing_a_wedding_date_that_my_parents/", "score": 1018, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. The action I took that should be judged is choosing the wedding date knowing that my parents and brother travel each year for my step mom's birthday. I'm aware that they do. I just wish they could have made the exception for my big day because we really wanted that date. It was just the most convenient for us, the bridal/groom parties and what we wanted.\n\n2. Well, my dad accused me of purposefully choosing that date to exclude my step mom. This isn't true and I let him know that but it got me thinking: Do they really see it that way? That's why I feel like this may be the most appropriate response to this question.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nThis is your wedding and you have it on the date you want.\n\nDo not let your bully of a Step mother and your doormat of a father derail things", "NTA\n\nThe two issues here are your selfish stepmum not wanting to change her standard birthday plans for one year and also your dad for being a doormat and not standing up to her while she tries to bully you.\n\nEveryone else is on your side and would it really bother you if your stepmum wasn't at your wedding because that sounds like the kind of ultimatum she would give you?  If your dad seems to be siding with her then tell him he needs to think about what is more important, his sons one off wedding day or his wife's birthday plans that she does every year and can easily change this one time.\n\nSounds like your stepmum is trying a power play and is used to getting what she wants.  Make sure that in this instance when it comes to your wedding day she is very much considered a +1.", "NTA, but if you want to remain married, stop making excuses for your stepmother and start backing your new wife. She seems to have the measure of Ava and you KNOW Ava is pulling a power play move over this. \n\nTell your dad you’re an adult now, capable of making your own decisions and if Ava continues to disrespect you and your soon to be wife, you will have nothing to do with her. He’s an enabler who is putting her unreasonable behaviour ahead of the rest of his own family.", "NTA. She expects to get whatever she wants. She can be disappointed for once.", "NTA, it’s your and your gals day, do what you want. Simple, end of story! Oh, and that “stepmother” sounds like a nightmare. Sorry, dude. Time to make new boundaries for you and the wife to be. Remember, getting married is the beginnings of a new family, so keep that family safe and happy and someday they’ll do the same for you.", "NTA.  \n\n\nYour step mother is an abusive bully.  That's the all of it.", "ESH \"discrete Facebook post\" is absolutely hilarious.", "Did you not decide on the venue first? The date usually depends on the availability of the venue so I'm a bit confused why you chose this specific date. \n\nCould you clarify how you came to choose this specific day to get married? Did you want stepmother to look for a venue that could host the wedding on a day she herself would be travelling? Because I understand why she would be offended by that.\n\nYour stepmother seems like a lot in the way you describe her and she reacted in an agressive way, she should apologize for the way she reacted. I'm not sure she'd still get an invite to the wedding with that kind of behavior.\n\nNTA", "Why was that date chosen? Does it hold some significance to your relationship with your fiancé?\nIt is weird to choose the day after a parent's(or step parent's) birthday, especially knowing what they do for it.", "Sorry, but I am LOL'ing over the comment, \" my fiance wrote a discrete FB post about the situation\".  There is no such thing as a \"discrete\" post on FB.\n\nMy suggestion would be to take the wedding money and travel. \n\nNTA", "I'm confused. How do you have a date but no venue? Normally you pick an approximate time of year and a day of the week, then you visit venues and fix the date based on their availability.\n\nIf it was the \\*\\*only\\*\\* date the dream venue had available, I can see why you'd pick it, but if you haven't even got a venue yet then it's all just moot.\n\nESH, because you're all fixating on a date for no reason.", "Absolutely NTA. The only people who's desires for a wedding truly matter are the ones who are getting married. If your stepmother has a problem with that, that's her problem. And it sounds like you're already aware of the kind of person she is, as well how your dad is a doormat, and aren't really shocked by how they're acting. I hope you're considering going low or no contact, especially if this starts to adversely affect your relationship with your fiance.", "NTA but i don't like people airing drama on FB or other platforms. Your dad and ava suck more but honestly was this post on FB necessary? \n\nAva sounds exhausting so just plan the wedding (and maybe your life) without her. I think that would be an improvement.", "NTA, except for the FB part. Why does everyone feel that they should post all their personal crap on there?  Yes, I know it was your fiancée, but you bear some responsibility as well.\n\nDo your wedding your way and don’t involve your dad or his immature wife.", "NTA - as someone who’s planned and had a wedding I understand the need of a tentative date. Most venues the first thing they asked was what date you were looking at and we just had to put a date in for the enquiry so picked a date. It obviously could have changed if we found a venue who didn’t have that free or if we found it conflicted with a direct family member. \n\nIt seems like this isn’t a one off event so I can understand why you are both tired of it. You need to rethink your boundaries with both her AND your dad. Hes let this happen, the fact you were raised to let her the adult get what she wanted because that’s how she is, is just ridiculous.", "NTA\n\nBut also do the elopement and travel thing. Weddings are a massive waste of money to throw a one day party for relatives. It's dumb. If you're footing the bill, let it be for yourselves. Go see the world, enjoy each other's company, and relax.", "ESH\n\nYou intentionally picked a day you knew was gonna cause issues. And I belive you did this on purpose just to try and make them choose. \n\nYour Step Mother flipped out. \n\nPersonally you created this problem so now deal with it. For me I'd still be taking my trip, skipping your wedding. Don't be surprise if they do.", "NTA time to cut Ava out of your life or go low contact. She acts this way because she has issues, and everyone around her is too afraid to call her out on it. They are enablers, including yourself.\n\nTell your dad you will move the wedding date, and move it to the day before so it's on Avas bday.", "NTA Protect your wedding and your soon to be wife. Do not let your stepmother \"help\" with anything, she's going to sabotage it to get her way. Or just to enjoy making you upset because she didn't get her way.  Set up a password with all your vendors. \n\nShe is a guest and nothing more, and if she doesn't want that, you still win. You're all adults, she can stop acting, and being catered to, like a child.", "NTA but your stepmother sure is!  She sounds toxic and your dad has made a career of making excuses for her.  My advice would be to avoid the drama.  Take the control away from your stepmother.  She'll hate it but you know what they say about karma!  Take the money for the wedding and elope and travel like you mentioned in your post.  If you want, have a party when you get back.  At the end of the day, it's about you and your fiancee's happiness.  Don't let her take that away from you.", "NTA. Fuck Ava, you'll probably enjoy your wedding more without her, your Dad is always going to take her side, don't expect that to ever change.\n\n\nThey have 2 choices, either be at your wedding or don't.\nYou've told them your decision, do not approach them again, move forward with your plans and have a wonderful wedding day.", "NTA and I vote yes to an elopement.", "NTA\n\nHave the wedding your way, on the date you want.\n\nDo not compromise on anything with your father or Ava, otherwise she will just keeping pushing for more.", "That is so unfair I mean it is your wedding and you should choose that date not them", "Have your wedding where and when you want. It's YOUR wedding.  \n\nIf it were me I'd have nothing more to do with Ava unless she changes her ways, but don't hold your breath.  I had a similar (but no where near as intense) relationship with one of my in-laws.  She made it clear how she felt about me for the first 35 years, then gradually eased off and is now nice to me - because she needs help from time to time and realises she will need more help as time goes by.  I've always been polite, but minimise all contact.  I couldn't care less about her, and it's been her loss.", "You know you are actually allowed to have a relationship with your father and not Ava right? Assuming he is less of a doormat than you have been. \n\nNTA Ava wouldn't be invited to my wedding", "NTA Have your dream wedding or Ava has power over you. If your dream wedding is eloping - fantastic! If not, hire a venue and give them a safe word.", "NTA\n\nThis is the moment you take a stand, my good dude. You have been walking on eggshells around your Stepmom for far too long, and it needs to stop. Not just for your own mental health, but for the new family you're building with your wife.\n\nThink back on every time you were high strung, stressed, your mood ruined, as you tried to keep this woman from blowing up (and failing, because it's obvious she thrives off of creating drama and being the center of attention), and ask yourself: is this what you want your loved ones, your future wife, maybe children if you want them, to be exposed to?\n\nTell your father \"You always say this is the way she is. Well guess what, this is the way I am, now, too. She's uninvited from the wedding unless she apologises for her atrocious temper tantrum, and for expecting for our wedding to take second place to her, just like everything else always has. And unless she is on her best behaviour, we keep the right to take back the invitation at any time, too.\"\n\nTime to grow a spine. Stop taking this abuse.", "NTA.  Your stepmom made your wedding about herself. That is all you need to take back control that you allowed her to have over the preparations.  You are right demanding an apology.  You have kept the peace for your dad but time to let him know that you will no longer put up with bad behavior and you and your fiancé choices come first.", "ESH\n\nYou know of her tradition of traveling over her birthday, yet you still chose that weekend deliberately.  Probably to antagonize her since you obviously don't like her.", "Unless there is s specific reason you choose that date ESH. You knew there would be a conflict but you chose that date anyway.  If there is a reason you had to choose that date that would change my mind. \n\nNo excuse for your step mom to act that way and you should get an apology. You should also apologize for intentionally choosing a date that would cause conflict and for your fiancé posting family drama on Facebook.", "YTA. Going against the tide here. Summer lasts for more than 1 week, you know that right? Sure, any other date that you choose could also be close to someone else's birthday but come on! \"Just this once\" shows you did this as a test, maybe not as first thought in the process, but a factor for sure. This isn't about winning, this is about a happy life for you and your fiancé, and choosing a date you know would cause issues is just tiresome! Grow up. I can't say anything about Ava in this as I don't know what else she has done in the past, but if you have always been this slyly competitive for your fathers attention I am on her side because dear lord.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (29m) and my fiance (28f) are getting married next year. We've both always wanted a summer wedding so we chose a date in that season. Everyone agreed to help in any way they could, including my stepmother (Ava) who insisted that she helped to find a venue. We had a few site visits scheduled, but she usually came through for us so I trusted her. But if I'm being honest, Ava and I haven't always had the best relationship, because of how demanding, aggressive, and mean she can be.\n\nRegardless I always tried to keep the peace both as a child and even now as an adult. She's done a lot for me so I didn't want to be ungrateful. When she did something wrong, Dad often told me that it was just \"how she is\" but I never truly got used to her. My bio mom, while she couldn't do much for me financially, is the opposite of Ava, so it was hard to accept Ava because my own mom never stressed me out like that.\n\nA while back, my fiance and I went back to our hometown. We usually stay with my parents or hers. While we were with my parents, I asked Ava how the venue was going. She aggressively asked if we changed the date yet. The date we chose is the day after her birthday and she likes to travel during that time. \n\nI said no and explained that it was the tentative date we had for now. She angrily stormed off. Not a surprise. It was always her way or the highway, but I felt like just this once, they would make an exception for my wedding. When she came back, she immediately started telling us how \"disrespectful\" we were for choosing that date and not changing it. Before I could speak, she screamed, (with profanities) at us to get out of her house.\n\nWe felt humiliated, getting berated by her whilst packing. A few days later, my fiance wrote a discrete FB post about the situation, sharing her thoughts from the experience. I didn't really want her sharing it on FB but I felt guilty putting her through that. She was never comfortable around Ava and she always said this but I kept reassuring her that everything was okay. My mistake. She always tried to be chill but has always hated my family's dynamic of just sweeping Ava's behavior under the rug. \n\nI got a call from Dad shortly after because the post got attention. Even though he admits that she shouldn't have done that (since the house belongs to them both), he still tried to get me to see it her way (as usual) and proceeded to make the situation about the FB post and how we \"never included them in the wedding plans\". \n\nI politely let him know that there's no compromise here and that we want an apology. I don't know—I've just put up with her for so long, and I felt like this was the last straw. We had no issue reconsidering the date, it was just her usual \"bully approach\" that was unacceptable. My bio mom, my fiance's mom, and other people who know about this share our sentiments, but at this point, we both want to just take all our money and elope then travel—away from the drama. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Definitely NTA in this case. She's the one who overreacted and tried to bully you and your fiancé. \n\nBut I also don't understand the insistence on that date on your part. Since it's a tentative date & venue was not booked yet, would it have made a big impact on the wedding budget/expenses to shift the date by a week or so? It IS bit odd to set it on the day of one's stepmom's birthday, especially since she's been in your life since you were a child and has been helpful at times despite the toxicities.", "NTA but maybe ESH, there is a lot going on here. \n\nThe question is, AITA for picking a date your stepmom doesn’t like, on that, NTA. It is your wedding, and you picked a date. It sounds like you would move the date, which is interesting and suggests some of this is “the principal” but still, you can have your wedding whenever you want, so NTA.\n\nBut there is a lot in your post beyond the date about this Facebook situation. That situation could create an ESH if you are also asking about it. We need a lot more info though. You said your wife’s post was “discrete,” but discrete is going a LOT if work in that sentence, and it is tough to know how discrete it could be if your family readily identified what it was about and it caused drama. And it sounds like you know the FB post wasn’t in great taste because you didn’t want your wife doing it.\n\nSo NTA on the question you asked, possible ESH on the situation more generally.", "NTA. Keep your date and don’t expect an apology from Ava. In fact you might want to tell her it’s ok she doesn’t have to apologize because it would ring hollow. Then tell her she doesn’t have to worry about your wedding date because she’s no longer invited. Then follow through. She’s selfish. \n\nMy mom had to postpone my birthday (summer birthday) because my aunt was getting divorced that day and wanted my mother to go to court with her. My mother and aunt explained this to me. I was turning 9yrs old. Guess what? I didn’t have a fit or become upset. I went with my mother and aunt to the courthouse as support. My mother and I treated my aunt to lunch that day and we celebrated my birthday another day that same week. If I, as a 9yr old, can understand that life happens and celebrations can be had on other days, your “stepmom” can grow the f*ck up and celebrate herself another time.\n\nWhat happens if you by chance have a child the same week or forbid the same day as her birthday? Would you then have to celebrate it another week or different month entirely because it’s “Aaaavaaaa’s special day!!!”\n\nAva is a bully because she’s gotten away with too much for far too long. It’s time to stand up for yourself now and in the future. Do not hesitate to cut her out of your life. And if you really want a wedding, have it without her. Drama problem solved. Leave people who throw temper tantrums out.", "I'm torn between NTA and ESH because, on the one hand, she sounds like a very difficult person to please, makes everything about her. I'd guess she tends to ruin everyone's good time too. \n\nYou're not wrong in that you shouldn't have to accommodate her personal preferences just to avoid a tantrum, but you did know there was likely going to be a tantrum. \n\nYou knew that the date would be a problem for her. You know that she's unwilling to compromise and that she makes everything about her. \n\nI'm not sure what the solution is that doesn't involve letting go of a little pride. Although you shouldn't have to cater to her whims,\nmaybe try an \"I'm sorry you feel that way\" kind of non-apology:\n\n\"My intention wasn't to make you feel disrespected, and when I told you the date, you seemed fine with it. As I said, it's not THE set date, just a placeholder.\" \n\nIf you did intend to be disrespectful and you were just poking the bear, then you would be the AH.", "NTA. It's not \"keeping the peace\" it's \"sacrificing your own personal peace to placate a bully who would never give you the consideration they demand from others\".", "I'll vote ESH because you OP need to reflect. You grew up walking on eggshells with your stepmom. You know how stressed out and frustrated you've felt. Yet for the past 10 years of your relationship you've made your fiancée do the same as you while you essentially assumed your dad's role by saying \"everything is going to be fine\" while fully knowing that's a lie.\n\nWhy would you give or rather, concede such an important job as deciding on the venue to your stepmom? AND made your fiancee \"work\" with her instead of you when you know your SO can't stand Ava?\n\nWhy would you stay over at their house for a week knowing it would likely be full of tiny insults, passive aggression, or a full blow out?\n\nThe only ways to make it up to your fiancee are:\n- to hold firm (for ONCE in your life) about getting an apology by a certain date else no wedding invite for Ava.\n- to get back in control of ALL aspects of your wedding. Go back to the venue that you liked and who cares if Ava hates it, she's not the one getting married. Your fiancée DESERVES the wedding she wants, you too. Hopefully you are not going to fold since that's what you've been conditioned to do.\n- to NOT inform her or your dad of any other wedding prep details before and after the apology if she ever admits her fault (doubtful).\n\nOP, if you don't change your way of interacting with Ava and your dad, she will keep bulldozing past your boundaries, your fiancée, potential kids etc. Do you want your future family to suffer because you couldn't be adult enough to stand up for them? Ava will always rock the boat. It's NOT your job to prevent it from flipping upside down. You got your own family boat to steer in the right direction.", "NTA and stand firm against Ava. She’s actually abusive and your dad is allowing her now and when you were younger to be abused. Stop this cycle right now by keeping her in her place. Make her apologize before even considering her having an invitation to the wedding then make conditions on her behavior being acceptable by you and your partners opinion, not your dad’s. There’s no reason she should have any say in the date of YOUR wedding!", "[removed]", "NTA, but\n\n>  It was always her way or the highway, but I felt like just this once, they would make an exception for my wedding.\n\nSo she picked highway.  And?  You have your wedding date, and everybody gets to choose or not choose to attend.\n\nPlease, go read the book 'When I Say No, I Feel Guilty' and learn how to stand up for what *you* want.", "NTA but if you both already know how she is, why would you trust her with something so important like the venue for your wedding? That makes no sense.", "NTA.  Your wedding, your rules.  If stepmom doesn’t like the date, she can skip the wedding and go traveling as usual.  Her absence sounds like it would be no great loss anyway.", "You've got a point there. Totally my fault. We've been together for almost 10 years, so she's been around long enough to see her flip out a lot and I think at this point she'd just had enough.", "Thanks so much for this. Ever since I was a kid, it was always \"Do this before Ava comes\" \"Ava's going to be upset about this\" or \"Ava's not happy with this\". Everyone always has to jump through hoops to make sure she is happy because God forbid she was in a bad mood or inconvenienced in some way once she got home. The whole house would be tense and she'd just flip out at the slightest thing.", "\"So anyway, we get out a gas can and start pouring\"", "Firstly I appreciate you asking for clarity and I understand where you're coming from. It was a tentative date. We wanted a summer wedding, but we managed to narrow it down because of factors like budget, availability, etc. We were already browsing venues before she volunteered to look for one and they let us know their available dates. Even so, we still weren't sure, that was the date we had in mind based on the factors. The reason she even volunteered in the first place is that she didn't like one of the venues we chose. She basically just decided that she'd take over finding the venue, so we canceled all other visits we had that month. And on the day she agreed to find a venue for us, she asked us what date we were thinking. So it's not the first time she's heard that date. We didn't know it was that big a deal until the day she flipped out. We'd been staying at their house all week.", "To clarify, it was a tentative date (I said this to her right before she stormed off—As mentioned in the post) and we were visiting venues before she even volunteered. How she even ended up volunteering to get the venue, is because she didn't like one of our selections so she literally just stepped in and said she'd handle it. Also, she asked us what date we were thinking of and simply said \"okay\" when we told her. \n\nShe literally didn't express how big a deal it was until the day she started flipping out. As I mentioned earlier, we literally wouldn't have had an issue reconsidering the date if she'd just come to me and spoken like I'm a human being. This is the issue I've always had with her. No questions, no clarity, just chooses to blow up and then pretend like we're all supposed to smile and be happy about it and I just don't want to put up with that any more—Especially since this time, my fiance was dragged into it.", "I had my date then picked my venue. It does work in reverse depending on the time of year", "It wasn't intentional. We chose that time of year for specific reasons such as budget, weather, etc. We live on an island and it's the best time to have a wedding.", "No. That's not what happened.", "It was actually a tentative date. Sorry if that wasn't made clear but I stated this in the post and I also told her this as well. Various factors helped narrow it down such as availability, budget, etc. so I really wasn't trying to \"test\" or antagonize anyone. Even so, it was still a tentative date and we were open to changing it. We were looking at venues long and other factors way before she decided to take over that aspect of it, so it's not like we just randomly chose the date.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA. Not standing up for yourself or your partner could obviously become a serious irritant in your marriage. Behavior you might unconsciously minimize bc you're so used to it (\"That was bad\" vs \"That was horrific\") may be seen more clearly by your partner.\n\nDemand to be treated as an intelligent, independent adult for your marriage's sake. Good luck!", "This is how my mothers house was with my step-father. I thanked God every day that I didn't live with them full time. \n\nYou have to stand up to a bully. Step dad finally learned that I wouldn't put up with his shit, and he didn't pull it on me, he knew I would go NC with him and my mom, and fortunately mom wouldn't let him cause that. But he still bullied everyone else.", "Then take all the planning and what comes with that back asap.\nShe took this away because she didn’t like your ideas for venues, who does she think she is… the bride?\nNah,, that’s your fiancé.. and you and her need to figure out what is right for you guys…\nTell your father that from now on your going to do what is right for your micro family, and if that means Ava isn’t happy then so be it..\nYou already told her the date isn’t set in stone, so she reacted way out of line…\nDon’t budge for her. Only for your own comfort if needed be.\nI hoop your planning will be smooth from now on, and do not include Ava in anything, just tell after the fact/booking (if you want to) what you’ve planned..", "That’s abuse. Stop her cycle of abuse by NOT doing what she demands and make conditions of her behavior just to get an invite. If she doesn’t quit her horrible behavior, cut her out of your life completely for the rest of her life!", "Thank you for clearing that up, I understand it a bit better now. \n\nStill NTA and I'd exclude her from any wedding planning from here on out, set boundaries and don't move those no matter how bad she gets. If she keeps causing issues I'd talk to both her and your dad, make clear you want a drama free wedding and if they (stepmom) can't guarantee to be on their best behavior, they won't be invited.", "Yeah sure.", "Why that particular week? Are there reasons yiu couldn't do it a different summer day?", "NTA. For goodness sake my husband and I got married **ON** his step moms birthday!! She was **THRILLED** to help with everything, and share the day. \n\nWe even made sure to ask if it was alright to use the date. She phrased it \"I couldn't be happier to share such an important day with some of the most important people in my life\". We even included a little happy birthday celebration during the reception for her.\n\nYou guys aren't even asking for the actual day of her birthday, but the day after. It has zero significance to anyone but her, and that makes it a **her problem not a you problem**. Sucks your dad is such a doormat over it, but honestly I don't see these relationships worth keeping if you're all supposed to just let step mom steamroll everyone. \n\nPlan whatever wedding you want and fully enjoy yourselves, it's for you guys and not anyone else! Best wishes 🌟", "ESH - obviously the stepmother for the way she is acting.\n\nYou seem thought, to have chosen a date you know she’s normally travelling, so that seems kind of mean and deliberate. It also seems quite a random date, not special or meaningful to you (as you would mention that), to be worth insisting on. You say it’s tentative but then refuse to even consider changing it when you know it doesn’t work for her. You haven’t even got your venue yet, what if you find the perfect place but it can’t fit you in the day you want? You’d surely change the date pretty quickly then to when they could fit you in? \n\nIt’s all very much you hating your stepmother and not really about the date.\n\nThen you write a Facebook post about it???\n\nYou are quite a big ah here too.", "Y T  A  for doing to your fiance what your father did to you - normalizing Ava's abusive ways and making excuses for her, instead of standing up for yourself and for the person you love. Remove Ava from all communications, grow up and go choose your own venue. If she has other plans on your wedding day, fine. Talk to your fiance and together, plan the wedding you BOTH want to have. And never choose the bullshit road of \"keeping the peace\" with a terrorist, over protecting yourself, your spouse and your peace. You knew better and you still chose to allow Ava to center herself in your wedding. Apologize to your fiance and never do that again.\n\nNTA.", "I'm all for eloping. Spend the money on a great vacation and have small party or bbq when you get back. My bff just dropped like 20k on a huge wedding, a few months later and she wishes she wouldn't have. NTA and whatever you decide, don't worry about your stepmom. Do what's best for you guys.", "NTA. In addition to what other posters have said, please start looking for your own venue. Ava sounds like she has no intention of being helpful until she gets everything she wants.", "NTA, Enjoy the wedding you want. You do know that if you invite her to your wedding she will try to make the day all about her?", "NTA but don't post family issues on Facebook. Think about it, it's just trying to support yourselves and it makes everything worse. Work on setting boundaries with firmness and love.", "NTA. The woman is WAY out of line. Weddings (hopefully a once in a lifetime event) trump birthdays (hopefully an event that runs into the 80s....). Your father is wrong for backing her on this. Family, no matter how close, do not get veto power on what day a couple decide to get married. Stick to your guns on this one.", "NTA but stop giving a shit about other people's opinion. Only yours and your future wife's opinion matter. You will not marry stepmom, so her opinion on the date matters 0%.", "NTA", "NTA I would like to commend you for standing up to your Step Mom, not everything revolves around her. She is used to getting her way and it was time to draw a line in the sand. I hope you don’t change the date and have a venue secured to put a stop to this chaos. Sometimes it is necessary to rip the bandaid off and deal with the problem.", "NTA for not changing the date, but the YTA for posting family business on FB. Why did you have to do that?  I guess the same goes for posting it here.", "NTA. Honestly just elope.", "NTA it is time to stand your ground. Don’t let your step mother bully you into eloping. She can attend your wedding or travel for her birthday. That is her choice. It sounds like the wedding would be more pleasant without her.", "NTA, no.\n\nShe sounds like a petulant child.", "NTA - you need to get a spine", "do not change your wedding date. do not put up with her abusive behaviour. do not put up with her flying monkeys.\n\nNTA\n\ngo no contact and live in peace. you have to protect your spouse now.", "NTA. What a dumb thing to get upset about. My wedding was the day after my MIL's birthday, and the day before my dad's. Guess what? Neither of them cared, because they're adults who love my husband and me, and were incredibly happy about our wedding. Your dad needs to grow a spine and stop making excuses for his wife's terrible manners and rude behaviours.", "NTA if the date is that big of an issue for her she can just simply choose to not attend. And as for the invite, if it were me she wouldn't be receiving a formal one until my fiance and I had gotten a serious heart felt apology along with a plan of action as to how she planned to mitigate outbursts like that in the future.", "NTA\n\nYour wedding is about YOU, not HER.\n\nAlso, completely unrelated but I can't let this go:\n\n>She's done a lot for me so I didn't want to be ungrateful.\n\n&#x200B;\n\nOk, she did stuff for you as a kid? Thats called parenting. Which you need not be \"grateful\" for as adults are supposed to take care of kids in their life. Also, she doesn't sound like the kind of person who \"did stuff\" for other people. She does it to maintain her image. Please stop with this mindset.", "Learned early in life to not give control of tasks to others. Handle your own wedding details and send invitations. They can accept or decline.", "Husband needs to start standing up for his wife more, or your marriage will fail before it even begins. HELP HER!", "Welcome to Wedding Planning 101:\n\nYou can't set a wedding date until you decide on a venue.  End of lesson one.\n\nYou may want to get married in the summer but working with the dates that the venues are available will limit the exact date most of the time.  And if you are are just now working on finding a venue for next summer--good luck.\n\n&#x200B;\n\nLesson 2:  YOU and your fiancé need to decide on a venue.  It sets the tone for the entire wedding.  The whole thing. This is NOT something that you pass off to some one else to do for you.\n\nSummary:  You need to find your venue and then finalize your date.  If it ends up around step mom's birthday then tough cookies for her.", "NTA. An elopement sounds so nice and stress free.", "Why not just plan the wedding you want and tell Ava she's not invited.  Doesn't sound like much of a relationship anyway. No is a complete sentence remember.", "NTA it’s your wedding and you have it on the date you want.", "NTA, her behavior is so inappropriate. Consider excluding her from the wedding if it's such an issue, and let your dad know that he always puts her first, and on your wedding, he needs to put you first.", "NTA\n\nHer approach is very unpleasant. As for the wedding , do what you want. But if it is just to avoid conflict with her my advice is don't elope.", "Step Mom does not need to change her plans at all.  Tell her to go ahead with her trip. The wedding will be peaceful without her.", "NTA\n\nIf you really want to make her pissed, have a backyard wedding on her birthday and don't invite her. Normally this is in bad taste but I think it could be forgiven this once considering the circumstances.", "YTA frankly, I think you set the date knowing it would be an issue. Yes, it’s your wedding and you can set any date you want, but setting it on or immediately around an immediate family’s birthday is an A-hole move. It’s telling to me that you pretty much say that on thus occasion you thought it could be your way. Your side is also the one who got into FB to mudsling.", "NTA. Don't let others impact your happiness. They win, as usual.\n\nMove on with your planning. If they wish to be part of it, they will come around. If not, they made their informed decision. \n\nThis is the best way to deal with a bully and their enabler. If, your father wishes to continue to enable a bully, let him enjoy his choice. Because, it is his choice, make no mistake about it. Wife/mother/aunt/uncle/whatever, does not control people. The people who let them do it is who is to blame. For whatever reason, money/sex/inheritance, whatever.\n\nBe firm and let them know this is what it is and you would welcome their input, or not. It will be their choice, as the planning of your wedding is your choices.\n\nGood luck and good luck with resetting your family dynamic. Better later than never. Your future spouse deserves the best from you.", "NTA- I’m a shit-stirrer so I’d be petty and match her energy. Id stomp my foot and say, “you’re not my REAL mom!” And then stomp away. Liked wtf is this grown ass woman doing throwing a tantrum? Haha", "You need to read the ROCK THE BOAT ESSAY. It describes your family dynamic:\n\nhttps://www.reddit.com/r/JUSTNOMIL/s/PwG8t4RtHW", "Nta. She's an abuser. Don't capitulate.", "NTA…and stop asking for your step moms involvement, now!  Make your plans, send her an invite, and if she comes, she comes.  If not, so much the better, right?", "NTA. Why put up with Ava's bad behavior? Do good by yourself and have your wedding with or without Ava's support. If your father continues to support his wife's bad behavior then go low contact with him too. He is more interested in being Ava's squeeze than being a good father to you.", "This is me. But as I have aged, the exact day my birthday is celebrated is not a huge deal.  She needs to get over herself.", "NTA.  Time to go no contact with Ava and low contact with Dad.  Also I would not under any circumstances let Ava near any future kids.", "You are definitely not the AH. In my opinion, there is something super weird about adults obsessing over their birthday! Also, why can’t her travel plans be the week before or after the wedding? Or maybe plan something for the following year instead? \n\nGetting married is a once in a lifetime thing, and it’s not like it’s actually ON her birthday. I think she can get over it!", "NTA  \nOP im afraid your have put up with so much bullying all this time that by this point you have naturalized and became numb.  \nDont give in, dont change your plans.  \nYou are free to uninvite her since most likely she will try to sabotage your wedding at this point.  \nAnd your father is an idiot for not standing up for his own son.", "NTA.  Your wedding, your date.  She can either come or not come.  Assuming she is still invited, but I wouldn't blame you if she's not.", "NTA. I like your last sentence: \n\n>...at this point, we both want to just take all our money and elope then travel—away from the drama.\n\n Just do it! The more I read about weddings on reddit the more I despair and the more that elopement seems like a totally brilliant idea: costs a lot less for one thing.  All the unnecessary drama. If you elope it will still cause drama but it's clear that all choices lead to DRAMA!!! All the family stuff with someone only wanting to be there if their specific demand is met (no exes even if they're best mates with the bride or groom, wearing white or black or whatever, bringing their emotional support rescue leopard, bringing their unruly six year old who is guaranteed to smash the place up whilst parent does SFA, wrong date because they'll be on holiday and it's \"disrespectful\" to family - think I've covered most of the usual problems).\n\nAnyway, whatever your decision have a fabulous wedding and ignore all the unnecessary bs.", "NTA.", "NTA. Why are you catering to this tiresome, whiny person? She’s not good company? What value does she add to your life? If you’re lucky, she won’t come. Maybe if you’re extremely lucky, she’ll never talk to you again. Maybe hope for that?", "NTA.   Tell Ava that you wouldn't dream of interfering with her vacation plans, so you won't be inviting her.", "When you are ready for a family, please try to plan the pregnancy so the due date is in her birthday month. Your adorable little one can upstage her every year.", "NTA plan the wedding yourself and leave Ava out of all planning.  If she and your spineless father choose not to attend - that is their loss.", "Just one thing to consider, and I don’t say this in any way because I think you should acquiesce to your stepmom’s selfish demands — but if you plan to continue having an involved relationship with this part of your family, and you & your partner are people who celebrate anniversaries and your family also frequently celebrated birthdays together, having your wedding anniversary that close to Ava’s birthday will cause you many years of frustration and conflict in the future. (Ask me how I know…) You shouldn’t have to make any adjustments to the plan that you want, and you don’t. But based on her past & current behavior, you can likely expect this to be an annual frustration unless you follow the more aggressive (but totally appropriate) advice elsewhere in this thread and dramatically change your behavior & relationship with your dad and stepmother moving forward.", "Nahhhh, tell her she’s right, you should change the date. Then move it one day back, to her actual birthday.", "NTA. But stand up for your wife dude. Also, seriously what's with the american family drama and facebook?", "NTA. Your wedding, your decision. The date of the wedding is not even on Ava's birthday, it is the day after. She seems to be very dramatic, controlling and entitled. Your dad has a great opportunity here to actually have a serious talk with her. She could also go on a trip alone with some girlfriends if that is so important. I believe you would be just as happy to have just your dad there without her.\n\nStay strong and united with your fiancé on this.!", "NTA.   Have the wedding on the day that you choose.  Tell Ava and your father that you as an adult now will no longer tolerate her bullying and disrespectful behavior and expect an apology from her if she wants to attend the wedding.", "Choose your own venue too. Nta", "She doesn’t even have to change them very much, they could leave the day after the wedding on a trip or the weekend after. If you can’t budge your plans that much for one year for something big like this MIL is the asshole.", "I want to know why and how Ava became the “great and powerful OZ”?????", "Lol I mean honestly, we thought it was discrete because she didn't mention any names and was vague about what happened. But I guess you're right.", "There isn’t a way to make a discreet post about a family drama, OP. Even without naming names or being vague it’s just drama-creating. One thing to text friends about it and another to air your dirty laundry. It’s still dirty laundry even if we can tell what color the drawers are.", "This is facts. I couldn't agree with you more. This is probably the hardest decision I've had to make but when will it end if I don't put my foot down? Honestly, if I didn't have so many people in my corner, including my fiance, I don't think I'd have had the strength but I know I'm doing the right thing in standing firm this time.", "This^ this^ says it all so perfectly. Should be a top comment.", "Traveling wasn't a thing that was going on for many years. It used to just be parties at their house or a nice venue. Maybe even a hotel trip because we live on an island with really nice villas and hotels. They only recently started doing this (for her birthday only) and it's only been for the last 3 birthdays. So, in my mind (maybe I'm a bit naive) I just really didn't assume that the traveling was a sure thing. \n\nEspecially since when they travel, they've actually never shared their plans with me. I either find out through casual convos with my little brother or I just happen to be at their house close to the date and they may ask me for a ride to the airport. So in my mind, it didn't really cement that this would be an absolute, sure thing every year. Especially since this is next year and they haven't even started planning yet.", "Honestly, I didn't agree with my fiance for making the post either and I told her this. I am not one to share things online. But she likes to share her experiences with different things. She may not share every little thing, but if she gets a takeaway or lesson from it, she may post about it. She asked me if I wanted to take it down and I told her no. \n\nIt took her every fiber of her being to not go off on Ava during the moment and she bottles up her thoughts for my sake (and to an extent, my dad's sake). She's had to sit through a lot of bs regarding her throughout the years of our relationship and I think she'd had it at that point. So I say, let her express herself if that's how she chooses to do it. Even if I don't agree.", "Actually, I did say I was open to changing the date (last couple of lines of the post). After all, it's tentative. I just didn't appreciate the way she went about it. I never liked her approach, even as a child. I've had to deal with that for a long time where she'd just bully me to get what she wanted. This isn't even the first time she's kicked me out over something small like this—I've had to deal with that multiple times back when I lived there. It was as if she hung the house over my head and I just didn't feel like she should've gotten away with it this time.\n\nWe chose a date that was convenient for not just myself and my fiance, but also most friends and family. It also worked out cost-wise and it was one of the dates that was available for the venues since we actually started looking for venues way before she stepped in. She chose to take over the venue after she saw one of our options and deemed it \"not worthy\". And honestly, I feel like the only reason she did that was because she wanted me to deal with something at her office while she was traveling. She called when we were on our way to visit a site that was about 1.5 hours away and she insisted I turn back because \"The venue is trash\" and that \"She'll deal with the venue\". This is literally how she volunteered. And no, this isn't the first time she's popped up with a favor and insisted a change up my schedule to suit her needs.", "Thanks. I know better now and I'm working on setting boundaries and speaking up more. All this time, I thought I was doing myself and my family a favor by just being passive and letting everything slide. I also thought that, because I moved out, then I was somehow out of the line of fire.", "I accidentally chose the day before my MIL's birthday for my wedding day. My wife is super ADD and doesn't remember dates so she didn't catch it. My MIL and other family members obviously noticed but they asked (once) why we chose that date, we explained the very tight Venn-diagram of scheduling conflicts that led to that conclusion, then nobody made any fuss about it. I didn't even find out until the morning after our wedding when my MIL actually planned a brunch for the families, we had all eaten, everyone sat there while we opened our wedding gifts, things were winding down, then at the very end of the event her brothers brought out a cake for her and we sang happy birthday and had some cake. \n\nThere are ways to handle situations like this with grace while assuming good will on everyone's parts. Your stepmother's reaction is not normal and should not be normalized. NTA", "sounds like you've both had more than enough!", "I thought of that too. My fiance and I do that for them whenever they need us to be somewhere, so I felt like we had that whole \"mutual family understanding\" with each other. I feel like it's just what family does for each other.", "This! Even when we have done holidays to celebrate milestone birthdays we've often not been away on the day itself. It can still be a birthday trip even if it's slightly early or late this year.", "I'm a stepmom, and I cannot conceive of centering myself so blatantly in my stepdaughter's (or anyone's) life. I can be a pill at times, but I recognize that issues I have are mine to work through. My husband would never stand for me letting my own issues affect the entire household or his daughter's life in such a way. Nta. Your fiance is your family now, and your dad and Ava can accept the world doesn't revolve around them or not.", "So the whole family is walking on eggshells around a person who can’t control their emotions? I mean, your fiancé seems to understand that Ava is abusive, and I think that it’s time everyone else wised up to to too.", "NTA Send the date, time and venue. You two shouldn’t have added stress to planning a wedding.", "My theory (and this is just what I've learned in college from studied psych) is that she's let her success get to her head. When they met, she was a broke med student from another country and it was my family who helped her pursue her dreams and become a big success. \n\nMy dad and family didn't have much, but she always had our support. And this was support that her own family never gave her, especially her mother, who is basically a steroid version of her (yet they ask her for the most). Now that she's a big success, I think my family \"bows\" to her. They never go against her and I think it makes her feel like she can overstep with no consequences.", "I think you can write a pretty vague FB post but with someone as ego centric as your step mom or in really specific cases (such as a wedding) people will figure out who is who. AITA is good for anonymity although people can be a bit harsh.", "I understand what you're saying. I initially didn't know about the post (and I honestly didn't agree with it either) but I get that she wanted to share her experience. She says she's learned a lot from other people sharing their own, and so she didn't see an issue with it. Plus, she just wanted to express how she felt. Truth be told, she initially wanted to call them and give them a piece of her mind, but I just didn't want to deal with it. During that whole humiliating moment, she also wanted to speak up to her but she didn't want to disrespect her in her house.\n\nMy fiance can be brutally honest. She wears her heart on her sleeve and it kills her to bottle up her feelings. Even if she's silent, you can still tell she's upset no matter how hard she tries to hide it. She's seen a lot of her behavior over the past 7+ years and tried to play the whole game like the rest of the family, but it was hard for her.\n\nAva can't handle being told that she's wrong because no one in the family ever holds her accountable so I always kept my mouth shut, especially as a kid. Sometimes a small rebuttal from me would set her off and my dad or friends had to come in front of her. I feel like I've asked my fiance for enough in trying to smile and just overlook everything so I left the post thing alone. And honestly, if the shoe were on the other foot, I can't tell you that I would've been this tolerant if her family did this to us.", "Okay but you didn't answer the main question. Why do you want this specific date, especially when you haven't even reserved a venue yet? Either the date has special meaning to you (which is great, go for it, and Ava can suck it up), but if that's not the case, you should first figure out the venue you want and *then* determine a specific date, because venues aren't available 24/7, and if it's a popular wedding venue there's a good chance it's already mostly reserved less than a year in advance. So you won't have that much choice when it comes to the date.\n\nLike I'm not saying Ava isn't overreacting, she's definitely got a stick up her arse, but why are you so hellbent on this date?", "I'm sure you've figured it out by now but for the love of God don't let her handle ANYTHING in regards to the wedding because I'd bet money she'd intentionally screw it up.  NTA and your stepmom is unhinged.", "Are you really this oblivious to how much more dramatic your fiance is with her bottle it up than air dirty laundry on social media approach?\n\nIt sounds like you are congratulating yourselves on your restraint in not dealing with Ava head on. You both are also at fault and they deserve an apology as 2 wrongs don't make a right.", "Given your history with Ava, why would you trust her with securing your wedding venue?", "I completely understand. You were being helpful in your own way. They now seem entitled to that, when in fact they are not.   \n\n\nI'm sorry she's pulling this shit on you.   \n\n\nI hope you find a way to enjoy your wedding.", "That was very classy of your MIL. My MIL would have been chill about it too but would have told me when her bday was at least lol.", "Thanks, I appreciate you sharing your own experience—It's so relatable because, initially, we really weren't thinking about her birthday. It was just so many different factors (cost, weather, etc.) and they all just tied into us wanting a summer wedding, along with advice from coordinators and venue owners. But all things considered, we were still open to changes regardless. My thing is, whenever they have anything, me and my fiance are never above switching up our plans, sometimes without even thinking. \n\nRescheduling company meetings, dinner dates, flights, etc. and I guess I just thought that because we're all family and we always talked about being there for each other, it wouldn't be an issue for them. 1. They only recently started traveling on her birthday (like the last 3 birthdays) and 2. I am never in the loop about their travel plans anyway unless I happen to be at their house when they're packing or my little brother casually mentions it, so it was just the furthest thing from our minds when choosing the date. \n\nNo malicious intent. I even tried to explain this to her in the midst of her running us out, but she literally cut me off and screamed at us to get out. I just want the respect, is all. I wouldn't even have a problem changing the date if she'd just came to us in a civilized manner.", "By success, do you mean her income? Does she have power because she controls the household funds?", "Sorry. We're honestly not hellbent on the date. Yes we could've chosen a different date but that specific day came about because of budget reasons, availability for some of the venues we already found (pre-Ava offering to take over the venue search), weather, etc. Plus, we prefer an \"end of month\" kind of date for most things we're doing as we feel like that will give us adequate time to prepare if it's later in the month. But in all honestly, if she'd just came and asked us to change the date, we would have. I just don't want to accept her going about things like this anymore. If I don't put a stop to it now, who knows how she'll overstep next?", "No. It's not that at all.", "I'd like to know the answer to that too. Also puzzled about why a 29 year old man would cancel appointments to see venues just because his Stepmother doesn't like one of them. What does it matter what Stepmother wants when she isn't the one getting married there. I would have told her to sling her hook months/years ago.", "Very good question. Fair question, actually. Normally, when she offers to do things, she comes through because a lot of people love her (she's saved quite a few lives in her profession, so people are willing to do anything for her). I also find it hard to tell her no most of the time, because she's really pushy and persistent (To be honest, this is the hardest thing I've done so far because it's hard to tell her no and I usually just apologize and go with what she wants). \n\nPlus, Dad said it meant a lot to them to be involved. When we moved out, prepped for college graduation, etc. he said they felt \"excluded\" from those important things and he wanted us to include them from now on. If I'm being honest, I didn't purposefully exclude them. I just got so used to doing things on my own because it was sometimes like pulling teeth asking them for favors back then. \n\nHe said we went about everything all by ourselves without \"consulting them\" so I just thought I was doing the right thing, I guess (I know it sounds dumb but I just thought it was right at the time). When we moved out, I thought our relationship was better. I didn't fight with them as much, and they were a lot more respectful and included me in stuff more, so I guess I thought things were different.", "When I asked about it later, she just said she didn't want to stress out a bride while planning her wedding. Super classy. \n\nPlus, now we never forget her birthday because it's the day after our anniversary!", "[removed]", "She sounds like she has anger issues.   You can't have a rational conversation with someone who has anger issues while they are actively flipping out.   No matter what you try to placate them with, they will always just escalate the anger.   So usually it is best to let them run you out and then attempt to resume the conversation on a later date.   And if that doesn't work, don't negotiate with terrorists.   Just provide them with the information and dates and let them work it out.", "Yes. For context, she's a doctor. For example, she doesn't ever consult my father when making certain purchases. For instance, he has a problem with almost all of the furniture in the house. Some of them, he specifically told her not to do it and she would nod in agreement and then proceed to buy it anyway behind his. \n\nAlso, her mom is abusive. Whenever she visits, she causes problems for our family, saying derogatory things about our country and spreading lies to their family abroad. No matter how much my dad brings these things to her attention, and attempts to set a boundary, she makes excuses for her or she'll \"attempt\" to stand up to her. I think her mom is her ultimate bully.", "You’re an adult and don’t need to consult with your parents. (They don’t want inclusion anyway — they want control.)\n\nIt’s time to draw some firm boundaries — if not for you, but for your partner. Don’t let your father re-direct to “inclusion” or social media posts. *The problem is Ava.* Until her behavior changes, you’re going LC with both of them.\n\nI would also ask yourself why Ava’s theatrics matter to you. Why do you care if she’s pushy & persistent? Just say “No.” Her emotional outbursts don’t need to be your problem unless you *allow* them to be.\n\nThis is bonkers. Your poor fiancée.", "Your MIL was pretty graceful about this. That's awesome.", "That's what I figured her reasoning was. What a great MIL! And yeah, easy way to remember to celebrate her from now on.", "Did you maybe comment in the wrong place? I was replying to the user above whose MIL's bday was the day after their wedding. We weren't discussing the FB part at all (though I agree people shouldn't share their drama on SM like that).", "NTA I understand you've become conditioned to this my own mother used to scream like a banshee but at some point you've got to stand up to her. The fact everyone just tolerates it is a bullshit excuse. Uninvite her and your dad to the wedding. She's using this because it works and she doesn't face consequences and they both need to face them", "Your step-mother doesn't approve, everyone else seems fine.\n\nHave your wedding the way you want it. If Ava decides not to come, it sounds like a win-win!\n\nNTA", "YTA for sweeping this behavior under the rug and subjecting your fiancé to it.. Grow a spine, you are almost 30 and a grown ass man. Make some damn decisions for yourself and pick a wedding venue yourself", "NTA but if you know someone is demanding, aggressive, and mean, maybe don't involve them in planning your wedding. Have the wedding you can afford, without their help, so all the decisions are yours and yours alone.  \nYour expectation that they'd made an exception is totally reasonable, but not going to happen.  Congrats on the wedding, best wishes!", "Absolutely NTA.  \nIt's unfortunate that instead of a conversation Ava went nuclear, now you can't change the date even if you were previously willing to.", "NTA. But maybe air out the family drama in a journal or with a best friend over a bottle of wine and a brick of cheese next time and keep it off social media. It never helps the situation and reads as immature no matter who ends up being right.", "NTA - \n\nIt is your wedding.  She can forgo a birthday trip for one year.  Or not.  You are better off without her there.", "NTA. It’s your day not hers and well done for backing up your fiancée. If and when my girls get married, they can get married ON my summer birthday if they want - my time has passed.", "NTA!!!\n\n\nThey* are not your parents! Your dad is your parent .. Ava is just his bully of a wife. She has no say.! She should have no say!!. And the bully should finally learn to sit and be quiet! Please stop being an AH to yourself and your fiance, and putting up with her and her abusive behaviour. You are grown now. You no longer  need to feel reliant on their acceptance or care. Which is good, because she clearly doesn't.\n Your wedding is yours. Remove your father's wife from all control or participation and treat her like the +1 she is. And if your father wants to keep picking his +1 over you, then disinvite them both.\n Yes not having your dad there may hurt a little, but  do you really want sulky mcsulkster there to throw a fit and be rude to your other guests and you on your own wedding day? You and your fiance deserve more!!! And your father is a fool for allowing this behaviour to continue for so long... She's nothing but the +1 as far as I'm concerned. Yeah maybe she had a few kind moments in your life and helped you here and there. But overall from what you have said her behaviour is controlling and abusive and you sound like someone who grew up in an abusive home (from your comment having to walk on eggshells ,so she wouldn't go off/ ) is this the life you want to live??? If you ever have kids , do you really want them to learn to be quiet so Ava doesn't get mad at them? To see this behaviour from her and think it's acceptable? For them* to become quiet and jump when she says ? Be strong! Be brave!! You deserve better!! 🌻", "NTA\n\nPart of being a good partner to fiance (and kind to yourself) means not enabling bullying. Don't worry about being ungrateful. Nobody should be able to buy their way into bullying you or your partner.", "NTA. Elope.", "NTA\n\nIf I were you, I would let your father and your stepmother know that this wedding (much like the world) is not about them. And it's not even about you.\n\nSeems like your stepmother must've missed a few days in Kindergarten. You know...the days we all learned that everything doesn't revolve around us and that taking turns is essential.\n\n&#x200B;\n\nThat being said, your fiancée went overboard by making that Facebook post. There's no such thing as a discrete Facebook post about another family member during the wedding planning process. I hope you can see that now given that your dad is calling you about a post your fiancée made; it clearly wasn't that ambiguous. If he didn't see it for himself, someone else did and said something about it.\n\nEmbarrassing. You have got to get her to understand that if she is going to do stuff like this in the future (she absolutely shouldn't but I digress), then she has to be a lot more careful. That stuff will prove to be more disruptive than having to tiptoe around Ava.", "NTA.   Have whatever wedding you really want, just don't invite Dad or Stepmom", "NTA. It is your wedding date not theirs. You get to decide not them.", "Days after her birthday, and she wants to criticize your choice of wedding days? Does her birthday celebration last all month? I have read that it does for some people. NTA!", "well shes being uninvited its the best for everyone, she can travel and you guys can have the peace of mind of her not trying to hijack the weeding with some shenanigans", "[removed]", "NTA. But seriously consider the eloping thing. Traveling is good for the mind and soul. You mill make more memories than just one day that will likely get spoiled by Cruella deAva.", "ESH. YTA for choosing someone’s birthday as your weddings date. You literally could have chosen the weekend before or after.\n\nYou stepmother sucks for being so rude, but she is right for being upset, especially because for the rest of your life you would never be able to celebrate her bday because it’s your damn wedding anniversary.", "NTA. Birthdays can be celebrated during other days/weeks/months. If you are planning anything other than a very tiny affair, birthdays simply don’t factor into the date choice. That being said, it’s wise to keep conflicts off of social media.", "NTA. Set boundaries now.  We got married the day before my MIL birthday because it worked for most everyone. She has made it a problem every year. She whines that her son won't be with her on her birthday. The first year, I caved, and we drove out of state to visit them for the weekend. The second year, she booked Taylor Swift concerts on the day of our anniversary in Nashville, for just herself and my husband. Neither of us are anywhere close to Nashville. My husband said absolutely not, and he will not be going out of our way to see her every single year for her birthday. She threw a fit but you have to stick to your boundaries.", "NTA\n\nIt’s time to tell Ava her help is no longer needed and her presence is no longer wanted.", "NTA\n\nDon't change your wedding date.   If you do you will be expected to bow down to your step mother for everything from now on.", "NTA\n\nYou need to stand up for your wife and have her back.  Posting on FB wasn't the smartest move because everyone could work out who she was talking about.\n\nMy suggestion would actually be to elope and then you wouldn't have this drama with your stepmother which is what it sounds like you'd like to do.\n\nHow does your fiance feel about doing that because that would solve the majority of your wedding issues and will probably be a lot cheaper?  \n\nYour other option is just a registry wedding and then invite your closest family and friends out to dinner to celebrate.  Or just throw a BBQ in your backyard and organise a celebrant and 'Surprise... you've all made it hear to witness our marriage vows.'  No expectations from anyone (ie what they need to wear to the wedding) and so much cheaper.", "NTA. I'd move the date slightly forward. So she can travel.", "NTA I guess and your stepmother is being awful, but why *have* you chosen the day after her birthday? If there's a particular reason it works best or is an important date for you guys then that comes before your stepmom's birthday, but if you're kinda just picking it out a hat maybe you should've picked a different date?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "If your SO posted this, everyone would point out she has a husband problem. You need to stand up for your new family. Your future wife is done with the placating when that day should be about the 2 of you, not the step mil.\n\nIf the wedding you want is an elopement, then do ot. If you want a typical wedding, do that. Do not live your lives to make this bully happy.", "If they complain, say that you insist, and that's \"just how you are\" about the wedding.", ">How she even ended up volunteering to get the venue, is because she didn't like one of our selections so she literally just stepped in and said she'd handle it.\n\nTake this task back. You're adults, it's your wedding, there's zero reason why your stepmother has to completely take charge of one of the most important planning decisions you have to make. If she needs to help so desperately she can do stuff like make appointments to view venues but it's wild to allow her to swoop in and actually take over the whole selection process.", "If it was a tentative date why can't you change it to not be so close to her birthday? My friends all attended a wedding on my birthday this year and it really felt shitty even though I had no right to be upset", "My wife was born on Christmas so every year it's like a double celebration. After we got engaged, we joked that obviously our wedding date shouldn't be around that time. Fast forward, similar to the scheduling/etc we got married on December 28th haha. We laugh about it all the time. Oh well lol.", "Ava has been selfish the whole time you have known her, why would you think she would change now? \"When a person shows you who they are... Believe them!*\"", "ESH. \n\nDude, I’m sorry, but your fiancée sounds as obnoxious as your stepmom. “Brutally honest” is usually how rude people describe themselves to excuse their rudeness. And instead of calling your dad and stepmom to directly communicate her feelings, she shared a dramatic, passive-aggressive Facebook post. She should’ve complained to her friends, not aired out drama with her future in-laws on social media. “Just wanted to express herself”….good god. Ava also sounds exhausting. She’s a middle aged woman who’s that concerned about her birthday? She can travel the week after. Your fiancée and your stepmom are BOTH grown-ass women who are acting like children.", "I'm guessing she doesn't have a lot of emotional regulating skills and so everyone compensates by just giving her what she wants instead of dealing with her wrath. OP needs to stop worrying about [rocking the boat.](https://www.reddit.com/r/JUSTNOMIL/comments/77pxpo/dont_rock_the_boat/) SM is the boat rocker. Let her deal with the consequences of her behavior.", "Elope and travel. There is your answer. If Ava feels so strongly she can throw you a party of her design when you return.", "NTA, but my GOD Ava certainly is. Seriously, you need to put your foot down with your dad and let him know you will NOT tolerate her drama and BS. This day is about you and your spouse. If she can't act like anything other than a butthurt whiney child, then tell her that her invitation has been revoked and have a wonderful day without her.  \nSide note:My wedding was the same day as my BIL's bday. We asked if he minded, and when he said no, we made sure to get him a bday cake and sing happy birthday during the reception. But if Ava was my family, I so would not have had her there or done anything for her if she acted like this.", "NTA that would be your stepmom.  Keep the wedding date and select a venue without her help. I would also password protect the venue, catering, flowers and photographer", "Cut her out of your wedding plans ASAP. NTA but stand up for your fiancée and yourself quick. Wedding planning is hard enough as it is and you deserve kindness and peace where you can get it.", "NTA, but in my universe, wedding dates are ultimately driven by venue availability. That is because desirable venues are often booked up on summer Saturdays years in advance). So, you can’t set a date until you zero in on a venue and check the dates they can offer you.", "Look", "Thanks, I'll go look for it right now.", "Oh yes. Same with me and my mother and father. My mother's the same as AVA.\n\nStrangely, she only has power if you give her any.\n\nSadly though, you'll have to cut the enabler out too, if you want to get rid of her. Because without it he won't wake up - but be prepared that he may not wake up at all. He might decide he'll pick the devil he knows, because he cannot divorce and stay alone, or be without the angry, abusive woman he can blame for everything. (Heaven forbid he'll have to manage his own life, right?)\n\nBest of luck to you whatever you choose, and hold onto your lovely fiance, she has a nice, shiny backbone.", "Something is happening every day of the year. She could travel before her birthday or after your wedding. She just wants her way.", "Nope. My fiance is neither rude nor obnoxious—certainly nothing like my stepmom.  It's just that she hates the whole dynamic of everyone walking on eggshells with one person and having to sit back and sweep things under the rug when she keeps up her bs. I can't blame her for that. She's not used to having to deal with that sort of thing.\n\nUnderstand that outside of this post, she's never complained to any of them about anything and she's gone against how she felt just to keep the peace because I've asked her to. I don't think that makes her \"obnoxious\".", "Let your fiancée speak up from now on. Ava is a narcissist monster. Would it really bug you to never see her again?"]}