{"id": 30047, "submission_id": "17kp9gj", "title": "AITA for not helping my brother pay for an engagement ring, when I got our Grandma's for free?", "selftext": "For some context, I married my wife, almost right out of college at age 22. A lot of people said I was rushing things but we didnt care. My grandma loved my gf at the time, now wife and she knew I was a broke college kid so she offered me her old engagement ring to give to her. It was an amazing surprise, she and my grandpa were married 50 years before he passed away and I love having the ring be a part of my marriage as well. Its not important to me but for context its a very nice ring that new would probably we more than 10k. She unfortunately passed 2 years ago.\n\nIts been 7 years and now my brother I'll call Charlie (31M) who has been with his gf for 6 years wants to propose. He unfortunately has been hit by a layoff this year so money is a little tight for him. He asked me since I got my ring free, if Id go in with him to pay for an engagement ring. I honestly thought that was ridiculous, if he had asked for a loan I may have been open but he just straight up asked for me to pay for part of it. My wife and I are fortunate to both have good jobs, but we have a kid now and are trying for another so we are not big spenders. His gf has a good job but for obvious reasons, he doesnt want to ask her to pay for her own engagement ring.\n\nI personally think he should just pay for the ring he can afford and if she wants to at a later time in life upgrade it when their finances are better. He's telling me Im being an AH who lucked out with a free ring and saying Im being selfish by not at least helping. I feel like thats a little ridiculous but when i was telling my coworker about it, he said he understand Charlies point and that I did luck out.\n\nEdited to fix typos but will happily answer relevant questions.", "created_utc": 1698770264, "permalink": "/r/AmItheAsshole/comments/17kp9gj/aita_for_not_helping_my_brother_pay_for_an/", "score": 489, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be the AH by not helping my brother pay for a ring when I got our grandmother's for free.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYour grandma's property was hers to give. I only presume she left a will that your brother was part of, at whatever level grandma was able to and considered prudent. He's not an asshole for asking, but he does have to accept your No. Given that our society is individualistic he shouldn't really expect help from his family like that. If we had a more communal society where we took care of each other and shared our bounties with each other, then maybe, but we don't live like that.", "NTA. Unfortunately this is one of those situations where timing in life did not play out to treat you and your sibling with an exact equal result. But it’s not your job to even out your grandmother’s gift to you. It sounds like your grandmother’s connection to your now-wife was a factor in her decision.\n\nYou’re correct than your brother should save up and buy a ring within his means. \n\nIt’s still about the sentiment and thought that counts, not about the value. \n\nI would have said there were no AHs if he had simply asked and accepted your “no” with grace, but his calling you ‘selfish’ puts this solidly in the NTA for me. You have your own expenses.", "NTA\n\nYour Grandma giving you her ring wasnt something you asked for, and was a gift from her heart. It also doesnt mean you 'owe' your brother anything for having been given that gift. \n\nIf your brother cant afford the ring he wants for his fiance, then it doesnt mean you are required to pay for half of it, by virtue of having been given a gift SEVEN years previously.", "NTA to say no.\n\nWhether you lucked out or not, that doesn't put you on the hook for your brother's bad financial situation.  Don't let him guilt trip you into this.", "So if you receive a gift, your have to then pay off anyone else who didn't get the same gift??? Your brother is being ridiculous. NTA.", "Why is bro getting engaged now? What's the rush? It's weird that they've been together for 6 years and he's thinking of proposing now that he's been laid off.\n\nHe's waited 6 years. He can wait until he gets a job and and saves the money. You don't owe him anything. Your grandma died 2 years ago, after he'd been with his gf for 4 years, she had plenty of time to gift him something (like whatever she gave your mum and aunt) but chose not to. It's not your responsibility to make up for it. \n\nNTA. Bro is.\n\nEdited.", "NTA. I’m assuming your grandma was of sound mind when she gifted you the ring so he shouldn’t think he’s entitled to help.", "NTA. He is being entitled. If he can't afford it, he shouldn't buy it. He doesn't sound mature enough for a relationship yet.", "NTA - The ring was a gift to you and your wife. It wasn't some \"lucky handout\" either. Even if you don't see it as sentimental, your grandmother ***definitely*** did. You have no obligation to pay for your brother's ring just because you were gifted one. That's ridiculous to a T. He can go to the bank, make payment plans, etc if it's that important he gets one right away. Or, he can be an adult, and speak with his GF about this. I'd have to think she understands the situation, they could make plans on getting the ring they want at a later date.", "NTA\n\nhe’s trying to “punish” you for getting a free gift. he can \n\na) wait a little longer until he finds a new job and then buy the ring\nb) propose with a cheaper ring and later upgrade it", "Nta, He shouldn’t even be thinking about that with no job. Get yourself together then think about that.", "NTA it’s an odd request and a bit passive aggressive as it hints he may feel since you got one for free you owe him. He could have just asked for a loan. Is it out of character for him?", "NTA\n\n&#x200B;\n\n\" I honestly thought that was ridiculous, \" .. you ARE right, his question IS ridiculous.", "> I feel like thats a little ridiculous but when i was telling my coworker about it, he said he understand Charlies point and that I did luck out.\n\nAnd that how luck goes.  Your brother is a big boy who has to deal with life's frustrations - just like the rest of us adults.  Let his figure it out.  The fact you received a gift doesnt obligate you to buy jewelry for anybody.  Your brother's engagement ring is not your problem.  NTA", "NTA.  If he can afford to be married, he can afford to get engaged.", "NTA.\n\n>an AH who lucked out with a free ring\n\nYour brother is focusing on the wrong thing. What you got is a family heirloom gifted to you and your gf by your gran.\n\nIf he was upset that you got the heirloom instead of him, it would be different - but the fact that he sees it as nothing more than a \"free ring\" makes him the AH here.", "NTA your brother sounds entitled, You don't owe him anything. And if he has no job why is he trying to buy a ring? If you give in next it will be can you pay for my wedding because you got a free ring, can you pay for my honeymoon because free ring..... it will never end.", "NTA… what is with reddits obsession with “fairness” in cases like this. Life isn’t fair. Sometime it is a matter of timing whether something works for one person but fails for another.  Grandma has a relationship with OP’s then gf, this lead to her wanting to give her ring when they wanted to marry. OP’s brother wasn’t getting married or close to it, so why would Grandma think about “fairness” regarding gifting a ring. Some people just don’t think about things like that in the excitement. But this doesn’t make it OP’s responsibility to make it “fair” for his brother.", "NTA - Nothing wrong with him simply asking for help, but setting it up as an obligation because of your grandmother’s ring was lame.", " NTA. The ring was given to you at a different time.  Those who are considering it an inheritance are just not right.  I have some jewelry from my grandmother given to me years before she passed.  That was separate from inheritance which was split evenly.  \n\nYour brother is being entitled (to your money). He needs to purchase a ring he can afford.  I think there is more to his ring story than he is telling you. Maybe he promised a ring greater than he can afford. Maybe he has been saying he has been saving for a ring for years. Maybe her family has certain expectations of what he can afford. Etc.", "NTA - if he can’t pay he shouldn’t propose simple as that. An engagement is a commitment both emotional and financial and if you can’t afford the ring don’t do it.", "If you gave me an engagement ring that your brother paid for, I would say. Is your brother marrying me too? And decline the proposal. \nThere is no point to either of yours engagement rings. None what so ever.\nThis whole thing is messed up. Charlie begrudges you and it won't stop because you bought his fiancé her ring.\nWho does that?\nNTA", "Maybe he shouldnt get engaged while unemployed", "NTA.\n\nWhile it's true that you didn't have to pay for an engagement ring, that doesn't mean you have to help him pay for one. His financial situation sucks, and it might have been okay if he had asked for a loan, with the intention of paying it back, but outright asking for the money and then insulting you and calling you selfish when you don't agree is incredibly rude.\n\nSurely there are places that have payment plans, so he doesn't have to give over a lot of money all at once.", "NTA - this is something he needs to buy his fiancee. \n\nIt isn’t your job to pay for his since your grandmother gifted you her ring.", "NTA. If he can't afford a ring now, maybe he shouldn't propose until he can afford something.", "NTA, but I do see your brother's point.  You didn't have to start with that debt, and your grandmother could have just said, \"well, get what you can afford\" but she didn't.  It is wonderful that you have that beautiful story.  It is sad that there isn't a story like that for your brother.  Imagine how you would feel if he were gifted 10k.  You got nothing.  It just helps.  I am not saying you have to gift him 5k or 10k, but maybe talk to him and see what his thoughts were on what you could contribute?", "NAH. Unless your brother also got an inheritance worth 10k he's just asking if you'll make things fair. It's not a ridiculous question. \n\nIt's not your responsibility, though. If you're comfortable giving him a loan you can offer that, but any time you loan money to family you shouldn't expect to get it back.", "NTA. It is tacky to ask someone else to pay for an engagement ring. If they can't afford the real thing, make do with fake or without. The engagement is not all about the ring.", "NTA. Grandma helped you out when you were just getting started in life at 22. That was her gift to give. You don’t owe your brother anything for grandma’s gift. It’s also a weird timing for your brother to decide to propose with a ring he can’t afford right after being fired. Next he’ll ask you to pay for the wedding because he got fired and you still have a job so you lucked out again.", ">I honestly thought that was ridiculous\n\nAnd you are correct. **NTA**. \n\n&#x200B;\n\n>I personally think he should just pay for the ring he can afford and if she wants to at a later time in life upgrade it when their finances are better. \n\nAlso correct. \n\n&#x200B;\n\n> i was telling my coworker about it, he said he understand Charlies point and that I did luck out.\n\nProblem solved! : Coworker can chip in! Maybe go halfsies?", "NTA.  I have major second hand embarrassment reading this post. Your brother is ridiculous.  I think it’s disgusting when people feel that they are entitled to or owed an inheritance.  The audacity to ask you to help pay for an engagement right.  A grown man trying to eat off your family’s plate?? How pathetic.  Your grandmother chose to give you her ring. That’s the end of it.  You don’t owe him shit.  He needs to get a job and save up to buy a ring.  Ya know like a grown ass man. What’s next? Will he expect you to help pay for the wedding? Contribute the honeymoon?", "NTA. Your grandmother chose to gift one to you, that does not mean that you have to buy rings for others.", "NTA.\n\nYou were gifted the ring by your grandmother while she was alive, and she liked and approved of your then-fiancee.  None of that applies to your brother or his girlfriend, although I suppose they must have met.\n\nYes, you \"lucked out\" but in the end it is no different than if you won $10,000 in the lottery.  How much of that would your brother feel entitled to?", "NTA There is no law that states his girlfriend must be given a ring of equal vale to your wife’s ring. His girlfriend doesn’t need a ring at all to marry him. It does not matter what your brother expects, thinks is fair or wants.", "NTA - but since you did luck out it might be nice to contribute (only if you’re able) and I wouldn’t contribute more than 1k.  UNLESS your brother already got something from your grandma of similar value.   If that was the case then no. Thing don’t have to be equal but if you’re in. Position to help your brother it would probably make your grandma smile (since she was in a position to help you)", "YTA for this...\n\n>I personally think he should just pay for the ring he can afford\n\nYou mean like you did? Oh, right. You were broke and were given a $10,000 ring that you could never have afforded. What's worse is that now that you're in a position to do the same thing for your brother by helping him, you choose not to, and instead tell him he's being ridiculous for asking you to do basically the same thing that your grandmother did for you. Your grandmother would be so proud, if only she could stop rolling in her grave. \n\nIf you gave him $5,000, it would be like you were splitting the ring with him. You'd both walk away from it knowing that your grandmother's gift went to both of you, and both would have an even bigger memory of her. Sadly, you learned nothing from your grandmother's generosity.", "NTA. Did you luck out, sure. Is that your fault or does that mean now you're obligated to help your brother pay for his engagement ring, not at all. If you can afford it and you trust your brother you could offer to lend him some money. But if he's actively asking for anything more than a loan he's just overstepping his bounds.", "NTA - If brother can't afford a ring, then he needs to put it his engagement off until you can. You did luck out with your grandmother's ring but she wanted to give it to you guys. It's not like you took it from her. I don't know why it would be your responsibility to pay for his future fiance's ring.", "ESH. \n\nCharlie is right to feel a little slighted that you got a very expensive ring for free when you wanted to propose. I think it's understandable to feel that way. That said, he sucks for asking you to pay for his GF's engagement ring instead of just talking to you about it and asking if you'd be willing to help him out a little on the ring purchase.\n\nYou suck because you completely dismissed him without thinking through the fairness of the situation. You got 10k more than he did, essentially. Yes, your grandmother gave it to you, but how would you feel if the situation had been reversed and she gave it to him instead and you were in his shoes now?\n\nIf you value your relationship with your brother, offer a reasonable compromise. Perhaps offer to put a certain amount towards the ring and maybe be willing to loan a bit more than that (for instance, if you offer to pay $2500 towards the ring, but he wants a 5k ring, tell him that the $2500 is a gift and the rest is a loan. Agree on repayment terms). In the long run, the money you spend will pay off in your relationship with your brother and his eventual family down the road. \n\nJust becase you don't HAVE to do something for someone doesn't mean you shouldn't.", "NTA. That's holding a weird grudge for so long.", "NTA, yep, rings are suppose to be something you can afford, jewelers say about 1 month salary for a wedding ring set. He should buy what he can, and on a future anniversary upgrade her ring.", "NTA.\n\n>He asked me since I got my ring free, if Id go in with him to pay for an engagement ring.\n\nYou're not marrying his girlfriend, he is....", "NTA. Your brother is an entitled little AH, isn't he. Sure, you lucked out & got a free engagement ring. But that doesn't obligate you to pay it forward. Some people buy placeholder rings with the promise of a better ring later. Which is something that he can do.", "NTA.\n\nIf he cannot afford an engagement ring, he can’t afford a marriage. Financial troubles are one of the leading causes of divorce. \n\nHe needs to focus on getting a new job.", "NAH", "YTA.\n\nGrandma probably thought she would be around to help your brother. \n\nYou did luck out.\n\nYou don't have to do anything,  really, but you should. \n\nI would give him half the value.", "NTA", "NTA\n\nI'm the youngest of 5 and I have absolutely no idea what my siblings did for engagement rings except for one. He used gold nuggets, that he panned, made into a matching set for him and his wife. The others? I think Mom gave them something out of her jewelry box, but as she didn't like diamonds, she didn't have a bunch of rings lying around. \n\nMy ring once belonged to a great aunt (it was the only diamond ring she had). My mother offered it to my now husband since neither of us had yet thought of a ring. Because of the ring's unusual shape we paid to have the wedding band made to match.\n\nThe story here being, what one sibling received, did not equate equal treatment for all. There was one ring. Your grandmother gave it to you for your bride. Brother needs to make his own arrangements.\n\nHowever, as someone else said, possibly gifting your brother $1k, or whatever, as a nod to your grandmother's generosity might be a nice gesture on  your part.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor some context, I my wife, almost right out of college at age 22. A lot of people said I was rushing things but we didnt care. My grandma loved my gf at the time, now wife and she knew I was a broke college kid so she offered me her old engagement ring to give to her. It was an amazing surprise, she and my grandpa were married 50 years before he passed away and I love having the ring be a part of my marriage as well. Its not important to me but for context its a very nice ring that new would probably we more than 10k. She unfortunately passed 2 years ago.\n\nIts been 7 years and now my brother I'll call Charlie (31M) who has been with his gf for 6 years wants to propose. He unfortunately has been hit by a layoff this year so money is a little tight for him. He asked me since I got my ring free, if Id go in with him to pay for an engagement ring. I honestly thought that was ridiculous, if he had asked for a loan I may have been open but he just straight up asked for me to pay for part of it. My wife and I are fortunate to both have good jobs, but we have a kid now and are trying for another so we are not big spenders. His gf has a good job but for obvious reasons, he doesnt want to ask her to pay for her own engagement ring.\n\nI persoanlly think he should just pay for the ring he can afford and if she wants to at a later time in life upgrade it when their finances are better. He's telling me Im being an AH who lucked out with a free ring and saying Im being selfish by not at least helping. I feel like thats a little ridiculous but when i was telling my coworker about it, he said he understand Charlies point and that I did luck out. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Its understandable that he wouldnt want his gf to pay for the ring but weird that its all of a sudden cool if his little brother did instead.", "It’s a pretty crazy ask to be honest. NTA", "Nta.", "NTA - I don't think there is anything wrong with him asking - for a loan, an in lieu of a wedding present - but making it seem like you're obligated because you received your grandma's ring seems entitled to me.", "Nta\n\nHe’s just jealous", "NTA. Rings are symbols. You and your now wife loved each other enough to be married sooner rather than later, and you were happy to get a cheaper ring. Your grandmother loved you AND your wife and chose to pass on her ring. That is super meaningful and nice. \n\nNow, your brother badgering you to cough up money to help buy a ring? Less meaningful. He should either wait or buy one he can afford now. He can talk to your mother about jewelry she has, if the sentiment matters. But life isn’t “fair” and it’s ridiculous to think you should pay up when the whole gifting of the ring was done with love, intent, and meaning. That can never be replicated or made “equal”. And what are we meant to do? Never have those special moments for fear of not balancing the scales across the board? \n\nIt sucks for your brother, the circumstances he’s in. He’s not an AH for asking, but he is an AH for his reaction to your refusal. You are not the AH because there is no moral obligation to give people money, especially for things they don’t need. And an engagement ring is not a “need”.", "NTA", "NTA but damn he sounds like a entitled ah", "NTA. Here’s the main problem with your brothers logic: **You** didn’t get anything for free, you got nothing. Your grandmother gave her ring to *your wife* because she loved her and wanted her to have it. Your grandmother giving her ring to your wife is not something you need to make up for to your brother.\n\nYour brother is being unreasonable and incredibly irresponsible. He needs to either buy what he can afford or wait until he can afford more. End of story.", "NTA. \n\nIt's wild to think he'd expect that. (1) Even if she were still living, she wouldn't owe him a ring. (2) This is like expecting you to give him money for all the wedding and engagement gifts from relatives that have passed that he won't get.\n\nThat being said, tell him to get  moissanite.  it's significantly more ethical (especially than a new diamond), affordable, beautiful, and durable.", "NAH. It’s all a bummer to deal with but he had some real stones asking that you give money to make it even. Realistically though, you got a huge break. Money among family is always weird to navigate. I like to think if I were in your shoes I’d give an earlier and more generous gift of money (maybe $1k?) plus assuring him you’re there to help with the wedding process where you can so he can avoid things like delivery fees or something clever that makes him pay less but not at the expense of you shelling out cash. No easy solution but displays of acknowledgment with some generosity might go a long way. Either way he better drop it even apologize for jumping to conclusions of entitlement. \n\nBest of luck sorting it out and hopefully neither of you holds onto it too long cuz this would be a crappy thing to ruin a brotherhood.", "NTA.  Your grandmother gave you the ring because she loved you and your fiancé, and wanted to support your commitment to each other.  Maybe, if your brother had planned to marry his gf sooner, he would have gotten the ring. Or, Maybe not!  (Not going to speak to that.)\n\nYour grandma gave her ring to the person she wanted to have the ring.  Just because you \"lucked out\" in getting it does not mean you have any obligation to make it even for your brother and his girlfriend.  If it means THAT MUCH to him, have him reach out to another female in the family and get *their* wedding ring.", "NTA. It was a gift to you and your wife.  He can buy a cheaper ring with manmade diamonds until he can afford an upgrade.", "Nta\n\nAlso if he's just been laid off how can he feel this is a good time to propose... he can't afford the ring never mind the wedding....", "Obvious NTA, but does Charlie have a history of making similar requests? \n\nI can’t picture a normal person asking for this, but if he’s the type who regularly appears on r/choosingbeggars then it makes more sense", "NTA. If she won't love him without a ring, he shouldn't be marrying her. They could ask everyone in their family for old jewelry to melt down and make one nice new ring - I know people who have cobbled together rings from single earrings and the junk stones you get for free at cruise ship stops and been perfectly happy with them. He can buy a vintage ring at a pawn shop and change out the stone for a manufacturered diamond. Or, he can STFU and stop having champagne tastes on a beer budget", "Lol the entitlement is strong here. \n\nI’d suggest you mention to your brother that as you’re not marrying his girlfriend you don’t see the reason why you should pay for her ring. \n\nGranny gave you the ring, that doesn’t mean u owe bro anything \n\nNTA", "NTA. Them's the breaks.\n\nOne word of caution. When my husband proposed, he used his grandmother's engagement ring. It was beautiful and I loved it. After 20 years of marriage, I caught it on the hinge of our kitchen cabinet and it ripped apart. Turns out gold can get really fragile. Make sure you ask a jeweler to check out the ring every so often to make sure it's not wearing down.", "NTA and I am SO  tired of people who think just because one person \"got\" something, t hen they are entitled to the same thing! Life isn't always fair, and circumstances aren't always the same. you just happened to get engaged while your grandmother was still alive, she was happy to give the ring to you. Doesn't mean you should now help pay for your brother's ring.\n\nAlso, I agree with you; buy the ring you can afford, and later on, IF she wants another, larger one, get it then.\n\nI know if I were your brother's gf, I'd be happy with whatever ring he gave me. My mom's ring was very basic; i want to say 1/3 carat in a simple gold band. She never wanted a bigger one, even though later in life my  dad could have well afforded one.", "NTA. The ring is supposed to be symbolic. How symbolic is it if it was half-paid for by someone else? I got a cheapie ring for my engagement (not cheap for my spouse, though). I think my spouse had to borrow from my ILs. It meant everything to me.", "NTA. Bro has no dignity.  He can't afford a ring, he can't afford to be married either. (What grandma gave you is irrelevant.  Life isn't fair.)", "NTA. You're right, he should pay for what he can afford and if not then he has no business proposing when he doesn't have the money for a ring and a wedding. I think he forgets it's not just about the proposal but following through with a wedding.", "We didnt inherit anything from her, she gave what little she had to my mom and her siblings. She didnt have much at the time of her death though, she was living with my uncle and mostly just had social security to pay expenses. I want to say each person got maybe a couple thousand bucks. She had some nice jewelry which my mom and aunt split but they would never sell that. At least I hope they wouldnt", "He's spending Christmas with her whole extended family and wants to be able to celebrate the engagement with them. Which I totally understand but I dont think that means he needs to spend more than he can afford on a ring. Before my grandma gave me hers I found some pretty ones that were $500 and less. I know he can afford that.", "If he put it off to save money, it isn't crazy to speed it back up to have insurance after losing a job. That said, not OP's duty to pay for brother's ring.", "Yes! I am so tired of people thinking they are entitled to things. No one is owed ANYTHING. he is a grown ass man, well, at least in age, and he can figure this out on hiw own. you are not being unreasonable not lending him money", "But then he would have no one to support him!", "We didnt get any inheritance from her. She didnt have much at her death, she was mostly supported by my uncle at that point.If he'd asked, I would have considered a loan til he got a new job at first, but his reaction makes me not really want to.", ">Position to help your brother it would probably make your grandma smile (since she was in a position to help you)\n\nJust wanted to quote this for emphasis.", "Had she not given me hers, I was never going to spend 10k or half that on a ring at age 22 though. I was prepared to spend about $500 dollar on one. We just wanted to be married. We love the sentimental value of the ring, but since we'd never sell it, the financial worth isnt really important to us.", "Why would anyone be responsible for paying another half the value of a gift?\nThat's asinine. I bet you have never given your family half the value of your gifts.\n\nThe brother received other gifts from his grandmother, but you aren't demanding the brother pay half the value.\n\nYou would really give, someone you want to marry, a ring that your brother bought?\n\nNot your mother's ring nor your father's mother's ring but a brand new ring that someone else paid for?\n\nYou aren't saying you love her enough to marry her. You are saying you are entitled to her paying your way.\n\nAn engagement ring is personal. Not something you demand others to buy for you. That's just messed up.\nGo buy her a ring from a pawn shop just pay for it yourself. \n\nNo future wife, in her right mind, will accept a brand new ring the man proposing didn't buy. It says she isn't worth his time and efforts but he is worth hers. Eww.", "I am the oldest grand daughter, but because I did not marry first my cousin got a very nice semi expensive set of ear rings. I did not think anything about it since she got married first and my grandmother felt the first one married can have the handed down ear rings (been in the family over 100 years)", "His grandmother gave him a gift. If grandma wanted to gift the brother with something that was up to her.", "By your logic, if OP and his brother each bought a lottery ticket, and OP won $10,000 and his brother won nothing, then OP should give his brother $5,000?\n\nWhat about other siblings?  Or cousins with the same grandmother for that matter?", "This must be the brother", "Are you sure that's what the grandmother thought? My grandparents gave things to older children in our family with no thought to the younger ones. They gave things to those who were married and never thought about the ones that were too young to marry. They gave small gifts to some children and more to others.", "That is only assuming Charlie never got anything from grandma……what if grandma was still alive and didn’t like the brothers fiancée, so didn’t offer them anything, would op still be obligated to support his brother?  We don’t know if grandma left Charlie other jewelry when she passed, or even left Charlie more of something else of equal value that has just since been sold or something.   This attitude reminds me of the aita story of the dad whose young son was nvited to Disneyland by a friend and the mom wanted to say no because the younger daughter wasn’t invited.  Kids., little or big, aren’t promised identical lives, not even equal……we don’t know what Charlie has gotten from grandma", ">I would give him half the value.\n\nCant imagine that would go over well with OPs wife. \"Hey I know we have a kid and want to make our family even bigger, but Charlie's mad he didnt get a free ring, so we gotta give him 5k\".", "Has he talked to your mom to see if he can have a ring she inherited? A lot of mothers pass on jewelry they inherit to their sons to use as engagement rings. My engagement ring is my husband's great aunt's ring his mother gave him to propose with. My cousin's wife has my grandmother's wedding set his mom passed down to him. That seems like a more reasonable request. NTA", "OK so you have aunts and that must mean you have cousins. So the question is if one of them would have been given it would he be hitting them up for half? And if the whole thing were reversed, are you entitled to go and ask for half?", "How is he planning on paying for a wedding if he can’t afford a ring?", "You obviously know him far better than I do but based on his reaction I would have to wonder if he would actually view the money as a \"loan\" rather than what he was \"due\" and you'd never see a penny. \n\nThe jewelry that your mom received-- did any of the pieces have precious stones that could be set into a new ring for bros fiancee?  Could he wait a year and put aside money for hefty downpayment and finance the rest?  If he did that maybe you could toss in $1K to upgrade the ring a bit (only if it won't break your budget).", "Has he been a good brother otherwise? Was he helpful to you growing up or when you and your wife married and started having kids? Weigh all of that alongside his emotional reaction. He didn't get an inheritance or the memory of your grandparents. He probably feels a lot of pressure with the lay off and his fiance's expectations after 6 years together. \n\nIf he's always been an asshole then that's different.", "But you took it. You didn't declined it bc it was more than you could afford or gave it back to her when you were able to afford a good ring yourself. You took it and kept it, knowing your brother will not be that lucky, knowing your grandma did this bc you were broke and she wanted to help you (and would have most likely also helped your brother now if she still was alive). \n\nYour grandma was a generous woman who cared about her family more than her assets. Its sad this personality traits are not a thing nowadays anymore. \n\nYou are not an asshole for not helping, but you are also not a good brother.", "Plus the grandma actually knew his fiancée, it was a gift to two people she loved. There was only one ring, of course it could only be given once. \n\nThe brother not being able to have an honest conversation with his fiancée about the ring and its financing isn't a great indicator that he's ready for marriage.", "That is not the same logic at all. \n\nThis was not OP getting a bday gift. It was a random \"gift\" worth a significant amount of money. Not a small token gift. If a grandparent bought one grandkid a car just because and not anyone else it would be unfair/ahole move.\n\nIt is still not on OP to make up for it, but it is understandable to feel slighted.", "No. I am not the brother. \n\nI am a fair-minded female who speaks her mind.", "I said this in another comment but I dont know what my mom got. Just that her and my aunt split the jewelry. It wasnt a ton. Not sure if there are any rings or anything she'd be comfortable parting with.", "Yeah we have a few cousins, and that was a point I made to him too.", "Not defending his brother in the ring situation, but plenty of in laws pay for weddings.", "I dont know what the stuff my mom got looks like, just that she got some. I wouldnt expect her to want to part ways with it but maybe she would. Im not sure what his finances look like, he may be able to finance it.", "He's been fine I guess? We've never been close because we have different interests but we typcially get along fine. We've never given each other money though, I dont like the idea of it unless it were an emergency. He has some things from our grandparents they gave while they were alive", "Of course I didnt decline it, it was a gift, she wasnt selling it to me.", "You're right, it's not the same logic.  A lottery is random, whereas Grandma CHOSE to give the ring to OP and not to Charlie.   I was responding to OP's coworker saying OP \"lucked out.\"   Even if OP \"lucked out\" by getting the ring, why does that mean he has to share it? \n\nGrandma could have left it in her effects to be divided in her estate, or sold it and given every grandchild a portion.  She did not. She wanted OP's wife to have it. No one here is asking whether Grandma was the asshole here.  For the record she would not be, because the ring was hers and it was up to her to decide what to do with it.", "I think that he might see your life and think well you should just help because it's so easy for you. Not that it is actually fair, because I can guarantee you he would be telling you tough!", "I can totally see where he wants a nice ring for his fiancee and feels it was a bit unfair that you got such a nice ring from grandma HOWEVER that doesn't mean I think YOU should pay for half of her ring either.", "And an engagement ring is a WANT not a NEED, nor is it an emergency. you were well within your rights to say now. He's being childish and selfish.", "I agree OP is not an ahole, and does not have to make up for it. \n\nMaybe this is semantics, but OP was lucky, not in a something happened to him by random chance, but being gifted a $10k engagement is lucky/nice/fortunate. \n\n\"For the record she would not be, because the ring was hers and it was up to her to decide what to do with it.\"\n\nAbsent other circumstances giving one grandchild such a huge/valuable gift and not others I do think would make them an ahole. I think parents/grandparents should try to be fair/equal. \n\nIt does not mean everyone gets exactly the same thing. But disproportionate gift giving should be avoided. \n\nIf grandparent/grand child worked to repair a classic car together it makes sense to give it to that grandchild, but an item of similar value/cash equivalent should be given to others. \n\nIt would be different if the situation was on grand child was close visited/called grandparents and the other choose to not do that.", "We don't have all the details, but OP was close enough to grandma that grandma was able to get close to his then-GF more than 7 years ago.   To be fair I don't suppose she had any idea how much the ring was worth.  To her it was not a fungible item like a bank account--it had sentimental value and she wanted OP's wife to have it.\n\nBTW that makes OP 29 now and brother Charlie is 31.  Charlie's been with his GF for 6 years, and Grandma's been gone for 2.  So there was 4 years for Charlie and his GF to get on Grandma's good side if that was want they or she wanted. \n\nMy brother and sister still live near my mother. He cuts her grass; she does her shopping.  I'm 350 miles away.  I think it is 100% OK if my mother leaves more to my siblings, or gives them things now.  We don't know OP's or Charlie's relationship to Grandma and should not judge her choices.", "NTA. You did get lucky in that you were the first to marry, and grandma liked your then gf. Buuuut, your good fortune in no way negatively impacted him. He has no way of knowing if grandma would have wanted him, or his gf, to have the ring so he's not out anything and therefore isn't owed anything, certainly not by you.\n\nIs it \"fair\"? Maybe not, but ya'll are grown men now and it's time to accept that life isn't always fair or equal.\n\nIMO, it's also trashy af to ask other people for money to buy a ring. If he can't afford a ring, he probably can't afford married life (i.e., a home, wedding, kids, etc.) and he should resolve that before asking someone to commit to him. A spouse should be an asset, not a liability.", "NTA. \n\nThere’s a price to pay for being the eldest. \n\nYou had to grow up with your parents. In most cases, the younger kids get a little more grace by being raised by your parents. \n\nYour grandma knew your gf and she explicitly chose to offer it to you, for her. \n\nHis life, his proposal, his problem.", "NTA I’ve never heard of anything like this! Your brother is TA", "\"Im being selfish by not at least helping.\"\n\nINFO: What kind of help is he looking for moneywise?\n\nYou say it is probably worth 10k new. I'm not sure why you say \"probably.\" Certainly such a valuable piece has been professionally appraised for insurance purposes. That however is replacement value. But the actual value of the ring as received 7 years ago would be far less. Used jewelry doesn't have that kind of resale value.\n\nnta", "So let me get this right, he wants you to pay for an engagement ring or part of it because you got a free ring so in turn he would get a free ring and effectively means that you paid for the ring your wife has and he pays nothing?!", "NTA - Sorry, I don't mean to be rude, but is this an American thing where people feel entitled to other peoples' money? I ask because I see so many of these and they're all from the States, like \"my sister says I should pay for her vacation\", \"my brother says I should pay for his wedding...\" Weird!", "NAH\n\nYou did luck out with a free ring under the circumstances, and it's unfortunate your brother wasn't left something by your grandmother with equal significance. Consider how you might feel in the reverse situation.\n\nGrandmother meant well, you acted naturally, your brother is understandably a bit perturbed. You're not obliged to give him money to make up for this situation.", "YTA and NTA\n\nYTA\n\nYou've said that there was no inheritance, so I'm going to assume only the ring was left.  I'm also going to assume a situation where she loved you both equally and there is no difference in her theoretical opinion of the women you ended up with.  In that scenario, she gave you the ring, that couldn't be split, because you married first.  None of that really means you deserved it more and just from the fact that you found your wife earlier in life, you got the ring.\n\nNot only did you save the money, you got a family heirloom that could be passed down, something that probably has more sentimental value than monetary value.  I think because of that, going half on a ring with your brother when you are also in a better financial situation would be a reasonable request as long as it was a reasonably priced engagement ring.\n\nNTA\n\nPersonally, I hate how much money people spend on engagement rings when the only real value they have are the ones we assign them.  The value of diamonds, in my opinion, should be for their actual functionality such as in drilling equipment.\n\nMy girlfriend isn't a big fan of diamonds either, doesn't even care for real gems and even though she makes decent money, she only owns one necklace with a real gemstone and that is a family heirloom as well.\n\nThe engagement ring I have ready to propose to my girlfriend is the only real stones I will buy her and it has both her birthstone and mine in it, none of which are expensive and the entire ring is like $300 CAD.\n\nWe have also had the discussion of wedding bands and we've agreed that we would prefer having multiple cheaper rings of other materials like ceramic, than have expensive high quality gold rings.  That way we can change them to match our clothes for special occasions and if we end up losing one, it doesn't have to be a big deal of sentimental loss and an expensive replacement, we just order a new one for a reasonable price.", "NTA. Your brother is the AH", "NAH. You were given a gift, so you don't owe your brother anything. However, it was not fair for your grandma to give you such a generous gift, and give your brother nothing, so it's understandable that he feels like he got the short end of the stick (because he did).", "YTA, you got the ring for free, you make good money, he just go laid off … help your brother out!", "NTA\n\nInheritances are rarely truly equal.  Even what’s equal can be open to interpretation.\n\n Not on you to do anything about", "He either gets a cheaper ring or saves up to get the one that's wanted. If he can't afford a ring maybe he shouldn't get married until he can't get his finances straight. Which usually leads to divorce anyway.", "NTA you can't help the fact your grandmother supported your marriage enough to give you her ring. You don't owe your brother help with his ring. He should do what you suggested and buy a ring he can afford and upgrade later", "His gf his responsibility", "You did luck out so what? You don’t ask others to pay for an engagement ring. It’s really that simple. NTA.", "NTA and your brother is a bit of a dumdum thinking about proposing and the associated wedding costs after being laid off!", "NTA. You lucked out, sure, but it just seems weird that he'd expect you to help pay for his ring.", "NTA obviously don’t know what sort of women his GF is perhaps she’s the sort thinks she needs a big real diamond OR perhaps she’d be thrilled with a lovely simple moissanite ring.", "NTA", "NTA - how entitled. Can’t afford a ring then work with what you have. Begging others to pay is not good", "NTA.  Your brother doesn’t sound great with finances.  He shouldn’t be trying to brother-source an engagement ring.  He should focus on getting a J-O-B and getting financially stable.  Proposals, weddings, children, loans, etc. should all come after he is financially responsible and established.  Good luck.", "NTA - The ring was a GIFT from your grandmother.  It has nothing to do with him.  \n\n\nHe is selfish for asking you to pay for his engagement ring.", "Absolutely, positively NTA. I find your brother's thinking bizarre. Regardless of who paid for it, there is no connection between your wife's ring and paying for the one he wants to buy. You owe him nothing. At this point, don't offer him a loan, either, you'll never get it back!!", "I feel as though the bride to be would be fully understanding; if she's a thoughtful person; if he presenter her with a place holder knowing their current circumstances. Furthermore, having an honest and frank conversation with her would help them figure out a timeline for engagement and wedding. He clearly isn't in the right place to make such a step financially. Doing this could help set up realistic expectations for her knowing what's in her future, as well as he has time to find a new job, plan a special proposal, and save for the \"dream ring\".", "NTA\n\nYour grandmother giving you her ring is irrelevant to his situation now. It was your grandmother's decision and right to give her property away as she saw fit. I doubt it would have meant any less to you if it was only worth $100. The value of it being a part of a 50+ year marriage meant more to you.\n\nAnd honestly, if I was his fiance, I'd feel some type of weird, like owing it to my future BIL, if my ring wasn't paid for entirely by my fiance.\n\nYou don't owe him money. His girlfriend either loves him for him or she doesn't. He can upgrade a ring later if it's so important.", "NAH.\n\nYou have no obligation to help him,  and he shouldn't demand anything. \n\nBUT...  I can totally see why he would feel it rather unfair.", "NTA.  Tell your brother you'll let him skip a couple of months of child support though.  Wait.  He doesn't pay child support?  But you have a child and he doesn't so he has plenty of money to help you pay for yours.", "Tell him if he gets a bj after he gives her the ring, you want your share, too", "NTA that’s not how gifts work. Your grandmother could have left money specifically for your brothers ring but didn’t. You don’t owe him money 😂 my brother and sister both had their weddings paid for by family. I eloped. I didn’t ask them for a third of what was given to them bc that’s insane", "What's the difference in asking for a loan and asking to pay for only part of the ring? Either way you're giving money.\n\nThat said, Grandma's \\*gift\\* ring has ZERO to do with his ring he's going to have to buy. You're not obligated to do that for him. Me, I probably would do it just because that's the kind of person I am, if I were able I'd help out, if not, then I wouldn't. Separate the two, and talk to him about that too. Point out they're completely separate ordeals and it has nothing to do with who can afford what now. Your suggestion to him was a good one. Tell him to leave Grandma's ring out of it and then you look at this from a logical point of view, and whether or not you're willing to help whether you got a free ring or not.\n\nNTA.", "NTA\n\nTell your brother to check out white sapphires. They look just like diamonds but a lot less expensive. I have a 4 carat white sapphire on a sliver band that we paid less than 500 for. I honestly think we caught it on sale at 200.", "Yta continue the good blessings and pass over some money", "NTA. Your brother obviously cannot afford to get married now so getting an engagement ring is ridiculous. Once he can afford marriage then he can get a ring.", "NTA it's not a great time in your brothers life for a wedding if he's broke and unemployed, what does he have to offer a wife?", "NTA - If he can't afford a ring he waits until he can, cause if the rings a problem he's never going to afford a wedding so what's the rush", "NTA - Charlie is being ridiculous in his OTT expectations that you help pay for his ring.  A loan, maybe, but saying no to funding his life (while you are also funding your own) doesn't make you an AH.  \n\nI actually don't see Charlie's point.  If you were \"lucky\" and won the lottery, would he be entitled to half?  If you were \"lucky\" and won a car, would that mean he was entitled to drive it half the time -- just because you didn't pay for it?\n\nYour grandma willingly offered you her ring.  That isn't luck - that's love.  She gave you a gift.  It's not luck.  And no, your broke, cheap and greedy brother is not entitled to half of that gift, or half of the money it would cost to have that ring.\n\nCharlie is a dick.  And your co-worker sucks.", "If he’s been layed off from work, it’s not the right time to be proposing tbh because if he can’t pay for the ring, how is he going to pay for the wedding? NTA", "NTA", "YTA", "You absolutely don’t need to at all. NTA. \n\nStill can if you want, just to be nice. Probably make his year. \n\nI’d like to do that for my brother if it wasn’t going to stretch my finances.", "Walmart rubber ring 8 bucks. I don’t understand the need to pay $$$$ for a ring", "Not only was the ring a gift from your grandmother but you were a broke 22 year old.  What’s his excuse?  NTA", "NTA", "You going in on his ring for his girlfriend is very odd. I've never heard of family chipping in to buy such a personal item. I say buy what he can afford now and then upgrade when their finances improve or for a big anniversary.  10 years 15 years 20 years.", "YTA. But only because you are acting selfish and tightwaddy.", "NTA.\n\nYou did luck out, but your brother is being weirdly entitled and needs to stop. You don't owe him money due to a gift you received. That's absurd.", "NTA. My engagement ring was $150 from Etsy and I love it lol, I know it won’t last forever but I personally like the idea of getting another ~$200 ring every 10 years or so. \n\nHe can buy a placeholder ring if he’s hell bent on spending tons of money on one and buy it later when finances allow.", "NAH\n\nI mean I can understand both people's perspective.\n\nIt would certainly help your relation with your brother if you did help him while he's down on his luck, though. You never know when you could need someone's help either.\n\nYour grandma was kind to you when you were broke, how would she want you to handle this situation? If she was here would she maybe  be proud to see that you paid her kindness forward in some way? He's not entitled to your money or help, but just something to think about. Your grandma could've sold the ring for herself or something, too. According to what you said she didn't have a lot, yet still she gave it to you.\n\nNot saying this to guilt trip you, but it just feels like the type of family she wanted to leave behind was the type that help each other. The way he asked definitely feels off putting, so I can understand some reluctance on your end, but just consider that kindness being paid forward isn't a bad thing. You can  make money again, but you're not going to have another brother.\n\nIf you don't want to help him monetarily, maybe help with a job lead or something if he's still looking. Don't just turn your back on him.", "NTA. Your brother is awfully entitled isn’t he?\n\nHe should buy what he can afford. Next they’ll want you to pay for the wedding and honeymoon. \n\nNope.", "It's a weird request.  Is Charlie going to ask OP to help out on the wedding night as well?  NTA.", "Nta-f-no!", "Nta he had 6 years to save for a ring. And you do not help but another woman's engagement ring. That's just weird.", "The number of people suggesting that OP give his brother money to make up for the Grandmother giving OP something is ridiculous. He got a gift from a relative, how is that “unfair”? Granny was alive when he got married and she gifted him her ring, she’s with the angels now so the brother is entitled to recompense at OP’s expense? \n\n N T A", "You can get super pretty rings for reasonable prices, but I can’t quite wrap my head around him being laid off from his job, and then deciding this is the moment he should propose. Surely waiting until he is financially stable again would be the better option?\n\nAlso 100% not your responsibility, you did get lucky, but that doesn’t mean you owe him anything.", "NTA. But, I 100% can understand why he might feel slighted", "Your coworker is correct. You did luck out. That's completely irrelevant to the situation.  Your luck resulting in your grandmother giving you her engagement ring doesn't mandate you helping your brother pay for an engagement ring. \n\nNTA but your brother is heading that way.", "NTA - your grandma gave it to you because she liked your relationship and it was something she did. Yes you were lucky, that doesn't create an obligation.", "It's kinda creepy that your brother would want you to contribute to paying for his soon to be fiancées ring. Surely he should buy what he can afford and perhaps upgrade to what he can afford as the years go by. The first engagement ring my husband got me was what we could afford at the time. Since then he has bought me a couple more as we've been able to afford it but we've been married almost thirty years now.", "Grandma didn't give it to you intending you to pay him in the future. It was just a sweet gift from someone who loves you at a time it was relevant in your life.\n\nSo you did \"luck out\" with a free ring but that doesn't entitle him to your money! NTA because it isn't reasonable to ask a sibling to pay for *your own* wedding ring. If he can't pay for one he probably shouldn't be getting married. Or he should get a cheap ring he can afford.", "NTA. Grandma might not have given him the ring anyhow even if she were still alive and he married first. Tell him nope.", "Hey, since gramps gave you his car 7 years ago, you can help me buy a new one. It's only fair.", "NTA- your free ring has nothing to do with your brother, so you get a bonus at work you have to give him 25% because he didn’t get one? Tell him to do one and buy the ring he can afford, if he can’t afford then don’t propose at all.", "NTA.\n\nWhy does your bro need a big expensive ring? My fiancée and I (both female) aren’t exactly rolling in the dough, so we got rings for less than £300 each and they’re lovely. It’s the gesture that counts, and for us it means more than some 10k job that we’d be in debt for for ages.\n\nI admit it’s unfair that you got a ring given to you while he has to pay for one, but that’s hardly your fault or burden to bear. Besides, your money’s gonna be drained enough with those little ones to take care of (no judgement, to clarify - I’d love to have a little one but my partner’s being all sensible about finances and stuff. Spoilsport. :P)", "NTA. And what bride would want a ring that her future BIL went halfsies on? Creepy.", "NTA\n\nYour grandmother died 5 years after giving you the ring to give to your then girlfriend.  It wasn't an inheritance.  It was a gift.\n\nWhat sort of money is your brother asking for?  Does he want you to finance 50% of the ring.. or does he want you to pay for the majority of it?\n\nYou owe him nothing.  He should be buying a ring that he can afford.  \n\nI have what would would be considered a very cheap engagement and wedding ring combo.  It does have a diamond in it (the small diamond is actually set within the ring and sits almost flush with the edge rather than sticking out so it's probably smaller than you think).  But I'm not bothered by it at all.  It was all that my husband could afford at the time.  Work was difficult at the time (was working casual and work could be intermittent) and in some respects I wish that he bought an even cheaper ring at that point..  I would've been happy with a food ring!  Ironically I got a promise ring (some would say push ring) after the birth of my second child (probably actually more a birthday present as kid was born two days before my birthday) which was a more elaborate ring that cost at least 3 times the price of the wedding set (saw the charge on the credit card... no I didn't say anything).  It complements the other two and people think it's a set of three rings but you can see one is of a much better quality.\n\nBasically the size of the ring doesn't correlate with the meaning behind the ring or how much he loves his girlfriend and if he thinks that then he needs some education.  If his girlfriend cares that much, then he has bigger issues.\n\nAt best I would offer your brother no more than $200 towards the cost of the ring if you can afford it just to help him out.  But you aren't even obligated to do that.", "No way he can get a ring for $100 on Amazon made of moissanite and pure silver and call it a day. His budget affords his ring.", "NTA, OP’s brother has had 6 years to consider starting to save for an engagement ring.", "NTA.\n\nThat logic belongs in a 5 year old.\n\nJohnny got an ice cream so I must get an ice cream too.\n\nIf someone wants to get engaged it is on them to fund it, no one else.", "NTA. He wants to propose to his gf. He needs to get her a ring he can afford. Imagine how she'd feel yo find out OP helped pay for the ring and got a say in cost, etc because of it.", "Exactly. My oldest is 27 and inherited 150k from my mother when she passed when he was 3. My other kids 11 and 20 aren’t well off like he is now. It’s just bad timing. They wouldn’t dream of asking for money from him", "Does this mean I can make my brother pay for my car since he got a hand me down from our grandma when he was in high school? Sweet.", "It wasn't an inheritance though, right? His grandma gave him the ring before she died. It's her right to give her property to whoever she wants and, considering it was given specifically as a result of him getting married, you can't exactly chalk this up to favoritism from the grandma.", "^ This!", "Maybe grandma's ring *new* would be worth $10k but it's second hand, so it's likely worth a lot less than that.  Seeing as it's all about the money for OP's brother, maybe OP should find out what the ring is now worth- it's possible that his brother could afford a ring in that price range, and he might be able to get something second hand that's pretty nice.  Just pointing this out bc a lot of people assume their jewellery from grandma or whoever is worth a lot, but often it just isn't...", "Here's the comment I was looking for. Getting married so young, OP's grandma could well have given him nothing. OP isn't obligated to help his brother, but seems like he lacks empathy. From the day the ring was given to him, OP should have realized he's getting a priceless gift that his sibling/s would be denied.", "And open the door for the brother to hold his hand out every time he wants something OP has?\n\nIt’s not even a loan, brother is being simultaneously being cheap and trying to keep up with appearances.\n\nThis is the solution a people pleaser would come up with.", "My wife and I talked and both agree the whole thing is ridiculous. If he asks again, Ill offer him an advance on a wedding gift of $250. The rings I was looking at before my grandma gave me hers were all around $500 or less. So thats what Im basing the amount on.", "NAH but I do think unequal inheritance and/or playing favorites while still alive just sets up siblings and families to not like each other. You're not the asshole for not splitting a gift's value that he didn't also receive, but I also don't think he's an asshole for wanting the same helping hand you got. It is what it is, you did luck out, and there's no real way around one of you harboring some bitterness from the sound of it. It's not like it's a house. He'll get over it I'm sure.", "Tell him to look for a cheaper \"placeholder\" ring!", "I'm sorry, but your brother's priorities are backwards. I get where he's coming from. At the same time, if my sister/daughter/cousin (take your pick) came home with an expensive ring and I found out that the fiancé had just lost his job, I would be side-eyeing the fiancé and judging their relationship like crazy because no way would I believe that the fiancé had enough sound (financial) judgment to take good care of my loved one. I also would possibly be whispering words of cautions in private to my loved one while waiting for their relationship to implode. \n\n\nNTA btw. You gave your brother good, sound advice. Your brother is doing himself a disfavor for disregarding it and throwing his little tantrum.", "I can't imagine her family being thrilled if she gets engaged to someone currently unemployed. They have been together a good number of years so maybe it isn't a big deal, but as a stranger on the internet it doesn't sound good.\n\nIt isn't like they can plan a decent wedding while he is unemployed either because that also makes cash tight. If he is too broke to buy a ring a wedding is impossible. Even if her family helps he is \"broke\" until he gets a job. He can wait to propose.\n\nNTA, regardless of your brother's employment status.", "One of my friends has a moissanite ring and it’s gorgeous. Much bigger and nicer than she could have gotten if it were diamond and you really can’t tell.", "Curious, how much money did he have save for the engagement ring?", "Have you thought about gifting him a small monetary gift to help even if you don’t gift him 5k? I can understand him feeling resentment that you got a leg up in life that he doesn’t get. You have the right to say “tough luck that I got something and you don’t” but I think approaching this with some empathy will go a long way in your relationship.", "But she did give it to you and now you have the chance to pay it forward, so that your brother can get something better than what he can currently afford, just like you did", "The number of mental gymnastics you had to go through to defend OP's selfish position is astonishing. How is OP giving him a gift of say $5,000, and then going out and buying his future bride a ring using that gift, in any way something to the brother should be ashamed of? \n\nAnd frankly, the more I look at OP's comments, the more I think he went to his grandmother with a sob story about being broke in order to get help with the ring. He says he was just going to buy one for $500, but instead went to grandma and told her that he was going to propose, and told her he had no ring or that he couldn't afford an expensive one. Sounds fishy to me.", "I think talking to your brother, completely having both of you put all the cards on the table, is going to be the best option.  \n\nBecause the whole thing of 'this is ridiculous'  'advance of a wedding gift' kind of stuff is what I find ridiculous.  \n\nlike \"hey bro, i got this $10,000+ hugely sentimental ring that can be considered a family heirloom for free because I was getting married first before grandma died, but I know your struggling so here is $250 and btw, that's your wedding gift\"\n\nLike if you wanted to preface with some context like you supporting your grandmother greatly, your brother being a dick, his girlfriend being someone that his grandmother would disapprove of, or any other reasoning why you should deserve it more than him, at least that would have been something but now you really are just being an asshole.  \n\nIf it really is something that matters this little, why not you and your wife give the ring from your grandmother to him and you get the $500 ring. \n\nThis is most likely just some troll post from some lonely man sitting in a rented room and that's why he's using a burner account because he has nothing going for him in his life.", "Maybe look at second hand rings? That's what your ring is, when you set aside the relationship and sentimental value that your brother isn't interested in.", "May not be about affording it but feeling left out that the two kids weren’t treated equally.", "Probably  with this: \" His gf has a good job but for obvious reasons, he doesnt want to ask her to pay for her own engagement ring.\"", "Exactly there are some beautiful cheaper rings on Etsy that even look like the \"real thing.\"", "Yeah, you seem to have defined mental gymnastics. Your anger towards OP is dominant.\nNow you are making his story up... Talk about mental gymnastics.\n\nYou never answered my question. Who did you pay half the value to for your gifts?\nWhy aren't you declaring the brother, should Give OP half the value of the gifts grandma gave him?\n\nAre you someone who felt entitled to another's income and got set straight?\n\nIt's terrible to ask someone to marry you with a ring your brother bought for her. Eww.", ">If it really is something that matters this little, why not you and your wife give the ring from your grandmother to him and you get the $500 ring.\n\nMy Grandma gifted the ring to me and I gifted it to my now wife. Its not my ring to gift and Im sure as hell not going to suggest that. \n\n&#x200B;\n\n>This is most likely just some troll post from some lonely man sitting in a rented room and that's why he's using a burner account because he has nothing going for him in his life.\n\nYou are partially correct in that Im working from Home in rented room right now lol. The rest is off.", "Suggest to your brother to ask your mom if she can /is willing to give him a ring to propose with - it could be a place holder until he is back on his feet and if your mom agrees he would also have a 'family heirloom ' from your mom to preserve \n\nNTA for not wanting to pay for a ring.", "~~You could look at it as the ring was your inheritance.  Then you could give your brother whatever $ you got from her estate (the couple thousand).~~  You are under NO obligation to give your brother any money.  The ring was a gift from your grandmother to you and your gf at the time, who she knew and loved.   ~~do so, it's just one possible idea if you decide to help him.~~   NTA\n\nEdited bc I read the facts wrong apparently.", "Asking mom for one of the rings seems the closest to the intention your grandmother showed towards you. It’s super weird to expect someone to buy something so intimate for you.", "Info: did they give him things of equal monetary value or just sentimental items? If they are just sentimental, I would consider giving him a small monetary gift “this $500 is all that I can afford. I hope that it can help you toward your goal of buying a ring for your girlfriend”. Or if he gave you a generous gift for your wedding, I would consider giving that back to him as a way of paying it forward. Personally, if he was a considerate uncle and has done nice things for your family, I would take that into consideration in your decision versus if he has not gifted anything on your special occasions.", "Ignore them, they’ve never been anyone’s favorite anything and it shows.\n\nYou were given an heirloom, he was not he can deal.  Grandma could’ve offered a ring to your brother to use in the years since, she chose not to.", "Your the only one that seems angry here. \n\nAnd you never asked me that question, but I'm happy to say that I have. I had a parent that had a habit of favoring me unintentionally. I would often share these gifts with my siblings as it was only fair.  The thing is that you won't believe this because it's not something you would do, so therefore you assune nobody would. \n\nAnd if grandma gave the brother far more than OP, then I'd absolutely say that the brother owes OP something, but OP never even remotely hinted that this was the case. \n\nAnd since you have this thing about being entitled to answers, why did you skip over mine?  Shocking, I say.  Simply shocking. LOL", "Ring gifted and gifted but now can't be gifted. \n\nAlso 29 years old, married for 7 years, working from home in a rented room when you and your wife have good jobs and a kid?  I don't think I was off at all.  I think you can't keep track of your own stories\n\nSo my best guess is not married, the ring isn't real, the situation isn't real, and you are just lonely.", "I cant help but feel like thats kinda crumby. He said she doesnt have much from her own mother and we want him to try to get her to depart with more of it. Not because he's so close to his grandma but because of the money aspect. Just feels wrong to me. There are plenty of cheap rings you can get for less than $100. Nothing wrong with proposing with a cheap placeholder ring for now and upgrading at a later date.", "He said they didnt get anything in inheritance, his mom and her siblings got a couple thousand. I still dont think he should give him a dime though. The man is 31 and its not an emergency, there are plenty of cheap rings out there.", "What a bizarre insult to hurl at someone over a reddit comment.\n\nAnd generally speaking, people normally only have one engagement ring. She also may have had no idea how valuable it was and likely couldn't have afforded to help the brother in a similar fashion.", "Dude only about a third of people under 30 own a home in the US. My partner and I have good jobs too but a home in the neighborhood we live in starts at 700k. It doesnt mean we dont have good jobs because we dont have 140k for a down payment. So for now we rent a nice place in a neighborhood we like and save money each month until the day we do have enough, you sound pretty out of touch.", "Not sure why you think its not realistic for people to be under 30 with a kid, and not own their home but ok lol. Pretty sure thats incredibly common. We have good jobs, just not enough cash to buy a home in our city where the average single family home goes for around 1 million. \n\nRing is very much real and its crazy how would suggest she give up whats her ring now. Im not even going to suggest that, because that would be insane. Have a lovely day haha", "Honestly, I agree. If there is a ring, it's one of the few keepsakes she has of her only mother. The sentimental value for her is likely tremendous. He could absolutely get a simple placeholder ring, even something without a stone that can symbolize their commitment while he saves up.", "I agree, especially as it appears Charlie is older than OP. So Charlie is reaching out to his younger sibling and expecting financial help?", "Thanks.  I guess I read it wrong.  When he said all people got a couple thousand, I thought it included him and his brother.  Don't disagree he owes him nothing.", "[removed]", "This is so insane.\n\nBrother: Get’s laid off.\n\nAlso Brother: I want to buy an engagement ring. Like…🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️\n\nI want lots of things, however, as an adult we also realize we do not always get what we want. OP: Received his Grandmother’s engagement ring as a gift. That gift did not come with the condition that OP would pay for or help finance his soon to be SIL’s engagement ring. \n\nOP’s brother’s priority should be finding a new job, spending money on any unnecessary expenses right now is absolutely asinine.\n\nGet a new job. Buy the ring you can afford and voila problem solved. 🤷🏻‍♀️🤷🏻‍♀️🤷🏻‍♀️", "Where you live does everyone inherit from their grandparents? Because all 4 of mine have died and I didnt get a penny. Presumably anything they had went to my parents and their sibs and I dont think thats uncommon. Being cash poor but having lots of jewelry is also super common with old people. No way either of my grandmas would have sold all their jewelry in their 80s just because their bank account wasnt flush.", "Your comment has been removed because it does not address the OP in good faith.\r\n\r\nIf you suspect a post breaks one of our rules, please report it instead of commenting. **Do not feed trolls**\r\n\r\nContinuing to post comments like this will lead to a ban.\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**"]}