{"id": 30107, "submission_id": "17ldirs", "title": "AITA for expecting my gf to support me while I’m unemployed?", "selftext": "I lost my job 4 months ago and EI doesn’t cover my full living expenses. I had to buy a car since mine had 330,000 km on it and the engine issue was worth fixing. After that I had couple thousand saved and that has been completely wiped out and now I’m not able to cover all my expenses. I asked my gf to help cover my expenses and she has refused because I didn’t propose before this. We had been dating for 3 years and moved in for 2. \n\nShe had told me 3 dates in she expected to be engaged in about 2 years of dating and is very unhappy with me because I didn’t propose. I’m sure she is the one, I’m just still hesitant about marriage and she has told me she is trying to get over the fact she wasted 3 years with me. I told her to give me some time and she has thankfully not pushed it. This was shortly before my work announced they were cutting people and I was let go. \n\nNow she says I’m expecting too much from her since I’m not ready for marriage but expecting her to help me with rent. We have been dating for 3 years doesn’t that count for something?! If it was a year in I understand if it was too early but we have been together for a long time. But she told it was meaningless because I haven’t proposed and she refuses to help me as I could just decide I don’t want marriage and bail at any time. I could have bailed at anytime while dating and still can bail after we get engaged but I didn’t and I won’t. We have been serious for a long time, why is the ring and marriage all that matters?! \n\nI’ve told her since she won’t help it’s shown me she isn’t serious too and she told me it’s fine we can just end the lease and I can go back to live with family if I can’t afford rent here. I’m getting interview requests back and did an interview already although I didn’t get it it’s crazy to me she would waste 3 years over covering a bit more rent and groceries.", "created_utc": 1698849316, "permalink": "/r/AmItheAsshole/comments/17ldirs/aita_for_expecting_my_gf_to_support_me_while_im/", "score": 2934, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for expecting my gf to help me with rent and living expenses while I’m unemployed\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">I’m sure she is the one, I’m just still hesitate about marriage\n\nINFO: If she's the one, then why are you hesitant? She also told you her expectation pretty early. If you knew you couldn't meet it, why did you continue with the relationship? OR at least have a conversation about it when it hit the 2 year mark?", "YTA -- well, well, well, how the turn tables! She told you her terms for a more committed relationship and you've refused them. She has continued your relationship, but has adjusted her expectations and contributions accordingly.\n\nWhy should she change them because suddenly you need the benefits of a more committed relationship, but aren't willing to actually make the commitment? This is the epitome of expecting \"wife duties for girlfriend wages.\"", "YTA, you don't know if you want to marry her but you expect her to act like a wife and cover your expenses when you're unemployed. Make it make sense.", "You’re expecting her to treat you like a husband while you treat her like a girlfriend. YTA.", "YTA.\n\nY'all are a fucking train wreck. If you live together and she doesn't help cover your portion of the rent, doesn't that also mean she will be evicted? Seems like an inconvenient hill to die on.\n\nThat being said, your bills are your responsibility. If you weren't living together, she would have zero responsibility to cover you. As impractical as a \"2-year-mark proposal\" is, she was up-front about it and her desire to get married. And I can see from her perspective that it just doesn't feel like you're committed to her so why should she invest her hard-earned money into you at this point? You're expecting everything without giving anything.\n\n&#x200B;\n\n>We have been serious for a long time, why is the ring and marriage all that matter?!\n\nDon't get me wrong, I see where you're coming from here. This stuff matters very little to me - but, for that reason, I didn't date people who had a \"walk down the aisle\" goal. You can't hold her desire to get married against her when you went into this KNOWING that was her goal. That's on you. Seems like you went into this not taking her deadline seriously or thinking she'd changed her mind, now being all \"Well, shucks\" when you're faced with the reality she wasn't playing around. What did you expect?", "Yta.  Your expenses are your responsibility.  4 months is plenty of time to find a job.  She wants a partner and you want to be a mooch.  You're threatening to send the relationship because she won't pull your weight too.  It's clear who is invested and it's not you.", "YTA.  \n\n\nYou're wanting to have your cake and eat it too.   You're getting all the perks of being married with none of the security or teamwork for her.  THAT is why she mentioned the marriage thing.  She's being expected to carry you but you're not in it for the long haul.  \n\n\nGet an interim job.  There has got to be a McDonald's or the like somewhere nearby that  you can supplement your UE with.  I don't know about where you live but you can usually make up to a certain amount without it cutting into your UE.    \n\n\nAct like a grown up and pull your own weight.", "YTA- you expect her to take on the responsibilities of taking care of you, while also telling her that you aren’t sure you want a full commitment with her. Why on earth would she pay for you knowing you haven’t decided to stay with her. She’s smart. Too many people take on the expenses of a partner with no recourse when the relationship ends. Don’t propose now just for the money, that would be a disaster of an idea.", "Lol. She’s not going to support you if she isn’t married to you. I think it’s funny you BOUGHT A CAR whilst unemployed and then expect her to cover your bills. \nYTA", "YTA. She knows her worth and has always told you her marriage goal, and you ignored it. \n\nAnd the fact she has a plan that she can just move in with her parents means she might have been considering that already. You wanting her to support you may have been the last straw.", "YTA. She is indeed correct. There is a difference between being involved and being engaged. Moving to engaged means there is at least a promise of marriage versus we live together. Especially since she made it clear upfront she wants marriage. If you’re so sure, why are you hesitant? Why haven’t you gotten even something minimum wage? Most McDonald’s hire anyone. She is completely right. You need to show your intentions. I would never cover expenses for a man I wasn’t at least engaged and planning the wedding with. Especially after four months of unemployment. Find something, ANYTHING, to tide you over until something more your forte comes along. I spent five months working Walmart asset protection while I looked around for my current position. Did I like it? No. Did it pay the bills so I didn’t become homeless? Yes. And I worked 40hr/week and still made time to find a new job that I liked better.", "YTA. She set pretty basic ground rules... You could have lied and just hit it and quit it or see the plan through. You didn't pick either. But now that you need something, you base marriage on the fact that she isn't willing to support you? She invest time. You want her to invest time and money on something that isn't showing a return.", "YTA. You're expecting a lot out of someone that you're hesitant to marry after three years. You have family to go live with, so you should do that.", "INFO\n\nDid you pay for her expenses while you were employed?", "YTA\n\n>Now she says I’m expecting too much from her since I’m not ready for marriage but expecting her to help me with rent.\n\nYes. She is right. You also say:\n\n>I’m sure she is the one, I’m just still hesitant about marriage\n\nThat doesn't make sense. If you are hesitant about marriage, then you aren't sure. You need to look inward and figure out what your real feelings are here. \n\nShe has made her expectations clear. And 4 months not working? Why didn't you pick up a retail or customer service job in the meantime while you were looking? Why did you even buy another car?? You should be relying on transit and working for minimum wage while you find something better if you are so broke. \n\nIt sucks to be laid off but it sounds like you are playing the victim here and as a woman I'd be very disappointed by your lack of responsibility.", "This is literally expecting the milk for free but refusing the buy the cow. \n\nOnly you also can’t buy the cow, and expect someone to throw in some ice cream and other bonuses.\n\nIt’s a crappy analogy, but the point is that if you aren’t willing to fully commit in the way she expressed needing, it’s within her right not to fulfill the benefits a marriage would offer.\n\nYTA", "YTA. She was very clear about her goals and expectations and you don’t think they matter. You need to give her the respect of either giving her what she wants (happily, without resentment ) or letting her go find someone who will. \n\nI absolutely understand why she won’t give you money- you have clearly shown that her needs and goals are not important to you, that your timeline is the only one you care about, and your needs are all you care about. I would never, ever financially entangle myself with someone who wasn’t willing to commit to me, and I’m guessing this is how your girlfriend feels as well. You are not married- she doesn’t need to help you in any way, and she shouldn’t, given that you have proven unreliable about commitment and she’d have absolutely no protection or ability to get her money back if you flake. \n\nYou don’t understand why marriage matters, so this tells me she should absolutely move on and find someone whose values are more closely aligned with hers. You are dismissing something that is clearly very important to her, refusing to attempt to understand WHY it’s important, and then mad that she won’t bend over backwards for you.", "YTA.  You are not sure you are ready for marriage yet you want her to act like your wife and pay your bills.  She isn't wasting 3 years \"over covering a bit more rent and groceries\"; she has wasted 3 years on you and her expectations of you.  \n\nIt is time for her to move on with her life and shed the dead weight that is you.", "You’re the asshole, if you aren’t committed enough to get married you shouldn’t expect her to be committed enough to pay your bills.", "This woman is not pissing around. She wants commitment, and these are the consequences of not being committed to her, not the other way around. You missed your chance, someone with this much self worth and confidence isn’t going to wait for you to pull head from ass. Good luck with your job and apartment search.", "YTA \n\nI think it’s the way you said it. You want her to cover you instead of loaning the money to you, which you’ll pay back.\n\nYou are a grown adult who should have saved more for a rainy day. It’s not her job to cover you cos you two are not married. That was her point and you missed it. Sure, you could say the car breaking down wasn’t something expected. IDK how old you are but from the sounds of it, you should really learn to manage your finances.", "So you’re not ready to marry her but you expect her to support you? What’s logic is that? YTA", "You’re asking for Husband Level perks while on the Boyfriend Package. YTA", "YTA\n\n>We have been serious for a long time, why is the ring and marriage all that matters?! \n\nWell, it obviously matters to your gf. And you can stop complaing bc she was upfront about this at the 3rd(!!) date. \n\nSo her argument about you not being comitted enough from her pov is valid. For her, only a proposal and marriage shows comittment. If you are not fine with this, you should have addressed it or left a long time ago. \n\nYou are kind of lucky to still have a gf at this point. My former collegue was also very upfront with her bf about getting married, after 4 yrs relationship she gave her guy a 2yrs deadline, reminded him 6 and then 3 months before the deadline that time is running up (and he always assured her not to worry, he is working on it) and after not getting a proposal, she broke up with him 5min after midnight. He was oc pikachu face, but she moved out within a month, blocked him, started dating and a year later is planning her marriage. The ex still tries to get her back till this day.  His claim? Oc he is going to propose, but on his timeline, so maybe in 5, 6 yrs down the road. He took her for granted bc \"she will never leave me, its just a threat\". Yeah, well dude, it wasn't :)  Do i think she is a little nuts? Maybe, but this girl at least has the balls to voice what she needs from her partner and go through with it. Marriage is just more important to her than everything else, even we as her collegues knew this, her ex definitly knew it.", "Yta she is not responsible for you. She is your gf not your wife and certainly not your free bank account.  If you need money take any job you can find.", "YTA, and soon to be a single one.", "YTA so you want wife benefits without the ring and commitment? Lmfao…", "YTA. Your gf was VERY clear that her goal in a relationship is marriage. You are “sure she is the one”, but refused to make the level of commitment she desires, and now want her to support you financially. She is right to break up with you.", "YTA. You want wife duties at girlfriend prices. Your inability to pay your rent is your own problem. If she was your wife that’d be a different situation. \n\nFrom her perspective you are a user. Who wants to be used? She already told you before you lost your job that she’s unhappy with the status of your relationship and you have not done anything to remedy that.\n\nHelp you with rent? She has one foot out the door. A woman will tell you exactly what you need to do to make her happy if you don’t listen or won’t act, it’s on you when the relationship ends.", "YTA. \n\nShe told you what she wanted from the start. You don't plan to marry her, obviously, and using her unwillingness to pay for you as a reason to not marry her just highlights that. \n\nYou want wife benefits when you've made it clear through inaction you don't want to marry her. Cause at 3 years you should know, and you clearly *do* know that you don't want marriage. \n\nGo back to your parents. Yall are done.", "YTA \n\nWhy did you buy a car but you didn’t have a job?  You’re not sure about marrying her but what her to cover you? I mean you’re not making any sense", "YTA - She is done with you. This is her opportunity to throw you out get her life back. If you wanted to marry her you would know. If you didn't figure it out in the first year of living together, the answer to the question of do you want to marry her is no.\n\nIf you were a fiance or a husband, this would be different, she would have known that the two of you were in this for life, and stuck by your side as your life partner. Right now you are someone she is dating/a roommate, and if you can't pull your weight, she has no reason to stay with you.", "This hurts my head. Yta and either cut it off or marry her, but man at this point she should run. She has such a fair point seeing as you're not even married and you're having financial issues you expect her to fix.", "YTA\n\nIf you’ve been living together for two years, and don’t know if you want to marry her, then you don’t want to marry her. \n\nYou have to shit or get off the pot.\n\nYou haven’t given her the type of partnership she wants. You are the classic example of wanting your cake while at the same time eating it too.\n\nSounds more like you want a mommy.", "YTA\n\nShe's not good enough to be a wife but good enough to pay your bills?", "YTA\n\nShe was very clear on her expectations from the beginning. If she's the one and you know it, then just propose. PLUS you've been out of work for 4 months, plenty of time to at least have a little part time job. But you want her to help someone who won't help himself. Oh, sorry. You want to mooch off her till she gets fed up with your low-commitment ass and leaves", "YTA, not because you asked for help in the first place but because you're being dismissive of the underlying concerns she has in giving you money. And it looks like you're trying to flip the script on her a bit which isn't fair. She's worried you're using her so stop feeding that impression. \n\nIf you are actually serious about her I would apologize and tell her you are going to handle your situation independently, and that you hope she will be open to talking about marriage once you're employed again and don't have this issue hanging over the conversation.", "YTA. She doesn’t owe you shared finances until she has legal protections behind those shared finances.", "YTA.  Seriously - go hit the employment agency.", "YTA.\n\nShe told you she expected younto commit. You told her you need time and she didn't pressure you although she already felt like she wasted years of her life with you if you are unwilling to commit. \n\n*Now*, when it is convenient for *you* because you want financial help from her you tell her *she* is the one showing no interest in commitment.", "I'd work the lowest, shittiest job on the planet before I would expect someone to carry my weight.\n\nTotally, YTA.\n\nOh, BTW... The ring and marriage shows commitment, and that symbol is important to some people.", "Don't get married if you're not ready. But its also not her job to support you unless you've supported her in the past.", "You obviously are not ready for a real, adult commitment yet you expect her to support you? Nope, I would leave too, she can’t trust you and I don’t blame her.", "YTA.  OP let's break this down easily.\n\nYou think getting married after 3 years is too much commitment. But you want her to financially support your entirely while you have no job?  What benefits is she getting?  You hold all the cards at that point and are just actually a terrible partner. You ignore her very clear expectations for your convenience.  Then you want her money.\n\nAlso you aren't employeed for 4 months.  Why?  Did you not consider getting a crappy job elsewhere temporarily?  Like it sucks but your gf is not your safety net.", "YTA. Your expenses are not her responsibility. She was clear with her expectations about the relationship and wanting to be engaged. You won't propose even though you say she's the one, but you want her to foot your bills? It's no wonder she is hesitant to help you.", "YTA... you've been off work for 3 months? Why dont you have another job? Any job? \nMy husbands employment went bankrupt- he got a job cleaning toilets part time while looking for his new career. Part time supplemented EI and allowed him time for interviews and putting out resumes.  It took 6 months to find the work in his field that was what he wanted. Meanwhile toilets were cleaned.", "YTA", "YTA, so you’re not ready for marriage because of the “what if” but want that same women to support you for a indefinite time? Why does the 3 years only matter when it benefits you directly? The relationship is obviously over thankfully", "LMAO YTA and your girlfriend is a smart woman. I expect she will just break up with you soon enough since you can’t get your shit together.  Enjoy moving back home!", "YTA - one interview? And what did you do in the preceding 4 months besides collect unemployment?", "YTA\n\nShe's your GF, not your wife. This isn't a \"let's work it out\" scenario. This is a \"wow, what are you gonna do\" scenario.\n\nAt this point she's a romantic roommate. And from the sound of things she's about to bounce. She let you know she wanted to be married in 2 years. If you weren't about that you shouldn't have dated her. She was operating on good faith that you wanted the same things (otherwise why would she date you). She probably feels lied to and betrayed. \n\nSo get your head on straight and firm up. I suspect things are about to get tough financially and emotionally. Let me just say early on that it will eventually get easier. Don't go blaming others for your situation. Just accept it is what it is and work to make it better.", "yta, you’re grown, get a job, handle your shit", "YTA. your expenses, your responsibility. Your gf made it clear from the start what she wanted and expected from this relationship. She set a boundary and you are stepping all over it.", "Sorry but I wouldn’t cover your bills either. Seems that you could have at least found something temporary in 4 months. I wouldn’t pay the bills either is we aren’t at the very least engaged before you lost your job.", "Did you expect anything other than YTA here? Because goddamn. Honestly, good for her for putting her foot down. You’ve been stringing her along long enough and sorry, this is what you get. If I were her I would have just left you when you didn’t propose, so I *do* think she’s being a little immature, but eh. I think she’s justified.", "So… let me get this straight. She told you what her longterm conditions were, now you have already been dating for waaaay longer… you didn’t want to commit in any form but are now expecting her to finance your life? Why should she? You made it obvious that you don’t want any commitment but you want now to benefit from the advantages of commitment…? Yeah, YTA", "> I’m sure she is the one, I’m just still hesitant about marriage\n\nIf your hesitant about marriage surely you can understand that she would be hesitant to bankroll the lifestyle of someone who doesn't want to build a future with her. \n\nShe has been straightforward with you since the beginning. YTA. She is too much of a doormat because I would've been long gone once it became apparent my needs weren't going to be met in this relationship.", "YTA. I hope she leaves you. Because you're definitely not it for her. \n\nThat being said, good luck to you in your job search.", "The majority of straight women want to be married. They do not want wife responsibilities without actually being a wife, which is what you're asking for. Three years doesn't mean shit without a ring, it tells them they're okay to date but not okay to marry. You had your chance with \"the one\" but you were hesitant over.... marriage itself I guess? YTA to yourself.", "Entitled much.\n\nYTA", "OMG..I can't even..YTA... srsly", "YTA don’t expect wife type support from people who aren’t your wife", "YTA\n\nYou don’t want to marry her but want her to carry you financially without a commitment.\n\nLol she’s living every guy’s nightmare but has the balls to say no at cost to herself. Made respect for your gf", "YTA Stop whining! Pack your bags and move back to mommy's house. You played yourself! 🤣", "You may want to move home.  Mom?\n\nI'm sure she's done with you now.\n\nYou weren't sure about committing,  she's not sure about supporting you. \nBummer.", "YTA.  Wow.  You're not ready for marriage but ready for her to pay your bills?      I hope to god she wises up and leaves you for someone who values her.", "YTA.\n\nTime to move out and say goodbye. You're not ready for this relationship. \n\nAll you have right now are excuses. You're not going anywhere in life, you're not offering her what she wants, and you're asking her to support you, for what? \n\nWhen you do get your job, there'll be more excuses, won't there? You won't want to propose because you'll feel like you're just doing it to pay her back, or because she's pressuring you, or whatever else. \n\nThe longer you do this, the more of an AH you become. Just let it go.", "If I had a dollar for every time a girl stays with a dude for over half a decade waiting for a ring, breaks up with him when she finally puts her foot down, only to watch the dude get engaged to the next girl three months later, I would be sitting pretty. \n\nYou're either sure or you're not. You're not sure, so she has to make her choice. You already made yours. I don't care if you think her terms are ridiculous (I don't love marriage myself), you knew exactly what you were getting into. You fucked around and now you're finding out. \n\n3 years doesn't mean a lot if your end goal is marriage. It's just wasted time. Especially that extra year. And now you're salty she isn't doing more? Seems like she's already given you a grace period. If you wanted to be married, you would. You don't. So she shouldn't pay the bills for someone she isn't going to end up with. Yta.", "These comments are insane! How is not being ready for marriage equate to not helping with bills?\n\nIsn't this straight up blackmail ? Couples in healthy relationships are supposed to share finances and help each other.\n\nIf my SO of 3 F YEARS is going through a hard time, married or not, I'm helping.\n\nBut she is reasonable for not helping at all because he doesn't propose? So if he proposes, she will help then? Forcing him to marry so his bills are covered?\n\nNTA, she is.", "YTA. you’ve had 4 months to find ANYTHING. and your gf is clearly worried you’re not committed to her so why should she pay your bills? she’s right to be worried since you’re threatening the whole relationship over her not wanting to spend hundreds if not thousands on someone who won’t commit", "YTA - you are acting like a hobo", "YTA. You've shown her you haven't been serious the entire three years yall have been dating, so the fact you'd use that to guilt her is really gross. I think you both should split, there's clearly some resentment on both sides. You're also wasting her time, she wants a deeply committed relationship and you can't provide that. Why would she want to put MORE time and MONEY toward you when you've done so little?  \n\n\nEnjoy living at your parents, tbh I think that is really what's best for this relationship.", "Idk you kinda seem like asshole. But you said EI which sounds Canadian idk if other countries call it that. So for people saying she has to protect herself maybe I’m wrong but you guys should be in common law if you’re in Canada and that already has strong protections", "As someone who has been stuck twice footing the bill for boyfriends who get far to comfortable being unemployed, good for her. Wish I was as smart.", "Honestly I'm not trying to shame you but how do you go that long without a job I realize you might not get the dream scenario out of the gate but there are plenty of good paying jobs you could have done in the meantime.  I aside the fact that I do think if yall are serious about getting married  she should have been all in  because that's what actual commitment looks like  but I  want to know how you spent your time  I can pretty easily get a new job inside of a week and all I have is a bachelor's but if I couldn't find an it job I would do construction or foor service bar tending anything for an income. Though I have never been reliant on anyone else  even in serious relationships I always kept my and their money separated and it feels like your old lady feels similar which also should have come up if your spending life together but are you making more from unemployment than you would a blue collar job", "You know what - she’s a little bit right. A little crazy but a bit right. You weren’t ready for marriage that’s fine but that means you weren’t ready for the full commitment which includes finances therefore she has a point. Now maybe she should support you a little if it’s just paying 10 or 20% more but I don’t know your situation. I think NAH but you can’t expect her to act serious when you weren’t prepared to be serious.", "You're both AH in my opinion, but i'm leaning a bit more to your side simply because she sounds very toxic, and people in love should help each other.  \n\n\nTo me it's delusional to demand a proposal exactly 2 years upfront since the 3rd date. Nobody can actually make that promise that soon, and even if you're really willing to try, nobody can guarantee that it will be successful. First you have to spend few years together and see how it goes. Marriage should not be forced, it should come to you naturally when you both feel it's the right time. Relationships are not a planned script. Besides, proposal and marriage means nothing if you really love each other.  \n\n\nBut i have a feeling she's not looking for real love, i think she's just looking for a status. Maybe she's an opportunist and has some use from the marriage, otherwise i don't know why it's so important. It could be money, inheritance, or she wants to have kids and stay home all day while you work provide.. Some women are parasites like that, they want to secure their future by having a sugardaddy. They carefully plan their strategy and tactics, and they're slowly but sneakingly building towards a lazy spoiled life. She's being manipulative and blackmailing you from the start, setting a trap for you.  \n\n\nI completely understand her concern though, i would be worried too if i helped you with money and you bailed because we're not married. But if you really love someone you will help them and trust them they will stay, partners should be there for each other through thick and thin. Things like these are the building blocks towards marriage. I honestly don't think she really loves you if she's not willing to help. And possibly you don't love her that much either, since you're still not sure about marriage after 3 years. But she just seems very shallow, being stingy with money and only thinking about a piece of paper and a ring.  \n\n\nYou could've also found a small job during these 4 months, just to pay the bills. There's always jobs available for those willing to work. So you should also be more responsible for this situation. Besides, even if you wanted to propose her now you cannot buy a ring, and definitely can't afford the wedding. So you need to sort it out my dude. If you really think she's worth it, you need to put effort. But i honestly don't think you're right for each other. You should also not waste her time if she wants to get married ASAP, it will be either you or someone else by the sounds of it.", "YTA. Grow up, get a job, and stop mooching off a girl you won't marry. You chose to get a car after becoming unemployed. Don't make someone else pay for your shitty financial decisions, especially when you refuse to commit to them or respect them. Your behavior and way of thinking is honestly disgusting.", "Did you adjust your expenses at all when you lost your job? There's zero mention of you managing your own life, so yta.", "YTA, she's correct she wasted 3 years if even now you're still throwing a fit about a need she communicated at the start of the relationship. Regardless of your opinion of that need, she stated she wanted it and gave a timeframe, you should have split if you disagreed.", "YTA.\n\n>I’ve told her since she won’t help it’s shown me she isn’t serious too\n\nGaslighting as an unemployed person who can't pay their bills AND expecting their SO to pick up the slack is a bad look. She should have broke it off right there.", "INFO are you looking for a job? You don't say anything about looking for work.", "YTA.  Apparently, no, these three years don't count to you, so.... deal with the consequences.   Your GF (not your wife, not your fiancee) is not responsible to pay for your bills.  Go ahead, go home and live with your family.", "YTA.\n\nLook, your girlfriend has been crystal clear from the get-go about what she wanted and expected out of a relationship. She's told you what \"counts for something.\" You didn't give it to her. Did you think she was lying, or fudging, or was going to change her mind?\n\nYou don't get to get everything you want out of a relationship, completely ignore everything she wants, and then get pissy because she won't give you even more out of this lopsided relationship than you get already. You've had everything your way for three years, she doesn't like it, and now that you're placing even more demands on her with no return she's ready to walk. And instead of working on that, you're here on Reddit bitching that she won't support you financially too.\n\nYou don't have a long-term partner, you have a short-term one, because you wouldn't meet her criteria for what counts as a long-term relationship. Now she's making it clear that, since all you were willing to offer was a short-term relationship, she's not going to do anything more for you than she would for any other guy she's not in a long-term relationship with. \n\nTL;DR: Oh, look. It's the consequences of your actions.", "YTA\n\nYou knew that marriage is a short term goal for her. You've delayed it because it isn't important *for you*. \n\nNeither side is wrong, but now you're asking her for a commitment but haven't made the commitment she asked you for. \n\nI wouldn't date her, based on her insisting on marriage. But *you are*. You made that choice and blew it off. \n\nYou reap what you sow.", "4  months and you haven’t found anything?? I call BS. Go work at burger king or something until you find something", "NAH/ESH. \n\nYou guys are not compatible together. \n\nI think it's stupid for her to have a hard timeline of \"propose by now or else\" but you also KNEW she had this boundary, so it's just as stupid for you to ignore it. You are correct that you could easily walk away from an engagement as well, but I also see why she feels like you'd be taking advantage of her. Whether or not you agree with her timeline, you are not giving her something that is important to her, but expect her to give to you. \n\nThis is just not a reasonable relationship anymore, and possibly never was", "4 months ago? Get a job bud. Any job", "If GF was so adamant about being engaged then why didnt she ask OP to marry her? Its not a boundary to say we should be engaged at 2 years. Thats a wish and a hope. Why would OP marry her now? She can’t hold up the for richer or poorer part now. NTA", "Time for her to move on! YTA!!! Sorry bud, you are dead weight and her needs clearly don’t matter to you. It’s only about what you want", "So you want her to support you finantially when you are not willing to commit to her? Make up your mind and stop wasting her time", "You want marriage-level commitment from her without the marriage. Yta", "YTA\n\nSo, you don't want her pushing you into something you're not ready for and not comfortable with (marriage).\n\nBut it's ok for you to push her into doing something she's not comfortable with (floating your expenses).\n\nGot it.", "4 months without a job?1? That seems like a looooong time to me. You are focusing on the immediate problem while she seems to be seeing the bigger picture.\n\nWhy do you still have no job?\n\nAmazon is hiring.", "There are so many places hiring right now, it’s really difficult to imagine you can’t find work, unless you are setting the bar so high that nothing pans out.  If you truly wanted this relationship to work, you would treat looking for a job like a job.  Wake up at seven, check various resources to see who is hiring, and then set up at least three interviews.  Bringing in some money is better than none, and an expression of intention.  If you get a job at Starbucks, or Walmart, you can always upgrade from there, the biggest, hardest step is getting out there.  If those jobs aren’t “good enough” for you, you’re definitely TA, and you don’t deserve her, and she certainly shouldn’t be supporting you, nor should you expect her to.", "Hesitant about the idea of marriage? That would def make YTA when she’s told you that’s what she wants this whole time", "YTA. Looks like you messed  around and found out….", "YTA\n\nShe literally told you she wanted to be engaged at 2 years. You agreed, then didn't hold up your end of the bargain. Tough shit buddy.", "ESH. YTA  because you aren't ready to marry her after 3 years, yet you want her to support and help pay your bills.  She's TA because she accepted your lame excuse and still tendons in the relationship.\nY'all need to find someone new.", "YTA you’re a boyfriend, demanding husband privileges.", "Get a job, quit being a mooch.", "“We have been dating for 3 years doesn’t that count for something?” Obviously not if you haven’t even proposed or thought about it. Definitely TA here, she gave you very easy to understand expectations in the beginning of the relationship which you haven’t met at all. To say to her that since she won’t cover your bills that she’s not serious about the relationship when she’s put her feelings on hold for over a year to compromise with you shows exactly who is and isn’t serious about the relationship. Why she would stay with you after not having a job for almost half a year blows my mind.", "You have a new car, right? Congratulations! You can drive for Uber/Lyft to help cover the bills until you find a new job.  The pay is crap, and it will put a lot of wear on your vehicle, but it's quick cash in your pocket until you can find something better, and you can start almost immediately.  Better than nothing at least.\n\nYTA, by the way.  A girlfriend isn't a wife.  If you need to be supported, ask your parents for money.", "Maybe she's not the one", "So you want all the benefits with none of the commitment? YTA\n\nI feel bad for her because if you don't pay your portion, she will be evicted right along with you. Also you didn't need a car. People walk, bike, or ride a bus so you spend your last bit of money on something that wasn't absolutely necessary", "ESH. Your bills are your bills. If you can't afford the car you bought, sell it and use public transportation. She's trying to bribe you into proposing. She's passive-aggressive and unhappy, but she won't break up with you because she's already wasted so much time. She just needs to dump you if she's unhappy.", "YTA\n\nSorry bro you’re an adult man and you can’t expect anyone to support you. You can ask and they can say no.\n\nShe’s kinda right, shoulda proposed.\n\nGood luck on the job hunt…\n\nOn the record I’d say the same thing if the roles were reversed and you were the woman. If I expressed wanting to get married and my gf declined I’d probably just bail though lol. You not proposing at this point after she asked you to is the same as if you proposed and she said no…\n\nI challenge you to consider this:\n\nYou propose\n\nShe says no\n\nShe asks you to support her financially\n\nWhat are you gonna do bro?", "YTA. Stop being entitled and figured out a way to pull your weight. Be a man.", "Shes right, lol. YTA!", "YTA. You’re expecting the financial support that comes with marriage. She’s made her position clear from the start, you should have taken it seriously. Not sure what you were really expecting.", "NTA. If you're paying your own personal expenses and just need a bit of help covering the shared ones I don't think that's outlandish especially living together together for 2 years. Also holy the comments are delusional. I truly HATE how marriage is viewed as this be all end all must be married to prove commitment thing. Get real people its a glorified piece of paper, that fails something like 40% of the time and almost no one follows the vows they take properly anyway.", "Actions, I have someone I’d like you to meet.  Say hello to Consequences.", "There are jobs out there.  Go get one.", "Im going to go against the grain here and say NTA. Sometimes life doesn't allow for 2-year and 3-year plans. WTF does it mean that at 2 years, you should be married? Sometimes life happens. How can you be ok to propose when your life is crumbling?\n\nShe isn't your partner. She is looking to extract the things she wants from your relationship but isn't willing to help you in your time of need.\n\nEven though I disagree most times when reddit suggests this and reddit is way too trigger-happy with this, ditch her.", "YTA. She doesn’t owe you anything. Take care of yourself.", "NTA. My girlfriend and I have been together for 6 years. For those saying that she doesn’t need to help him because they aren’t “married” and children. My girlfriend and I have both lost jobs and had to cover each others expenses and different times. Also 4 months in not enough time to find a real job. I had to get a shitty retail job after 6 because I could not get hired. I think the girlfriend is being toxic and manipulative. “You want my support? Marry me and then we’ll talk.”", "Yta she's the one but you won't marry her?  You expect her to pay your bills like a wife would,  but won't marry her?\n\n*Spouses* promise 'for richer or for poorer'.  You've made it clear she isn't worthy of being your spouse.", "Well I was gonna totally be on your side but it seems like you want husband benefits while refusing to actually be a husband?\n\nYou are telling us she is the one, and that she made her marriage desires clear to you from the start… well idk. 2 years is quick to get married. But it seems she isn’t willing to be lead on and at this point she does feel lead on.\n\nNAH i think, you want a longer dating period but she is seeing your waiting around as a lack of commitment and doesn’t trust the relationship anymore", "NTA \nI am in similar position. My boyfriend is now also searching for a job. We are together for 3 years and live together.\nI never ever even had a doubt in my head to not help the person I love while he has difficulties. Because that's what partners are supposed to do. When there is difficult time - they help each other. \nFor me ring means nothing. It is a formality, which benefits only when you deal with bureaucratic stuff. \nYou need to find a person who shares your values. And so far I don't see your girlfriend has the same outlook on relationships as you.", "4 months, bro? \n\nYou're being the asshole to her and yourself. How can you let yourself sit around for 120+ days wasting away, do you not value yourself?\n\nYou're a man, you take care of yourself, that's the way of the world. Eventually, your girl is going to leave you anyway if  you keep acting like this, you have to show some degree of competence. \n\nYou should be filling out 20+ applications a day, even to jobs you don't want, just to have some income.  Then, while you're working that shitty job you hate, keep filling out applications til you get one you like.\n\nThere's no excuse for 4 months, especially when you have bills and obligations.\n\nAs for the marriage thing, don't be with someone who doesn't want what you do. It's needless stress on the relationship. And don't blackmail her, \"You don't pay my bills, so you must not be serious about us.\"\n\nThat's ridiculous. Get out and get a job. You're allowing yourself to be a bum, and I wouldn't be surprised if you're feeling depressed over this, but it's a choice you've made. Stop making that choice and GO TO WORK. \n\nApplications not yielding results? Walk into a place with a help wanted sign and chat the owner up. I guarantee you'll get a job. \n\nLife is hard, but no one is ever going to give as much of a fuck about you as you need to give about yourself to succeed. Start giving a fuck, stop wasting time.", "Idk if you're the AH or not but if your gf is saying stuff like \"I wasted 3 years with you\" then she isn't the one my guy. Get a new job and move out ASAP and cut contact cause that attitude is toxic.", "Info \n\nDoes she have the money to pay for all of the expenses? \n\nWhat all expenses are you trying to get her to pay for you?", "Info: what would any sort of proposal mean to her now? If you do it soon there's no way that it looks like it was anything other than self interest on your part. She's backed you into a corner where it's no longer possible for you to meaningfully propose and look like you mean it.", "INFO. Did you lose your job then buy a car? Why?", "NTA.  Your girlfriend is telling you who she is, and what is important to her.  \n\n\nIn your head, the two of your are a unit, and should support each other.  I mean, you'd pay her half of the rent, if she was out of work, right?    It's unclear, since you haven't told us anything that has ever happened in the last three years where you were supportive of her in a time of crisis.  \n\n\nBut, in her head, that kind of support doesn't happen until after marriage.  \n\n\nYou're stringing her along, because you're not sure you're ready for marriage.  She told you what she wanted, and she's stayed a lot past the due date on this relationship.  \n\n\nPut up or shut up.  Either go ahead and propose and start making plans to marry (and, please, please, please get some pre-marital counseling so the two of you are on the same page about it) or tell her that you're not ever going to ask her, and let her go.", "Info: how many job applications have you filled out this week?", "YTA. Why should she commit to you with her money even though you will not commit to her with proposing?", "You guys are both AH here.  Get your shit together", "YTA, it sucks you had to deal with the consequences of not taking the next step instantly but that's what this is.\nIf you aren't married, I wouldn't be tangling my financial life for anyone. You want the perks of marriage from her with literally not even your own word that you'll love her for life. \n\nShe covers you for thousands of dollars, then you decide she's not the one when you get a new job. She covers you, you get lazy and dont get a job for a longer time. There wouldn't be financial advisors etc if stuff didn't happen regularly.", "NTA\n\nHonestly it's weird that she wants to hold getting engaged over your head. I suppose your age does matter. But unless you are over 40, I really don't think 2 yrs is like \"a long time\" to wait to be engaged. \n\nAlso it's absurd given your overall economic situation that she expected it. Given you've blown through your savings - what were you going to buy a ring with or pay for a wedding with? \n\nIt sounds like she values status - being married - over being actually financially stable. It's not unreasonable on your part to want to be more stable before committing, legally. \n\nAnyhow. It sounds like she values other things more than you and you are a placeholder. I would want to be with someone who just wants to be with me, no matter what.", " Gosh. ESH, including most of the comments. Toxic AF. Run OP.", "YTA - How have you been unemployed this long. That's the gist of my issue here. It'd be one thing if you got fired and had no savings or something, but you had savings, and you had 4 months to find another job. I get it maybe you work in a field that takes longer to get a job in but in the meantime you should've been working somewhere to bring money into the household.", "You know she's the one? But won't get married? Also she refuses to share expenses, yall are living like two separate people and not one unit.  When me and my wife first moved in together the bills became OUR bills, not mine and hers.  She ain't the one bro, and neither are you at this point.  Gain some more life experience then try again.", "Are you in the US?  If so, unemployment is so low, the only reason to be unemployed is because you choose not to work.  If I lost my job, I could get aa handful offers tomorrow if I tried.\n\nSo why are you not working?  For real?\n\nI can understand why someone would not support a bf who chooses not to work.", ">She had told me 3 dates in she expected to be engaged in about 2 years of dating and is very unhappy with me because I didn’t propose. I’m sure she is the one,\n\nyikes", "Eh bullet dodged. \n\nLady needs a contract with the government in order to help the person she apparently loved enough to spend the rest of her life with. \n\nShe just wants to be married, doesn’t seem like she cares much who it’s to. \n\nProbably would have ended up the same way if you were married before you lost your job.", "So she isn't getting what she wants from the relationship (marriage), but you expect her to support you like you two are married?\n\nESH (her for not leaving you after you have led her on).", "NTA. Your girlfriend sounds like a needy brat. That she's fine with ending the lease and moving back home just because you haven't gotten married is madness, and shows she cares more about being married, than being with you.\n\nUltimately, couples that love each other, help each other. There's obviously a reason you've not proposed, but it sounds like she's not willing to figure out what that is, and just treats you like shit instead. It's probably her childish attitude that is subconsciously stopping you from asking the question.\n\nShe's inadvertently offered you the chance to dodge a bullet here - end it, move out, move on, find someone who cares about you. Good luck with the job hunting.", "Neither of you are ready for anything.", "YTA. But she ain’t no winner either. You both need to move on.", "ESH. What a shitshow.\n\nIf you don't want to get married, fine. She wants to.\n\nIf she doesn't want to help you when you're down, fine, but she can't expect it to be taken as anything other than her choosing to end the relationship.\n\nIt's funny how things work out when you don't want to commit.", "Wow I can’t believe all these YTA - I Find it funny how women expect a man to pay all the bills…. But once a man needs help from\nHis woman, temporarily might I add, oh no he’s asking too much. If you were considering marrying this dude, why wouldn’t you help him when he’s down? She’s a walking red flag just by that alone, not even mentioning her saying the last 3 years was a waste…..dude get yourself a girl that actually cares for you and will help you regardless.", "NTA 3rd date in and talking about marriage? Dude RUN! She literally values marriage over you. Break up with her and find someone who actually cares about you.", "Woooooow, some of you have some wild takes on this, I think I'm the only one that can logically say y'all are wildin, a lot of you have never been in a rough spot. Guys been put a roof over his girls head for year's, if she has expectations and they haven't been met and she hasn't left then no she's not upfront wtf. And on OP post we have literally such little info in terms of what his job is what his field is like and in the current market were in finding a job is a task and a half, pull ya heads out and and put his shoes on, if my gf of 3 years, 3 whole year's doesn't want to help me whennim down oh boy, that ring’s never coming. Wake up, yes ppl have expectations I'm sure he didn't expect to get let go, I'm sure he didn't expect to struggle to find work but shit happens. OP dumb the girl, get a nice new job and keep it pushing my man.", "NTA. She has shown you who she is. IF you lost your job after the marriage and she had to help id bet she would file for divorce first.", "Don't bother, it's over anyway, go back to your family if you can, and forget about her. I would say NTA, but you were a fool to think that she would support you, at least now you understand that you can't rely on her, i hope you got a lesson from this.", "ESH, but she is not “the one” for you. She’s not the ‘for richer or poorer’ type. She sees the relationship as transactional. \n\nYou only suck bc you are expecting rather than asking and bc you could be finding part time jobs to cover expenses.", "ESH: You knew you weren't ready for marriage yet here you are 3 years later still with her demanding her to cover rent and living expenses while unemployed. \n\nNow granted, her demanding marriage after a seemingly short time is another red flag, but that's on you buddy, and also my opinion. I know people who dated for around a decade and still haven't put a ring on it. You shoulda left when you had the chance she had you on the clock like the conductor from the Polar Express timing them getting to the North Pole.\n\nBut yea, everyone sucks here.", "I will go with NTA cause marriage is something that has to come naturally and not because someone pushes it on you. I know plenty of people who aren’t married yet share a house, have kids and all the fuzz.. as a woman I’m also pretty sure she’d expect you to help her if the roles were inverted. \n\nYour phrasing might be a bit off and 4 months is enough time to find something, so maybe accept the next job offer you get and change while already working if you find something better. This said, true love means support also, so being married actually changes shit. I’m not married and when my man is short on something I cover for the bills and I don’t even question it one second. \n\nMight be that I’m from a different culture than most of the commenters but hey this is how it goes by us. Sometimes you might need help and sometimes it might be someone else, if you can do it you do and don’t ask too many questions if you have to spend a lifetime together anyways (regardless of the marriage, since you say she’s the one but you need a bit more time before you pop the question. I don’t see issues in that either)", "NTA she sounds a bit mental.", "ESH\n\nIf I had a girlfriend I'd want to support her through tough times like losing a job. \n\nI see why a lot of people consider YTA and I am trying to get it but I wonder if people would be saying if it was the opposite.\n\nI can see why she has declined to help out. But I won't say your an asshole.", "What this tells me is she doesn’t really love you only what you can provide for her, marriage being her #1 priority. It’s probably better you found out now then more years down the road!", "Soft ESH - you’re clearly aware of her desire to get married, and aren’t ready to make that step (which is fine), but then expecting the shared finances is a a bit much from you. It’s not “why is the ring and marriage all that matter”, it’s that you know do to your gf. \n\nYour gf is clearly bitter about no ring, and I would think given the length of the relationship, it would be important to her to help you so you don’t have to move back with family. She’s shooting herself in the foot by her stance, though.", "NTA.  If she cares so much about marriage, why didn't she propose to you?  Why is she sitting on her ass waiting for you to act?", "ESH. her stupid behavior about marriage would probably be enough to be a dealbreaker for me. she sounds quite toxic. but also, you’ve had enough time to find work for yourself and pay your own bills. find a new job and a new girlfriend i guess", "NTA - and dang, are you sure you want to marry this woman?", "ESH. You're an adult and therefore should be in charge of your own bills. BUT and a big one) WTF is your gf still with you if you didn't meet her expectations? As in, she had a timeline, standard, whatever, but is still there. It's an insult to you both, as time is the one thing you can't get back. It feels like she's punishing you for not proposing, which is an asshole move in itself. \n\nSo you didn't propose. The adult mature thing would have been to talk to you about it and/or break up with you, not hold finances over your head because she didn't get what she wanted.", "Is she living with you?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI lost my job 4 months ago and EI doesn’t cover my full living expenses. I had to buy a car since mine had 330,000 km on it and the engine issue was worth fixing. After that I had couple thousand saved and that has been completely wiped out and now I’m not able to cover all my expenses. I asked my gf to help cover my expenses and she has refused because I didn’t propose before this. We had been dating for 3 years and moved in for 2. \n\nShe had told me 3 dates in she expected to be engaged in about 2 years of dating and is very unhappy with me because I didn’t propose. I’m sure she is the one, I’m just still hesitate about marriage and she has told me she is trying to get over the fact she wasted 3 years with me. I told her to give me some time and she has thankfully not pushed it. This was shortly before my work announced they were cutting people and I was let go. \n\nNow she says I’m expecting too much from her since I’m not ready for marriage but expecting her to help me with rent. We have been dating for 3 years doesn’t that count for something?! If it was a year in I understand if it was too early but we have been together for a long time. But she told it was meaningless because I haven’t proposed and she refuses to help me as I could just decide I don’t want marriage and bail at any time. I could have bailed at anytime but I didn’t and we have been serious for a long time, why is the ring and marriage all that matter?!\n\nI’ve told her since she won’t help it’s shown me she isn’t serious too and she told me it’s fine we can just end the lease and I can go back to live with family if I can’t afford rent here. I’m getting calls back and did an interview already although I didn’t get it it’s crazy to me she would waste 3 years over covering a bit more rent and groceries.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: Do you even plan on marrying her?", "INFO\n\nIn what field do you work?\n\nIs it normal for you to find no job for 4 months?\n\nDid you write applications every day for 4 months straight and didn't find anything?\n\nYou said you get less money from working full time min wage compared to being unemployed. Gow does that work?", "YTA", "YTA .. op does not want to get married and its possible he doesn't know it himself. It seems that gf has pretty much made up her mind about breaking up with op", "If she thinks she wasted 3 years with you, she's not \"the one\". Get real and get your act together.\n\nYTA", "YTA.  OP should grow up.  If OP can’t find employment in 4 months to cover his expenses he’s either spending too much or being too picky. \n\nEither way it’s not her problem.  I practice family law and I have yet to see a fella who would pay what a partner is owed if she was a wife if he was married.  OP is “hesitant” about marriage?!  Is that because of something she did or because he’s a child?  Either way GF should not lift a finger to help him and maybe even ditch him.", ">I’m not able to cover all my expenses. I asked my gf to help cover my expenses and she has refused because I didn’t propose before this. We had been dating for 3 years and moved in for 2.\n\n>She had told me 3 dates in she expected to be engaged in about 2 years of dating and is very unhappy with me because I didn’t propose. I’m sure she is the one, I’m just still hesitant about marriage and she has told me she is trying to get over the fact she wasted 3 years with me\n\nY'all sound lovely", "YTA - your concerns and needs are important but hers aren't? Boyyyyyyy, you are lucky she's still with you.", "YTA \nShe’s not perfect for saying she wasted her time with you, but you’re now expecting her to cover your bills when you could dip out at anytime and wouldn’t be obligated to pay her back? I moved with my partner to a new state for his work and he covered my share of the bills for a period while I looked for work, but we had already promised to get married as soon as we were able (COVID made it more difficult).", "YTA. \n\nIf you aren't ready for committment, you aren't ready to ask someone else to pay your bills for you. lol. Oof.", "YTA. I graduated during the big recession with a degree in IT and there were no jobs available where I lived. I worked as a cashier to pay for my half of the rent while I continued the job search. Sometimes you need to take any job rather than \"the perfect job\". You said you have a new car. Uber/food delivery will get you some cash in the interim.", "YTA\n\nYou don’t get the benefits of a marriage partnership without actually being married. Until then, you are two independent individuals who happen to live together and have benefits. would you ask a friend to support you? A roommate?", "YTA and the mental gymnastics you’ve done here to try to make your gf feel obligated to cover your costs is straight up manipulative. \n\nWomen are taught not to be a wife for a boyfriend. Your gf is protecting herself, and is maybe right to do so considering you pulled the “well obv you’re not serious, why don’t I just leave” card.", "YTA she needs to never be with you. She’s not getting you her and will only have you become an albatross around her neck.", "I don’t even have to read the whole thing the title was more than enough. YTA", "YTA… you don’t want to be married, which is totally fine and I get it, but you also want her to cover the bills like she’s your wife… Kind of wanting your cake and eating it too.", "YTA", "YTA, “I’m not gonna marry her but I expect her to fulfill the role of a wife by providing for me” lol", "When I figured out my partner was the one I still wanted to be a little more set up in life — housing, her schooling, our careers. Yeah, I know you can deal with this stuff while married, but I don’t want “our married life” to begin by dealing with the same stuff as when we met.", "Good thing he hesitated because now he sees she not the one. He will dodge a massive bullet here.", ">This is the epitome of expecting \"wife duties for girlfriend wages.\n\nYou have hit the nail on the head.  He had no problem making sure she knew he didn't want to be fully committed to her but now he wants her to be committed to him.  Good for her.", "I love Girlfriend's shiny, strong spine!  \"Wife duties for girlfriend wages,\" indeed.  She's got her head on straight and good for her!", "[removed]", "You know I was on the fence until I read this comment and you’re so right. \n\n> wife duties for girlfriend wages \n\nIncredible", "Wife duties for no wages ... She's expected to pay for the privilege!", "I agree with this!!  She was incredibly open about what she wants/needs.  Good for her.", "This was so satisfying to read to be honest. She was clear in what she wanted, had the communication throughout the relationship to reaffirm that goal but loved him enough to stay (which proves that she is not just in for money or to marry anybody, she wanted him). And finally that queen put boundaries in place when she felt disrespected and when she understood that he was not going to commit more.\n\n\nThat some level of badassitude", "“wife duties for girlfriend wages” is 100% what this is! nailed it.", "Upvoting for the office ref", "Exactly this.", "Perfectly said.", "I couldn’t word this better if I tried.  YTA OP", "This. Nailed it.", "Yup. This guy needs to get a job and stop leading his GF on if he’s not into marriage.", "I agree with this; \nI’m sorry but by 2-3 years max you should know if you are at the very least interested in spending your life together. \nNo way would I have waited around this long only for this reject to then expect me to front his costs like an ENGAGED/MARRIED couple would do. OP is 100% the AH.", "Well said. Expecting wife-y level gifts while only giving boyfriend-level commitment.", "Nothing a relationship partner loves more than being taken for granted.", "And if they’ve been serious for a while and he’s sure anyway why not propose, then ? It goes both ways.", "This is precisely the situation where if he'd taken her openly stated goals seriously, and dated with the intention of a similar goal, he'd be covered now. Like if he'd proposed and they were at least engaged right now, he'd probably have a ride or die partner to get through this with.", "The fact that he’s expecting wifey duties from his girlfriend has me dead lmfao break up already damn", "He's expecting wife level commitment on a girlfriend status.", "can you write my comments for like a week?  I need more HP.", "Agreed ESH", "Facts. You did leave out one thing though. She said she wasted her life with him. That's uncalled for and super toxic. Both of them are AHs but she needs to find someone else if her only goal in a relationship is to get married. To me I thought it was about growing together not some bs about \"i love you so much I want the government involved\".", "It’s month to month lease so we could leave with a months notice. We were on year to year but then it’s expired. That’s why she won’t help with my portion of the rent. She could just force me to move to my family", "hit it on the head. Op here can easily go work at mcdonald’s or a local gas station while he tries to find a new career. \nthere is no reason op should be still unemployed outside of laziness.", "Disagree with the 4 months. I've been looking for 7 months and NOTHING. \n\nGreat resume, plenty of experience. It's fucking rough out there right now. Depends on his history, ofc.\n\nOverwualified for many places, even tried a lesser resume and it didn't work.", "Each one of my husband’s layoffs and unemployments lasted over a year. I got these same comments from outsiders. You do not know the OP’s career field or the job market in his area. We don’t know his age, but age discrimination is very real.\n\nHe could find a couple of part-time jobs. He still needs spare time to apply and interview. Next thing he knows, she’s complaining that she never sees him and he isn’t invested in their relationship.", "Yea... I don't get the 4 months of the unemployed part. I could understand if you had really high paying skillets and wanted to focus all your time on acquiring a role that paid big. But if a couple thousand savings over 4 months was what held you together. There are plenty of employers who will hire you on the spot for that kind of money. Plus, they would be extra eager to give yoy nights/weekends which leave your standard office hours free to j9b hunt and interview. Not the ideal lifestyle doing that, but the way I see it, you can either suck it up and struggle now or struggle when you are old and dont have the strength of youth to power through it.", "Yes! Good to see someone else mention the car. \n\nI could see his point in that I lived with my boyfriend for 6 years before getting married. I covered most of the bills for some part of that time when he finished his studies. Maybe not the best move if we had broken up but I trusted that he would do the same when needed and he did later (after the marriage). We were not in a rush to get married. \n\nBut first NO for marriage then using savings to buy a car and expexting the girlfriend to cover bills? That is like expecting the girlfriend to buy the car for him. Necessities first!", "She is moving in with her best friend if we end the lease she said. I have to move in with my family because I don’t have enough income to sign for a place", "She wouldn’t tell me the reason but she refused to sleep with me until after I asked her to be exclusive. Afterwards she said she won’t sleep with anyone who sees multiple people. She has a habit of doing this kind of thing and being really stubborn", "Lol but telling someone on the 3rd date u want to be married by a certain time isn’t expecting a lot out of someone? Especially someone you just met? Girls a nut OP she break up with her.", "No we went 50/50 on most things", "I don’t like this analogy.  What farmer allows people to milk the cow for free?  What would the farmer get out of that?  Seems sus. \n\nIf it’s stealing the milk, that’s a crime, you can’t get milk for free unless you are stealing it. Shame on you for stealing milk.", "I said I would pay her back but she says I could just bail and run if I don’t want to pay her back so there is no security for her. I could get engaged and then bail and run anyway. What’s the security in an engagement or marriage?", "I agree with this exactly. YTA, OP. She even tried to get you into the husband level but you didn’t want it and now are mad about it", "He had ONE interview…", "Makes me sad I had to scroll so much to read this... Jesus what is wrong with people. Don't you help your loved one unless a piece of paper tells you to? Wife duties? Girlfriend duties? What about loving someone and helping for the sake of helping.", "She told him 3 years ago that her deal was marriage, or she wasn't interested.  Now the check's come due.  He knew going in that she had a timeline, he breezed past the timeline, and now he is shocked that she's not going to support him.", "This is the only thing I agree with... \nPeople are so harsh with other people's situations and feelings.\n\nI am kinda divided into NTA and a very soft YTA. \nSoft YTA because I am not sure how hard you would be looking for a job (sometimes we just get too comfortable or we wait for the right thing and keep other options away)...\nAlso, I understand the struggle with marriage topics.\nFor me marriage means absolutely nothing. If I was together with someone who really wants it, I am not sure if I would marry just to make the other person happy, since it would be a huge investment for something that means 0 to me... \nHowever, it would also be extremely difficult for me to let go of someone that I really love \"\"\"\"just\"\"\"\" for this reason... I would try any other option before breaking up. \n\nI really do NOT understand why expecting the person that I love (and that loves me) to support me during a bad time is ONLY Husband or Wife material... \nThis sounds really silly in my head... I mean, it's someone you love and possibly want to spend many many years with - even without marriage.\n\nSo yeah... Because I don't know your full situation, I will stand with NTA\n\nHOWEVER, I agree you both should sit together and talk about your future together - since you both have different life goals that might interfere with your happiness!\n\nLots of luck!\n\nEdit: typos", "I bought my car 3 months before I was laid off", "40 is too late for a woman who wants to have children.   We don't know if she does or not, of course.   Furthermore, it is easier for a woman to find a partner when she's young, because many older men (you can see it in dating ads) are looking for women much younger than themselves.", "How is it toxic? She was as open as one could be. He led her on. He now wants to ride on her finances. If sb is toxic than it’s him", "Open communication isn’t a yikes. It’s a green flag. If his response was “I’m open to marriage but not in that 2 year timeline”, then it’s on her to decide early in the relationship  If it’s worth continuing. \n\nIf his response was “I agree 2 years of dating is enough time to get a proposal” or agreeing in any  similar way, he’s a major asshole.", "She stated her terms. He agreed. He knew what was expected. He could have left at the third date", "His mommy and daddy care, that's why he gets to move in with them now.", "They both put a roof over their heads.  He was doing half the roof-buying.  \n\n> if my gf of 3 years, 3 whole year's doesn't want to help me whennim down oh boy, that ring’s never coming.\n\nYeah, and if the ring's not coming after 3 whole years, she's going to let somebody else support him, not her.  Fair's fair.", "How can she be a richer or poorer type when he refuses to take those vows.", "Yes we signed the lease together. But it’s month to month so we could live with a month notice", "That doesn't sound like being hesitant though. If you're waiting to propose (like to save enough money), you're not hesitant, you're just waiting for a specific goal. At least that's how I see it", "And in retrospect how exactly did that help, if you don't mind me asking?", "Sounds more like she’s the one dodging the bullet.", "She wanted him to be fully committed to her, he refused. Now that he’s in a tight spot he wants her to be fully committed to him. Covering rent for him would be what someone engaged or married would do, not a simple gf.", "Yeah, if he'd proposed a year ago, she'd be covering his rent...lol", "Ehhh which one of the two is currently unemployed? Who exactly is dodging a bullet here?  Hint: it’s not the able bodied man who can’t get a job.", "He didn't dodge anything, he shot himself in the foot", "I don't think so. I don't care about marriage, but his gf obviously only counts being engaged or married as a comitted relationship and made this very clear already during the beginning of dating. So from his pov they are maybe in a comitted relationship, but from her pov they aren't and she told him so even before he lost his job.\n\nIts not really smart to support an uncomitted partner, especially if she wants to get married and most likely is saving towards this. Sure, its nice to support your gf/bf in time of needs, but demanding/expecting it is very entitled. You can may ask to borrow some money, but not expecting to get a free ride, especially if your relationship was doomed anyway even before unemployment.  Op may thinks she chilled out on marriage after not proposing for 3 years, but thats BS, she just matched his level of comittment from her pov. \n\nI think op was so relieved she stopped pressuring about marriage, that he didn't took the time to realize that her level of comittment got lower and lower (and pretty sure resentements were growing and growing to the point she didn't gave a shit anymore). \n\nWhenever a bf of mine got in trouble, i sometimes offered to help them, but would have been very taken aback if they would have told me they expected it.", "OP: I'm not willing to further commit to you when I already have what I want from this relationship. I don't see any reason to sacrifice my wants for your sense of security.\n\nGF: Okay, that's fair. In that case, I'm not willing to further support you at a level that is typically reserved for marriage. I don't see any reason to sacrifice my wants for your sense of security.\n\nOP: SHOCKED PIKACHU FACE", "I don't disagree, but I also want to empathise with OP a bit here. Considering he just lost his job, I would say that is a bad place to start a marriage with. If he would consider marrying his gf, and that's a big if, but wants to have a stabler platform from the getgo, maybe that would be the way to go and talk with her \\*NOW\\*.\n\nBut he could also have said this before asking her for money, now it will merely look as stalling and a pity play, I'm afraid.\n\nHowever, I'll say ESH as the girlfriend is behaving in a very bizarre way (IMHO).", "There is no such thing as wifey duties, just spousal responsibilities. And if they're living together then she should 100% be helping him out tho I do see her side as she told him up front.", "I mean I’m having trouble finding much fault in the gf’s side of things other than her being responsible for the rent because they live together. \n\nShe was clear with him that she wanted to get engaged and married. She voiced her concerns and he asked for more time. She did not push and now when things are at a low for him he wants her to be fully committed despite him not making the gesture to her that he’s fully committed. \n\nIt’s clear that she has a strong delineation between bf/gf and being engaged and what comes with those commitments. \n\nMinimizing the commitment involved with a proposal down to “she just cares about a ring and marriage” is so telling to me. He may think that way but she clearly doesn’t.", ">she is trying to get over the fact she wasted 3 years with me\n\nOP's actual words. I just did a Ctrl+F and OP doesn't use the word \"life\" in his entire post. \n\nShe is absolutely correct that those years were wasted if he knew what she wanted, timeline wise, and never intended to follow through while allowing her to think he would.", "Nobody said \"her only goal was to get married.\"  She said that this was *a* goal.  She said up-front that it was a deal-breaker for her if they didn't get married in 2 years, and he signed on for that.\n\nNow they've been together for 5 years.  He didn't live up to her deal-breaker.  Now he is asking for her to support him financially, even though he hasn't committed to her.", "It's not uncalled for. She's probably realizing that she *has* wasted her time dating someone for three years who 1) hasn't proposed 2) expects her to cover his finances even though he has shown no interest in committing to a marriage.", "It’s your way of living and that’s fine. She had her goal and was clear about it upfront. The fact that you don’t have the same goal has her doesn’t invalidate her’s .\n\nAnd it’s not toxic to feel like you have been played when you where clear about a goal and the person in front of you kept ignoring it. \n\nNow he ask for something while giving nothing in return.", "That was incredibly smart of her, honestly. She could see you not getting a job and not proposing and she found a way out of the shitty situation. Good for her.", "or you could get a job", "If anything, you're simply proving to her you're not a wise investment overall.\n\nYou're not proving to her or yourself that you're partner material. The whole marriage thing is \"for better or for worse, sickness and health, for richer or for poorer.\" Etcetera. You couldn't even commit to her when things were *better*, before you got let go. Now you want her to commit to you when things are *worse*. Don't you see how poorly this reflects on your character?\n\nAlso, *four months*? You've had *four months* to get a job, even something in the service industry just to pay the bills while you look for something more profitable (if you're qualified). Being an adult isn't always pretty, but you gotta do what you gotta do.\n\nAll you've proved is you want to ride out the good times and then want to be coddled during the bad times. You're not pulling your weight in this relationship. There will always be compromise in relationship, there will always be times when one person needs to give more. But it's like an emotional bank account, if you want to be able to withdraw large amounts, you have to be putting in, also. And it just seems like you've tapped your account and are now trying to get a loan when your credit score is poor enough as it is.", "Smart girl, I’m betting you also wanted her to pay for your car as well?", "Sucks to be you.\n\nYou can't be suprised she doesn't help you when she told you what she expects from a long term relationship and you didn't care then.\n\nYou got a deadline and you only care now that she shows you she is serious about it. You only seem to care about commitment if it is your idea of it and if you get something out of it.", "She's not the one forcing the situation. You are.", "She is not the one. Also this is the wrong sub to ask. go ask your local homeless dude he probably has a more valid opinion.", "Not how that works. If OP had high enough income then EI depending on location will cover anywhere from $500-1000 a week. You’d earn $600 if you’re lucky working at McDonald’s. So getting “a job” is actually more harmful to you because of I lost my job tomorrow; I’d be taking in $650/week from EI. Why would I give that up to work a dead end 40 hour shift for less money when I could put my focus on finding a new job.\n\nI agree that OP is TA but your comment and the one above you are just blatantly wrong for USA and Canada, along with majority of Europe.", "Hell, I am fully employed right now and applying casually to places (and being very picky because... I am employed) and I am not getting called. Before this last year I'd get at least a recruiter screen from around half my applications.", "If you're desperate for work you can find work. You just have to be willing to do any job that comes along", "\"looking\" for 7 months... 🤔 There's your problem right there. Stop \"looking\", start doing!\n\nI'm pretty sure if you turned up to your local council offices and told them you'll sweep streets all day for minimum wage, they'll give you a broom and a map of an area that needs sweeping.\n\nWhen you're unemployed, nothing is beneath you, and showing on your resume that you're willing to do whatever it takes looks a LOT better than a huge gap. It doesn't matter whether you're lazy or not, prospective employers only see what's on paper, and big gaps SCREAM lazy, so they probably won't look twice at your resume.", "The difference is he's your husband. OP's gf questions his level of commitment to her and the relationship. Presumably, that's not an issue for you.", "You guys were already married and had committed to each other through thick and thin. The crux of the issue here is that OP has refused to commit to the level his girlfriend wants so she’s not willing to commit her financial resources to him. It’s one thing if your spouse loses their job. It’s another thing if it’s a boyfriend who’s dragged his feet on proposing despite saying he would and is now jobless and wants you to pay his bills.", "This is something I've never really understood. Obviously you'll want to be looking for a job in your field, but when you are unemployed, any job is better than none right?", "Don't want to get married but want to be financially supported as if married, lolol. gtfo.", "You're repeating what StarWars said.  She has a plan.  It is not her problem where you live.  She does not have any financial responsibility to you.\n\nYou need to realize that she is the center of her own world, just as you are the center of your own world.  Whether you live with a friend is important to you; not going into debt for an apartment she can't afford on one income is important to her.  She doesn't have to put your wants over her needs.", "I thpugh you have no income because you're unemployed and only have savings?", "if you move out, please break up with her. If she's petty enough to end a lease with you instead of helping out for a couple months, she isn't worth it.", "That’s not being stubborn, she has boundaries! I also wouldn’t want to sleep with someone who is seeing multiple people.", "Yeah, she has a habit of knowing her worth and what she wants out of life, and not settling for less.  Which is a really admirable thing to be, and something that would really benefit you as a partner. \n\nSadly, you have no interest or understanding of what it means to be a partner, and so you are going to ruin a relationship with a woman who truly knows the importance of being a \"ride or die\".", "If you think those are just stubborn habits, you aren’t mature enough for this relationship", "There is nothing stubborn about setting boundaries to ensure she is not taken advantage of.   You clearly don't like this girl.", "What a wacked out way to view things. \n\nRefusing to sleep with you until you are exclusive isn’t strange or even outlandish to ask- it’s an entirely reasonable boundary! (And it’s the safest thing you can do considering how many diseases are sexually transmitted!!)\n\nGlad she has the balls to stand up to you and not be a push over. \n\nThis is pathetic on your part.", "Boundaries bro. Either you cool wit  it or not. Then move on quit bitching.", "\"I'm not sleeping with you until I know you're not sleeping around\"\n\nYeah that's not being stubborn, that's having self worth you absolute pillock\n\nYou sound like all you do is take and whine when she sets boundaries, calling her stubborn when actually she's just not letting herself be taken for a ride.\n\nShe's admirable. You are not.", "Stubborn?? Dude you are an absolute dick. 100% AH", "You can’t see any logical reason why she would not want to have sex with someone who is also having sex with unknown quantities here and there? \n\nNone?", "That isn't being stubborn, it is having boundaries.\n\nSome people are ok with poly relationships but she obviozsly isn't, she wants to practice monogamy. If you already had a problem with her only wsnting to date and sleep with you if you two are exclusive, why did you even start dating her? Not meing exclusive *is* seeing multiple people and many don't want someone who does thst as a partner in a comitted long term rekationship.\n\nIt seems like *you* have a problem with comitment and only want to do it if there's sonething in it for *you*", "That's not being stubborn.....", "It is much riskier to sleep with someone with multiple partners than being exclusive (greater risk of stds). That’s a reasonable boundary. \n\nTbh, the fact that you see her setting boundaries as being stubborn is a red flag.", "She wasn’t being stubborn she was being smart. If you were having sex with multiple people while dating her you could have exposed her to stds. Plus bring one of however many people you were sleeping with wasn’t what she wanted from a relationship", "No, it’s not expecting a lot. She laid out her expectations pretty clearly, it’s on him for not dipping out when she said that. If she didn’t tell him, but then 2 years go buy and she’s like “I wanted to be married by this time. Where is my ring?” Then she’d be unreasonable.", "How does her communicating her wants/expectations from a relationship make her a nut?? Stating you want to be engaged at the two year mark doesn’t mean she wants to be married in two years. I think it’s reasonable to know what kind of commitment your willing to make to someone in a two year time span - especially if one wants children. Women only have so much time to have kids and she had every right to not want to waste her time on some broke bum like OP.", "So you’d rather have her lie? She’s just stating what he wants out of a relationship. No one forced him to stay with her if he wasn’t ok with it lol", "and you want her to cover 100% when you won’t even commit?", "Did you both earn equally or did one of you earn more?", "Well then she's not an asshole, but you're naive for pursing a girl who gives you a marriage ultimatum when you've only just met. You know by now she isn't worth it and she's going to resent you for even asking for her to cover your expenses. Pull the band aid off.", "I can’t tell if this was sarcasm, but just in case not, this idiom is usually used to refer to men who don't want to get married, when they can get all the benefits of marriage without getting married. \n\nI just don’t like it because the analogy compares the woman to a cow, but since the shoe fit I figured I’d call out OP.", "\"Why buy the cow when you can get the milk for free?\" is a common anti marriage saying, essentially meaning why commit when you can get the benefits of the relationship without having to do so.", "The security is in the marriage.  You and her have different definitions of commitment.  She doesn't feel that commitment on your end. \n\nYou get what you want. She has adjusted to that. She doesn't get what she wants, but is expected to cover an expense that currently has nothing to do with her.", "There is a literal legal process that protects people under marriage? \nEngagement is just a step before that. Sorry but 3 years is ridiculous to wait around for , and she should really go find someone who won’t act this poorly.", "Instead of doing hypothetical mental gymnastics and deflecting the real issue you really should give your head a wobble", "The marriage brings that sexurity because you can't just bail from thst, it's a legal agreement and she can go after you.\n\nThe only other option you can offer her is to make a legally binding contract about her loaning you money and you having to pay it back or she can sue you gor it.\n\nShe obviously gets the vibes from you that you want to bail because you refuse to propose although you know exactly she dates to marry and only stsrt bringing up her wanting to marry you when you want money from her.", "So by that logic what's the harm in being engaged? Let the woman go. She has goals in life that you want no part of.", "What's the security in being a boyfriend?", "I read all the comments saying how he’s the asshole. It hurts.", "Then she should have left him then when year 3 came around. Her staying means she has to keep up with the responsibilities of being a loving partner. If she didn’t want to do that, then she needed to leave.", "Guess you need to sell it.", "Why don't you sell it now that you need the money for your bills and don't need a car to get to work?", "That sort of info needs to be in the actual post. Still, you should probably think about selling it.", "So she says she expects to be engaged by 2 years.  He understands that and accepts it.  They start dating, he really likes her, 2 year mark comes and he isn't ready...  What should he do now?  Just break up with her because he isn't ready to get married?  How is he supposed to know when the relationship starts that he will be ready in 2 years?  Should he have heard that statement and never bothered in the first place?\n\nMaking a deadline for your partner to propose in any circumstance is toxic.  This is partially on him for not recognizing the toxicity from the get go.  You can make your own personal deadline when you are no longer willing to wait around.  But giving the ultimatum is very unhealthy, and I don't see it producing a healthy relationship in most cases.", "Good? Nothing screams gold digger like saying I expect you to propose. You all say he could bail on her, but she could easily bail on him after getting married and take half his shit. Yall never think about tht cause this sub is gender bias af. The women is always the victim/in the right.", "You dont need to wait for vows to show if you are the \"for richer or poorer\" type. Good for him she showed it early so now he can run off and find someone worth it.", "NTA she should pay since it affects her credit too!", "Basically they'll both be better off", "You think its a good thing to marry someone who is unwilling to support their partner while their look for a job ?\n\n Im sure in the future if they are married she will be there for him whenever he needs help /s", "Because he didn't propose when she demanded it? Fuck outta here. Also, she can propose too, this isn't a fucking one way street. Why the fuck get in any relationship if your partner isn't gonna be there to help?", "Sure.", "He dodged a bullet cuz now he knows she isnt someone he can ever rely on. He can keep this relationship but when shit goes down he now knows he will take the fall alone.", ">I don't think so. I don't care about marriage, but his gf obviously only counts being engaged or married as a comitted relationship and made this very clear already during the beginning of dating. So from his pov they are maybe in a comitted relationship, but from her pov they aren't and she told him so even before he lost his job.\n\nShe wants to marry someone she isnt committed to after 3 years ? she has bigger problems then. They live togheter so for sure she knows he is running low on money but refuses to pay his share of the rent.\n\n&#x200B;\n\nEither way Op is lucky tbh he got an early warning. Many people find out waaay to late.", "Yeah anyone saying she sucks in here just feels so weird. She’s a boss. She compromised and didn’t push when he asked her to. She could’ve ended the whole relationship right there. Just OP drinking a big ole glass of “this is what you asked for”!", "🤣 hilarious and spot on", "It's very bizarre to set boundaries and not let people take advantage of you when they aren't willing to meet halfway? That's an odd definition of bizarre.\n\nThis dude is a walking \"Eric Andre Shooting Himself\" meme. If he doesn't like the way the bed he made feels now that he's lying in it, that's totally on him.", "Her timing is shitty, it feels like she was coasting along, perhaps feeling like she compromised but otherwise okay with the relationship, right up until he was 'down' and she could use the opportunity to bring this all up again.", "She knows her boundaries and is sticking to them. That typically a hard lesson for most women. Kudos to her.", "Asking someone to commit to marriage in 2 years time on the 3rd date is a bit much to ask for. It's good she was upfront, but absolutely no one should date someone who is issuing ultimatums that early.", "We have been together for 3 years not 5", "Yeah, I'm 100% on Team Girlfriend here. It would be easy for her to just go along with his demands because of the sunk cost fallacy, but she seems super clear on what she wants, and also super clear that she's not going to get it from OP. It's sensible of her not to sink any more costs into this relationship than are absolutely necessary.", "She knows how to protect herself financially smart girl", "Full time min wage jobs are nearly the same as unemployment and I would have less time for sending out resumes and interviews", ">If anything, you're simply proving to her you're not a wise investment overall.\n\nExactly. Not only did he show he doesn't listen to, or respect, his girlfriend's clearly stated goals and dealbreakers, he also can't be arsed to contribute when things are tight.\n\n\"Oh, looking for a job *is* a job, I couldn't possible get gig work on the side or look for remote piecework while I do it. Now bankroll me, bangmaid! But no ring for yoooooou because you're not smiling while you pay my bills.\"", "I can't speak for Canada but US UE you can make supplemental income while on UE.  It's not some princely sum...but IIRC it's about 75 bucks a week before they start reducing...and even then it's 75 cents on the dollar after that... so you're still collecting some UE and wages.\n\nSo they still don't take it all.  Also, you don't have to work at it 40 hours per week.  You can take part time and keep looking for work in your field.  It's easy enough to convince interim jobs to give you PT work.\n\nIIRC, at some point in one's UE collection status you no longer get to turn down jobs that aren't in your field, so it has a built in expiration date anyway.\n\nTake that with a grain of salt...of course, it's been a minute since I had to be on UE....so rules and regs may be a bit different now.", "EI allows you to work about 2.5 days a week (at minimum wage) before it reduces the amount it gives you for doing nothing.   There is room to up your supplement and you still have 5cdays a week to look for your next career. (Canada)", "A 4 month employment gap is not gonna get noticed by anybody that is not a long time to be unemployed after a layoff. And its not like you are gonna list a minimum wage job on your resume anyway if you got laid off in a certain type of industry you only list applicable work experience on your resume.\n\nLike if man got fired from an electrical engineer position and is looking for another one they aren't gonna list Burger King on their resume. You have no idea what you are talking about", "> When you're unemployed, nothing is beneath you, and showing on your resume that you're willing to do whatever it takes looks a LOT better than a huge gap. \n\nAnyone else reading this, this isn’t always true.  It’s completely fine to take a small break between jobs, you don’t have to work as a cleaner just to satisfy someone else.\n\n> It doesn't matter whether you're lazy or not, prospective employers only see what's on paper, and big gaps SCREAM lazy, so they probably won't look twice at your resume.\n\nAgain hard disagree.  I’ve employed people with year gaps and their reasons ranged from “I went on a long holiday”, “I had personal issues” to “I was looking for the right job and could support myself during that time without one.”\n\nDon’t worry people :)", "After I finished university, I applied for 100s of jobs, including minimum wage. It took me a year to get a job\n\nI was only able to get two jobs at that time. 7 weeks at a supermarket over Christmas and a temp job doing admin work. That temp job didn't have regular hours, so some weeks I only got 15 hours, others I was expected to work 12 hour days, 5 days a week at a place that had limited public transport and no staff car park.\n\nMind you this was in the aftermath of the 2008 recession, but sometimes things can be difficult", "i searched minimum wage jobs like mcdonald’s and other shit like that for a year and a half before finally being employed somewhere. so no, not everyone can get a job like that", "Disrespectfully, shut the fuck up.", "You missed that he should pick himself up by his bootstraps.", "People like you have obviously never had to try hard to get a job.\n\nIt took over a year for me to get a job when I got out of the Army. I applied everywhere I was even remotely qualified and quite a few places I wasn't just hoping they might overlook it. I even couch surfed to increase the area I could look for jobs. Have friends that live east of Dallas and some west of Ft. Worth. Anywhere I could pick up an application. I'm pretty sure the only reason I got the security job I got was because I was out at 8am picking up and filling out applications and happened to ride the elevator up to the office with the manager. We talked about my military background and when we got in the office he told the secretary to send me back for an interview when I finished. All luck and timing.", "You're an idiot 🤣🤣", "This.", "This is it in a nutshell. They have different definitions of what constitutes a \"committed relationship\". OP thinks he's in one and she doesn't. OP said in another comment she views him as a roommate when it comes to finances. I don't know of many people who would cover their roommate's expenses for very long if they were unemployed.", "Yes and no. Depends on whether your unemployment benefits are more than your paycheck would be, whether the job interferes with your ability to be available for interviews, whether the job grinds you down to the point that you don't have mental or physical energy to present yourself well at a job interview, what the gas costs would be for getting to and from work, if there are childcare costs involved...\n\nIt's not just a matter of \"Any money is better than no money.\" You have to look at costs versus benefits, and sometimes that legitimately doesn't come out in favor of taking a job at McDonald's.", "No. Not if it would take 4 jobs at $15/hour or take 60+ hours a week at less than $15/hour to equal a 40-hour week. Also not when there are very young kids and a special needs teen who cannot be trusted with child care due to wandering off. Or when the unemployed is over 60 and cannot physically work as hard as they used to. I was frustrated too but understood his decision to use retirement money instead. He can’t afford to retire anymore, but I’m back in college and will be the breadwinner in the future.", "Thank you. I misread that sentence, but that was my point. :)", "Read the rest of his comments, she’s dodging a nuke", "If there’s a break up I’m sure she will break up with him. Because he’s hanging on hoping she changes her mind and start’s supporting him", "She's not petty; she's being smart.  Why spend money on this loser? He's not giving her what she needs or wants, so why stick around?  It's a two-way street, and he hasn't done his part.", "I could have asked her to be exclusive and then kept sleeping with other people and she wouldn’t know. I could get engaged and have her help me pay for rent and then run she doesn’t know. The point is she needs to have faith in me which she already says she doesn’t because of a lack of a ring", "Yes I do it’s about when you want to have sex not some arbitrary commitment to exclusivity", "Telling a stranger u just met and know little to nothing about that you expect them to propose is crazy cat lady energy. This sub is so embarrassing with its gender bias. The red flag af.", "Saying i want to get married some day is fine saying i expect you to propose by this time is not normal. That’s crazy cat lady energy.", "And no one forced HER to stay. Shes being childish. Either break up or support ur BF. U don’t get to have it both ways. She’s literally trying to strong arm him into proposing during a financially stressful part of his life. If u think thats “Love” i feel bad for you. You deserve better.", "I’ve committed by being in a serious relationship with her for 3 years. She sees us as roommates until engagement. Then why even commit? Roommates don’t commit to each other", "I made around 67k and she makes around 73-75k", "Lol, it was more of a joke than sarcasm, but I am arguing that no one can get milk for free, and that I think the analogy to begin with is bad in addition to equating a woman to a cow.", "I understand the saying, but it makes no sense because no one is getting free milk from a cow.  That is stealing.  The cow is owned by the farmer who sells the milk.  It’s like buying the milk for cheap because they don’t want to buy the cow for expensive, which is still a stupid saying because it’s equating a woman to cow.", "It’s not toxic to be up front? She was straight up with her expectations and he agreed to those expectations when he entered a relationship with her. If he didn’t think he would be ready in two years, that it still might be too soon, he shouldn’t have entered the relationship period. Now he expects her to pay for his shortcomings while doubling down on falling short of her expectations. She isn’t the toxic one here buddy lol", "He could have opted to not continue seeing her if her laying out her expectation of a proposal within two years was a deal breaker for him. He chose to continue dating her and has been unemployed for four months. How the fuck is SHE a gold digger when HE needs her to support him because he can't find a job?", "SHE is the gold digger when he's on reddit whining about how she won't pay for his living expenses?? lmao be for real", "Nope, she's good.", "Even if that were a valid argument it would then be ESH. There is no spinning this so that OP isn't an AH.", "Nowhere does it say that the gf plans to just stopping paying on rent and bills. She is saying she won't pay for him and his living expenses. Its a month-to-month lease, he can be dropped from that and he can move home with his parents and let them pay his bills. And if she so chooses, she can move to a less expensive place or get another roommate.", "It won’t it’s month to month", "You don’t get wife privileges as a boyfriend. If he wants her to take care of HIS responsibilities, he shouldn’t have jerked her along for an extra year. Sucks to suck.", "I think it’s a bad idea to financially cover someone who hasn’t made a future commitment to you, yes. She is smart to avoid being taken advantage of.", "It’s a good thing not to get engaged/married while unemployed. If he can’t afford a court house wedding (unemployed and EI doesn’t cover his living expenses) then he can’t afford to be in a relationship 🤷🏻‍♀️", "When you commit to marriage you commit to partnership for life.  When you are dating, you are leaving that \"for life\" part out.  He doesn't want to fully commit, she doesn't want to do the \"life partner\" thing and carry his weight while he can't support himself.  Seems fair and logical.", "Why would she even want to propose to someone who doesn't respect her? He's asking for a hand-out, not help. You think he's going to repay her? To quote you \"Fuck outta here\". \n\nShe made her desires VERY well knowing early on in the relationship and he can't even respect that. He could have left, he could have talked to her like an actual adult. But no, he's upset because he's been leading her on and now she's become wise to it.", "She learned a year ago he isn’t someone she can rely on either. He’s the bullet, she’s the one dodging.", "You're focused on him not being able to rely on her, but what about the part a year ago when he established she can't rely on him? She made it clear at the beginning of the relationship that this was what she wanted -- staying in relationship implied his willingness to participate in her timeline. If he wasn't comfortable with a two year timeline, he should have said so up front and allowed her to find someone else more suited to her. At the very least, he should have had a conversation at the two year mark. Instead it sounds like he blew it off entirely and now expects a level of commitment from her that he was unwilling to give to her.", "Laughable.  The guy is an idiot.  \n\n>They live togheter so for sure she knows he is running low on money but refuses to pay his share of the rent.\n\nSo he wants all the perks of marriage, says she is the one and refuses to propose after three years?  What a loser.   Sounds like he is using her and doesn't want to be married and have joint assets. He wants a bang maid.\n\nYet when he can't pay his own bills he expects her to pay? Lmao.  He didn't dodge fuck all.  He hit himself in the face with stupid.", "OP’s gf: I want to be fully committed to this relationship by marrying you. \n\nOP: no, I don’t want that. \n\nGf: okay. - proceeds to treat him at a bf/gf commitment level only, *which does not include paying rent for someone for an undetermined amount of time*\n\nYou: sO sHeS nOt CoMmItTeD tHeN?\n\nShe tried to show her commitment, he shot her down and now he’s regretting it. He’s the problem and she’s so lucky he’s showing it while she can still get away.", ">She’s a boss.\n\nShe's an idiot. They live together, so not helping cover rent means rent doesn't get paid in full. How exactly is that a wise decision on her part when she lives there?", "Leveraging security to force someone's hand in marriage is not a boss move imho. They both seem selfish. ESH.\n\nI'd bounce if I were either of them.", "Or this incident happened, and she logically feels that she does not owe him anything with regards to HIS bills.", "I read it more as she told him on the third date that after 2 years of dating someone, not just him, she would want to be engaged. I think she was telling him that she isn't the sort of person that would want to date for years and years without marriage and that if he didn't see that as a possibility for him then he should say so. \n\nThis is not an ultimatum. This is her clearly stating what her expectations are in a relationship, so that he can decide if that is the sort of relationship he is looking for.", "But imo he should've bowed out then, not pretended to be along for the ride.", "It's not an ultimatum to say \"Hey, I want to get married and am not interested in being a 'forever girlfriend.' Ideally we'd get engaged within two years if we feel the same way.\"\n\nIf someone says that and you continue to date them...they aren't wrong for thinking you're on board with what they said. They also aren't wrong for refusing to pay your bills when it's three years later, they've given you more time, and you still haven't given them a direct answer either way.\n\nIf that's an ultimatum, so is refusing to consider marriage after 3 years when your partner has told you how important to her from the very beginning.", "I don't really see it as an ultimatum.\n\nShe's essentially saying \"Look, I have a two-year limit. If we've been in a relationship for two years and don't see ourselves getting married, then I'm out.\"\n\nMaybe misguided, as relationships are never that easy or black and white. But regardless, everyone is allowed to have their own limits, goals, dealbreakers, and countdowns. Whatever they may be. And for her, two years is her commitment investment and then she wants to take the next step.\n\nI think more people should discuss this long-term stuff earlier on, before people really catch feels. We're talking about people who are looking for *life* partner. Then they get into \"Damn, I really like this person, maybe they/I will change my mind.\" territory when dealbreakers are *inevitably* brought up. \"I want marriage.\" \"I don't want kids.\" \"My dream is to move to the snowy mountains.\" \"My dream is to move to the desert.\" \"I want a career.\" \"I want to be a SAHP.\" These kinds of BIG life things can destroy a relationship when both people aren't on board because someone is going to become resentful. Obviously, people *do* change their minds and shit happens that prevent us from reaching goals we once have or change our perspectives. But that being said, we can't blame a person for knowing what they want, stating what they want upfront, and then not changing their mind.", ">Asking someone to commit to marriage in 2 years time on the 3rd date is a bit much to ask for\n\nIt's really not.  If as a full adult you are not ready to commit to a person after dating them for 2 years, then you are not ready for marriage in general.", "I don't think it was an ultimatum, just a mature statement of future plans. If you start dating someone, and they tell you they want 5 kids, but you don't want any, you'd be the AH for expecting them to change later on. More people should set out their major things early on. You can work on/ fight about the little stuff.", "It's called compatibility and boundaries my dude\n\nShe said she wants a marriage. You don't. She probably doesn't consider it a commitment or a relationship she wants to invest in without significant investment from you.", "And the deal was still that you were supposed to be engaged after 2 years.\n\nWhy should she think that you're so committed to her that she should support you financially?  It's a lot harder for her to live on half your total income, than to move out and live on all of her income.", "Get a second or third shift job, stop making excuses.", "Work part time... it would have made ei last longer and youd be able to contribute something and have time to deliver resumes.  What did you do? Play video games while waiting for the phone to ring? If we asked gf - would she say that you helped out by keeping the house clean and doing more of the cooking?  If she saw you making a concerted effort- you wouldnt be here looking for sympathy.", "You don't get to opt out of working a minimum wage job with those weak justifications. Any extra income, no matter how small, would help. You're actively choosing to put more stress onto your partner rather than allow a hit to your pride. Bills don't care about your pride, sir. You can schedule interviews on your day off, not to mention you can send a resume at any time of the day.  Why should she help you when you're clearly not wanting to do the bare minimum required to pull your weight? You just keep proving to her that she cannot count on you and that she is wasting her time.\n\nAlso, just admit that you're not the man your partner needs and stop breadcrumbing her so you can have a relationship at your own selfish convenience. You don't get to string her along hoping she'll give up her hopes of marriage, because that is clearly what you're doing, and its cruel. You have already decided you dont want marriage, which is fine. What is not fine is letting her think you'll change your mind when you won't. Your reasons for not wanting to marry do not negate her reasons for wanting to. You're just incompatible and prolonging the inevitable, especially since it's clear she has already emotionally checked out. That's the first step in a woman being done. If you think 3 yrs is commitment enough for her to financially support you, then it would stand to reason that 3yrs is commitment enough for you to marry her. The problem is you know you have a good woman and you're content with crushing her dreams so she'll stay. She's protecting herself, as she should. You've already proven to not be a safe investment for her future. Why should she pour even further into an emotional money pit?", "Quit making excuses. At this point you are unemployed, so any job is better than no job. I don't have the privilege of extra time to send out resumes/CVs and I don't see why me and the rest of the public should have to subsidize you so you can be picky in your job search. Your GF is right to refuse you, you sound like a leech.\n\nYTA", "People apply for new jobs while working current jobs all the time.  You're making excuses.", "Get a 2nd min wage job then, if you were single you couldn't rely on someone to pay for your rent either, especially if you told them before that you \"need time to think\" about how serious your relationship to them is and only talk about commitment if you have somethibg to gain", "Mate, I got told I'm up for redundancy. I do my (very stressful) job full time AND apply to other jobs. \n\nThat's an excuse.", "A job is a job, unless that job is 24/h you’ll have time to send applications.", "Are you taking intervews from 8am to 8pm Monday to Friday? 🙄 what a lame excuse", "lmfao no", "Does unemployment not cover the rent?", "It takes 2 min in the toilet to send a resume, your girlfriend has dodged a major bullet here.", "No - a full-time minimum wage job is NOT nearly the same as unemployment. Pretty sure you can find at least a $10/hour job and likely $15. It won't be a great fit long term but $400/week towards expenses goes a long way. $1600 a month is a hell of a lot more than $0. Or, are you saying that you are receiving unemployment  $ from the state and that you have not been able to budget that money to get you by until you find another job?\n\nThe only people who can say a minimum wage job is nearly the same as unemployment are moms with children under school age, because the cost of daycare is more than a full-time minimum wage job.\n\nEDIT to correct spelling error", "What you said is mostly correct here too but I can’t claim EI if I have any job, even if it’s outside of my field. As long as I’m claiming income, I can’t claim EI. Which to me is dumb because same as OP, I can’t even pay my rent off the EI.", "😂 I work in HR, I'm fairly confident I know what I'm talking about 🤦🏻 if we get 50 applicants for a position, one with a 7 month employment gap is going straight in the bin 🤷🏻‍♂️", "😂 I work in HR, I'm fairly confident I know what I'm talking about 🤦🏻 if we get 50 applicants for a position, one with a 7 month employment gap is going straight in the bin 🤷🏻‍♂️", ">Again hard disagree. I’ve employed people with year gaps and their reasons ranged from “I went on a long holiday”, “I had personal issues” to ~“I was looking for the right job and could support myself during that time without one.”~\n\nThing is OP can't support him self without one", "I don’t blame her. Without marriage they are effectively roommates from a financial point of view. I’ve made the mistake of covering a roommates share of rent/deposit….once. Never did it again.\n\nI haven’t read all of OPs comments but I think it’s interesting he doesn’t mention whether she can even afford to cover his bills….he really should be asking his parents for money first, not her.", "Thank you for explaining!!", "Ehhhh OP bought a new car and has no kids. He can handle a minimum wage job to pay as many bills as possible. \n\nI was unemployed for like six months when I moved across the country to live with my now-husband. Difference was we’d actually agreed I’d wait to find a job until school started (he’s a teacher). OP has no leg to stand on here.", ">use retirement money \n\nthat's an *entirely different* kettle of fish than what OP is going through", "I disagree. Even with those factors (*especially* with those factors, I would say), some money coming in is better than sitting home waiting until you get the ideal job. But what do I know, it’s not my life", "Your argument is...you could be a lying cheating bastard\n\nWhy would she have faith in you? You aren't even saying the things she wants and are now arguing that you could just say it and lie. You inspire no faith", "Bruh, based on all your comments I wouldn't have faith in you either. Sounds like you're not fit for a serious relationship", "This entire answer just shows that you are a trash person and don't deserve being taken care of.  Go back and sponge off your parents, because you haven't earned any good will from anyone else.", "So your best argument for why she should support you is that you aren't a cheater? \n\nLol try again", "She made a very wise choice based off of this comment alone LMAO", "So you are saying \"I could be achester and a liar and she has to trust me I'm not nased on nothing instesd of me comitting and at lesst promising I'm faithful and staying\" \n\nI would not trust you either. \n\nShe knows her worth and she knows what she wants and now you complain that she won't give you what you want if you never gave her what she wants and your argument for you not giving anything to her is \"but it could mean nothing if I don't want it to mean anything\"", "Weak….", "I hope she breaks up with you", ">it's about when you want to have sex\n\nExactly.  She *wants* to have sex in an exclusive relationship, and she doesn't want to have sex in a non-exclusive relationship.", "Not everyone's main motivator in life is whether or not they want to sleep with someone. Seems like a difficult concept for you to grasp, but many evolved, mature people are able to separate lust from love and draw healthy boundaries around each.", "Oh my god. Just grow up, you aren't mature enough for the relationship. I hope your girlfriend finds someone who want to marry her.  \nYou expect her to treat you like a husband, when you barely treat her like a girlfriend.", "Why have you been dating her for three years when you knew she wanted that arbitrary commitment?", "So you dated her only for sex?", "So you only told her you comit to exclusivity to get sex because she only wants sex in a comited, exclusive relationship?", "I really hope your (ex) girlfriend will leave you. Man man, from all what i can read here you are just a pathetic loser.\nUnless you had a serious decease 4 months was plenty of time to find a job. Even a shitjob to cover the bills. On the background you could have looked for a better job. But instead decided to be passive.", "Have you considered her feelings at all?\n\nMaybe asked her to buy you a mirror before she dumps your ass\n\nYTA", "How is it gender bias, lol, if my boyfriend had told me “If we date, I’m going to marry you within 3 years” I would have freaked and broke up with him. Because I would have been too young to make that decision. Just because you don’t have the strength to set boundaries or stand up to boundaries you disagree with doesn’t mean others shouldn’t.", ">That’s crazy cat lady energy.\n\nand you're giving crazy incel energy ...", "isn't wanting to get married on a set timeline the exact opposite of cat lady energy", "Oh no, not an independent woman who likes cats, please stop, the horror", "INFO: How old are you guys?", "dude just let her go. it’s clear you’re not committed to her the way she wants you to be", "Poor excuse. She clearly doesn’t actually see you as roommates. You two have been dating exclusively and talked about marriage. But she’s going to keep you at arm’s length because you’re doing that to her.", "You have been so serious about it that you told her you need time to think about wanting to propose to her, so it can't be *that* serious to you and you can't be *that* commited to her and the relationship.\n\nYou knew very well that she dates to marry and that she feels like she wasted 3 years of her life with you if you don't marry her. You lead her on by telling her you'd think about it slthough you obviously don't want to marry her and now you pretend like *she* is the one refusing to commit. \n\nNow you think she should cover your rent for months while you buy yourself a car and refuse to get a job and just chill at home \"writing resumees\" which you definitely have been doing for 4 months every day for 8hrs straight so you don't have time for work min wage to not be a burden to someone you \"think about\" proposing to", "Roommates also don't pay the rent for each other...", "There is no logic in that lmao.", "Let me try rephrasing that.   Either you are committed to the relationship, long-term, or you are a roommate who has sex.  Right now you're acting like a roommate.  You aren't acting like somebody she can trust to be there through thick and thin.\n\nThere's nothing wrong with your not wanting to marry.  There is also nothing wrong with her insisting that she wants to marry, *which she told you up front*.   Living with somebody for three years isn't a commitment.  A commitment is \"I want to stay with you for the rest of my life.\"", "You haven’t committed shit just because your in a relationship. Why should she drop major money on you when you won’t actually make a commitment to her?", "Being committed three years in the past is not the same as being committed into the future.\n\nPropose and commit if you want to stay with her.  Otherwise, move on.", "So she told you she expected marriage, you continued dating her, KNOWING she was a marriage fanatic and yet you don’t get why she’s pissed?! Yall are literally both assholes.\n\nHer for staying with someone who doesn’t want marriage and you for dating someone who does. And don’t give excuses, I’m not her. If you wanted to propose, you would’ve by now. \n\nYTA. Have fun moving home and finding a new girlfriend.", "And now you make zero.", "Did you split everything 50/50, so utilities, rent, groceries, dates, all the bills?", "He has no way of knowing if he will be ready in 2 years or not... Especially at his age.  It is a toxic expectation and a man with options would not entertain a woman who sets that standard.  I'm not trying to necessarily absolve him of any guilt.  Expecting her to pay for him is dumb on his part.  Not because you shouldn't rely on your partner in hard times, but more because of who his partner is as a person, which he should have figured out by now.  In this situation, there is a toxic woman, and an immature incompetent man.", "She could also break up with him at the 2 year mark. She is wasting everyone's time at that point. Don't be toxic and hold it over their head because you are scared to look like the bad guy", "If he isn’t living up to HER expectations then what is she doing with him? If she’s really not ok with not being married then break up and find someone new. Why is SHE still with him? If she still expects to get married then she better act like a partner that actually cares. You don’t get to say “i wont help you anymore unless u propose” and act like ur the normal one here lol.", "They live together. If rent doesn’t get paid the gf is also going have to find somewhere to live.", "Why are you so surprised pikachu face when she followed through on EXACTLY what she told you?", "Guilt tripping a guy into marrying you is SUPER Fucked up. Wtf is wrong with you ppl?", "Why hasn't she mad a commitment to him? What is it his job to do it first?", "He was employed when the issue came up.  That all happened prior to layoff.", ">She learned a year ago he isn’t someone she can rely on either. He’s the bullet, she’s the one dodging.\n\nThen leave why waste her time.", "She should have left his ass. Or if she wanted to make it work see why he didnt propose. Is it because he is unreliable or maybe another thing.", "Why the fuck wouldn't she ask him? It's not his duty to propose. If she's so stuck on it, make the fucking move.", ">OP’s gf: I want to be fully committed to this relationship by marrying you.\n\nIf she isnt committed she shouldnt be looking to marry.\n\nIf she is looking to marry then she should be committed.", "He said she let their lease go month to month so that she can simply give a few weeks notice if she wants out. She has the money to just move to another apartment but he’d have to move back home.", "Because she is fine going back to live with her family.", "Agreed, but likewise she should have bowed out a year ago. Neither stuck to the \"deal\".", "Then she should have broke it off at 2 or proposed herself", "God no", "Realistically no it doesn’t. Op has no excuse for his BS, but let’s be realistic about what actually happens when you apply for jobs. \n\nIn every job I’ve applied for I’ve had to customize my resume to showcase what experience would be applicable in that roll. You also generally have to fill out forms and I’ve even had to take tests and do all kinds of questionnaires (some were 75-100 questions about scenarios and god knows what) it could easily take an hour or more per application.\n\nGiven that algorithms decide what applications get through the process, you won’t hear back from every employer. I’m my experience it’s less than half that respond. So it’s definitely time consuming to find work . \n\nStill no excuse, but it doesn’t take 2 minutes to apply.", "That is just not true. You can work part time and it benefits one to do so if the EI benefits do not cover your expenses and you need additional income.\n\n“If you earn money while receiving EI benefits, you can keep 50 cents of your benefits for every dollar you earn, up to 90% of your previous weekly earnings (roughly 4 and a half days of work). Above this cap, your EI benefits are deducted dollar-for-dollar.” \n\nSource: https://www.canada.ca/en/employment-social-development/programs/ei/ei-list/working-while-claim.html#:~:text=of%20EI%20benefits.-,How%20working%20affects%20your%20claim,deducted%20dollar%2Dfor%2Ddollar.", "That's a shame!   Yeah in the US you can, or could, that is, back when I had to use it.", "Then you are a shitty HR person.", "Who do you work HR for Wendys? If you are applying for an electrical engineer position HR is not gonna give a fuck if you worked at Wendys for 5 months after you got laid off 5 months ago from a different electrical engineer spot.\n\nYou only want to list applicable experience for the position.", "It’s not a new car. It’s a 6k 10 year old sedan because my old one kept breaking down and the fix was more than the car was worth", "Yes but it was my most immediately relevant experience. I try to relate to OPs when giving judgments.", "Imagine If this was a man saying he refuses to help out his gf because that’s something only husbands do not bfs, you would all lose ur shit. \n\nThis sub is well known for its gender bias. Even mods acknowledge it.", "No, crazy incel is telling someone 1st couple dates u expect them to marry you or their just wasting ur time XD \n\nSeriously replace the word “marry” with “sex” and this is literally an incel post 😭", "I’m 28 and she is 29", "Fanatic?  She doesn't want to spend her life as a live-in, and that makes her a fanatic?\n\nThere are too many stories of women with guys who just didn't want to commit, and then when they broke up the guy was married with a baby on the way within a year.", "50/50 on everything but dates I think I’ve paid for more dates overall probably like 65/35", "How did she guilt trip him? She was INCREDIBLY up front about her expectations regarding marriage and is simply sticking to them. If he didn't like those expectations, he could have ended the relationship or not even entered it at all.", "It wasn’t an issue when they started dating and she outlined her relationship milestones 3 dates in. He presumably said sure he’s okay with that and would expect nothing less. 3 years later and not even a proposal? She’s right for telling him to move back home where he can actually afford to live : off his family. \n\nAt this point in time, he has no prospects. No savings, no jobs, and i bet he’s not even a reliable narrator because he’s not listing what he has or has not been doing around the home while he’s unemployed. So as far as we know, she could be doing the bulk of it while he sulks she wont cover his bills.", "Because in the real world, it’s not easy to just leave someone you love and built a life together. 2 years is a long time to throw away, and although she may have distanced herself, or changed her expectations, she likely still loves him. \n\nBut she’s drawn boundaries and she won’t support him as a wife should, while not being his wife. Which is more than fair imo.", "Right, so -- how is it *him* that dodged a bullet?\n\nHe says he asked her to give him some time. Meanwhile, she feels like she's been strung along by this guy who seemingly has no intention of furthering the relationship, except... Oh, wait, now he conveniently wants a higher level of commitment from her because it suits *him*.", "She WAS committed until he said NO, at which point she adjusted her commitment to what HE asked for. It’s entirely on HIM that he’s in this situation. She’s only doing exactly what he asked for.", "That’s not worth the effort or energy. You’re better off cutting grass for cash than to actually have reportable income cutting you’re EI to 50%", "Same. When I was on unemployment, I could actually make MORE money by working part time because they didn't reduce up to like 25% of my benefit so if I worked I could theoretically make 125% of the benefit... and it made the benefit last longer too because I didn't use all the money up immediately", "Could you have relied on transit until you had a job though? Especially if you are not working at all", "Was the fix more than 6k? If not then you wasted money.\n\nWas posessing a care absolutely necessary or coukd you just have used public transport or walked, especially since you have no commute to work because you refuse to work since \"a full time min wage job is less than unemployment and [you] need time to write applications\"", "I’ve not had a car in six years. I know how much it FUCKING SUCKS to not have one and how difficult it makes life- as an American anyway. You could have bought a bike. A moped. 3k for a moped or 2k for an electric bike and you are just as mobile with more money to take care of your responsibilities. Or to *buy a fucking ring.*", "Who is you all? Because I wouldn’t. It seems like you’re grasping at straws with this “poor men🥺” spiel.", "bro i had a man demand i agree *to be pregnant with his baby by the end of the year* before he would agree to a second date. there obviously was no second date. i made a choice, and so did op.", "The whole male “oppression cosplay” thing is becoming more and more of a reach. Just stop embarrassing yourself.", "So you expect a 29-year-old woman who you’ve dated for 3 years to pay all your bills for who knows how long even though you admit you’re hesitant about marrying her and disregarded the timeline and expectations she presented to you upfront?\n\nWhy ON EARTH would she do this? Like seriously what is her incentive?", "Demanding engagement/marriage in 2 years by date three is fanatic. It’s also ridiculous to talk about on date 3 and makes her look like a pusher. \n\nIt’s one thing when they decided to become official to have important talks or even to have prior discussed goals of marriage and kids. But to tell someone on date 3, they expect to be engaged in 2 years, that’s a lot of pressure to put on someone. \n\nJust bc someone doesn’t propose directly at 2 years doesn’t make them instantly a “live in”. \n\nNo, those stories are bc those girls and guys weren’t right for each other. Hence why they end up with other people. People can’t force others to do what they want. Sometimes in life, you have to cut your losses and find someone who meets the same goals as you. So if they didn’t want to commit to that person, and ended up with a baby and marriage with someone else, then that’s how life was supposed to go. Sad, but it’s how it happens.", "Seems like you guys are basically roommates and you take her out on dates to get into her pants sometimes tbh.\n\nIn a commited relationship you pay the bills proportionally to the income of boths, so 50/50 only if both earn equally, she earned more so she should have paid more. Now that you're unemployed she should cover completely until you got a job. *Any job* that helps paying bills.\n\nYou told her you'll think about proposing and you knew she expects that from a committed relationship, so to her it obviously seems like you aren't wanting to commit, so she isn't wanting to treat this like a committed relationship.\n\nIf she sees  you not proposing to her after 3 yesrs as affirmation of you not being serious and her wasting time on you it's only natural she'd see paying more like expected in a \"real\" relationship is a waste of money.", "Is she was actually committed to being married by a certain time then why didn’t she leave already? You say they guy should break up with her, but why hasn’t she broken up with him?", "Why didn't she propose?", "She should try and find out if this man is avoiding marriage because he is an unreliable prick or is it something else.\n\nBecause if her end goal is getting married then maybe this is not the person. Its hard to leave but is staying the answer ?", "If he wanted to he could be working under the table, he could walk dogs, do Uber, door dash and produce some sort of income.", "All the top comments and the thousands agreeing with them? Have you read the responses?", "If she loves me she would", "> So if they didn’t want to commit to that person, and ended up with a baby and marriage with someone else, then that’s how life was supposed to go. \n\nLife could just as well have gone \"well, I'm leaving while there's still time for me to find the relationship I want.\"  There's no fate involved in committing your time to a partner who isn't committing back.  There are just sunk costs.", "I agree with a lot of what you said but proportional to income bill payment isn't really a measure of a committed relationship. Some relationships do that. Some put everything into one pot, some do 50/50, or any number of other ways.", "She didn't break up with him but she clearly adjusted her expectations to meet his behavior.  She isn't acting like a wife if he clearly just views her as a girlfriend. I see no issue with that.", "I'm not sure Uber or door dash under the table is a good idea- most experts recommend you take cash only jobs when you are committing tax/unemployment fraud lol.", "They agree with them because OP is acting like a dumbass. Not because he has a penis.", "You don't even love her enough to propose. If you want to wife you have to man up first numbnuts", "If you loved her, you’d have proposed. 🤷🏽‍♀️\n\nYou’ve been wasting her time and now you want her to waste her money on you and she’s not going for your nonsense. Smart girl. \n\nEnjoy living with your parents!", "If  you loved her, you'd propose.\n\nYou see how it's going?  You are demanding more of her than you're willing to give to her.  You are claiming that dating for three years means she has to support you, or else she doesn't love you.\n\nIt isn't unfair if she decides she doesn't love you enough to support you.", "You are still hesitant about marriage. Why should she cover you? Go live with your family until you are not hesitant. What does one thing have to do with the other? You are expecting too much of her. For people saying relationships are about growing together… grow up. If you are not dating with marriage or a longtime partnership (whatever the couple decides is best for them) then you are just wasting someone’s time. If she’s the one, she will be the one while you are at your momma’s house figuring things out. \n\nIf you loved her and she was the one you would have proposed.", "Please, if this is actually how you feel you should leave her so she can find someone who loves her.  How dare you think that because someone loves you they are responsible for your individual bills.  That's laughable.", "Keep in mind that from her pov, if YOU loved her, you would’ve proposed. Can’t expect what you haven’t provide.", "If you loved hervwouldn't you have proposed already?", "You know the problem with that attitude? She can counter that if you loved her you wouldn't ask her to cover your bills and you would put a ring on it. She's doing all the giving and you're contributing nothing, yet you expect her to prove her love. YTA.", "That is emotional manipulation\n\nEvery comment you write shows even more just how much of an AH you are", "Love is not enough. It never was, nor will it ever be. Hide behind that excuse all you want when the power dynamic is in her hands and not yours.", "Ok she doesn’t. At least not enough\n\nSo what now.", "She is actively falling out of love with you.", "Wtf does acting like a wife vs acting like a gf actually mean? U don’t have to be a wife to help out ur bf. Imagine this was a guy refusing to help his gf cause he says she shouldn’t expect him to do husband stuff? Lmao u ppl would have a fucking field day", "Gf not a dumbass for agreeing to something she knew literally nothing about? Then acting surprised like she didn’t have months to educate herself? Or just fcking ask what shes expected to do? NAH only men are responsible for their actions", "I can’t propose under duress, it wouldn’t be real. I also can’t save up enough for a ring", "YTA\n\n>I’m sure she is the one, I’m just still hesitant about marriage\n\nWhich is it?", "\"For richer or for poorer\" comes with the wedding vows.\n\nShe's hasn't been given the opportunity to commit to supporting you through rich or poorer. \n\nStop giving boyfriend effort and expecting wifey effort in return.\n\nYTA", "If you like it then you shoulda put a ring on it… oh oh ooohhhhh…\n\nYTA \n\nYou expect her to commit to you when you aren’t ready to commit to her. She set her expectation with you regarding marriage and you dismissed her. She gave you the time you requested and now you’re making a second request while she has only one. She’s willing to end the lease so that’s how strongly she feels about your lack of respect for her wishes to be married. Marriage is about going through thick and thin, sickness and health. You didn’t sign up for that so why should she? Part ways and move on with life.", "YTA. She told you 3 dates in that she expects to be engaged, you were fully aware of her condition and you accepted it.\n\nYou are just deceiving and going back on your words at this point for still being \"unsure\". She's right, you wasted 3 years of your life if you still can't bring the ring yet. If you weren't sure, you shouldn't have started the relationship to begin with.", "YTA...Why tf should she commit so much money to a man who AFTER 2 YEARS doesn't think she's commitment material? You don't get wife/life partner level sh\\*t if you aren't life partners. You're a couple, dating, no engaged to each other or married. \n\nShe did in fact Waste 3 years of her life with a man who KNEW her expectations and refused ot meet them. Shes serious and wants marriage. YOU arent serious.", "YTA.\n\nLet me get this straight. She was honest about what she wanted up front. When you both first started dating. Right? She let you know what her expectations were, and you basically said, \"Nah, I'm good.\" Now, you expect her to pay YOUR bills? \n\nAlso, please note that you said this:\n\n>We have been serious for a long time, why is the ring and marriage all that matters?! \n\nOh. And this: \n\n>I’ve told her since she won’t help it’s shown me she isn’t serious too\n\nNow. You say she's not serious, but she is. She is serious about herself, and she knows she shouldn't let anyone waste her time if they aren't willing to grow.", "I had an ex tell me \" I will never marry you\" and that's fine, but you aren't getting husband level what's mine is yours if you aren't committed to me. So when he quit his job, no I did not feel obligated to provide him spending money, I was already paying all of the bills.  Maybe she doubts your commitment to her.\n\nETA: YTA", "YTA\n\n\"I'm not ready for marriage\" but I'm 100% ready to have my partner share their income with me is a pretty wild flex, dude.", "Dude...she has a point. Now you want basically marriage benefits when you won't give her (I'm sorry, are \"unsure\" of it) these benefits yourself. Nope and YTA", "YTA. Read all the other YTAs to learn why.", "You bought a car while unemployed?", "YTA, you want her to support you as a wife would do, you want her to share finances as a married couple would do, but you are not willing to give her the commitment and security of marriage. If the ring and paper don’t matter at all why are you unwilling to go through it?\n\n\nShe didn’t waste those years, you did, you say you found “the one” but are unwilling to commit, to the point she started and finished the process of letting go of the relationship, she already did her mourning because she learned that her wants and needs are important, and to not fall for the sunk cost fallacy.", "YTA your the one that has wasted 3 years from the beginning of your relationship she has been very clear she expected to be preposed to within 2 years she is probably trying to decide at this point if she would be better off going back to dating someone else that actually will marry her \n\nand your comment about she clearly isn’t serious because she wont pay your side of the bills makes you look more like a hole because you clearly don’t want to marry her as you would know by now but you are just stringing her along", "YTA - You won't commit to her, but you want her to help you. Hells no. She's smart to walk away from you before she wastes anymore of her time.", "YTA - Do you want a mother or a partner? get a job already, it’s been 4 months…", "YTA. Don't expect marriage-level support from somebody you're not willing to marry. You're a single grown man, so you're responsible for yourself. It's nice you have a girlfriend, but I doubt she'll stick around long if you're simultaneously refusing to move forward in the relationship yet pressuring her for money like some kind of weird leech.", "YTA - “I want the support of a committed relationship but I just don’t want the commitment”. She told you her expectations going into the relationship. You weren’t ready to offer her that commitment why should she offer you her support.", "YTA hope she has better luck with the next one such a shame when you put all that time in just for them to be a dud but I'd rather be single forever than shackled to a a sad sack of disappointment like op", "YTA-You literally say you’re hesitant about marriage still three years into the relationship. She’s not wrong to not help you out. This is for the best because you clearly only care about your own needs/wants. It’s incredibly dismissive to say all she wants is a ring/marriage she wants security. She wants a partner who will publicly acknowledge his feelings for her.", "YTA. You don’t want to commit to marriage but you expect your gf to support you financially. Tbh had you NOT had the engagement convo, I would be a little more mixed on my views, however, you made it clear you are not ready, but now you’re asking for something that would naturally occur should you two be married. I 100% get where she’s coming from.\n\nYou two honestly just don’t sound compatible and should consider seriously discussing this. Marriage/no-marriage is a massive dealbreaker.", "What would you do if you weren't together. You should be doing that, and should have been doing that for the last 4 months.", "YTA\n\nNot sure about marriage but want her to help you out this way? Seems to me like you’re taking the piss. You want your cake and to eat it too at her expense. I agree with her. End the lease and go live with family. You get yourself back together and she’s free to find someone who respects and appreciates her the way she deserves. \n\nOne of the benefits of being married is having someone there for better or for worse. She doesn’t have that commitment to you so she can move on. \nShe owes you nothing because she is not your wife. \n\nCry to your family about it.", "YTA- get off of your a** and go get a job. 🙄", "YTA\n\nSounds like you want the benefits of being married without being married. It also sounds like you’re gaslighting her. You’re using the fact that she isn’t going to invest her financial future on someone who won’t commit to a marriage to justify why you aren’t proposing. She straight up told you that if you had made a commitment to her she would have helped, and I get it because she knows there is a future together.\nEdited: incorrect autocorrect", "YTA for sure. You didn't make an excuse for not having a job after 4 months. Take the bus. Where are you going without a job? Have you budgeted properly now that you don't have a job? Clearly not. Are you going to be able to pay for a house, kids, or wedding? You clearly aren't ready, and you should be thankful your gf hasn't already broken up with you.", "Are you serious?! Yes, YTA.", "Get your money up! Don’t ever depend on a woman that is not your wife.", "YTA\n\nGet a job!", "YTA - Why did you buy a car immediately after being unemployed? Because yours had high kilometers? Did you consider public transit? \n\nYou refuse to commit to this woman but you want her to take you on as a dependent. You see how unreasonable that sounds?", "YTA. You're in the \"find out\" phase after almost literally fucking around.\n\nGet a job - any job - sort your shit out, prove to your girlfriend that you might one day be husband material, because otherwise you're going to be unemployed and single.", "Even if you propose this minute I hope she leaves. \n\nYou are wild to not realize that this is the level you operate at if you don’t have legal commitment.", "YTA", "YTA you made your bed, now lye in it", "YTA", "YTA she’s not your wife so she’s not obligated to help you", "Yeah, she doesn't owe you jack.  Pay your own bills or get a new job.  She's holding up her end, time for you to hold up yours.  YTA.  Maybe she needs to find a new roommate, one who can pay the rent.", "YTA for the many reasons people have stated above. And I hope this is a wake up call. For both of you.", "YTA. She not obligated to help you. You question commitment with her and then turn around and expect her to commit to helping. It’s one thing if she wanted to offer to help but another to tell her she should. Habits have a way of repeating themselves and she might see this as a red flag. As if you didn’t commit to things what’s to guarantee that you might continue in for another 2 yrs just living together as bf and gf and you lose your job again. Surely how much would you help her out if the tables were turned? And I’m not just talking being jobless. I’m talking her having same expense situation as you do. \nLook long an depend into a solution to make the situation work out. Work hard at finding a job. Talk to the bank about loan options or help, get unemployment for the time you can as you search for work. And most importantly cut unnecessary expenses. If you expect her to help you better be doing your part it helping to find away to cut the expenses even more.", ">We have been serious for a long time, why is the ring and marriage all that matters?! \n\nI'd normally agree that if you're both committed, a ring aint that important, except, she did communicate to you that to her, it was important. She was clear with her timeline.\nYou refused to show her the extra commitment she asked of you and she is therefore unwilling to show the extra commitment you're asking of her. \nYou can't have your cake and eat it too. \n\nYTA", "YTA. You’re not her child nor her responsibility. If you have to get a job at a fastfood chain for a while, then do it! A job is a job", "Your GF is not responsible for your finances. Especially when you weren't willing to meet her expectations.", "I really hope your girlfriend leaves you", "YTA for expecting her to pick up the slack and take care of you like that. I'm going to nitpick at your poor writing that does a bad job at getting the point across. You are also focused on the wrong thing when it comes to the proposal/marriage discussion.\n\nYes you have been dating for 3 years and live with each other but you are still non-committal and haven't proposed for your reasons. She is justified in not picking up the slack for you. What if you do leave her after she has sunk money into you? You talk about how the 3 years should have meant something but then you go and threaten to end the lease.", "YTA. It has been 4 months. Get a job.", "YTA. No job no girlfriend sadly, now wives are different.", "YTA. \"I'm sure, just not ready\" IGNORING the $$.... that's a one foot in, one foot out... I might do better attitude, whereas SHE was VERY upfront in telling you her expectations. You LITERALLY wasted three years of her life.", "YTA nobody close to you should be required to pay for your existence; that just means you’re no longer a good person to keep close", "If you need the money for bills then you pick up a job like Uber or at least part time waiting tables or something. Instead you did nothing for 4 months and you expect her to pick up your slack? You knew the money would run out soon. YTA", "YTA. You don’t deserve her she should leave you and find someone else who values and respects her time and investment.", "YTA you're expecting her to act like you have husband/wife level commitment without being willing to provide that commitment.", "YTA....you are a man/child. She's not good enough to marry, but she's expected to carry your ass ....LIKE A WIFE....you're not sure about marriage but expect NOT YOUR WIFE to act LIKE YOUR WIFE when you get kicked to the curb by your employer. \n\nThree years and you're on the fence? Three years? Still waiting for someone better? So NOT YOUR WIFE has wasted THREE YEARS with a bum who has expected her to act LIKE A WIFE with no legal or emotional entanglements...and is surprised when NOT YOUR WIFE finally get her head screwed on straight and realizes the bum she has wasted three years with is just a mooch who is sucking the life out of her. \n\nMove home, man/child...let NOT YOUR WIFE move on with a grown ass man...a man who will treat her with the love and respect she deserves. Someone who will see that she is valuable beyond her paycheck and her WIFE DUTIES without the ring. Someone who will put a ring on her finger. That's what she wants, your still hoping someone better will sweep you off of your feet.", "YTA - “Waste 3 years over covering a bit more…” um no, she’s not investing any more in a shitty stock that has repeatedly failed her. And is going to cost her money if she doesn’t get rid of it fast. What incentive is there to support you? \n\nYou whine about “if she cared she’d support me” bullshit - if you cared you’d have proposed. If you didn’t intend to propose, you should have been honest.\n\nSeems to me like you’ve disrespected her wishes for at least months, if not years. Goals that she made very clear from the verrrrry beginning. \n\nYou’ve been living together for two years - after the first year living together, you could have been engaged. She was probably anticipating that, it’s a logical next step for someone who LET YOU KNOW CLEARLY that they were dating you with the intent to marry.\n\nIt seems like your GF has caught in to your con and is done with your BS. I wouldn’t help you, either. FWIW my partner of 5 years was laid off two months ago. He’s putting in 20-30 applications a week and has had multiple interviews a week. You bought a *car* and ran out your savings and have had a *single* interview, and now want her to give you money… for what? You’re a liar who wasted *her* time for three years. A shitty investment, but we learn from our mistakes.\n\nI wish your gf every happiness!", "Her- “I am being clear: I want a full commitment.” \n\nYou- “Nahhhh”\n\nHer- “Okay. I’ll proceed accordingly.” \n\nYou- “Hey I need wife-level financial support, you cool with that?” \n\nHer- “Nope, there’s been no sign of commitment from you.” \n\nYou- *shocked* lol \n\nYou know she wants marriage and you couldn’t be bothered to figure yourself out, now you’re shocked she won’t act like a committed spouse YTA", "YTA  \n\n\nIn the same post *she was the one* but because she won't foot the bill the commitment doesn't matter? You don't sound very committed either. She told you what she wanted from date 3 and you complied. Now you're having a **marriage level conflict** and want her to step up but *as a girlfriend*, she's *not* obligated. You deciding to leave just proves her right.", "You are TA. I understand hesitation about marriage- it’s huge. However, you’ve been living like you’re married for a few years now. She has a right to tell you her expectations. You have a right to accept them or not. She’s saying she doesn’t want to act committed without formal commitment. You haven’t committed. Now if she wants to give you more time that’s on her. But you need to step up if you don’t want this to end. I understand you want things to be better before you marry. So do it and prove to her you can be the man she wants and needs.", "You won’t marry her but expect her to pay your bills bc you’re going through a rough time? Guess what? That’s marriage. In sickness and health. \n\nYou want marriage support, you gotta marry her.", "YTA 100% and here’s why:\n 1 - Your girlfriend set out her expectations for the relationship very early. You had ample opportunity to let her know if you didn’t hold the same priorities in the relationship (marriage). \n2 - You say she’s “the one” but don’t see why it’s important to marry her, even though she communicated that this was what she wanted from the relationship. \n3 - For the two reasons above, you absolutely wasted her time. She could have been in a relationship with someone who shared her relationship goals. \n4 - On top of above, you want her to financially support you, even while you refuse to commit to the relationship in the way that is important to her (marriage)? Get real.", "Look, not everyone thinks a ring and a document are important but your gf clearly does as she communicated this to you years ago. You didn't listen to her. That's on you.", "She's not good enough to marry but she's good enough to pay your bills?  LOL.  Paying someone's bills is a commitment but it's the kind of thing married/engaged couples do, not nebulous \"she's ready but he's not\" pairs.  YTA.  You have no right to expect a level of commitment from her that you aren't willing to demonstrate.", "YTA. \n\nYou're trying to turn this around on her ('why should I get engaged to someone who won't support me') but that really fails to stand up to scrutiny. She's willing to commit to you, as long as you commit to her. I don't get the sense you feel the same-- you want her support while continuing to move the goalposts on marriage.\n\nIf you want her to truly be your partner, treat her like your partner and start actively working towards marriage. If you don't want that with her, let her go find someone who does. She's already a year past her timeline and deserves a firm answer one way or the other. And for goodness sake, don't make this decision based on your need for financial support.", "You want to use the phrase \"we've been together for a long time to justify her paying the bills\" but she says \"we've been together a long time I want to be engaged and married\". You can't have it both ways, you're trying to have the cake and eat it too. If she's not getting what she wants why should she give you what you want especially when you use the SAME EXCUSE. Man up or cut or loose cuz it's been 3 years after this point she is wasting her life with you if you're not going to give her what she wants. A lot of women want to feel like they're respectable enough to be married and not just sleeping with somebody for years they want the commitment that somebody's going to be there and not like you said just up and leave, it's called stability my friend.", "Yes, you are.", "YTA Sorry but if we’re not married im not giving you any financial support. Period.", "It's not about the rent and groceries. She made it very clear with you what her expectations were coming into this relationship, and now you're past that deadline and can't even give her an estimation of when you'd be ready. You can't expect her to bankroll you in the meantime when she can't even be sure it's an investment in her future. YTA.", "I don't really want to comment on the matter of who's the asshole here, but your whole arrangement seems suffocating to me. How can she be the one if you KNOW, for certain, that she is not willing to support you -justifiably or not - through tough stretches in your life? You are not partners in any  sense of the word, I don't even think you can be called allies at this point.  You both just better find something more meaningful and supportive", "NTA. GF is leveraging your misfortune to force what should be a mutually agreed to timeframe into HER timeframe which she DEMANDS.   This isn't a relationship.", "Bro, no one is dumb, if she were the one, you'd know.", "If this was the other way around and he wanted to break up with her simply because she lost her job, people would be calling him an asshole and a bad person. You dodged a bullet. Imagine being married to this woman and losing your job? She would have divorced you. Studies show that women will file for divorce when their husband loses his job which is why men have to be very careful when choosing a partner. Men are only important as long as they can provide.", "NTA \n\nAgainst popular opinion here I don't think you're an AH and I do think if the genders were reversed everyone would actually be in agreement with me. \n\nPartners are supposed to support one another. \nIn Canada you're actually considered common law at this point of 2 years living together so even the government agrees that you should be supporting one another. \n\nIf my husband lost his job .. which he actually did more than once before we were married (redundancy) and I supported him. It was extremely tough and a challenging time but we got through it together as couples do. \n\nThe proposal/wedding situation to me shouldn't be a factor in supporting one another since you are already common law and you are already living together, although you are due a new conversation about this and your future together.", "These comments are something else.\n\nNTA.", "NTA. I can’t believe how many people are saying YTA. If she was in your shoes, and you told her you weren’t going to help her with her bills unless she married you, people would be calling you a huge asshole. Not helping your partner in need, especially when it’s been so temporary means you don’t have a partner, you have a roommate. \n\nIn addition, finding a job right now is extremely difficult in a lot of places. There are a lot of jobs but the competition is higher. It’s taking people I know 6+ months to find jobs and they have years of experience.", "Oooof, so if you propose now it’ll seem like you just want her money. You done fucked up OP. If I was her I’d be thinking hard about leaving your immature ass.", "STILL hesitant to wed, … but not confused about asking for money.", "Those two sentences are entirely contradictory, too. \"Sure\" and \"hesitate\" don't go together.", "The audacity of some men!", "Chef's kiss. M'wah!", "Yeah you nailed it. He got exactly what he wanted, a gf not a wife.", "100% this, OMG! Yes! Expecting Wife Duty for Girlfriend Wages", "And he cites \"high kilometers\" as the reason! Did he even consider alternatives like public transit? Who buys a car immediately after being laid off?", "Commenting to bump this up- yeah, dude was unemployed and then took on a major expense of a car.\n\nUnwise decisions continuing to pile up on him.", "I want to know what kinda car he bought? A high end luxury car? Or something that was used a just cost a couple grand?", "That stuck out to me as well. There’s a reason OP went into great detail about why he needed to buy a car and this and that. Why doesn’t he use his car for food delivery while he’s unemployed? He already has the advantage of owning a car - in my opinion he should be applying to jobs within a 20 mile radius. There’s really no excuse.", "Yes! You didn't give her the security of marriage and now she's not giving you the security of marriage benefits.", "Exactly! OP could bail at any time, leaving her out her money and possibly without a place to live based on his threat to break the lease and move in with his family.", "While YTA is totally the correct answer, finding a new job isn't that easy, and, as others have noted, some jobs pay less than EI, so to just take any job could be a financially stupid move. So much depends on the industry, an applicant's location, and other variables that we just don't know.", "I'm curious why OP needed a car immediately after losing his job.", "He said he had one interview - dude you’ve been looking for four months and only had one interview? I’m sure there’s lots of service jobs hiring, try one of those?\n\nAlso YTA", ">4 months is plenty of time to find a job.\n\nto find *any* job, perhaps.  Took me 6 months to find another good engineering job.  not sure what his situation is.\n\n&#x200B;\n\n>It's clear who is invested and it's not you.\n\nHow do you know he wouldn't support her if the shoes changed feet?", "You are completely wrong about 4 months being enough to find a job. \n\nCompletely.", "Exactly. \n\nShe clearly communicated her desires and needs at the start of the relationship. She held firm. Good for her. \n\nOP doesn't get to be surprised when things get rough and it's now \"convenient\" for him to fulfill her desires because it means meal ticket for him. \n\nI would be strongly against his girlfriend accepting a marriage proposal now. Timing would be highly suspect.", "Yeah, that’s the vibe I got as well:\n\nOP, she’s just your gf… remember? You didn’t want to commit to her - REMEMBER??\n\nSince your gf is JUST your gf and not your wife (like she’d had hoped, actually wanted and made clear to you several times but has been denied - several times), she is not at all responsible for your finances or inclined to financially support you. Your gf is free to do as she pleases.\n\nAlso, the whole “she won’t help, that means she’s not serious about us” malarkey. Trust me - there was a time where she WAS serious about the relationship until you blew it by not wanting to marry her.\n\nShame lol.", ">If you live together and she doesn't help cover your portion of the rent, doesn't that also mean she will be evicted? \n\nShes planning on it", ">she told me it’s fine we can just end the lease and I can go back to live with family if I can’t afford rent here.\n\nShe's suggesting they try to end the lease and move on to separate living situations. She's not willing to just cover his portion of the rent. That is not a \"train wreck\" solution, but a reasonable one. Since he lost his job, the landlord may be willing to negotiate ending the lease rather than struggle through an eviction process.", "Right? The fact that this girl has been clear from the beginning pushes you into YTA for me.  \n\n\nWhat people want is important and no matter who here might not agree with her wants they have to respect that she has been honest from the beginning, not played games about it, let it slide for a year more than she had stated and is only now when asked to continue ignoring what she said she want and pick up his finances as well, has reached the end of her rope.", "Wow you think she's expected too much for refusing to sleep with you until you were exclusive?? \n\nShe's been waiting for years for you to put a ring on it and YOU think she still owes you more?  \n\nYta\n\nShe doesn't owe you financial support.   You are a boyfriend she lives with (roommate with benefits).", "No one seems to mention 4 months????!!! Get a job at McDonald’s. Or a bar. Or a janitor. Cut lawns. 4 months is LONG time to be jobless. Especially while you’re asking your partner for money.", ">We have been dating for 3 years doesn’t that count for something\n\nOP honestly is the worst. I hope his gf finds this post are realizes how much better she can do. OP, doesn't it count to you? She told you what it was she wanted out of the relationship. Now you expect her to fund you even though you have been unwilling to meet her needs. Instead you are blackmailing her to give you money.", "What a joke, dude's been getting the milk for free for 3 years and didn't want to buy the cow.  \n\nEdit:\n\nNow he can't afford the cow.", "In the Caribbean,  we call this: taking/drinking the milk but not buying the cow", "This. My husbands parents never married and though we use husband and wife rather than bf/gf because we have a baby together and he’s stepdad to my oldest, he knows I want to be a bride. He indifferent to the “legalization” of his love for me but he knows that I deserve the feeling of being beautiful at my wedding. \n\nI don’t have a deadline for him to propose but he knows I’m not okay living common-law indefinitely. \n\nThat being said: YTA op, you’ve had a year and a job to buy a ring and ask a question you know she’ll say yes to. Now you’re whining because your fear of commitment came off as noncommittal and your gf isn’t having any of it.", "This guy is Australian right?  I have a feeling based on some context clues, but does every Australian man act like a child?  Do they put something in the water over there?", "Yep, he doesn't want to commit to being there for her \"for better or worse\" but he wants her to pay his bills when the \"for worse\" part rolls around.", "She’d likely know why he was doing it too. She’s not dumb, clearly started by her reaction to his dumbass financial proposal.", "Agreed 100%, OP needs to find a job, any job, to hold him down until he can find something better. With my current job, do I love it? No. Would I do it permanently? Also no. But does it keep me afloat financially and help me save up for something better? Absolutely. Sometimes you have to work a shitty job until something better comes along.", "OP sounds like they're in Canada (\"EI\") - if they are, they're already common-law. Living together as a financially interdependent unit, in a romantic relationship, is the basis for this in every province, I think. They can claim common-law on their taxes. She could demand splitting assets if they break up. There's not a lot more rights to be had by marriage. \n\nUnclear if OP's partner wants a wedding or wants the contract (or both). But in their particular situation in Canada they're already an economic unit.", "I feel like it's too late now. If he proposes now it's just to get her to pay for him.", "Kind of rude to call the woman a cow but okay /s", "This is literally <insert metaphor here>", "She invested two years in him. At that point, realized she made a bad investment, and then wasted one year because of sunk cost fallacy.\n\nShe only wasted one year on him.\n\nOP - YTA - you wanted no commitment, you got no commitment. She's not serious about the relationship? What relationship? She has a roommate she hooks up with who is waiting to see if something better comes along. You're not marrying her. She's looking to end it. Eviction and terminating the least is her best option.", "Ouch! Call the fire department! 🔥 🔥", "THIS PART 😂🤣 The audacity of this guy is astounding.", "the trouble is that a man who can't emotionally commit and doesn't take women at their word is never, never gonna be a good catch. he might wise up after he's dumped, and decide to marry the next girl who walks by ... but that doesn't make him a better partner. it just makes him a *married* man who can't commit and doesn't take women at their word.\n\nOP will probably \"commit\" to the next woman who dates him, but he won't be more willing to put in the work.", "Your husband is a Man. OP is going to move back home with his mommy. You married the Right One.", "This is the only way to possibly save the relationship", "That’s what I was thinking. A mommy who also warms his bed.", "Exactly, cohabitation for 2 years?  Congrats, you are already married.", "Depends on the field he works in. I was unemployed for 5 months this year putting in hundreds of applications a week and couldn't find anything. I even applied to resturants and grocery stores but heard nothing back.", "Why did it take so long to find this comment!", "I'm caught up on that as well. After 4 months he's definitely being picky choosy and she most definitely doesnt want to financially support someone whose clearly not putting in solid effort. Marriage argument doesn't even matter at this point, I feel like its just for him to shift some sort of blame off himself.", "The big difference between you situation and OP’s is that the ring means nothing to you. You are in a committed relationship. \n\nA ring meant commitment to OP’s girlfriend, and she asked him for it. She was very clear about this.  He decided he wasn’t going to make that commitment, so this is *not* a committed partnership and he didn’t respect her values.", "Finally!! I was starting to think I had an unpopular opinion going here. \n\nOP, NTA. It seems the gf cares more about being married than actually being a partner. My fiancé and I have helped each other out, even before we were engaged. Because we're  PARTNERS. I can't believe so many people are pretty much saying you only help if you're married.\n\nI understand her expectations, but I expected I'd be married with kids and house by 25. Here I am at 31 with a house (but literally only 5 months ago), don't want kids, and have been engaged for almost 2 years. Life happens, things change, minds change. Should the gf carry OP while he does nothing? No. But he's TRYING to get a job. He's doing what he can and as long as that effort is there, she should be helping too.", "I'm surprised how hard it was to find a comment like this. I'm leaning more towards YTA because many of OP's comments come off as dismissive of the girlfriend's needs, so I do see why the girlfriend herself might be wary of supporting OP in this specific case. He does seem like the type who might just get comfortable and stop worrying about pulling his weight altogether.\n\nBut what I don't understand is how many people here seem to think that, in general, a romantic partnership of three years means nothing until a piece of paper has been signed. What is even the point of being together then? Is it all a long trial run, so that the day after the wedding they can start counting on each other for the curveballs of life?\n\nI've been with my partner for 1.5 years and I can't imagine a scenario where he lost his job and burned through his savings while looking for a new one and I went \"We're not married, so tough luck! Guess you're moving out.\" We're partners, not casually dating.", "Had to get through so much redditor \"just break up\" BS to get here. If the GF isn't willing to help him now what's to say she'll help him once they're married. If I lost my job and my partner, married or not, had the means to help me and didn't. I'd leave them just like he said. \n\nI've been supporting my fiance throughout her 3 year law school tender, we're not married but I love her and am more than happy to help. One day when she has the means to support me if I lose my job, I sure as hell expect her to. That's what relationships are: you support your partner when they need help.", "You've misrepresented the timeline.\n\nShe said I want to be married in a certain amount of time. He said no, THEN, he asked for money.\n\nShe indicated to him that he has put himself into a difficult situation.\n\nI strongly suspect that she wasn't interested in marrying him anymore the moment he made such a lop-sided request.", "He expects her to financially commit to him and meet his standards when he is very clearly dismissive of her, that's why he's the asshole not because he lost his job and not because he needs help.  If you look at his replies for more context, he says that if she loves him enough she should pay for him and that if she doesn't it means she isn't committed enough when she committed three years of her life and went 50/50 with him yet he thinks a ring and marriage is no big deal at all when it is to her and that it is meaningless, so he isn't even willing to do something meaningless and useless to show her that he values her while expecting her to bend over backwards for him. That's why he's the asshole.", "Nah. I went through a long relationship without marriage and we helped each other as needed. However, we both agreed to the nature of that relationship and agreed to help each other. It was longer than 3 years before either of us needed help; we’d been close for a decade by then.\n\nThe difference in OP’s case is that the gf has been in a relationship she’s unhappy in. She’s already compromised by staying with a partner who continues to cement his commitment to her. It’s unbalanced and makes it look like OP has gotten everything he wants and seems to have no real intent to move further as the gf wants.\n\nAs they aren’t on the same page, IMO, gf is right to think that helping OP here is a risk for both delaying further getting what she wants by taking on a dependent but uncommitting partner, but a financial risk as well as she’d have no legal way to get her money back from him if he bails later.\n\nIf they had a good relationship to begin with, a live-in partner of so many years would feel comfortable and secure in helping out.\n\nHer refusal says a lot about their relationship just as your past helping your partner says a lot about yours. They aren’t the same.", "This right here! And for those saying he should just take just any job, often companies won’t even consider an overqualified candidate for an entry level position because they know it’s temporary and they’ll leave as soon as a job in their field opens up.", "And coercing someone to propose due to temporary economic need is a horrible way to start a marriage. If OP isn't ready, he's not ready. I don't see this lasting if they cancel the lease and move out to their parents.", ">2 years is quick to get married.\n\nI think it all depends on how old you are.  If you're in high school, then of course you don't know who you're going to be yet and it's going to be a long time if you are one of the rare people who actually end up with their high school sweetheart.  Once you're in your mid 20's, 2 years should be enough to know whether or not you're going to be long-term.  Especially in the case of women, if you want kids and want to be married before having them, you don't have forever to wait anymore.  If you're not with the person you're going to start your family with, you need to know if you need to go to have enough time to meet someone else, fall in love, get engaged, get married, have some time alone as newlyweds before kids enter the equation and then finally start family planning.  All of this doesn't just take a few months, and without factoring in that plenty of people don't get pregnant right away.", "I think the point of most of the comments is that this isn’t a healthy relationship to begin with.\n\nGF has been unhappy for a while. OP is noncommittal. OP loses job and buys a car, expecting gf to carry him and all of his choices (including his lack of commitment.)\n\nIMO, ultimatums are silly but we are each individually allowed to decide what we individually want out of a relationship.", "Where exactly did OP ever say that he was paying her bills? If she didn't have money of her own he wouldn't be asking her for help lol", "The guy has burned through his savings in four months.   Now he want his girlfriend to burn through her savings for him.   \n\nFrom her point of view, she has no security in this relationship and now he wants to take away her financial security as well.  \n\nIf he was committed to their relationship, he would be doing everything in his power to be financially secure and if that means getting a dead-end job for a while then so-be-it.", "The amount of YTA is insane. What's she doing now is a reason not to marry her. I could never imagine telling my husband(before we got married) that I wouldn't support him through his hardships. She's showing you now what to expect when you need her support. Weather he has given her a ring or not yet if she really loved him she would be there for him. She obviously doesn't love him enough so how she wants marriage is crazy. She's showing her true colours", "Unfortunately shows how much sexism is here in this sub. NTA", "He wasn’t paying her bills though. They were splitting 50/50. Now he wants wifely commitment when he doesn’t want a wife. He’s been unemployed for four months and bought a car instead of taking care of expenses. She shouldn’t offer to pay any of his bills because he’s noncommittal and lacks financial responsibility.", "Oh fuck offfffffff. If you have been through higher education, you can’t settle for shitty hourly work in the meantime. The job market for degree holders is absolute shit right now and it surely does take months to find work related to one’s field unless they are lucky or have supreme connections. \n\nI think the immediate problem is worth addressing i.e. not being homeless vs the status of being engaged.", "His life wasn’t crumbling for the year prior to this, when he was just stringing her along.", "He’s been unemployed for months and bought a car instead of handling any expenses. Why should she support him with her hard earned money when he’s not supporting himself? He couldn’t commit, he showed he’s irresponsible with money, and hasn’t picked up a job for *some* amount of income in the 4 months he’s been unemployed. He’s not showing any initiative.\n\nBut yeah, she’s a needy brat.", "He could avoid that by getting his money right first. Doing it now would be a bad idea, though.", "Yeah if she wasn’t clear enough that she is a YEAR PAST what she had hoped for and “thankfully backed off” talking about it… wow. OP was relieved she wasn’t talking more about marriage (which he KNOWS is important to her) but is totally OK asking her to support him. \n\nI’d love to know what his idea of “commitment” (i.e., did they have a conversation about finances, kids, what commitment is to him if not marriage and not just “not bailing”) is while ducking her questions about marriage as he’s asking for a level of financial support more appropriate for a spouse.", "And your situation is a reminder that in normal relationships you just talk about it if one partner is wanting to move things forward. Her- \"I love you and can't wait to get married (either a big hint or actually says let's get engaged)\" You-  \"I also love you and can't wait but I would feel so much more comfortable getting a few of our upcoming Big Things out of the way so that we can feel secure having the wedding we want\" Ta-da! Problem solved. OP just said he is hesitant with no actionable markers to move the relationship forward and that is an issue in a healthy relationship.", "He could have proposed and said that it will be a longer engagement because he wants to be set up before they start their married life though.  That would have shown her he IS committed and wants to be together, but he is also responsible and wants their life together to be more than struggling.", "My BIL was a lot like this. He was madly in love with my little sister a solid 6 months in and he was clearly in it for the long haul. \n\nEvery year we would ask him when he's going to propose. We didn't ask necessarily as an expectation for him to do anything. He was just so head over heels and such a romantic that we knew it was on his mind. He kept saying he wanted it to be perfect. Graduated from college, Perfect financial position, perfect health (he wanted to lose weight and look good in his suit), perfect career, perfect house. My mom kept telling him there's no such thing as perfect. \n\n3 years later, my little sister put her foot down and told him if he didn't propose, she would. He REALLY didn't want that. He wanted to make the perfect proposal. He planned a proposal and then Covid happened. \nAfter the Covid years (2 years later) he proposed and they planned a beautiful wedding in 3 months and got married. \n\nThen, three months later, he woke up, told her he didn't feel well, tried to get up, and died before he even hit the floor. He had just turned 30. \n\nI wish they had gotten married earlier. She could have been a happy bride for awhile longer. On the other hand, I'm happy they had those 5 years beforehand together. \nLife is too short though and you never know. When you're sure, you should go for it.", "People who are waiting for a specific \"right time\" to get married do two things that are counter to OP's behavior.\n\nThe first is that they don't describe it as \"being hesitant\", they instead refer to it with goal-focused language.\n\nThe second is that they *actually talk to their partner about their timeline*.", "Yeah exactly. I have already found the one but a wedding right now would drain most of our savings. We're already committed to one another, signing a piece of paper and saying some vows would change very little in the way I feel about her.\n\nThere's nothing wrong with being careful. Imagine if he'd lost the job and they had a wedding to pay off.", "I just wanna chime in and 3 years is not as long as he thinks it is lol", "Yup. But if her deadline was 2/3 years, she, too, should have left when he didn’t.", "\"I can't commit to being with you for better or worse, but I want you to support me for better or worse\"", "The smash-hit makers of the Manic Pixie Dream Girl here with their exciting new product! It's... The BangMommy! \n\nAre you a guy over the age of 18 but under the age of responsibility? Are you tired of being expected to \"save money for emergencies,\" \"clean up after yourself,\" and \"take accountability for your own outcomes in life\"? Don't you wish there was a way for you to experience the satisfaction and relaxation of life with your mommy, while enjoying the freedom to smoke weed in the open and have sex without whispering? Then you should try... The BangMommy!  \n\nBangMommy is available in self-esteem sizes S - so small were not sure it ever really existed to begin with and can be found at alcohol retailers and singles events nationwide. Try one today to see if BangMommy is right for you. \n\n*Returns honored up to 2 years only*", "Being a woman is really not easy. A lot of pre established traditions that just can't be followed in today's world. On the upside, I've noticed it is very simple to just leave all of those behind and continue a normal life for yourself.\n\nAnd for men, life is supposed to be easy, but today's world have been shaped in such a way that our expectations are always challenged and coping with those and the egos are a really hard process. Like it takes years just to accept simple facts that were once \"normal\" in previous centuries.", "I wish I had her shiny strong spine! Instead I wasted years supporting a non-commital deadbeat that ended up dumping me in the end when I finally started to grow a spine and put my foot down about things. YTA!", "The audacity of some people these days", ">”So he can suck a fart.”\n\n\nI actually *cringed* at this!!", "To be fair...you need reliable transportation if you're interviewing for jobs regularly.  I'm not relying on public transport (at least in the US) to make it there on time.\n\nStill his job to pay for it though, not hers.", "Exactly!", "Its not that simple. If you take a job at Mcdonalds then you lose your unemployment. Which would probably mean less pay than he is currently getting.", "This reply is too real because I had this exact issue, had been with the dude for nearly four years and moved to Texas after he insisted and he knew I wanted to be married. After he pressured me into an abortion in spring 2019, he lost his job end of summertime (failed drug test, government job!), insisted we move to where my family was living, then bailed on me no contact when I insisted he get a job at Hardee’s a couple blocks away because the city we moved to was too expensive for me to cover expenses by myself, and he didn’t have a vehicle, and we had already surpassed the “mooch off her family” stage of living there (2 weeks). This past August marks four years since this happened, I’ve never heard from him again.", "it took me 6 months to find another good engineering job.  \n\n\nIf I went to go apply at mcdonalds, they laugh me out the door because they know i'm just waiting for a real job to jump ship.  they aren't interested in the risk.  Same was true for most \"entry level\" jobs.    \n\n\nI could lie, but then I'd have to explain wtf I've been up to for the last 5 years.", "Yeah, I defended my PhD \\~10 months ago in a field that's supposedly drowning in government/VC funding and could only get one first round interview with a large company; after \\~4-5 months of nothing, I broadened my search and am going to be starting a post doc that pays half as much as industry roles. My brother also graduated with a bachelors recently and has been applying for every entry level job he could find for 6+ months now and found nothing. He'll be stuck working a shitty retail job and living with our parents forever at this rate", "I made the same point.  Took me 6 months to get another engineering gig and any entry level place I went to in the meantime laughed me out the door, saying I was overqualified and would just leave in a months or two when something real came along.  they weren't wrong!  \n\n\nBut its remarkable how many people don't consider this.", "Same let go from Microsoft and still could not get a developer position for 8 months and only now got rehired. Worked like a dog scrounging job boards, learning new skills and im actually happy to go back to working. I think it’ll be easier.", "i JUST got a job a month ago after being in the same exact position as you for about 9 months. sending out every application and resume i could, daily, for 9 months. Nothing but rejections, if i even got a response. shit was rough and discouraging, especially since i have 10 years experience and several certs in the industry i was applying to. I even applied to several places like walmart, home depot, local grocery stores. NOTHING.", "Hah- or she just walks out because he's been very clear with her that he's not going to give her the commitment she wants, and now he's asking for a financial commitment from her. \nThis isn't about his job opportunities. This is about him being denied an uncertain-in-length-and-scope financial commitment from someone he wouldn't make a legal/emotional commitment to. \nIf he doesn't like being denied something so important to him, he can do what she's done- adjust her expectations and continue, or he can leave. Same choice he gave her.", "I get where you’re coming from, because I’ve been in a similar situation as yourself. But there’s a difference between us and OP. We are MARRIED. \n\nWhen I supported my now husband, he was my then fiancé. I knew he was going to marry me because he put a ring on it and we set a date. I knew if he could emotionally support me, I was more than happy to temporarily financially support him.\n\nOP can’t even do that. If they were engaged, I’m sure his GF would be more willing to help.", "It can get super weird with that. Especially if you are \"overqualified\" for something low level.", "Well we won’t ever know that she would just complain will we so lets not assume. You are talking about your HUSBAND, and op is not her husband so it’s totally different to her", "I bet your husband had a great plan and showed commitment to the process of finding a new role. I’m not too hung up on the timeline bc I agree that 4 months isn’t that long. But from what has been shared OP has no plan and is asking his gf for a free ride indefinitely.", "Meh. \n\nWe don't know that she can't afford to cover the rent on her own. Just that she's not going to cover it for OP while he's living there.", "Exactly what I said. \n\nHe wants her to act like his wife with actually making her his wife when he knows those are her terms.\n\nNo one should get married before they're ready but this is the new \"Want the milk without buying the cow\" dynamic.", "Yeah it's bullshit. If something were to happen, *of course* I'd cover my husband financially because *he's my husband*. He's helping pay for grad school (I got a large grant, and it's really only less than 2K per semester, but still) *because we're married*. If we weren't married, he wouldn't help with that nor would I expect him to. \n\nShe needs to dump his ass, and get a roommate to cover the other half of the rent until the lease runs out.", "No kidding. He refuses to even bump it to fiance status.", "💯", "OP goes from being sure she’s the one, to being hesitant about marriage, to saying rings and marriage don’t even matter. These guys are clearly not compatible and it seems like this tiff is gonna expose the hell out of that.", "To be fair, if I was the girlfriend I wouldn't trust a proposal from OP right now anyway. He didn't want to propose to her before, but now that he needs someone to pay his rent suddenly it's wedding bells? Nah.", "Exactly. If it doesn't matter then what's the hesitation. He knows it matters or it wouldn't be a problem", "Well now he runs in to it being obvious he’s marrying her to tie their financial futures together. It sounds like she wants to have a commitment to a shared future and marriage is openly stating that. He’s resistant to committing to that and now wants what she could easily argue is the perks of marriage, but without the commitment. She’s going to leave. She just either hasn’t made up her mind or is in a sunk cost fallacy.\nYTA by the way. It’s not all about you.", "This person is probably one of us perfectionistic, idealistic millenials who doesn’t know “as good as it gets” when it hits them in the face. Our parents taught us we could have anything we want and this ruined us in certain ways.", "Have you seen this job market? Not to mention, depending on how much OP made their unemployment might be more than working at McDonald's or a bar or cutting lawns. So taking a low paying job would actually lower their income.\n\nI have a friend who is a highly skilled and experienced Cyber security analyst and he's been out of work for almost 6 months and has had a ton of trouble, one company had him in a 5 round interview process that took almost 10 weeks and then ghosted him.", "And since he has no morals, as we have seen, it would only be so that he can mooch off her. Hopefully she is smart enough to see through him.", "I know, it makes me cringe, but I figured if she made ice cream in the analogy it would help", "Yeah, that's what I figured. Definitely YTA. That's how I was leaning anyway.", "Bc a woman communicating her (reasonable) expectations is not a threat or ultimatum. It was just her saying what she expected and if that wouldn’t work for him, she gave him very fair, very early notice to avoid the exact scenario she is now in. If that bothered OP the way it bothers you, you end the relationship before you’re 3 years in. \n\nThat said, do think it’s a little strange to compromise, stay with the guy another year, and then all of the sudden feel like she can’t help cover expenses /or offer it as a loan given that she’s already compromised this far in her original goal. BUT, to me this just evidence of the “last straw” and im more surprised OP felt comfortable asking for a handout without even offering to pay it back. Asking that of your parents or something is one thing, but your gf? It’s literally the equivalent of asking for like 10 grand (depending on rental rates where you live) no questions asked, which I think is wild. Like, I love my husband, but if he asked for 10 grand while we were dating I’d have quite a few reservations too.", "3 year relationship = no commitment\n\nA shiny rock on a metal band = commitment", "I think this is an ESH situation. You're right about OP seeming dismissive. \n\nBut for his girlfriend, having a timeline like that is insane unless you are going to take responsibility for it. \n\nI am not married, but have lived with my partner for 7 years. Marriage isn't the end all of serious, committed relationships", "\"We're not married, so tough luck! Guess you're moving out.\" We're partners, not casually dating.\n\nYou didn't tell your partner on the 3rd date; I expect to be engaged in 2 years. She's been with him for 3. she gave a year.     she's over this relationship. its a relationship going no where fast.\n\nNo offense, but you're playing house. Marriage is contract and contracts have legal benefits and duties.   She wants to get married, he's not sure but he sure wants her to spend money to prove she's committed. she gets nothing out of this deal. its a bad deal for her and she's over this relationship as she's comprised enough.", "It's weird too. If she wants to get married so bad, she can propose...? \n\nAlso, 2 years isn't necessarily a long time to date before marriage. There are a lot of factors. I think a timeline like that is weird. I don't know why marriage is so important to everyone on this sub. It feels so old fashioned. I've been with my partner for 7 years, we are absolutely committed to each other and would help each other 100% in these circumstances. I wouldn't refuse because we're not married yet.", "What confuses me is that she refuses to do the things that you do for someone you’re married to. Not just that, but marriage generally means you’re combining your finances. So what does she think would happen if they were married and he lost his job? She’d be supporting him anyway. Seems like a silly thing to throw away a long term relationship over.", "That doesn’t matter. A relationship isn’t a tit for tat. Oh I paid your bills now I need help and you pay mine. Nah lol who cares if it was 50/50, if my girl was down and need help and support I’m going show up and be there. We’re in a relationship and that’s the one person you should be able to trust no questions asked. I know she’d do it for me without hesitation. Shit I make 6 figures, so does she but not as much. By next year she will be making more than me. Even told me I can drop to part time if I wanted. That right there is how I know I have a real one. Not all this petty crap I’m seeing in this thread.", "100% agreed!!! I think people here are allergic to accountability lol I was always taught act the part you want. She definitely isnt acting like a wife or someone that’s wants to be married.", "Buying a car, in the us at least, is a necessity not a luxury.\n\nWe obviously don’t know the details, but on the surface of it… it seems that his gf is not someone to rely on.", "He bought the car before he was unemployed. Lots of comments justifying “I didn’t get what I want so I’m not gonna help you when you need it.” Childish behaviour.", "Yes.. financial commitment to pick up the slack, or else she is not serious. \n\nShe failed the test.. he should bail, right??… but he is in no position to bail now!", "Couldn't he propose while defining clear goals before tying the knot (\"let's save for a down payment first & let's define a wedding budget and save for that too\")? Without a clear plan or goal, it's like he's hesitant and stringing her along until he finds someone better (or just expecting her to give up).", "It didn’t “help” really. We built more of a life together before cementing it, which felt right to me. Others might see that as needlessly delaying things but I just wanted to share a perspective as to why I hesitated on marriage.", "I agree.. sad situation for her tbh.", "Hit it on the nail!", "This. Also, the term \"bang maid\" exists.", "Bahahahaha love this", "This made me fucking SCREAM lmaoooooo", "Best comment ever.", "A Lyft to the occasional interview isn’t that much money.", "He said \"kilometers\" so he is not in the USA. Europe and Canada have excellent public transport.", "You're also wrong. EI maxes out at $650 a week, no matter how high OP's income was.", "Yup, OP wants gf to throw money down a hole. \n\nA spouse throws money into the legally-bound household.\n\nThat marriage contract makes a massive difference.", "As someone who deals with adhd and mental illness, lots of the typical \"easy to get\" jobs are very hard for me to maintain and make me suicidal. even if the money was better than EI I could end up worse off", "If he expects her to cover his part, it means she can afford it, IMO.", "And she is the one but he’s not sure he wants to get married. But a ring and marriage isn’t a big deal except it’s too big a deal for him to actually propose.", "Yeah, for richer or for poorer is wifey shit. \"We dated for 3 years, doesn't that count for something?\" Not when she literally said to your face she's trying to *get over wasting 3 years with you*.", "My Mom told me this saying :(", "Sounds to me that both have decided the relationship is over, but neither wants to pull the ripcord.", "Dudes like this rarely ever actually marry. Like, I've known men who were hesitant to propose because they *really* didn't want to divorce but they had a lot more communication with their girlfriends about it.\n\nI suspect they were younger, too, they were married well before 30. OP's girlfriend sounds like she's at the \"clock is ticking\" stage.", "💯", "I agree. But that would mean that for him, there's no winning, right?\n\nYeah, this relationship's toast.\n\nEDIT: I'm not trying to defend OP. I'm just kind of coming to a realization. YTA.", "I need a place to live and I promise I will try to be nice, please be my valentine? <3\n\nI think the whole marriage time limit thing is weird, but a totally broke person proposing is only charming when you're either insanely in love or insanely in love teenagers. (Obviously with the exception of areas where nobody has any money, there it'd just be normal and sweet)", "I mean he cany buy a ring either", "Yeah those were my thoughts too, either way it's a crap situation. I knew someone who accepted a proposal from their BF after like only 1 year of dating and the guy was constantly borrowing money from her. I couldn't fathom how she could accept that proposal, and after some time other issues showed up and they ended breaking up and he got the raw end of the deal from the house they \"bought\" together. (Basically he can't even live in it or get the money back until she decides to sell it.)", "He seems a bit on the “hobo sexual” side, if you ask me!! 😂😂", "You guys are so mean. He just wants all of the upside with none of the \"downside\"... if downside is making a commitment to the person you supposedly love.", "You can collect unemployment and do cash only jobs dude🤦🏻‍♂️. Everyone appears to say how hard it is but just gloss over the fact his partner is being asked to pay for OPs life.\n\nAnd per your friend being a cyber security analyst…what certs do they have? Are they only applying for that specific job again? If you’re tech savvy there’s a million side doors leading to extra income.", "That's a good point. I was giving the girlfriend a pass because while the timeline is weird and arbitrary, she has a right to it and was clear about it from the start.\n\nBut she's got to be at least in part TA because she's accusing OP of not being committed enough while not acting like she's committed either. If she's unhappy then she should leave the relationship, not stay in it while making her support conditional on getting what she wants.", "I didn’t see this as a case of her wanting a “proposal” and more that she just wants him to agree to marry.\n\nIf he doesn’t agree to that, who proposes is meaningless. \n\nHe’s noncommittal in his own post so it’s not a question of who proposes.", "I guess if he is actively delaying proposing she has a good idea the answer is no.\n\nGenerally people should be helping but I guess if she feels she is about to leave anyway it is less about asking a committed partner for money and instead asking someone about to dump you for money.   In general I agree though.  \n\n\nTimeline is short but at least it was communicated well.", "THANK YOU. If she wasn’t happy with not getting her needs met, she should’ve left him. Not continue a relationship where she thinks she can treat him lesser than a significant other until she gets her way. This is her fault and only hers. OP has every right to not be ready to commit to marriage but if she is continuing the relationship, she is obligated to respect and love her partner and it’s clear she isn’t doing either. I hope she is happy that she wasted 3 years of her life and showed she is incapable of loving a person.", "It can be harder to leave someone when you’ve been living with someone for a while.\n\nShe was probably planning on their marriage and since her deadline hit, she’s had to figure out her next major life moves all the while likely hoping OP pulls through.\n\nIt’s silly to think she would be ready to move out and end it right on that deadline. But it would also be silly to think she isn’t already mentally out the door.", "He WILLINGLY entered a relationship with this person knowing they had these expectations. Now she is the AH for having them? Why didn't he decide she was crazy then huh? She isn't acting like a wife because OP isn't acting like a husband. \n\nSeems like you were taught to be a sucker.", "I mean, he could absolutely. Some people want to wait for the money for a ring to propose with too, but other than that, idk what the issue is. I hear some people say they don't want a long engagement, but if you're gonna be dating anyway, who cares", "But once you get married you go through monumental things as well, like further education, kids, buying a house, significant illness, career changes etc.\n\nWas their some pre-conceived notion you had that being married while doing those particular \"cementing\" things would have led to divorce?\n\nI guess I'm confused as to how the nature of a commited relationship changes so much from dating to marriage if you're already on the same page.\n\nWere you not living together? Was it something to do with that?\n\nEdit: and just in case it's relevant, I am married.", "Canada doesn’t actually have excellent public transit unless you’re in Toronto or another major city like it. There’s a lot of distance between regular towns.", "OP mentions kilometers in his post, so it's unlikely that he's in the US.", "Yes exactly. Supporting a spouse is worlds apart from supporting a non-married live in partner. In a marriage all of the money is legally shared. It doesn’t matter as much where it comes from, so there’s incentive to support the household not just yourselves. \n\nThere are plenty of people on committed long term relationships who run their house that way too which I think is perfectly fine. But there aren’t really any legal protections for them unless they have contracts etc. \n\nI OP said that his gf is afraid he’s going to take her money for months, eventually get a new job, then dump her and never pay her back. I think given his fear of commitment, their conflict between them on a marriage timeline, and their month to month lease, it’s not an unfounded fear. At least if their lease was committed he couldn’t leave as easily lol", "How can she resist such romance!! Lol", "He's too cheap to buy her a ring. He's so cheap to expect his roommate to cover his rent.", "(He doesn’t want to ever get married but doesn’t want her to break up with him)\n\nWhat a charmer", "Which explains quite clearly why she's not enthusiastic about covering his bills. She's already checked out.", "Seems like OP only has decided that the relationship is over now that his GF isn't putting anything more into the relationship especially financially. If she did I'm pretty sure he'd be happy with the status quo even though she's unhappy.", "She said she wasted three years with the guy. If that isn’t pulling a ripcord I don’t know what is.", "He wants to stay now because he wants her to pay his bills. She should run.", "Funny how a legally binding lease will do that", "Absolutely. He doesnt really want to get married and she’s not prepared to pay for a couple of bills for him - best to just accept it’s done at that point but neither of them seem to be prepared to admit it.", "Sounds like he doesn't want it to be over because he wants her to float him lol", "He would have won if he appreciated his girlfriend more or found another job so he didn't have to rely on her financially. He wants Husband benefits, but he's still on the Boyfriend plan.", "yes there's no winning, because he asked his girlfriend who he hasn't committed to yet to pay his bills. \n\n\nmaybe i missed it. did OP say why they couldn't find a job?", "Which is why you figure this shit out before the hard stuff happens.", "unless he gets a job quick", "Agree with FitBook - I've seen too many of my friends get d\\*cked around by romantic partners that wouldn't commit and kept whiffle-waffling around.... that seed of indecision inevitably crept into other areas of their relationship(s) and I never saw it end well.\n\nSo I have respect for people who are honest and upfront about looking for that level of commitment and who come out and make it clear that they won't wait around years and years for the other person to decide.", "I would have thought a marriage time limit silly in my youth, but having been fucked around by a guy nodding passively for over a decade and potentially fucking my chances of having a family, I think it's smart.", "I believe that is a hobosexual move.", "LOL @“please be by Valentine”😂", "Look. If you don’t know that you are serious about a person and can’t see yourself committing and marrying this person after 2 years you’ve got problems. Why are you dating this person? You can not want to get married but after 2 years you should know one way or the other if they are marriage material. \n\nShe was upfront about her expectations and he knew that. Her big mistake was moving in with him without a commitment (engagement ring) and not following through and ending things when it was clear he wasn’t interested in marrying her. \n\nSounds like she’s done with him now though. Good for her. If she wants a husband she shouldn’t waste her time on the OP.", "*No Scrubs overlay increases in volume*", "That's my thing too! She isn't wrong to have desires or timelines, but she also sat back when the 2 year mark passed.\n\nI would've been devastated as OP", "They aren’t chained together. They have no legal obligations to each other. She’s allowed to leave him to sink if she wants because that’s how uncommitted relationships work.\n\nFWIW, I refused marriage and was in a long-term relationship without legal obligations and we ended up helping each other through things like this. \n\nWe were both fully on board with it. It would have been different if we weren’t, as in the case here. She hasn’t been ok with this relationship and he has known it. Maker, meet bed.", "She's the one incapable of loving a person when she changed her boundaries for him? Where is the respect he owes her too? He is also very much able to leave the relationship if he isn't ready instead of lying to her (telling her he would think about it when he already thought about it), and leading her on.", "But seriously, who does that in this millennium? Setting a deadline for proposal, way to kill romance. Also, one might think that love would be more important to her than a ring, but apparently, the jewellery is the important part. And not helping someone you supposedly love? I mean, I'd do that type of thing for a friend. It doesn't even have to be my partner. I think any sane person would.\nNTA, she's toxic.", "Allow me to jump in.\n\nLots of young people who get married are poor, uneducated, and honestly not ready for marriage yet.\n\nThis usually leads to an early pregnancy before either partner can actually solidify some stability in their lives. So then it's a constant game of catch up and delaying your personal aspirations and dreams to keep up with each new life change.\n\nNext thing you know it's 10 years later and there's growing resentment because the couple only had the resources and time to have 1 partner follow their dreams.\n\nYou may be an outlier, but its fairly common for people who aren't ready and in no stable shape to be married, rush into it, which starts the marriage on a shaky foundation to begin with.\n\nOne of the #1 stressor on a marriage are financial issues.\n\nIt makes sense to get that in a row before you both meld your lives together.", "Yup she probably was going to leave but now feels bad because the bf is broke and dependant on her to keep his standard of life", "This is my impression as well. It’s been a year, she’s tried to talk to him about it, but “thankfully backed off”. And now he wants to say they’re serious enough to pay each other’s bills but not to have a real conversation about whether they’re compatible?! Nah.", "“I knew she was unhappy but I thought it wouldn’t affect *my* happiness!”", "Right?  The parachute came out bright fucking red for her .", ">I’m getting interview requests back and did an interview already although I didn’t get it\n\nThis makes it sound like he hasn't been making very much effort to find a new job. Only one interview at 4 months of unemployment? Sounds like he just expected her to cover for him.", "I got laid off in March, have applied to roughly 600 jobs, did at least a screening interview at a bit over 100, and I still haven't managed to get a single offer. Depending on your field/experience/skillset, the market could be terrible right now. I'm single and had fairly substantial savings so I covered everything up until my lease was over and I moved back in with my parents, but if someone is trying to find a job but is struggling right now I can't blame them.", "Yes!!  I understand the wedding bells are not for everyone, but his girlfriend was upfront.  OP, you snoozed and you lost.  She told you two years and it has been three, you said you think she is the one, what is the hold up?  Don't ask now, it's too late.  Now you will have to get a job and pull yourself back up, and it will still be too late.  (probably)\n\nYTA", "Some people don't care about marriage and that is fine. But for people who do two years is long enough to make up your mind and an ultimatum is fine. Everyone gets to choose.\n\nA friend of mine emigrated with her boyfriend and told him that he either proposes or its over. She meant it. He proposed and they have been married for over 20 years.", "Facts man people don't understand that is a big problem.", "He has his own car, who knows if he has money for gas, tho", "We’ll have to agree to disagree about her having expectations being toxic", "Damned if she does, damned if she doesn’t", "I think I'm understanding that overall, but I'm just curious how marriage somehow changes everything you said? They can't get pregnant outside marriage? They can't grow resentful outside marriage? If they're so poorly educated why are they somehow able to keep from getting pregnant as long as they don't get married?\n\nI've had friends who waited for different reasons, I guess I'm just struggling with some of the ideas people have here about what happens when a couple gets married.\n\nI think we've all known people who didn't get married, or plan on it, and the exact same things happen to them as the things you're talking about.\n\nThere are a lot of social, cultural and even religious reasons for partnership or marriage to look a specific way. I'm just finding it hard to comprehend some of the reasons given here, since they fall outside the zone of what I've typically heard of seen over the years (reasons that appeared more thought-out, with very specific reasons for delaying) whereas the ones presented here seem to have more to do with the perception of what marriage does or doesn't do.\n\nAnd just to be very clear, I'm talking very specifically about people who say \"i knew they were the one\" but then posit the reasons given in this particular comment thread.", "Honestly, not even her problem lmao. That's a him problem.\n\nIf they were married, it'd be a different story, but otherwise, nah. She's still free to leave at any time, and I'm sure she will.", "Or she’s staying until their lease ends. Lots of people aren’t in a position where they can afford to cover rent alone", "this hits hard....", "Classic.", "And he blew his savings on a new car while unemployed!", "Not necessarily we don't know anything about OPs resume so we don't know how hard he is looking. I do agree that when savings run out it's tme to take any job while still trying to find a career, but if the GF was serious about the relationship (either of them really) then she could have said \"you get any job and contribute what you can and i will make up the rest\" and give him  reasonable time frame to find any job.", "Eh, depends on the industry. If dude's trying to go work a customer service job for something in the meantime (retail, etc), yeah I doubt he's putting in much work.\n\nSpecialized fields like software engineering or something in Tech/medical/etc? Yeah I could see this being a standard return, or even 0 interviews in 4 months.\n\nNo point in really speculating though since we don't have numbers of OP's applications in those 4 months. The job market sucks ass right now if r/jobs posts are anything to go by lmao, and my personal experience as well at the moment.", "The perfect time to buy a new car", "I don’t know there have been stretches where I couldn’t get an interview while out of the job.  That’s not that odd to me", "Just popping here to say I was thankfully employed, but I was job searching for a new job because I found out I was pregnant and wanted to switch to a job thay allowed me to be with my kids more. IT TOOK ME AN ENTIRE YEAR to get my new job. I even had consultations at hiring companies for assistance. The job market right now is shit because companies are filtering through their applications using AI that pings for X amount of \"key words\" but those words are a mystery! So unless you literally change your resume every single time you submit an application and somehow manage to figure out what key words they are looking for 9 out of 10 applications are never seen by actual people because if they don't pass the AI filter they get essentially thrown out. So it's possible OP is actively trying to find a job and just having shitty luck. Not defending OP, just wanted to say his job search is not the issue here.", "Not that it affects the judgment but I am curious as to what his response to the two-year timeframe was. \n\n*hell yeah* ?\n\n*we'll see* ? \n\n*ask me again in 1.5 years* ??", "Honestly, there's a reason around 2 years is when a lot of relationships end. Cause it's around then that you either know you could be with this person long term... Or know that you couldn't", "Reasonable expectations are like \"I expect you to do your fair share of the household chores\" or \"I expect us to go on 2-3 dates a month to keep the romance alive\".\n\n\"I expect you to feel a certain way within 2 years\"  Is inherently manipulative.  If you truly accept this as a standard for beginning the relationship... At that point I don't see much difference between proposing on the 2nd date and waiting the 2 years to propose.", "Which is exactly what she's saying. He doesn't want to make the commitment but expects her to give him money. Lmao", "It's almost like OP would like the security of a firm and binding commitment to share life's trials together...", "It cracks me up that this got downvoted. There’s this huge idea in modern society that marriage doesn’t matter/mean anything. And those same people act fuckin surprised when they don’t get husband/wife treatment. Like dude, you ain’t even try to buy the tickets! Of course you can’t get in the show!", "He said the cost of fixing his wasn’t worth it. It’s entirely possible that he got a car that costs less than what the charge would’ve been to get his working again.", "there are many service industry jobs available in my\ntown - i understand that unemployment benefits are something to weigh in but it cannot fall to his *girlfriend* to cover his bills. \n\n\n\ni covered my husband's bills because he was a student and quit his summer job. he said he did the math wrong & couldn't afford it, so could i cover for him? \n\nhe was working part time before he quit. i was working 38hours a week with a commute. i'd get home from work during that time and he hadn't fed the cat dinner yet. we divorced that year. \n\nfinances are a huge part of relationships, and you shouldn't let anyone mooch off of you - especially if they've made it clear they don't intend to marry you, and that's what you're wanting.", "If his resume is an issue, he should be switching tactics about finding a job. Since there's no indication he is doing that, his effort seems to be lacking. He should not be acting entitled to his girlfriend paying when he won't commit. I think she rightful realized that is a losing proposition for her. You seem to expect her to act serious about the relationship when he is not. I don't see why she should do that.", "Wow. Someone reasonable on this thread.", "Absolutely do not do any app based gig work and expect it to be under the table, they'll report it as soon as you hit the $600 threshold, then you're majorly screwed if you're trying to commit UI fraud."]}