{"id": 30247, "submission_id": "17mxt2l", "title": "AITA for telling my mother her opinion is irrelevant?", "selftext": "Bad title, I know, but there was a reason behind it. My mother and I enjoy reading these stories together, and we tend to have very mature discussions about it. We were reading one and my mother and I had very different opinions about whether or not the OP was an A-hole. Someone had made a joke in public that made their partner upset, but it was a joke that was made privately often. I told my mother about how I could relate to the OP. I said that I understood not being able to tell when someone is uncomfortable and when to draw the line. My mother told me I had no place to speak on this type of thing because I've never been in a romantic relationship. This pissed me off. (I'll admit what I did next was petty, but I don't know if it made an asshole.) I brought up the fact that we had literally just read stories about being trans and having an ed (We disagreed on both of these and they are both something I have experienced), and my mother spoke on those topics despite the fact she has never experienced either of those things. I told her that if my opinion was irrelevant when talking about romance, then her opinion was irrelevant on these topics. Am I the asshole?", "created_utc": 1699025809, "permalink": "/r/AmItheAsshole/comments/17mxt2l/aita_for_telling_my_mother_her_opinion_is/", "score": 15, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I'm afraid that my response took it too far, and if my reaction made me an asshole.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You simply told her the same thing she told you. NTA.", "Nta. It's a valid point.", "Makes sense\n\nNTA", "Nta you were being honest and shut down her lie", "NTA\n\nAnd I find it hilarious that you are asking if Y T A about your opinion reading in the same forum...just made me laugh.  \n\nYour point is valid with your mother.  I hope she is also reading this.  \\*waves to mom\\*", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBad title, I know, but there was a reason behind it. My mother and I enjoy reading these stories together, and we tend ro have very mature discussions about it. We were reading one and my mother and I had very different opinions about whether or not the OP was an A-hole. Someone had made a joke in public that made their partner upset, but it was a joke that was made privately often. I told my mother about how I could relate to the OP. I said that I understood not being able to tell when someone is uncomfortable and when to draw the line. My mother told me I had no place to speak on this type of thing because I've never been in a romantic relationship. This pissed me off. (I'll admit what I did next was petty, but I don't know if it made an asshole.) I brought up the fact that we had literally just read stories about being trans and having an ed (We disagreed on both of these and they are both something I have experienced.) , and my mother spoke on those topics despite the fact she has never experienced either of those things. I told her that my opinion was irrelevant when talking about romance, then her opinion was irrelevant on these topics. Am I the asshoel?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - just because you have never been in an exact situation doesn't mean you can't use empathy and put yourself in someone else's shoes."]}