{"id": 30308, "submission_id": "17nnpb5", "title": "AITA for comparing my cousin's fiance to a begger?", "selftext": "My cousin and I are the same age and it's like our family thinks everything is a competetion between us. They compare us all the time. She is the pretty one and I'm the smart one. To be fair also she is pretty dumb and I'm pretty ugly.\n\nI have a very good job as a vet and she has a minimum wage job in a fastfood.\n\nRecently she got engaged and has been talking about it like NON-STOP. Her fiance also has a very low paying job\n\nAs usual our family had to compare us so last night when we were all at my aunt's house, my aunt asked me when I'm gonna get married. I told her that I haven't found the right guy yet. My cousin giggled and said it's because you are ugly asf so obviously you can't find a husband like I did.\n\nI told her hey I said I haven't found the RIGHT guy. If I wanted to marry our street's begger like you did I wouldn't have much of a problem. I'm looking for someone with a good job because I don't want to be miserable for the rest of my life. She called me a C*** and is now demanding an apology for insulting them", "created_utc": 1699110701, "permalink": "/r/AmItheAsshole/comments/17nnpb5/aita_for_comparing_my_cousins_fiance_to_a_begger/", "score": 30, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole for comparing my cousin's fiance to a begger when my cousin called me ugly\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH\n\nLITERALLY everyone\n\nWhat the hell\n\nEta your family sounds exhausting \n\nI understand why you responded the way you did;  that doesn't make it okay\n\nYour cousin sucks for obvious reasons \n\nAnd the entire rest of your family sucks because this entire situation could have been prevented if they hadn't been instigators, breeding years worth of resentment between you and your cousin with their petty comparisons between the two of you", "ESH, the ugly comment shows how ugly her personality is and anyone that would be willing to get married to her probably doesn't have very high standards in regards to personality.\n\nYou suck too for looking down on people with low paying jobs, teachers are being paid very little for how crucial they are to society, some actors/athletes are paid a ton and don't provide much to society at all. Looking down on people based on income is quite ugly, you say you're the smarter one, why stoop down to her level?", "ESH. Her fiancé didn't do anything to you. The sequence:\n\nCousin: Calls you ugly (Asshole).\nYou: Stand up for yourself (great). In the process of doing so, call her fiancé (who's not even there as far as I can tell!) the street's beggar. (Asshole.)", "ESH.", "ESH and you all sound childish and exhausting.", "This reads as fake.", "Info: how old are you and the cousin?", "ESH. You all sound like miserable and horrible people who get pleasure out of making other people miserable.", "ESH. Cousin is TA for insulting you. YTA for insulting an innocent person (her fiance).", "ESH", "ESH. I mean, it was a funny response given her crappy behavior and the family history. But have you ever flat out confronted them as adults and say to knock it off?", "ESH. Maybe y’all just need a good ol brawl it out in the streets. Winner will forever be the better cousin.", "ESH. Your family shouldn't pit you against each other. Your cousin shouldn't have insulted you. But you shouldn't have fired back in this disgusting and classist way. Trying to use someone's socio-economic status as a marker of whether they're a good person or worth loving or could be a good partner is disgusting behaviour and you are definitely an asshole for saying that.   \nYour cousin is talking about her wedding because she's excited, which she has every right to be. Try being happy for her.", "ESH, it's gotta be so exhausting at your family meetings. She is the bigger AH by far, as she started the insults. Understandable that you kind of snapped.", "ESH. If you guys are busting balls then you need to: 1. have a sense of humor about it, and 2. not actually draw blood. If you're sincerely tearing each other down, then you have a serious case of arrested development and deserve each other.", "ESH Your family started this whole thing long ago, your cousin started it this time, and you climbed down and wrestled in the mud with her.\n\nEvery time you get into the mud with her you are degrading yourself. The only way to win is to refuse to play their game. See their attempts at manipulating your emotions by going for your weak points for what they are and refuse to give them any emotional response. If they want to upset you the most boring and unsatisfactory result for them is indifference.", "ESH you and your family are so rude. Do y’all have any love/respect for one another? If you do, get family therapy. If not, stop spending time together. \n\nBut YTA for looking down on somebody because of their job & income. You’re not better than anyone else, just different. Stop acting like a spoiled teenager and grow up.", "YTA. There's no good reason to match one insult with another. You're feeding into the competitiveness that is being promoted by the rest of your family. Bedsides, you chose a not-so-clever response. You both are pretty basic and ugly-spirited but you're the one asking for advice and I would have expected better of you.", "YTA because she made the nasty comment. You had no right attacking her fiancé when he has done nothing to you. If you said something else, I would have said NTA. She definitely deserves a low blow, but not at the expense of someone who was innocent in all of this. Keep your fight directed at her.", "NTA.  She insulted you and you returned fire.  Well done.  If you don't defend yourself in these situations, people will walk all over you.", "ESH: (but your cousin is more of an asshole in this story)\n\nYou guys have a very toxic family life. If being that cruel to each is your standard get-together, then you guys need to not be getting together.", "NTA- tell her that she likes to talk shit but cant handle when it comes back, tell her im ok with being a bit ugly but it seems like she hasnt cone to terms with being poor yet and for that you are sorry!", "Great come back. nta", "Need to work on your makeup game girl. Nta", "It sounds like you guys are both pretty aggressive and intense with how you talk to each other. Maybe your sense of humor or that’s just how you communicate, idk. Either way, she insulted you so you insulted her back. Not my style of communication but to each their own\n\nEdit: ESH", "NTA she thought she could get in on the bullying and found out she got nothing to brag about. Lol", "NTA.  Don’t come for me unless I send for you.", "NTA- but to add, your family needs to stop that. You’ll never be close because you’ll always want to compare with one another.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy cousin and I are the same age and it's like our family thinks everything is a competetion between us. They compare us all the time. She is the pretty one and I'm the smart one. To be fair also she is pretty dumb and I'm pretty ugly.\n\nI have a very good job as a vet and she has a minimum wage job in a fastfood.\n\nRecently she got engaged and has been talking about it like NON-STOP. Her fiance also has a very low paying job\n\nAs usual our family had to compare us so last night when we were all at my aunt's house, my aunt asked me when I'm gonna get married. I told her that I haven't found the right guy yet. My cousin giggled and said it's because you are ugly asf so obviously you can't find a husband like I did.\n\nI told her hey I said I haven't found the RIGHT guy. If I wanted to marry our street's begger like you did I wouldn't have much of a problem. I'm looking for someone with a good job because I don't want to be miserable for the rest of my life. She called me a C*** and is now demanding an apology for insulting them\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Genuinely thinking what response was she expecting before she dropped this sentence? \nCould it be handled better? Yes. \nI personally wouldn’t react the same way but i see there’s a history of micro aggressions here.", "ESH...\n\nBesides that, I read this and instantly thought, we're heading towards idiocracy, 10 years from now the cousin probably has 6 children.", "You sound ugly. And I’m not talking about looks.", "ESH congrats on becoming an AH just like the rest of them, now there's no competition you fit right in.", "I don't look down on all the people with low paying jobs, just the ones who think they are better than me", "Why? Because the answer is so straight forward? Or you've picked up some specific hints?", "Tbh I completely missed that they were the same age\n\nI thought the cousin was 19 and op was older \n\nThis makes it worse\n\nDid you see the comment about op wanting to duel her cousin?  💀\n\nI'm actually leaning that this might be a shit post after that comment", "How is that relevant to the judgement? Like seriously explain to me I can't understand it.\n\nI said I'm a vet so clearly not a kid or a teenager and we are thinking about marriage so clearly not old. Isn't that enough info for you? Like if I'm 28 I'll be NTA but if I'm 30 I'll be the ah?", "Changing people who have been like this their entire lives is not easy. Maybe even impossible", "I prefer a duel. Only the better cousin lives", "Her wedding is in 2 years. Am I supposed to happily listen to her for the next 2 years? Give me a break", "To be fair I still don' know why any of us talk together like I setiously dislike all of them", "So unless you also look down on people with higher paying jobs that think they're better than you (in which case income doesn't matter whatsoever anymore), you're being hypocritical.", "That someone who presumably is over the age of 25 would say something that mean and childish and that someone as successful as OP claims would handle themselves in kind, or have anything to do with this childish person.", "Well I was honestly going to say NTA but you’re unnecessarily aggressive so ESH. \n\nI asked because your cousin sounds about 16 but because you’re a vet, you both must be quite a bit older than that. So in general, this post feels a bit fake. \n\nIf it is not - This is surprising behavior of someone older than 16 and it’s surprising of you, an educated and older woman, that you’re putting up with this abusive language. Cut off your cousin and be around people that lift you up, not tear you down.", "So you take it out on others?? You and your family kinda deserve each other...", "I suspect that you would feel much better if you stepped away from them. Living like this sounds exhausting.", "I mean it depends. If they worked hard for it then maybe they are but if they like inherited it from their daddy then yeah", "I'm not aggressive it's a serious question. I said my cousin and I are the same age and she is engaged so clearly she is not 16", "If you're better than people that make less money than you, anyone who makes more than you is better than you,  you have to stay consistent. \n\nI can guarantee you there are people that work harder than you and make less than you do, just like there are people that work significantly less and make significantly more than you. If you're going to use hard work as a metric for who you're better than or is better than you, income is irrelevant. Surely being the smart one, you should be able to see the inconsistencies and hypocrisy in your thought process.", "I think you misunderstand my general thinking. \n\nAlso, I believe it’s an AITA posting rule to provide ages in the OP.", "Don’t bother with this person. She’s a complete AH with a real chip on her shoulder. Plus, based on her generalizations and her spelling, not as smart as she’d like us to believe.", "Pretty sure it’s a 15-19 year old kid that doesn’t know how the world works 🤷‍♀️"]}