{"id": 30307, "submission_id": "17nnccf", "title": "AITA: went wedding dress shopping with just my mom", "selftext": "Hi all! \nI’ve upset a few people with this and am feeling like an asshole so I wanted to check. \n\nI’m getting married next year and have zero clue what style or colour or anything I want for my dress. I booked an appointment at a few places for a Sunday with myself, mother, grandma, sister, best friend, and my future mother in law. The whole point was to play dress up and try literally everything. \n\nSo a few days before that, my mom came for a visit and mentioned she drove past a small bridal store in town and asked how I was feeling about Sunday. I say I was excited but was feeling a little unsure because I literally had no clue what I would like. She said we could go and try on a few styles so I’d feel more comfortable on the big shopping day if I wanted. \n\nWe went and spent an hour there. I tried on a bunch, found a few I hated and a bunch I liked but didnt find “the one”. Overall though, It was nice to try wedding dresses for the first time without so many eyes. It felt like it was for me, opposed to the day with everyone where I’ll let everyone pick dresses out, and basically okay dress up. \n\nNow, my sister is upset she wasnt there and I think my fiancé is mad his mom wasn’t there for the first time. Now I’m feeling like I should have waited. \n\nTLDR: went wedding dress shopping for the first time with just my mom before the day with a group and a few people are salty. \n\nAm I the asshole?", "created_utc": 1699109690, "permalink": "/r/AmItheAsshole/comments/17nnccf/aita_went_wedding_dress_shopping_with_just_my_mom/", "score": 37, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I went wedding dress shopping wi to just my mom before a big group shopping day. My sister is upset she wasnt there and a few people are salty they won’t be there for my first day shopping anymore.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "If you are old enough to get married you are old enough to go shopping with anyone you want for any reason you want.  I think that was a good idea, get the nervousness of something new out of the way.  As many onlookers you invited would be a bit much n my opinion.  Too many opinions to consider when yours  is the not one that matters.  Good luck with the hen party!", "NTA\n\nThis is your experience not everyone else's. You didn't pick the dress and even if you had it is your wedding. Wedding dress shopping is traditionally a mother daughter activity anyway Remember the Reddit saying \"you do not have to set yourself on fire to keep others warm!\"", "I will admit I don’t understand the whole go wedding dress shopping with everyone woman in your family idea. I went with just my mum and it was an amazing experience! We went for a meal together and spent real quality time just the two of us. I loved it! And that’s what matters that YOU have a good time. It’s you and your fiancées wedding and everyone else should be happy to participate where YOU want them to.", "NTA- and this is actually a really smart way to go about it. Wedding dress shopping can be really overwhelming with so many different options, styles and opinions. Going w one special person to get an idea of what you like and don’t like before the actual shopping day is a great way to minimize a lot of wasted time", "NTA.    you get to go where, when and who with you want.  You and mom just get a head start on styles you do and don't like.\n\nAnd if you had found your dress...perfect.", "NTA. Like I kinda understand that they feel like you excluded them from an important part of this experience that they were looking up to, since it was already set that you would all go together.\n\nOn the other hand, they are not entitled to your time. You wanted to try a few random dresses before and as an adult you can do just that. I mean what if during the time you were with all of them, you didnt find \"the one\"? Then you would have to wait all their schedules to match so you could go hunting the dress again?\n\nSo yeah, you are definitely not the ahole, and while I do understand why they are upset, I dont think they have the right to complain or mistreat you because of it, specially since in the end you didnt find the dress you want yet.\n\nYou have the right to do things the way it makes it confortable for you. Also if you do go later with all of them, dont forget that this is YOUR dress and YOUR wedding. Giving feedback is good, but if you find \"the one\" and one of them says they dont like it and ask you to pick another one, DO NOT FOLD. Do what makes you happy, this is something for you not them.", "NTA . This is you and your fiancé's wedding experience. You get to choose what you do, when you do it and who with.\n\nEverybody else outside is just a spectator, so don't let their opinions get to you.", "NTA. Your mom sounds awesome! All you did was get comfortable with the try-on routine. Now you won't feel as awkward tomorrow about how your undergarments fit, getting in and out of dresses, etc. No one should be getting their panties in a twist over this. It's not like you canceled the main event, you just did a warm up.", "Nta. People will be hurt because of course they want to be there but it’s not like they aren’t still going to be there for the big event and it’s not like you found the one without them. Even if you did it’s your big day, no one else’s. I felt uncomfortable like you did so I went once with my best friend to David’s bridal. Found a lot I hated and a few I liked but not enough for them to be the one. Then I went again with just my sister to a little boutique where almost every single one could’ve been the one. I decided to bring the whole party back to that boutique and together we found the one. I didn’t tell anyone I went with others or tried on dresses before so you could’ve maybe kept that part just between yourself and your mom but at the end of the day, it’s your wedding dress. If you wanted it to be a surprise to everyone you could’ve not invited them in the first place so they have no reason to be so upset", "NTA.  Ok, it’s ok to be disappointed that they weren’t able to come.  They’re entitled to their feelings, but going wedding dress shopping is not a “party”.  It’s something you need to do because YOU are getting married.  They’re assholes for making a fuss over it.", "**Do these people have nothing better to do than imagine ways in which they were offended?** If you respond to their complaints, you give them more energy than they deserve. \n\nLesson 1: Those who complained should be put on an **information diet**. They should only receive “official” communication about the wedding. Then, they have less ammunition to create imaginary hurt feelings. \n\nLesson 2: **Don’t engage these people in actual wedding decision-making**. If you do, your life will be miserable. \n\n**NTA**", "NTA - large groups in a dress appointment often have a detrimental effect on your choice.   So many want to push their opinions on you, so you do you--take only those people you can trust not to be nosy or push.", "NTA!!! You got to spend quality time alone with your mom and got a feel for what you like/disliked in dresses. Some women would give their eyeteeth to have that opportunity.", "NTA you went preliminary shopping to get an idea for what you like. Narrowing down a few options will save time on your “real” shopping day. You didn’t deprive anyone of anything. You still might not find the one with everyone along and that’s okay too.", "My dil took me to the bridal fairs and wedding dress shops. I lived closer to her. We get on very well. She asked me. She ended up getting her dress on line and I offered to pay for it.", "NTA. Is he going to demand she be in the delivery room too if you have kids?", "NTA. Your mom kindly offered to ease some of the anxiety of the process, and you gratefully accepted.  Fiances who don't have compassion for their brides' self-care have a thing or two to learn.", "Nta\n\n\nThis is exactly what I did. My first appointment was just my mom. Everyone understood it was a special moment between us.\n\n\nIt's your decision on who you bring and when. I think that was the best call. Especially given everyone else's reactions. \n\n\nNot everyone needs to come on Sunday.  Keep that in mind.", "NTA\nForty years ago, I went wedding dress shopping by myself, at a department store. Never understood why wedding dress shopping requires an entourage.", "NTA\nAre you going to spend the rest of your life doing things based on how other people feel or how you feel?", "Nta and please, dont bring other women. Only you and mom. NO ONE ELSE. This is your wedding. The only thing important? You love it. The dress should be the one you like. Not one others approve.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi all! \nI’ve upset a few people with this and am feeling like an asshole so I wanted to check. \n\nI’m getting married next year and have zero clue what style or colour or anything I want for my dress. I booked an appointment at a few places for a Sunday with myself, mother, grandma, sister, best friend, and my future mother in law. The whole point was to play dress up and try literally everything. \n\nSo a few days before that, my mom came for a visit and mentioned she drove past a small bridal store in town and asked how I was feeling about Sunday. I say I was excited but was feeling a little unsure because I literally had no clue what I would like. She said we could go and try on a few styles so I’d feel more comfortable on the big shopping day if I wanted. \n\nWe went and spent an hour there. I tried on a bunch, found a few I hated and a bunch I liked but didnt find “the one”. Overall though, It was nice to try wedding dresses for the first time without so many eyes. It felt like it was for me, opposed to the day with everyone where I’ll let everyone pick dresses out, and basically okay dress up. \n\nNow, my sister is upset she wasnt there and I think my fiancé is mad his mom wasn’t there for the first time. Now I’m feeling like I should have waited. \n\nTLDR: went wedding dress shopping for the first time with just my mom before the day with a group and a few people are salty. \n\nAm I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA for planning a get-together where you shop with your family but you spoil it for everybody else by excluding them ahead of time. They all wanted to see your initial reactions to things. Now it is just going to be a retread with me reactions to anything. That is what they are thinking.", "Nta", "it's your wedding and your wedding dress. who cares if they are sad they didn't get to see you try on dresses, they don't sound supportive from your description and how you're dreading the appointment later so I like that you just did a mother daughter look. nta to the max. you can have who you want there and decide where you want to shop. hope the dress search goes well!", "NTA - you did what you needed to do", "NTA—the shop I got my wedding dress from literally does a style of appointment like “come in and try on a few different style of dresses, like an orientation, before you make an appointment for real.” This was your orientation! And anyone getting salty about you doing a wedding thing with your *mom* needs to take a hard look in the mirror.", "NTA.  You're the bride, you get to decide when you try on dresses, and who is with you.  It was a spur of the moment thing, and nice for you and your mom to have that moment. \n\nTell your fiance he can have his mom  go tux shopping with him... to me THAT makes more sense since that's her kid.", "Stop caring about their feelings about this. This is a non-event and you are all adults. They need to manage their own disappointment. NTA. \n\n>myself, mother, grandma, sister, best friend, and my future mother in law.\n\nThis is borderline unmanageable. Too many people having and expressing opinions about something. I think that's what you're worried about. This doesn't need to be a group decision. You didn't even find the dress you wanted anyway.", "NTA. You are the only one who can say yes to the dress. I can't stop laughing at your fiancee being offended for his mother. Imagine if he found out some women have their dream dress picked out before they are even introduced to the future groom.", "The first time I went, I opted to go alone. I have always had a very strong fashion sense, and I wanted to focus, not have eyes on me and unwanted opinions. When I was asked where my mother was (I was 27), I simply said she was dead. When I told my mother, she cracked up, loved it. She was resurrected for future trips.", "I agree with this. I know that's a special moment, finding THE dress, but there will be plenty other things to figure out for the wedding they can be involved in - the venue, the decor, the invitations, the bridemaids dresses....", "This. It sets the tone for future expectations that they get input on what home you buy, child raising issues etc."]}