{"id": 30328, "submission_id": "17npmpn", "title": "AITA for not including my parents in my wife's job search?", "selftext": "This summer my wife (let's say Jane) applied to her 1st job as a physician. We applied to Colorado (CO), Idaho (Jane's home), and Los Angeles (my hometown, Jane and I loathe it). Not landing in LA would move me away from the family business (FB) my dad started, runs, and I’m the heir (50 folks, blue collar). He sleeps 4 hours nightly and me taking on FB would get him to retirement.\r  \nWhen we applied, Jane told me to keep the details to only ourselves based on her mentors’ advice: \"Make the decision for yourselves. Sign the paperwork, reveal it after.\" I did not agree with this because of how much my family planned their future around me, but chose to trust Jane. Here's how it went:\r\n\n* My family was thrilled we looked at LA despite our known loathing of it.\r My Mom reached out to her network to help. \n* However, when those interviews started, Jane's grandpa died suddenly, shaking her up (which I understand). Unfortunately, when Mom regularly checked in on interviews, thank yous (TYs), I told her multiple times that Jane was doing well in them and was working to send TYs. Later, I asked Jane about them, and she confessed she hadn't done TYs for those opportunities or anywhere else. It was a hard time for her. Not doing those wound up damaging Mom's network.\r\n* Throughout the process we gave vague answers on all places to follow Jane's plan. At the end, we inked a deal in CO without any other offers; it was perfect for us and starts in 8 months. We stopped 5 pending offers so those places could consider other applicants, including 2 in LA that Mom set up. Though we didn't tell her that until after the ink was dry.\r\n* My family didn't find out about the deal day-of; I withheld it for a week until after my siblings finished a sports tournament; I didn't want to distract them. They won it but were upset I chose to not tell them right away, saying it was disrespectful thinking they couldn't handle the news. \r\n\nLastly, when I told my family, they didn’t take the news well, accusing us of lies and deception. Lots of name calling at Jane for taking me away from the family and FB, anger about the deceitful plan Jane asked me to follow, that my dad would work more years (although IWFH), that I am a disappointment to the family, etc. I know these are awful things to say, but I understand. They feel we lied to them, and we deceived them by the textbook definition. We presented something as it wasn't, regardless of context.  \n\r  \nOn the other hand, Jane's family agreed with her plan when we told them after the ink dried. They believe we need to look out for ourselves first and that boundaries should have been set up with my family long ago. They think my family was unfair in thinking that CO is a misstep for us and feel they are unjust.  \n\r  \nTherefore, AITA? Jane and I love our families but the reaction from one side is the opposite of the other. We’re lost on how to feel. I am grateful to have this opportunity to ask you all. Thank you from the bottom of my heart.", "created_utc": 1699116139, "permalink": "/r/AmItheAsshole/comments/17npmpn/aita_for_not_including_my_parents_in_my_wifes_job/", "score": 56, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) My wife (Jane) and I decided to not keep my family informed on her job search that wound up removing me from where they live and work. This disrupted my parents' plans for the future, such as my dad's retirement, and they believe they were lied to.\n2) How we did it makes me TA. I should have at least told my family that we were not going to consider LA, which would have saved the trouble of damaging my mom's network that she volunteered without us asking and also messing up their future plans.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\n&#x200B;\n\nIts normal for people to release important news at a time that is proper for themselves. You wouldnt leave your wife holding a pregnancy test to call your parents. Most people can go a few days without hearing what's going on. Also, it seems that you judged your families reactions well considering that they really didn't take it well and may have affected that tournament you mentioned.\n\n&#x200B;\n\nName-calling is never justified and \"lies and deception\" is an exaggeration. You said they knew you were not fond of the area so I think they are just taking the news really badly. (Y T A a little for blaming Jane all over the post)", "NTA. But I have a question... have you always intended on taking over the FB or is it something Dad wants but you've never planned on doing?   And if it's the latter, how transparent have you been with your parents about this?", "NTA, this is your lives not your family's lives. Their reaction should only prove to you exactly why you waited to tell them .", "NTA. \n\nWhy would your parents even be included in the first place? I wouldn’t even include my own parents in a job search. \n\nYou and your wife are adults who can make their own decisions and find your own employment, nobody’s parents need to intervene and it’s none of their business.", "INFO: is there one of the siblings you mentioned that can take over the FB?\nIs Jane open to returning to LA for you to take over the FB when it's time?\nDo you even want to take over the FB? If no, do your parents know this?  This is a most important point if your family is planning their life around you taking over the FB.", "NTA. Live your lives how you want. Unless they are the one's paying your bills, then why do they get a say in anything. All that matters is that you are happy with the decision you made together and where you two are going in life. All the negative feedback you are getting is honestly disgusting and should make you reflect on how you see them going forward. If they can't respect you or your wife, then maybe they don't deserve your respect either.", "NTA why would you need to keep them informed of her job search?  She’s a grown woman", "NTA and I agree with the others who say your family sounds overbearing (and a little selfish). But what I'm surprised by is the expectation to send thank you notes after an interview. Is that really still a thing?", "NTA. All the family drama aside - I agree with the earlier comments. Personally I ended up living in NE for 20 years (due to work) and now 5 in Florida, US (family obligations). I have been deeply unhappy for 30+ years just regionally. DON'T DO THIS.\n\nEnjoy your lives in CO. Go LC or NC for a while until things calm down.", "NTA - when you get married, you put your spouse's needs before your family.   It sounds like from what you've written is a somewhat atmosphere of control that your family wanted to exert over your job choices and you.   Make sure in any move both parties to the marriage are considered first and foremost and I'm guessing your family would have name-called for anything less than LA.   Tell them you love them and follow your own dreams and put each other first and you'll do just fine.", "NTA. I am sorry to say, but I think your parents are delusional and live in lala land. You are not their property and have the right to share or not your private life and make your own decisions. This is NOT about the family business, this is about control.", "NTA sometimes in life we need to think about our wants and needs. It’s very ok! Congrats on the move!", "NTA\n\nIt's super weird for parents to be overly invested inn where their children take their first jobs. Super. Weird. Overly enmeshed and bordering on co-dependency. \n\nAs a parent of adults, I LOVE watching my kids make decisions about their lives and how they come to those decisions. I would never limit their opportunities because I selfishly wanted them close to me- I  do- or whatever. At the end of the day, even though I would LOVE to have them close, I want what's best for them. For their future. For their lives and how they envisioned living it. \n\nGo LC or NC with the pressuring parents and give them a chance to cool off and for you  to establish a beautiful life in Colorado. \n\nAlso- also, it's never too late  to send a thank you. Especially  if  there  was a reason for the delay, like a death in the family. Just  a short note: \"I am so sorry I didn't reach  out to thank you earlier. During the time I had intended to do so, I had a death in the  family. \\[or family emergency or whatever  here\\] I know  there is no excuse for tardiness, however, I did want to explain that I hadn't forgotten. Life got in the way. Please accept my belated heartfelt thanks for your wonderful assistance. I truly did appreciate it. And  I wanted to be sure that you  knew  that. Sincerely, X.\"", "NTA , but you had a role is setting up your family’s expectation about you would take over the FB. Having your wife accept the CO job, helped your true intent, but she is getting involved in the drama. Unfairly imo. You need to indicate you will never take over the FB. They need to make plans now on what will happen with the business. That is what is driving all of this.", "NTA, but you handled this all wrong.\n\nFirstly, you should be up front with your parents that you do not want to take over the family business, that you hate living in Los Angeles, and you're not going to do either one of those things. Don't let them spend years counting on that happening, when it's not going to happen. It's unfair of them to have this expectation of you, but it's also unfair of you to lead them on.\n\nSecondly, you should not cave and take over the family business nor live in Los Angeles because that will ruin the rest of your life.\n\nThirdly, you don't have to give such explicit details of the minutia of how this is happening. There's no point in telling your parents \"We took a job in Colorado, and we've known for a week but chose not to tell you until now.\" Telling them \"We took a job in Colorado\" is more than sufficient. There's no point in telling them details that will only be hurtful that they don't even need to know. Why do that?", "NTA for choosing to move but YTA for how you handled the information with your family and they are justified in being upset for multiple reasons. Your mom stuck her neck out for your wife for basically no reason and then got burned by her, then you burned your dad with regards to the family business. I think you knew how badly it would go with your parents and put off telling them using the mentor’s advice as an excuse. It sounds like CO is a much better choice for you both, but I think you owe your family some major amends.", "Clearly Jane's mentor was right about not telling anyone. Look how your parents acted - shameful. \n\nJame is your immediate family. Your spouse is closer than your parents. The two of you need to do what is best for YOU   TWO. \n\nIt is not your responsibility to make sure your father retires. It is his responsibility. Your responsibility is seeing to your own family, which is Jane and any kids you end up having together. \n\nNTA for not including your parents because it's not their business.", "NTA. Your mom proved why you need to move away. She centered herself in your wife's job search and then was angry when your wife couldn't keep up with the niceties required. Instead if explaining to her contacts there had been a death in the family, your mom held it against your wife. You also could have sent those emails, but you didn't want to stay there, so it's fine. \n\nYour parents don't listen to you and to them, you'll always be a kid. They may need to do some scrambling, but it is good you're moving on. And if they deal with you well, there is no reason you can't run an online business remotely.", "Give your parents some time. Unless you were very clear about not wanting to take over the business at all, they just  had their expectations of the future shattered, so are hurt. It would feel like a betrayal to them because they were actively working to help you with the goals they thought you both wanted.\n\nThat said, you have the right to determine where you want to live and what you want to do in life. Just consider, that they were trying to help you from their perspective and their intentions were to help set you up for the future.  Communication is very important.  You didn’t have to tell them about each interview, but should have let them know that you were applying in other places ,as well as LA, so they wouldn’t be blindsided. You should apologize for your part in miscommunication and offer to help set up succession plan for business so Dad can still retire if you resign.", "ESH\n\nI totally get why you did it. Your familys expectations were too big maybe. \n\nHowever, you damaged your mom's professional network and deceived your father. Thats not on the same page as not telling them for one week, you even actively lied to them. 'yeah she's working on the TY's' and then oops she didnt. You suck for that and idk if I would forgive you tbh.\n\nYour title is misleading, you DID include them. Only to fuck them over tho.", "ESH (except for Jane's Family) . Jane's Family pretty much seem to have summed it up when they said that you needed to set boundaries with your Family from the outset.\n\nBy going along with Jane's plan and agreeing to it, rather than dealing with things head on, you set the situation in motion as you must have known how your Family would react when they found out.\n\nYour family's response obviously is out of line and they sound quite overbearing if they expected you to plan your lives around them.", "NTA, but you shouldn't have allowed your mother to network for Jane.  That was very disingenuous.  Also, it takes all of 5 minutes to write a thank you, that was disingenuous  and unprofessional.", "NTA. Both of my children are going out of state for college because that is where the best opportunities for them are. One of them already has a job offer in their field after graduation that unless something life changing happens, she will accept. Will I be sad that she is far away? Of course. But I also want what is best for her above my feelings so I want that for her too. There are planes, trains and automobiles for crying out loud. Plus with today's technology you can be as much involved as you want to be in each other's lives. I think your family has unrealistic expectations and are letting their hurt feelings take over. Give them time and space to calm down, but hold the line. You and Jane are a family. Your commitment to her and your family comes above your mother and father's wants and wishes.", "NTA for everything except Jane not being careful with your mom’s network relationships. Although I think it’s possible that your mom may have oversold the likelihood of you guys ending up in LA since it sounds like they were still really hoping you would end up there.  Thank you notes are a nice touch but active engagement in job negotiations also shows ongoing interest.\n\nKeeping a final job offer quiet for one week is NBD. It sounds like you did the right thing in delaying since there was so much blowback. A week doesn’t make any material difference. \n\nIt’s understandable that Jane’s family think you’ve made the right decision (since you’ll be near them) and yours doesn’t (since you won’t).", "NTA - But you should always send thank you's. I understand Jane was distraught (sorry for her loss), but it is something that only takes a few minutes, and by not doing so, damaged your mother's network (and also Jane's). People remember these things.", "Haven't read everything, are we talking about Los Angeles or Louisiana?", "YTA\n\nIf the plan has always been for you to take on the family business you should have told them as soon as the plan was starting to change. You should have flagged to them it might go differently. And you should have been more forceful that you hate LA and it was unlikely to be an option.\n\nYou and Jane looking after yourselves first prevented your parents from looking after themselves. \n\nAlso I get Jane didn't have the emotional bandwidth for thank yous etc when are was dealing with grief (though did she send them in other places?  If it was only LA that's telling). But lying to your mum about it prevented your mother from getting ahead of it and managing the situation by saying mentioning Jane had a loss but so was happy to meet them etc. You didn't just fuck her over after she did you a favour, you stopped her making it better.\n\nReddit is always you don't owe anyone anything, but these are your family, you do owe them a certain level of decency and transparency especially when it is things that effect them.", "YTA. You both let your mom call in favors you didn’t want and it was handled so poorly by you and Jane. A bit shady. \nYou’re entitled to do whatever you want but lying makes the whole thing icky.", "EDIT: NTA after OP provided info about exactly what they said to family.\n\n>even told my family it was a 5% chance it would happen. If anything, they knew we were heading out within a few years because we don't want to raise kids in LA.\n\nYTA. I am suprised by all the NTAs in this thread when it seem like you basically just deceived your parents and called in favors with them to use as a backup plan?\n\nI don't blame Jane for not sending out the TYs, or you guys for choosing CO, but it seemes like there was a fairly big miscommunication with the expectations. I feel like this all would have been avoided if you just told your parents that LA is not an optimal spot for you and for them to not be too invested in the idea? \n\nEspecially with the FB thing, is there an expectation that you will eventually take over? If that is the case, why would you not tell your parents that staying was not something you wanted to do? \n\nI get Jane's plan and her methors, in that you should choose for yourself first and not build your life around others. Given that however, you should not have used your parents like that and just told them that you are not prioritizing staying in LA so they wouldn't have made plans with the expectation that you are.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis summer my wife (let's say Jane) applied to her 1st job as a physician. We applied to Colorado (CO), Idaho (Jane's home), and Los Angeles (my hometown, Jane and I loathe it). Not landing in LA would move me away from the family business (FB) my dad started, runs, and I’m the heir (50 folks, blue collar). He sleeps 4 hours nightly and me taking on FB would get him to retirement.\r  \nWhen we applied, Jane told me to keep the details to only ourselves based on her mentors’ advice: \"Make the decision for yourselves. Sign the paperwork, reveal it after.\" I did not agree with this because of how much my family planned their future around me, but chose to trust Jane. Here's how it went:\r\n\n* My family was thrilled we looked at LA despite our known loathing of it.\r My Mom reached out to her network to help. \n* However, when those interviews started, Jane's grandpa died suddenly, shaking her up (which I understand). Unfortunately, when Mom regularly checked in on interviews, thank yous (TYs), I told her multiple times that Jane was doing well in them and was working to send TYs. Later, I asked Jane about them, and she confessed she hadn't done TYs for those opportunities or anywhere else. It was a hard time for her. Not doing those wound up damaging Mom's network.\r\n* Throughout the process we gave vague answers on all places to follow Jane's plan. At the end, we inked a deal in CO without any other offers; it was perfect for us and starts in 8 months. We stopped 5 pending offers so those places could consider other applicants, including 2 in LA that Mom set up. Though we didn't tell her that until after the ink was dry.\r\n* My family didn't find out about the deal day-of; I withheld it for a week until after my siblings finished a sports tournament; I didn't want to distract them. They won it but were upset I chose to not tell them right away, saying it was disrespectful thinking they couldn't handle the news. \r\n\nLastly, when I told my family, they didn’t take the news well, accusing us of lies and deception. Lots of name calling at Jane for taking me away from the family and FB, anger about the deceitful plan Jane asked me to follow, that my dad would work more years (although IWFH), that I am a disappointment to the family, etc. I know these are awful things to say, but I understand. They feel we lied to them, and we deceived them by the textbook definition. We presented something as it wasn't, regardless of context.  \n\r  \nOn the other hand, Jane's family agreed with her plan when we told them after the ink dried. They believe we need to look out for ourselves first and that boundaries should have been set up with my family long ago. They think my family was unfair in thinking that CO is a misstep for us and feel they are unjust.  \n\r  \nTherefore, AITA? Jane and I love our families but the reaction from one side is the opposite of the other. We’re lost on how to feel. I am grateful to have this opportunity to ask you all. Thank you from the bottom of my heart.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "The fact that you two need to be told how to feel is frightening.", "Thank you! Jane & I are reading, and we appreciate your comment. (Jane typing: This has been a really tough fallout for us and it's nice to get outside opinions on the matter). OP:  You're right, I think I put too much emphasis on Jane. I agreed with the plan and I am responsible for how this turned out.", "Write it was Y T A (with spaces) or else the bots will count it towards the final vote.", "Thank you and great question. FB is something my dad and mom wanted, not me. What makes it weird is that I have worked at company for 12 years despite my known dislike of it. Worst kept secret in the company. I've stayed because of loyalty and I actually bought in to support another new partner (who is not blood related), though I can exit at any time.\n\nI like to think I've told my parents how I loathe LA and can't wait to leave (along with Jane), but they've told me it wasn't that clear.  Funny enough, after reminding them how much we love CO they started sending me texts about winter car crashes (you'll expose your kids to this?!). \n\nJane: \"We are attempting for a family right now, it's not them pulling it out of their ass\".\n\nThanks again!", "Thank you! Jane & I are reading and it's great to hear from you.", "Thank you! Parents were included because of the family business issue. If I'm local to LA then it's easier to run the business, takes weight off my dad.", "1) No, siblings have little to no interest and are actually thinking of leaving LA as well. Also too young for leadership and no experience in FB.\n\n2) Jane replying: \"It would have to be an extreme circumstance. I can find work there but it'd have to be one of those things where it's a last ditch situation. If important to OP, I could make it work.\" \n\n3) OP: Not really, no. I would take it over so Dad could retire, but there is another partner involved who is not blood-related and I love the guy. I would be glad to see him run it completely.\n\n4) Yes, they are aware and were hoping I could stay in LA for just 3 years to sort out the matter. This is a major source of their frustration and I understand.\n\nThank you for your comment!", "Thank you for your comment! For INFO, we are paying our own bills.", "Thank you for your comment! It's a fair question as we're both grown adults (late 20's).\n\nThe main thing that we're taking from the Y T A  comments is that when peoples' lives are truly impacted by a decision one makes, it behooves that person to be upfront and frank with them (even if it starts another argument). It simply helps and is even courteous to speak frankly with them about those plans.\n\nUs moving away does impact my family negatively. It's great having the heir to the FB present plus, honestly, they'll miss us.", "Thank you for your comment! And thank you's are definitely still in fashion here in the USA. Like other folks have said here, we should have gotten them done, it just helps.", "Thank you for you candor, we'll take that to heart.", "Thank you for your comment, we'll work to rebuild our relationship with them.", "Thank you for your comment, we'll start building a new foundation for our relationship.", "Thank you! CO is going to be awesome.", "Jane: \"Thank you so much for replying, it's tough to tell people's age on the internet but it's great to get a parent's perspective on this! Especially since my parents and OP's parents had extremely different reactions. Thank you for weighing in.\"\n\nOP: Thank you for your thoughtful reply!", "Thank you for your comment! I concur that I should have been more blunt/upfront with my family. If we simply said LA wasn't happening (instead of just saying 5% chance) that would have helped. It's the hope that kills you.", "Thank you for your comment! A few bits of info:\n\n1) While I had told them I hated LA and didn't want to take over the FB long-term multiple times over the years, it appears that it didn't sink in. Lesson learned, need to be more frank.\n\n2) I concur.\n\n3) After we told family that Jane was not going to sign in LA, they asked when we signed. That's when I told them a week ago. Brief Q on that - do you think I should've waited to tell them? \n\nThanks again.", "Thank you for your comment! \n\n1) To reiterate something Jane said to another commenter: \"Yeah, that was a huge fuck up on my end.\" We bungled the thank-you's.\n\n2)  As for the FB, while I had made it clear for years that running FB wasn't the long-term plan and that moving away was a matter of when not if, you're right in that I could've done more to get in front of this.\n\nCO is a much better choice, and we're working to rebuild our relationship with my parents. Thanks again!", "Thank you for your comment! \n\nJane: \"As a couple, we're confident in the decision, though it would have been nice had the backlash not happened.\"", "Thanks for your comment! We're working to rebuild our relationship with them.", "Thank you for your comment! A couple notes:\n\n1) I concur, they are hurt and they do need time to heal. While I was clear LA was not likely to happen and named the other places, it would have been better to simply say \"No\". It's the hope that kills ya.\n\n2) A succession plan is underway and there is another partner in the business that both dad and I have nodded as the next head. I do plan on staying involved (IWFH), but not as actively as I would be if I were in LA. I absolutely want Dad to retire!\n\nThanks again.", "Thank you for your candor. And you're right, we absolutely should have gotten the thank you's done, we did suck on that.\n\nGoing forward, something we're learning from the E S H  &  Y T A posters is when there's a person impacted by a decision, be upfront with the way things can go and are going. While I thought I did that, what I did do was not good.\n\nThank you!", "Thank you for your reply.\n\nWhile I did tell my family LA had a 5% chance of happening and that we didn't want to raise kids there, I should have done more to get in front of the outcome.", "Thank you for your comment. Re-iterating Jane's comment from earlier \"Yeah, that was a huge fuck up.\" OP here: I could've also done more to ask my Mom to not do that.", "Jane: \"Thank you so much! I really appreciate getting to hear your perspective as a parent. It's nice to hear what you think about this.\"\n\nOP here: Thank you for your comment! We're working to rebuild our relationship with them. Direct plane flights are helpful!", "Thank you for your comment!\n\nTo reiterate something Jane said to another commenter: \"Yeah, that was a huge fuck up on my end.\" We bungled the thank-you's.\n\nAnd thanks for commenting on how the job decision was revealed.", "Jane: \"Yeah, that was a huge fuck up on my part.\" \n\nThank you for your comment!", "Los Angeles. Thanks for checking in!", "Thank you for your reply! A few notes:\n\n1) It's one of the worst kept secrets at the FB that I don't like it and was planning on leaving at some point soon. I have not wanted to take on the FB, but did buy-in out of loyalty (worked there for 12 years) and to support another partner who bought in (who would run the FB excellently). I can also exit at any time.\n\n2) \"You and Jane looking after yourselves first prevented your parents from looking after themselves.\" \"You didn't just fuck her over after she did you a favour, you stopped her making it better.\" These are great points, thank you for them. We're taking these lessons to heart.\n\n3) Right before her grandpa's passing, Jane sent 2 thank you notes, 1 actually went to the place she wound up signing. (I also just learned this from Jane while writing this). After his passing, not one was sent.\n\n4) I concur that going forward Jane & I will be much more mindful of including people who are impacted by our decision in what we do.", "Thank you for your insight. You're the first \"YTA\" and we're thankful. We agree we messed this situation up badly and wish we stopped my mom, our fault.", "Thank you for your thoughtful comment. Here's a few bits of information, please let me know what you think:  \n1) LA was never a back-up plan, even told my family it was a 5% chance it would happen.  If anything, they knew we were heading out within a few years because we don't want to raise kids in LA. That being said though, it would have saved a lot of trouble to just say \"not happening\", you're right on that.\n\n2) Yes, mom and dad expected that and I did buy into the FB, however it is the worst kept secret in the company that I don't like it. Been there for 12 years out of loyalty and there's another partner (not blood-related) whom I think would be a great leader for the FB long term.\n\n3) Simply put, LA was known to them as a short-term option IF we landed there, 3 years tops. I also could have been more blunt in saying \"Not at all\".\n\nThanks again.", "In the words of Marshawn Lynch: \"You know why I'm here.\"\n\nWe thought it would be best to get arbitration on the situation and see if this is an opportunity to become better people. And, from all the comments we're thankful to have, there is room for growth regardless of N T A and Y T A and E S H comments.\n\nJane: \"Sometimes you need an outside perspective to know what's going on.\"", "I guess I don’t even see where you lied? She did apply in LA, that’s just not what she decided to do. Waiting a few days to share is not lying.", "Helpful, thanks!", "Thanks I forgot!", "You still didn't answer the other commenters question. Did you commit to taking over the business? Did you tell your parents you didn't plan on taking it over?\n\nIt's fully your right to change your mind or make new plans as long as you were honest with your parents about it so that they weren't still counting on you and could make other plans. On the other hand, it's really shitty behavior if you just strung your parents along and said you'd take over the business without ever planning to actually do so. I'm not saying that's what you did, but if you did then you're kind of an asshole and definitely fucked over your parents.", "Your parents are insanely manipulative! I hope you and Jane get away and plan your new life in CO", "Hello, firefighter/paramedic here. Fun fact for you two if you want to tamp down the “winter car crash” fear-mongering from the folks. Per a 2021 study, Colorado has the lowest fatality rate involving winter-related vehicle collisions in the entire country. This is actually pretty indicative of areas that have harsh winters because people who live there buy appropriate vehicles and gain experience safely driving in inclement weather conditions. I grew up in the mountains, but now I live in the South. The first winter we got snow after I moved here looked like the zombie apocalypse- just masses of cars littering both sides of the highway for miles. It was literally just a light dusting of snow. \n\nAlso, I feel like I don’t have to tell you guys that the entire southern half of California is at risk of completely burning down to the ground every other minute… so…", "Snow is safer than LA homelessness, drugs, gangs, traffic, pollution…NTA.", "NTA - really in the end, you have to do what is right for your own little family, which is right now you and Jane.  I think the fact that your dad has a partner who can run the place or maybe even buy him out should put any guilty feelings you may have to rest.  Enjoy CO - it's gorgeous!", "If nobody is interested in carrying on the business, could they sell it and use the money for retirement? Or would the partner buy them out? That seems like the way to go.", "1. Yes, you should have left ZERO gray area about the situation. \"I'm not going to work here. I'm not going to live here. Period.\" I suspect you've just been dancing around this for years without actually laying it on the line in a believable way, and they've been counting on you to either not have been serious about it, or change your mind. It's obvious they have been hanging their hats on this for years without knowing that you ACTUALLY had no intentions of doing that. The fact that you've worked 12 years at a job you hate and lived in a city you loathe has given them plenty of reason to believe you're going to keep on keeping on, and no reason to believe that your protestations about the job/city were going to lead to anything. But... what's done is done.\n\n2. Good.\n\n3. It's white lie time. \"We just signed!\" Or... \"The ink is barely dry!\"\n\nI hope you enjoy Colorado. Personally, I love LA (me and Randy Newman, I guess)... but it's not for everyone.", "Yeah, I'm sympathetic to that part alone - but honestly, the fact not sending a thank you *could* harm your mother's network is part of why I wouldn't be keen on those jobs, personally! Too much entanglement with family. \n\nAlso, not helpful, but thank you notes are very American (/maybe Canada too?), and I'm so glad we don't have that layer of expectation here. It sounds like a bizarre amount of performative back and forth to me. (I'm in Aotearoa/NZ.)\n\nCongratulations on the job and move!", "You’re human and their were some actual mitigating circumstances. \nPrepare a well thought out apology and admit that together you handled it really badly.", "Ok, with this information I am going to revisit my answer. I was under the impression it was more one sided than it was. \n\nI think your parents might have unrealstic expectations from what you said here, and while you probably could have turned down the favor I think the following makes you the NTA:\n\n>even told my family it was a 5% chance it would happen. If anything, they knew we were heading out within a few years because we don't want to raise kids in LA.\n\nI will edit my answer to reflect this.", "Their perspective is if you're going to apply somewhere, you do it 100% right and to completion. The fact that thank-you's were not sent and the fact that we knowingly stopped pending offers in LA because the awesome offer came in is where they perceived deception took place. A \"disingenuous\" process, so to speak.\n\nNot saying I agree or disagree with the above (because am OP and am asking for judgment), but that is objectively what they have told me.", "No, I did not commit and I told them I will move away at some point, the question was when. I’ve told my parents for years that running to the FB was not what I wanted and I only committed to running it remotely, as I told them LA was not likely to happen (5% chance). LA was never the forever home and won’t be, and neither was the FB. I work to support the FB and the people we employ, but never saw it as what I would do long term, communicated same to my parents.", "Totally concur on the winter travel. In LA, people freak out when water comes from the sky. Accidents will happen however the water looks. Thanks for your comment!\n\nJane: \"Thanks first responder pal! We owe a lot to you guys. I'm in agreement though, I'm used to it in Idaho. Frankly, earthquakes freak me out a lot more!\"", "Thank you! CO is gorgeous.", "Good points! Selling to a 3rd party is out of the question, as new partner wants to run it for 20+ years. Dad and I are working out how to support that and get him to retirement.", "Thanks for the guidance! I think that's what happened in their hearts too. Some years ago my dad actually told me he knows what to say to change my mind. While that might have been there, the onus is on me to clearly say  \"I'm not going to work here. I'm not going to live here. Period.\" \n\nThanks again.", "Thanks for the congrats! We're stoked for CO.\n\nAlso, thank you's are definitely still in fashion here in the USA. Like other folks have said here, we should have gotten them done, it just helps.", "That's something we started, but my family made it clear they don't want it. What I decided to do with the fam is to focus on rebuilding the relationship over years. Jane and I are going to focus on earning their trust back. Thanks SocialGrenades!", "Jane: \"Thank you for revisiting! We've been really impressed with how thoughtful your responses have been.\"", "You did absolutely nothing wrong then. I think your parents either didn't really listen to you or were convinced that they could guilt you into changing your mind. \n\nGood luck on your new life in CO. It's beautiful and definitely the best choice out of the three you were considering. It's getting more and more crowded in the Front Range area, but still nothing compared to LA.", "Apparently hydration helps with the altitude change.", "I concur with CO over LA, thank you for replying!", "That it does! Hopefully I won't dry out."]}