{"id": 30393, "submission_id": "17oms79", "title": "AITA for not wanting to spend every holiday with my in-laws?", "selftext": "Quick back story for context: \n\nI have been non-contact with both of my parents for close to 9 years. They are both still alive, and both have their issues that I will not get into here. Their actions have lead me to the difficult decision go non-contact with them. My wife agrees with and supports this decision. \n\nMy wife and her family are the opposite of mine. Her mom and dad have been married for several decades. She has two sisters, and they are all very very close. I appreciate her family and they are all generally good people. \n\nMy wife and I have been married for over 10 years and we do have two young children. \n\nThe issue at hand: \n\nEver since I made the decision to go non-contact with my parents, my wife has taken it upon herself to plan every holiday, and even several of our summertime family vacations with her family. She makes these plans with her parents and sisters for all holidays like Christmas and Thanksgiving and I am very rarely included in the planning process. \n\nAbout a year ago I spoke with my wife about this. I told her I do not appreciate her planning holidays without giving me the opportunity to be a part of the planning. I also told her I do not want to spend every holiday with her parents and sisters. It is not that they are bad people, or that I do not like them, I just do not think it is fair that she believes that since I do not have a relationship with my parents, that by default I have to spend every holiday with my in-laws.\n\nI told my wife I would like to go back to how things were before we were non-contact with my parents, and we could share half of the holidays with her family, and I would like to spend the other half of the holidays doing something with just my wife and our kids. Since I do not have a relationship with my parents or any extended family, my wife and kids are really all I have. \n\nMy wife does not agree with this.She believes that since I don't have a relationship with my parents, that by default we should spend every holiday with my in-laws.\n\nThis leads me to ask, AITA for not wanting to spend every holiday with my in-laws?", "created_utc": 1699221204, "permalink": "/r/AmItheAsshole/comments/17oms79/aita_for_not_wanting_to_spend_every_holiday_with/", "score": 224, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I do not want to spend every holiday with my in-laws. \n\n2. My wife believes since I don't have a relationship with my parents or extended family, her family comes first by default.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, OP, you need to have an equal say in how family holidays will be spent. Seeing family is fine, but that can also inhibit the development of your own family holiday traditions.\n\n In my family of origin it was expected that Thanksgiving & Christmas belonged to my parents. The result of a lifetime of this routine,\"family holiday traditions\" skipped a generation; my nuclear family never really established any of our own traditions. When my kids had their own families, they established their own holiday traditions in their own homes. Itinerant guesting is not a great holiday tradition, in my opinion. \n\nI hope you can sit down with your wife and discuss your desire to build holidays with your family, to share holiday meals and activities to look forward to with each other and create some happiness around your own hearth.", "NTA and she's forgetting that this is a marriage of two people. She acts like you are just supposed to tag along with whatever she decides. That's not a partnership. \n\nMaybe sit out of a few of the planned holidays. \n\nShe plans to summer with the family? Then you book a vacation solo without her while she goes.", "NTA. It's a very reasonable request. She is ignoring/disregarding your feelings.", "NTA.  I can understand your wife wanting to spend Thanksgiving and Christmas with her family, especially if her sisters and their families are there as well. Having said that, I wouldn't be willing to spend summer holidays with them too-that's a bridge too far and you're entitled to spend time with your family and only your family.\n\nSit down with your wife and talk it through. Plan a summer holiday together. If you're not happy doing both Thanksgiving AND Christmas with her family, explain that and come to an agreement, whether that's the same one every year, or alternate one year Thanksgiving, the other Christmas. Communication and compromise, from both of you,  is key here.", "NTA. She is being overbearing and selfish to expect to get her way all the time. You matter too and she should not need to be convinced of that.", "NTA There is nothing better and more relaxing than a low key holiday with your family at home.", "NTA\n\nI don't quite understand how your wife \"does not agree\".  How does one agree or disagree with a fact, such as the fact that you do not want to spend all your holidays and vacations with her family.  \n\nTell her that if she keeps pushing, you'll make separate arrangements for you and the kids for a year that have nothing to do with her family just to balance out the extreme family time she has forced on you.  Then do it.\n\nI'd also point out that from now on, and following her lead, you can say \"I don't agree\" and do whatever you want every time she wants something.  I imagine if that happened, she'd remember that marriage doesn't work like that.", "NTA.\n\nYou should get equal input into planning holidays and vacations, regardless of your relationship with your parents. In my mind, a good starting point would be 1/3 her parents, 1/3 your parents, and 1/3 just you and your kids.  With your parents out of the picture, she could argue her parents get 2/3 but you still need time with just your family.\n\n\"Spending time with\" her or your extended family can mean a lot of different things.  If you all live close, there's no reason you can't spend a few hours with each family.  For Christmas in particular, you should be spending Christmas morning in your pajamas with your kids opening presents at their own house.  Likewise Thanksgiving is just the Thursday--no reason to spend 4 days with her family.\n\nHopefully you aren't spending the kids' entire break at the in-law's house, and you guys occasionally vacation alone, right?", "NTA.  What you are asking is quite reasonable.  It is quite reasonable when 2 people create their own family unit that they also create their own traditions around the hoildays.  What you offered was a great compromise.  You, your wife and kids are a family and should be the priority for the holidays - not any extended family.", "~~INFO:~~ Are you \"local\" to her family? If so then are you actually objecting to just going over for the day to eat, open presents, etc.?\n\nNTA.", "NTA, I don't get how your wife doesn't see what she's doing is just downright annoying? Imagine the tables were turned and you made every holiday plan with your family, I'm sure she'd be real sick of it too. I'd just stay back by yourself if she doesn't play nice. Shame on her.", "NTA\n\nI think this is more about wanting to spend more time with just the nucular family, your wife and kids, on special occassions than with the extended family; Grands, cousins, aunts and uncles. \n\nMy dad's side of the family lived a bit far from us growing up. We would see them maybe twice a year. Where as my mom's side lived just across the street so we did spend more time around them in general. We went to church with them, they would watch us after school, we went on vacations together. Etc. Etc. But we also would do things just us, siblings and parents. We would also visit my dad's family it just wasn't usually on the date of the holliday. \n\nAs I got older I wanted to spend less time with the whole extended family at once. Big family gatherings can be exhausting. So as we got older we wouldn't spend all day at my grandmas house we would just spend a couple hours then go home. \n\nIdk how far you live from your inlaws but there is nothing wrong with wanting to spend vacations and holidays with just the nucular family.", "NTA. If she won't compromise then put your foot down and insist on planning the summer holiday, then do what you for you and your family.", "NTA.\n\nMarriage is a team sport.", "NTA; she’s ignoring your needs and is being unfair here.", "If your wife was going to bend, you would have been included in the planning this year. NTA", "NTA- do Thanksgiving with her family and Christmases on your own. That eliminates the extravagant gift situation and allows you to develop traditions that are just your nuclear family. If she has to do Christmas, embrace the British tradition of Boxing Say where  you visit for a few hours the day after Christmas.", "10 years and kids means you totally get to celebrate Christmas and vacations without inlaws.\n\nIt's a massive overstep for your wife to make these plans and insist on your compliance. Good marriages involve communication and compromise and I am not reading about any of that in your account.\n\nNTA", "NTA,OP. I have nothing to add but my support. I'm in the same position as you, very LC with my parents, so no holidays with them for the past 10 years. It's expected by my husband that instead of doing Thanksgiving and / or Xmas just \"us\" (we are child free) or with friends, we have to spend these holidays with his family (very local to us so thankfully we don't have to spend more than a few hours at a time). He is very close to them.I do not enjoy spending time with them at all. I actually dread the holidays and hate Thanksgiving and Xmas now, I honestly miss the toxic dysfunction of my past family holidays, which says a lot. I draw a hard NO at spending NYE with them, and luckily, no forced vacations. OP, I wish you the best of luck in working out a compromise with your wife.", "I’m inclined to say N A H but it’s because I think holidays should be spent with the whole family and I would feel awkward telling my parents we are going to be spending a holiday just my husband and I.  That said NTA because your request is reasonable and completely disregarding your feelings isn’t something a loving partner does.", "NTA. She is forcing you into something you don't agree with. Resist.", "NTA\n\nI'd want the same thing as you, even if you weren't NC with your family.  Gotta have quality and separate time!", "Well now *I* feel like a complete asshole. My husband is very very very low contact with his parents and I am no contact with them so we spend zero holidays/vacations with them. I plan all the holidays and vacations with *my* family without my husband's input. He loves my family and it never occurred to me to do anything different until reading this post. I'm going to go apologize to my husband now..", "NAH . Holidays are traditionally with family, and you haven't spoken up before about it. \n\nIf she wants to be with family, let her tho and let the kids decide what they want to do as well. During covid I had smaller holidays (by myself or just my mom) and I hated it and it didn't feel like a holiday.\n\nI've also had family members sit out of holidays and didn't hold it against them, unless it was every holiday.", "Yta- I really don't think it's unreasonable to spend the holidays with extended family. If she was pushing spending time with her family to the neglect of yours then that's an issue, but since you don't have a relationship with your extended family that's not an issue at play here. Not to mention that for big holidays like Christmas it's not unusual to spend times with both sides of the family anyways so even if you were in contact with your family you'd still probably be spending some Christmas time with her family anyways.Just cause you don't talk to your family doesn't mean you get to call dibs on half the holidays.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nQuick back story for context: \n\nI have been non-contact with both of my parents for close to 9 years. They are both still alive, and both have their issues that I will not get into here. Their actions have lead me to the difficult decision go non-contact with them. My wife agrees with and supports this decision. \n\nMy wife and her family are the opposite of mine. Her mom and dad have been married for several decades. She has two sisters, and they are all very very close. I appreciate her family and they are all generally good people. \n\nMy wife and I have been married for over 10 years and we do have two young children. \n\nThe issue at hand: \n\nEver since I made the decision to go non-contact with my parents, my wife has taken it upon herself to plan every holiday, and even several of our summertime family vacations with her family. She makes these plans with her parents and sisters for all holidays like Christmas and Thanksgiving and I am very rarely included in the planning process. \n\nAbout a year ago I spoke with my wife about this. I told her I do not appreciate her planning holidays without giving me the opportunity to be a part of the planning. I also told her I do not want to spend every holiday with her parents and sisters. It is not that they are bad people, or that I do not like them, I just do not think it is fair that she believes that since I do not have a relationship with my parents, that by default I have to spend every holiday with my in-laws.\n\nI told my wife I would like to go back to how things were before we were non-contact with my parents, and we could share half of the holidays with her family, and I would like to spend the other half of the holidays doing something with just my wife and our kids. Since I do not have a relationship with my parents or any extended family, my wife and kids are really all I have. \n\nMy wife does not agree with this.She believes that since I don't have a relationship with my parents, that by default we should spend every holiday with my in-laws.\n\nThis leads me to ask, AITA for not wanting to spend every holiday with my in-laws?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, partnership is taking each opinion into consideration. Your wife is only taking her own into consideration. Which leads me to ask, does she ignore your opinions about everything else, and run rough shod over your feelings at all times?", "I would not be spending every holiday with in-laws either. Once my husband and I had kids we started having holidays for us with our children", "NTA. Yes they are family but in laws are considered secondary family. The household you live in is your primary family. It's fair to spend some holidays only with your primary family.", "NTA\n\nYou have equal say in your vacations. \n\nBut...you're leaving it up to her to plan. Step up and do the planning. See how she likes it when you present things to her fait accompli without her feedback.", "NTA.", "Nta. I don't want to spend every holiday with my family or.my husband's family.   Nice to have peace and quiet.", "NTA but book a vacation with your kids.", "My in-laws can be considered local for the sake of this post. \n\nNot necessarily, my issue is that my wife makes ALL holiday plans with her family and I have little to no input on the plans. \n\nI would like more input. I don't think it's fair for my wife to assume that all plans should be made with her family by default since I do not have a family. I would also like to spend some holidays with just my my wife and kids.", "Agree with this. I personally would find it extraordinarily depressing to have a major holiday with just my immediate family. I love them to the moon and back, but that’s not a holiday celebration.  But that’s a discussion to be had and if my spouse felt super strongly about it I guess I would have to suck it up occasionally.", "Maybe down the line. I'd say he should at least make the first trip completely solo. Let her deal with the kids on the family visit.", "NTA. She's only an asshole because she's not including you in the  the planning process. Focus on that as a non-negotiable in the issue.\n\nIf your in-laws are local-ish then I don't think it's likely your wife is going to be OK with rotating holidays between \"with them\" and \"with you and the kids.\" You might do better to shoot for limited time or a day *around* the actual holiday.", "I agree!\n\nTBH - Thanksgiving is everyone, Christmas is nuclear family - you can do XMas eve or Boxing Day (26th) with the in-laws or whatever works best.", "Can’t you compromise? My dad’s family isn’t big on holidays so we only saw my mom’s family on holidays. When I was growing up, my parents divided the day in half. The first part of the day was just our immediate family and the latter half was spent with our extended family. We still spent every holiday with my mom’s family. It just wasn’t the whole day. My sister and I will probably handle things a similar way when we start families of our own. \n\nIf you want to be included in the planning process, take the initiative and involve yourself. The holidays come at the same time every year so sometime between 10/1 and 10/20, you should start talking to your wife about what you envision for the holidays that year. You should also have suggestions in mind for what you and your family can do together. Simply saying that you don’t what to spend the holidays with her family won’t get you anywhere. You need to have actual ideas that you both can build on. I’m not criticizing the way you’ve been handling things so far. I’m just offering a suggestion for how you can get the result you’re looking for.", "Why does it feel awkward? When you get married, your spouse becomes your immediate family and you make new holiday traditions. If you have young children like OP does, maybe you want to spend time making memories with just a spouse and your children. Holidays don't have to involve every member of the extended family every year.", "NTA. She should include you in her planning and you should not have to spend every single holiday with her family. You have your own young kids and should go something with your nuclear family.", "NTA. Think about a holiday or vacation destination you want to go to, and, far enough out that her family haven't planned yet, go ahead and book it for your family, and then tell her after the fact.", "Dude…as soon as I saw every holiday with the I laws…then it’s obviously NTA…I mean I liked my in laws just fine before they passed…but the chance I would have every holiday with them is zero.", "NTA\n\nThat's fair.\n\nYou need your own family holiday traditions. Every other is fair. Either evey other Thanksging and Christmas with her family and the next just you. Or alternste the holidays.\n\nYour teenage kids will thank you.", "NTA you have a wife issue. Calmly sit down with your wife and explain you think you need to go to couples therapy as your feelings aren’t being heard. \n\nPerhaps arrange a summer holiday with your children and ask her if she wants to join you in family time or be with her parents and extended family. \n\nI know it’s not a divorce, however sharing the children custody may give her the wake up call.", "NTA in my family, we spend Christmas Day just me, my husband, and our child. I don't want to rush, or operate on others' schedule. It's nice!", "NTA. You also get a say in what you do for the holidays and it really isn't fair that your wife is asking you to spend every single holiday with her family if you don't want to. My husband nor I would ever force either  of us to spend more time with either family than we are comfortable with, a relationship should be about compromise and working together as partners. It doesn't sound like your wife is as much of a partner as she should be. \n\nI personally would rather spend every holiday and special time with just my husband and child and no one else \\[save for close friends\\] but I know that's not realistic as we have family and so we try to make some time for them too. This sounds completely one sided and it's really not fair to you, and I don't think it will be sustainable in the future if you don't want to do it. You'll probably become resentful to be honest, and I doubt that your wife wants that.", "Good grief no, YNTA. This sounds like a very reasonable way to plan the holidays. A little family privacy could be a good thing.", "NTA\n\nChristmas and Thanksgiving are going to be a harder thing to change so these might be a step at a time and it may be changing the way you do things.  It could be a Christmas breakfast with the kids while you open presents and then go to the inlaws for lunch.  Or you could actually do a special christmas eve meal just you and the kids (and your wife) and then get up at the crack of dawn for present opening.  As the kids get older and Santa doesn't have to come on Christmas eve, then you can open presents then.\n\nWhat would your wife do if you came to her saying you'd booked a family holiday with just the 4 of you to some resort somewhere for a week (or whatever)?  Because that's what she's doing to you.\n\nPerhaps it may be time for her to have her own holiday with her family while you stay home (or do something else).  She can take the kids... or not.", "NTA.\n\nYou guys need to work it out together.  Some time at the in-laws and some time together.  One way to fix this, though, is for you and your wife and kids to take a vacation at that time.\n\nThe hard part about it, though, is it could appear like the beginning of a drifting that only increases.", "NTA. \n\nYou should 100% get to have input and be part of the planning. Extremely unfair of her to assume.", "NTA and your wife is really being unfair. I think your suggestion of spending part of the time with your in-laws and the rest with just your wife and kids is very reasonable. Your wife is being selfish and obtuse.", "NTA. Both my parents and my in-laws live in the same city a couple of hours from us. We tend to have a holiday dinner at one place and the other the next day. I don't mind going there for Thanksgiving and Easter but would love to be able to spend Christmas at home developing some traditions of our own. The only time we have done this was one year when there was a horrific snow storm and all roads were closed. It was wonderful, even though we were unable to plan or shop for a special meal since we did not expect to be home. Odds and ends were pulled from the freezer. I keep telling myself that one day we will have Christmas at home every year, but that would mean that the parents were all gone. I don't want that either.\n\nYou should have a say in holiday planning. You deserve some time with only your immediate family.", "Nta why does everyone expect there adult children to spend holidays with them and not their spouses family or just their immediate house hold. I would never religiously spend ever f-ing holiday with one side of the family", "NTA. This tends to happen in a lot of relationships where the woman’s family takes precedent over the man’s, but even in this scenario you should have a say in your own family’s holiday plans.", "NTA. I think you absolutely need to be pulled into planning for vacations and holidays. I also think it might be a little much to say that you don’t see her side of the family at all for certain holidays. Maybe there’s a happy medium there of time with the nuclear family and time with her family. And def you should be able to choose to stay home sometimes!", "Marriage counseling. NTA. It really is unfair to you to exclude you, her husband, from any holiday/ vacation planning. My husband and I went no where on Christmas Day so kid could play with his toys.  You get a vote in how you spend holidays.", "NTA", "NAH... It is good to spend time with your core family. She has been caring for the mental load behind all the holidays, maybe you can suggest one that you will plan on your own. Make sure to plan the events, recreation, meals and location. This is more than just saying you don't want to do things with her folks", "NTA This sounds exhausting. There’s no reason why you can’t have the holidays with just your wife and kids.", "NTA. My ex wanted us to spend every holiday and even our free time with his family. I didn’t like it/was bored silly and started to bail out. I told him that I’d rather do things with just he and I; do at least 1 trip a year where it was just the 2 of us without his grandkids or the rest of his family. He wasn’t into it. The situation created a lot of distance between us and contributed to our breakup. \n\nI think your wife is being selfish, but couching it in “This is for your sake” language. It’s not. It’s for her sake, clearly. \n\nI don’t know what the answer is, but I think you need to consider your situation very carefully.", "Sorry if I missed it, but, how old are your kids and would they be bummed not to spend the holiday with their grand parents?", "I feel there is information missing. Some cultures are more collectivist and family-oriented so spending holidays with all of your family is really important, especially if you don't get to see each other often. So the question is why is this important to your wife? And if having traditions with your immediate family is important, why can't you have them during non-holidays?", "NTA. It’s really quite selfish of her to keep planning holidays and vacations with her family without consulting you especially since you have already told her that you don’t like that she doesn’t ask you for input. Does she do this with everything? Just does whatever she wants even if you tell her that you aren’t happy with it. You are in a partnership. You have a say in holidays and vacations just as much as she does.", "NTA. My wife's family is local, mine isn't. We naturally spend more holidays with hers. I love them all, but it's a big family and overwhelming. I would relish some holidays with just our family unit. You're communicating and asking for what you want. Keep trying to problem solve.", "NTA- wife seems controlling and manipulative.I would want to start customs with my nuclear family also - that is my spouse and children. You should be involved in the planning in any case. Strange that the in-laws don’t invite you to help plan.", "NTA. You're not one of the children, you're an equal partner in your marriage and should get equal say on holiday plans. Since you have children, isn't it time to start some holiday traditions for just your immediate family? Your wife seems to be stuck in the daughter role, at the expense of her responsibilities as a wife and mother.", "NAH. I can see your side but I see hers too. You don’t want to spend holidays w your extended family so she wants to spend them with hers. Something a large percentage of people do.", "The summer holidays really is a lot. \n\nI guess for me the big holidays it was always expected to go to the grandparents. And I loved that as a child. Eventually they were too old and the celebrations changed, but it was so much fun.", "Yeah, we do the Big 3 (Christmas, Thanksgiving, and 4th of July) with my family. My wife knows it is important to me and agrees to it but we don't really do Easter so we have always traveled with our kids for that week. It is nice to have a low key day where we don't have to deal with everyone but we agree we wouldn't want that for every holiday. That was our compromise. OP and his wife have to find what works for them.", "Now I'm curious how this talk went.", "I agree with this. I do think if it was just a Thanksgiving/Christmas it's a Y-T-A (and honestly it screams a little trauma response), especially because they are local, so it's not they are committing a long vacation to it, but the summer holidays every time and excluding him from the conversation isn't fair.", "Your argument makes no sense. He's suggesting they spend at least part of the time doing something just with their own children. I don't think it's unreasonable to not want every holiday and vacation to be spent 100% with his in-laws.", "NTA It’s pretty normal to want to create your own family traditions! Your wife is the unreasonable one. I think couples counseling might actually help", "Whelp, I said \"we need to talk about something really serious and I want you to be completely honest with me.\" I started by apologizing and asking him if he felt like he was being railroaded into my family vacations and the end result is that I'm going out of town to see my parents *the day after* Xmas without him. That way he and I will have Xmas Eve and Xmas Day alone together. I'm surprisingly ok with this. He said he wants to spend time with my family *most of the time* but he also wants time to just relax without being on everyone else's schedule (that my family inevitably changes last minute anyway.) \n\nHe already has the week after Xmas off work so he's going to take care of some projects he's been putting off and just having \"me time.\" I don't think he'll know what to do with himself honestly.\n\nI've agreed to talk to him *before* I make any big commitments in the future. I also swore that I would never again accidentally invite my entire family on our anniversary trips - in my defense, that one actually was accidental but it was only a month ago so he's still a bit salty about it..\n\nAll in all it was a productive conversation. He expects that I'll probably forget occasionally, but, instead of him just going along to get along he'll be honest if it's something he doesn't want to do.\n\nNow I just need to break the news to my mother - who loves him so much she tells everyone she's \"keeping him in the event of divorce\" and unabashedly reminds everyone that \"he's my favorite child\" at every opportunity lol", "I can get the vacation thing but just skipping spending holidays like Thanksgiving or Christmas with your extended family is crazy.  Like why would they alternate Christmases between spending time with with extended family and chilling at home. Christmas time generally involves more free time for most people. I'm sure they can still spend every Christmas with the wife's family and still have time to do immediate family Christmas stuff. Especially since most families I know manage to get Christmas time with both sides of the family each year and spend immediate family Christmas time as well. There is. Absolutely no way OP's family is spending 100% of the Christmas season at the wife's family's. And as for thanksgiving what's even the point if you don't see your extended family or friends or whatever. Having just an immediate family meal is what you do everyday.", "100%. Christmas is immediate family. I think it is crazy how families will open presents in the morning and then go to one set of grandparents for lunch then the other for dinner if they’re all local. It is insanity. Let the kids spend the day at home with their gifts. Grandparents/extended family Christmas is during the surrounding weekends or the days around Christmas like you said. Make traditions and memeories with your immediate family for Christmas.", "Sounds like you had a very productive conversation.  Good on you for taking the initiative to start a difficult conversation and being willing to compromise.", "I didn’t say it would be awkward, just not as fun.  Holidays to me are about bringing a lot of people together, seeing everyone and catching up, meeting the newest members of the family, whether they are babies or dates, and making tons of fancier than usual food. You simply don’t get that experience hanging around with one or two people.  It doesn’t mean that a different way is wrong, but I certainly would not be happy about it.", "i dunno i have very fond memories of the big Christmas dinner with my whole extended family. we always did morning family only, dinner with either close friends or extended.", "i dunno. i have very fond memories of going nowhere and playing with toys on Christmas."]}