{"id": 30417, "submission_id": "17otmtm", "title": "AITA for reminding my friend that my cat is not his cat?", "selftext": "My friend and I were driving to the mall when an asshole threw a cat out of their car window. It was a close thing but I managed to brake in time.\n\nSince my friend’s wife doesn’t like cats, he didn’t protest when I told him I want to keep the cat and only asked that I allow him to visit.\n\nHe got really upset when he found out I vaccinated her. He began by asking me why it’s necessary since I told him I’m keeping the cat indoor. I said that even though she is indoors she could still be exposed to diseases whenever I take her to the vet. He was still upset though so I told him ‘She’s my cat, not yours.’\n\nMy friend then said I didn’t have to say that, and he’s only concerned because he heard that vaccines can cause blood cots. Am I wrong for being harsh with him when he’s concerned, even though his concern is misplaced/misguided?", "created_utc": 1699241010, "permalink": "/r/AmItheAsshole/comments/17otmtm/aita_for_reminding_my_friend_that_my_cat_is_not/", "score": 24, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole since I was unnecessarily harsh with him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - his hearsay information has no impact on actual science. Or the truth that it is your cat and therefore your responsibility.", "NTA. I’m sure the medical professionals know better than your friend in the effect of vaccines 🤦‍♀️ how silly of him", "NTA. You’re being a responsible pet owner by getting your cat vaccinated. \n\nI rent an apartment and to have a pet I have to provide proof from the vet that my cat is up to date with all vaccinations.", "NTA\n\n>He got really upset when he found out I vaccinated her...and he’s only concerned because he heard that vaccines can cause blood cots.\n\nEvery medication or vaccination has side effects.🙄", "Nta. Your friend is a moron.", "Is he paying for vet care, food, routine defleaing or any other aspect of cat care? If not, he is the position of interested uncle and has no role in making decisions about your cat.", "NTA. He’s an anti vax loon or is one in thr making", "NTA\n\nYou are doing the right thing. i feel so bad for the cat. who throws a cat out of a car?", "NTA.", "Nta", "NTA \n\nTell your friend to stop basing medicle care decisions on stuff he's 'heard' and educate himself before he spreads alternative facts.", "NTA I mean, really 🤦‍♀️", "You’re doing the right thing", "NTA\n\nAlways vaccinate your pets. Thousands are vaccinated and fine. Your friend is an idiot\n\nRemind him that even a potential rabies exposure without a vaccine is a death sentence. A vet will kill your cat to test, and they cannot do it while your cat is alive. Rabies is 100% fatal in humans- no one messes with it. A positive rabies test will instantly result in the need for any humans in contact to need a rabies vaccine. A potential exposure for a cat can be as simple as being in an area with a bat", "NTA. You should always cut someone off when they start spewing antivaccine nonsense. Vaccines don't cause blood clots. Suggest he get a professional psychological reality check.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy friend and I were driving to the mall when an asshole threw a cat out of their car window. It was a close thing but I managed to brake in time.\n\nSince my friend’s wife doesn’t like cats, he didn’t protest when I told him I want to keep the cat and only asked that I allow him to visit.\n\nHe got really upset when he found out I vaccinated her. He began by asking me why it’s necessary since I told him I’m keeping the cat indoor. I said that even though she is indoors she could still be exposed to diseases whenever I take her to the vet. He was still upset though so I told him ‘She’s my cat, not yours.’\n\nMy friend then said I didn’t have to say that, and he’s only concerned because he heard that vaccines can cause blood cots. Am I wrong for being harsh with him?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  Your cat and his ranting about junk science means nothing.  Stick to what a trained vet tells you to do.", "Isn’t it the law that they have to be vaccinated? My state requires it, hopefully it this way in all states. My vet told me my kitten will be good for a year and then after that it will be 3 years since she’s an indoor cat. NTA", "Yep. Even plain old aspirin kills about a thousand people a year.", "He isn’t paying for anything.", "Then, you are perfectly correct in your statement. It is not his cat by his choice. He asked to visit, not have a part share."]}