{"id": 30424, "submission_id": "17oz9lo", "title": "AITAH for asking my husbands friend & girlfriend to pay for staying in my Airbnb", "selftext": "I recently (2 days ago) threw a suprise birthday party for my husband.\nI supplied some complimentary alcohol and a tonne of food/activity and live entertainment.\nAround 20 people attended and 10 of those guest were out of state.\n\nI currently run my own Airbnb which is my primary income (separate from my husband's work/income) and I also manage 2 others for a friend.\nMy friend had generously offered her two Airbnbs out to friends/family who were travelling, to reduce the cost. I also did the same for my own Airbnb. We settled on $100 a night. This is a significant reduction from our usual $300 nightly rate, which is still lower than others around our area.\n\nI was upfront with everyone and expressed that accommodation would be $100 a night although each apartment slept 6 people and they could reduce the cost if they shared with others, which some did.\n\nNow to the part that has got me into a fiery rage. My husbands friend returned home and I sent him a courtesy message asking if he could send $50 ($25 each) through, for him and his girlfriend, having stayed in my Airbnb.\n\nI am then told by my husband that this friend had pulled my husbands brother aside to express that he was upset that I was even asking $50 from him, considering he let us stay with him once.\nWe stayed with him for a night and it was myself, my husband and our two small daughter's. We all stayed on a blow up mattress in the upstairs room of a townhouse (in the middle of summer) with no aircon. We were very uncomfortable, our kids didn't sleep well and we ended up leaving at 3am to make the 7 hour drive home due to not being able to sleep.\nIn saying the above, this is not to take away from the kind gesture of letting us stay with them.\n\nIf it had been another time, I may (I don't really like him - so probably not) very well had of let them stay for free but I had already spent over a thousand, planning this party. (WITH FOOD AND DRINKS THAT THEY CONSUMED).\nNot only that, every single other person who stayed this weekend paid for their accommodation, even though they have let us stay with them multiple times when we have visited.\n\nThis Airbnb is my business, my income, and is entirely my financial loss.\n\nAm I being unreasonable for expecting him to pay for accommodation that him and his girlfriend stayed in?", "created_utc": 1699264181, "permalink": "/r/AmItheAsshole/comments/17oz9lo/aitah_for_asking_my_husbands_friend_girlfriend_to/", "score": 65, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I recently (2 days ago) threw a suprise birthday party for my husband.\n\nI supplied some complimentary alcohol and a tonne of food/activity and live entertainment.\n\nAround 20 people attended and 10 of those guest were out of state.\n\n\nI currently run my own Airbnb which is my primary income (separate from my husband's work/income) and I also manage 2 others for a friend.\n\nMy friend had generously offered her two Airbnbs out to friends/family who were travelling, to reduce the cost. I also did the same for my own Airbnb. We settled on $100 a night. This is a significant reduction from our usual $300 nightly rate, which is still lower than others around our area.\n\nLink below for my Airbnb:\n\n\nI was upfront with everyone and expressed that accommodation would be $100 a night although each apartment slept 6 people and they could reduce the cost if they shared with others, which some did.\n\n\nNow to the part that has got me into a fiery rage. My husbands friend returned home and I sent him a courtesy message asking if he could send $50 ($25 each) through, for him and his girlfriend, having stayed in my Airbnb.\n\n\nI am then told by my husband that this friend had pulled my husbands brother aside to express that he was upset that I was even asking $50 from him, considering he let us stay with him once.\n\nWe stayed with him for a night and it was myself, my husband and our two small daughter's. We all stayed on a blow up mattress in the upstairs room of a townhouse (in the middle of summer) with no aircon. We were very uncomfortable, our kids didn't sleep well and we ended up leaving at 3am to make the 7 hour drive home due to not being able to sleep.\n\n\nIf it had been another time, I may (I don't really like him - so probably not) very well had of let them stay for free but I had already spent over a thousand, planning this party. (WITH FOOD AND DRINKS THAT THEY CONSUMED).\n\nNot only that, every single other person who stayed this weekend paid for their accommodation, even though they had let us stay with them multiple times.\n\n\nThis is my business, my income, and is entirely my financial loss.\n\n\nAm I being unreasonable for expecting him to pay for accommodation that him and his girlfriend stayed in?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH. \n\nYou invited them to a party. If you have the room to house the out of state guests, it's weird to let them pay for the *one night* stay. I get that it's your income, but they didn't come for a private holiday but for your husband's birthday party. You keep going on and on about the things you paid for, like food and drink, which is just part of a party. Do you expect knighthood as a thank you for offering food and drink to *your* guests that *you* invited? No one forced you!\n\nThat said, all your guests were aware of the cost of staying over. They should have complained beforehand and looked for another accomodation or, alternatively, looked for another place to stay.", "I can't believe you are going on about making money off GUESTS. Complimentary food and drink and a reduced rate for staying over for your guests. Wow!\n\n5-star rating for being YTA.", "If you invite people to a party you should have food and drink ready for them. \"Complimentary\" food and drinks? That's obvious. You threw a party and invited folk. People aren't going to a party worrying about how much it cost the host and what sort of debts they're incurring. Hopefully they are just enjoying the party. Sounds like a trap, the way you're talking about this. I'm nervous.\n\nSounds like you're very service-minded. When you recall this friend putting you up for a night you focus on lack of amenities, not on the kindness of being welcomed into somebody's home. Like, he didn't do you a favour cos he didn't have enough beds for guests or aircon? Home is home.\n\nHe gave you somewhere to sleep for the night, and when he needed somewhere to stay for a party you invited him to, you charged him...\n\nYTA\n\nThe airbnb being \"your business\" is beside the point. \"It isn't personal, it's business\" is literally what assholes say. Be a friend to your friends and the friends of your husband. Don't go through life counting pennies.", "ESH.\n\nThe friend sucks for agreeing to pay beforehand and then sneakily going behind your back and complaining to your husband.\n\nBut charging *guests* for accommodation *to your husband's surprise party*? That you invited them to? Yeesh. Supplying your party guests with food and drinks is also your job as the host, there's nothing complementary about this. It sounds like you were making money off your guests.", "YTA - making money off of your birthday is so low id be ashamed if i was your husband. hell, these guys should bill you two since its a business, no?", "YTA. Selfish and only focused on your income. AirBnB are killing the rental market and you’re nickel and diming your friends because “mUh BuIsInEsS”", "ESH\n\nYou asked your husband’s friends to pay to stay ay your friend’s Airbnb. Totally understandable. I understand you charging a fee for your Airbnb (cleaning services). I don’t understand why your husband’s friends were impacting your business. You chose to host an event. Then offered your lodging facilities to guests. The only way you lost money on this party is if you turned away full paying guests. Otherwise, you had 3 empty Airbnbs that were not paying you anything. So you made money. \n\nFriend didn’t think it was fair to charge people. He has the right to speak his opinion. However, if he agreed to the terms before the party then he needed to just pay up.", "YTA. You keep talking about the food and drinks that you provided that THEY HAD THE AUDACITY TO EAT!! Unless it's a potluck....that's what happens when you throw a party. You provide food and drinks. And it was for one night.....is business so boomin or your finances so bad you can't spare one night?!!\n\nSo the AH", "YTA, you threw a party but charged people who had previously hosted you to stay at yours. The comfort level of your previous visit to theirs is of no consequence. Just because it’s your business doesn’t mean you ALWAYS have to I get money off of it. \n\nNewsflash, hosting a party will almost always be a financial loss for the host/hostess. People still do it because it’s fun and bonding with others is important. You don’t get bonus pats on the back for cOmPLiMeNtArY snacks and drinks. Stop hosting parties if you’re going to be so cheap and stingy.", "Yta, you don't expect people to pay to stay with you for something you invited them to. If you had to pay for a hotel, it would be one thing if you mentioned the cost on the invite. To charge guests for your lost income is like telling them you had to take a day off work to prepare for the party and they need to pay you back for that.", "YTA\n\nEvery single person who hears about this will think of you as a tight fisted money grabber.  You have never been charged by any of your friends to stay with them but the one time you invite them to stay with you then you immediately hold your hand out.", "ESH you for asking for the money and the friend for waiting until after he stayed to say he wouldn’t pay it.", "If someone invited me to a party then tried to charge me for staying with them I’d tell them to go fuck themselves, YTA", "Kinda YTA. These r like grey areas in friendships where friends have different opinions. But, charging them for accommodation in your own airbnb for a party you hosted doesn’t seem good", "Soft YTA, I think it really isn't that great a look on your generosity as a person to ask guests to pay to spend the night. \n\nI would rather be offered a mattress on the attic than have my friend make me pay for a nice Airbnb, it is not about comfort, we can all buy comfort at hotels, it is about kindness. \n\nBut then again, it is within your right to be unkind, so... Keep doing what you're doing?", "YTA. Throwing a party with \"complimentary\" food and drink (lol) and expecting your **GUESTS** to pay for lodging? What an incredibly tacky woman you are. If I was your husband I'd be so embarrassed of you right now.", "INFO: Have you told him before, that he has to pay for the night?", "Did he agree to pay before coming for the party? If he did the NTA.", "NTA, if he had taken a hotel room, he would have paid more. When I throw a party guest usually don't Stay with us as we don't have space to host all the guests needing a room. You offered them a cheaper solution which they agreed to take. In the end they went back in their word. This is a shitty move.", "NTA he didn’t stay in your home he stayed in your Airb&b. If you owned a hotel instead he would still have to pay.", "You were upfront about the cost. So NTA. If he had had issues with paying he should have brought it up BEFORE taking advantage of your Airbnb or he should have rented something else in the neighborhood.", "\r  \nNTA, Absolutely not unreasonable. It's your business, your primary income, and the significant reduction in the cost was already very generous. It's fair to expect payment, especially when other guests also paid for their accommodation. The party you organized involved a considerable cost, and their staying over involved resources, including food and drinks that were provided. Your husband's friend might have misunderstood the situation or might not be aware of the effort and expenses involved in running an Airbnb. However, your expectation for payment is entirely valid, especially when it's part of your business and everyone else paid for their stay. Your request for payment is not only reasonable but also fair, considering the context.", "NTA- I’m assuming that when you sent out invites you also let people know that you had discounted accommodation if they wished to use them. No one forced them to come or forced them to stay at the accommodations offered. I’m guessing the party was on a weekend where the Airbnb would normally be booked. It is your business and you still have operating costs, like cleaning after they have been used. If you had to have the unit cleaned then now they have cost you money.", "NTA- you let everyone know before hand if they wanted to stay they had to pay. Sooo him and his gf chose to stay they now have to pay. If you had not stated anything before hand then you’d be the AH.", "YTA.\n\nLandlords gonna landlord. It’s tacky as hell to try to make money off your friends. I’m a lawyer, I would never dream of sending a friend an invoice after I help them read through a contract or something.\n\nIf my friend did this to me I’d probably never hang out with them again.", "NTA. you were crystal clear about the cost and he is a jackass bringing up the stay you had to ABORT have way through because it was unbearable", "NTA, you told them up front, they accepted by staying, they owe you the money.", "NTA. The dude agreed to pay, took what was offered, and then didn't. It would be different if he'd said ahead of time that he still couldn't afford it, but he didn't.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI recently (2 days ago) threw a suprise birthday party for my husband.\nI supplied some complimentary alcohol and a tonne of food/activity and live entertainment.\nAround 20 people attended and 10 of those guest were out of state.\n\nI currently run my own Airbnb which is my primary income (separate from my husband's work/income) and I also manage 2 others for a friend.\nMy friend had generously offered her two Airbnbs out to friends/family who were travelling, to reduce the cost. I also did the same for my own Airbnb. We settled on $100 a night. This is a significant reduction from our usual $300 nightly rate, which is still lower than others around our area.\nLink below for my Airbnb:\n\nI was upfront with everyone and expressed that accommodation would be $100 a night although each apartment slept 6 people and they could reduce the cost if they shared with others, which some did.\n\nNow to the part that has got me into a fiery rage. My husbands friend returned home and I sent him a courtesy message asking if he could send $50 ($25 each) through, for him and his girlfriend, having stayed in my Airbnb.\n\nI am then told by my husband that this friend had pulled my husbands brother aside to express that he was upset that I was even asking $50 from him, considering he let us stay with him once.\nWe stayed with him for a night and it was myself, my husband and our two small daughter's. We all stayed on a blow up mattress in the upstairs room of a townhouse (in the middle of summer) with no aircon. We were very uncomfortable, our kids didn't sleep well and we ended up leaving at 3am to make the 7 hour drive home due to not being able to sleep.\n\nIf it had been another time, I may (I don't really like him - so probably not) very well had of let them stay for free but I had already spent over a thousand, planning this party. (WITH FOOD AND DRINKS THAT THEY CONSUMED).\nNot only that, every single other person who stayed this weekend paid for their accommodation, even though they have let us stay with them multiple times when we have visited.\n\nThis Airbnb is my business, my income, and is entirely my financial loss.\n\nAm I being unreasonable for expecting him to pay for accommodation that him and his girlfriend stayed in?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA.\n\nIdk if I just have a really good friend group and we are all extremely generous and giving, but this would never happen in my group. \n\nMy grandma used to always say’ “If you have to ask how much it costs, you can’t afford it” and I think that applies in this situation.\n\nClearly it was a really big imposition for you to throw the party for your husband. You sound resentful of that fact, especially when you write that they ate the complimentary food. Should they not have? That’s really telling of your perspective here and is where I would suggest you dig deeper to find out why you feel that way.", "What is ESH?", "Yehhh, but they didn't make quite AS MUCH money :'(. \n\n^^^^^/s", "If someone agree to pay they should pay, asshole move to go back on their word", "They agreed to pay so…", "Wouldn’t expect anything else from an Airbnb owner", "Jesus he agreed to pay for the night, he should honour it", "I told him from the very first message I had sent. The payment was agreed on", "He most certainly did. I sent out the same message to everyone regarding accommodation. I asked them to let me know if they would be needing to use the accommodation or I would be leaving the night open for others to book.", "Everyone sucks here", "Yes, you are correct, however that wasn't the question of the post. \n\nOP asked specifically if they were the AH for \"asking my husbands friend & girlfriend to pay for staying in my Airbnb.\"", "Are you the OP's shadow account?", "But that's not what the topic of this post is. OP asked if they are the AH for charging their husband's friends for staying in the AirBnB", "So........?\n\nOP says the area is more expensive even than their full price. This friend maybe had the option of paying up or not going. Fair enough to go & also grouse, imo.", "NTA!", "Lol you only responded to the comment giving you the benefit of the doubt despite the abundance of ESH and YTA. Just bc he agreed and went back on his word doesn’t mean you’re still n t a for charging your guests. YTA and it’s tacky.", "Then NTA.", "Add this as edit because these yta are wild", "That they do, but what does it mean though?\n\n\n\n\n\n\n/s just in case", "Is Everyone not agreeing with you op?", "They asked before if anyone would like to Stay in the airbnd for 100$ night, they among Others agreed, pretty relevant i would say", "Jesus christ on a motorbike, they are adults. No one knows if its a ”maybe” so stop basing your argument on random maybes to justify your entitled logic", ":D", "That’s what ESH means! Everyone Sucks Here!", "[deleted]", "I'm basing my argument on OP being a straight up asshole for charging in the first place lol  \n\nAssholes make awkward situations appear around them. This was one such situation  \n\nYou got some funny energy pal", "r/woooosh \n\nThought you would get it given that I even added /s at the end there."]}