{"id": 30445, "submission_id": "17p73e5", "title": "AITA for wanting to take leftovers from a party where I paid for food?", "selftext": "A friend invited me and my gf over for a charcuterie party. My gf is vegan, but we thought it would be fun. I asked what we could bring. My friend didn't text back for a few days, then text in the group chat it's BYOB and for each person to venmo her $25 for food.\r  \n$25 per person is a lot, since we'd be paying $50 and still have to bring drinks, and my gf wouldn't eat most of it. I text back, \"Hey, is that the right amount? Can we do a google sheet and have people sign up to bring specific items?\" My friend said “I already bought everything, but if you can't afford it right now, just venmo what you can.\"\r  \nI thought that was a rude way to say it, but maybe I should've handled it differently. I venmo'd her the $50. The party was fun, even tho my gf could basically only eat crackers. We brought wine and so did some other friends and we all shared with everyone. At the end of the night, we were all helping my friend clean up, and she mentioned that she thought we would eat more and she had basically as much meat and cheese as she put out left over.\r  \nSo I asked if we could all bring some home, since we all paid for it. She looked kind of surprised and said she was thinking about hosting another charcuterie night for all of us. Imo that was kind of weird since she hadn't mentioned it before and it would have to be soon for everything to still be good. I just let it go and we didn't take anything. On the way home, my gf said i was kind of being a jerk to my friend and usually the host keeps leftovers. I think it was ok to ask because the host usually doesn't ask you to pay for everything. If I’m the asshole, I’ll apologize to my friend in the group chat.\r  \n", "created_utc": 1699289406, "permalink": "/r/AmItheAsshole/comments/17p73e5/aita_for_wanting_to_take_leftovers_from_a_party/", "score": 45, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I asked host if I could take leftovers since I paid to eat, but i know etiquette says the host keeps leftovers and maybe i shouldn't have asked\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "This charging for parties business is sick as fuck. Difficult to imagine goers to such a so-called party doing worse than the so-called host already has. Maybe shitting in a wicker chair Bernard Black style. But even then it would probably still be warranted.\n\nNTA\n\nOP is a disappointment to us all for not fighting their way into the kitchen tho", "NTA \n\n>On the way home, my gf said i was kind of being a jerk to my friend and usually the host keeps leftovers.\n\nUsually the host doesn't charge $50 to attend a party they are hosting. If the guests pay for the food, the host should let people take home the leftovers", "NTA. The host sounds like she's making a tidy profit on these charcuterie nights, no wonder she's keen to do another. Personally, if I invite guests round to my home for food, I don't ask for money and I usually send them home with a tupperware of leftovers. I also say no need to bring gifts but a bottle of wine or chocolates is appreciated, although I wouldn't think bad if they didn't. Totally understandable if you're friend can't afford to pay for everyone, but in that case she should have done a pot luck so that people can contribute things they can afford and what they can eat, not be forced to eat what she dictates, pay what she says without question and her get her fridge stocked for free for the next week with all the leftovers. I guarantee if she does another one she will charge you again.", "NTA\n\nYou all paid for it, why should only she get to keep it?  Don't do anymore of her \"events\".  A potluck would have been a better choice.", "NTA. My friends and I do a pot luck every year. We all assign starters mains and deserts and at the end of the night we have take away tins so people can bring left overs home. Not just what we brought but a bit of everything. We also make sure to cater to people’s dietary requirements. \nYour friend was very rude and is going to be left with so much food waste!! I wouldn’t be going to another one of their events.", "[NTA. you](https://NTA.you) don't invite people over and then ask them to pay for food, and if you are already an ass and did it, then you should send the food home with them.  \n\nAsk her for her grocery list next time.  That’s basically what she did.", "Who hosts a party and gets people to pay?! LoL\n\nLast time we would have contact willingly.", "NTA if everyone brings food or pays, distribute what’s left over to everyone who attended or those that want it. You can’t host and charge people, and then keep all of the food that isn’t eaten.", ">usually the host keeps leftovers. \n\nNot for any party I've ever been to. The host is usually the one stopping people on their way out the door to ask if they want to take anything home with them.  \n\n\nNTA. You didn't pay $50 for your girlfriend to go hungry and not get to take something home. It sounds like your friend just wanted free food.", "I will never understant this people that wanna make a party but the guest have to pay for everything. Asking them to bring a desert or his own drink, ok. But pay for everything and more? Why even host a party? Go to a restaurant then!\n\n25 bucks for a charcuterie where you had to take the drinks yourself? Also, a party where you know you gonna have a vegan person and yet dont buy anything for her, despite she paying her share? \n\nYou were absolutly right. The food was there, paid for all of you. This so called friend should be the first to offer. She didnt want to host another party for you. She would save that for herself and other people or maybe even another party for other people.\n\nNext time someone wanna do a party like this, offer the \"each person takes some food\" deal. If they keep with this charade, ask them to see the grocerie list to understand the 25 bucks a person. Honestly, I wouldnt go. I would take my 25 and go eat out and better.\n\nAlso, tell your girlfriend, the host gets to keep the lefhovers when he pays for it! All of you at the party were kinda of host to that party. \n\nNTA", "NTA. I think it's weird that you actually contributed for food but weren't able to take it home.\n\nDoubly weird that that the host hosted a party and expected people to pay without checking with them first???", "NTA. \nDepending on how many people came, she probably pocketed money. I know cheese/meats are pricy but that’s crazy charging $25 per person. I would have asked to take things home too! But I also would not host a party and tell people to pay me for the supplies.\n\nEdit for spelling", "NTA you all pitched in, that entitles you all to leftovers.", "NTA\n\nIf you have too much food left over after a get together it's better to offer the food to the guests to avoid wasting food. If you didn't touch the dish this time, there is no guarantee that the guests will touch it the second time around.", "NTA. Host usually keeps leftovers because they paid/made it.\nThey didn't pay so why should they keep it.", "NTA. However, my experience about food party leftovers has varied greatly by region, and by group. In Montana, potluck guests would leave any leftovers with the host (and you'd have to chase them down in the next couple of weeks to return their casserole dish). In New York, potluck guests would take their leftovers home. In Texas, the hostess will pack up \"a plate\" from all the leftovers for you to take home like a whole extra meal.\n\n\nI guess the answer is to find a friend group that agrees to how leftovers will be treated.\n\n\nIn any case, charging your guests a food fee to attend a party is crude. It changes the relationship from host/guest to organizer/attendees.", "NTA. The host normally keeps leftovers because the host pays for it and cooks it. If y'all paid for the meal, it's YOURS to take home. Also, the host frequently sends people home with food anyway because it's difficult for one person or a small family to eat that much food before it goes bad. And you're right, you'd have to have that 2nd party pretty darn soon if you're gonna do it before the food spoils.", "NTA. Sounds like they were just trying to get free food out of y'all", "NTA at all. The host bought nothing more than anybody else did. You all bought your own food. It would be right for you all to take your food with you.", "NAH.\n\nThey took too much money for food, and you were just asking if you could resolve it THIS way.  The host had another idea - fair enough, but I hope the host will have the party soon and reimburse people somehow if they're not able to come to the second party.  Personally, I like the idea of taking home leftovers.  \n\nI think your girlfriend was overreacting on the issue of you asking.  But I gotta admire that she was willing as a vegan to go to this party and chip in the full share for food.  Good sport!", "\\>  >  If I’m the asshole, **I’ll apologize** to my friend in the group chat.\n\nI don't think it's to that level of cringe. NAH\n\nI was raised that a guest never asks to bring food home, including if they brought the food. It's the host's to keep. Part of a thank you for hosting. What they decide to do with it is up to them. Guests can hint if they really want to, but not press it.\n\nI was told this as a teen when I didn't know better and noticed the really good thing I brought was barely touched...and we didn't have much in the pantry...so I my teen self thought: hey, I can ask for that and have some for breakfast! That's when the hostess gently told me etiquette says don't ask. Okay with me.\n\nI see your point about paying $25 each ($50 total) for a charcuterie party when your gf can't eat much. But you did *opt to go to it knowing that*. I understand because as a vegetarian, I often cannot eat the most expensive stuff, if it's a 'meat main' at a prix fixe, or something like that -- but that is just how it is at times. I can choose to partake or not to partake...In this case a meat and cheese party, unless they provided, or you brought, vegan cheese and vegan sausage and pepperoni (which exist, for any reading), then you knew up front, you can't eat much there. If they didn't work that out with you both ahead of time, and asked $25 per, and you accepted, then that's the deal.\n\nIf the hostess knew that (your gf is vegan and couldn't eat much but crackers), maybe she didn't want to second guess your decision, or thought you might bring something with (a lot of people with special dietary needs do that habitually.) The part when she said \"if you can't afford it,\" I think she was being kind or understanding, to offer to 'just pay what you can.' Read it as 'pay what you want' if you prefer. I don't think she meant it insultingly. She was being a generous host.\n\nIf you go back for the next charcuterie night, maybe bring some vegan approximations? Or ask if she can supply some, and send her links of examples, maybe?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA friend invited me and my gf over for a charcuterie party. My gf is vegan, but we thought it would be fun. I asked what we could bring. My friend didn't text back for a few days, then text in the group chat it's BYOB and for each person to venmo her $25 for food.\r  \n$25 per person is a lot, since we'd be paying $50 and still have to bring drinks, and my gf wouldn't eat most of it. I text back, \"Hey, is that the right amount? Can we do a google sheet and have people sign up to bring specific items?\" My friend said “I already bought everything, but if you can't afford it right now, just venmo what you can.\"\r  \nI thought that was a rude way to say it, but maybe I should've handled it differently. I venmo'd her the $50. The party was fun, even tho my gf could basically only eat crackers. We brought wine and so did some other friends and we all shared with everyone. At the end of the night, we were all helping my friend clean up, and she mentioned that she thought we would eat more and she had basically as much meat and cheese as she put out left over.\r  \nSo I asked if we could all bring some home, since we all paid for it. She looked kind of surprised and said she was thinking about hosting another charcuterie night for all of us. Imo that was kind of weird since she hadn't mentioned it before and it would have to be soon for everything to still be good. I just let it go and we didn't take anything. On the way home, my gf said i was kind of being a jerk to my friend and usually the host keeps leftovers. I think it was ok to ask because the host usually doesn't ask you to pay for everything. If I’m the asshole, I’ll apologize to my friend in the group chat.\r  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You would not normally ask to take leftovers home from a party but can if they are offered. I think your friend was just trying to get you to pay for a second party. I would not want to attend that one if she were serving foods that had already been left out for hours.", "The \"hostess\" was the asshole.  To bill everyone for food AND you bring your own wine AND your girlfriend couldn't eat any of it......   She wasn't hosting - she was providing a living room.  I would skip future parties with her.\n\nNTA", "NTA idk maybe it's a cultural thing, but I have never attended or hosted a party where the attendees weren't expected to take home most of the leftovers. If I have more than one meal worth of leftovers in my fridge after I've hosted a party I assume everyone hated what I served.", "NTA, if you are hosting a party, you pay for it.  I understand the BYOB part of it, but to charge people a flat rate for food is crazy and 25$ is pretty steep for charcuterie.", "I love the way she said “If you can’t afford it right now, just Venmo what you can.”\n\nWell if she can’t afford to throw a party maybe she should have waited until she could.", "INFO: More about the hostess? Where or in which culture did she grow up? Earlier today (elsewhere), I saw someone say that in Europe everyone brings what they are going to drink and the host really does not provide anything. But that he was surprised in the U. S. the host pretty much provides everything. (The hostess asked guests to bring things *and* pay; so I wonder why. If she grew up elsewhere, is that the normal there?)\n\nSo I wonder if there might be a small culture clash? Also did your gf and you grow up in different regions or cultures? Because it was definitely a taboo where I'm from to ask for left overs after a party, and it sounds like that's your gf's norm too; but not for you. I'm not judging anyone. As I said NAH. But just curious if it might be that you all learned different etiquette.", "This is in no way acceptable. You don't invite people over and then ask them to pay. When I host I go out of my way to make things extra nice. I would never expect a guest to pay for food I invited them to eat. I get the BYOB but food? No, absolutely not. Skip their parties in the future. NTA. Just ugh. Yuck. Manners people (clap, clap) manners!", "NTA. I feel like the better way for your friend to go about that would have been to ask each person to bring their own charcuterie board and have a fun little competition about it maybe? Idk. I’ve never been asked to pay for food at a party my friend has hosted. Usually the host understands that by throwing a party they are accepting the costs.", "NTA, while the host usually keeps leftovers, the host usually doesn't ask to be paid either. You are not wrong to ask for leftovers because the cheese and stuff would just go bad and should be eaten fresh. Unless she was hosting in the next few days it was just an excuse she used off the top of her head.", "Definitely NTA \n\nAnd how many people were even going?!", "What the ever loving fuck is this about?! So the host scammed everyone into paying a fortune for charcuterie and you had to bring your own booze too? 😂\n\nSo... I've never charged anyone for a party I've been hosting and I've never left any guest without a decent meal. The idea of not catering to a guest with dietary requirements is completely foreign to me.\n\nNTA for asking to take leftovers home- I send my guests away with doggy bags if there's more left than I will eat the next day. Gentle YWBTA if you go to any more money grubbing parties without setting reasonable boundaries and ensuring your partner is considered and catered for too.", "the softest possible Y T A (so soft I spaced the letters so the bot wouldn't count it. Your GF is correct normally the host keeps the leftovers.  Text the host a roundabout apology.  Tell them you hope your offer to take the leftovers didn't offend her and that your GF explained to you the etiquette of \"party leftovers\" so now you know. Mention what a great time you and GF had at the party--extra points if you mention a new cheese or meat you had that you particularly enjoyed.", "You paid for that food, they were your leftovers \n\nNTA", "NTA. Also either do a potluck or don't. Or cater food from restaurant for a get together. Everyone pays their own meal food. I don't understand this venmo business either.", "sorry I didn't think it was relevant to the story but i actually did take a dump in their wicker chair\n\njk", "We do this too. And if we know there is someone struggling more for money we will suggest they do the bread board or salad bowl or something.", ">Who hosts a party and gets people to pay?! LoL\n\n&#x200B;\n\nNot only that, people brought wine too. Did the host keep the left over wine too?", "Bingo.", ">25 bucks for a charcuterie where you had to take the drinks yourself?\n\nYeah that part made me wonder but then so did the 'pay to go' part too, but since everyone seems to have gone anyway, I thought this was the new normal or something.\n\nI guess if they did rare cheeses and specialty meats...and booze can be expensive...but still.", "Yeah I make a lot of charcuterie boards and I am trying to imagine spending $25 a person. Hell the ones I buy from the deli don't even cost anywhere near that.", "Yes it could vary by region, or culture.\n\nI was curious where everyone in the story was, and where the hostess was raised or what her cultural background might be...because charging for a party is not something anyone would do where I'm from. But I assumed this was just the new thing now.\n\nEveryone in OP's circle seems to have enthusiastically gone. Which made me assume this is normal now. His only complaint seemed to be that his gf didn't get much to eat. But as a vegetarian, we're used to it and don't like to make much fuss. (Vegans maybe even truer.)", "thanks, i think my gf is a good sport. I think she overcompensates because she wants to get along with my friends and worries people think vegans will be really preachy/judgemental. when she said she thought i was being kind of a jerk, she wasn't chewing me out or anything, she just wanted me to think about how i had asked could come off.", "If it's a wedding with one fixed plate for all guests (no options) or a prix fixe or some event that gives the same to everyone, and the main part is meat...then I kind of joke, 'someone near me gets an extra one, because they can have mine.' (This happened at one reception: chateaubriand; the only guy at the table raised his hand when I discreetly asked if anyone wanted mine. He looked pretty happy. Lol)\n\nSo it just occurred to me, I guess one way to 'get your money's worth' might be if *you* ate more than usual while you were there (within reason so no one's cringing.) You paid $50 but are eating about $25 worth, to your estimation? Then, maybe, eat $30-40 worth instead (yourself), if you are concerned about getting your total $50 money's worth in food alone (because as you describe it, your gf is eating about $5 worth in food. But you are paying $50 for you both, and together eating maybe $30.)\n\nOr consider the other $25 'ticket' is for the ambience and fun. Maybe. All in how it's looked at.\n\nNAH", "Another idea is maybe the hostess could provide nuts or something if no one's allergic. At the next charcuterie night she mentioned planning.", "I gotta say JK, I'm pleased to hear that! \n\nSD jr", "*bellylaugh*", "Same or some people aren’t as into cooking as much others so might even bring something easy to throw into the oven. \nThe friend obviously made food people didn’t like either very much either if they had so much of it left over too.", "But if you're going to do rare and expensive items, you get buy in first. You don't buy everything and then demand people pay", "Maybe a few fruits as well. Sliced pears, or grapes, maybe."]}