{"id": 30624, "submission_id": "17r9yy8", "title": "AITA for calling my husband useless?", "selftext": "My husband and I have been married for about 10 years now. We have always kept our finances separate. In the early stages of our marriage, I was working in a good job, earned well (perhaps slightly more than him) and had no problem pampering him with holidays etc. i have never been calculative about money (was raised to give generously to loved ones). He on the other hand is extremely calculative when it comes to his own money and says every cent he pays for me has to be paid back unless its a special occasion. In his defence he grew up poor and thrifty. That said he always makes sure to get me a nice birthday gift, flowers etc. \n\nFast forward to a few years ago when we had our child. It was a complicated conception process, pregnancy and delivery. The total bill was exorbitant and I paid about 75% of it because I got a huge bonus that year and he paid the balance. I never expected him to repay the balance and he never brought it up either. Subsequently whenever he got bonuses etc it would go to his own expenses or things for him instead of anything for me.\n\nFast forward to now, I am suffering a mental health problem and am unable to work. Firstly he doesnt see mental health problems as real problems and when I am unable to get out of bed he thinks im being lazy. Next since im unable to work he pays for all the bills but makes it a point to record down every single cent so that I can repay him at the soonest. I dont deny he has forked out alot of his money running the house while I am unable to work but I lost my mind yesterday when he asked he asked me back for $5 he spent on food delivery. We had a huge fight and I told him he is completely useless as a husband. \n\nAITA?", "created_utc": 1699525356, "permalink": "/r/AmItheAsshole/comments/17r9yy8/aita_for_calling_my_husband_useless/", "score": 798, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I called my husband useless even though he has been running the household when I am\nUnable to work\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nFuck this guy. Not even splitting the hospital bill for his own child’s birth? Not to mention him not believing in mental illness 🙄 \n\nI’m sorry but having completely separate finances when married and having a kid isn’t possible. Especially when one parent is SAH or unable to work", "You're not an asshole, but you're delusional to think he would just change his ways. He didn't seem that responsible before.", "NTA. I've never understood relationships that are so transactional when it comes it money. My husband has helped me when I quit my job due to mental health, I helped him when he was bullied into resigning.\n\nWe are supposed to be there to support each other, to build each other up. Not be like hey, you owe me $8 for dinner.", "NTA. Add up how much you spent in previous years. Inform him that what you ‘owe’ now can be taken out of that.\n\nAnd see a good lawyer, just in case.", "I came in with one opinion based on the title but the description has given me a full 360. \nUseless is a mean thing to call someone. He’s not useless. He’s a miser who apparently doesn’t care for you. What you describe is unbelievable. As husband and wife you look after each other. Awful behaviour. NTA", "He can write down every cent but you don’t have to pay it. wtf kind of marriage is this, this is so transactional.", "NTA. As it reads: you've been financially supporting your husband for years and now you need him to do the same he's decided to nickel and dime you?\n\nTo quote the great philosopher Greg from across the street: 'Fuuuuuuuuuuuuuuuuuuuuck that.'\n\nI'm pissed on your behalf. Time to ask the important questions regarding 'in sickness and in health'.", "NTA OP.  I’d be looking up divorce attorneys if I were in your shoes.", "NTA Sounds like he never really saw you as a wife and more of a roommate.", "NTA\n\nI don't think this is marriage at all, counting the things and asking them to pay back as if it's some of debt, sorry but that's not how marriages and love work, this is like you are living with a person as a roommate", "he is not useless, he is an AH and not part of this marriage. if you go single mom and he pays you have more than now probably. NTA", "NTA - you’ve provided well for him, and he is being tight fisted and pretty damn lacking in compassion for someone who is meant to be your husband.", "NTA, he IS useless as a husband. Tell him to pay back your money too. Wtf with only contributing 25% of pregnancy fees, not even half, isn’t that his baby? This is why you don’t tolerate disrespect, it’ll only get worse. He is too horrible, at this point you’re an AH to yourself for staying with him, sorry.", "NTA, I guess to him people like me are completely faking it too until we \"do something about it\"....fuck that guy", "He's not useless cause he serves a purpose- to drag you down.", "Jesus christ why are you still with this awful human being? \n\nNTA but my god you need to leave.", "Nta wow he sounds so tight that if he was in prison, there’d be a line outside his cell.", "NTA. However he is not \"Useless\", there are many more appropriate words for him. Miserly, Scrooge, skinflint, unsupportive, asshole would be some of them.", "He's completely useless as a husband, girl you should get yourself a better one. So NTA.", "and what about the child? is there an excellist with all its costs so he she can pay back once he she got a job?!", "NTA-Are you married to Ebenezer Scrooge?", "ESH\n\nIt sounds like you both have different attitudes towards money but never really got on the same page about this. you can't just wait for the other person to get in line with your values without having a conversation. If you do have this conversation and you are still both on very different pages it may be that you need to stop being so generous with yours and make it completely equal, or maybe you are just not compatable. \n\nHis perspective on mental health is ignorant and he needs to understand that if he is going to love somebody struggling with mental health he needs to educate himself. You are not lazy you are unwell and need support. If after this he still does not view mental health problems as real, again, you may be incompatible and I would worry about how he would react if your child suffers with their mental health. \n\nCalling somebody completely useless is awful, do you really believe this or did you say it to hurt him? if you really think he is then why are you still married, if you said it to hurt him then that is a cruel thing to do. \n\nSounds like you both need couples counselling", "ESH \n\nSeparated money may work without kids, but as soon as your child entered this world you should have either combined funds or created a shared account that you both contributed to. \n\nYou suck for calling him useless, but he’s an asshole for not stepping up when his partner and family need him. Yes he is “stepping up” financially for the moment, but the tally to pay him back and his non existent emotional support during this time are totally fucked up. I get growing up poor and thrifty to save money and then wanting to keep it to make sure you never feel that way again. But once you get married and ESPECIALLY when you have kids you have to be able to pick up where your SO can’t at that time. \n\nDoes he expect you to pay him back for diapers,wipes and formula? Where the line is drawn on what he deems you responsible for( that’s rhetorical, I know it’s none of my business). Having a child rocks your world, I hope you and your family can work this out and come out the other side stronger.", "ESH. You sound more like roommates with benefits instead of a loving relationship with a partner.", "ESH. You’re married with a child but run separate finances? That doesn’t seem right.", "YTA, you've been married to this man for 10 years, it sounds like he has been a consistent partner that whole time but now he is useless for this particular set of circumstances. \n\nYou chose poorly.", "ESH- he’s a grinch. I don’t know why you’ve spent this long with a man who doesn’t understand what a family is. \n\nYou have your head in the sand. Why haven’t you stood up for your and your kid earlier? Why do you keep compromising? Who agrees to completely separate finances without even a household account? \n\nDo you divide up the household chores the same asinine way? How do you “pay” each other for household items? \n\nHe seems to be more of the AH here, but you contributed to this disaster.", "This is not a marriage.  Please seek the proper help and get out.", "NTA\n\nPlease do not stay with him!", "NTA but I think you made a mistake not coming to an agreement regarding financial expectations early on. My husband & I have separate accounts but we are very clear on who is responsible for what expenses. I earn more so I cover the big items but his contributions are meaningful and fair, and it means there’s no resentment and we both contribute our fair share. We also don’t have kids, which makes our arrangement easier. If you’re going to stay with this guy, PLEASE have a firm and frank discussion about who will cover what. This is so important if you are suffering from mental health issues, you need clarity and assurance especially if you’ll be taking work leave.", "NTA\nBut know you two have a different language when it comes to finances. \nHe will never understand your point of view, and you will never feel good about his point of view.\n\nI would first make balance, and definitely put the extra 25% of the hospital bill on your side.\nDo you still 'owe him' anything after that?\n\nAnd maybe take him to a doctor's appointment (not your therapist or anything,  but your GP) to have them explain 'what's wrong with you' and how he can and SHOULD support you.", "NTA.. no wonder you are having a mental health crisis… \n\ntell him you will make sure to keep receipt for divorce attorney so he can refund his half..", "ESH.", "I wonder how this post would read if the husband was couch surfering due to mental health issues and the wife was being a dick over 5 dollars.", "I think you’re both assholes. This is why separating finances in a marriage is a red flag and a disaster waiting to happen. It’s never even or fair and everyone always thinks the other person owes them something.", "ESH. What a horrible arrangement. Whatever happened to “what’s mine is yours” — sounds like this was a disaster waiting to happen. You both might need to reassess this arrangement, couples counselling might be the way to go!", "ESH.  He is being very cheap and making this relationship transactional.  You knew what he was like before you married him so you shouldn’t be surprised.", "You married a thrifty gentleman now have stopped working and are surprised he's not okay ? He is likely terrified of poverty YTA", "NTA. He is completely useless as husband and as aman, if he cannot provide for his family he's useless.", "That’s what happens when society pushes away from the typical household where the man takes care of things. I kinda feel bad for the women in the west at some point. Both me and my wife work and that money is for both of us. We save together and work for the family. If she doesn’t want to work anymore then it’s my responsibility to take care of the house which in turn pushes her to be the house taker and housewife which comes with it’s own responsibility and work. If she is working then both of us are also the housewife/husband. It’s not complicated and you western folks have been manipulated to destroying your own kids and family.", "NTA this is why I don’t think separate bank accounts are good. You don’t have a marriage, you have a financial arrangement.", "This is the real tragedy of modern marriage.. We are married but keep separate finances. What happend with good old whats mine is yours? -.-", "ESH- I think calling someone \"useless\" is one of the worst insults can ever give anyone, ever. It's basically saying you are \"worthless\" and \"meaningless.\" And for men, especially for men, being told they are useless (when men are raised to be productive, useful etc) is really harsh, hurtful and emasculating.\n\nThat said, it is awful how you are being treated, especially as someone who was once the main breadwinner. And I really don't understand how you can have to \"repay\" him money? Don't you share money as a married couple?\n\nI think you need to sort out some couples counseling as this money thing between the two of you does not bode well. It really needs to be sorted out with a qualified professional. And, I'm sorry you are going through this while recovering from a mental illness. I really hope counseling helps you both, it's unfair you are in this position.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I have been married for about 10 years now. We have always kept our finances separate. In the early stages of our marriage, I was working in a good job, earned well (perhaps slightly more than him) and had no problem pampering him with holidays etc. i have never been calculative about money (was raised to give generously to loved ones). He on the other hand is extremely calculative when it comes to his own money and says every cent he pays for me has to be paid back unless its a special occasion. In his defence he grew up poor and thrifty. That said he always makes sure to get me a nice birthday gift, flowers etc. \n\nFast forward to a few years ago when we had our child. It was a complicated conception process, pregnancy and delivery. The total bill was exorbitant and I paid about 75% of it because I got a huge bonus that year and he paid the balance. I never expected him to repay the balance and he never brought it up either. Subsequently whenever he got bonuses etc it would go to his own expenses or things for him instead of anything for me.\n\nFast forward to now, I am suffering a mental health problem and am unable to work. Firstly he doesnt see mental health problems as real problems and when I am unable to get out of bed he thinks im being lazy. Next since im unable to work he pays for all the bills but makes it a point to record down every single cent so that I can repay him at the soonest. I dont deny he has forked out alot of his money running the house while I am unable to work but I lost my mind yesterday when he asked he asked me back for $5 he spent on food delivery. We had a huge fight and I told him he is completely useless as a husband. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Your Both Assholes. He was this way when y’all met. So were you. And here you both are. YTA for knowing he’s like this and assuming your immortal. Hes TA for being a socially obvious asshole in a dual partner relationship. Especially with what you birthed. YBTA.", "NTA that is not a husband, that is a roommate.\nWith whom you have a child...", "ESH because you haven't made it clear before marriage how finances in your relationship would work. You were destined to fail as soon as your finances took a hit - and they took.\n\nBut in my opinion that's pretty poor behavior on his side in regards to woman he vowed to spend life with, who beared his child with lots of compilations. But things like asking 5 bucks back? It looks like a straw that broke a camel's back. Talk with him about finances because it is possible he ( and you ) have some financial hardships.", "NTA and i don't get how you even need to ask this, it's so painfully obvious that his behavior is abnormal to an extreme", "Separate finances as a married couple...sounds so stupid to me", "NTA you're right. He sounds fucking useless!!", "NTA growing up poor is not an excuse. He is an ass and selfish omg. You need support and he is so greedy and selfish.", "NTA, sounds like youre paying for mostly everything in that whole marriage 😭", "Holy crap!  You don't have a husband, you have a roommate, and a pretty sh\\*tty one at that!  So why did he expect you to have to pay the bulk of the hospital bill for a child you both conceived!?  I'd tell him that you'll deduct the $5 takeout bill from his portion of the hospital bill that's still due!  \n\nNTA!!!", "I think Esh\n\nHim for ultra obvious reasons. Expecting to be paid back, calling you lazy ,not giving you proper care etc.\n\n\nYou, for getting in a serious relationship with that man despite knowing how he behaves. It's not like he was hiding it from you.\n\n\nImo, he should go to therapy or something to fix his problems and then he should get in serious relationship.\n\nNow that we far passed that point though, you'll have to communicate about how his behaviour is not husband like and you aren't business partners or roommates, but a couple. If that doesn't work then it's either couples therapy, or divorce.\n\n\nAlso, imo you should apologize for the \"useless\" comment as it'll make it harder for him to change or listen to if he feels insulted by you.", "NTA.\n\nIf you were dating, or at least the early days of being a couple, paying each their part instead a bad thing to do, in fact, I have done it with my GF where we each pay half of a dinner, activity, etc.... yet, we changed that and now each pay whatever we feel like it, mostly I take care when she comes over to my place while she does when I go to her.\n\nYou guys are not just any couple, you are married and have a child, it is crazy to think about each having to pay for their things by themselves as now you are supposed to be a team; there isnt no mine or yours, now it is all \"OURS\", you have to both pay for everything and not count each amount so that you can ask for it back... like how you will do if the kid needs clothes, is your husband going to say \"No you buy it, I already bought him a shirt.\"\n\nIm sorry you are dealing with all this problems and not having a SO that is with you in these times, only caring about money which, even I that grew up poor, isnt that important as the bonds that you make with people being what moves life.", "NTA. I will never understand married / partners being together for life, loving each other, and not putting money together. My fiancé and I just started living together, but been a couple for 10 years. Since we started living together, we dont repay each other. We have separate accounts, but my money is his money, and his money is my money. He pays rent and his bills, I pay groceries and my bills. Now he is paying for groceries because I am grevieng and cant get out of the house, but he wont ask me to pay him back? Its all OUR money. And... Honestly I dont understand why he is like this, your husband. I grew up poor too, and that made me more generous I guess..", "NTA. This is a ridiculous and unrealistic approach to marriage. When you marry, you are agreeing to be a unit in every aspect - spiritually, emotionally, but also, financially and legally. Get a divorce lawyer, if just for a consultation.", "Not sure AH for you, a bit of AH for him.\n\nHowever, I'm a bit confused.. as you married him? you've known how he is? I'm sure you knew he didn't think mental health was a thing (not something that goes under the radar in this day/age). With long term relationships like this there's been a ton of red flags you've been.. ignoring? not speaking up on?\n\nIf I attempt to put myself in the shoes with what little you've shared here. If the mental health issues are severe enough, I'd remove myself from the environment/give myself space from him. not sure I'd call it abuse, but certainly not supportive or helpful. I'm not sure what type of mental health issues this is and if you're doing the proper thing by getting to a professional and getting proper diagnoses/aid. I would lean more with him if you're not doing any of that or avoiding that stuff and just quit your job on the family.\n\nI am uncertain with the lack of details!", "ESH Do you and your husband even like each other?", "NTA\n\nSerious question though, why are y’all married? If you made a pros and cons list, would the pros outweigh the cons?", "YTA for putting up with this.", "First, as a married couple I would merge your finances. You guys are 1 and need to act like it. Your husband is being petty for writing down everything he pays for. You need to have an open conversation monthly about your finances. If you guys can’t work together then there will always be arguments about money. Mental health is a concern and he needs to realize that. I do not suffer from mental health issues but my partner does. At first when my partner discussed this with me I was closed minded by just saying be positive everyday or don’t worry about things. However as I started doing research and asking tough questions, I was able to be open minded.  Your husband needs to get off this money dialogue and stop being so petty bc like him I grew up with little money but I never will write down what I bought you or paid bc we’re 1 and need to work together and not against. However by calling him useless is not okay. I’d call him petty but not useless bc he is helping but maybe not the way you want him too.", "I'm sure so so many people have said this already but hopefully you're getting help to get over this mental rough patch.  Squabbling over $5 is kind of crazy.  Hopefully he can start to simmer down about this stuff as long as you get help.", "NTA. If he wanted to be fair he would record every expense including those he got from you. He has no problem enjoying your money. Dump this guy and enjoy your settlement.", "Same accounts and my paychecks go in there. I just ask her if I can buy something and care less what she does. Happy life.", "NTA", "NTA.\n\nTell him how much a divorce would cost him right now and remind him that he has to also pay you back then for all those years", "YTA\n\nYou have an agreement. Your sickness doesn’t void the agreement. Lots of people have mental health issues issues and still work. Stop being lazy.", "Sometimes when I read these stories I wonder to myself \"how did it ever get as far as marriage with this person?\" I mean surely someone this deranged would have had red flags.", "NTA. This is so bizarre. I grew up in a poor household and I never think like this. If anything I'm more anxious about spending money that's about it.\nMy wife and I have separate accounts and we've agreed that I pay the bills, aside from her phone, since I make more than her. Her money is used for groceries and extras. Never do we calculate what we \"owe\" each other because it's OUR money. \nNo matter what you do he'll always have you \"owing\" him money dangling over your head. I agree with the other comments about seeking a lawyer. Once you've done that and have your options, you could try to give him an ultimatum. He seeks help for his own behaviour, might make him realize how toxic his mindset is about it all. And if he doesn't than you go through with separation. It's shitty but it could be the only way to drive it home to him.", "You have more troubles than this specific question. You are an AH for name calling. You wouldn’t put up with it yourself from him or your kid, right? And you call him something that hurts men a lot! While he was being useful. Guess what? If you separate, ya gotta go back to work. Plan wisely, but I think you should apologize for the name calling and explain why you were hurt.", "Ok so your husband can't even contribute to the cost of delivering HIS CHILD, exercises insane financial control and thinks you're lazy when you have mental health issues. He's a real catch. \n\nNTA of course, he is indeed useless, a terrible partner and I suggest you reflect long and hard on the quality of this \"marriage\".", "She should remind him how much a divorce would cost him right now", "This. Make an itemized list of times you paid the bill for what should have been his responsibility.\n\nHis 25% of the hospital bill, every vacation, outing and food delivery. Every bill that wasn't split equally, everything for the child.\n\nMake sure you and kiddo can stay somewhere, parents, a friend, a hotel. \n\nVisit all the good lawyers in your area, remember, if you have a consultation, he can't hire them. \n\nAnd make sure you make him pay you back for all this crap..", "I think you mean a complete 180 😎", "She doesn’t work so I’m pretty sure his couple hundred dollars a month isn’t more than ALL of her life being paid for while she claims mental health not allowing her to work.", "Absolutely great comment.\n\nAlthough might I add something in the last paragraph? By calling him useless, what is OP hoping to achieve? Does she believes that it'll help him improve?", "The kid receives a bill for the cost of raising him for his 18th birthday.", "how is she the asshole?? she paid 3/4 for THEIR baby and didn't ask him to even it out. he can't spend $5 on her when she is going through something?? people do more for their friends/other family and he can't spare $5 for his wife? NTA op.", "I don't get this take. I mean my husband and I have separate finances and we don't have this issue. No kids either, so I get that getting messy, but i don't get why people seem to think it's a red flag, as you say?", "OP said they have always kept separate finances, no “shared” money. I for sure agree that they need to seek counseling and I hope it helps them.", "Honestly the way OP describes her partner I wouldn’t be surprised.", "I believe the only way she's the asshole, is \n\n1) she knew how he behaves, yet she didn't do anything to make him see how wrong he was behaving. (Example couple's or individual therapy, boundaries etc)\n\n2) she proceeded to get in a lengthy and serious relationship with that man, despite knowing how was his mindset regarding these things.", "The whole point of marriage is to support each other, particularly when children are involved.\n\nThis man is not supporting you and never has. Your statuses within the relationship are not equal.\n\nGet couples therapy, and if that doesn’t work take out the rubbish.\n\nNTA", "NTA Tell him if he want to nickel and dime you, then he has to pay you back for the birth of your child. Or say you will keep a tab and when he has paid off the debt, then you'll start giving him the cash.", "YTA. You're asking if *his* conduct is bad enough to justify *your* bad conduct - you know he's not useless, he's currently paying for a roof over your head while you suffer a presumably debilitating illness. Thats a use! But that's an \"asshole\" question, inherently; what we owe each other is grace for our mistakes, not to treat each other not an iota better than they've treated us. Essentially you're engaged in the same calculative behavior for which you're criticizing him, it's just that you're basing the calculation on emotional currency rather than financial currency.\n\nFundamentally the issue here is that the two of you agreed to split finances in the flush times, when you were both working professionals and felt like you had something to lose to the other. Now you're in a situation you didn't contemplate - the inability of one spouse to bring in their own income - and you want the rule that best serves your interests (\"the non-working spouse is entitled to support from the working spouse\") and he wants the rule that best serves his (\"our finances are separate; support is a loan, not a gift.\") It's valid for you to expect that your marriage is superior to financial considerations; your husband would validly point out that you rejected that view by keeping your finances split in the first place. And now you're both mad about it because of the unstated assumptions you both had - you, that you would receive support from your spouse when you couldn't work, and your husband, that neither of you would allow yourselves to be in a position where you couldn't pay your own bills.\n\nOne thing you might do is honestly ask yourself how long you'd support your husband if he wasn't working - for any reason, including indolence - without thought of how he'd \"catch up\" once he had an income again. Because right now what you're asking from him is to be supported that way indefinitely.", "INFO - he asked you to pay him back for food delivery. Was the food for you? Was there food in the house? Maybe he thought this was a frivolous expense (I don't order delivery because of the extra cost and I have a job!) and didn't want to be on the hook for an unnecessary purchase.", "How do people end up married to people like this? It amazes me. No, you're the not the asshole, your husband needs to grow up and seek therapy or you need to split.", "My dad is like this - my mom bought him the car he wanted, a fancy watch, paid for his housing and managed the household finances so they had rainy day savings as well as money for things like holidays. \n\nThey're divorced now - his car is on bricks in the garage, he has a mortgage and she doesn't (even though he actually got more money in the settlement, he just bought a bigger house than he could afford), and he doesn't even have the money to come visit me when I live in the main city in our country a single train ride away. My mom, meanwhile, is living the dream: she goes for cocktails with her friends, is taking me on a city break as a birthday gift and going on a blowout vacay with her friends next year, has enough money for takeout and time to go to the gym, spends a tonne of time with her family, and is financially able to retire but loves her job so has decided not to. \n\nI love my dad, but I just thought you'd appreciate the illustration of the endgame for the financially prudent woman / selfish and financially incompetent man pairing in my own life. \n\nMy actual suggestion to fix this would be to have a joint account that you both put a % of your income into, make it clear what comes out of the pot, and let the rest be your own, and go to couples' counselling. \n\nNTA.", "I grew up absolutely piss poor, we'd be living off food banks if it was now.\n\nI also don't spend a lot, I like to know where money is going however, my work is full time, my wife part time, I bring in about 2.5 times more a year than she does but she spends a majority of the money outside of bills etc.  \n\nShe's out with friends, buying them gifts etc.  \n\nThat pisses me off as I constantly go without or get £30-40 spent on me for xmas/bdays but she's just spent £60 on an afternoon lunch for her friend and her.\n\nBut, I don't expect her to pay me back.  WE are a family, WE both earn, WE share our money.  \n\nIf you can't trust someone with your money why the hell are you married to them?\n\nNTA", "I will never understand completely separate finances in a marriage. It's like you're fwb, forever.", "You both sound like you have some issues", "Oh wow what a happy and loving marriage", "At first i was like, when you talked about pregnancy, a bill for what? And then i remembered that in USA people pay money to get their kid born so i think the problem is more deeply rooted then you think. Second - if you agreed on something knowing this person for who he is, than you are the asshole and also the idiot. Not only for that but choosing random internet strangers for advice over a marriage counselor.\n\nJust let me get the bag for all the downvotes i'll now have to farm.", "YTA.  You \"can't get out of bet\" but have the energy to whine on Reddit?  Your husband is \"useless\" but he pays all your bills?  What planet are you on, lady?  Get your lazy bones out of bed and get to work!", "My now-ex-husband is a narcissist. This guy's probably the same.", "I won't even read this, but yes, calling your person useless makes YTA. The follow up question is, is it justified?", "Sounds like hell \n\nNTA", "NTA", "Can’t call anyone else “useless” when you’re laying in bed and not working. 🤷🏻‍♂️", "Were the words \"in sickness and in health\" in your wedding vows?", "So, you're married? Cause if I recall the vows when I got married said something about sickness & wellness, richness & poorness. In other words, partnership.\n\nNow I could be mis remembering, I've been divorced over 10 years. Just saying, marriage is supposed to be 50/50 with support from the one you share a life & child with.\n\nNTA, Op. He IS useless.", "Oooh so even keeping tabs on who paid what to have a baby together? Sounds like a mutual-supportive healthy relationship. How much did he buy the kid for? Jeez o’ flip. NTA.", "Get a lawyer now! I'm currently the \"roommate\" of my ex-husband (A). After the father of my children died (B)(my husband and my ex actually became good friends) I had a very difficult time and needed to find a new place so A offered that we share expenses and a home. A recently had both hips replaced and is still healing but he's been very helpful with my kids and we share everything financially. \n     When I get paid, I buy groceries for ALL of us. If he needs some money for something else, I give it to him when I'm able. It goes both ways as he's helped me when I came up short. This IS a completely platonic relationship but I could never, in good conscience, nickel and dime ANYONE to death like that!\n     When he was recovering from surgery, I washed that man's feet when he couldn't. I kept a log of his meds and made sure that he took everything on time. In turn, if the kids miss the bus, he gets up and drives us to school. \n    A and I couldn't make it work as a married couple but we've always remained friends. I wouldn't be this generous with just anyone because plenty of people would just use me up and spit me out. However, when it comes to someone you truly care about and share a history with, I personally feel that it's a gift God has given me to be able to help others.\n\nThis man has a very skewed idea of what marriage and partnership looks like, in my opinion. What's next? Is he keeping track of how much money your child costs? Will your baby reach 18 years old with a negative balance that's owed to the adult who had a part in creating that child? WTEF!?! Get a good attorney and get out while you can. This is not a normal approach to being part of a FAMILY. I get it that his past worked that way but do not continue this pattern for the sake of both you and your child. Please, just don't!", "Im going to say ESH but there is a bigger underlying issue here.\n\nBeing stingy and calculative with money is a trait that often carries for life when people grew up poor. Also him \"not believing\" in mental health and calling you lazy isn't him trying to be an asshole, if anything its ignorance.\n\nConsidering his unhealthy obsession with money and your on going mental health issues I suggest you both get into therapy and marriage counseling immediately. Depending on where you live services like this are free or can be supplemented through social programs or health insurance.\n\nOn the other hand you calling him useless is straight up mean and cruel. Its such a harsh word, and while I understand you're at your wits end and he was being challenging two wrongs don't make a right.\n\nIf he flat out refuses individual therapy and marriage counseling then this behavior is not going to change, and the last thing someone struggling from mental health needs is someone constantly undermining it, things wont get better for either of you. Im not going to roast your husband and say he's an ass and you should leave him; him being the sole money maker is probably extremely stressful on him as well. You guys need to work out both your issues, you need to be on the same page, understand each others stressors and emotions, feelings, I also think now that you are married with a child your finances should be mixed. You two love each other, there's no need to keep them separate.\n\nIf you truly love your husband and want to fight for your marriage you need to convince him to do therapy and counseling, if not I would say that for both your sake divorce is a likely best case scenario.", "To be fair, I am quite like your husband. Not because I grew up poor bu because of my mother. The Mantra at home was \"you come last, you get nothing.\"\n\nI live with my brother, and we split every bill in half, only the exception is 100% personal things/ things only one of us uses. (Doesn't count for groceries).\n\n\nI can't even think about wanting to be paid every penny so hard but then not paying my share of my brother's bill.\n\nI have an Excel document with all numbers. At the end of the month, I type in the bills of the last 30 days. After I am done, I just tell my brother at what number he is and leave it at that. His behavior would drive me insane", "NTA. I hope you have enough for a lawyer in your savings.", "This isn't a healthy approach to marital money to begin with. Tbh just leave him", "I have never understood people who get married but have separate finances. When I got married, the vows were - 2 become 1, and for better or worse. What's mine is hers, and what's hers is mine the means debt, sickness, children, the home everything. Sounds to me like this relationship has always been watch out for uno number one.", "I look at things from both perspectives, and routinely reverse the genders to see if it works both ways. How would it be if he said OP was useless as a wife? \n\nYTA, and being upset with yourself doesn't mean you're allowed to verbally abuse your husband.", "ESH, kinda. Look separate finances when your married work, but you have to be willing to communicate and give and take. Im saying YTA because you blew up at him over 5 dollars you should have been having conversations about needing him to help cover things and you would not be paying him back. Just a simple I need your help and I won’t be able to pay this back. If one person makes more then the other then a conversation needs to be had about that person picking up extra responsibility. Having separated finances only work if you communicate.", "Doesn’t sound like a healthy marriage. Calling him uselsess is NOT correct either as he is providing in the arrangement you have had. Maybe it is time to sit down and talk about the family economics and maybe inform him of the realilty of mental health. If he cannot be there for you when you are sick (unless you pay him back) what is the diffference between him and a caretaker? For your mental health I strongly recommend family counseling.", "NTA.  You are a married couple and should be not nickel /dimeing everything ESP WITH A BABY THAT YOU JUST HAD", "NTA.\nYour husband seems to have forgotten the \"in health and sickness\" part of marriage.", "NTA regarding the financial side of things.\n\nOn the health side of things I'd like to recommend you get your thyroid checked (if you haven't already), as having an underactive thyroid can cause you to have very little energy, and is also implicated in mental health as well.", "Mental illness is not Santa Claus or the Easter Bunny! Weirdly, he is doing this, I'd say it's teetering over to obsessive, controlling, and unhealthy. NTA, everyone needs counseling.", "Why are you married to a guy that views every interaction with you as a transaction? He doesn't even care enough about you to spend the money to take care of you or do small acts of love. He literally is recording every cent he spends on you as if having you in his life is a burden and that you're in financial debt to him. \n\nThis is not a normal way for a married couple to act. It's very toxic and this is not a partner as a husband should be. Honestly you need to reach out to your family and friends for help and just leave him out of the equation. Get healthy and get your ducks in a row because this man will always be toxic and hang this imaginary debt over your head anytime he has to do anything for you. \n\nIs this the relationship dynamic you want to teach your child? Is this the way you want to live forever? What about if you ever get injured or become disabled when you get older? Will he care for you or be angry and selfish and try to wringe every cent from you to \"pay him back\"?", "NTA.\n\nYou’ve seen how he will treat you in sickness and in health. He will take advantage of your money and your body, and harangue you when you’re sick. You’re having a mental health crisis, imagine what he’ll do if you had a car accident or cancer. \n\nI’m not the type to say that partners need to have shared bank accounts—I don’t. And I don’t think there are hard and fast rules about how people should break down chores and finances; that varies by couple. But it needs to be *functional*.\n\nThis is not functional. \n\nI want to say mean things about him, but I know that might make you feel bad about yourself or dig in to defend him. So let me leave you with this: \n\nHis values (about equity and money) are diametrically opposed to your needs (emotionally and financial support). That’s incompatible.", "You are not it. He is not a good person.", "NTA no way would I live with all that miserly nickel and diming. Ridiculous, you're his WIFE that is unwell. Goddess take the Wheel!", "ESH\n\nMarried for 10 years and still have separate bank accounts? That's weird.\n\n My checks and my wife's checks both go into the same account. There is no \"her money\" or , \"my money\" other than an allowance we each get monthly to spend on whatever we want. And we both get the same alllowaunce even though I bring substantially more.", "NTA. Send him the bill for the conception process. Seeing as it was a joint venture and all.", "NTA he sounds completely useless.", "Sorry, but how can you be married in such a f-d up situation. Why keep finances apart? You're married. A team. This whole weighscaling is tiring and very bad for your relation... Man...\n\nThe problem is not he's useless, but he's extremely sick in how he treats money, you and your relationship.", "Maybe you suffering from mental health issues now is directly caused by him? That’s the whole take I get from reading your post. Either he changes or you leave his ass", "Well ask income is an asset of the marriage and both have equal rights to said assets... you should move to New York because there you don't even have to like live apart you can be living together sleeping together and just have a stingy husband and sue him for fossil support and get it court ordered you guys may run your finances separately but under the umbrella of the law they are one asset to the marriage and if he didn't want to share his assets he shouldn't have said I do but he did so he should keep getting help take care of your mental health don't worry about him he'll have to get over himself he said I do", "Aren't you kinda useless now too as a wife and as a lucrative member of the household? YTA for calling a person useless.", "ESH\n\nThis is basically how most married with separate finances situations end up… one person resenting the other over money. Good luck sorting out your mess without getting divorced.", "NTA. He’s worse than useless. He’s using you to live a good life without giving more than he takes.", "NTA. \n\nSounds a lot like what yours is his and what's his is his. \n\nHe's recording what he's paying so you can pay him back? Just what in the absolute F? That's not a life partner, that's a freaking roommate. That's not okay. I'm not sure if useless is the word but selfish sure is. What if/when he gets sick and needs you to take care of the house and your child, and YOU were the one recording every cent and reminding him of that fact.\n\nIt's time to have an indepth conversation about partnership and finances because your marriage won't survive the way it's going.", "NTA\n\nI understand that this dynamic worked in ideal conditions but you are literally ill and are unable to work, it is not your decision to no longer contribute financially the way you used to so I truly do not see what his problem is.\n\nYour husband sounds kind of like a dick.", " No, you are not the asshole. I do advise you to inquire as to what your settlement expectations would be in a divorce because this person is not a partner on any level. You are married, he is not. Seems you should level the field.", "I am not of the same opinion of most so i will just say it, YTA. With that said, you know he is like this and you let him be this way for ten years. Now you want him to change? He grew up with this mindset and there is a lot of anxiety that goes with this thinking. I am not saying that his attitude is your fault in the least. I think it’s important you understand it. He probably needs therapy. You are not wrong about what you feel and the reasons you feel it but you are the asshole with the way you went about handling it. Apologize and start working together on haw to make a healthier marriage. The penny pinching is a point of resentment that needs to be addressed in a healthy way.", "The title made me suspicious, but..\nOuch.\nI am so sorry for you, this will be rough.\nNTA, your husband lacks education", "NTA, this guy has a messed up view of marriage.", "I think the word you're looking for is selfish.\n\nHe's not really useless, as he's apparently paying all the bills.\n\nCalling him selfish would have had more impact imo, because it's true. Calling him useless when he's paying all the bills is kind of eye roll worthy.", "ESH\n\nYou guys created this situation over many many years of divided finances and not acting like a team. If you never acted like a team before, when it was good, why would it be natural to do so now, when it's bad?", "I’d say you’re both Aholes for not working together for the betterment of YOUR family. Marriage is about working together, compromise and understanding. If you both put your stubborn aside you’d find that you’re sweating small stuff that builds and turns into resentment. I wish the best for you all and hope you can equally pull your heads out of your butts to have a truly amazing relationship and life!", "You both sound like ass holes", "NTA. \n\nYour husband lacks compassion- in a big way. I would hit him with the hospital bill you paid. You spent your body and your health and your freedom and then paid the lions share.", "I cannot for the life of me understand how people in these \"relationships\" can call this a marriage... This is more like a really poorly structured business merger NTA and you should either leave, or do the exact same thing to him that he does to you", "NTA\n\nHis response to your already fragile mental state is to pressure you for $5. He is a pig.\n\nIs there nowhere you can go and stay while you try to recover?\n\nMental health issues are a real issue, and there's not enough help or knowledge about how best to treat those suffering. \n\nNot long after my husband and I got together he had a breakdown (not my fault, I don't think), so I paid for everything including the majority of our wedding. He tried to do housework as best he could so that was great. \nFast forward to now he works full time and I am the one who is poorly, and not once did either of us ever say to the other \"you owe me\". If you love and respect someone then you automatically want to make them happy and their lives easier. The fact your husband is the opposite is a concern. \n\nCould his mistreatment of you be a contributing factor to your current issue?\n\nAlso, where is your child? Are they being properly cared for while you're in bed? Does your family as a whole have a support system?\n\nI really hope things improve for your family, and you can get the mental clarity to live a happy life", "NTA. Useless is probably not the right word, but you were angry. Often the right words don't come out when you're furious.\n\nHe's not thrifty, he's cheap. This isn't a partnership, it's at transactional business relationship.  His money is more important to him than you.", "I really don’t understand how married couples don’t merge finances. Like I need to know everything 😲", "NTA and I wonder if your husband is contributing to your mental health problem", "There seems to be a fundamental disconnect here with respect to the nature of finances in a marriage, and (perhaps more importantly) the meaning of spousal love.  It seems that both of you believe that you are individual contractors who happen to be married to each other, as opposed to a team of two people working towards the same goal (whether that be raising children, finding professional success, etc). While married couples can decide the degree to which they comingle finances, this is more of an illusion that an actual separation of money from a legal perspective. However you decide to allocate money across accounts, you ought to be seeing the money through the lens of \"us\" and \"our\", rather than \"his\" or \"mine\". The fact that the birth of your child was seen as an individual expense within the context of your marriage is a worrying sign that you and your husband are not pulling each other up.  \n\n\nSelf sufficiency is well and good, but your husband should want to support your recovery from mental health problems, and you should want to support him in whatever ways you can.", "NTA\nThough the useless comment was probably unnecessary, it sounds like you two need to sit down and have a real conversation about what marriage really means for the both of you. Would you expect him to repay every nickel and penny if the roles were reversed and your husband couldn’t work? \nAny relationship is supposed to be a partnership involving compromise on both sides. Not to mention being supportive of each other when times are tough. It sounds as if he’s not so much supporting as keeping score which is not a healthy dynamic.", "INFO\nAre you sure you're in a relationship and he's not just a dedicated roommate?", "Do you guys still split groceries, dinner bills, movie tickets?", "[removed]", "Get a divorce, this man does not care about you.\n\nYou can’t work but you can file for child support, alimony, and disability.", "[removed]", "Mental illness isn't Santa Claus or the tooth fairy. It's real. People know headaches are real but not a mental health struggle", "NTA and I wonder how much he is affecting your MH.", "Leave him. Fucking hell. NTA.", "NTA\n\nThis guy is absolutely pathetic. It sounds like he still isn't quite sure if he's all in on this whole family thing with you. Or  he doesn't see it lasting forever. Where does he think he's going to go and spend that money without you?", "This sounds like the kind of dude who penny pinches for his wife and kids,but then has affairs where he throws money at the outside women. Because somehow the one at home  is expected to tale his crap and mistreatment, while the APs are only with him. For their own gain.", "Time to flip the script.\n\nSend you husband a bill for the other 25% for the birth of your child.  Also, don't forget to bill him for 1/2 the cost of what a surrogate would cost--in the US that is about $100K, so he owes you $50K for that.  Call it wear and tear on your body.", "Divorce.", "NTA! Also wtf with him? Like did you had that kid by miracle conception or something? That bill should have been pay equally! As it is both your kid! \n\nAlso I cannot fandom the audacity of some men! Like does he had a medical degree or something to actually diagnose or re diagnose your mental health?\n\nBabe he is not your partner! Partners support each other, it seems like a more independent separate individual living together! \n\nTbh do you want to be married with someone like that? He might be a great father but is not a good spouse material", "NTA\n\nI was willing to end up on his side until the third paragraph.\n\nHe's being a dick.  A major episode of mental illness can last for YEARS.  \n\nHe needs to take his head out of his wallet and start being your PARTNER.", "How you guys decide to spend extra money is up to each of you individually. You have no problem spending bonus money on stuff. He will only spend money on special occasions like your birthday. While you did pay 75% of the child delivery costs you also got a bonus that year. He did not get any extra money. Whether he should have budgeted for it aside, this is in line with the spending habits of your relationship.\n\nNow the crux of the argument, you are having mental health issues and he does not believe in mental health issues. You are now not working and he is paying all the bills. He is supporting you in the way he knows how. I'm sure given his financial background this is causing some stress for him. He is waiting to see when you will be able to work again and take some burden off him for the cost of the household.\n\nYou don't mention household duties. Is he doing those too? Is he taking care of your child and doing the cooking, cleaning, etc. while you're trying to recover?\n\nI'm going to hold judgment for now but I will say calling him useless is uncalled for.", "Paying the bills isn't useless, in fact in the current scenario, if you want to throw out those words, I wouldn't say the husband is the useless one....", "You should calculate and itemize all of your expenses for what it would cost to pay someone to do anything you do at home. Then balance that against whatever he thinks you \"owe\" him. If this is his his only moral failing as a partner, fine and i wouldn't call him useless, that's not nice. But if he's not helping, not participating, and thinks it's any kind of appropriate to hold this over you? Fuck. That's fucking useless.", "yta. You've agreed to this situation for your entire marriage. And he doesn't seem useless as a husband.", "NTA. \n\nHe's not being a husband.", "> he doesnt see mental health problems as real problems\n\nThat is certainly going to add to your mental health problems. That's like coming home in great pain, can't walk because your leg might be broken, but he says, \"I don't think legs actually break and you're faking it.\" \n\n\"Completely useless\" is a bit strong, so apologize. But you are NTA for being angry at him. He is the total AH here. \n\nI hope you will find a marriage counselor to go along with your own personal therapy. Up next: he will rage over who is going to pay for all that.", "NTA, make some calculations of all you pay for and write him a bill.", "I'm fairly certain most research on romantic relationships says treating them as transactional and keeping score is a death sentence for the relationship. You can't keep score in intimate relationships, you just operate like it evens out eventually. There are more ways people help and support each other than with money too. But bottom line it is not healthy for him to keep score like this and is ripe for him developing contempt (the killer of relationships) and resentment. \n\nIt seems like he's already down that path. Is useless the best word to use? No. Across this whole situation NTA.", "That's why separate bank accounts = 2 separate and different lives. One is rich and the other is poor and it leads to situations like this.  \n\nVery short description of your \"problem\", so hard to say who is the real asshole, but I'd say it's him because no amount of money should ever come between the one you love.", "NTA. His defense is bs. I grew up absolutely dirt poor, scrounging for food, never having any money for even clothes because every month it was pinching pennies for rent and bills. Now i have a decent job and i have extra money, i love spending my money on my family and friends. I dont have any friends rn but when i did i spoiled them too. I buy my bf gifts just because i can. I buy my sister books cuz she loves reading. I buy my mum things whenever she mentions she likes something. I absolutely spoil my nephew. The only person i dont buy for is my brother but thats because he doesn't want anything. I would never make my bf pay me back if i had to cover bills for a month, thats what savings are for. If hes so frugal wheres his savings? He sounds like a money focused deadbeat imo. I can 100% understand his frustration but to hold it over your head like that? I was out of work for 6 weeks after a major surgery and you know what my bf did? He sucked it up, tightened his bootstraps, and took care of the house. I did have some savings because i knew the surgery was coming but still, when my savings ran out (i was only expecting to be out of work for 2 weeks but i had some mahor complications) he didn't berate me about it.", "Your husband sucks. NTA", "You married a bank, not a person.", "Nta. \n\nIt's understandable that he's detailed about money, but it sounds like he's so scared of losing money that he's forgetting what he's working for. Therapy might help but sounds like he wouldn't do it, so maybe... Find a new way of explaining, have a therapist or someone else he also trusts explain. \n\nPersonality I couldn't live like that. But that's your choice.", "INFO: Are y'all already divorced?", "NTA  \n\n\nPerhaps you could have worded it differently, but you have been pushed to the limits by your husband's miserly transactional attitude to your life together. The fact that he doesn't believe in mental health issues is a big worry, on top of the financial aspect.   \n\n\nNow that you have calmed down, read through the (helpful) comments and gather your thoughs. Sit him down and have a rational discussion about how he see's this playing out.   \n\n\nI hope you find somthing that gives your mood the upturn necessary for you to find your motivation in life again. Once that happens, you might be strong enough to advocate for you and your child's happiness too.", "NTA. How can you live with someone like this?", "Run away", "He’s the AH for how he acted, but OP calling your husband useless makes you an AH too.", "You know, I am also very calculated with my money and where it goes. If someone borrows money I do expect it to be repaid but understand I should only give what I am okay with losing. That being said, partners are WAY different. You can do a payback method like this just fine but to be THAT anal about it is ridiculous!  \n\n\nDoes he not know how a marriage works?", "NTA\n\nYour husband sounds like a tool. He chose to marry you and have a family with you. If he didn't want to take care of his family, he shouldn't have started one. Would he be tracking every penny he owed you if he was the one not working?\n\nYou really should calculate a working rate for all those hours you carried your kid, because he was at least 50% responsible for that situation and all the wear and tear it involved. He might even owe you some money yet.", "ESH. Marriage is a partnership. I don’t get couples that don’t split the house money. You both created a toxic environment by creating this tit for tat relationship with money.", "So you married a cheap man and didn’t think to discuss baby finances with him? Never occurred to you? ESH", "I am deadly serious when I say leave this man as soon as you feel up to it\nHe is a useless husband, worse than that he’s a pretty useless person.\nFuck that guy.", "NTA - but I don’t think you should have called him useless. Selfish, but not useless. Did y’all not say, “for better or worse, in sickness and in health”? Let’s call him what he is, a selfish tightwad! Tell him he still owes you for 1/2 the 8 months of carrying the baby, another 25% for the delivery, 1/2 of 3 months family leave, and anything else you can add to it. Honestly! Good luck!", "Strictly speaking - and I do mean **strictly** \\- yes, YTA for calling your husband completely useless. He's footing the bills, he's covering things while you're taking some time off, and it doesn't sound like he's some leech sitting on the couch 18 hours a day while sleeping for the other 6. \n\n**BUT.**\n\nYour husband sounds like a fuckin' loser, at least in terms of a quality partnership. I always get riled up about spouses with separate finances because you only ever hear the horror stories about it, and this one stands out in a crowd. The fact that you even divided the cost of your goddamned *childbirth* irritates me.\n\nI get the whole idea of growing up poor / thrifty and the lifelong impacts that can have on a person (call it a learned behaviour, trauma response, whatever), but if your husband is so transactional that he wants a $5 reimbursement for a nibble of food it might be worth taking a step back to re-evaluate whether he loves you enough to part with five fucking dollars.", "NTA, but you’re married to the “useless” guy, so what does that say about YOU? When you get married, two become one. Not trying to be mean, but that’s that. \n\nI’m sorry, but you ignored all of the red flags. You two need to get counseling and see if you can save, what little bit of your relationship is left. \n\nThat guy is incredibly selfish. I’m not even going to ask what you saw in him, when you two got together. He’s almost certainly been selfish his entire life. Unfortunately, some people are that way.", "Nta. That's marriage. Sometimes one spouse has to pick up the whole expense. He needs to grow up and understand he's in a partnership and start acting like it", "NTA but I cannot imagine a marriage where you would have to owe each other money??", "NTA, if he wasn't well & couldn't work, no doubt you would support him financially & not expect the money back, that is what being in a marriage is all about, supporting each other. He needs to realise at this time while you can't work, he needs to be supporting you & not putting the added stress on you of having to worry about paying him back the money he thinks you owe him. If you want to keep your finances separate, that's fine & your decision, but he shouldn't be making you feel bad for him supporting you at the moment.", "NTA. Perhaps name calling isn’t kind but what he’s doing is far worse. If he’s doing this after ten years and a kid together, he is unlikely to ever change.", "NTA but Y T A to yourself. Why are you married to this absolute trash of a human?!", "You aren't married. You have a roommate.", "NTA\n\nMaybe calling him useless was just wrong thing to call him.\n\nFrugal uncaring AH might be more appropriate.\n\nBeen with my partner for 16 years, not married but comitted. We combined accounts when we bought our first home together. It's just good sense. \n\nAt the very least have a separate joint account for bills & expenses.\n\nBut this guy just sounds like a complete AH. \n\nI wouldn't put up with that crap personally. It's ridiculous.", "NTA you are living in hell, you are not married you are a roommate, I’m legitimately praying for you and I’m not even religious….", "Yes.", "NTA.  But this is a perfect example of how separate finances become a nightmare. As long as both people make about the same, have similar spending/savings habits, and nobody ever gets laid off or sick things can work okay.  Change ANY of those items and it all immediately falls apart with people having hard feelings.  It's very hard to have a successful \"we\" when every cent is \"mine\" and \"yours.\" And it boggles my mind the birth costs weren't even split equally.", "NTA\n\nso much for working as a team. This man does not care about you", "I only read the title,  but that’s enough to decide if you’re an asshole or not…..and you are. You should never call people you care about useless, or anything like that. It can affect their self esteem, confidence and their mental health.", "NTA.\n\nHe doesn't deserve you. Its unfair for you to give wholeheartedly while he's being unreasonable and counting every cent. You deserve sooo much more and someone who will reciprocate your efforts without you even asking. You definitely don't need that kind of stress. There's plenty of examples I can mention from your post but even with his own child? Damn.\n\nThe growing up poor is a ridiculous excuse which he has been using to leech off of you. If you are feeling petty and can play his stupid games, sure go ahead and mirror his actions, count every penny and don't pay a single digit more and make sure he refunds you the 25% hospital expense that you overpaid. It's hefty work if it isn't something you're used to doing.\n\nIf you're not that kind of person or don't want to take on the extra load of doing all that work.. why entertain him?", "You better have brought up that 25%!!!", "He must have a golden dick because he acts like one. Good god. Is your relationship only transactional? I’m guessing he owes you in other departments. NTA", "My wife and I have always combined accounts; even before we were married. Once she was pregnant, she said she wanted to be a SAHM and I agreed. For 5+ years, she stayed home and all my paychecks went into the shared bank account. She took what she needed and what she wanted from that. New makeup? Sure. Lunch with some friends? Yes, get out of the house and take a break. We've never fought over this or made someone take anything other than shared money because, in our minds, it's how it's supposed to be. \n\nNTA but your husband sure is.", "So you paid 75% of an exorbitant hospital stay, and he paid 25%?\n\nI'd go back and calculate how much he owes you for the additional 25% he should have paid. \n\nAnd then you can start subtracting your food delivery fees from the likely tens of thousand that he owes you!", "I'd send him a bill for how much surrogacy costs. \n\nPut him in the bin 🚮\n\nHe doesn't care about you.", "NTA. I think it’s about time to bill him the outstanding amount for that hospital bill you paid 75% of. Keeping finances separate whilst married us fine I massively disagree with all those comments saying it’s not. However you do need to support each other and he isn’t supporting you right now with detailing out what you will owe and actually expecting it to be paid back!", "Why are you with this guy?\nIs this what you hoped for in a lifelong partnership?", "He is completely useless though. It is what it is.", "He doesn’t get to believe or not believe in mental illness. It isn’t Santa Claus. He’s a shitty person and non-supportive of you. Can you imagine if your kid ends up having mental health issues? Girl, run.  NTA unless you stay with him.", "NTA. What a guy...", "That's a roommate ma'am. Not your husband. Praying for your recovery and exit plan at the soonest because you deserve better.", "NTA- you’re depressed and that doesn’t make discussions about money (or anything) easy. You probably could have not called him names, and maybe the most productive way to work out how to properly navigate finances between you would be in counselling. I definitely think divorcing him would be jumping the gun a bit", "Absolutely NTA.\n\nI was recently off work for almost 3 months due to a major depressive episode. My husband told me to take all the time I needed. He paid for most things without me even asking (I was out of sick time so not getting paid). \n\nYour husband is being a dick for not acknowledging and validating your mental health issues.", "NTA. Sounds like financial manipulation. Leave him. Your mental health may improve.", "NTA.\n\nYour husband needs counseling.  His insistence that his WIFE has to absolutely pay him back every cent is insane.  Literally.", "No way would I want to be with someone who is that calculating about our shared finances.", "Bold of you to call him useless when you’re the one laying in bed all day and not working.  I’d be upset too if I had to pick up your slack", "ESH. You both sound like bad partners with weird priorities. Keeping score is never good and that’s what you’re both doing.", "I am sorry you are going through some mental health challenges.  Your husband needs to be educated that mental illness can be as debilitating as a physical illness.  I know, because a 12+ years ago, I was diagnosed with major depressive disorder and was hospitalized and out of work for months.\n\nI think your financial arrangement is a bit troubling.  I don't see how such an arrangement will work as you both become older.  After all, you aren't roommates, your spouses.  Surely, you need to renegotiate what that means when one spouse, like now is debilitated.  Your husband expects you to repay him for anything covered during your illness?\n\nWhat happens, gods forbid, if he is in a major car wreck and needs surgery...and if he wouldn't be able to work again?  How is he going to repay you?\n\nI could not live under such a financial arrangement.\n\nI don't know if you are in a place emotionally to negotiate a new financial \"treaty\" with him.  But, I can say I don't see the current arrangement being viable for the future as age brings its infirmities.  Or in light of some other calamity.\n\nIn time, I believe you will need an arbiter to guide you both through the financial stuff.\n\nA married couple characteristically works together in such things.  The two of you together form a new family unit.\n\nI send you my prayers for your restoration of your emotional and mental faculties.  Perhaps, this is what you need to work on first before tackling this marital problem.\n\nMay your God bless you.  And may God bless your marriage with a new commitment to each other.\n\nYours, Shiva", "Wwwoooowwwww\n\nBoth of you are living like roommates, instead of a married couple.\n\n how could you stay in a relationship like this? \n\nit's best that you separate, because this doesn't make no sense\n\nAnd even if you stay, treats him the same way when he's going through his trouble times...", "I view marriage as a combining of worlds. What's mine is his and what's his is mine. The separate account thing followed by his behavior is a huge red flag for me. NTA. You SHOULD be helping each other through life, but keeping IOU's.", "Your husband sounds like kind of a dick. I'm not saying this makes him a bad father or person but it's time he works through his issues with money before they get along to your child. That's some bonkers shit when you read it, right? \nDo not ever let anyone - anyone,maybe especially your husband - that your mental health isn't a real issue. It is the absolute most important thing. Love to you, take care of yourself. ❤️", "ESH. I mean, honestly. You have a child now.  You cannot realistically continue to split finances.  It just doesn't work with a kid in the mix.", "I didn’t even have to read your post to know your in the wrong. Calling anyone useless is wrong and you need to look in the mirror.", "NTA and tbh I'd dump his ass. The money is a big no in my opinion, and him calling you lazy is another big no. Show him the big hospital bill you paid for your child! What an asshole.", "NTA, sounds like your husband is useless", "If you feel someone is useless, you probably should find another partner. \n\nNTA but don’t stay in such a bad relationship. Get a lawyer and get rid of him.", "Divorce him. I can't believe you stayed married for 10 years, you have superhuman patience. NTA.", "NTA my husband and I split everything 50/50 which a lot of people don’t agree with but it works for us and we don’t have a kid. I think that makes it harder to be 50/50. But also we both work and have similar salaries. \n\nAre you in therapy? I hope you are getting the help you need", "Does anyone remember this thread from yesterday https://www.reddit.com/r/AmItheAsshole/s/PDJOX21IHQ .... apparently not.\n\nThe double standards in this subreddit are truly unbelievable.", "NTA you realize he's going to be this way with the kid too right?\n\n\"Why do you need more than 20 bucks for school supplies and clothes for the year?\"\n\nThe dude is going to present the ledger for every red cent he ever spent and present it the moment it's legal for your child to obtain employment.", "NTA.\n\nYou're unwell. Not only does your life partner see you as lazy by dismmising your mental well being but he's sees you as a financial burden.\n\nI do believe having some finances separate is important, because sometimes you want to treat yourself or you need an emergency fund. However, you're married, you live together and have a child together, you have shared responsibilities which means sime things need to be shared for the collective good.\n\nCaring or providing for your partner when they cannot support themselves is not only an act of love but a bare minimum of what it means to be in a committed relationship.\n\nI hope you feel better soon. Try to make time to discuss how you're feeling with your partner, about his dismissive attitude and his 'keeping score'. You're supposed to be a team and if he's more interested in 1v1 situation, it's time to say goodbye.", "So if you’re not working, shouldn’t you have plenty of time to at least cook? What type of mental illness prevents you from warming up stouffers lasagna in the oven? Sitting around doing nothing will only perpetuate your mental problems. \n\nHave you considered that maybe you’re projecting on to him how you feel about yourself? I felt useless during my bout of mental illness, subsequent unemployment, and overall laziness. You couldn’t even drive to pick it up? Really? Yeah you are the AH here. \n\nThis isn’t about who paid for the pregnancy 10 years ago. This is about right now. And it sounds like right now you’re on Reddit all day, not working, and not pulling your end of the two way relationship. You need to be doing more than trying to get our favor, you need to help yourself.", "justified asshole, so nta. shouldn't have called him useless but should have called him selfish and an asshole", "I need someone to explain this trend of married couples keeping individual finances to me…if you don’t trust someone enough to share finances, why would you marry them? NTA but this situation did seem avoidable by just joining your family income from the day you got married", "NTA he's not fulfilling his role as your protector. Dump him.", "You are single", "\"his money\" \n\nYou guys are already fucked up.", "NTA. calling someone names isn't good of course, but you're right. it's in the vows for a reason. i won't comment on your guys' decision to split finances. i personally disagree with it, but i know people who make it work. remind him of the vows. if he has beef with it, maybe you guys need to get a professional outside perspective on y'all's situation.", "NTA Never should've married him, sorry. Tons of people grow up poor but are still giving and caring, he doesn't care about you.", "NTA.  Your husband's attitude towards mental illness and, by extension, you is very unhealthy.  For the sake of your mental health and well being, you may want to look closely at someone who not only behaves like a miser to you but also thinks you're \"lazy\" for having mental health issues.  As well, sometimes being around people who are not good for us can exacerbate such issues.  Perhaps it's time to look at that with regards to your husband.\n\nI wish you all the success on your mental health journey.  Hang in there.", "NTA\n\nMaybe give him an invoice for your pregnancy, if he cares so much about fairness, the least he can do is pay you min wage for the duration of your pregnancy. 40 weeks comes up to $50k approx. So have buddy boy pay you that and then you can give him $5 for his food.\n\n\nI'm sorry this is your life. Your health, mental or physical, is important and you need support from him rn.", "NTA. Coming from someone who has been out of work all year due to multiple chronic illnesses, I can honestly say that my husband has yet to complain. The whole “sickness and health” part of the vows thing. If he’s going to make note of everything he spends for the household, he qualifies as useless as a husband. If the tables were turned and he was the one who was unable to work, he’d likely expect you to pick up the slack without complaint. Marriage is a partnership and when one partner is incapacitated, the other partner should be willing to support them until things get better.", "Ehs. A marriage should not be transactional. My wife and I had separate bank accounts when we first got married. It became really complicated. It's just easier for us to have one bank account. \n\nHe sucks for making your entire relationship transaction. You suck for putting up with it for so long. You should have put it into this as soon as your child was born if not before.", "This is a very weird marriage. I get keeping money separate and splitting bills like mortgage, electric, etc. but to have a repayment plan within your marriage seems very odd to me. NTA he is just focused too much on money and not enough on his families wellbeing.", "I'm going to say NTA in view of the overall situation, but calling him \"useless\" was a bit over the top.  After all, he's working and you aren't (through no fault of your own.)  However, I admit he shouldn't be so stingy about his money when it comes to his own wife and household.  Expecting his own spouse to repay what he's put out for her is way over the top.  After all, that's what spouses do ; support each other, financially as well as emotionally.  I understand he grew up poor and was forced to be stingy at the time but that's not the case now.  Who knows, at some point the situation may well be reversed ; you'll recover and be back working and he may be medically unable to work.  Then, you'll be carrying him financially.  Everything in a marriage is not 50-50 every waking moment ; there are times and circumstances where one spouse carries more than the other and it fluctuates back and forth.  Over the long run yes, it works out to about 50-50 but again, not all the time.", "Yea this isn’t right imo. My wife and I have a joint. I have my own account that I get some money that I can use. Otherwise if I were left to my own devices it would be gone. This to me sounds like financial abuse and it’s not healthy.", "Very frustrating and cold that he doesn’t sympathize with your mental health. Regarding the money situation, you knew exactly who you married in that respect, and should expect that response from him. However, it doesn’t mean that you can’t or shouldn’t openly discuss your feelings on both matters. Sometimes simply sharing your perspective gives the other person a different view. Mildly TA for resorting to insults, but I get it.", "NTA. it’s astonishing how y’all will marry just about anyone. hope you leave him lol", "You need to tally up what he owes for his half of the birth hospital fees and all the other things you've paid for over the years when you were the one covering the bills. Then tell him how much he owes you and tell him he can pay you a set amount per month till its paid off. Or he can deduct what you 'owe' for bills out of what he owes you. \n\nBut make sure you add up all the things you've paid for him and times where you've paid for him instead of splitting a bill etc and all the times you covered the house bills for him etc. And especially the 50% of the hospital bill. Make him aware of exactly how much you've paid for him and then tell him he's a cheap barstard to say you owe him £5 for food delivery, and if he wants to be that tight and particular, he needs to pay you back for all that you've covered for him. \n\nMake sure he pays you it ALL back. \n\nAnd tell him he's not to utter a word about you being 'lazy' because he has no concept of mental health, and he needs to research it more rather than being a judgemental, unsupportive, AH. That you've supported him when he's needed it and now you need support he's being a complete arse. \n\nMake sure you get every penny back you are owed from him ASAP. \n\nThen look at filing for divorce. He doesn't love you. He doesn't appreciate you or what you've done for him in the past. There's being careful with money, but it's still got to be fair and equal. If he's happy for you to pay for everything for ages then he needs to be willing to step and do the same when needed without question or pay back. He can't have it both ways. \n\nGet back every penny and then divorce. That's not a loving relationship.", "NTA but what do you get out of this marriage? He's not willing to help you but is ok with you helping him. Honestly now might be a great time to talk to a lawyer because I don't see this getting better", "You both suck. \n\n\nThis has to be the most financially toxic relationship and I don’t know how you have both made it this far treating the marriage like a business venture where you keep track of every cent earned and spent", "NTA - but side note - you probably shouldn’t have married this guy. Money differences  is the second largest leading cause of divorce in America. If you financial views are as different as they seem here then you should have never gotten married. \n\nMarriage is a full commitment to be life partners for better or for worst. To always be on the same team and that any win is a win for the family and any loss is a loss for the family. \n\nMy wife and I share every penny. Every financial decision is made together, any bonus celebrated and saved together. If you guys were truly in love then he would want the very very best for you no matter the cost.", "NTA\nHe is not behaving like a partner at all.", "NTA, he seems pretty mentally ill for someone who doesn't believe in it.", "I do NOT understand why some married people keep their finances totally separated (practically splitting up who pays what bills or having separate spending to keep gifts secret is different), but you’re presumably sleeping together, sharing a house, sharing children for gosh sake, why are you so “mine mine mine” with the money. Do you have separate cabinets and dishes too? Lest someone use your dish, or you have to clean a dish that a freakin beloved family member you *chose* to live and die with used?? This just screams transactional relationship to me, I don’t get it", "There's nothing like a cheap partner that always has to skimp or whine every time they spend something, show him how expensive a divorce would be sis 👍🏻", "ESH. \n\nHe’s an asshole about his accounting practices in a marriage.   If you aren’t combining resources and facing things together as a family, why even be married. \n\nBut, telling someone who is paying all the bills while not being able to work or contribute (no matter what the circumstances are) that they are useless is still asshole behavior.   \n\nAnd all the people telling OP to get divorced are omitting one very important aspect of things.  If you can’t work, how are you going to survive?  Survival in modern society takes money or income.  And it doesn’t sound like OP has very much money nor income either.", "Nta, this is not a marriage. It's a roommate or a business arrangement. How have you gone on this way for so long? Oh and marriage is in sickness and health for richer or poorer. There doesn't seem to be any of that either.", "NTA that’s a roommate not a husband", "NTA \nWomen why are you putting up with him honestly he is not a shitty husband but a poor excuse of father too. Like  does he even see the child as his own or what.", "ESH. This whole set up isn't any good. Are y'all roommates? Even my roommate wouldn't ask for $5 back with the kind set up you have. You were trying to hurt his feelings so you called him useless and that's hurtful. That would make you an asshole. Nevertheless, you have a legitimate issue you need to address- just have to do it in a mature manner.", "Wow, I was ready to skip the story and judge based on the headline because that level of disrespect is terrible for a marriage. However, your husband is an AH. After 10 years, be hasn't come to understand you're a team? What a complete jerk. You could add up all he owes you, to cancel out his running balance, but this goes deeper than winning this argument. Is this really who you want to spend your life with?\n\nNTA", "Useless wouldn’t be the right word, careless is more apt. I’m so sorry, but he needs to learn what it means to be together in a relationship. He’s in a team", "He's not useless he's selfish.\n\nThis is Exhibit A why you can't keep finances totally separate in marriage.  Why get married, just stay roommates with sex.\n\nI can't even.....", "He is def a score keeper but since he is paying all the bills, that would in fact make him not useless. ESH, him for being stingy and you for not working. You have a kid you don’t have the luxury of mental days.", "NTA- I came in with one opinion based on the title( Calling my husband useless) but the description has given me a full 360. Useless is a mean thing to call someone even in a dirty fight. But in this case  he’s not useless. He’s a miser who apparently doesn’t care for you. What you describe is unbelievable. As husband and wife you look after each other. In the end of the day he feels that he is the inferior in this relationship, Which is of course  inaccurate, If what you describe is corecct then you can feel as an inferior. If i was you I would go out of this relationship.", "YTA. I say that with confidence solely because poor communication isn't conducive to relationships or mental health. Instead of outlining a clear and concise argument about the situation you caved in to responding irately with an insult that serves only to shut down communication and exacerbate the argument. Mental health or not, that's always a non-starter.\n\nBe clear on your position and your expectations and don't throw low blows if you feel unheard.", "Honestly I think both of you are guilty. Not combining money has led to this. You set yourself up for it. Marriage is a partnership not a roommate situation. By not combining incomes you have set yourself for being selfish and separate. I hope you get through this mental health crisis. I've been there. I'm glad my wife and I have a combined marriage financially. Otherwise we'd have gone through this as well.", "At first, I was tempted to say yes, that we should not belittle our spouse.\n\nAnd then I read what you wrote and completely changed my mind. 💯 NTA", "I'm not sure I could ever have a partner who Nickel and dimed me.  \n\nI don't think that has anything to do with growing up poor.  My dad grew up in deep poverty, the kind of which would be hard for most people to grasp.  He is smart about his money but generous.  \n\nI just think some people are miserly like this.\n\nNTA", "His penny pinching ways made me raise an eyebrow, but him not treating mental health seriously and calling you lazy was what did it for me. He is 100% the asshole, he should stop caring so much about money and start doing what he can to help YOU! Mental health is so important and his indifference to it, truly does make him useless.\n\n  \nNTA", "NTA this is not how marriage and partnerships work. You two are supposed to be a team. Helping each other through times like this.", "You're kinda TA to call him \"useless\". Your husband clearly has his own stresses. The majority of this honestly sounds to me as though you too both cannot communicate with one another.\n\nI don't say that to marginalize your experience because it too is real. Be kind.", "He's useless and selfish.  He was happy to take advantage of you when you were making more money.  You should tell him he should pay back every dime if that's how he is going to be.  I bet he'd be happy for you to support him if he was sick or injured, too.  What a trash person.  NTA.  Long-term, I'd consider if you want to stay with someone like this.  But put your health first.", "NTA", "Definitely NTA \n\nThat \"pay me back\" mentality is so toxic in a partnership. My ex wife was the same way and it destroyed our marriage. She made more money then me and trapped me in the limbo of always asking for my money to pay her back for literally anything she would spend money on, then get mad at me for not having more money. She made me feel worthless for not making as much as her and it was incredibly destructive to my sense of self worth. He needs to get it in his head that when you're partners you never owe each other. You both bring what you can to the table and make it work and help each other when needed. Especially if you're having a mental health emergency. Thats not something you should ever be made to feel bad about. He's the one who is supposed to be lifting you up through times like this. I really hope he can figure out how to mature with this because if he doesn't it will definitely way on your relationship heavily. \n\nDefinitely wishing you the best of luck with him and your mental health. Don't let him make you feel like less for having a hard time.", "Nta\nWhy exactly are you with him? What does he bring to your life,?", "This is a difficult one. For one. I've been married for 20 years and we have always just shared the expenses. I grew up dirt poor and that is no excuse to be an asshole about money. Secondly...mental health is a reason not to work? Sense when? I'm sorry but my son is autistic, has a brain malformation, adhd and many other issues and still works. I'm kind of on your husband's side of things about this. Is he useless, absolutely not. I hope whatever you are going through resides. Me and my wife have both been the bread winners in our home and we have both been through a physical situation where we couldn't work..me with 4 back surgeries and her with several different types of surgeries. Matter of fact she is in the hospital right now after having an esophagus stent in place. Neither of us would keep tabs while the other was going through something as such. Are you an asshole for calling him useless if you have separated money for your entire marriage. The answer is yes you are. Is he an asshole for not taking care of his woman without worrying about money, yes the fuck he is. Sounds like the two of you are just asshole people to be honest. Lmfao", "I strongly disagree with the approach of any married couple that “keeps finances separate”. Legally that is not even true, and it really cuts out the hard work of making sure everyone has their needs met while you work at the big picture together. Idk if useless was a good choice of words, but you two obviously have that hard work yet to do in your relationship. I have called my husband many things I regretted when we had arguments, but I suggest you really really focus on  the problems that made you blurt that out…and get back to being a couple and a family rather than roommates who divvy things up 50/50.", "NTA\n\nI understand worrying about contributing equally, but he's taking this to an extreme. You paid the majority of the medical expenses for the child you BOTH made. You deserve the reprieve for your mental health without being dogged for money.", "100% NTA \nYour husband seems to think that either there's no such thing as mental illness/ mental health issues and is being an insensitive bully. He evidently fails to understand that these are real issues, which is something that you're trying to take care of. Sounds like he's been extremely unsupportive and absolutely doesn't care about you. He's not valuing all the work that you've done in the past, and even now, and for him to say the things that he's saying to you are absolutely atrocious, and my highest advice is to leave him. I pray that you've been able to keep your finances from your work separate, so that he can't get at it, and I pray that you can do whatever you need to do to keep your children safe.", "Well since you think hes so useless, you should divorce him. Seems like youd do fine on your own considering how useless he is. ESH", "i think people are kind of missing a big detail here. what are you doing to improve your mental health? how long has this been going on? because if he is picking up all the slack, paying all the bills while you lie in bed, that could be extremely stressful and draining for him. and you are piling on and calling him useless when hes the one running the household by himself? you know how many people suffering from mental health issues are dragging themselves out of bed every morning because they HAVE to because they have a family to support and food to put on the table. it sounds like a luxury to me that you can just stop doing this and spend time just working on yourself with a husband that will pick up the slack. maybe he is insensitive but it sounds like YTA to me", "He's useless, but he is the only one working, paying all of the bills, and taking care of the kids?  Meanwhile you are jobless, having mental problems, and bedridden?", "Does no one use the old wedding vows of, “For Better, for Worse, for Richer, for Poorer, in Sickness and in Health”,  To Love and to Cherish.  This excuse that he grew up poor and that is why he acts like he does.  My dad was first generation here in the US, as a a small child and a young man he worked as a migrant worker along side his mother, brothers and sisters, all his money went directly to his father for the family, until he went into the military.  My dad never ever treated my mother with such obvious contempt and distain.  For sickness, this is 2023 not 1920 where there was no education or information regarding mental health issues.\n\nPlease talk to your therapist, some of your issues maybe wrapped up in this so called husband.  I don’t advocate for divorce because I believe in my vows.  But I would never put up with garbage from someone who promised to love me.", "NTA omg I wonder how much of your mental health issues stem from this piece of work not treating you like a real life partner! Please know that you don't deserve to be treated this way. It's NOT ok that he's asking you for money back, don't let him gaslight you otherwise. \n\nMy partner is the same way with his friends and when we first started dating, counting to the cents. But once we've gotten more serious we have an understanding that we're a unit and shouldn't take advantage of each other. He still likes keeping track of things so we have a spreadsheet to keep track of both of our expenses - he wants to be fair. And he never made the calculation so that he doesn't need to pay as much as I do, even though I do bring a lot more income home.. which I feel bad sometimes but he insisted.\n\nAnd no coming from a less privileged background doesn't give him a pass. In fact I noticed that the more difficult my friends' upbringing was, the more generous they usually are. Because they understand the importance of it. Your husband is just greedy.. and useless. If you want more money go earn more yourself, not take advantage of your spouse!", "Your mental health issues may be directly related to your marital issues. NTA", "NTA.He is useless.\nExtremely so. How awful. I'm sorry.", "He might be your husband, but he’s not a partner. Score keeping like this is not what partnership is about. NTA", "This...perfect response. OP...you dont have a marriage...you have a business relationship. Time to see a lawyer.", "I've never understood separating money, though it works for many. \nMy husband and I each had our own little savings accounts around a thousand, but everything else was in a joint account. He made twice my salary.\nThen again, we agreed on spending habits and budget", "growing up “thrifty” isn’t an excuse to be so weird about money - especially when reaping the benefits of a spouse who spends on them.", "Yeah, this is really strange behaviour.\n\nMy partner and I keep finances separate but when we fall on hard times we help support each other. About 6 years ago my job was made redundant so he helped take on my mortgage repayments for about 3 months - I paid him back, but it was never expected. \n\nAbout 18 months ago he took on an electrical apprenticeship which reduced his income significantly - we're talking by about 75%. Since this was something he really wanted to do, I continued working my crappy job so I could help him with his mortgage. \n\nThere's never an expectation to be paid back.", "Splitting the finances is what makes it have to be transactional; if you're not bookkeeping to ensure spending parity, then one spouse is taking advantage of the largesse of the other.", "I know.  It blows my mind.  \n\nBack in the early 2000s my husband and I weren’t even married yet when his company downsized and he unemployed for 18 months.  Stressful yes.  Money tight yes.  I paid for the majority of bills, house payments etc. I never once considered asking him to reimburse me.  We are partners, a team.  We’ve been married for 17 years and I can’t imagine nickeling and diming each other this way.  It’s gross.  \n\nI grew up really poor (no food sometimes, no utilities sometimes, etc) and was able to find a way out and become financially stable as an adult and eventually make a really good living but that worry over having enough money kind of never leaves you.  It’s like this imbedded trauma.  So I can relate a bit to having a weird relationship with money sometimes.  But any angst about that I sort out internally with myself, not transactionally with my partner.", "I completely agree. \n\nI am in the process of leaving a decade long relationship for a variety of reasons, but one of the reason I knew it had broken down to past the point of repair was exactly this. Everything started to become transactional when it hadn't been before. Suddenly things became his or mine instead of ours. It's not healthy long term.", "I agree with this. My bf and I usually take turns paying for dinner, or when I'm at his house (he lives with his parents) he'll usually buy me frozen dinners to eat. But it's never like \"okay you owe me $4 for taco bell and $10 for gas since I drove.\" That's just shitty", "I think there's a balance: counting money doesn't matter if you're both taking care of each other (I'm so happy you have that!). It can however be a major problem if your partner has financial abuse tendencies (like OP's husband). For example, my now ex earned the same as me, I saved and bought a home, he lived with his family and had no expenses. When I paid it's cause I \"owed\" it to him, if he paid I needed to cover my half, he never contributed anything but stayed in my home 6days a week. This became a major problem, I now had a mortgage, bills, and a budget. He manipulated me to cover more of his costs and ignore my budget so he could \"save\" to move in. In the end he never moved in or attempted to save money. I felt so unstable and though he was the only thing protecting me, in reality he was the problem and took advantage of a vulnerable time in my life.\nFunny thing is when I dumped him he claimed he spent all his money on me, that I was a leach.The fact that my finances stabilized without him is proof. If I had been more transactional I would have noticed his behavior sooner. Seems like the OP is having a similar experience, he thinks he is owed nice things from OP, he could never fathom that love is a reciprocal thing, love is about him not them.", "NTA…I’m with you!! I don’t get either!! Not to mention as an at home mom I’d be screwed if we did things his way!! \nYou’re supposed to be a team working together for the good of the relationship!", "I’m the type of person that take it to the extreme and do a full accounting of who paid what for 10 years. Let’s make it actually fair. Who really owes who", "Every single married friend who fights over bills has separate accounts.\n\nIt just hardly works. Have so much more buying power if you put it all together. Makes no sense", "[removed]", "Well said. They are not partners. Partners support each other and yes when they have kid it's not hers and his finances it's their finances because kid usually doesn't care from which account the diapers are paid.  \n\n\nHe's a parasite. He's happy to take OP's money but when suddenly it's his turn to provide he's acting like they are not even married.  \n\n\nFuck that guy.   \n\n\nNTA,", "My ex wife is having complications post birth. We're not together any more and I've offered to pay if she wants to go private to fix them. It's the least I could do - I didn't do the pregnant / birth...", "He’s a husband but forgot about the ‘in sickness and in health’ part", "Actually complete finances is the only way to go, but you have to have a clear understand, who will be paying what", "It sounds like he might have some trauma related to growing up in poverty. It probably wouldn't do it, but some honest effort and professional therapy might salvage this relationship.", "With her mental health issues it would not be a good time to see a lawyer.", "Finances, Sex, Children, Religion...\n\nHow people marrying without agreeing on these things escapes me.", "I like Greg.", "how do i cite greg in MLA", "I feel like this level of nickel and diming is worse than that. Roommates treat each other better than that", "Selfish tightwad comes to mind", "Damn, that's a good one. You made me exhale slightly harder than usual through my nose. Kudos!", "I think she should include all of the expenses that no one has to pay for bc she's doing them (any cleaning, intimacy, childcare, etc)", "This is a very underrated comment. I hope OP takes a minute to do this for herself", "You definitely have an opinion on how you think it would read, why don't you tell us what that is?", "Me and my wife have separate finances (we have a common account where we put a certain amount every month for family expenses)… it works if you are not obsessed over who paid more!", "He has “different attitudes” but doesn’t mind when she’s the one covering all or most the bill? Idk I personally would call that hypocrisy, not a “different attitude” toward money. I have met some people who are 50/50 types but they are quick to reimburse someone just as they are quick to ask for reimbursement. This guy wants his cake and eat it too. Couples counseling won’t help because he IS useless and divorce is the best option here.", "The only sane answer so far. I just wanted to write down something similar.", ">I'm sure you knew he didn't think mental health was a thing (not something that goes under the radar in this day/age\n\n\n\nThey have been married 10 years. There isn't any \"in this day and age\"", ">You have an agreement. Your sickness doesn’t void the agreement. Lots of people have mental health issues issues and still work. Stop being lazy.\n\n\n\nReally? \n\nThe woman who has made more and pulled more financial weight than him is lazy? \n\nYou need to stop smoking whatever it is you're on.", "Just to clarify ive worked since I was 17. This is the first time in over 21 years I have not worked.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Even business relationships should be mutually beneficial...", "I said roommate but even they treat each other more generously", "We have separate finances, but we take turns supporting the other when it is necessary. Husband kept us afloat while I was doing school for a career change that would make me a much better earner and happier in my profession, I've kept us afloat when his new business failed due to the pandemic. We've had our fair share of mental health issues, and while things have not always been easy, and sometimes really hard too, we have each other's backs. We take turns paying for food or door dash but without really keeping track. I spend way more on household stuff because I care about living in a nice home, he does more chores because my job is stressful and I do 24hr shifts. Yes, we've fought about money, especially since he took a job that he is overqualified and underpaid for, but that's a self-esteem issue with him and we're communicating about it in a way that I feel heard and he feels uplifted instead of pressured (hopefully lol). \n\nMy point is, money is an issue in most relationships. What makes or breaks it imo is whether both approach the situation as a joint effort for their shared project of marriage. I would go insane if my husband asked for 5 quid back, and I would never do that with him. We both keep a rough mental tally of who's done and paid what and take action accordingly so the other doesn't have to ask \"hey, can you take this one?\"\nWe also come from very different upbringings and social classes, I grew up upper middle class while he grew up pretty poor. I always think, if we can do it, hot-headed and strong-willed as we both are, surely most other people can, too.", "My partner and I keep separate accounts, but it’s because we bank differently. I love autopay and they despise it, so we decided not to mix money. We’re not married and don’t plan to be, but it’s a long-term committed relationship. \n\nHowever, we have complete transparency about earning/finances and agree on spending and budget. We both agree that the goal is to make sure everything gets paid and we both feel good about it.", "If she had a joint account with this guy he would be questioning every cent she spent from it.", "Me neither. Me and my wife are married for 3 months now but we lived together for almost 4 years prior to our marriage and i handle the finances cause she said it's better if i do it. I make double what she makes at her job and i told her to keep the money that she makes to do what she wants with it since everything else related to bills and food is covered and she opted to save her money in case of rainy days. Whenever she wants to buy something or just needs money for anything i just hand her my card. We don't keep our finances separate because i really don't see the point. We're married, we're a team, so of course we're sharing everything.\n\nOn the other hand she has a sister married not sure how long but pretty long from what I saw and they keep their finances separate. I think it really got to a point where she and her husband are competing who makes more money. I see that their marriage is terrible. She works a lot and he's barely at home. That's not a married life.\n\nEdit: Also half the furniture that we replaced in our apartment over the years was bought by her with the money that she saved from her job. And now she said she wants to replace our kitchen furniture and appliances once she saves enough.", "\"especially when reaping the benefits of a spouse who spends on them.\"\n\nBut it seems like that was OPs choice to do that, not that husband was asking for. \n\nI've met people that bend over backwards so far they break their back or light themselves on fire to keep others warm. Then they expect the other person to reciprocate/ do the same. \n\nBut the thing is generally no you choosing to be so sharing/giving does not mean others have to do the same. \n\nI do think it would be good to support your partner thru a mental health crisis for a limited time. But it can't be indefinite. At some point mental health  issues or not you need to pull some of your weight. \n\nIf OP can't work they need to apply for disability. If OP was on her own she would have to figure out some way to survive.", "No, she should *show him*.", "He could probably get it on the cheap right now. OP is not working and any competent lawyer could show she is not a fit parent at this time due to mental health issues, so he stands a good chance of getting primary custody.\n\nIf he is paying all the bills out of his separate accounts she might have a shot at spousal support, but OP is fully capable of working so that is really a toss up.\n\nThis would be a terrible time for OP to even hint at a divorce.", "Yup. Start charging an hourly rate for housework and child rearing activities.", "I can see how separate accounts can work for some people. But even in those situations, they usually have a 3rd joint account that they both pay into for living expenses and bills and the like.", "I completely agree with this and have definitely gotten into some arguments on this site before. The split finances people really make this the hill to die on. But yeah, it only ever works if everything goes to plan. Meaning no job loss, no health issues, etc. it only works if everyone is employed the entire time and I'd argue always making more or less the same amounts. \n\n\nBut the minute life happens it always always always goes to shit.", "I think it can work as long as both are similar levels of seriousness about it. If only one keeps score of only their expenditures and not their sons, it's bound to fail.  Either both keep score of both or no one does of either.", "Bullshit.", "I wouldn't be surprised if living with a husband like this is contributing to said mental health issues.", "Wow what a dumb thing to say", "Please explain why", "We need more Gregisms…", "Well what if his opinion to begin with was that yeah, the husband was probably useless and she's NTA, then the post made his head spin like an owl and he arrived at the same NTA conclusion for different reasons? 360 🦉", "well, to be fair, the title did imply 'useless', not 'productive'. so like a '360 to the next tier'\n\n:D", "Could be a 420", "You’ve either never been in a position to pay child support, known someone that has, or are just ignorant.", "\"expenses that no one has to pay for bc she's doing them (any cleaning, intimacy, childcare, etc)\"\n\n\nI wonder if she is actually doing any of that now?", "That’s not totally separate then, I can’t imagine being married to someone and having a set share of contributions and keeping tally on that. What happens when 1 person is out of work due to childcare or illness.. it just doesn’t make sense to me.", "Differential preference intensity has to be taken into account, too. If we're splitting rent but you want to live in a more expensive apartment than I do and you wont compromise, then you should pay more of the rent.", "??\n\nexactly my point, 10 years is a long time, she had to have known his views on mental health on some level. near the end of that 10 years more recently, mental health has been a major topic.", "Currently, yes. Which makes it ironic she decided to use the word useless. I think she was projecting by using that word in this circumstance.", "Not judging because of the lack of details. Don’t blame you for not wanting to provide more details. But can’t really say one way or another.", "Same here. Seperate accounts, everyone chips in to expenses, because in the end all of it is *our* money, not mine or his. It's just easier to keep books if everyone's income is recorded seperately.", "And he should, why doesn’t he have the right to know where their went money?", "Better yet.", "She needs to find a lawyer who was educated in the 21st century.", "My mom was able to win full custody of me despite a mental breakdown and 6mo grippy sock vacation less than a year before the court date. She then went on to have shock treatments once a month that made her bedridden for up to a week.", "Curious as to why you state that OP is \"fully capable of working\"?", "If you are treating your mental illness they don't hold it against you.", "So it would save him money to be the primary caregiver?", "My wife charges me per hour every time we have sex.", "It can work for a while but eventually you'll run into situations where everything needs to be \"ours.\" Somebody stays home to raise the kids and has no income, somebody gets sick or laid off and can't work for a long span, somebody's career simply will never be as lucrative as the other person's, somebody's retirement investments don't pan out very well.... At some point there has to be a \"we\" instead of just two individuals.", "This is exactly what my husband and I have done for 34 years. Works like a charm. When we married he had debt I wanted no part of and I had 3 children he wasn’t responsible for.", "My wife and I have \"separate\" accounts - we are both listed on them, but operationally they are separate.  And that's the key word - operational.  We worked out a budget and determined who would be responsible for what bills/expenses, and decided on our allowances.  Then each of us manages our portfolio and allowances.  Money to cover the portfolios is allocated between our salaries.  Things get moved as necessary, but the day to day is up to the individual.  We did this so that we aren't spending money that the other earmarked for something plus our financial styles are very different.  But nothing is hidden and we talk about it from time to time, particularly when cash flow is being stressed.  But we don't argue about personal expenses because that's being managed out of the set allowance portions.\n\nPlus, we have a rule on bonuses.  The person who earned it gets to decide how to spend it.  It's polite on big bonuses to discuss it, but not required.\n\nSo far (over 20 years) no real arguments, a few lively debates, but nothing major.  And the few real arguments were mostly on methodology, not priorities.", "I immigrated to the US from Canada when I married my husband (who is American) and when you immigrate on a spouse visa split finances are not an option, so everything we have is joint. It's been 12 years and neither of us have felt the need to resplit anything or open separate accounts. \n\nMarriages work when they're partnerships. For some of our marriage I made more, now he does, and I'm doing the SAHM thing for a while as I deal with health & mental issues also. Everything either of us makes goes into the same account and we share the load of a joint life (bills, housework, work, childcare) as works best for us without thinking about where each penny came from.", "540 would be 1.5 rotations\n\n420 is a whole different thing, man.... (read in appropriate voice in your head)", "or a 69", "I worded it poorly, but it was meant to imply \"whatever it is she's doing/ able to do.\" At the very least, I'm sure baby's at home with her and not a nanny (she said a few years ago, implying that the little one isn't school aged). And as someone who was a SAHP for a decade, staying home with the kids creates its own mental health issues, and PPD symptoms can hang around for 3 years or more esp when you factor in a petty unsupportive partner like this one. She didn't say she lives in bed, she said she's not working outside the home right now. She also chose \"useless\" as a retaliatory insult which implies bigger issues than just \"he's a selfish asshole about money\"", "We contribute to the common account proportionally to our income… for any reason one of the 2 is out of work the contribution is 0 as the income is 0.", "In that case you’re incompatible and likely to run into issues in the future, better off both finding roommates for your respective apartments to split rent evenly with and if you still wish to date you don’t HAVE to live together.. hell you don’t have to live together even if you’re married. I don’t agree with this tit for tat way of life because it’s very easy to fall into hypocrisy like with OP. Even in the apartment example you gave, both could make the same amount of money, one wants luxury the other “doesn’t care” but prefers cheaper. The other person could be a large male and not care if it’s in a scarier part of town while the one that wants the more expensive apartment might also prefer the nicer part of town and be a smaller woman. Years down the road she becomes pregnant and her earning potential goes down while his goes up and up and up while she continues to pay more rent. Point is relationships are nuanced but OPs husband without a doubt is a hypocrite. He wants everything split when he benefits but when he needs to dole out his half he won’t even mention it knowing OP is more generous and probably won’t bring it up.", "In general sure, but I mean something like asking her why she spent $30 at the drug store and exactly what that was for and whether they needed it and if she could have got a cheaper brand, down to every item on the receipt and every penny.\n\nReminds me of a poster the other day who had to beg her husband to be allowed to spend $35 to go to bingo.\n\nIf you're going to have a joint account with someone you need to trust each other to make appropriate decisions about spending. I don't think he would trust her to do that.", "Things have changed dramatically in family courts in the last 10 years. The presumption is now automatically 50-50, with more parenting going to one parent or the other based on various factors, including mental illness, if those factors are present.\n\nAlso, if she quit her job within the last year or two, her income will be imputed and the court will consider her as able to make that level of income for support calculations. That means if her husband gets an aggressive lawyer, he could get full or primary custody and she will be paying him child support. \n\nAlso, the one cardinal rule about family court is whoever is willing to spend the most on lawyers and be the most aggressive gets things ruled in their favor. If she’s so depressed she can’t even take care of basic responsibilities or get out of bed, which means the husband is handling all the child care and also the one supporting the child, and she also isn’t working and has no money of her own to spend on lawyers, she’s going to wind up with some pro bono or flat-fee lawyer who has 150 other cases and gives her case minimal attention (or depending on the state and her circumstances, she might get no attorney at all) and her husband, if he’s willing to fork out, will get a pit bull that goes after her hard. She won’t stand a chance. Money wins in court, every single time, and if you don’t have money, you can sometimes put in the work yourself, but it sounds like she isn’t in a state to do that. I’ve both paid close to 100k to my attorney during my custody battle AND still have had to spend probably 1000 hours on the case (with the attention and effort hitting 40 hours some weeks, all in addition to my full-time job). My ex has a free public defender (my state is one of only 3 that offers public defenders for custody cases) and he has ended up with zero visitation or even phone calls specifically because he has shitty, free representation and he can’t keep up with our side, not because he’s a dangerous lowlife (which he is, but my point is that it’s the money and lawyers that kept me and my son safe - the courts don’t care that he’s a dangerous lowlife).\n\nIt happens all the time and you can Google to see a million stories. There are many, many cases where the husband totally screws over his SAHM ex - he cuts off the funding, hires a great attorney and private investigators and experts, paints her to be mentally unstable (whether it’s true or not) and drowns her in endless motions and hearings and actions, and the mother, who was the primary parent, winds up with weekend visits at best, and more often than you think, with zero custody and paying child support. If this woman isn’t even functioning at a basic level, she has zero chance unless she has some family money that will go towards an excellent attorney. It’s not 1980 anymore. The only cases where the mother easily gets full custody these days are ones where the father doesn’t care and doesn’t fight for it (most men don’t actually pursue custody, which is why so many women wind up getting it), has severe issues like drug abuse or violent felonies, or can’t afford to keep up in fighting an aggressive case.", "Times have changed and the pendulum has swung in the other direction for dads to get, at minimum, 50/50 as a standard in most US areas.", "Well I guess that settles it, OP will win full custody because your mum, who had a different lawyer and a completely different situation did.", "Women can be horrible drug addicted drains on society and still get the kids. At least in Michigan that is.", "Neat story, it's 2023 and things have changed.", "“Grippy sock vacation” hahahahaha. Stealing that one.", "I’m sorry, but what’s a “6 mo grippy sock vacation”? Thanks.", "I didn't make the comment, but I would assume the \"mental health problem\" is a temporary situation.", "What do you do the other 59minutes youve paid for", "Ouch.", "That's fine as long as you can shop around.", "I’d have to charge my husband per minute cus I wouldn’t want to also have to do math", "There's no 69 in the OP's household, for sure.", "A few years ago, might not be 5 and in public school, but 3-4 range might be in daycare/preschool. Nationwide there is generally a daycare worker/slots shortage. So usually you don't take your kid out because you would risk losing your spot. \n\n\"when I am unable to get out of bed he thinks im being lazy.\"\n\nI'm sure OP is not spending all their time in bed, but if they are in a stage of it being hard/impossible to get out of bed sometimes (majority?) and not being able to work, I do think asking if she is even doing any/some work at home is a valid question.", "You’re replying in relation to your scenario, I’m still talking about OP’s.. “he pays for all the bills but makes a point to record down every single cent so I can repay him”.", "If one of us really hates dusty baseboards and wants them cleaned every day whether they're dusty or not, and the other one doesn't give a shit about the baseboards and doesn't want to \"clean\" things that aren't even dirty, who should clean the baseboards? Why should that be a shared or split chore if it's only benefitting one person?", "> Things have changed dramatically in family courts in the last 10 years. \n\nWhere though? Based on her spelling of \"defence\" OP seems to be from a Commonwealth country.", "Yep. Even abusive dads get half time physical custody.\n\nMy honorary nephew is forced to spend half the week with his convicted abuser.", "I don't know whether that's true, or whether I live in an especially backwards state. My husband, an amazing father to my stepson, had to fight tooth and nail to get 40% time. It's heartbreaking.", "Can confirm 👍", "Happens all the time for men too. Men can even rape a woman which results in a pregnancy and win custody of that child. Custody in general is a hot mess that screws over men and women pretty royally as long as one is an evil AH who will go to any lengths.", "I mean, possible. But it could also very much not be. My MIL has been on disability for 30+ years because of mental health issues, so there's no way to know for sure. I was just wondering if OP had clarified in a comment or something.", "Can't stop laughing!!!", "You're not wrong, but that's not a question for us to ask. It's not our business or relevant to the AITA post, especially because we can reasonably infer that she's more than earned the right to do absolutely nothing if that's what she's doing (but i can say with at least 85% certainty that's not the case, and only bc i don't know her personally).\n\nThe object of the brief is to read, form an opinion based on reasonable and inferred assumptions, and deliver a judgement and helpful advice. No, she's not the asshole in this situation, even if her choice of words could have been more appropriate (but no one is using their big brain when they're livid). Wouldn't you agree?", "He is unkind ( not to say worst)! The point of marriage is to support one-another!", "Both benefit from non dusty baseboards both benefit more from a luxury apartment. If one of you has a mental health condition and needs to clean baseboards even when not dusty you need to get a mental health professional to help with that, splitting chores isn’t the issue there.", "In most Western courts, so the US, Europe, and Australia (which is oddly considered part of the West when it comes to these types of things).\n\nThe change really started 20 years ago when the idea of parental alienation took root in the courts, and the presumption of 50-50 has actually become law in many places. It doesn’t mean everyone gets 50-50, but it means all cases start with 50-50, and the balance only shifts towards one parent or the other if there are extenuating circumstances (typically the big 4: sexual abuse of children, violent history, mental illness, and a history of drug abuse). Of course, those things are subjective, and there are a lot of tricks and strategies you can use to take a grey situation and make it look more black and white, and that’s where throwing money at experienced, aggressive attorneys and experts comes in. Who’s to say who is mentally ill? A psychologist? Well, I’m paying 20k for this psychologist and he thinks the other parent is mentally ill, so here’s the proof. That sort of thing.\n\nAs for imputing income, that’s not a new thing at all and most courts do it. Unless she’s on disability due to her mental issues, her income will be imputed as it will be assumed she can work if she wants to.\n\nThe reason most women get primary custody is because most men don’t fight it. Most custody cases never go to court, and 90% of the ones that do don’t go to trial. Most people are able to agree amongst themselves. Of the cases that do make it to court, and especially that don’t settle and go to trial, men wind up getting custody just as much as women do.", "I know it’s not the standard everywhere, but it is rapidly going that way in most places.", "\"but doesn’t mind when she’s the one covering all or most the bill?'\n\nThe idea is partially that if someone chooses to go over the top or above and beyond the baseline that is on them. It does not create an obligation on the other party/person to do the same. \n\nI would agree with you if husband had been asking/insisting on OP covering more of the vacation/hospital bills up to this point. But it seems that OP freely choose to do that, when she could have asked to split those costs equally but instead just paid for all/most of it herself. Op decided to go above and beyond that is on her. \n\nFor example let's say two friends/partners/spouses regularly go out to eat and split the bill 50/50%. One day person A gets a big bonus and says I'm paying the whole bill. Person B says great thank you. That does not mean Person B then has to pay for the whole meal next time, Person B is perfectly fine to ask to split the meal like they have been. It does not make person B a hypocrite. \n\nOr Person A says I'm feeling a really fancy place say $50 a plate vs the normal $25 a plate and person A says I'll pay $75 you pay the usual $25. Just because person A choose to pay for more of a luxury does not mean Person B has to reciprocate.", "This is very manipulative IMO. Firstly this is not a fancy vacation or restaurant this is hospital bills from the birth of THEIR child. I would understand if OP decided to have a child with another male or sperm donor because let’s say his genetics are poor or he is infertile. But no it’s his kid. He knows she is not comfortable with this stingy behavior so she covers the bills when she can under the guise of love in hopes she will have him reciprocate that love. \n\nShe says it in her post she only does this for people she loves and cares for. He is an AH because he uses that to his advantage not because he wants everything “even.” If that was the case he would pay 50% of the costs for hospital bills before she did. He didn’t even mention it. Even in your poor example the friend would be an AH if they continued to go to fancy dinners paid for and every time they got extra money refused to do anything to acknowledge the other friends good gestures. He didn’t even thank her like WHAT?? But even then I would tell them to cut that friend loose because I don’t see any benefit to being friends with someone like that. \n\nThis is my opinion but if that’s something you consider an ok trait to have that’s your opinion. Personally I don’t think generous people and stingy people can be friends let alone married with kids because the stingy person almost always takes advantage of the generosity. I myself am a generous person and yes I do expect reciprocity and if I don’t receive it I don’t hang around that person again, if that’s an AH move then I guess I’m an AH. Even in the example of her birthday or whatever I don’t consider it even, to me it feels like cheap maintenance on his part. I have met many stingy people and in my experience many of them have been lonely and alienated their families/friends later in life but I guess you could call it anecdotal evidence and pretend it’s not an issue. Real life is messy and complicated so it requires flexibility, being frugal is different from stingy so this is a character flaw that should be changed through self help and therapy. Not something that can be rationalized through all these mental gymnastics y’all are doing in the comments."]}