{"id": 30655, "submission_id": "17rdffn", "title": "AITA for refusing to sleep next to a friend who is scared of sleeping alone?", "selftext": "  \nLast week, my long distance boyfriend (24m), a few friends, and I (24f) went on a short vacation to attend a Comicon event. All was well until the first night, when our friend Dave (30m) barged into our room, declaring he'd be sleeping with us. We were a bit puzzled but he explained that the other three friends, who are in a polyamorous relationship, wanted alone time.  \nI kindly told him that me and my bf wanted alone time too and I accompanied Dave to his room, where he told me he wasn't used to sleeping alone, but he agreed that couples need their privacy.  \nMind you, I've never really had a close relationship with this person, he's a sweet gentle giant but he's moved to another city years ago and we never really kept in touch, so this is my first time seeing him in 3 years or something. He's also quite awkward and very clueless when it comes to social cues.  \nThis triggered a fight among the other three friends, all of them felt bad for leaving Dave alone but nobody wanted to sleep next to him, leading one of them to reluctantly sleep in Dave's room.   \nThe following day (Dave wasn't in the room) we discussed the situation. A friend proposed a rotating system to spend nights with him. I protested, saying I was not willing to give up my 5 days of privacy with my boyfriend who I haven't seen in 6 months, and neither should they if they didn't feel like it.  \nI suggested asking Dave to try sleeping alone for one night, to see how he felt about it, they all shrugged and we moved on from the conversation. \n\nThe next day, after a tiring day at the Comicon, one of the three friends picked up the same conversation, this time if front of Dave, asking me directly who was going to take him in their room tonight.  \nI felt bad for Dave, who was visibly embarrassed and kept insisting that he would try sleeping alone, but I also felt extremely pissed at the fact that they purposely put me in a corner to either make me look like an A-hole or to force me to say yes.   \nI was not gonna give in to peer pressure so I stood my ground and simply said \"I've already told you how I feel about the situation\". We had a huge fight, I'm going to spare you the details because it was a constant of back and forth of \"I paid for this vacation\" and \"yeah? well me too!\".  \nWe ended up moving the extra bed in our room and insisted that he tried sleeping by himself, but if he ever needed help or comfort he could knock on my door and come sleep in there.  \nHe ended up sleeping in his own room, with a night light under his bed, without ever waking us up for the rest of the vacation.\n\n  \nI feel conflicted, I feel bad for refusing to sleep next to Dave cause he looked genuinely uncomfortable...but is it really my job to do it? I'm not his mom, his babysitter or ever his close friend... I don't think I could've brought him any comfort even if I wanted to. Opinions?  \n", "created_utc": 1699538036, "permalink": "/r/AmItheAsshole/comments/17rdffn/aita_for_refusing_to_sleep_next_to_a_friend_who/", "score": 25, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I refused to sleep next to a friend I barely know, who is afriad to sleep alone. Had a fight with my friends about it cause they think im selfish and I left them alone to deal with the situation.\nI might be the asshole because Dave looked genuinely uncomfortable, but I feel like its not mine nor my friends job to sleep next to him, putting aside our respective relationships.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nGood lord.  No one gets to just barge into our room and demand they get to sleep there.  \n\n\"I paid for this vacation\" and \"yeah? well me too!\".\n\nYeah, that's not an excuse to get to sleep in my room.  F that noise.", "NTA\n\nIt's not your job to babysit a grown man. If he had this insane requirement he should have asked before he booked the trip", "NTA, someone who is scared of sleeping alone should inform everyone that they want to share a room BEFORE the accommodation is booked. This way everyone can make an informed choice and say nope, not with me....", "Nta, either this guy hasn't matured in 20 years or he was looking to be a creep.\n\n30 years old and unable to sleep alone? Fuck off.", "NTA  \nIt's really important to spend quality time with your boyfriend, especially when you haven't seen each other for a long time. Feeling stuck in a situation where you felt pressured to make a choice can be tough, but your boundaries are important, and you had every right to stand your ground. You showed kindness and offered a solution by suggesting he try sleeping alone for one night, and that was very considerate. It's also completely okay to not have the close relationship or the comfort level to provide him with the support he needed. It's okay to prioritize your own needs, especially when it comes to personal space and privacy. You handled the situation the best you could and with compassion. Don't be too hard on yourself. Your feelings are valid.", "INFO: Who sleeps with Dave at home?", "NTA - you are not his mom or babysitter. This feels like something Dave should have shared before committing to the trip.", "NTA. You stood your ground and did what everyone else wanted, but didn’t have the guts, to do.", "NTA. Dave is an adult. If he can't sleep alone, he should stay home or bring a sleeping companion. It is not up to his friends to meet this need of his at a Comicon event.", "NTA\nIs Dave a puppy?  Or a 6 year old boy?  Because otherwise he should be in his own room being a grown man in his own bed.  This is the weirdest thing I have read on here and that's saying a lot.", "NTA\n\nHe's THIRTY for goodness sake!", "Wtf", "NTA  You don't have to put up with creepy behavior and you are not his support animal either!", "NTA  \nI can understand that this situation was tough and made you feel caught between being considerate and standing your ground about your privacy and time with your boyfriend. You clearly tried to approach it kindly by suggesting a different idea and even offered a compromise by ensuring Dave knew he could seek help if needed. It sounds like everyone had different perspectives on how to handle the situation, and that can make things challenging. It's not your responsibility to solve every issue, especially when it might make you feel uncomfortable. You did your best to navigate the situation respectfully and kindly while prioritizing your own needs, and that's completely okay. It's essential to respect your boundaries and not feel obligated to provide support beyond your comfort level, especially in situations where you're not close with the person involved. You did what you felt was right, and that's what matters most.", "NTA. So what does this guy do outside of Comicon so that he doesn’t sleep alone?  This is definitely something that should have been disclosed at the outset and not sprung on friends when they’re all going to bed.  You’re in the right to want privacy with your long-distance boyfriend. \n\nHe’s 30. Not getting any younger with this fear.", "NTA;  You have a right to enjoy your room (which you paid for) in peace.", "Is Dave 30 or 3?  Do you need to provide him with a pacifier too?", "What an unusual problem. I say this should have been thrashed out in advance of the trip. That’s not something that you bring up later. NTA.", "NTA. I actually think the biggest AHs in this situation were the friends who tried to make this your issue and didn't have any regard for your boundaries, though the 30 year old man who declared he was going to sleep with you because he wasn't used to sleeping alone is a close second. \"No,\" is a complete sentence and they had no right to try and push you into this after you'd already made yourself clear. You had every right to expect privacy with your bf and they had no right to pressure you to give up your comfort in service of someone else's.", "NTA I feel like his parents have failed him and you have actually done him a favour because he did manage to sleep alone and that is an achievement for him.  It will make his life better in future because this will come up again and he will be ok next time.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n  \nLast week, my long distance boyfriend (24m), a few friends, and I (24f) went on a short vacation to attend a Comicon event. All was well until the first night, when our friend Dave (30m) barged into our room, declaring he'd be sleeping with us. We were a bit puzzled but he explained that the other three friends, who are in a polyamorous relationship, wanted alone time.  \nI kindly told him that me and my bf wanted alone time too and I accompanied Dave to his room, where he told me he wasn't used to sleeping alone, but he agreed that couples need their privacy.  \nMind you, I've never really had a close relationship with this person, he's a sweet gentle giant but he's moved to another city years ago and we never really kept in touch, so this is my first time seeing him in 3 years or something. He's also quite awkward and very clueless when it comes to social cues.  \nThis triggered a fight among the other three friends, all of them felt bad for leaving Dave alone but nobody wanted to sleep next to him, leading one of them to reluctantly sleep in Dave's room.   \nThe following day (Dave wasn't in the room) we discussed the situation. A friend proposed a rotating system to spend nights with him. I protested, saying I was not willing to give up my 5 days of privacy with my boyfriend who I haven't seen in 6 months, and neither should they if they didn't feel like it.  \nI suggested asking Dave to try sleeping alone for one night, to see how he felt about it, they all shrugged and we moved on from the conversation. \n\nThe next day, after a tiring day at the Comicon, one of the three friends picked up the same conversation, this time if front of Dave, asking me directly who was going to take him in their room tonight.  \nI felt bad for Dave, who was visibly embarrassed and kept insisting that he would try sleeping alone, but I also felt extremely pissed at the fact that they purposely put me in a corner to either make me look like an A-hole or to force me to say yes.   \nI was not gonna give in to peer pressure so I stood my ground and simply said \"I've already told you how I feel about the situation\". We had a huge fight, I'm going to spare you the details because it was a constant of back and forth of \"I paid for this vacation\" and \"yeah? well me too!\".  \nWe ended up moving the extra bed in our room and insisted that he tried sleeping by himself, but if he ever needed help or comfort he could knock on my door and come sleep in there.  \nHe ended up sleeping in his own room, with a night light under his bed, without ever waking us up for the rest of the vacation.\n\n  \nI feel conflicted, I feel bad for refusing to sleep next to Dave cause he looked genuinely uncomfortable...but is it really my job to do it? I'm not his mom, his babysitter or ever his close friend... I don't think I could've brought him any comfort even if I wanted to. Opinions?  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "What bothers me most is that Dave probably asked them first, and they told him \"nah, go ask (my name)\" LMAO.", "that's exactly how I see it", "Not a creep I think, but very awkward and a bit neurodivergent.  \nApparently the first night my friend slept in his room he kept him up until 3am talking about nonsense.", "That is really sweet! Thank you so much, I felt bad for him as he seems to have a hard time with these kinds of things.", "His brother as far as I know, he still lives with his parents.", "I'm glad I'm not the only one thinking that this whole situation was bananas", "He does have some issues when it comes to social cues and norms.  \nHe's 100% independent and he's not diagnosed, but he's definitely on the neurospicy spectrum.", "Thank you, I'm new to this whole boundaries thing. I'm used to just give in and do the thing while scoffing and grunting. This time I was trying to stick to my idea because another person (my bf) would also take the consequences of my decision.", "he does live with his parents and shares a room with his brother I believe? Not absolutely sure though. I think the fear originates from any new environment.", "Honestly it kinda felt like we needed to babysit him the whole vacation.   \nHe definitely has some issues, he has random tantrum bursts and talks by himself a lot so we all kinda felt responsible for his safety/well being (he's absolutely harmless though).", "I'm not too sure about this detail but I think that considering we haven't seen him in 3 years he assumed that one of the three friends (26m), who is now in a poly relationship with the other 2, would have shared a room with him. I think nobody informed him about their new relationship status.", "I totally agree, although Dave was frustrating to deal with since he's so clueless and awkward, I feel like my other friends used this detail as a weapon to make me feel bad and force me to say yes because they didn't wanna deal with it.  \nI've always been the \"yes woman\" in the friend group so maybe they expected me to give in easily as always.  \nBut my decision on the matter would've affected my boyfriend as well this time so I wanted to at least try and stomp my feet a little.", "Most likely.  Reason number 438 not to stay in the same AirBnB on vacations with friends.", "Who does Dave sleep next to when he is at home and isn't on vacation? Does he still live at home with his family or does he have an SO that didn't come along this time?\n\nIf he has high support needs that you and your friends cannot provide, then he really shouldn't be traveling alone with you all.\n\nIf he normally sleeps by himself, then he is absolutely a creep and full of shit.", "Still his issue. He's 30. I'm ND, but I knew enough to sleep in my own bed when I was 4.", "Fr , I'm never travelling with them ever again.", "He does live with his parents and I assume he shares a room with his brother, or he associates the fear to new environments.  \nBut I do agree, he should've warned us about this issue beforehand so we could've invited another friend who's not in a relationship to share the room with him."]}