{"id": 30689, "submission_id": "17s0rh7", "title": "AITA for telling my friends ‘the apple doesn’t fall far from the tree’ about there daughters lifestyle / behaviour", "selftext": "I (M48) have been friends with James and Annie since we were teenagers. They got together in their late twenties, and pretty swiftly had kids including a daughter Emily now 19. \n\nBoth James and Annie were kind of crazy as teenagers / in their 20s. Both of them were at every party, taking drugs, having casual sex, lots of boyfriends / girlfriends. Which is their choice. \n\nAs parents they were very relaxed and honest with their children about their lifestyle. Now Emily is travelling and clearly doing the same, she posts a lot on Instagram which demonstrates this. In addition my daughter (same age) has said that she is very ‘fun’. \n\nRecently we all went for dinner (me, my wife, James and Annie). Naturally we were talking about our kids (mine are at college and working). They were talking about Emily, and how they think she’s being young, and it’s her time of life to do it. \n\nI said “the apple doesn’t fall from the tree I guess”, James asked what I meant and I said “well she seems to have a lot of boy friends and parties”. James got mad and asked me to not speak about his daughters friends. Subsequently Annie text my wife and said it was an inappropriate comment. \n\nAm I the asshole for saying it?", "created_utc": 1699610274, "permalink": "/r/AmItheAsshole/comments/17s0rh7/aita_for_telling_my_friends_the_apple_doesnt_fall/", "score": 121, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Saying the apple doesn’t fall from the tree, 2. Apparently that’s rude / inappropriate\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Yeah dude why tf would you even say that?? Genuinely asking why are you so concerned about their daughter's life exactly??\n\nThis is non of your business and you need to stop making comments about things that has nothing to do with you especially children of other people.", "YTA. Your choice of words is one thing, but your tone is revealing. It sounds judgmental and jealous of the life experiences these people had and their daughter is having. Your children said she was fun, why are you looking at her Instagram posts if you disagree?!", "YTA for trying to slut shame a 19 year old. Full stop. You’re an even bigger one for trying to slut shame a 19 year old directly to her parents. You’re the biggest one for trying to slut shame a 19 year old directly to her parents and then being disingenuous about it when called out. Literally no one believes you didn’t know you were saying anything wrong. You absolutely intended the implications you made.", "YTA.\n\nYou seem fairly oblivious to your own rudeness and judgmentalism, so let’s break this down.\n\nHow is “the apple doesn’t fall far from the tree I guess” a kind statement? How is it an approving one? Why did you add “I guess” on the end?\n\nNow answer those same questions about your statement that she “seems to have a lot of boy friends and parties”.\n\nYour statements were judgmental, disapproving, and carried implications that you consider their daughter slutty and degenerate and them that way too, in retrospect. You were flexing on your own kid’s current places in life by negatively judging them and their daughter sententiously.\n\nLearn some manners.\n\nYou’re being deliberately obtuse when you said in reply to another comment that you didn’t think saying Emily was similar to her parents was an inappropriate thing to do. But just in case you have cognitive limitations or social delays, if that’s what you wanted to do here’s how you do it right: “I think it’s great that Emily has the opportunity to spend some time traveling and having fun like you two did when you were younger.”", "YTA - you were being judgmental. This wasn’t a matter of your friends complaining about their kid or trying to figure out where they went wrong. They merely mentioned their kid and you decided to attack her character along with theirs!", "Pro tip: No one ever wants to hear someone else’s opinion of their child’s lifestyle, unless it is shining, glowing praise.", "On first glance it looks like you're not th'AH because you're just saying \"oh she's just like you were\", which is a fine comment to say - but your ENTIRE post is littered with judgement of your friends and her daughter, from calling them crazy as teenagers, \"fun\" in inverted commas, to snide off hands of \"my kids are at college and working\", the implication being \"my kids are well behaved and successful, unlike yours\". \n\nYou quite obviously look down upon them, and I have no idea why you're friends since you never seemed to approve of their \"lifestyle\". I can imagine your comment was said in the judgemental tone it was intended, which yes, would make YTA.", "Info: are you not aware that the phrase you used is usually used in a negative connotation? And it's amplified when using it towards things that people are often judged negatively for? So you came off as judgemental? Which I'm not even sure you weren't being from this post anyways. It seemed like such an unnecessary comment.", "Lol dude, the problem was not the apple comment, you know very well the second comment was waay too inappropriate. You could have simply said \"she's partying like you guys used to\" or \"she reminds me of you when you were younger living your best life\"", "Why would you use that particular saying even if that wasn’t what you meant? It never has a positive connotation. Unless you meant it in a negative way, in which case you are 100% TA. If not you should probably clear that misunderstanding with them.", "YTA. Why are you even paying attention to a teenager's Instagram?", "YTA. You just come across as judgemental and disapproving. There was no need to mention to us that your children are in college and working, it's irrelevant, but you felt the need to tell us, to compare your children to Emily. No-one says 'the apple doesn't fall far from the tree' in a positive way - it's clearly judgemental of them and their daughter. Plus the way you put 'fun' in quotes.", "In this post and your comments you’re pretty clearly trying to play this off as an innocent observation but it’s not. Your addition of “I guess” at the end of your statement and judgmental tone is clear in the post and I’m sure it was clear in the conversation as well. I’m honestly kind of surprised you’d been friends with them this long since you’re so judgmental of them and now their daughter. It’s none of your business what she’s doing with her life and her parents didn’t express concern or ask for your opinion. Her sex life is especially out of bounds and not your business to comment on or concern yourself with at any level. YTA.", "yta you bigot", "YTA and weirdly obsessed with your friends daughters sex life, presumably a young woman you've know since she was a baby.", "YTA what you said was unnecessarily rude and judgmental. No one ever says \"the apple doesn't fall far from the tree\" in a good way\n\nEdit: spelling", "YTA- That comment was unprovoked. They weren’t complaining about her behavior. You just called their daughter a wild child for no reason.", "YTA-  when you don't intend to be s judgmental dick, you apologize when folks point out you were a bit of a dick. If you double down and want credit for having good intentions when someone tells you your behavior wasn't appropriate- you are absolutely an asshole. \n\nAlso, why are you following a 19 year old girls Instagram- Stop following her. Your interest and judgment regarding her sex life is creepy and inappropriate.", "YTA - the choice of words. And even this post reads a bit creepy/jealous. I would be worried if you were commenting on my kid", "A 48 yr old man should not be perusing a 19 yr old’s Instagram. We all know why you are. And no, you aren’t getting some. \n\nYTA.", "I don’t know if I’d say you were an asshole per say, but you did bring that shit up out of nowhere and for no reason. If your friends were offended then I don’t blame them .", "Yta and are jealous you never got to experience having this much fun.", "YTA. Obnoxious AH.  🤮", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (M48) have been friends with James and Annie since we were teenagers. They got together in their late twenties, and pretty swiftly had kids including a daughter Emily now 19. \n\nBoth James and Annie were kind of crazy as teenagers / in their 20s. Both of them were at every party, taking drugs, having casual sex, lots of boyfriends / girlfriends. Which is their choice. \n\nAs parents they were very relaxed and honest with their children about their lifestyle. Now Emily is travelling and clearly doing the same, she posts a lot on Instagram which demonstrates this. In addition my daughter (same age) has said that she is very ‘fun’. \n\nRecently we all went for dinner (me, my wife, James and Annie). Naturally we were talking about our kids (mine are at college and working). They were talking about Emily, and how they think she’s being young, and it’s her time of life to do it. \n\nI said “the apple doesn’t fall from the tree I guess”, James asked what I meant and I said “well she seems to have a lot of boy friends and parties”. James got mad and asked me to not speak about his daughters friends. Subsequently Annie text my wife and said it was an inappropriate comment. \n\nAm I the asshole for saying it?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. If they're going to get mad about her lifestyle, they shouldn't have lived like that. They just regret their past lifestyle now that they've gotten together.", "NTA\n\nBetween his reply and her follow-up text, I think they're being a bit precious about a rather innocuous comment.\n\nAnd they used to be fun, you say?", "NTA and they should ask themselves why the truth bothers them.", "If their daughter had been a son, and was playing the field, and you'd called him a Chip off the Old Block, the father would have been pleased as punch and much back-slapping would have ensued. \n\nBut because she's a daughter not a son, everyone loses their minds and calls it 'shaming'. But you didn't shame her at all, any more than you shamed her parents then or now. You didn't say it was bad behaviour, you didn't say it was good, just that it was the same.\n\nNTA", "NTA", "NTA\n\nYou made an objective statement about their behavior and how they have chosen to raise their daughter.\n\nIf they are sensitive about it, then that's on them.", "[removed]", "NTA clearly the truth hurts.  \n\nPeople are claiming you are slut shaming.  But you didn't say it was a bad thing that she is clearly a slut having lots of fun.\n\n\nI'd it was his son they probably both would have given you the equivalent of a high five.", "Of course youre the AH. Not only was it very rude, but you sound condescending as well. You obviously don't approve of their behaviour when they were young, which sounds normal to me, & you basically implied she shouldn't be out having fun. You must be a right barrel of laughs to be around.", "YTA\n\nI cannot understand how you thought saying that combination of words was a good idea", "I’m not concerned with her life, I’ve known the kid since she was born. We were all discussing our children. I didn’t think saying that Emily clearly being very simillar to her parents was an inappropriate thing to do.", "Why is OP checking out her social media that closely in the first place?", "And slut shame the parents", "explain to me how that was shaming?  it was a morally neutral statement", "The aside “mine are at college and working” was very telling that he sees his kids as better and meant his comment in a completely judgmental way", "> Your statements were judgmental, disapproving, and carried implications that you consider their daughter slutty and degenerate and them that way too, in retrospect.\n\nYou are reading things into it that are not there. I don't read that AT ALL. OP's comment was not negative whatsoever. He was just saying she is a chip off the old block, no judgement.", "Yeah so much so that OP is making some judgy comments based on her posts....how long did he spend looking at them??? Creepy", "Disagree only that it can never be used positively. I’ve seen it used positively lots of times. Not this time, clearly. But other times.", ">  They weren’t complaining about her behavior. \n\nNor was OP.", "They're not mad about her life style tho they said that she's just being young and that it's her time to do it or something\n\nDoesn't sound disapproving", "he is judging her and them too and saying rude things, of course they'll be upset. if someone shames you or your kid for something, won't you get mad even if you think what you or your kid is doing isn't wrong? \n\nop YTA for voicing out your rude opinion on their daughter and trying to talk down to them.", "Why should they regret their past lifestyle? It's normal teen behaviour", "Go away, troll", "What a stupid puritanical comment", "He implied it.", "I think the problem is that the phrase \"the apple doesn't fall far from the tree\" is often seen as an explanation for negative behaviors, so even if you didn't mean it that way that's how it probably came across. You may not have been an AH on purpose, but you were a bit of an oblivious AH. I'd say that you should apologize for accidentally implying that Emily is being a bad kid/person and that is not what you meant to say.", "I guess I can see your point but maybe you guys aren't on the same page on what a \"fun life\" is?\n\nThey might be offended because you guys got different standards", "It’s unbelievable the amount of denial that parents have about their kids.\n\nAlso, most parents have amnesia about anything they did before their kids were born.", "NTA. In this context, I don't see where the offence lies. These are people you have known for quite some time. They've been candid with their children about the shenanigans they were up to when they were younger so why take umbrage now? It doesn't feel to me like you were condemning anyone and it is the truth. If they're not as cool with their daughter doing the same shit they did when young, that's on them.", "Bingo!! 🎯", "So how about if OP'd said \"a chip off the old block\"?  That's usually positive. And IMHO that's all OP meant and so OP is NTA at all, no shaming occurred.", "The offence is because he wasn’t saying it as a compliment. He was judging their daughter, and they clearly picked up on it. He specifically commented on her having lots of boyfriends and partying. Why the hell does he feel the need to comment on her relationships and sex life?", "He wasn’t really, he just made the connection that her behaviour is seemingly similar to her parent’s when they were the same age.\n\nSeems more like a completely off the cuff remark rather than a judgement.  But I'm not part of the hivemind, so... 🤷"]}