{"id": 30697, "submission_id": "17s27dg", "title": "AITA for refusing to go to my fathers funeral", "selftext": "I 17M refuse to go to my father's funeral. My family including my mom think it is messed up. But the fact is I don't know him. When I was a baby my mom and my father got a divorce as he had cheated on her multiple times and he wanted a divorce, he fought for 50/50 custody in court and lost. Since then throughout my life, I've only ever met him once when I was 12. He was NEVER part of my life. However, he always paid child support and sent me 2 gifts a year in the mail for Christmas and my birthday. He also made sure I had health insurance via TRICARE due to the fact he was in the military on active duty all my life.  However, he never would visit me, hell he wouldn't even talk to me on the phone for the past 5 years. He had his wife (a woman he cheated on my mom with and started a family with) be the way he would reach out to me to ask what I wanted for bdays and Christmas gifts. In short, I had NO relationship with this man. However, a couple of weeks ago he got into a fatal car accident. I'm now expected to attend his funeral out in North Carolina. (I live in California) I refuse and my mom thinks I'm being an asshole and that I will regret this later. She thinks I'm disrespecting his memory and service to the country. That even though he wasn't in my life he deserves respect for serving and fighting for this country, and that I should attend his funeral. However, I do not respect him nor do I love him. I do not want to attend his funeral. AITA?", "created_utc": 1699616500, "permalink": "/r/AmItheAsshole/comments/17s27dg/aita_for_refusing_to_go_to_my_fathers_funeral/", "score": 17, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I refuse to go to my father's funeral. \n2. I could be disrespecting his commitment to the country by skipping it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Disrespecting his memory.  What memory.  Do not go.  It sounds like even the gifts he sent were organised by his wife so he had no input into your life so I wouldn't care what anyone says.  He didn't do anything for you so you owe him nothing.", "Nta, funerals are to give closure to the living\n\nSounds like you've got all the closure you need", "Funerals are for the living. You owe him nothing, since his parenting was purely transactional. No one should force you to go pay respects. \n\nYou are absolutely NTA and your choices should absolutely be respected.", "NTA.  Even though he is your biological father, it sounds like you're being asked to go to the funeral of a total stranger with whom you had no relationship.  What is more, going to the funeral would entail a significant travel cost which may be financially very burdensome.\n\nAs a compromise, you might ask if they could live stream (or tape) the ceremony so that you can see whatever portions of it seem relevant.", "NTA. You can’t be expected to pay your respects to a person who you only had a biological tie with, not an emotional one. \n\nIf you are the least bit curious about who he was as a person, you could compromise and go to other remembrances that may be done in his honor or memory such as a dinner prior to the funeral, a celebration of life, or, you could reach out to family or military acquaintances who knew him. That would serve to shed some light on a person whose blood runs through your veins but whose personality you could not place in the least. \n\nAnother point to ponder is that once a person passes away, any issues or personality flaws tend to be more openly discussed by those who knew them. Good or bad, it might clear up some questions or issues you’ve have all these years.", "NTA\n\nFunerals are for the living not for the dead so if you don't think you need the closure you shouldn't have to go.\n\nBut, could you go for the sake of your mum so she doesn't fell bad? And while you don't care about losing your dad I assume you will lose your health insurance? (I don't understand the healthcare system in the US but it sounds like you lose that when your dad dies so you'll lose *something...?*)  \n\nIf it means so much to your mum you could go for her sake not for his or yours.", "Nta, but it might be worth telling your mum you're happy for her to attend if she feels like. Sounds like she wants closure.", "NTA - and I truly mean this: sorry for the loss of your father, even though you lost him a long time ago.", "NTA\nYou owe him nothing. He is just like a distant relative you have no relationship and memory of.\nThis looks exactly like the way my kids Dad has intentionally not want to be in their lives.\nAnd I would not blackmail them should they choose not to have anything to do with him tomorrow.", "NTA.  He's a stranger who sent money.  Why would you attend his funeral?", "NTA. Dead asshole is still an asshole, and if OP's father did not bother to have any sort of relationship with his son, he is an AH.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 17M refuse to go to my father's funeral. My family including my mom think it is messed up. But the fact is I don't know him. When I was a baby my mom and my father got a divorce as he had cheated on her multiple times and he wanted a divorce, he fought for 50/50 custody in court and lost. Since then throughout my life, I've only ever met him once when I was 12. He was NEVER part of my life. However, he always paid child support and sent me 2 gifts a year in the mail for Christmas and my birthday. He also made sure I had health insurance via TRICARE due to the fact he was in the military on active duty all my life.  However, he never would visit me, hell he wouldn't even talk to me on the phone for the past 5 years. He had his wife (a woman he cheated on my mom with and started a family with) be the way he would reach out to me to ask what I wanted for bdays and Christmas gifts. In short, I had NO relationship with this man. However, a couple of weeks ago he got into a fatal car accident. I'm now expected to attend his funeral out in North Carolina. (I live in California) I refuse and my mom thinks I'm being an asshole and that I will regret this later. She thinks I'm disrespecting his memory and service to the country. That even though he wasn't in my life he deserves respect for serving and fighting for this country, and that I should attend his funeral. However, I do not respect him nor do I love him. I do not want to attend his funeral. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "It will happen in life that there will be funerals you will wish, in retrospect, that you had attended. That is true of birthday parties too. Sometimes unavoidable obligations keep us away. You're allowed to choose to risk that later you'll regret not attending this one.\n\nIn this case your father is a complicated kind of stranger and it sounds like you're being pushed to go not to support someone (your mother for example) but because people want you to be hurt enough that you need support, and you don't think you are.\n\nOne nice thing about funerals is that they are generally designed to share windows into the deceased's life. You'll probably learn more about your father at his funeral than you ever knew before. If you went, you'd also meet your half-siblings and (if you wanted to) other people who could help you understand your father a bit better. But it's okay if you don't want that, it just comes with the possibility that you'll regret it later.\n\nIf you went, you would grieve. Even if that grief was for the relationship you wanted with him once. You may also find the same works by watching a tear jerker movie with a dad who dies. But you should cry a little bit even if you don't want to, because it means you can cry a lot if you find you need to, and sometimes we aren't honest with ourselves any how we feel when those feelings are complicated. NTS", "NTA.", "NTA. There are plenty of strangers that served. You are not required to attend their funerals either.\nYour mother doesn't seem to have encouraged a relationship between you and your father.  She doesn't have a say in your feelings at this point.", "If you didn't know him or have a relationship with him don't go. It would be akin to going to a strangers funeral. NTA", "NTA\nNobody owns grief and people do it in so many ways.  if you don’t want to go to a funeral for someone you don’t know then don’t if you do want to go. Do.  You also don’t have to be a supporter for anyone else grieving that’s not your job \n\nMake the choice your most comfortable with", "YTA. Focus on the good, Child support which shows he's not a deadbeat and yearly gifts at least. You don't know what happened to him to make him distant. He fought for joint custody, so obviously he had some feelings for you. \n\nAlso, you can never get this chance back again. Twenty years from now, you might learn something about him that changes your opinion about him, and you will be SO glad that you at least went to his funeral.\n\n If he had beaten, abused or neglected you it would be different, but it sounds like he at least made sure your physical needs were taken care of. If you decide to skip it, doesnt that make you the same kind of person you believe him to be? It doesn't sound like you have to pay for the trip, so really, what is it costing you? Your Mom is right, you will regret it later. It will show that you are the better person if you go. Its the civilized thing to do.", "NTA but there is a good chance it in a few years you wish you went. Better to regret the things you did than regret the things you didn’t do.", "NTA. Wakes and funerals are ways to honor, remember, or celebrate the deceased. You don't want to do any of those three things. So why go?\n\nYour mother, knowing this, still trying to force you to attend is disrespectful.  Reminds me of my own parents getting angry at me when I drifted away from church and became an atheist, because their church friends would ask \"Where's your son?\" and they didn't have an 'acceptable' answer, so it embarrassed them. Never anything about salvation or going to heaven or any concern for *me*. They just didn't like being put on the spot by others. I suspect your mother is thinking something similar will happen at the funeral if you don't attend.", "INFO: Did your mother possibly prevent him visiting or calling?", "NTA\n\nOffer to send flowers 2× a year. As he did not participate in your life, you dont need to participate in his death. And that's my retired soldier husband saying that.", "NTA. It is up to you and how you feel about it. \nHowever i am curious: he did some important things for you. What was the reason he did not visit, do you know? \n\nI wouldnt necessarily reconsider, but think about the things you do not know about the whole mess. You basically just know your mothers side of it. Maybe the story is more complicated?", "NTA. You are not disrespecting his memory because you have no memories of him. You be you", "NTA. This man was basically a stranger to you, therefore you would attend a stranger's service, which in turn sounds insane to anyone. Also, it was his decision to be in the military, this had nothing to with you either. (Plus, I'm pretty sure your mom wouldn't attend a random vet's funeral, so urging you to do so is ... weird.)", "YTA\n\nIf this is even true, you are cutting off family that you may someday want to get along with. It also sounds like your dad at least took his responsibility somewhat seriously, through child support and remembering your birthday. You sound a bit like a petulant child. Sometimes people have to do something they don’t want to do, for the sake of relationships. \n\nBut This seems like a made up story to me. It’s posted on Veterans Day, and the fact that he is military felt like an out of place detail to add.", "He's basically Robert Baratheon having Varys pick out his gifts for Edric Storm.", "If I go to college I'll keep the insurance until I'm 23. If not I lose it at 21. But no matter what I should retain some of the benefits until I'm 26. As he was still on active duty when he died. At least that's how I understand it. I could be wrong. However, we did lose the child support which was 1000 a month that was gonna happen in a few months anyway. Now that I'm working it won't be a big deal. If this happened a few years ago we'd be screwed.\n\n I know my mom wants to go, but I just don't know if I want to face all of my \"relatives\" that I've never met. Including my half-sisters and grandparents. It just seems so pointless. I don't consider them family.", "Compromise.  Go with her to North Carolina.  But either stay in the car or stay outside while the ceremony and burial are taking place.  You are there only to support her.\n\nIf you think she will pressure and force you to attend or see his new model family?  Then skip it.  Tell her you'll honor his service in Memorial Day like all other veterans.\n\nDo send a condolence card to the wife, since she did pick out the presents.", "Question. \n\nWho invited you to the funeral. \nHis widow. Or a letter from the military (active duty) becouse you are next of kin?", ">I know my mom wants to go\n\nSee if you can muster up the will to go for your mum. Sometimes we do hard things for the people we love. I assume you love your mum so go for her. Then close that chapter in your life and move on. \n\nIt is totally possible to ignore all the 'relatives' you don't want to see on the day of the funeral. They will be dealing with their own grief. Trust me, when you get to my age, you realize that no one is thinking about you nearly as much as you imagine they are."]}