{"id": 30718, "submission_id": "17s6eyh", "title": "AITA for kicking my BIL out of my party for making my sister cry?", "selftext": "My (31f) younger sister (27f) has been married to a guy (30m) for three years now. Suffice it to say he's not the most popular amongst other family members.\n\nWhen he first began dating my sister the appeal from her perspective seemed to be that he was quiet - she's a very sweet but pretty shy person and often struggles in social settings, so he seemed to gel with her personality type well. However, as time passed his quietness seemed to be masking an ugly personality that he often inflicts on my sister. Generally speaking he's tolerable, but whenever he's in a bad mood he's extremely negative and saps the life out of any room with his rambling complaints about anything and everything. My sister admits they have their problems, but she says she loves him and I've never wanted to pry too much.\n\nRecently I held a little party at my house to celebrate my husband's work promotion. We invited close family and friends, which included my sister and BIL. When they arrived, both were in a good mood and I actually held a conversation with my BIL for a little bit. However as the night progressed he started getting cranky and would start whispering in my sister's ear constantly. The mood at the party became tense as it became clear he was berating her for making him come along. Things like \"why am I here\" and \"thanks for inviting me to this(!)\" \n\nAt one point I saw him doing this and noticed to my horror that my sister had started crying. My BIL then began asking why she was being so dramatic. I don't want to be that person making scenes at parties and inserting myself into drama, but I guess for my sister in that moment I was happy to do it if it meant I could get him away from her.\n\nI went over and told him politely that I would be calling him an Uber. When he barked \"what?!\" I pretty much lost my temper and yelled that it was my home, and he was making my sister cry and I wouldn't put up with that. All the while my sister said nothing. He eventually did leave but he now won't stop accusing me of being a busybody who pries into his relationship with my sister because I'm \"lonely\" (despite the fact I've got a husband I guess....)\n\nSo was I wrong and did I insert myself into drama with this? Or did I have every right to stand up for my sister?", "created_utc": 1699630178, "permalink": "/r/AmItheAsshole/comments/17s6eyh/aita_for_kicking_my_bil_out_of_my_party_for/", "score": 227, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) my action that should be judged is kicking my bil out of a party\n\n2) it could make me the AH if it wasn't something i should've got involved in\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You need to get your sister alone and find out what’s happening. I’d be worried that he’s abusive.", "NTA. Guy sounds low-key emotionally abusive. You can't fix their relationship but you sure as hell can stand up for your sister when the opportunity arises. I really don't like this guy. \"I'm going to wear you down then belittle you and then blame you for feeling bad.\" Fuck him.", "NTA, but I'm curious, how was your sister once he left?  Or did she choose to leave with him?", "NTA for kicking him out. Hopefully sis comes arounds and kicks him out of her life.", "You're obviously NTA. Why would you be?", "NTA, you fulfilled his wishes and got him out of there. In all seriousness, everything you've described about him sounds like a textbook abuser and sociopath. Did he seek out your sister because he saw that she's shy so she likely won't speak up when he pulls this crap with her? Whispering things to her so no one hears what makes her cry is really sinister, and it sounds like this is only the surface of what she's going through. His aggressive reaction towards you is a glimpse at what else might be going on.", "NTA\n\nYou don't want that shit in your house. I only hope he didn't take it out on her.", "NTA you should always protect the ones that you love", "NTA. You are observing some outright abusive behavior here and it is normal that you want to make sure you sister is safe and knows you have her back.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (31f) younger sister (27f) has been married to a guy (30m) for three years now. Suffice it to say he's not the most popular amongst other family members.\n\nWhen he first began dating my sister the appeal from her perspective seemed to be that he was quiet - she's a very sweet but pretty shy person and often struggles in social settings, so he seemed to gel with her personality type well. However, as time passed his quietness seemed to be masking an ugly personality that he often inflicts on my sister. Generally speaking he's tolerable, but whenever he's in a bad mood he's extremely negative and saps the life out of any room with his rambling complaints about anything and everything. My sister admits they have their problems, but she says she loves him and I've never wanted to pry too much.\n\nRecently I held a little party at my house to celebrate my husband's work promotion. We invited close family and friends, which included my sister and BIL. When they arrived, both were in a good mood and I actually held a conversation with my BIL for a little bit. However as the night progressed he started getting cranky and would start whispering in my sister's ear constantly. The mood at the party became tense as it became clear he was berating her for making him come along. Things like \"why am I here\" and \"thanks for inviting me to this(!)\" \n\nAt one point I saw him doing this and noticed to my horror that my sister had started crying. My BIL then began asking why she was being so dramatic. I don't want to be that person making scenes at parties and inserting myself into drama, but I guess for my sister in that moment I was happy to do it if it meant I could get him away from her.\n\nI went over and told him politely that I would be calling him an Uber. When he barked \"what?!\" I pretty much lost my temper and yelled that it was my home, and he was making my sister cry and I wouldn't put up with that. All the while my sister said nothing. He eventually did leave but he now won't stop accusing me of being a busybody who pries into his relationship with my sister because I'm \"lonely\" (despite the fact I've got a husband I guess....)\n\nSo was I wrong and did I insert myself into drama with this? Or did I have every right to stand up for my sister?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Your BIL accusing YOU of being a busybody?!?! He kinda made it your business, and you overheard. NTA", "Sounds like your sister is in an abusive, controlling relationship.  Try and take time alone with her to find out what's going on.  Abusive relationships don't start out that way, and the victim often doesn't realise how bad it's got.", "Unfortunately, I think your sister is in love with the guy she met. Eventually she’ll realize that she doesn’t love this “stranger”.", "Complete and total NTA - And might I add that letting your sister know that she can turn to you *any time* would be the thing to do, and to remind her regularly. Often just the littlest amount of support can help her leave something that she has trouble leaving.", "This, please. OP I love that you stood up for your sister, and you are NTA. BUT, your sister could face repercussions and you need to make sure she's safe, not just physically but from emotional abuse. If he behaves like this in front of people he's probably worse at home.", "It's so manipulative. It's like he enjoys playing the victim.\n\nI can't force her to leave him, but you're right in that I can 100% have her back if I see him being like that to her. I don't care, I'd rather him direct his cruelty at me rather than her", "Sorry, I should've provided more info on that.\n\nShe stayed at mine and we had a drink with everyone. The atmosphere was very nurturing towards her bc of course everyone there loves her and wants her to be okay. She thanked everybody for being so great.\n\nEventually she went home to him and really hasn't said much more about it.", "100% this. If you “stand up” for your sister and she doesn’t want it, it may drive a wedge between you. And given that her partner sounds abusive you need to keep her trust. \n\nNTA", "I can't even lie when I say I'd throw another party if she left him. But I can't force her to do anything, it's for her to decide. Either way I'll still defend her if he wants to get in her face or try to make her feel bad.", "Your sister is in an abusive relationship. Your family needs to start having loving conversations with her to help her realize it and prepare to leave. If this goes on too long it's going to destroy her.", "I’m so glad to hear she was able to enjoy herself and let herself be nurtured by those that love her.  You’re a good big sister!", "Have you told her the family will help and support her if she wants to leave him?", "Having him leave and her stay could potentially result in sister attending fewer and fewer social events. Please keep the lines of communication open - abusers can be really manipulative and it isn't until you are buried in unhappiness shut off from friends and family that you realize the total impact of every small decision.", "YTA\n\n&#x200B;\n\n\" I don't want to be that person making scenes at parties and inserting myself into drama, \" .. your behavior proves that to be a lie.\n\n&#x200B;\n\nIntruding in your sisters relationship will hurt her more than he did.", "NTA - because I think your heart was obviously in the right place, but I'd be more careful in the future.  It sounds like he is at least emotionally abusive, and he's going to take this out on your sister.  It could also lead him to further isolating her from you.", "NTA I will lose my good sense with a quickness when it comes to the few important people in my life. My sisters MIL called my mother a bxxxh to her face and I was ready to drive halfway across the country to handle that, my SO at the time hid my keys, lol.", "NTA... I have a 'not in my home' attitude.  I am protective of my guests while they are in my home. - if anyone gets belligerent they get told to walk it off or go home.", "NTA. You are never the AH for supporting and protecting the ones you love.\n\nI am going to recommend you read \"The Bronckhorst Divorce-case\" by Rudyard Kipling. I think both you and your sister will appreciate it right now.", "NTA.  You are fully allowed to remove someone who is abusive and disruptive from your home, regardless of who they are.  Try speaking with your sister and find out how bad the abuse is, because if it's spilling out like this in public, you don't know what it's like in private.", "NTA but like everyone’s pointing out this really does not sound good for your sister. Even if she were to admit it’s bad it takes people usually multiple times to leave. Be patient.", "Good for you for standing up to your BIL! NTA", "NTA,if he made her cry around you at that party,theres probably things going on behind closed doors. Please try and talk to your sister alone. That sounds like a pretty big red flag.", "It used to be the defense for domestic abusers, “You have no right to pry into my domestic affairs.” And here he is using the same line, decades later. NTA. Don’t let abusers benefit from “privacy.”", "Absolutely. It's one thing if it's elsewhere, but if its under my roof I don't have any issue telling someone not to act that way or to just leave", "Just be there for her. She will come around,  I did. Xxoo", "Well, at least she knows her entire family has her back once the scales fall from her eyes and she finds the courage to leave that abusive marriage.\n\nGood luck!", "Have you talked to or seen her in person since this happened? \n\nI’m worried he is taking his anger out on her.", "Yes this is real I watched it happen to my sister for too long - the guy who kinda sucked, she insisted she loved, and it just got worse and worse. It eventually did get physical when I was at work one day (we lived together the three of us during the bulk of early pandemic, about two years) and luckily she was able to get outside and call the cops. Guys like this never get better of their own volition - there’s a pdf of a lifesaving book available for free online called Why Does He Do That \nhttps://ia600108.us.archive.org/30/items/LundyWhyDoesHeDoThat/Lundy_Why-does-he-do-that.pdf\nNot to be super dramatic but I wish I’d been more dramatic earlier on when I’d seen shit my sisters bf got up to - good for you for evicting him from the family gathering. Stay in touch with your sister !!", "**Talk to your husband first** and make sure he is on board with you telling your sister that your home is always open to her if she wants to leave him. \n\nNTA", "This isn’t even low key. He is literally doing it in front of her family.", "You sent a message to \\*both\\* of them that your sister has backup, which may be what he's afraid of."]}