{"id": 30793, "submission_id": "17t5su7", "title": "AITA- I called my entitled brother a deadbeat dad", "selftext": "Am I the asshole- i m(18) have many siblings but ive got an older brother m(27) he has 2 kids f(2) and m(1) i love my niece and nephew but my brother constantly dumps them on me. \n\nI moved out of the family home a week after turning 18 due to the fact my brother and his family moved back into my parents house and I was told to give up my bedroom so his kids could have thier own room I got moved into the living room and I had to sleep on the sofa and all my clothes into black bags. \n\nNow don’t get me wrong I understand it’s not the kids fault but still I was kicked out of my own room and told to sleep on the sofa. My brother has always been spoilt but won’t admit it.\n\nI work and when im not working i end up having to babysit his kids bescuse his girlfriend f(24) cant handle two kids on her own. I didn’t mind looking after them the first couple of times but it’s now everyday i finish work and on the weekends. \n\nAnyways I got so fed up last week. I babysat them both from Fridays at 10am till Saturday 2pm I was annoyed I hadn’t slept his son would not settle no matter what I was not getting a response from either parent so I decided to give him a dummy something that they didn’t want him to have. \n\nMy brother finally came to pick them up at 2pm from my flat I put both kids in their car seats and told my brother I would not babysit for him again. He asked me why and I told him that i don’t have kids and I shouldn’t be forced to look after his kids without being paid. \n\nHe got angry and called me many names under the sun. I called him a deadbeat dad and he got in his car and speed away. \n\nIt now Sunday and I’ve had multiple family members called me a horrible person and that I need to look after his kids.\n\nIt was pretty ugly and he now wants me to give my flat so his kids have somewhere else to stay and I would move back into my parents house.\n\n I’m honestly not sure what to do at this point I don’t want to give my flat up but his kids need a home but I don’t want to move out so he can’t body about more things he don’t work for.", "created_utc": 1699741868, "permalink": "/r/AmItheAsshole/comments/17t5su7/aita_i_called_my_entitled_brother_a_deadbeat_dad/", "score": 50, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I called my brother a deadbeat dad cause he didn’t want to look after his own kids and is trying to get me to give him my flat\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nAnd if the flat is yours, it stays yours. You aren't responsible for his life choices. Do not give up the flat, and do not babysit for them again. It's time for him to grow up. Also...\n\n>bescuse his girlfriend f(24) cant handle two kids on her own\n\nThen she shouldn't have made them. That's not your problem.", "NTA.   \nWho paid the deposit on the flat? Who is paying the rent?   \nWhy can’t he get his own flat? Why does he always go after YOUR things?   \n\n\nI love the idea of “Wow, it’s GREAT that you have agreed to help him“ and “I am sorry but it is not in my budget to help him right now”. And sticking to those two lines. You shouldn’t be paying for him, and baby sitting his kids means you arne’t getting paid to work somewhere else. Even if you don’t actually work those hours somewhere else you need time to do things you can’t do when you do work. Your time is worth money. Tell them all to pick up the babysitting hours, and help with his housing, and then take a looooooooong time to remember to read any texts as from any of them. Put them on mute so you don’t take their calls (you are busy getting ready for work right?) and ignore the hell out of them for a while.", "Don't give up your home and don't babysit anymore. I know you love them, but he's being ungrateful. I'm so glad you called him what he is. So many deadbeat dads never get called out. Why do people have kids when they're really not that arsed with them?! I don't get it. \nYou didn't do anything wrong. You've already given up your room for them, don't give up anything else. It's not your responsibility to home them.", "NTA -- tell THEM to babyst.", "NTA - There is no world in which he and his GF aren't using you here and your words are 100% accurate. Disappointed to hear that other family agrees with him but I am guessing they are either the enablers of his behavior or ones who have only been told the story from the enablers.\n\nI am not certain what the law is like where you live but I would look into getting a trespass notice against him if he turns up unannounced and tries to dump the kids on you and call whatever police/child services you need to if he leaves them.\n\nPeople who are this entitled are one thing but the fact your family is on his side says that they aren't worth being around either so don't think of this nuclear option as losing family but, rather, gaining some sanity.", "NTA\n\nCall the police for trespassing if he tries to force you out of your home. If he drops the kids off again, call the police about abandonment.\n\nGet a security camera to back up your account.", "NTA. \n\n1.  You shouldn’t have to give up YOUR SPACE for anyone else. \n\n2.  They aren’t your kids.  You have no obligations here.  Period.  \n\n3.  To anyone saying you should sacrifice your time/money/space for his kids, aka them when they plan to do the same.  Oh they don’t?  There you have it.", "NTA. He’s always going to want what you have. I’m betting he wants and expects you to give up your flat and still pay the rent. So, inform your landlord that you’ve got a family member that may try to guilt him (landlord) into unlocking your apartment. Tell them you are not giving permission for anyone and to call you if he tries. Then you email/text everyone that since they think you should babysit his kids at anytime with no money a schedule will be drawn up and all of them will be assigned shifts. I mean, family helps family, right?\n\nBe prepared for him to try and leave the kids on your doorstep. Call the authorities if he does it. If it were me, I’d nip it in the bud, and tell him if he tries to leave his kids on your doorstep and leave you will call the police.", "NTA please do not give up your independence to a deadbeat who only wants to take an advantage of you. The rest of the family wants you to take the responsibility so they do not have to.", "NTA \n\nNext person that contacts you, tell them to put their free time ever their mouth is and step up and babysit for free.", "NTA surely all those family members calling you have offered their childcare services right?", "\\[OP, I may be the only one, but I never heard a pacifier called a \"dummy\" before. You might want to add a little note to the post so people don't think you misspelled something else. Apologies if I was the AH for thinking the worst.\\]\n\nBut as to your brother, these are his kids, not yours. You don't owe him free babysitting. I'm not sure 'deadbeat' is the right word but 'negligent failure' seems to fit the bill.\n\nAnd no, of course, you're NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAm I the asshole- i m(18) have many siblings but ive got an older brother m(27) he has 2 kids f(2) and m(1) i love my niece and nephew but my brother constantly dumps them on me. \n\nI moved out of the family home a week after turning 18 due to the fact my brother and his family moved back into my parents house and I was told to give up my bedroom so his kids could have thier own room I got moved into the living room and I had to sleep on the sofa and all my clothes into black bags. \n\nNow don’t get me wrong I understand it’s not the kids fault but still I was kicked out of my own room and told to sleep on the sofa. My brother has always been spoilt but won’t admit it.\n\nI work and when im not working i end up having to babysit his kids bescuse his girlfriend f(24) cant handle two kids on her own. I didn’t mind looking after them the first couple of times but it’s now everyday i finish work and on the weekends. \n\nAnyways I got so fed up last week. I babysat them both from Fridays at 10am till Saturday 2pm I was annoyed I hadn’t slept his son would not settle no matter what I was not getting a response from either parent so I decided to give him a dummy something that they didn’t want him to have. \n\nMy brother finally came to pick them up at 2pm from my flat I put both kids in their car seats and told my brother I would not babysit for him again. He asked me why and I told him that i don’t have kids and I shouldn’t be forced to look after his kids without being paid. \n\nHe got angry and called me many names under the sun. I called him a deadbeat dad and he got in his car and speed away. \n\nIt now Sunday and I’ve had multiple family members called me a horrible person and that I need to look after his kids.\n\nIt was pretty ugly and he now wants me to give my flat so his kids have somewhere else to stay and I would move back into my parents house.\n\n I’m honestly not sure what to do at this point I don’t want to give my flat up but his kids need a home but I don’t want to move out so he can’t body about more things he don’t work for.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  If you are paying the rent and are 18?  Tell your brother and the rest of the family flying monkey squad to fuck right off.", "NTA. Don’t give him anything: not your flat and not even your time. Who is that entitled?", "Who is paying the rent on your flat? If it is you then tell him that you will have no problem whatsoever calling social services to come and look after his kids who have 2 parents that refuse to take care of them. Heck in your shoes I'd take the kids to child protective services myself and then get on with my life.   \nWhy does he want your home? He has a home with his parents, that he's already driven you out of. He'd also be no better off if you moved on again, but this time somewhere over 100 miles away so that you wouldn't be physically available to babysit for him.   \nTell the multiple family members that helping him out is one thing, pretty much raising his kids for him is quite another and that they are welcome to take the kids on full time themselves if they feel that strongly about it. In the meantime you have done your bit and now need to reclaim your own life.", "NTA. He took your room for his kids. He expects free babysitting. Now he wants your apartment?? Who's supposed to pay the rent - you? No. It's a beautiful word. Sorry you feel that way, no. Family wants you to give up your apartment? No. And why do you care how they feel? They obviously don't care about you", "This whole comment. DONT LET THEM TAKE YOUR FLAT", "\"Thanks for your concern.  I'll be sure to tell brother how invested you are in the children's care, so he can put you on the babysitter rotation.\"\n\nDO NOT give up your flat.  The kids have a safe place to stay and are probably better off with your parents providing oversight.  NTA.", "You're not the only one not familiar with British English, and probably a lot of English in the commonwealth and former commonwealth as well, but you could have googled it before leaping to conclusions about op.", "That's what \"I never heard a pacifier called a \"dummy\" before\" means. That I'd never heard of it but now I know. \n\nWhen I read it I didn't know and I thought it might have been a misspelling. Which is when I googled it. Before I posted the sentence that says that I now know what it means. \n\nAnd I thought I'd be considerate and give OP the heads up that other people could possibly read it the way I did and not google it.\n\nBut I did. As my statement clearly shows."]}