{"id": 30805, "submission_id": "17t7jg5", "title": "AITA for laughing at my mom so hard I almost peed my pants because she ate her fortune with her fortune cookie and then had \"words\" with the poor waiter and my dad?", "selftext": "Using a throwaway obviously.  For background in this story, there is me 21f, my little sister 19f, my older sister 23f, mom and dad, both 50s. \n\nMy parents took us out to one of our favorite restaurants this afternoon for lunch. They are first generation Chinese family and quite possibly the sweetest people on the planet. Every once in a while they will have a new cousin or relative show up and because we are always nice, they will let the new relative practice their serving skills on us. This happened today. \n\nAfter the meal today I watched my mom take her fortune cookie, open the wrapper and shove the entire thing in her mouth, chew it, swallow it and even say \"yummm\" after it all went down. I looked over at my little sister and she saw it too and we sort of had this silent moment of \"do we tell her?\" When she said \"yummm\" my sister started laughing which caused me to laugh. My mom said \"why are you laughing? What did I do now?\" I tried to respond and then she started saying \"wait, where's my fortune? How come I didn't get a fortune with that cookie? I love those.\" \n\nIt was such a perfect moment as she was lifting up her plate, moving the little sugar dish around, looking in her purse...she even took off her glasses as if it somehow fell into her hair. I started laughing so hard I almost couldn't control myself. Then she snapped over at the poor waiter who barely spoke English and did all these hand gestures to try to explain what was missing and the poor guy clearly did not understand. \n\nMy younger sister was laughing equally as hard and our older sister gave her typical stern \"you are such idiots and so immature\" which didn't help at all. My dad was busy trying to figure out the tip on his phone and when my mom said \"Gregory put your damn phone down and help me ether find my fortune or get me a new cookie\" I was laughing so hard that I couldn't breathe. My sister and I excused ourselves to the bathroom where I almost didn't make it before peeing my pants. We laughed for a food few minutes in the bathroom before composing ourselves and coming back to the family. My mom and older sister gave us these very damning looks after we got out as if we embarrassed them. \n\nMy parents had to go to Home Depot so we rode with our older sister who asked us point blank what was so funny so I told her that mom ate her cookie, fortune and all without even realizing it. My older sister is a major kill joy and started yelling at us that \"she could have ch0ked! what is wrong with you! Why didn't you say anything!!!\" We told her that she even said \"yummm\" after she swallowed the cookie and she said \"you realize that piece of paper could be going into her windpipe as you two assholes were laughing at her!! What is wrong with you!\"  We tried to explain but she was having none of it and says she is going to tell mom unless we come clean about what horrible daughters we are. The ride was silent from then on (she has a way of making us feel awful--it's happened our entire lives). \n\nI guess AITA?", "created_utc": 1699746816, "permalink": "/r/AmItheAsshole/comments/17t7jg5/aita_for_laughing_at_my_mom_so_hard_i_almost_peed/", "score": 196, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I laughed really hard at my mom after she ate her fortune cookie, fortune and all without realizing it. I may be the asshole because instead of laughing I could have realized it was a safety issue and said something.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nThat’s hilarious and she isn’t going to die from eating a little slip of paper, how dramatic of her.", "NTA, that’s hilarious. Also, you can’t inhale and swallow at the same time. There was zero chance of the paper going into her lungs while the cookie went to her stomach. People eat much worse stuff. The paper will break down in her stomach.", "Any guesses on what her fortune said? \n\nI'm going with \"Watch what you are doing or you may eat your words.\"", "you and your sister? NTA\n\nyour mom? AH\n\nyour sister? ....if she seriously cant see WHY this is funny..I submit..she needs a mental health exam.\n\nthat said..I about fell out of my chair reading this story.", "NTA, your mom is a mess!", "NTA.  It was paper... she was never in any danger.  My sister and I used to get tickled at my Mom, and she would laugh at herself. I'm a Mom, and my kids get a kick out of stupid stuff I do all the time. Laughter is so important and creates great memories!  One day, when I'm gone, I hope they share the moments that I was utterly human to them!  And I hope they remember me joining in the laughter!", "Your mom is both an asshole and a dumbass.", "NTA, your sister is ridiculous, the tiny piece of paper is completely safe to eat if you choose to do so.", "My parents always told me it was bad luck to eat the fortune cookie before I ate my food....I wonder what happens when you eat the fortune with the fortune cookie. I do think you should have tried to work out telling your mom she ate her fortune while you were laughing at the table; she might have found it as funny as you did.", "Isn’t that how you get the fortune to come true? Have I been eating fortune cookies wrong?", "NTA but your mom is TA for snapping at the waiter", "NTA. This is pure comedic gold, I laughed so hard.   Your eldest sister must be the life of the party wherever she goes.", "I have hard time believing this is true because it's just a given that you break a fortune cookie in two before eating it. Like, who would just pop it in their mouth? Unless your mom has dementia, which is obviously not a thing to laugh at.", "NTA\nHowever, I have received fortune-less fortune cookies before.  So not sure your mom swallowed hers. Did she actually shove the entire cookie in her mouth? Seems like it'd be too big.", "NTA. The piece of paper can't hurt anybody. Your mom should have paid attention to what she was eating.", "NTA.  I always say \"you cant help what you find funny\"  and laughing is usually involuntary.", "Is your mother…cognitively ok?", "NTA\n\nThe cookie's more likely to choke her than the tiny piece of paper inside it. Your sister certainly overreacted.\n\nAt first I thought that your mother had never had a fortune cookie before. But she had. I guess she forgot that the fortune is inside them.", "NTA. No one gets hurt by eating a tiny piece of paper. My mom put a note in my sandwich on April Fools when I was in 8th grade and I never noticed it... I ate the entire thing. My mom was waiting for me to get home to ask me how I liked my sandwich, just waiting to laugh. She felt kind of bad when she realized I had eaten it, but no one was worried.", "So the oldest sister has your mother’s sense of humor, or rather her lack of a sense of humor. \n\nIs this the first time your mom ever had a fortune cookie? Has she never seen anyone break one open? \n\nI was laughing at your story because I could just see her being oblivious to what she actually did. I commend you for making it to le toilet in time..", "Your mom should be safe, as long as the fortune teller used a big enough slice of toilet paper after their mudpie...", "NTA she could have choked from the cookie itself or from anything she ate during the course of that meal. And you're just as likely to have noticed her choking on one as the other. So if you don't notice her choking on the fortune, you wouldn't notice her choking on her General Tso chicken, and it's because you're oblivious A Hs, not because you're amused at something that's honestly fucking hilarious.", "YTA but not for laughing because I can imagine it's funny to witness her be all confused about where her fortune went. But I find it very iffy the laughing continued when she snapped at the waiter who did not understand what was going on. Like none of this was his fault and I think that would've been a great moment to explain to your mother what happened instead of continuing to laugh and wait until later to tell her. He really didn't deserve to be snapped at for something that could've been easily avoided if you or your sister stepped in and explained to your mother what was going on. Your mum is also TA for snapping at a waiter.\n\nAnd just in case I'm misinterpreting \"snapped\" and in this situation it means called over, then I guess it's a lot less of an asshole move and I think I'd go with NTA but still feel like it would've been a lot better to have intervened and told her earlier.", "ESH, kinda, though your sister is definitely TA. I don't blame you for laughing at your mom for being pretty rude and clueless. I know how it is when something strikes you funny.   \n\n\nFailing your mom having a cognitive issue, your mom is TA big time. But I don't understand why no one told her she ate it. I say ESH because I feel like there is something a little mean spirited in not telling her that she ate it or letting anyone else in on the joke.", "Why didn't one of you just tell her? N T A for laughing but ESH overall", "It’s a funny story, so who cares if you’re the asshole.", "YTA. Your mom said “What did I do now?” which makes me think you laughing at her might be a regular occurrence. If she ends up with dementia are you going to ridicule her? How will she be able to trust you? You are messing up your relationship with her by acting like a preteen.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nUsing a throwaway obviously.  For background in this story, there is me 21f, my little sister 19f, my older sister 23f, mom and dad, both 50s. \n\nMy parents took us out to one of our favorite restaurants this afternoon for lunch. They are first generation Chinese family and quite possibly the sweetest people on the planet. Every once in a while they will have a new cousin or relative show up and because we are always nice, they will let the new relative practice their serving skills on us. This happened today. \n\nAfter the meal today I watched my mom take her fortune cookie, open the wrapper and shove the entire thing in her mouth, chew it, swallow it and even say \"yummm\" after it all went down. I looked over at my little sister and she saw it too and we sort of had this silent moment of \"do we tell her?\" When she said \"yummm\" my sister started laughing which caused me to laugh. My mom said \"why are you laughing? What did I do now?\" I tried to respond and then she started saying \"wait, where's my fortune? How come I didn't get a fortune with that cookie? I love those.\" \n\nIt was such a perfect moment as she was lifting up her plate, moving the little sugar dish around, looking in her purse...she even took off her glasses as if it somehow fell into her hair. I started laughing so hard I almost couldn't control myself. Then she snapped over at the poor waiter who barely spoke English and did all these hand gestures to try to explain what was missing and the poor guy clearly did not understand. \n\nMy younger sister was laughing equally as hard and our older sister gave her typical stern \"you are such idiots and so immature\" which didn't help at all. My dad was busy trying to figure out the tip on his phone and when my mom said \"Gregory put your damn phone down and help me ether find my fortune or get me a new cookie\" I was laughing so hard that I couldn't breathe. My sister and I excused ourselves to the bathroom where I almost didn't make it before peeing my pants. We laughed for a food few minutes in the bathroom before composing ourselves and coming back to the family. My mom and older sister gave us these very damning looks after we got out as if we embarrassed them. \n\nMy parents had to go to Home Depot so we rode with our older sister who asked us point blank what was so funny so I told her that mom ate her cookie, fortune and all without even realizing it. My older sister is a major kill joy and started yelling at us that \"she could have ch0ked! what is wrong with you! Why didn't you say anything!!!\" We told her that she even said \"yummm\" after she swallowed the cookie and she said \"you realize that piece of paper could be going into her windpipe as you two assholes were laughing at her!! What is wrong with you!\"  We tried to explain but she was having none of it and says she is going to tell mom unless we come clean about what horrible daughters we are. The ride was silent from then on (she has a way of making us feel awful--it's happened our entire lives). \n\nI guess AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "It’s just extra fiber lol she’ll be fine !", "NTA... I small piece of paper wont choke her. More likely to choke on the cookie or food. Tell her to \"drop the drama\" from me please. I'm laughing at your mom too - but not her rudeness.", "NTA, but I agree that you have to tell your mom. She deserves to know her fortune will be coming out her ass in a few hours.", "The difference between a joke and two dicks is your sister can’t take a joke. NTA", "NTA. Your sister sounds like a lot of fun at parties /s", "OMG, I almost peed my pants!\n\nNTA, I am laughing too hard to type, practically!!!!", "NTA but stop letting your sister ruin everything. Tell her to stfu.", "NTA\n\nYour older sister sounds like a real... Nevermind, you already know.", "NTA your mom should've known better. She has the table manners of a stray", ">Also, you can’t inhale and swallow at the same time.\n\nWell. You kinda can, I do it all the time while laughing and I choke on my own saliva.\n\nI agree that it wouldn't just be the paper stuck in her airways. However, I'm curious as to how she didn't realise while chewing that she was eating paper cause if she didn't chew then it wouldn't have been the paper she choked on.", "Bravo!", "I have ADHD and function like this mom everyday. Mess is right. I feel for her.", "I was thinking the same. Some of my fondest memories are of my parents laughing. It's especially nice when they're laughing at themselves for having done something scatterbrained or silly. Laughing with my daughter is my absolute favorite thing in the world. That oldest sister is gonna be a total dud to live with if she can't chill a bit.", "I laughed so hard, and all I could think of was, \"Gosh, Mom would have laughed just as hard with me!\" I am sure your kids will get to that point as well.", "So is the oldest sister.", "[removed]", "Or even on the chance you don’t so choose.", "Right! I don't understand how an entire fortune cookie fit in her mouth, or how someone who is apparently familiar with fortune cookies would pop the whole thing in their mouth and not immediately know where the fortune went. Or how any sane person would throw a fit over a missing fortune.", "sorry, it means she literally snapped her fingers at him to call him over.", "Can you talk while laughing", "The mother sounds like a cartoon character with her dramatics.  I would be mocking her too.", "You can mistakenly inhale with food or water in your mouth - this leads to the down the wrong pipe scenario, but you cannot inhale and swallow simultaneously. Since the mom did not go into a coughing fit it’s safe to assume the cookie and paper were swallowed. \n\nI’m also curious about her not noticing the paper but also how you shove a whole fortune cookie in your mouth at once.", "Well, it was a fortune cookie. Some of those don't taste too much different from paper.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Definitely, NOT the asshole. I wouldn't be able to contain myself either. \n\nUn-fortunate-ly for your mother. Her fortune went to shit later. \n\nSorry for the puns. This one had me laughing, so I couldn't help it.", "Ummm that means your mom is not a good customer.  They are probably having new people serve you guys as part of training.\n\nYour oldest sister sounds like a killjoy and your mom sounds like a daft old lady already", "Seriously rude behavior on mom’s part and I went from being both skeptical (how do you not notice you’re chewing paper??) and sympathetic (because Ick) to ”what an AH.”\n\nESH.  Hope dad left a huge tip to compensate for his rude wife, the scene his family created, and treating a server like crap.", "Ahh okay thank you for letting me know. I think I'll go with NTA in that case! (I hope she won't snap her fingers at waiters again though.)", "She does, that’s true, but she’s a person. And her family is making fun of her enough that she said what did I do now? Maybe it’s because of seeing my parents decline, or what I see at work, but she seems so befuddled it made me wonder if she’s having early cognitive decline."]}