{"id": 30816, "submission_id": "17tem05", "title": "AITA for refusing to to give up my career to raise my half sister", "selftext": "Ok some context my mom became unable to work due to loosing function in her legs and right arm due to suffering a stroke. So this left no one available to care for my half sister as her father isn't currently in the picture and doesn't want to take her in and just sends child support checks once a month. This lead to my mother reaching out to me and asking if I could take her in since she could no longer afford full time care for herself while having someone take care of her.\n\nI told her that I couldn't take care of a kid and I wouldn't want to even if I could and she's got to find some other solution. This is mainly due to me having to travel internationally ever other week for work. So I told her that not many jobs would pay nearly as well if I worked locally and It would be a pain to find another job near were we live. I also told her that it would be a terrible financial decision to give up a really good job in a lucrative industry just so I can parent a kid that I didn't want in the first place.\n\nShe tried to offer the child support amount as compensation but that doesn't even cover the cost of raising a kid much less the 6 figure pay cut Id take by switching jobs. So I told her theres nothing I can do for her and to try other options.\n\nSo AITA", "created_utc": 1699771647, "permalink": "/r/AmItheAsshole/comments/17tem05/aita_for_refusing_to_to_give_up_my_career_to/", "score": 757, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > For refusing to take in my half sister so that I dont have to give up my career\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, may I ask how old your little sister is? The only AH in this story is her father, who refuses to take care of his child, seeing it is his responsibility.", "NTA. This situation sucks but it's not your responsibility to raise a child that isn't yours. That being said, I'm sure there's *something* you could do to help out, no? Like I said, it's not responsibility, but it could provide some relief for both of you.", "A boarding school could be a good solution.", "I don’t think you’re TA for not wanting to raise her, but if the difficulty for your mom keeping her is financial and you’ve got a lucrative job, what about helping pay for keeping her with her mother? If switching jobs would mean a 6 figure pay cut, it sounds like you could significantly help without hurting yourself.  NAH so far, but refusing to help would be pretty selfish.", "NTA and I hope you do what's right for you. Help where ever you can, but it's not your responsibility, and honestly, it sounds like you really dont want to. Its so unfortunate what happened to your mom and the situation that they're in, but you'll hold serious resentment that you dont deserve.\n\nDo what you want to help, but don't let it affect the trajectory of your life.", "NAH for the central question but unless you are missing out a lot of pertinent information the way you responded to your mother seems both cold and lacking empathy. Your mother is very ill and needs support, it was completely unrealistic of her to expect you to upend your life but support doesn't mean you have to do that. Can you not help your mother with working out what her options are? Sitting down with her, going through her finances, researching on her behalf her different options? That's support and it might mean your mother feels less alone.", "NTA. The dad should step up not you if mom cannot. She needs a nanny and not expect you to give up your life to raise your sister when there are options available.", "I will preface this by saying that I raised my two brothers. So I am biased. It’s unavoidable. \n\nI want to first say that I didn’t raise my brothers because my parents asked me to. I raised my brothers because my parents got them taken by the state and I didn’t want them to go into foster care. I was in foster care and it is not a good life at all. \n\nYou phrasing the situation as if it’s a favor your mom asked you to do that’s simply inconvenient to your life 100% makes you TA in my opinion. There is no mention of what the fate of your sister will be if you do not help. There is no concern for her. Your sisters life is falling apart and you don’t seem to have any empathy for that. \n\nAlso, your mom didn’t run off with a man. She had a stroke and needs help. \n\nIf there is some underlying issue that wasn’t addressed or that I missed, then I may change my mind. I hope I am missing something cause this post and the comments make me kinda sad. You don’t owe your mom anything, but again this isn’t just an inconvenient favor. She’s in a dire situation and needs help. And your sister is a child. I’m sure she isn’t exactly okay with her mom not being able to be her mom anymore.", "NAH, it's just a shitty situation. I do think boarding school would be a good option if you can find a solution for the school holidays. \n\nYou don't say which country you're in, so I'm going to give some UK centric suggestions, though you may find similar options in your country\n\n- state boarding schools - few people know about them, but the education is free and the family pays for the boarding element https://www.ukboardingschools.com/advice/the-state-boarding-schools-association/ \n\n- Christ's Hospital in Horsham; they are a unique charity boarding school where most of their students are there on bursaries, and a great many of them are from situations like your sister's, where foster care is the alternative \n\n- most independent boarding schools will have a bursary scheme which your sister may be eligible for. These can be up to 100% of the fees. \n\nIt will, of course, be much easier if your sister is bright and doing well at school.", "NAH, but barely. You are pretty close minded about helping, and it comes across as lacking empathy. That doesn't mean you should take your half sister and give up your career if that would be more than you are willing to do. But what CAN you offer? If your mom is going into full time care, your sister has literally no one. CPS isn't the way to go, but reaching out for social services with your mom (not against her) and making sure she and your sister are both getting their needs met might be an option. Or taking her in but finding a care person to be with her while you travel could be an option. Or helping financially somehow so that your mom has more options to pursue, or....any show of support other than the \"it's not my problem\" vibe you are sending now. Just acknowledging how difficult it must be for them would help them accept your no more easily.", "You couldn't offer to help defray the cost of someone to take care of her?", "NTA at all, these people commenting about how you could help more. Respectfully you don’t have a clue what this is like. It’s a lot, not just financially (which you are all focusing on) but emotionally.", "Sounds like you can afford to help.", "NTA\n\nThis kid isn't your responsibility. If you were to take them in and leave them alone and something happen, you would be arrested. \n\nYou have a good life and a good career, throwing it away is stupid. \n\nAlso quick question: what is your relationship with them like. I have sent it asked or adressed.", "NAH\n\nOP its not your fault if you don't want your sister, since she is not your kid nor your responsibility. What happened to your mom was unfortunate. I hope you two find a solution to that since your half sister is just caught in the crossfire.", "NTA There’s a father. It’s his responsibility to take care of his daughter.", "NAH But how can you help.  What solutions could you offer? Could you get a live in \"nanny\" maybe someone that can watch over her when you are gone . Foster care at that age must be so scary for the girl. I hear girls are very vulnerable in the system to all kinds of abuse.", "NAH but the way you speak about the situation and your family rubs me the wrong way; like no empathy or concern at all.", "It's the father's responsibility not OP's", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOk some context my mom became unable to work due to loosing function in her legs and right arm due to suffering a stroke. So this left no one available to care for my half sister as her father isn't currently in the picture and doesn't want to take her in and just sends child support checks once a month. This lead to my mother reaching out to me and asking if I could take her in since she could no longer afford full time care for herself while having someone take care of her.\n\nI told her that I couldn't take care of a kid and I wouldn't want to even if I could and she's got to find some other solution. This is mainly due to me having to travel internationally ever other week for work. So I told her that not many jobs would pay nearly as well if I worked locally and It would be a pain to find another job near were we live. I also told her that it would be a terrible financial decision to give up a really good job in a lucrative industry just so I can parent a kid that I didn't want in the first place.\n\nShe tried to offer the child support amount as compensation but that doesn't even cover the cost of raising a kid much less the 6 figure pay cut Id take by switching jobs. So I told her theres nothing I can do for her and to try other options.\n\nSo AITA\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH Whilst you are not responsible for your sister as a parent… I could not imagine allowing her to move into a group home at 14. Surely you could afford a nanny or boarding school? Or the father could? Or there is another family member who can assist?", "Up front, I don’t think you’re the AH for not wanting to take your half sister in, particularly given the monumental impact it would have on your career and future. You didn’t have the child, your lifestyle isn’t suitable for a child, you certainly don’t have to change everything for your half sister’s care. I also think it’s insane for your mum to ‘offer the child support as compensation’. If you’d be taking your sister in, you’d be eligible to child support from both parents, not just the dad. Your mum certainly wouldn’t be able to keep it.\n\nThat said, I do think there are more options than simply your half sister ending up in foster care or you giving up your job to care for her. She’s 14 and you’re clearly earning a lot, put her in boarding school on the weeks you’re away (or all weeks). At 14, your half sister should realistically be capable and independent enough that she could survive alone for a week during the holidays when you’re away, and you could try to adjust your schedule to avoid a month away during summer holidays. You could also pay a live in housekeeper to be there when you’re not if boarding isn’t suitable. I’m sure your mum would be happy to contribute what she’s able if she’s going into a care home. If neither of those are options, do you have other family or close family friends who might take your half sister in for some financial support?\n\nTLDR - not the asshole for refusing to give up your career but I hope you look past that as the sole option. Your half sister is already 14, so it’s only 4 years until she goes to college, don’t let her fall into the foster care system when you could do something.", "Info, do you know your halfsister? She isn't your responsebillity. But if seems to me that you don't care about her at al? Is there another sollution to find?\n\nI'm not judging you, just asking.", "NTA but you handled it like one. Help find a solution. There’s a child’s wellbeing at stake.", "Nta", "Can the child support agreement with the girl's father be reassessed due to this major change in circumstance?", "YTA purely for the way you talk about your half sister. \n\nNo. No one should be forced to give up their life or career for something they didn’t ask for\n\nBut you’re an arse for not even having some compassion for this poor child. \n\nShe’s 14. She’s never had a father. My mother had a stroke and is now going into care. And let’s face it although your mum had carers your half sister will have been also caring for your mum. She’s not going to have had a parent in the usual role looking after her. As a child she has already had to step up. Now you’re dispassionately standing back while she gets thrown elsewhere. \n\nYou earn six figures. So you’re not dumb or poor. You’re a total arse for not trying to find a way to help your half sister. \n\nYou come across as cold to the point of chilling.", "Why would you have to give up your career? She's 14? She can practically take care of herself. She's probably terrified, no one seems to want her... it's sad you have the ability to change her life for better or worse. I don't care what people say you were given a choice and you don't even sound like you're open to trying to find a solution just get validation. You say it's mainly travel. Pay for a person to come in and help your mother and sister. Someone to prepare meals, make sure she did her homework and shop once a week. You sound like scrooge and she's your tiny Tim.", "NTA. it's a bad situation but, it's not you're responsibility.", "NTA you have to Focus on your own Life", "NAH, but is it possible that you can work with child services in your area to come up with a sort of arrangement where your half-sister goes to foster nearby and you are still involved when you can be? Then, once your half-sister reaches, say, 16, you can take her in and she can look after herself, virtually. Would that work?", "NTA  Could you help pay for home care so mom can stay home with sister?", "NTA.\nYou need to be clear if it’s because you can’t financially / career wise or you don’t want to. The title suggests the former, but your full post suggests that regardless you don’t want to. Neither make you TA necessarily, but there’s no point trying to find work arounds for challenge of your job and raising a kid if that’s the not the dealbreaker. \n\nFor instance, Could you find a young person who wants a live in part time nanny job? Someone who would be around while you are gone and make sure sister is ok on those days but doesn’t have to babysit as such because she is 14.", "NTA", "NTA. You don’t want to take over care of your half-sister, and that is understandable, you’re not one of her parents and thus have no obligation to care for her. \n\nHer father, however much he doesn’t *want* to care for her, *is* legally obligated to, and since the mother can no longer care for her, he *can* be legally required by the state to take over full custody of the child, but it will take a court order and some time to do so. \n\nWould you possibly be willing to assist your mother with court costs and lawyer fees? If so, **have lawyer file a motion for a change of custody of behalf of your mother**.\n\n> Either parent may bring a motion to return to court and **request a change in custody and/or visitation if there is a substantial change in circumstances** that supports the parent's claim that **a change would be in the children's best interests.** ([x](https://www.lawfirms.com/resources/child-custody/child-custody-modification/modify-custody.htm))\n\nWhile it wouldn’t be the best circumstances for your sister, it would most likely be a better option that having her become a ward of the state — and, depending on your state’s laws, they may not accept her as a ward of the state if she has a parent who is determined to be able to provide care for her. \n\nYou should discuss this with your mother ASAP and attempt to come up with appropriate next steps to take in regards to the custody of your sister.", "You seem pretty insensitive but I don’t know yalls relationship", "NAH. I’m thinking the best solution might be boarding school. It sounds bad until you think of the options.", "NTA", "NTA \n\nBut you're a crappy sibling.", "NTA", "NTA. Can you offer her financial help?", "While the responsibility is more/solely on the parents, did you offer any alternatives or brainstorm with your mum on what can he be done so she doesn’t feel all alone especially how that her health has set her back?", "So  it isn’t your direct responsibility to take your sister in . \n\nI don’t know the relationship you have with your mom or sister so I can’t judge you on your tone and delivery of your response to your mother as it could stem from prior issues or you could just be that cold. \n\nHowever , no one should expect you to give up your life or career to take care of your sister, but I do feel YTA on the basis that you aren’t open to finding other ways to help. \n\nYou don’t have to take her in to help her , yes you make 6 figures but I don’t know your lifestyle to assume you can afford to help with monetary assistance either . But providing support and empathy wouldn’t cost you anything and you won’t lose your career over it . \n\nUnless your mother specifically demanded solely that you take your sister in and refuses any other solution , your not wrong for not wanting to lose your career but you are selfish for not even considering any option where you might be able to support them even if it’s just to brainstorm.\n\nThen again , if this relationship you have with them has a bad history and there’s tough situations that has carved its way into being this way , then I would negate what I’ve said above .", "Slight YTA. Just for saying there’s nothing you can do. You’ve said in your post that you are paid well, could you pay someone to help out? Like a nanny or au pair, that could stay in the home with your sister, or does she have a friends family that she could move in with and you compensate. \n\nYou seem very disconnected from the situation but this is your 14 year old sister who doesn’t have a dad around and who’s sole care giver isn’t able to take care of her.", "YTA. You make 6 figures and can't help out in ANY way? If you had a normal job you would NBTA. But damn sounds like you e got the means to help with a solution AND your mother is offering to give you the child support. Help her find a baby sitter or something.", "NTA not your problem to deal with", "Impressed by all the N T A  here.\n\ncan you prioritize money and yourself over family ? Yes\n\ndoes that make you an asshole? Sometimes yes too\n\n&#x200B;\n\nyour mother had a stroke that left her severely incapacitated. Your sister is on the verge of loosing everything. She is a teenager, she doesn’t need diaper change and I am pretty sure she can take care of most of her needs. What she needs is a safe place and a responsible adult while her mother is getting better.\n\nyou are ready to let the system have her instead of finding a way to make it work.\n\nyou could take her in and use all that money to have an au pair for exemple or just someone who comes everyday to check if she needs anything. You could offer to have her while you are there and let her spend the rest of time at her mom’s place, but in the end you chose money over family and in this case, I call that an asshole move\n\n&#x200B;\n\nYTA", "NTA.\n\nThis is in no way your problem to solve. Your Mom and the kid's bio father should reach out to other family to make arrangements for her care.\n\nDon't quit your job. Don't even offer to pay to put her in boarding school or expenses if other family take her in. That's just wrong all the way around for her parents to dump responsibility on you.", "Tbh YTA, but not for not quitting but sounds like you could afford a nanny/babysitter whilst you’re away. You should come up with a solution that doesn’t mean your sister ends up in foster care immediately after her mother becomes disabled.", "Your mother (and the father of the kid) is the asshole here.\n\nYou would be an asshole only if she was your daugter.", "Balancing work commitments with family responsibilities is challenging, and it's evident you're facing a difficult decision. Perhaps consult with your mom to jointly explore alternative solutions or support networks that can assist her and your half sister. Collaborative problem-solving may lead to a more feasible resolution.", "NTA even if I feel bad for your half sister she still not your responsible. Raise teenage who mother just have Stoke is not easy job. Not only request money but you will need to spend time and be patient with her. At 14 she will test all boundaries you set sometimes she might tell you that you not her mother it not something people who still don't want to have children can handle.", "YTA and when you're old and alone at least you'll have your money, mcduck.", "Have you tried looking into homeschooling her so she can travel with you she can pretty much raise herself", "7w", "NTA. What about grandparents? Are there any? The parents of the father has no interest in their grandchild either?", "help pay for a good boarding school?", "Maybe called cps on your mother talk to them maybe cps can get your step sister dad  to take care of her if cps in involved tell them what going on with your mother she is unable to take care of your half sister", "NTA", "NTA OP, but I was wondering, have you considered boarding school? I went to boarding school and even stayed there during school breaks, except for a few times when I could come home.\n\n That way your sister could stay out of the system and she could spend time with you when it’s possible for you. I used to go weeks without seeing my family at a time.", "You are NTA in this instance. I am sure you really feel for your mom's situation (a stroke is no joke!), but I'm sure with some careful checking, there are resources within the community that your mom can look into to assist her financially (disability and the like) for her and your sister's care.", "Honestly NTA\n\nGiving up your life, essentially, to raise someone else's kid you didn't sign for is not required however bad people make you feel. Ultimately you live for you\n\nWould you be able (pooling child support, potentially a child support review from court, and you adding to it) to just send her to boarding school?", "NTA.  I’m sorry that your mother is in this situation, but it simply isn’t your responsibility.", "NTA. You deserve to have your own life. You are not your mothers back up plan.", "Have you though of boarding school? Could be a viable solution?", "You need to find a good boarding school for her.", "NTA. It’s sad but you aren’t obligated to take care of kids that aren’t yours. Yes you make 6 figures but between inflation, student loans and the cost of housing 6 figures doesn’t go as far as it used to. You have a right to save and invest in your future. Your mom needs to put the pressure on your half sister’s dad, not you.", "You cant cover the care?", "YTA. If you make SO much money, use it to facilitate a solution. You may not be obligated, but karma eventually finds a way.", "NTA but try to spend time with her when you aren’t traveling and can. She’s the one getting most screwed here, through no fault of her own.", "NTA\n\nIt's harsh wording, but the truth is that you are an adult and have responsibilities. You should not have to give up a well paid job and your own life for your sister. If you can, maybe you could send a bit of money to help with more home care so mom and sis can manage together. Otherwise, what about dad's family? Are there no grandparents, aunts, uncles that could help out?", "NTA you don't owe them anything go enjoy your life", "Nah,  can you find her a boarding school?  Your salary won’t count so she maybe able to get a scholarship,   Then you could maybe just see her a couple times a year,  but save her from foster care", "I do think YTA for handling this as callously as you are. I mean this woman lost the use of her legs and arm and is facing the awful situation of being unable to care for her child and instead of “what if we explore x” (boarding school, other financial help so you could afford care for her when traveling, whatever)  it’s just “figure it out”??", "shes 14", "Also the mother is a big asshole.\n\nYou should never put the burden of a kid on his/her brother/sister.\n\nHere we are also talking about a stepsister", "OP said in a comment that mum is going into a care facility.", "Good point you make", "Why should the OP be forced to help? I don't understand why this kid is their responsibility. It doesn't even sound like they have a good relationship and the mother is desperate.", "Mom is disabled, she qualifies for disability payments, and so would the child. That plus child support should be enough to hire a college student or a friend mom to look in on the half sister living with OP. She could rent a bigger place and \"rent\" a room to a college student. With the idea that she keep an eye out on The half sister while OP is traveling.", "the post is basically the main ideas exchanged not quotes from the convo.", "Apparently he \"does not want to\" but too bad for him.", "Totally agree - not the AH for not doing it, but the AH for the lack of compassion", "Yeah refusing to help in any way is cold. Even if op doesn't take her in, at least make her feel like she's not being abandoned by another adult in her life (dad frex. And mum through no fault of her own.)", "Exactly what I thought. Really the mom is in a terrible situation and needs help. I’m sure OP could help find another option that could work for everyone.", "You said everything I wanted to say and with a lot more compassion.", "The ah here is the father running away from his responsibility not op. The father is responsible to take his daughter in now that the mother can't care for her", "I was waiting for a comment like this. Everyone who says OP isn’t an AH isn’t taking into consideration that they’re just abandoning a child because it’s inconvenient to be helpful (based on the information in the post). Teenagers are pretty self-sufficient. She doesn’t need that much help, just someone to stay home with her while OP travels for work. If OP makes so much money, why can’t they hire someone? Or why can’t OP help financially so their half sister can stay with their mother? Technically speaking, OP’s half sister isn’t their responsibility but doing nothing to help? Very cold and selfish. I’m sure there’s some solution that wouldn’t mean everyone in that poor girl’s life leaves her alone.", "Totally agree! He has an opportunity to make or break this child’s future. He doesn’t need to upend his career but could at least offer to help in some form.", "This may possibly be linked to poor or barely existing relationships. I can’t imagine someone loving their sibling and being indifferent to whether they go into foster care. Or loving their parent and bluntly refusing to think of solutions. I have 2 halfsiblings I have no relationship with because reasons. But I love my dad and if he were in an unfortunate situation, I would find a way to at least chip in for them to avoid the system.", "The dad is alive and well why tf can't cps force him to take her in?!", "Seriously! And the people suggesting boarding school don’t know how much that costs.", "literally! all i see is, “well maybe you can help out”, that’s not OPs responsibility.", "child custody can definitely be modified in this situation, and the court may decide that him taking over full custody, even though he doesn’t want to, would be in the best interest of the child", "Not OP's responsibility", "You can't leave a 14 y/o alone for a month. The mom is going into a care facility. It isn't OPs responsibility and the father should be made to care for the child.", "OP said she had home care but their mother is being moved to a facility", "Uhm, dad is still alive if he's paying child support. Time for him (or his family) to step up. Its not OPs responsibility to pay for care for her half sister.", "I share your opinion. I feel sorry for the teenage girl.", "How is her mother the AH, she did not choose to have a stroke...", "This might sound cold. But tbh, not her child, not her responsibility.", "Do you really think dad is gonna step up to the plate and help his kid? He never has before and he won't now. Calling cps is only going to Make things worse and will probably get the child taken away.", "This is horrible advice.", "Is she not old enough to mostly take care of herself with maybe a little support? \nI get that it's a lot for a 14 year old but rather that then going into foster care is something. \n\nWhat are the things she needs help with? Is it food, for example, that is solvable. Washings that is easy to teach.", "Yeah that’s old enough to take care of herself.\n\nIf she was 5 it would be another game.", "I don’t think the mum is th AH at all here for being in an impossible situation. She is clearly acting out of desperation and trying all avenues to prevent her child going into care. She’s be a shit mum if she didn’t at least ask", "Half sister, same mom, different father. \n\nBut I get that the mom asks this, the other option is her child ending up in fostercare where they are often treated horrible.", "I think it’s half sister but this 100%. \n\nI was a child carer for both my parents and I say with the nicest of intent you need to go and live your own life. This is a huge ask, you can’t give up your life for someone else! \n\nI have managed to climb the career ladder but the financial and emotional toll for years and my sacrifices meant it had hindered me in many ways.", "I really doubt she had the stroke on purpose dude. YTA", "Maybe the kid has good friends whose family would take her in if OP (and the child support) compensated them financially?\nu/New_Dependent1597", "\n\nNTA.This kid isn't your responsibility.", "It’s their sibling going into foster care, wow dude.", "OP doesn't want the responsibility of taking care of the half sister, at all, period.", "Mate you gotta elaborate on your family dynamic and relationships a bit here to get any fruitful input. \n\nIf there isn't much connection or the relationships are strained between you it's at least more understandable how you apparently want nothing to do with sour half sister. \n\nIf there's no tricky background like that yta kinda because it doesn't seem like you want to make any effort to help with this shitty situation. Besides taking her guardianship if you wouldn't want that you could actively help getting your sister in a good situation whatever this will be, you could chime in with money instead, you could help force her father to take up his parental duties, etc. You could also just talk to your sister to ask her what she herself wants and if she has any ideas how to solve this situation.", "Info: was cps made aware your mom can't care for your half sister anymore? Can't they force  her dad to pay for a boarding school for example or take her in? She's his responsibility after all", "Dur yeah I said that\n\nBut it takes a b cluster personality disorder to stand back and do fuck all\n\nI’m not saying the op should change their life in any way. But washing your hands of this child is heartless to the extreme.", "Most people actually care about their relatives and friends.", "She is moving to facility because she can no longer afford full time care at home.", "She did not even have to ask to her daugter to take care of her half sister.\n\nShe put a burden on her and Op is now guilt-tripping for what she hard to answer.\n\nAs a mother she had to think well with whom she was conceiving a child (having already had a first daugter with another man she couldn't play the naive girl anymore) and later fight with the father to make him being present with her.\n\nYou have to think everything before conceiving a daugter when you are already in your 40s (i assume the mother is now 55+ for having a stroke).", "I think OP does have some moral responsibility here. If they have a decent relationship with her mom and half sister, they should try to do what they can to prevent this child from ending up in the foster care system. OP’s mom is disabled. It’s not like she’s a deadbeat mom that doesn’t want to parent her own child. OP shouldn’t have to give up their career, but that doesn’t mean they should do absolutely nothing.", "even if he doesn’t want to ‘step up’, the state can force full custody onto him, and can put him in jail if he doesn’t comply with their orders", "Its more of me being gone for long stretches of time cant leave a 14 year old alone for a month", "Now she Is desperste, but she had to plan it better before having a second daughter with another man.\n\nIt's the asking which define her as a shit mom towards her first daughter (not towards her second one of course)", "So she has to ruin the life of her first daughter (who has to leave a good job to parent a child who is not her daughter)?", "While I agree with the idea I don't understand why cps can't force the father to take his own daughter in?!?", "It's their half sister. We do not know if they even have a relationship.", "He would have to quit his job to take her in. Mom going into a home, dad not in the picture. I don't understand what you want him to do.", "Yeah no, let's not add to the stigma of cluster Bs", "You said not their responsibility but they need to find a way to have the kid taken care of IE making 8t OP's responsibility again.", ">fight with the father to make him being present\n\nLOL good luck, can’t force him. Doesn’t even sound like he gets the kid every other weekend, just sends a check. \n\nIt would be nice to just go to the other parent and say “hey take the kid I’m physically unable to care for her” but is that really the best interest of the 14 year old when he’s already so absent? Doubt it.\n\nGranted it’s not OPs responsibility either but mom is not the AH for merely asking. And OP isn’t the AH for saying “no”.", "People can have strokes at any age.\n\nMy sister had a stroke as a baby whilst in the hospital, a colleague of mine in his 20s had a stroke at work, I know a 17 year old who had a stroke whilst playing football.\n\nLife is full of unexpected events, so you can't cal the mother an AH", "You have no idea how things happened with the mom and the father of her child. You are purely guessing to make the mom look horrible. \n\nPlease grow up. There are thousands of possible scenarios.", "People have strokes at any age", "If they had a decent relationship and OP was willing, she still has no responsibility unless she signs up for it. \n\nNo one should be guilt-tripped into caring for someone else’s child, family or not. It’s not good for the person nor the child. The only people responsible are the ones who created the child.", "No, but I mean with your mom, or is your mom not living in her own home anymore? Is she in permanent care or at homecare?", "No, but couldn't another family member help out in that time? By the time I hit 15 I was pretty much able to be self sufficient at home (my mother also had a disability so really just took me to the shops and gave the money).", "If moving jobs would result in a six-figure pay cut, then I suspect you have the luxury of being able to afford a solution to that problem. If you wanted to. \n\nLike a boarding school or a live-in nanny for a couple of years. \n\nOr if she has good friends at school, you could ask one of their families to house her during term time/when you aren't in the area, and pay her expenses.", "NTA for not wanting to shoulder the responsibility of caring for your sister. Is there anything else you can do, such as support financially, without it being too much of a burden?\n\nOr do you even care for your sister? It sounds like you don’t really see her as family (understandable if she is only a half sister).", "I thought every other week?", "Who plans for such a life-altering medical event though? \nAlso how could she have known that the father would be a deadbeat? \n\nThe first child is entitled to refuse the request but the mum isn’t the AH for asking in this situation at all.", "How could she have known that she would fall ill. \n\nI like that you completely vilified the mom but say nothing about her father.", "I get your sentiment, people should have a plan for the care of their minor children in case of an emergency illness or death. The reality is shit happens. Mum could have had a plan and now the relatives are backing out, have moved, are dead or just simply can't look after the daughter anymore.", "She simply asked her and tried to come to a solution. \n\nAnd you might see it as \"ruining her life\" others would not, that is personal and no harm in asking.\n\nI parent two children that are not biologically mine, it's not ruining my life.", "They certainly won't if she has to go into foster because op won't help in any way\n\nI'm not saying they have to take her in, but basically abandoning a minor sibling when you could do something (pay for care, have her when op is in the country, something)?\n\nThat's cold. And an ah move.", "While I agree that OP isn't responsible for his half sister, he makes enough to afford someone who could look after her in his absence. He could maybe send her to a boarding school. \n\nShe's 14, she doesn't need that much care. At her age she should be able to prepare her own meals, clean after herself, get ready to school and more.\n\nShe's still his sister and unless there's some conflict we don't know about, it's weird that he won't do anything at all to help her. It would be very different if OP's sister was a toddler, but teenagers are pretty self sufficient.", "No. The op can skip off into the sunset with their six figure salary if they want. \n\nBut that would make them an arse as far as I’m concerned. \n\nIve said they shouldnt feel forced to look after the child. Of course that’s NTA. Then I gave my reasons for why it’s not a total NTA. \n\nThey don’t need to spend any of their precious money if they don’t want to. But me personally i would struggle to not at least attempt to find out what resources were available and options etc to help this child. \n\nThe op has basically said I don’t want the kid. Not my problem. End of. \n\nMeh. If you think that’s okay I guess you do you.", "She could rely on a lawyer and bring him to his duties.", "I mean the court and state can *absolutely* modify their current child custody agreement, and require the father to take over full custody of his daughter— he *is * legally required to provide care for her. \n\nCurrently, he is doing so in the form of child support, but due to a significant change in circumstances (specifically in the mother’s health), **full custody of the child will likely be legally required of him** as the state will consider that to be in the child’s (and the state’s) best interest. \n\nLike, if there is a safe option for child custody that isn’t going into state care, they are going to take that option every time.", "Of course there are, but in no one of them a mother should ask her first daughter to throw up her career to take care of her second daughter.\n\nAnyway in most countries, if the mother is unable the daughter would go to her father's home", "She used to have homecare but is moving in to a fulltime care facility", "I am getting \"Shady Pines\" vibes from OP'S and his mother's relationship.  There is just the tip of an ice berg showing here.  Might be reaching...but that job of OP's sounds like they clawed free of a difficult past and have zero intentions to be dragged back in.", "Why does op have to fund their half-sister though?", "But OP would still be financially responsible for that and physically responsible for what....a nanny at home while they're traveling (wouldn't leave a teen in my house alone)", "Why wouldn't a half sister be considered family?", "yeah thats the scheduled thing but sometimes i will be gone for quite a bit longer", "The father is obviously an asshole. But it's not Op Who chose him to conceive a child", "You shouldn't ask THIS to your daughter and let her guilt-trip about.\n\nIf Op wanted to raise a kid, she would have had her own daughter", "But you *chose* to parent those kids. They weren’t forced onto you, were they?", "It's funny how so many people on this sub are huge AH's themselves.\n\n\"Yeah sure, abandon your disabled mom and send her daughter into foster care, so you don't have to pay 2% of your 7 figure paycheck. You have no legal obligations, which means you have no *moral* obligations either!\"\n\nSickening..", "Boarding school is very expensive. That’s a lot to ask of OP. The dad should pay for it then.", "Yes because lawyers and custody cases are so cheap for someone going into a facility after a stroke\n\nEven if she could afford it, you can’t make the dude be a father. Is it really in the best interest of the child to go that route? Nope.", "She simply asked because the mom is in a horrible situation. I would have been insulted if my mom was in that situation and did not ask me, I would gladly help to find a solution for my little sister.", "That info maybe needs to be edited in so that the reason why your half sister needs a carer. \n\nYour NTA but this isn't an easy solve", "Can’t she ask to not be moved into a care facility that forces her to abandon her own dependant child? Surely whoever organised your mums care package must realise your mum is responsible for her 14 year old daughter and that a 14 year old child can’t just be left to fend for herself?", "Ah, OK, that part was missing. \n\nBut it's your choice, whatever you decide, you are not the a-hole. \n\nBut 14 year old can be pretty independent, so maybe reach out to other family members for help. That someone else takes her when you are travelling and she can stay with you when you're home. \nIt's basically only for 2 years. \nOr depending on in which country you live she could go to a boarding school. If the father refuses to take her in, he is obligated to pay at least a part of boarding school. \nTalk to your sister, ask what she would like.", "Is there a reason why you’re engaging with these comments searching for a solution but when it’s your mom it’s “can’t, figure something else out yourself”? It’s very strange that you wouldn’t try to explore options given the magnitude of the situation", "They don't, but this is Am I the Asshole, not, Do I Have To. This is their 14 year old sister who might go into foster care if they don't help their mom find a solution to where their sister can live. And they make a six figure income. Even if it's not their sister living with them, they have the resources to help her find somewhere to live that is better than foster care, and that is the non-asshole move.", "If half sister was born after OP had moved out, they might not have had any kind of relationship. But OP has been pretty sparing with the details.", "It depends on the circumstances. If OP is old enough to barely have familiarity with his half sister, then technically she may be family but it very well may not feel like that.", "Because technically is just \"half family\"", "NTA but why can't cps force the father to take her in?!", "She did not guilt trip. Stop making up your own scenarios. She asked. I would have been upset if my mother had not asked me first. Not everyone is the same as you.", "Neither is TS half-sister forced of her. I was asked to help raise these children, and I said yes.", "That depends on OP's location and the type of school. My country offers dormitories for high school students, it costs about $40-60 per month for a bed in a shared room. Food is not included. \n\nDad is already paying child support that OP's mom offered to give him. Dad is an asshole, it's clear he doesn't care and will let his daughter go to foster care, that doesn't mean that Op has to follow his example.", "If it's a full care facility then there are unlikely to be one that would let a dependent live with her.", " Boarding school seems like the ideal option. Then it’s only holidays to worry about.", "Technically?? \nIn families, the relations are never similar.\nFor example a cousin, who you share 2 grandparents with is family, but by your definition someone you share one parent with is half family? How would you call cousins? 1/4 family?", "You said yes, so again, you *chose* to parent them. There may be no harm in asking, but once OP said no, the mother should have accepted that and not attempted to bargain with them to reconsider", "OP isn’t the parent though. Also, it is likely OP didn’t grow up with this kid and doesn’t have much of a relationship with her. If OP is already making a good salary, they must at least be in mid to late 20s and the kid is 14. They might have barely grown up together, if at all.", "Then surely OPs mums care package should be amended so mum can stay in her home and her child isn’t made homeless. My son has a care package and it’s created with his entire home life taken into consideration. I just can’t imagine that OPs mums care package was created without anyone considering how OPs mums daughter will be taken care off?", "She is a desperate mother trying to keep her child out of fostercare, give her some grace.", "I get that, I even said he has no responsibility towards her.\n\nHowever, he is doing well financially and says he won't help at all. It simply doesn't feel right that the wealthy older brother would rather let his sister go to foster care than tried to help her and his mother in some way. \n\nYou don't need to be very close to your siblings to have empathy towards them. She's still his family and Op doesn't mention any issues. They can work on their relationship and get closer.", "If she was trying to keep her child out of foster care, she’d be taking the girl’s father to court on a motion for a change of child custody."]}