{"id": 30818, "submission_id": "17tfym8", "title": "AITA for staying in my car during kid’s birthday party?", "selftext": "F21 here. Babysat my younger siblings, F10, F8, M6, for the weekend. Unbeknownst to me, they were invited to a 5 hour birthday party at the lake.\n\nStepmum dropped off the kids while I drove to transport paddle boards. I was expected to stay the entire time, despite legally not being allowed to transport the kids with me after the party (licensing laws). Everyone at the lake was either 10 or 45 years old, I didn’t know anyone, no one really spoke with me. \n\nAfter an hour, I decided to sit in my car and play on my phone instead of silently sitting, watching the kids play. I could still see the lake from my car. \n\nAfter ~2 hours, one of the kids mothers opened my door and angrily said “We’ve been looking for you around the lake because we thought you were missing. You’re here to look after the kids so can you look after your siblings please.” \n\nI felt terrible. So embarrassed, loathed her tone, and prayed she wouldn’t tell my stepmum. \n\nAITA?", "created_utc": 1699777776, "permalink": "/r/AmItheAsshole/comments/17tfym8/aita_for_staying_in_my_car_during_kids_birthday/", "score": 42, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1.  I stayed in my car while kids were playing in the lake, including my siblings. \n\n2. Maybe I was breaching water safety? If anything went wrong I’d be the first point of contact, and I was in my car without telling anyone I was there.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Given the risks of water, if the kids were swimming / in / on the water then i think it woukld be pretty obvious that the adults to be supervising their own kids, so if that was the situation YTA , its common sense that you don't leave kids unsupervised around water and its not reasonable to expect others to supervise 3 extra kids, especially without checking first. \n\nMaybe your stepmom was also slightly to blame for springing the event on you and not being clearer,  but honestly,  you are an adult and the only reason you were there was for the kids, I don't really get why you would think it was ok to leave them unsupervised. \n(If it was a different kind of party where kids were just dropped off and picked up later ypu wouldn't have been needed at all, since it sounds like your stepmom was there to drop them off and that someone else was going to drive them home. What did you think you were there for?)", "You state you “babysat your siblings this weekend”, meaning you were supposed to be watching them at the the birthday party and were not invited there to meet people your age?! YTA for letting them out of your sight.", "Even if you could see the lake from your car, you were scrolling your phone so you wouldn’t have seen the kids get into danger. So gentle YTA. \n\n“Gentle” because it seems that when you agreed to babysit, the 5 hour lake party was unbeknownst to you. It should have been made clear to you up front so you could decide whether to babysit or not. I personally would never have agreed to watch someone else’s kids at a lake but you weren’t given the opportunity to say no. \n\nBut when all is said and done, since you found yourself in a position of responsibility for the kids, you should not have been in your car.", "you were put in an unfair situation, but it was not the right time to rebel. Always watch kids near water. Always.", "YTA. If anything had happened to the kids while you were supposed to be babysitting them and you were in the car, would you have been able to get to them in time? \n\nYou need to talk with your stepmum to avoid future situations like that but in the moment your first responsibility was to care for your siblings and you didn't do that, you sat in a car, playing on your phone for long enough that other moms thought you were missing (most likely cause your siblings were looking for you).", "YTA.\n\nYou were supposed to be babysitting them, which means you're responsible for them even at a party.\n\nI get it, you misunderstood, it happens. But yeah if you're supposed to be watching your siblings, watch your siblings.", "YTA. You don’t take kids to a party and not watch them. ESPECIALLY by the water. That is so dangerous!!", "Unfortunately, events at a lake do require parents to stay and supervise.  Sorry.\n\nHer angry reaction was partly fear.  Don’t take it to heart.  Life is a learning experience .\n\nGentle YTA", "Slight YTA.  It kind of sounds like stepmom played you a bit.  I’m trying to imagine saying yes to watching kids you can’t really interact with on a lake for 5 hours.  But yeah you gotta watch them by water.  My god though 5 hours and I’d be thinking about calling the police.", "YTA Lakes are fucking dangerous for children and you were their guardian. Wtf were you thinking?", "YTA. Although those kids are not yours, you took them to the party. If you're taking a CHILD to a party, you're responsible for them the entire time. ANYTHING could of happened, what would you have done if they went missing, drowned or got severely injured and you had no idea because you were BORED. What was you thinking when you decided to leave them alone?!\n\nEDIT : Youre 21?! Act like a damn adult, I thought you were 17 with your lack of judgement! You said \"I pray she doesnt tell my stepmum\" Yeah because you know what you did was wrong.", "YTA. You should have put them in someone else's care explicitly or returned home with all of them if you weren't willing to watch them. As people have said, lakes and water are extremely dangerous and the safety of your siblings should have been your first thought as their caretaker. Babysitting means you are responsible for them. You are an adult and you should be grateful no one drowned as a result of your negligence.", "YTA", "Ummm, why would you agree to this?  The mothers can watch the kids. You aren’t their parent and this should not be your responsibility. \n\nAlso, who has a party with small kids at a lake?\n\nNTA", "YTA", "YTA. What the hell is wrong with you? Leaving children unattended at a party AT A LAKE? Honestly you’re a grown adult and couldn’t comprehend that it wouldn’t be ok?", "NTA , Everyone is assuming you know how to swim . Everyone is assuming you should have just known your duty . Sorry folks not every young adult has the right way an answer in every new situation.  The stepmother failed , she is  responsible for her kids .", "NTA - not your children.\n\nStepmom should have been there.  Unless you were being paid to babysit!", "NTA.", "NTA fuck them kids lol", "YTA and extremely irresponsible. You left your 3 young siblings to play in the water without proper supervision. Drowning is silent and takes a matter of seconds. \nAre you mentally challenged in some way?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nF21 here. Babysat my younger siblings, F10, F8, M6, for the weekend. Unbeknownst to me, they were invited to a 5 hour birthday party at the lake.\n\nStepmum dropped off the kids while I drove to transport paddle boards. I was expected to stay the entire time, despite legally not being allowed to transport the kids with me after the party (licensing laws). Everyone at the lake was either 10 or 45 years old, I didn’t know anyone, no one really spoke with me. \n\nAfter an hour, I decided to sit in my car and play on my phone instead of silently sitting, watching the kids play. I could still see the lake from my car. \n\nAfter ~2 hours, one of the kids mothers opened my door and angrily said “We’ve been looking for you around the lake because we thought you were missing. You’re here to look after the kids so can you look after your siblings please.” \n\nI felt terrible. So embarrassed, loathed her tone, and prayed she wouldn’t tell my stepmum. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Info: Why were you the one babysitting when stepmom was available? Did she just drive the kids there and then turn around and leave?", "Honestly I thought my stepmum just wanted me as an extra pair of hands to transport the paddle boards and mingle with people. There was no run-down from her, but maybe I should’ve figured it out on my own.", "I, too, would like to know why OP thought she was there for. \n\nYou can't drive the kids home but needed to stay there. You needed to stay there to supervise. Of course you were an asshole for not supervising. It wasn't even like you accidentally got distracted for a few minutes by something else going on. You actually removed yourself from the gathering. You aren't \"first point of contact.\" You are first line of defense to prevent drowning.", "this might be the most on-the-verge ESH i’ve ever been, gentle YTA is like one degree above that i think. we need to draw a spectrum!", "OP didn't take them to the party and isn't allowed to transport children. That was their actual parent's job, as was telling OP they were responsible for the children in the water.", "No. The important thing is that she agreed to babysit. Of course it's her responsibility then. I don't see why not receiving money should make it ok to neglect the kids after you agreed to watching them", "I was with you until the unnecessary insult", "Does she do this often? Assume that you are available for whatever task she decides is your job?\n\nI know this situation sucked but sitting in the car was the wrong move. You put your siblings at risk, even if you could see them, how long would it have taken you to rescue one of them from the water?\n\nThe real problem here is that you are not setting boundaries with your time and how you deserve proper notification about family events and expectations. Do you rely on your stepmom for anything? Do you live at home? \n\nIt shouldn't be up to you to \"figure it out on your own\". Your stepmom should have properly and clearly communicated her expectations to you *and you should have the opportunity to decline*.\n\nA good therapist can help you work on standing up for your needs and setting healthy boundaries for yourself. \n\nBe kind to yourself. I'm sending you the biggest hug.", "You’re an adult. Yes you should have common sense to not leave children unattended by you at the lake. Come on."]}