{"id": 30826, "submission_id": "17thnpn", "title": "AITA for feeding my nephew(12) salmon?", "selftext": "A lot of people in my country have been skeptical of imports of seafood from Japan since they released the Fukushima water. My sister and I never discussed it though.\n\nShe asked me to watch my nephew while she attend a friend’s wedding out of town. During that time, I made him pan seared salmon with garlic butter. I thought it would be fine since I bought and used Norwegian salmon, so even if my sister was worried about Japanese seafood she wouldn’t see a problem with this.\n\nMy sister was upset when she found out I gave him seafood and called me a bad uncle. When I told her it’s from Norway, she said ‘How do you know the supermarket didn’t lie to you? Or that the Norwegians didn’t buy fish and resell it at a higher price?’\n\nTo be clear, I do not believe these theories, but I still hated seeing her distressed. Am I wrong for distressing my sister?", "created_utc": 1699785372, "permalink": "/r/AmItheAsshole/comments/17thnpn/aita_for_feeding_my_nephew12_salmon/", "score": 100, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole since what I did distressed my sister.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nIf you have never discussed it, you can’t know it’s an issue. You bought Norwegian on the safe side\n\nI think you’re an awesome uncle for cooking pan seared salmon with garlic butter- most people complain their children get fed junk food", "This is a story for /r/choosingbeggars \n\nNot only does she want free childcare, she wants to specify the origin of the seafood you feed him, and when you've caved to that it's still not good enough. \n\nTell her she can provide all his meals in future, fully pre-prepared in tupperware boxes, as you clearly cannot be trusted to feed your nephew. \n\nOr just decline to babysit. \n\nNTA", "Your sister is a conspiracy maniac. NTA", "NTA.   \nYou were making your best efforts to respect her wishes - no Fukushima salmon.   \n\n\nNow you know it’s ‘no salmon’. Does your sister track a lot of consipiracy theories? I mean, I wouldn’t eat fish from the seas around Japan, or most of Asia… I understand that entirely, but this sounds like she’s down a rabbit hole of conspiracies when she starts talking about shops lying and reselling of cheaper product etc.", "NTA and your sister is on something, not sure if it’s Japanese or Norwegian, but it’s herbal.", "if i do someone a huge favor like watching their child while they’re out of town and they follow that with calling me a bad …anything, really, we’re going to have problems. and if that kid’s not eating any seafood she better be compensating for that or he’s gonna have problems as well. nta.", "NTA. And guess what? You don't have to be a free babysitter anymore. I call that a win-win situation.", "[removed]", "NTA. Her paranoia is a little much.", "NTA\n\nIf she is worried about the radiation from a small bit of fish, is she also monitoring radon levels and granite walls/kitchen worktops?! Granite contains uranium too. Everyone gets exposure to low levels of radiation, she’s panicking over nothing.", "NTA. Your sister is distressing herself with these conspiracy theories. She needs to knit her next tin foil hat one size bigger, since her current one seems to be too tight.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA lot of people in my country have been skeptical of imports of seafood from Japan since they released the Fukushima water. My sister and I never discussed it though.\n\nShe asked me to watch my nephew while she attend a friend’s wedding out of town. During that time, I made him pan seared salmon with garlic butter. I thought it would be fine since I bought and used Norwegian salmon, so even if my sister was worried about Japanese seafood she wouldn’t see a problem with this.\n\nMy sister was upset when she found out I gave him seafood and called me a bad uncle. When I told her it’s from Norway, she said ‘How do you know the supermarket didn’t lie to you? Or that the Norwegians didn’t buy fish and resell it at a higher price?’\n\nTo be clear, I do not believe these theories, but I still hated seeing her distressed. Am I wrong for distressing my sister?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Next time, tell her to fly to Norway to buy salmon.", "Yes, some studies have shown that Chinese Nuclear Power Plants releases more radioactive water every year than Fukushima.", "Thank you. And I am not surprised. The Japanese take safety VERY seriously, China not so much.", "Yes, and several other countries were on scene in Japan making sure that the water was at a safe level, to release it into the ocean.  The only people overseeing China is China.", "Actual Norwegian here. I’m speechless! This will be my favorite question shopping our national dish from now on - how can i be sure this fish is not, in fact, Japanese?!!!!\n\nYour dear sister sounds both uninformed and anxious. Which will lead to distress no matter what. Your dish sounds delish btw, hope he liked it! NTA", "I’m sorry I cannot get over the Norwegian black market Japanese salmon", "NTA. You sister is delusional if she thinks that the Norwegians would buy fish from somewhere else and resell it.\n\nThe thing about Japanese fish being bad BC the controlled release of water from Fukushima is bs. \n\nThe Chinese are fishing in Japanese water and that fish is apparently fine, just not ones that where caught by Japanese people. And China is also releasing way more from their plants that are far more dangerous.", "I mean how does she know the supermarkets don’t lie to you about anything?", "Fukushima paranoia notwithstanding, Norway is the world’s largest salmon exporter, accounting for almost 50% of global salmon exports.  Japan is not even in the top 15.  The country in the 15th position, Germany, accounts for less than 0.5% of global exports.\n\nThe Japanese salmon fishery is almost entirely for the domestic market.  Under no circumstances would Norway, the world’s leading salmon exporter, be importing salmon from Japan, one of the smallest salmon exporters.\n\nNTA", "it's her kid...and she's entitled to be a conspiracy nut all she wants.  But unless she gave you dietary instruction beforehand tell her that her anxieties are on her.", "NTA, I feel like she went in mad and then just couldn't reverse course when you said you accounted for the thing she was concerned about. In either case even if there Is a concern with the fish a one off should not be an issue for him safety wise.", "NTA. \n\nI would eat Japanese fish with no problem. Then again, I understand radiation and amount they release it. Which is not much.", "NTA. Don't ever do her another favor", "NTA.\n\nIf she didn't give you rules about what to feed him, how were you supposed to know?", "[removed]", "NTA. And, uh…what?", "NTA.\n\nIt's up to you whether or not you apologize, but be clear: you're NTA, she's just being paranoid.", "NTA\n\nYour sister is being paranoid. Don't you think a supermarket will face severe consequences if there is something wrong with the food they sell?", "NTA.\n\nDoes your sister not realize that 120+ million Japanese people have been eating salmon (and everything else local) for the past decade? And that literally billions of people have been eating salmon from Japan and elsewhere in the world? Does she really think a stray bit of radiation from an accident more than ten years ago is going to jump into a fish that you then happen to buy and feed to her Precious Baby?\n\nYour recipe sounds lovely, BTW; I usually use dill and white wine, but I’m going to try garlic butter next time.", "NTA.  Your sister is a paranoid jackass.", "Nta. She's either stupid or very stupid. Perhaps remarkably stupid.", "People need to go outside. NTA. \n\n>How do you know the supermarket didn’t lie to you? Or that the Norwegians didn’t buy fish and resell it at a higher price?’\n\nI wouldn't watch my nephew again. I am not dealing with this level of anxiety spiraling.", "NTA!\n\nDid your nephew like the salmon? If he did, maybe she doesn't like it or doesn't like preparing it and she's not upset he might ask for it.  \n\nOne of my aunties was mad at my parents about that when they watched my little cousins while she went on a trip.  They tended to eat a lot of take out but my dad was a great cook (and was teaching me) and we did mostly homemade meals (which my cousins really liked) and after their mum got home they wanted food like dad made.  She was really upset about it.", "NTA\n\nAsk her how she knows her tinfoil hat is lead-free.", "NTA -,you sister is Basically Conspiracy nut. If she wants her kid to avoid all fish she needs to tell you before you agree to look after her kid.", "Nta does she grow all her own food? If not, then her 'the supermarket could be lying to you!' applies to *everything* else too.", "Can’t be Tupperware, plastic micro-particles. And no rice, it all has arsenic. And they could be lying about beef not having prions, no beef either. And eggs can have salmonella, lettuce or sprouts could have E. coli, water is poisoned with fluoride by the government to make us dumber and complacent, and… and….\n\nThat poor kid is going to starve.", "And bananas! \n\nThat’s right, bananas contain naturally occurring radionuclides — radioactive potassium-40, to be exact — which, according to the EPA, means they can emit .01 millirem (0.1 microsieverts). \n\nSo, eating a banana actually presents more radiation exposure than if you were standing next to a spent nuclear fuel dry cask or nuclear power plant!\n\nhttps://www.energy.gov/ne/articles/5-radioactive-products-we-use-every-day", "[Norwegian salmon is used for sushi](https://www.npr.org/2015/09/18/441530790/how-the-desperate-norwegian-salmon-industry-created-a-sushi-staple). Pacific salmon had parasites that made it unsuitable for sushi and it was otherwise thought to be gross.", "Yes, of all places and all fish, the chances of getting fraudulent Japanese salmon marketed as Norwegian is sort of like getting fraudulent Idaho oranges marketed as from Florida. Technically possible but never, ever going to happen in the real world.", "“Went in mad and couldn’t reverse course” is exactly what I’m guessing. She had whipped up her own paranoia and indignation so far she couldn’t drop it immediately, so she had to reach for “Norwegians are lying and selling Japanese salmon!” to maintain her ire, even though that doesn’t make a lick of sense financially or logistically. Like a reactive dog who can’t get at a squirrel and so whips around and bites you instead.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Screw it. Let's go to McDonald's.", "TIL,  but it makes sense. Thank you"]}