{"id": 30837, "submission_id": "17tlfvk", "title": "AITA for not wanting to pay half the rent while we live three people in the house?", "selftext": "So, I (30F) live with my roommate in a house of 3 bedrooms. In the beginning we had another roommate but he left and it was difficult to find another one, so we kept it just the two of us. A couple of weeks ago his new girlfriend moved into our house.\n\nI wanted to discuss with him about the rent, but because of our different working hours, there was no time. A few days ago he texted me to announce that she will not pay rent and only pay 1/3 of the bills.\n\nI refused, and this conversation followed\n\nHim \"Why she stays at my room and we rent the rooms, not the house\"\n\nMe \"In that case I should still pay for 1/3 of the rent and also she uses the third room. She just not sleeps there. \"\n\nHim \"But she stays here to see if things work between us, and also she won't have a stable job for a couple of months\" (note that she works part time but earns almost as much as I do in full time)\n\nMe \"So what? When I was unemployed for three months I was still paying rent.\"\n\nThe conversation ended there and he is like never happened, but since then his GF is always aggressive with me. Not that I care.\n\nAlso, something that makes me really mad. My roommate was always a sharing guy, such as I, but since she came they both are like \"yours are also ours and ours are ours\". I mean they eat my food and she uses my beauty products, which are quite expensive because I have sensitive skin.\n\nI'm really thinking to move out, but the thing is in my country is really difficult to find a place that accepts pets, even though it's illegal, not too.\n\nSo ATIA here?\n\nEDIT: Because some people didn't understand why I don't want to pay half the rent. We rent the house and not the room. I didn't agree for her to move here. Also something I didn't mention is that the landlord, told us in the past, when it was only both of us, that if a 3rd person come again to live here, he will raise our rent. Not very legal but we can do nothing about it.", "created_utc": 1699799618, "permalink": "/r/AmItheAsshole/comments/17tlfvk/aita_for_not_wanting_to_pay_half_the_rent_while/", "score": 192, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I do not want to pay half of the rent while we are three persons living in the house\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Get a lock box to lock up your make up and maybe a small fridge for your room, then a camera that you'll set up in your room.  \nMake absolutely sure that if one thing gets taken again you'll call the police for theft.  \n\n\nmeanwhile look for a new place to stay.", "If they are using the third room, they are occupying it. Therefore, it is 1/3 op and 2/3 boyfriend and girlfriend. Also I guarantee boyfriend and girlfriend are splitting that 1/2 of the rent. OP shouldn't be subsidizing them. Also, OP should start locking their crap behind their bedroom door because apparently they are also using her things, but telling her not to touch theirs. OP is NTA.", "NTA. This is a bit of a grey area, people will have differing opinions. It's not surprising that the couple who will get the most advantage by splitting the rent 50:50 feel that they should only pay 50%.\n\nMy opinion - nobody should move in an additional roommate without talking to the other roommates and forming an agreement before they move in.\n\nYou have to share all of the common areas with a third person, so I feel the rent can be split in 3 along with the other utilities. Optionally, part of the deal could be their usage of the 3rd bedroom. I'm sorry she's using your products - that's straight up rude. \n\nI lived in a 2 bed 1 bath apartment with a roommate. My boyfriend moved in with us - we took the larger bedroom and we paid 2/3rds of the rent because my roommate now had to share the space and facilities with 2 people instead of 1.\n\nSame thing happened 3 years earlier when my roommate at the time (different girl) had her bf move in with her for a few months.", "You have to pay to sleep a night in a inn or hotel so why should her case be any different 🤨 I would tell the land lord and I would lock the stuff up in your room along get a mini fridge and stuff to keep your food away and pay the portion of rent you are required to pay since there's 3 people there's no need for you to pay more than needed If there's 3 people there now they need to step up and learn", "A roommate should never move their mate in without permission by all and agree to the terms. Sounds like renting the house with a spare bedroom since the other left. 50/50. Not 1/3 and 1/3 and sorry can’t pay the other 1/3rd bc we aren’t using that bedroom. NTA.  Pray you can find elsewhere and he finds out that she wasn’t worth it after all.", "I was in a similar position a couple years ago going. My roommates boyfriend was staying with us 5/7 days a week. Our bills went up dramatically. I finally told her either her bf can’t stay as often as he is or he needs to be contributing. He argued he was contributing… to HER funds (groceries, her portion of bills, etc). I told her that she was getting a cheaper ride while I have to pay more because of her choices. Finally, I told her she could live with him and I left. She freaked tf out because they “weren’t ready to move in together”. \n\nI would chat with your landlord. I know you mentioned they’d raise the rent if there was a third person but if you tell him that your roommate has moved in his girlfriend without your and their permission and they are impeding on your peaceful environment you may be able to work something out. I would also recommend leaving, even though it’s hard right now to find housing. Maybe reach out to a housing agency to aid you. Do you have any friends or family to stay with at all?", "If you were renting a room from a landlord, you'd be responsible for that room and that room only. There are 3 rooms and they are occupying 1 of 3. Therefore, IMO they are only responsible for 1 of the rooms.  If someone else moved in & they occupied the third room, would you then still expect rent from the girlfriend and therefore it being 1/4?  I personally think them offering 1/3 of the bills is totally fair, since they're not taking up any further space.", "rent shouldnt be changed unless theyre in a bigger/better room\n\nhowever utilities and all other expenses should be divided by 3", "NTA. Did you agree for the girlfriend to move in beforehand? If so, you should have discussed rent sharing beforehand. \n\nIf she moved in without your agreement her name isn’t on the lease, you can have her evicted. If your roommate doesn’t like that he can also move out.", "NTA: My old roommate did this to me. I moved out after 3 months. His GF used 3x the electricity and water as me but refused to pay. Bye bye.", "Even if it's temporary, that's not really a valid reason not to pay another share of the rent for the time she's staying with you. NTA.\n\n(And the gf would have been the AH even if she'd paid rent, you just don't use someone else's beauty products without asking. Even if they wouldn't have been expensive, it's quite disgusting when someone else puts their fingers in one's facial cream...)", "This is a tough one.  Maybe a compromise would be best.  You pay 2/5ths, and they split the other 3/5ths between them.", "Nta", "NTA. Go to the landlord and let him handle it. Maybe they will move and you can find new roommates. Don't let them walk all over you with this nonsense. Good luck.", "3 people in a house, each pays 1/3 rent. These situations always piss me off. My friend let her BF live in our DORM ROOM rent free for 2 months. Dont be a pushover, the other person needs to pay to live there.", "These situations are always sticky. The gf should be paying a portion of rent and utilities. If they're using up your stuff and not replacing it, start hiding your stuff in your room. Definitely recommend a lock. Wonder what your landlord would think about someone living there who's not on the lease..", "NTA. They don’t care about you, I’m sorry to say. They’re using you as a cheap way to live together. I would start looking for somewhere else or tell your landlord there’s a third tenant.", "YTA. If they are sharing a room then it is 50/50 on rent.   \n\nFor utilities though yes it should be 1/3.", "I lived with a friend and my boyfriend in a 2br apartment. We each paid 30% rent, my friend paid 40% rent. Together we paid 60% of the rent, but we each paid 1/3 of the utilities. They should absolutely be paying more because they are more people. Nta.", "Rent splits by bedrooms. Bills split by person. If she’s using the third bedroom enough that you can’t get another roommate, she needs to pay a third of the rent.", "Somewhere between 1/2 and 1/3 is fair. Based on rough usage, she would still use 1/3 of the bathroom 1/3 of the kitchen and 1/3 of the living space but only 1/4 of bedroom. A fair split would be something like you pay 2/5 and they pay 3/5 between them.", "NTA. They may be sleeping in one room, but the GF has her stuff in the third bedroom, she has use of the kitchen, bathroom, living room, etc.  The rent needs to be split three ways.\n\nThe fact that you now have to keep your food at your boyfriend's house means that you functionally can't use the kitchen you are paying for. Time for your roommate to get his head out of his ass.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, I (30F) live with my roommate in a house of 3 bedrooms. In the beginning we had another roommate but he left and it was difficult to find another one, so we kept it just the two of us. A couple of weeks ago his new girlfriend moved into our house.\n\nI wanted to discuss with him about the rent, but because of our different working hours, there was no time. A few days ago he texted me to announce that she will not pay rent and only pay 1/3 of the bills.\n\nI refused, and this conversation followed\n\nHim \"Why she stays at my room and we rent the rooms, not the house\"\n\nMe \"In that case I should still pay for 1/3 of the rent and also she uses the third room. She just not sleeps there. \"\n\nHim \"But she stays here to see if things work between us, and also she won't have a stable job for a couple of months\" (note that she works part time but earns almost as much as I do in full time)\n\nMe \"So what? When I was unemployed for three months I was still paying rent.\"\n\nThe conversation ended there and he is like never happened, but since then his GF is always aggressive with me. Not that I care. \n\nAlso, something that makes me really mad. My roommate was always a sharing guy, such as I, but since she came they both are like \"yours are also ours and ours are ours\". I mean they eat my food and she uses my beauty products, which are quite expensive because I have sensitive skin.\n\nI'm really thinking to move out, but the thing is in my country is really difficult to find a place that accepts pets, even though it's illegal, not too. \n\nSo ATIA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Get your products into your room. Stop sharing your foods. So if she pays 1/3 then she gets exclusive use of third bedroom.\n\nI'd have suggested doing a 40/60 if you wanted to share the 3rd room", ">I mean they eat my food and she uses my beauty products, which are quite expensive because I have sensitive skin.\n\nTell her no. You're going, I want to move out but actually tell her, don't use my stuff, don't eat my food, I'm not here to support you. If she's rude, match her energy. \n\nWhy did you drop this discussion? Where is your landlord? He just moved someone in and said, nope, no rent, but it doesn't sound like you rent by it room, it sounds like you split the entire rent. Get him out, why should you have to leave? NTA.", "NTA- if there are three people living there, each should pay rent. It doesn't matter if the 3rd room is being used. Get a lock on your door and ensure your stuff is put away each day when you're done with it. Also, consider letting the landlord, or whoever is in charge of where you live, know about the \"new tenant\".\n\nI would still start looking at moving. This situation sounds like it could only get worse. Best of luck.", "NTA it's not about what room she uses for sleeping or not. she's living there, so she's paying rent as the rest of you, simple as that. and wtf is that about her using your stuff? that's crossing some serious boundaries.", "NTA\n\nI lived in a house with 3-4 roommates at any given time. When significant others where there all the time utilities went up significantly and the place was crowded ALL OF THE TIME. After silently keeping my frustration to myself for months I came up with a partner tax. If they effectively live at my place without paying rent they must cover a fair share of the utilities and an additional fee. The terms were more than fair considering they basically lived there but it sent a clear message. We ended up agreeing that partners would be there no more than 50% of nights at the house unless they wanted to contribute to household expenses.", "Get a college shower caddy and put a your skin care items, soap, shampoo etc in it and carry from your room to bathroom. Leave dove soap in bathroom since it is mild. Always lock things in your room .  Label food say since bills have increased you are no longer able to share with 2 people, store as much as possible in your room. Lock the door, before GF sounds like life was pretty equal and new GF upset the balance and it’s no longer equal. So lock up your stuff and if they push back ask for a list of their things that were shared with you. Probably big nothing, then list things of your they are sharing , bonus points if you estimate cost. Explain you can’t afford to share, subsidize, them any longer. Insist GF help with utilities. On side look for other living arrangements.", "Tell the landlord that roommate snuck another person in. Ask what your third of the new rent will be and pay the landlord directly. Let your roommate argue with the landlord about why his girlfriend shouldn't have to pay rent.", "NTA - if the original roommate paid rent why wouldn’t a new one? And her using your beauty products is out of line.", "NTA\n\n&#x200B;\n\nsimply refuse.", "YTA \nRent out the third room. Only bills should be split 3 ways.", "Move out - this will just get worse. NTA.", "Read the lease and the number of allowed occupants that are allowed to live under the roof if y’all want to argue over rooms vs people. NTA", "Nta\n\nKick her out already. The nerve to make you pay for HER LIVING EXPENSES, WHILE making your home a hostile environment.", "Yes we rent the house, but now all of a sudden things \"changed\".", "We rent the house, not the rooms. And also all her things are in the 3rd room. But again the landlord rents the house and not the rooms.", "There’s a common area that everyone uses, so it’s not just renting rooms alone.", "I dunno where you live, but as a roommate, you have run of the house. She's using the living room, bath, kitchen, etc. Also, OP noted that all her belongings are in the third bedroom, she just isn't choosing to sleep there.\n\nThat means a 1/3 split in my head.\n\nIn any event - this should have been discussed BEFORE she moved in, and if OP disagreed, she should have been given time to find alternate living arrangements.\n\nI call BS for anyone moving in a SO and not clearing it with extant roomies first.", "We rent the house not our rooms", "I didn't agree. One day I came home and she was there.", "Thank god I keep my facial and body creams in my room. But she used my face soap, my makeup remover and my serum, which are quite expensive. But what makes me really mad is that she felt entitled to them and didn't even ask me to use them.", "Hide within a locked room and get a lockbox", "Absolutely agree. They are being entitled and taking advantage of OP.\n\nKick the GF out of the third room, and start advertising for a new roommate. If they complain, then it is their choice to not rent that room and they are responsible for that rent share.\n\nLock your room door with a camera in there facing the door. \n\nMove your stuff out of the shared spaces, get a little bathroom basket to carry in each time you need it.", "Well our landlord will have another opinion when he finds out. As I said at another comment we rent the house, not the rooms and that with a third person he will raise the rent", "Nope. Couples who share a bedroom always have to pay more than if there was an individual in the bedroom. Because it’s an extra person in the house, using the shared spaces as well. That’s an inconvenience to other housemates and needs to be compensated as such. In OP’s situation, the split doesn’t necessarily have to be equal thirds (and might depend on whether GF uses same bathroom as OP or only an en-suite), but the couple together should definitely be paying more than OP. I’d suggest something like 60:40, couple to OP. That way the GF is only having to chip in for 10% of the rent at most, assuming the BF doesn’t mind continuing to pay his 50%. \n\nEqual split of bills is fair.", "Well the thing is that when we were just the 2 of us, the rent wasn't split by bedroom. We are paying rent for the house, not for the bedroom. But now all of a sudden it's per bedroom.", "But that’s not how rent is charged. A 2 bedroom apartment isn’t 2x the rent of a 1 bedroom because that’s not most of what you pay for. When living with a couple it should be a 60/40 split", "I lived with a couple and we split the difference, where they together paid more than I did but my share was bigger than their individual ones", "Does that mean gf can’t use the living room, kitchen, bathroom, and hallways? She’s not just staying in a room, rent needs to be split by person not room. Living with a couple is soooo much worse than just 1 person per room.", "I agree. 60:40 split. Housemate can keep paying his 50% if he wants, so GF only needs to come up with the extra 10%. If the housemate wants to subsidise his GF he can, but OP shouldn’t have to.", "They also buy groceries etc. But, because I'm a cook and I have a soft spot for delicatessen food, especially cheeses and meats, they use them leaving me with almost nothing. Labels didn't stopped them, so I started leaving them in my boyfriend's house and I cook there for the past few days.", "100% agreement with this and.\n\nSince he refuses to discuss the fact that a third person is living in the house, simply give him 1/3 of the rent monthly. She doesn't get a free house to live in, and just because she works part-time  doesn't exempt her paying rent, and it's just a test run anyway. How many more times is going to keep doing test runs if this doesn't work out.  What women in and out. You know nothing about her exceptnshe is selfish  and entitled.\n\n Also, she is using 1/3 of all the utilities, so when the utility bill comes five hom 1/3 of that ad well.  He wants a test run to see if living together will work. We'll, a test run includes everything not just the \"can we live together\".\n\nYou should not carry the dime for their test run.  By the way, did he even ask you to let her stay their before she moved in? Didn't you have an agreement that both had to approve a new roommate. He is unilaterally telling you how you will live.  Just suck it up, buttercup. Bullsh*t.\n\nPeople only only wall over you when you let them.  So, don't ask him if he can afford to live their with his \"test\" girlfriend.  By the way, why is she willing to be the \"test\" girlfriend?  This living situation is crazy all around.  He is using you right now to work on love life.", "The lease doesn't refer something for this, but the landlord told us that if we have a third person he will raise the rent. And trust me I won't pay for this", "Tell your landlord there’s a 3rd unregistered tenant. Let him address it. What does your lease say about people moving in", "then you \"change\" things as well. get a small fridge for your foods, and a lockbox for your make up, as well as a camera in your room that points to the door and/or to your lockbox and fridge.  \nThen send them both a text \"because you're refusing to leave my food and my property alone, or reimburse me for the things you've stolen (yes, eating my things or using my makeup without permission is stealing) i will keep my things seperate now. Should things go missing again i will call the police.\"", "Can't you lock your room?  How is she using your products?", "You've asked for opinions, and that's my honest opinion. I can't see how it's any different than it being let on a room-by-room basis.  She's paying a third of the bills, which is the only thing that will change by her being there.  Therefore, personally, I think it's totally right.  If someone else moved in, her stuff would have to also move.", "when paying rent in a shared house you are renting per room. thats why the people you live with are your room mates. you're all renting rooms.\n\ngranted I've only lived on 3 continents so I can only speak for those 5 countries but thats ALWAYS how it worked\n\nedit: if utilities are part of rent (or food etc) that part is def divide by number of people not rooms)", "Talk to the landlord. She can either pay rent or you can leave.  But rent isn't only for the bedrooms, it's for common space.  They're *telling* you that you have to subsidize her life. Fuck that. I'd leave if I were you.", "She feels entitled to have both you and her boyfriend subsidizing her life.  She has zero shame helping herself to anything else.\n\n\n\nStart locking up your things in a lockbox, and if possible keep your bedroom locked.  And keep your face soap etc. in a shower tote you bring with you to the (now communal) bathroom only when needed.  Exactly like a dorm.", "That would have been good info to put in your OP", "Per bedroom what basically everybody considers fair.", "Op, this commenter is wrong. Per bedroom is not fair when there are couples. I’ve suggested above that perhaps a 60:40 split of rent, couple to you, might work. If your flatmate is happy paying his 50%, the GF only has to kick in 10%. You’re paying more compared to each of them individually (30:30:40), which accounts for them sharing a bedroom, but they pay more together, which accounts for two of them using communal spaces compared to one of you.", "So.... they get 2 bedrooms now.", "Smart move!", "You can get locked boxes that go inside fridges. Maybe look into that.", "Wait, if landlord didn’t reduce rent when third person moved out, why would they increase when a third person moved back in?", "Essentially you do have a third person.  Sneaking someone in without telling the landlord may have all three of you looking for a new place to live if the LL finds out.", "Well I used to have some of them in the bathroom. She lives here for couple of weeks and I didn't realize it in the beginning. I only realized when I returned after 5 days of vacation", "Well no, because as I said in another reply, with a 3rd person the landlord will raise our rent. So, no I won't pay half of the rent.", "What is fair about this arrangement?  Having a third roommate is an inconvenience; less free use of shared spaces, arranging times to use the kitchen, etc.  To make up for that inconvenience, there should be some upside, like paying less in rent.\n\nAs it stands, the only ones benefiting from this are the roommate and girlfriend.  That's neither equitable or fair.", "That’s only fair if there are no shared rooms. No shared kitchen, no shared bathroom, no shared living. If you share a house, a division based on the number of bedrooms is unfair.", "Just because he can. In my country tenants don't have many rights, unfortunately", "Well I already checked for a new apartment for me, but having a dog, is not easy here to find a place", "You've asked for opinions and have then become defensive when someone has basically not said what you want to hear.  I still stick by my original response. If you're saying that they're raising the rent because she's moved in, then yes she should pay that extra rent, but if that's not what you're saying I stand by the above.", "More fair than having people who get a room to themselves and people who have to share a room pay the same amount.", "Ah right. Well I probably wouldn’t go down the “tell the landlord and let them sort it” route then, if you think you’ll be able to get away with the third flatmate without LL finding out. Especially if there’s nothing in the lease that requires it. (Just because LL has said he’d increase rent if a third moved in doesn’t mean you have to tell him!)\n\nBut I wonder if you can use this as leverage with housemate? Suggest a reasonable compromise on the rent, such as 60:40, and say if they’re not happy with that LL will need to sort. And then confirm with LL that you’re only responsible for 1/3 of new rent. (This is assuming 1/3 of the increased rent would be less than 1/2 what you’re currently paying, and that LL would accept the split liability and not hold you responsible for the full rent in the event they don’t pay.)", "They dont have to share a room...they choose to because they're a couple. If OP decides they want to sleep in the living room do they no longer have to pay for rent since they aren't using a room?\n\nThey've made a unilateral decision that impacts OP.  They think that OP should subsidize the girlfriend's lifestyle.  \n\nAs it stands there's zero incentive or benefit for OP to allow this arrangement."]}