{"id": 30849, "submission_id": "17tq5hz", "title": "AITA for 'making' my sister sleep in the dog bed outside overnight?", "selftext": "So I'm currently in a leg and arm cast due an accident and so temporarily moved back home with the rents and my younger sister. My parents are currently out of town and so it was just me and my sister. My sister has a tenancy of leaving her keys behind/losing them and usually we have to open for her. She was going out for a party Friday night and I warned her to triple check that she had her keys before she left. Surprise surprise, she left the keys behind so she called me at like 3am drunk and telling me to open up for her. Getting up is missions in my condition and I'd warned so I told her straight up that I wasn't coming downstairs to open for her so she should call a friend and stay there for the night, hung up then put my phone on DND. She screamed my name for awhile until one of the neighbors told her to stfu and so she, instead of calling a friend, decided to sleep in the old dog bed outside. Found her there in the morning and woke up her up to get inside. She was hella pissed and yelled at me for making her sleep in the dog bed. She also found a tick on her later and blames that on me too. \n\nWe've been fighting back and forth over this and so here we are for some impartial voices. I feel bad that she slept outside but also feel like that was poor choice on her part. Am I the asshole?", "created_utc": 1699813288, "permalink": "/r/AmItheAsshole/comments/17tq5hz/aita_for_making_my_sister_sleep_in_the_dog_bed/", "score": 2304, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > She slept in a dog bed and got a tick indirectly because of me so yeah, I can see how I'm the asshole.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta, you didn't make her sleep outside. She chose to sleep outside instead of trying to call a friend or remember her keys. This is on her, you told her to check and she didn't.", "NTA. You warned about the keys. Sleeping in the dog bed was her choice. I don't know your full condition, but depending on it, you would not be able to go open the door to her.", "NTA.  I've been disabled in that way, and getting up the stairs took ten minutes of solid, careful effort that hurt like hell regardless of how careful I was.  Once I was up, I was NOT coming down.  \n\nThe sister is having a learning experience. If everyone will wake up and let her in regardless of whether or not she has her keys, it gives her no motivation to make absolutely sure she has them.  No, that wasn't fun for her.  Maybe now she'll remember to take her keys.   \n\nI have a personal protocol that before my butt moves out of the seat of the car, the car keys are hooked to my purse, and the first trip into the house puts the purse in its assigned place.  This protocol was evolved after the humiliation of having to call for assistance to unlock my car and get out keys and the humiliation of leaving the purse somewhere.  Sometimes the only way people learn is by having things like this happen to them.", "ESH. Your sister needs to find a way to deal with her keys. If she can go out and get plastered, she should be able to manage her keys.\n\nThat said, it's November. Unless you're living somewhere tropical, warmer southern hemisphere, etc. then you literally left your drunk sister in a position where she could have frozen to death? Tried to drive drunk and killed other people? At the mercy of any random person that went by... and for what? To make the point that you told her so about her keys?\n\nIf you had woken her up to a few black toes, would you need to ask if you were the AH? No, it would be obvious. The fact that she wasn't hurt doesn't mean you didn't do an AH thing specifically for the sake of being an AH.", "INFO: Why the hell would your parents go out of town, and your sister go to a party, knowing your situation and the whole purpose of you staying with them is because you are recovering and cannot be in your own home, alone? Anything could've happened to you whilst home alone. Your sister also chose to get drunk, making her next to useless to help you out in case of any emergencies.\n\nEDIT: NTA except for you... you would've been better off just staying in your own home.", "ESH it's obvious where your sister went wrong but I could never leave my sister locked out of the house when I was inside. If it took ten minutes to get downstairs, then it takes ten minutes. I can't see this as anything but heartless.", "INFO: How old are you and your sister? \n\nAnd couldn't you have just tossed your key out the window to her?", "NTA - she could've called a friend or anyone else. It's not your fault she chose the dog bed. Hopefully now she'll remember her keys.", "ESH for sure.\n\nWho the fuck actually let's someone sleep outside when you could just hobble the fuck downstairs even if it takes you 30 minutes to do so.\n\nYou certainly have the right to be pissed at her for forgetting her keys, but that doesn't mean you aren't also an asshole.", "It sounds like she's an adult and your parents have been enabling her forgetting her keys.  Having had a few hip and femur surgeries and I can't imagine trying to deal with also a broken arm, I don't think you're the asshole, but it's a little complicated.  I wonder how many people here actually understand how hard it is to get out of bed when you can't walk.  Add in one arm out of commission...", "Wasn't there recently a case of a drunk woman being left in front of her home by a taxi driver, and because her brother fell asleep and wouldn't open, she was raped by a random homeless man?\n\nSo I mean, ESH, but you're all lucky the tick is the worst thing she got.", "INFO: What temperature was it outside that night?", "Yta bc you still walked downstairs to let her in a couple of hrs later. It sounds more like you made her stay outside as a punishment. She was drunk & it was 3am anything could have happened", "Were the keys downstairs? Couldn't you throw them through the window?\n\nEdit:\n\nAfter reading everything. YTA. \n\nYes, she made a mistake. But leaving a young woman outside, in the freezing cold by herself makes you the asshole. Whatever lesson you wanted to teach her doesn't compare to all the things that could've happened to her. \n\nIf you could go downstairs in the morning, you could've gone downstairs at 3 AM. Actually, if it was so serious...why the hell are you sleeping upstairs? Isn't there a couch?\n\nI've had two broken ankles, and I couldn't walk downstairs even once for the first month. I was dependent on my family's care. Your parents aren't the \"coddling\" type as you say... So who's taking care of you? If your sister, shame on you for not helping her back \n\nIf you're taking care yourself meaning (you go to the bathroom by yourself, go to the kitchen, get dressed, go down), then you could've helped her. Even if it meant it was an inconvenience.\n\nNot only did you leave her outside. You turned off your fucking phone. That's how little you care.\n\nAs a big sister, I'd definitely gone down, even if it took me 45 minutes. I would've slammed the fucking door, yelled at her for being  drunk and dumb, and gone to sleep in peace knowing my little sister is safe.\n\n\"It was her mistake she left her keys, let her fend for herself\"\n\nI hope to God you don't fall down and she leaves you there under the same premise.", "It’s a leg and arm cast…not a body cast. \n\nYTA. Sure, it’s annoying but you just completely ignored her.", ">Found her there in the morning and woke up her up to get inside.\n\nSo you could have went downstairs to help her, you just waited a whole night to do it, Seems like you just wanted to punish her and used your leg as an excuse", "ESH. She was drunk and irresponsible, but you're an asshole for not letting her in. That's risky behaviour, you just never know if someone will come along and take advantage of her.", "I'm confused.\n\nYou state that you weren't able to go down and open the door the previous night but had no issues doing it in the morning. Why?\nWas it really due to your injury or the fact that it was a mild inconvenience? Like others have said, it's not safe to leave a drunk person like that outside, she's your sister and they took you in when you needed their help. Before you come at me, I've actually had surgery and was in a cast for 2 months with minimal mobility and would've opened the door for my sister if I was in your place.\n\nYTA", "ESH, actually I've changed my mind.\n\nI don't think it's reasonable to leave a drunk person on their own in that kind of situation, even in your injured state. Even if you could not reasonably have gotten up, I think you should not have hung up and should have remained in contact with your sister until a friend had picked her up or you determined it was safe for her to sleep in the dog bed until morning.\n\nYour sister, obviously, should have had her keys with her.", "YTA, if you were able to walk down in the morning you were able to walk down at night. You wanted to punish her, very cruel. She made poor decisions but you should have helped her.", "NTA You told her over and over to *not* forget her keys and yet she did ... she's an adult and needs to take responsibility for her actions. She did not have to sleep in the dog's bed *ewwww* she chose to...", "ESH - you’re right to be mad and she was totally wrong to forget the keys especially with you in this condition and with all the warnings. But forcing someone to sleep outside when you are, even with great effort, capable of making it so they don’t sleep outside, is an asshole thing to do. She should be begging you for forgiveness, but it’s never acceptable to force someone to sleep outside. You can’t be 100% certain that she had anywhere else she could go at that point.", "ESH. This is how Leslie Mahaffy was murdered. Your sister sucks for sure but locking someone out of the house is cold blooded. I hope she learned her lesson.", "What did I just read.", "ESH I don't get people anymore, being an asshole is so encouraged here yet irl it's rarely seen like this. It's all me me me. I truly hope you guys don't actually act like this lol", "ESH. She sucks for not making sure she had her keys but jfc don’t leave a drunk young girl outside like that. She could have aspirated and died. She could have been abducted or assaulted by some random passerby. \n\nI get she was shitty for leaving her keys but something very serious could have happened to her.", "YTA do you even give a fuck about your sister? Be honest. \n\nWhen me and my sister were that age, we didn’t get along but even I would’ve dragged my ass out of bed to let her in the house to make sure she was safe. Your sister could’ve been kidnapped or raped or frozen to death depending on your climate. You’re the older one, you’re supposed to watch out for her. \n\nAll these people saying “sHes aN aDuLt. ShE sHoUlD hAvE pRePaReD” clearly don’t give a fuck about anyone but themselves and I’m so sick of the selfish ass people here.", "ESH\n\nyour sister is entitled and this behaviour is likely a result of her being coddled by your parents\n\nyou on the other hand left a drunk girl in a dangerous situation. i get being angry you have every right to be, but even when i was in a full leg cast and would take 10 minutes to climb the stairs i wouldn’t have put a family member or friend in a dangerous situation because i was angry", "YTA.\nEver hear of Lesley Mahaffy?  She was locked out of her house and subsequently brutally raped and murdered.  I'm sure it was a mission for you to get downstairs to let your sister in.  But it wasn't impossible.", "NTA .  You are in a leg and arm cast for Pete’s sake.  You need sleep and rest to heal. \n\nYour sister is the AH for calling you drunk at 3 AM.  \n\nShe is also the AH for being old enough to go out and get drunk but irresponsible to forget her keys, despite you being kind enough to prompt\nHer.  And she is the AH for being so drunk she decided to sleep outside and not phone a friend as you suggested.  Being drunk is zero excuse for not being in control of herself or able to make sound decisions.  \n\nI would say her punishment fit her crime and that it was 100% self inflicted.", "Leslie Mahaffy’s parents did this and their daughter wound up dead.", "NTA", "NTA, you are temporarily disabled and coming downstairs at 3AM in an unfamiliar house could have killed you with a fall.  Your sister is an adult.", "How the fuck does someone go out to a party, know they are getting rickety-rickety-wrecked, will be home late, and STILL not remember their keys!?\n\nI take my keys with me to get the mail from the box which is 1 step outside my front door.\n\nAlso, drunkenly shouting that much that the neighbours told her to shut up!??\n\nI'd die of the shame 🫠 \n\nNTA.\n\nYour sister needs to grow the fuck up.", "She didn't have to think at all to prevent this situation - you did all of the thinking for her. \n\n&#x200B;\n\nShe didn't have to make one iota of effort, nor do one single extra thing to prevent this from happening. \n\n&#x200B;\n\nEven if you weren't recuperating from a painful surgery, I'd have the same judgement. She had multiple, sizable, and easy ways to avoid this situation, and chose none of them, knowing full well what the consequences would be ***for you*** when she made the choice to leave without her keys.\n\n&#x200B;\n\nI'd have told her that I was turning my ringer off when I went to bed, and not to expect me to answer the phone at all.\n\n&#x200B;\n\nNTA and perhaps she'll finally start to think about how these choices SHE makes aren't for other people to compensate for. And that she's not entitled to other people's effort. \n\n&#x200B;\n\nShe needs to understand how these decisions make her look. And that when she moves out, her future roommates are likely to be even less amused by these kinds of \"cute\" antics. And her future neighborhoods may have worse than ticks.\n\n&#x200B;\n\nNTA", "I’m going to be controversial and say YTA. If my younger sister was drunk and vulnerable I would absolutely get down there to open up and let her in for safety means. I’ve been in a wheelchair before after a major surgery so I know what it’s like. I’ve also been drunk and know how stupid you can sometimes be, I lost my passport on a night out, could easily lose a house key.\n\nIf something bad happened to her and you were responsible. Shit if that was me I’d never forgive myself.\n\nJust my opinion.", "If she’s always doing this, has anyone thought about getting a number pad lock for the door?", "Before I shut my door to leave I say to myself Phone, Wallet, Keys, because I have locked myself out before and I never want to deal with that again. \n\nSounds like your parents need to get one of those hide a key boxes for your sister. What would she have done if you weren't there since your parents are out of town. She would have been stuck outside anyway.", "NTA. Sleeping outside occasionally bc you fucked up and forgot keys is just a part partying in your early 20s (or it was for me, I also forgot keys often and lost my phone more than I’d like to admit)", "She is the AH being a dumbass does not mean that others have to pay for your idiocy.", "NTA. \n\nMy brother has *really* severe ADHD and he manages to remember to bring his keys when going anywhere. \n\nSure, he lives on his own in a regular apartment so he sort of has to unless he wants to leave his door unlocked, but still... if my brother can do it, your sister can too. She's just lazy and butthurt that she had to face the consequences of said laziness for once in her life.", "NTA\n\nYou didn’t kick her out and make her sleep outside. You warned her, she didn’t believe that she would face consequences and now we’re here. This is the only way for her to learn.\n\nMy sister was exactly like this, and when we were coming back home from school, she always relied on me to have my keys, even though I asked her to bring hers too. Well, after I graduated, she was left to bear that responsibility. We found her sitting on the stairs waiting for my dad & I to get back home about 2 times before she learnt her lesson.", "NTA you told her to check she had her keys she didn’t check - also she could have gone to a friends", "NTA. Could she not call anyone else?", "NTA. \n\nI won't bore you with details. I travel a lot, way off the grid, somewhat extreme circumstances. I generally don't have house keys. I use a keypad to get in the garage and thus into the house. This would be a problem if we had a power failure and the opener didn't work. I'd need help to get in or I'd have to Uber to a hotel or friend. \n\nIn OP's situation, the sister is an irresponsible git. She was reminded to take keys and failed. She apparently does this over and over. She is enough of an adult to get drunk. \n\nI had stepdaughters who were useless with keys so I installed a [Simplex lock](https://www.gokeyless.com/product/simplex-1000-pushbutton-door-lock/?attribute_pa_finish=satin-chrome&utm_term=&utm_campaign=Shopping+-+Brand&utm_source=adwords&utm_medium=ppc&hsa_acc=5429870158&hsa_cam=322034844&hsa_grp=32599846884&hsa_ad=115563159924&hsa_src=g&hsa_tgt=pla-146298855684&hsa_kw=&hsa_mt=&hsa_net=adwords&hsa_ver=3&gad_source=1&gclid=Cj0KCQiAjMKqBhCgARIsAPDgWlxs-dz99gUZXMyqI4rAU2aZERg9HNGQFW8KGzTNmfdJoBAkfJjA7zsaAoVcEALw_wcB) on one door. Frankly it still enabled their irresponsibility but I was frustrated with changing locks when they lost keys.", "Nobody made her sleep in the dog bed--she could have called a friend or a neighbor and at least had a couch to sleep on, and away from ticks. Maybe she'll remember her keys next time. This isn't the first time and probably won't be the last. NTA", "NTA", "NTA\nShe literally had one job - make sure she has her keys. Lack of planning on her part does not equal an emergency on yours.", "You are just fine. Your sister is an immature drunk who got what she deserved. Maybe next time she will remember her keys. Feeling kind of bad for your neighbors. She owes them and you an apology. Drunks are not known for their decision making skills.", "NTA, the fact that this is a regular occurrence is ridiculous. If she lived alone, she'd be SOL. Maybe suffering the consequences of her own actions will make her more responsible.", "Nta, your sister needs to behave like an adult and tske her keys. Jesus Christ, this is the behavior of an 8 year old. She needs to grow up.", "She forgot her keys after you reminded her, then showed up drunk demanding you come immediately to let her in when you’re in a full arm/leg cast? 🤣🤣🤣🤣🤣🤣 She’s funny and should do standup. Did she always get what she wants? She sounds entitled. Ignore her or laugh at her for getting mad at you. She’s responsible for herself. She’s not a child, even if she’s acting like one. Not worth your energy", "NTA. Go home, your family obviously doesn't have your back during your recovery, might as well stay home where you're comfortable and you don't have to take care of your sister when she should be helping to take care of you.", "Nta but a few things, she is a young woman in a semi incapacitated state (being drunk) so possibly anything could happen to her. But given your situation and you did warn her well…\nWhy don’t your parents put a hide a key outside?\nDid you have your keys upstairs and could you have thrown them out? I know it would have required you to get up but at least you would have not had to use the stairs", "NTA What's the point of moving back home if you're getting zero help and instead responsibilities? I would couch surf with a friend at this point it would probably be better than going up and down stairs and less stressful than staying with family. What if you didn't wake up and answer the phone because it's 3 am? What if you fell from overexerting yourself when you were barely awake? Would you be able to call 911 because your locked-out drunk sister won't/can't?\n\n1) Sister shouldn't have gone drinking with no one there to help you.\n2) She should have remembered her keys. you even reminded her to get her keys yet she still didn't get them. Little children walk home and have to remember their keys.\n3) She was able to get home, call you, and wake up all the neighbors she could ask the neighbors to let her sleep on their couch, call other people, or find another place to sleep like her car or motel.", "if she's old enough to go to a party and drink, she's old enough to remember her keys.\n\nNTA", "You’re both assholed in this situation. You’re like 2% and she’s 98% tho.", "NTA. You reminded her before she left to take her keys. She chose not to take them with her. You explained when she called that you were unable to open up for her, due to your injuries. She could have called a friend, or called a taxi and booked into a hotel for the night. She chose to sleep on the porch. Probably to make you look / feel bad. \nDon't allow her \"I am a victim\" plan to succeed. You didn't make her sleep in the dog bed. She chose to do so.", "You’re  both assholes.🤷‍♂️", "NTA. Sleeping in a dog's bed was her choice as she didn't find another alternative herself.  She's a grown-ass woman who can take care of herself and did so just fine before you had to move back due to your injuries.", "Ah, thank you OP for this read. It was delightful. NTA.\n\nYour sister made her (dog)bed by forgetting her keys so she gets to sleep in it.", "ESH get a keypad door lock.", "I can not fathom leaving a drunk sibling outside in the cold overnight. I would be so worried about what could happen to them, particularly my sister. The worst case scenario risk far outweighs any need to be right or teach them a lesson. \n\nIt doesn’t sound as though you love your sibling.", "YTA- I’m sorry but terrible things could’ve happened to her, there was no need to teach her a lesson that way. You’re just an asshole", "NTA\n\nAll her actions sound like someone who was drunk would do. Really hope she didn't drive herself home.\n\nSince she called you, she was capable of calling a friend. A non-drunk friend to come get her.", "NTA", "NTA she chose it", "NTA\n\nYou literally did not force her to make any of her choices. Those were all her doing.", "Where I'm from, we don't treat family like this but you obviously think it was ok so that's all that matters", "NTA. She made her own choices and it was unfair to ask this of you on a regular basis at all. With your current situation? Unconscionable.\n\nAs a side note has sis been screened for ADD?", "NTA. She made the choice to sleep outside when she could have gone to a friend's place, rented a hotel room, or slept in her car. \n\nYou aren't responsible for her irresponsibility, her poor decision making, or her poorer decision making while drunk.", "NTA. She should have made sure she had her darn key shouldn't she have? As for making her sleep on the dog bed she could have just crawled back into her car and slept there. And if she was driving drunk that wasn't a good idea. But as for her getting a tick, she didn't get from the dog bed you said it was an old dog bed so I presume you don't have a dog anymore. There wouldn't still be a tick on it she got that from the grass or something. Must be pretty warm where you are since she was warm enough outside and the ticks are still out.", "ESH.\n\nAlso, if you moved home temporarily to get some help from family, I'm assuming your sister has been doing some things for you while you're laid up? Cooking, getting a glass of water, etc? Expect that's the price you're going to pay.", "What a fucking asshole.", "Yes she did a stupid thing. But leaving family outside to sleep overnight is crazy. It’s not like it was your cousins friend or anything. It was your sibling. Still I’m going to say NTA because of your current condition.", "YTA.  Firstly - as the dog bed is outside presumably the poor dog sleeps outside- for that alone your whole family are AH.\nSecondly, she's your sister!  You could have thrown the keys down to her.  You managed to get downstairs in the morning but you thought it would be better to leave your drunk sister to sleep on the doorstep than go downstairs for her.  That's a crappy thing to do to anyone YTA.  \nAnd your sister - yes, she should have taken her keys but having to sleep outside in a dog bed? If she forgets her keys regularly, there needs to be a spare one that she can get hold of easily - like one of those little boxes that open with a code - so that she doesn't have to rely on anyone again.\nBut yea - YTA", "NTA.", "You made it down in the morning when it suited you. Need I say more? YTA", "Meh, it sucks she had to sleep outside but she's ok and she probably will never forget her keys again", "Can you guys get a lock box with a code for a key. They are so handy", "ESH. But in this case, OP is more the asshole. The sister is probably lucky that all she got was a tick.\n\n\nHow safe a neighborhood do you live in? How in the open is the dog bed? There are people out there who take advantage of women in situations like this.\n\n\nIt’s November. Where do you live? Was it a cold night? Drunk people have died from hypothermia being locked outside their house.\n\n\nIs it an inconvenience and really hard to get downstairs in a cast? YES! Was the sister an irresponsible idiot to leave her key? YES! Should her friends have made sure she got home and inside safely? YES! Should the neighbor have come out and see what was wrong? YES! Could all of this been avoided? ABSOLUTELY! But it wasn’t.\n\n\nIf the sister had been assaulted, or abducted, or died, would we be here debating who is the asshole?", "YTA\n\nNo question\n\nI know forgetting keys is annoying, but this is an ah move", "yeah, that’s annoying for sure…. but you literally left your sister out in the cold because you didn’t want to be inconvenienced. \n\nYTA.", "ESH - just let her in, you lost the moral high-ground when you didn't let her into the house.\n\nThere should have been a consequence to this, but this one wasn't appropriate.", "ESH.  I assumed your reason for not answering the door was the injuries and that you couldn’t get downstairs.  Not that you were trying to teach her a lesson.  \nYou’re a guest in your folks home they may not appreciate this story.", "Esh. She shouldn’t have forgotten your keys, but leaving her outside at 3 AM is a great way to get her assaulted.", "YTA \nYou're lucky all that happened to her was she got a tick. Selfish idiot", "ESH\n\nIt's understandable that she might be forgetful, but it's not your fault your sister forgot her keys. She could also have at least tried to contact a friend like you suggested. She needs to take responsibility for her actions. \n\nHowever, it was a little harsh of you to turn her away like that.", "ESH - you're uncaring and cold, she's irresponsible.", "ESH - sis was an idiot and forgot her keys, you left her drunk and alone.", "EHS. Shes the AH for being so irresponsible. YTA for not making sure she was safe.  Getting up is a mission but it's still something you do and let her in. You let her in then in the morning you wake her up and tear her a new one. Leaving a person that drunk alone outside at night without making sure they are safe (that means either confirming that she has called a sober friend to come collect her or letting her inside) make you the AH too.", "ESH. Your sister was inconsiderate and irresponsible and you chose to make a point and teach her a lesson. Leslie Mahaffy's parents chose to do the same thing in 1991.", "YTA, I bet she has done something for you while you are in this condition around the house, but you left her sleep outside and deliberately put your phone at DND?", "ESH. Why didnt she call a friend? You tried your damndest to make sure she remembered her keys. I get you are in no position to be moving around especially at 3am in the pitch black, but you still should’ve tried. I get that you are injured, but what would you have done if she got attacked or kidnapped? I cant for the life of me figure out why she would choose to sleep in a dog bed instead of calling a friend.", "Yta. You left a drink person outside vulnerable not only to potential animal attacks but to some random person who could have come on the garden and attacked/ raped/ killed her. \n\n\" Should have phoned a friend\" she was drunk and not in a position to think properly you were responsible for her wellbeing since you knew she was in a vulnerable state", "ESH", "YTA. How are people saying anything else? You failed / refused to help your sister who may have been drinking. Either she had to end up at someone else’s home in an inebriated state or she had to sleep outside. Not getting up to help definitely makes you the AH. \n\nYour sister on the other hand forgot her keys. That doesn’t make her an AH. It makes her forgetful. And not going to someone else’s house in her state makes her responsible. \n\nI’d also be pissed if someone didn’t let me into my home because it was a mission. Very poor way to treat your sister dude.", "NTA, but you are a dick.", "Was she bitten by the tick? Can't imagine getting Lyme disease and being sick long past when  your leg and arm are healed🙃 is worried about Lyme or just mad she couldn't get in?", "ESH", "NTA. She is an adult and needs to take accountability for herself.", "[deleted]", "YTA:  what goes around comes around.", ">tenancy\n\n\\*tendency", "NTA you gave her a choice to take her keys or take her chances", "NTA. A learning experience for your sister, hopefully she won't forget her keys again for a while.", "If she's old enough to drink she's old enough to sort herself out like an adult. NTA.", "First off, thank you. This made me laugh. Second, you are NTA. Your sister is a grown adult who should have remembered her keys (even without you reminding her) and could have made the choice to call a friend. Even if you weren’t in multiple casts, you wouldn’t be TA.\nYour adult sister should have 1) remembered her keys and 2) thought about the fact that you are only there because it is hard for you to move and need occasional assistance. \nSeems like she is just upset that her forgetfulness bit her in the ass and is blaming you. Maybe this will make her think and remember her keys next time she leaves the house.", "Well! Hope she didn't get lime disease trying to make you feel bad!", "ESH - your sister needs to be more responsible, but literally anything could have happened to her. Women get murdered just walking home, nevermind sleeping outside. If you didn't want to go down to her, you should have at least made sure she definitely had called a friend and was safe. Anything could have happened to her, and her safety comes before teaching her a lesson.", "I guess you could not open the door, but be prepared for a situation where you really need her help and she laughs in your face.", "What in the…. NTA. She’s entitled and immature. Also, why don’t you just have a hide-a-key lol.", "You’re a huge asshole dude.", "Lmao sounds like something my step brother would do. One night he also went out partying and forgot where my dad said he'd leave the keys for him. Instead of sleeping in his car he went and slept in the old run down outside building next to the house.", "Your nta because she had a choice and she chose to sleep there instead of just take up her phone and call a friend", "Fuck her", "Your sister is an irresponsible asshole.", "Bonus points if you get her a flea collar for Christmas.  NTA.", "At first I was like, YTA, but then you said you're in a couple of casts and you warned her to check. That's on her. If she's old enough to go out and get drunk, she's old enough to remember her own damn keys. Maybe this experience will teach her some responsibility.", "NTA\n\nOf sir is old enough to decide to go out by herself she is old enough to manager her keys by herself.", "NTA. You didn't make her sleep in the dog bed.  I'm not really sure why you put that in your question. She could have called a friend, like you said.", "NTA", "NTA.  You told her you weren't letting her in and to be sure to take her key.  Moreover, you don't even live there and if you weren't laid up in bed she'd have been in the same boat.", "NTA. Under normal circumstances, you wouldn’t even be there. Then who’s to blame?", "NTA. You repeatedly told her to bring her keys, she decided not to, then decided to stay outside instead of calling someone she’d partied with or someone else to spend the night indoors.\n\nMaybe this will be the wake up call your sister needs to grow up", "NTA. You warned her and then you even advised her of a viable alternative. Her failing to use your warning and advice is on her.", "NTA. Your sister was warned repeatedly. You have mobility-restricting injuries that are still healing, and make stairs dangerous.\n\nI suspect all the YTAs would flip their position if your sister posted about doing this at your expense, especially if you further injured themselves trying to let drunk sis in--which would have been a real risk for you in your sleepy state. How great would your sister have felt if you'd fallen down the stairs--going up or down?\n\nAnyone going off on you for being able to do it in the morning, after you were fully rested and ready to be downstairs for the next several hours to come, obviously has insufficient experience with broken legs, much less having a broken leg and a broken arm at the same time. Plus, you are supposed to be healing, and disrupted sleep is not healing. \n\nThis should be a learning experience for her. You told her to call her friends; she opted to sleep in the old dog bed instead. Either she learns to keep her keys on her with a carabiner or some similar type of clip, or she will have this happen again when she moves out of the family home.\n\nAs an aside, the person responding to your statement about your parents not being coddling types hit the nail on the head: they just don't coddle **you**. Your sister seems to be the baby, and they're treating her that way.", "NTA. In fact, the only problem I see is sister getting away with 'forgetting' her keys because everyone just lets her in. Being left out in the cold a few times would solve the problem real fast, I bet.", "NTA.  how many MILLIONS of children are latchkey kids?", "NTA - She managed to remember her phone, and not lose that. Probably remembered her debit card to pay her bar tab. It’s not about remembering her keys. It’s probably more about being a spoiled brat.", "She needs to be an adult", "NTA\n\nYou warned her several times to make sure she has her keys. I’m pretty sure after sleeping on a dog bed and finding a tick, she will remember to have her keys on her.", "If she's grown enough to go out drinking and partying, she's grown enough to keep track of her keys. This is an extremely unflattering look for someone her age. You're under no obligation in your current disabled state to pander to a fully capable adult.\n\nBet she won't forget her keys again. NTA. lol", "NTA. The tick part is fucking gold.", "NTA. Your sister is inconsiderate. She didn't care that you had to wake up and come down stairs with your broken arm and leg. So why should you care she had to sleep a couple hours outside when you had asked her multiple times if she had her keys. If I was your sister id be mad too but she needs to realise it was all her own doing. If your parents were away and you weren't there, what would she have done?", "NTA. She needs to be responsible for herself. She left the keys and knows that it is difficult for you to get up. She needs to mature and start checking that she has everything with her before she leaves the house.", "NTA, you reminded her repeatedly to double and triple check she had her keys.  She either has some kind of memory disorder, or the fact she keeps getting let in has enabled her forming the bad habit of forgetting her keys.  Or a little of both.  \n\n\nThe fact remains that you had a very good reason why you couldn't \"just get up\" and let her in. You have a serious impairment to your mobility.  If she didn't even try to ask to stay with a friend cause of the keys situation then that's on her more than on you.", "NTA I can’t imagine being that angry at my injured sister. Fuck I’d be staying home with her just to hang out and watch movies - I don’t think you should be left alone overnight!", "NTA\n\n People like your sister are the kind of people who need to learn the hard way. You told her you weren't going to unlock the door, you told her to take her keys several times, and she had a working phone and was provided with instructions on her next step. \n\nIf she can't handle that situation, your parents need to tell her she's no longer allowed to go out drinking while she's living in their house. She's clearly not responsible enough to be given free reign in the world if she can't solve this singular, very easy to solve situation. \n\nShoot, I was locked out of the house on many occasions and never once had to sleep outside because I'm simply not a moron.", "NTA.\n\nWith a leg & arm cast, its a really, really tough thing to move around, she was reminded of the key several times and got a phone to call friends.\n\nGirl has to learn to doublecheck for her keys and have some good friends.", "NTA. But I think I’d be leaving the back door unlocked for her if this is her tendency.", "What would she have done if you weren’t home? If nobody at all could have let her in??\n\nI’m sure in that case she would have either planned to crash at someone’s place from the start, or on realising she didn’t have keys, called a friend to stay with. Surely?? Or would she have slept in the dog bed then too???\n\nKnowing you were upstairs and unable to help her, she should have figured something else out. She’s either a legit idiot who doesn’t know how to plan or find solutions independently, or is deliberately leaning on you/your parents so she doesn’t have to be independent or solve her own problems. Heck, it almost feels like she wanted a reason to be mad at you/feel sorry for herself lol. \n\nHell, my parents had a spare key under a flowerpot in case one of my sisters or I forgot keys. Maybe not the safest idea, but we still had a contingency that allowed us to get in if nobody could let us in. Once - before the hidden spare key - I broke in through a window I knew was open and had a dodgy flyscreen I could pry open. Again, not the smartest, but I figured it out haha. And yes, after that, my parents fixed the window and started the hidden spare key system haha. \n\nHer contingency should not be reliant on inconveniencing you or your parents every time she is irresponsible (and yes, forgetting your keys is irresponsible). \n\nYou and your parents will not always be around to bail her out. What if she grows up, moves out? Will she do this to her housemates? If she lives alone, what will she do? Pay hundreds of dollars for a locksmith every time???\n\nIf she gets parking tickets or forgets to pay bills is that you/your parents’ problem too?? Like, how helpless does she intend to be lol?", "ESH. She’s irresponsible but you’re a dangerous asshole. What’s her username? I hope to see her posting in r/pettyrevenge soon", "[deleted]", "NTA. I think she purposefully slept on the dog bed. Purposefully left her keys. Please heal Quickly.", "ESH\n\n Duh", "[removed]", "NTA lmfao these redditors are dumb af. You warned her several times…", "If it’s a mission to get up why are you sleeping upstairs? Maybe the couch wouldn’t be as comfortable but if that’s part of the hill you want to die on …\n\nYour sister definitely should have done what you asked and made sure she had keys but making her sleep outside? That’s asshole behaviour 100% even considering your situation.\n\nAlso ticks are some serious ass business and her blaming you is super valid. Like, how old are you and her? What was the weather like? How secure is your “yard” or wherever she slept? \n\nI completely understand where you came from with this but it sounds like you are and adult and she is not (Correa me if I’m wrong) in which case …\n\nESH.", "It's a mission, but it's not impossible. You should have got up.", "You sir, are a legend. Fuck this made me laugh. Not the asshole.\n\nDouble down by asking if she wants lunch then point to the dogs kibble.", "YTA what the hell that’s your sister I would’ve done everything In my power to let my let my little sister come home.", "ESH", "ESH.  You couldn’t bother to open a window and toss the keys out?", "YTA. You could have left your key outside hidden for her. You could have slept downstairs. You could have left the door open. There’s so much you could have some to resist access to her entering the home. You purposely didn’t let her in. You put your phone on DND. You counted on her being locked out it seems. If I was your sister I’d stop dealing with you completely and once you healed hope you can be on your own to avoid you.", "Yeah, this.\n\nIf she's old enough to be out getting drunk then she's a fucking adult. A 10y/o can remember their keys for coming home from school. And if she called you she easily could have called someone else.", "Yeah Nta but this is funny as hell had me laughing. Ya know as a prank gift get her a collar some time with a key attached to it.", "This!", "oh, and op if you see this be sure to explain to your parents asap about everything and even see if you can get the neighbor that screamed at your sister to vouch for you too because I 100% guarantee you she will try to spin this around on you and get you scolded.", "Man we’re a heartless bunch lol", "I mean, I agree with this in theory, but being right doesn't mean you're not an asshole. Leaving a drunk female family member outside all night makes you an asshole, I'm sorry. Like I get it is annoying. I get it is disrespectful. And I understand the struggle it would have been, but it's a dick move \n\n\n\nESH", "Pretty heartless way to treat your sister.", "Still an AH move. Two wrongs don't make a right.", "She was able to because she found her in the morning and woke her up.", "Sounds like OP’s sister needs a retractable keychain to hook to her purse/wallet.", "Yeah, long story short when I broke my leg, I lived on the fifth floor with no elevator. One day I got to the bottom and realized I had left my laptop charger in my apartment, and had a full crying breakdown right then and there. It sucked.", "Right? She's lucky op was staying at home. What would she have done if her parents were out of town and she decided to go partying? Same difference imo", "Yeah. It can be super dangerous, especially in the middle of the night when you're not fully awake. It sucks, but OP tried to make every preparation for this to not happen. This is an unfortunate lesson learned for sister.", "Same here!  I used to hook my key lanyard to the purse loop. Now I have keyless, so I made a little cover for my key, with a hook, so it stays attached.  The rest of my keys stay attached to my bag, too, on a lanyard.  Don’t have to unhook them to use them!", "I like it honestly.", "The cold was my first concern. Depending on the temperature it could have ended horribly. It doesn't even have to be that cold for it to be dangerous.\n\nI clearly have a different relationship with my family, but I would have done anything if it was my sibling out there. Like if couldn't get up I would have made them call a friend or called one myself. Heck I would sooner call the cops than risk something happening. (But then I can actually trust the cops where I live)", "I agree with you for the most part, but she did forget her keys so she wouldn't be drunk driving.", "You’re talking as if sister had no other options than to sleep outside. She CHOSE to do so. OP told her to call a friend.", "FYI the NTA judgment would indicate here that OP is the only non-asshole. By saying ESH, you’re voting that everyone involved are assholes.", "Parents aren't really the coddling type unfortunately. They figured having at least another person in the house with me was enough.", "Completely agree. OP has every right to be pissed off but leaving a drunk person to sleep outside isn’t the answer. At the very least OP should have made sure that their sister called a friend or had some safe place to spend the night.", "This is completely heartless and I am literally in awe with all the n-ta responses. For real, I cannot ever imagine doing this to anyone, never mind my own sister.. \n\nPeople here have lost grasp of reality. One made a mistake, the other one made a choice.", "Would it be OP's fault if something happened to his sister while he was making his way down the stairs? I can't stress how very real that possibility was.\n\nAlso, sister *chose* not to call a friend to pick her up and stay outside on the dog bed instead.", "Yeah and risk a sleepy, heavily incapacitated person falling down the stairs. Sister should've taken her keys, NTA.", "Agreed. Sister needs to learn to take the keys, but this would not be my hill to die on. I’d prefer to know they are safe, unlike that other poor girl who was abducted and murdered when this happened to her. YTA.", "Fr", "Maybe the sister needs to learn to take her keys with her like a damn adult instead of relying on people to constantly rescue her goofy ass.\n\nNTA. OP didn't make her forget her keys, OP didn't get her drunk, and OP didn't prevent her from using her two functional braincells to call a friend.\n\nIt's called \"personal responsibility.\" She should try it sometime.", "Especially if OP is expecting any type of assistance from the sister while staying in her family’s home.", "That sounds like a really great way to lose your keys, when your drunk sister can't catch it, and it slips into some nook between boards or something", "There are so many factors that could have prevented him from doing so\n1. Maybe he didn't have his keys with him, they were downstairs where he couldn't go\n2. If he did, there were probably no windows or he couldn't get to or open them", "I'm 21 and she's 18.\n\nThe keys were downstairs so it would've been the same situation as just opening up for her.", "In the time it *would've* taken OP to get down the stairs, any number of very bad things could've happened to his sister. I blame the person who dropped sister off at the house and left her there before she got in.", ">  I wonder how many people here actually understand how hard it is to get out of bed when you can't walk.  Add in one arm out of commission...\n\n🙋‍♀️🙋‍♀️🙋‍♀️ THANK YOU!  Broke my ankle two years ago.  I live on the second floor of my Mom's two family flat home.  It was HELL going up and down those stairs but at least I had two arms to help break my fall, if I fell by catching the banister, unlike OP.  Fall, trying to catch yourself with one arm, yeah, more broken bones, neck or back.", "Not to mention painful and dangerous. What if OP had fallen down the stairs and couldn’t get to a phone? How long might OP have lain there, especially if sister just left, either that night or in the morning, because she was pissed off? OP’s safety was at stake here, too.", "This was back in the 90s but pretty infamous in Canada. \n\nhttps://en.wikipedia.org/wiki/Murder_of_Leslie_Mahaffy\n\n9th grade girl was locked out of her house after a night out, kidnapped by a young guy and his girlfriend, tortured and raped for 24 hours before being strangled with an electrical cord.", "But I bet that now traumatized lady will never forget her keys again! - One of the AHs on this thread\n\nHonestly. They're lucky the tick is the worst of it, and that's assuming the tick doesn't carry Lyme or RMSF, or give her alpha-gal syndrome.", "Op was physically unable to get to her quickly. It doesn't take long for someone to rape someone. Let's say it took op 5-10 minutes to get down the stairs, that's still enough time for someone to rape someone", "Thank you. Wth are these comments", "Sis had her phone and could have gotten a friend to crash with.  OP is in a delicate healing position and navigating that while tired in the middle of the night could have caused more damage.  Sis chose to sleep in the dog bed that I am assuming is in an enclosed area and unlikely to have a passerby notice.  But again she chose that.  Her ride should have waited till she actually made it in unless she ubered and she could have asked them to wait.  \n\nUltimately I don’t see the sis having something bad happening to her as much as I do OP esp since OP did not know sis decided to sleep in the dog bed outside instead of getting a friend to house her for the night.", "It amazes me how many people are acting like OP put her in this dangerous situation and its his responsibility to get her out. OP has an arm and leg cast, going up and down the stairs is a nightmare, but what if OP was asleep and just didn’t wake up? She would be in the exact same situation. What happens when she lives on her own and no one is there if she forgets her keys? She had other options besides sleeping in the dog bed, that was her own choice and now people are making OP out to be the bad guy.", "That was her choice tho.\n\nYou cant codle dumbass people, because they will continue to be dumbasses since they face no consequences.\n\nThe sister blaming this on OP shows she still hasnt accepted accountability for her own mistakes.\n\nMaybe eventually she will be taken advantage off, maybe then she will learn, hopefully she learns before that happens.", "This is exactly my assessment, too. I have adult children and if one of them did this to the other, they’d both get yelled at but the one sleeping in their cushy bed would be the bigger AH. We have a comfortable couch on our outside deck and even that in winter weather is not cool!", "It is incredibly painful, draining, and difficult for somebody in a double cast of any kind to make it up and down stairs without assistance from another person. \n\nIt is highly likely that it would have been incredibly painful and difficult for OP to get down the stairs to open the door for their sister, and then try to get up the stairs again. A drunk person cannot help get them upstairs, and even if she tried, she could very well cause more harm than good due to being drunk. \n\nI personally wouldn’t have turned off the phone, but the sister had lots of options to solve this.", "Yeah, I don't think OP was an asshole for not getting up. I do, however, think it is irresponsible and cold to just leave their drunk sister to fend for herself outside like that. OP should have, at the very least, tried to contact someone who could have helped her out. What if something bad happened to her?\n\n Thankfully, she was ok and hopefully learned a lesson.", "And what if OP hadn’t had a broken leg?  The parents weren’t home, and OP wasn’t supposed to be there.", "That's how a woman got raped in my city recently. Her friends left her outside her house and never bothered to make sure she made her way in. All it took then was one terrible passer-by later on.", "So you want OP to continue to coddle her adult sister who seems to do this regularly? Her sister made the decision to be irresponsible even after being reminded multiple times that she needed her keys. She’s old enough to go out and party all night, she’s old enough to sleep at a friends house or figure out a safe alternative for herself. She figured out how to get herself home, she can figure out a sleeping arrangement. NTA.", "ESH I would never do this to my sibling I love them way more than this", "The sister is an adult who, knowing OPs condition and that they needed care, chose to get so drunk they ended up sleeping in a dog bed. \n\nThat's on the sister. She had many choices available to her. She picked one of the more ridiculous options.", "This take is so absurdly entitled It's actually incredible. The sister made a series of choices after plenty of warning and as a result of her choices slept outside. Anyone who thinks OP should have capitulated to her sisters selfish demands is the kind of person to enable horrendous behavior and is someone I have zero respect for.", "If this was a man who did this to his GF the comments would be obliterating OP for leaving her in danger.", "Except it was the sisters choice to GET that drunk, knowing there was no one home able to take care of her, and additionally not to call a friend.\n\nEven if OP had let her in, she would have been \"alone in that state\" because OP can barely move themselves around currently.\n\nHarsh?\nSure.\nThe alternative was to put themselves in harms way, when the sister had other better options she *chose* not to take.", "Boooooooo, don’t coddle drunk idiots!", "This. People think \"oh, OP told her! Maybe now she'll remember!\" I'm sure the Venn diagram between those people and the people that say \"you wouldn't have been assaulted if you wore something less sl***y like I told you\" is just a damn circle.", "I see it the same way as you", "If you’re old enough to get that drunk your old enough to be responsible for yourself in your drunken state. Her choices her problems.", "The logic on this forum is very clear. If one party makes a mistake, then the OP is entitled to be an asshole and won't even be seen as such. Sister was an AH for sure, but OP's behaviour is just on a different universe of cruelness. YTA", "One thing : op didn't put her in a dangerous situation. She did it herself\n1.leaving the keys home despite op reminding her\n\n2.getting drunk\n\n3.not calling a friend to come get her when op told her too and decided to sleep outside", "Different circumstances", ">  She had multiple, sizable, and easy ways to avoid this situation, and chose none of them, \n\nShe forgot her keys. What other \"sizable and easy ways to avoid this situation\" did she have?\n\nSeriously, people here are just so vindictive. This kind of thinking is incredibly narcissistic. I don't understand people who want to intentionally punish others for mistakes. Yes sister, fucked up, but leaving her outside is *completely* unreal.", "this is the correct answer.", "Right? Sister has made it a habit of forgetting her house keys, requiring someone to let her in. The simplest solution here is to install a keypad lock.", "It's not OP's house so it's not like they can just change the locks.", "If she's too irresponsible to remember her keys, she's going to be too irresponsible to remember the code.", "OP's sister would then blame them when she's too drunk to put in the code and then we'd be here again.", "Thank you! Jiminy cricket, I'm surprised I had to go this far down to find this comment! The whole time I'm reading this, I'm going my god, why don't they just spend the money to get a keyless door lock? They're not that expensive, and I think they they're worth every penny. Totally made for situations like this.\n\nEdit: sorry if it came across like I was implying that OP should change the locks to keyless entry. I meant the homeowners/parents. They seem to be well aware that their daughter has a problem with losing her keys, so why not get keyless entry and save themselves time and hassle?", "I know! Imagine treating your family like that and leaving them outside for god knows to happen to them.\n\nWouldn't be surprised if the sister went no contact after that.", "Bear in mind that he got up a few hours later and let her in. His intention was to punish. That’s vindictive no matter how you spin it", "[removed]", "I'd say that having multiple limbs broken is being in a vulnerable state.", "Maybe if the drunk person thought for a second she'd have had the keys. Going off the fact that she can drink and drive like a dumbass she's a grown adult and doesn't need coddled. \n\nDrunk isn't an excuse to steamroll over people and their needs.", "Where in the world do you live that you are getting animals that attack humans and people who attack humans in your yard on a regular basis?  Where I live stuff like mountain lions and bears are possible in my yard at night, but they usually stay away from adult humans, especially if you are sleeping close to the house.  And if you had people coming in and out of your yard, you're probably not going to be getting wild animals too.....", ">Your sister on the other hand forgot her keys. That doesn’t make her an AH. It makes her forgetful.\n\nAfter being reminded three times that the only other person in the house would not be able to let her in and so she really needed to remember her keys?! That's not just forgetful.", "May have been drinking? Lol she was drunk. Funny how OP is the asshole even though\n\n>It's a mission to get up in my condition\n\nSo it's totally fine to expect a disabled person to get up in the middle of the night, but not expect someone old enough to go out and get drunk to remember their own key. What makes the sister the AH is she was literally told to check for her keys *three* times and still managed to \"forget\" them, then screams like a toddler who got a toy taken off her because that's come back to bite her.\n\nI'm gonna go out on a limb here and say she doesn't forget her keys, you cant claim forgetfulness when you're literally being reminded as you're leaving, and this is habitual behaviour. She does it on purpose because she finds it easier to just simply knock on the door and make her decisions other people's problems. Heeeell no lol. That's next level stupid and entitled. \n\n>I’d also be pissed if someone didn’t let me into my home because it was a mission.\n\nYou sound like an ableist. Dismissing disabilities to excuse the decision to go get drunk and scream the neighbourhood down as you demand the disabled guy get out of bed.\n\nDrunk sister is TA and OP has an overgrown entitled brat for a sister. As for you, you're either the sister or just like her. No way anyone reads this story and actually thinks the sister is in the right lmao.", "The reckless stupid ah is the one who left her keys at home (again) and partied until 3am. Not the one who gave them multiple reminders before leaving that they needed to have their house keys or they wouldn’t be able to get in. It honestly sounds like her sister purposefully tried to call OPs bluff and it backfired. Maybe next time she won’t forget her keys.", "[removed]", "Counterpoint: 3AM, going down stairs in an unfamiliar house, in a leg and arm cast after an accident.  OP could easily have died falling down the stairs, with their drunk sister outside unable to get in and help.\n\nOP's sister was awake and had her phone.  There are things OP could have done better for sure, like leave keys outside under a mat in case she forgot them, but I think your post doesn't get it right.", "You sound insufferable. It's not like things weren't communicated *beforehand*.", "I hope I never raise a son who’s so unnecessary cruel and narcissistic. Thinking he can put his little sister’s life at risk just because of the inconvenience of getting up and to teach her a lesson. Who does he think he is to dish out lessons like that.", "if OP were a woman you'd laugh at the audacity of a younger adult male going out partying expect someone with limited mobility to let them up at 3 AM. check yourself. bad take. his sister was drunk and could have handled herself better knowing she had a disabled relative at home. reddit's casual ableism is disgusting.", "u/jaxbravesfan said\n\n>Yeah, your sister should have remembered to bring her keys with her, but you still should have let her in the house. By ignoring her and putting your phone on DND, there is no telling what your inebriated sister could have resorted to. Luckily, she slept on the porch, but the situation could have ended badly. **If I were her, I’d take your crutches downstairs and leave you upstairs to figure it out.**\n\nthis is disgusting. yeah lets just abuse the disabled guy because moving puts him in pain and he didn't want to climb out of bed to let his drunk sister who forgets her keys all the time even though he reminded her. i'm pretty sure what you're describing is abuse of the infirm so i'm going to report your comment now and encourage others too as well.", "They slept upstairs because that's where they normally sleep! And that's also why they warned sister to triple-check that she has the keys.\n\nSister sounds like a train wreck.", "Her lack of planning doesn't constitute a reason for him to change anything", "OP should sleep on the sofa instead of a comfortable bed just in case their drunk irresponsible sister forgot her keys again?", "The couch is not an ideal sleeping arrangement. My room is unfortunately upstairs but their are benefits of being there so it's not too bad. I'm 21 and she's 18", "Ticks are serious, but who told the dumbass sister to sleep outside? She could call OP but she couldn't call a friend or Uber to a hotel?", "this is extremely ableist, you don't know the extent of OP's injuries. having to move back in with parents because of the scope of his injury means he's a caretaker for some drunk young adult now? you people are out of your fucking minds", "That’s right. Us former latch hey kids have been responsible for a house key since age 8.  She needs to get it together.", "its a rite of passage anyway, coming home and not being able to get inside for one reason or another. At least she had a comfy dog bed to sleep on", "Make it a flea and tick collar 😆", "But two rights make an airplane", "With a lot of disabilities someone may be able to complete a task once, but that doesn't mean they can reliably do it again- eg it might be too painful or exhausting.", "Not saying she should have, just that she did in the morning.", "Nah, she’s obviously too young to remember the most important thing we all learned from Zoey 101.\n\nShe needs a key necklace.", "I bet you anything she'd of remembered her keys if she knew she was going home to an empty house.", "I thought so too, but it was more the principal of the thing in my mind. Leaving a drunk person to their own devices is a dangerous game for them, and the people around them.", "Why expect a friend to do for you, at 3 am, what your own family you're living with will not? 🤣\n\nYes, there were other options. She could have stayed with a friend. OP could have also opened the door. Like I said, they both suck.", "> You’re talking as if sister had no other options than to sleep outside\n\nAt 3am, there are really not many good options. Walk around to find an open hotel? Call friends in hopes someone will wake up, stay up until you get there and welcome you in a drunk state at 4am?", "Sister was drunk, so probably not thinking straight. Not a good idea to leave a person like that to just figure it out on their own.", "Good shout. Have amended accordingly. Thank you for the reminder. Operating on limited sleep.", "Parents aren’t the coddling type but will wake up at 3am to let your sister in so many times that she’s comfortable not bothering with her keys? Seems like they just don’t coddle you, sorry OP. NTA", "Reddit in general has zero heart for family. Idk if most people on this site are only children or just had shitty family growing up", "“One made a mistake, the other one made a choice” so well put, imma use this", "How many times would this happen before you've lost all patience for it? Because it sounds like this is a pretty regular occurrence for her. She's gonna have a real struggle when the time comes that she moves out on her own.", "She was told repeatedly to make sure she had her keys. She chose not to verify that. It’s pretty heartless for op’s sister to expect her to come downstairs and let her inside when she’s obviously in a lot of pain as it is. Her leg and arm are broken. Op’s sister could have called a friend or.. just made sure she had her keys..", "It's just another sign that so many redditors have lost touch with reality.\n\nEven if it was a drunk stranger I'd call the non emergency 911 line. To abandon my sister like that is absolutely fucked.", "She's a drunk 18 yo, and judging by her still living at home; likely still in school.\n\nExactly how many friends do you think she can call at 3 am that are going to be willing to drive to pick her up, and have their parents willing to let her crash at their place?", "Exactly. She had an entire phone! You can get anything with a phone. Uber to a hotel or 24 hr diner, contacting friends, calling a 24 hour emergency locksmith. There was no excuse for her to sleep in a dog house. \n\nShe chose to be dense and sleep in a dog bed. Likely her trying to be a victim to shake off responsibility. \n\nEven at my drunkest, I've never even thought to make that dumb of a decision and I'm old enough to not have had fancy phones during my party phase.", "Yeah I assume op’s keys were downstairs by the front door where most people leave them. I don’t think many people keep their house keys in their bedroom.", "You let a drunk teenage girl sleep outside alone for the night in November? YTA", "Oh yeah that's all part of what I was thinking about trying to get out of bed with a broken leg and arm.  I didn't even have to deal with stairs with my surgeries, and I fell, luckily my mom was in my house when it happened.", "Yeah, I don't get it, it's like some men live in a different world, literally not realizing how many things can go wrong if a woman is alone at night, even in front of her own house.", "This is what I was thinking about ^^ she could have been in a dangerous situation", "Unable to get quickly is fine. Unable to get at all, not exactly fine in my book.", "If a drunk person ends up unable to get inside and also isn't in an adequate state of mind to go elsewhere, there will be a window of opportunity of hours. That's how a woman got raped in my city. I dunno, as much as the sister may be dumb and annoying, I'd figure out a way to get her ass inside.", "Doesn't matter, if you can't go down the stairs you call her friend or someone but you absolutely make sure she is safe and sound before going to sleep. Putting someone in danger just to teach them a lesson is psychotic.", "OP is injured. He can't exactly rush to his sister's aid.", "I am wondering why OP is sleeping upstairs though. This situation aside, you would think that the difficulty of getting up and down stairs  outweighs the annoyance of sleeping in the living room.\n\nTurning off his phone was also a very bad move in case something did actually happen to his sister.", "Yet OP was able to get down in the morning.\n\nEven so, just turning their phone on DND while the sister is drunk and alone is AH behavior.", "But OP has no issues doing it without assistance in the morning.", "What could OP have done if something bad *did* happen to his sister while he was trying to get to the door? That's a real possibility. Another possibility is that OP or his sister did call one of her friends to pick her up and something happened before the friend arrived.\n\nBottom line: the only way to prevent said possibilities would be for sister to have her key on her and/or have a friend drop her off at home and stay until she got inside.", "Also how my mom got raped in college. Drunk and locked out of her house went to sleep on the side of the house and a guy found her. My mom hasn't drank since that happened.", "The question is really how cold it was outside. Drunk people can very easily freeze to death because alcohol makes you lose body heat faster and impairs your reasoning.\n\nHowever, if it was a comfortable temperature outside (which it seems like it was in this case), then sleeping outdoors in the dog bed is just uncomfortable, not dangerous, and she clearly had the choice to call a friend.\n\nI don't think OP is downright an asshole, but I do also kinda understand why the sister may feel pissed in the moment, but hopefully she will come to her senses soon.\n\nEdit: I will say, there are a lot of factors to consider here and depending on them, they might tip OP to the the side of AH", "I think the point of the comment above, and the entire purpose of the ESH judgement, is that both parties could and should have done better. I think they agree that the sister made an error (among a pattern of similar errors) but simultaneously that there is some room between the brother doing absolutely nothing and doing something to ensure that her well-being is intact. As it turned out, the situation ended justly, but this may not have been the case in the (unlikely) event that the sister came to some harm. I’d tend to agree with you however that OP’s sister holds as much of not more responsibility for the ultimate decision not to choose a safer path. On the other hand she was drunk, but that’s part of the lesson in my mind— don’t become so drunk that you put yourself at risk and others in a position of potentially grave responsibility for mitigating that risk. Excessive drinking is in my mind just as immature as not looking after your belongings and not planning your affairs.", ">want OP to continue to coddle her adult sister who seems to do this regularly?\n\nOP says they *temporarily* moved home.  So it won't be OPs problem very long.", "Coddling? Jesus Christ she was drunk and alone this could have ended up so much worse.", "Woulr you rather enable your sisters irresponsibility or find out she was kidnapped and murdered? Drunk people dont tend to make smart choices", "Alternative would be to call the police to come and pick her up. Tell them you have broken limbs,vare on pain medicine and not safe to go downstairs at this time. You can say that are you worried for her safety and let them deal with it.", "I feel “coddle her” is a bit much. Idk what else OP has said about sister beside the post, but just because she forgets her keys doesn’t mean her sister coddles her. OP didn’t even say she’s the one having to let her in constantly. I think OP sucks for doing things like immediately hanging up and putting phone on dnd after the one call. Like did you not care what happen to your sister overnight? I feel like the possibilities that can happen to a drunk woman alone at night, far outweighs teaching a lesson on remembering fucking keys.", "Glad I'm not related to you. Very compassionate  \nYour mother must be so proud", "She was drunk. Drunk people don’t make good decisions like calling a friend instead of sleeping out in the cold in a dog bed. Being drunk shouldn’t be a death sentence because they need to be taught a lesson. If the she has an actual addiction problem then they need to do an intervention and get her some help. Short of that, open the damn door.", "Yes actually.  For one night. You can have that convo in the morning.\n\nJesus fucking christ. I don't even have a good relationship with my sister and I'd take her in in a heartbeat and talk to her in the morning.\n\nIt doesn't matter if \"she's old enough to figure something else out\". She's home. We'll deal with this when she's sober.", "I'm really struggling to figure out how you managed to connect these two very different attitudes/beliefs...", "How... How do those relate? How is reminding someone to grab their keys and expecting them to remember, right after being told to not forget even remotely close to the idea that clothes=rape????", "Absolutely insane to me, I’ve had both my brother and sister wake me up at stupid o’clock because they forgot their house keys/don’t want to wake the parents up etc. etc. - does it piss me off? Of course it does, but I let them inside and then proceed to take the piss out of them for the next couple of weeks and keep it in mind for the future… because I have also relied on both of them in times of need \n\nGranted I wasn’t in a cast but if OP could make it down the stairs the next morning they were more than capable of doing it during the night - they just chose to teach sister a lesson… cruel for no good reason imo \n\nAlso probably could’ve got a free apology pizza from sister or something so OP is both an asshole and stupid lol", "yeah poor choice of words there, should have stuck with ‘left her’ rather than changing it to ‘put her’\n\ni just don’t think it’s proportionate, despite her situation being entirely her fault i don’t think the kind of risks that a young drunk girl sleeping rough is taking on is proportionate to forgetting her keys, no matter how many times OP reminded her and she ignored him\n\nshe needed to be taught a lesson, but i don’t think this is the way to teach it. i don’t know what that lesson should be but i don’t think it should put her in danger", "She was in a dangerous situation, doesn't matter how she got there. Him having the opportunity to get her out of it and not doing it is as well as putting her in that dangerous situation.", "Both were young girls locked out of their homes.", "Call a friend. Rent a hotel room. Sleep in her car. Ask one of the neighbors yelling at her to let her crash on their couch.\n\nShe had plenty of options, but she got into this situation by making bad choices, and she kept making it worse with more bad choices.", "I'm sure the parents are just as thrilled every time she forgets her keys somewhere as OP is.", "If the lock is wifi enabled, it can be opened using a phone, or remotely, from upstairs, or the other side of the planet. OP wouldn't have to go on a mission to open the door.", "They could pay for it out of sister's social budget!", "Upvote for Jiminy Cricket.", "It's not OP's house though so they can't change the locks! Parents would have to do it but it seems they're perfectly happy just unlocking the door for the sister every time.", "OP got up at a sane hour of the morning, went downstairs and found her asleep outside, woke her up and got her indoors to continue sleeping it off.  That's not an intent to punish at all.", "I’m feeling sympathy for her disability but damn that is still so mean. Might have to be YTA", "R u OK?", "Right? If you can't remember your keys after being reminded *three times* then you also shouldn't be going out and getting drunk.", "People make mistakes. Being an AH is intentional. The only intentional AH here is OP", "His parents house is not unfamiliar first of all... where did you get THAT info, I only used info said in the\nSecond, she was intoxicated... you want her at whoever is going to answer at 3AM house\nThird, it's Friday night, wtf is wrong with going out??? It's illegal to go out?\nFourth, he is at HER house, SHE is taking care of HIM", "Oh so, if she dies he could have been like \"I told her about the keys\" 🤣🤣 please don't reproduce", "She put HER OWN LIFE at risk by continually being irresponsible. Where’s the accountability? She’s an ADULT.", "Gen X had keys at age 5. When we walked home from kindergarten ands spent 4-5 hours on our own until parents got home.", "The 90s 10 years old with an 8 year old sister, we had our keys, wouldn't see our parents till 7\\\\8pm cooked our own meals, made our own lunch. Made me more independant. I know 20 year olds these days that have never been on a train/bus.", "The old key on a necklace trick.", "If she's old enough to be getting wasted and coming home at 3 am, she's old enough to figure out how to break into the house and climb in a 2nd story bathroom window. Hypothetically. Signed, GenX", "This is how I broke both bones in my arm and nearly lost the use of my arm. Ladders can be tricky on uneven ground with dumb kids.", "Make sure her name is on it as well", "Also could be on pain meds to help sleep or.meds that can only be taken before bed due to dizziness etc. that would increase risk of falls.  I was on a lot of meds after a surgery and even walking to the bathroom after taking some of my meds was dangerous.  Stairs would have been a no go.  Esp in the middle of the night.", "after leg surgery up & downstairs was a once a day thing. I could do it but it was very draining and painful. if my sister knew this and still forgot her keys honestly I would have eventually gotten up but I would have made her help me more the next day. 😆 Sister Tax.", "yeah, but not in the dark whilst also sleepy, that's how you wind up falling down the stairs and getting even more injured.", "She needs something, and it's on her to figure it out. \n\nI have ADHD, and I have kids with ADHD. When you're eight, you work with your mom to figure out how to remember stuff. When you're eighteen, you get to work it out for yourself.  She needs to work it out herself, and hopefully this is a motivating incident for her to do so.", "lol glad I’m not the only one who was reminded of Zoey’s necklace", "Choker with a key. That way it doesn't get \"too annoying\" by getting in the way and she takes it off. Plus, kinda kinky? Seems like a good way to get dates. Then she won't even need the key!", "Than that's on the \"friend\" who dropped her off at her house and left before she got in the house, not OP. Even if OP had gotten up as soon as she said she was outside, a lot of bad things could've happened to her in the time it would've taken him to get to the door.", ">Yes, there were other options. She could have stayed with a friend. OP could have also opened the door. \n\nYeah and OP could have fell while coming down those stairs at 3 am and broken more bones or even lost their life.  OP couldn't even catch themselves if they fell with only one arm.  The only one who sucks is the Sister, who was asked numerous times before she left if she had her housekeys and she lied and said she did.", "I'm convinced some of these people have never been drunk, or live in places like NYC where there's never overall downtime for the area 😅\n\nI live in the boonies. You're on your own at 3am.", "Thisssssssss, who tf has in their routine a 3 AM sleeping break?", "My guess is that the sister is the golden child.", "I’ve noticed the responses on this subreddit are majority children", "This sub in particular hates their family it’s so bizarre", "I just really don’t find someone forgetting their keys and me having to unlock the door a big deal. The door is like maximum 20 seconds away from wherever I am in the house. Oh no, I have to get up and walk to the door 😨 Obviously in the case of op they were injured and the sister should have been more considerate of that. But I really cannot see myself “losing all patience” over this. I’d just laugh at my sibling for being so stupid", "Assuming they’d even be sober enough to drive to get her.", "Mine are in my purse as is my rescue inhaler, so my purse is in my bedroom at night. But that's me.", "I might be weird; mine stay on a hook in my bedroom", "In no way could OP have predicted that their sister would decide to sleep outside instead of calling a friend like OP told her to do.", "OP is a man?", "In his injured state, OP couldn't get down the stairs fast enough if something was to happen to his sister. Even if he had gotten up right away.", "Ok, what if op fell down the stairs trying to help and got even more hurt? All because the sister couldn't be bothered to remember her key???", "Then he should have gotten someone over there to get her aid. What he did was the most AH option of all his options. I don’t buy it because in the morning he had no trouble letting her in. If he seriously was incapacitated then he’s still responsible and should have gotten someone over there or at least alerted the parents to the situation so they could have called around to get someone over to help her. You don’t leave someone in a dangerous situation that you’re aware of, whether they’re a sibling or not.", "Sleeping in the living room on a couch or an air mattress is not great for promoting healing. We ideally like our patients to have a good mattress to rest on because sleep is so important for the healing process. Plus, often they need to sleep in certain positions or need important items near them in order to aid them throughout the night.", "Something tells me that he was much more mobile than he’s admitting. He’s not just an AH but a lazy AH.", "Just because they are able to get down in the morning doesn’t make it any less painful and difficult? We don’t have our patients doing unnecessary work when they have injuries just because they *could* do it. At that point, OP had gotten a full rest and was going to go about their day. Had then done it at night they either would have had to go down and then back up, possibly straining or further injuring themself, or they would have had to sleep downstairs, possibly on the couch if there were no beds on the bottom floor, which would have been terrible for their injury. \n\nAnd yes, I agreed that I wouldn’t have put the phone on DND. I would have staid available until sister called a friend to stay with or something similar. But I also am not gonna act like sister did nothing wrong in this situation. She brought this upon herself.", "Again, just because somebody *can* do something doesn’t mean they *should* be doing it. \n\nFor many people with casts, they can mow their lawn or go up and down stairs, but ideally, they are not doing those things without help, or at all in some cases. \n\nI have a delayed digestion condition. I *can* eat a large breakfast, quickly, in one sitting. Should I? No, because it will make me feel horrible, often lead to vomiting, and end with me being in pain. Can ≠ should", "But they aren't running down and then back up stairs, that's the difference.  I had a broken ankle and I live on the second level of a two family flat.  Once I made it downstairs, I wasn't able to turn around and go right back up them for at least an hour.  And when I make it back upstairs, I'm not coming back downstairs for some hours.", "If something bad had happened, the OP could have called emergency services. They may be in an arm and leg cast and unable to get up, but seeing that they made this post, they obviously are able to use their phone just fine. They could even have called the non emergency number and gotten an officer to come help her if they were unable or unwilling to call her friends or anyone else. \n\nI agree she got herself into that mess. Yes, she should have remembered her keys and not gotten locked out in the first place, but she didn't. Op absolutely could have at the very least tried to contact someone to help her, but instead they silenced their phone and just went to sleep and left their drunk sister locked outside by herself. \n\nI don't know what kind of area they live in. If they live in a more rural area, or a good neighborhood then there probably isn't much harm in her seeping in a dog bed outside for a night. \nBut if they live in a city or a bad neighborhood or an area with high crime, then OP is a huge jerk.", "He literally could have dropped keys for her out the window.", "This comment reminded me of a poor college student who froze to death in front of their dorm building about 5 years ago. He was drunk after going out to a party iirc.", "The sister had a phone op told her before to get the keys three times, told her to go sleep at a friend's house . \n\nShe's not a child shes responsibile for herself and how much she drinks.\n\nAlso op forcing her leg might set her back or even get her to have a surgery aside from the pain and imobility issues.\n\nNTA", "You are skipping over the state of health of the brother. Imo.", "Finally, a sane answer", "She was presumably sober when she left the house without making sure she had everything that she, an adult, would need to be out late responsibly.", "He said she had a tendency to leave her keys and someone usually has to open up for her. That’s enabling a repeated, irresponsible behavior. Opening the door, despite telling her no one would be able to open it, would be coddling. And let’s not forget OP has A BROKEN LEG. He would have to get up, hobble to stairs, dangerously hobble down the stairs, open the door, then have to hobble/ pull himself back up the stairs and back to bed.", "They're both variations of \"I told you so, so you deserved whatever happened.\" The comments of people voting N T A have, from what I've seen, overwhelmingly have a 'she made the choice' theme.\n\nSo we're all 100% clear, a nearly-identical situation happened to a girl, and she was then assaulted, another was assaulted and killed after a very similar situation, etc.\n\nI'm actually very curious how many of the people voting in OPs favor would change those votes if they said \"and now she's had to have two toes amputated from frost bite\" or \"and then she got violently attacked.\" People are voting like they are *only* because she wasn't hurt. OP would be getting skewered if she had been.", "It's not that portion of it, it's the \"I told you so, so these are the consequences.\"\n\nLeaving a drunk person out on the lawn HAS led to them being assaulted and/or murdered.\n\nWould you vote N T A if OPs sister was now an assault victim, was now dead? No. No I don't think you or anyone else would.", "I agree but op isn't in a condition where it's easy or convenient to go up and down stairs. It hurts for one and with an arm on cast op can't even really hold on in case of being unsure or losing the equilibrium.\n\nAnd if op falls it can lead to serious complications all because the sister is too lazy to take her keys with her after being repeatedly reminded.\n\nThis is the point I think where op stopped setting himself/herself on fire to keep the sister warm.", "No it sure as hell isn't and he would be in a dangerous Situation going up and down the stairs not to mention in pain because she's an irresponsible lazy ah", "No, hardly the same. \n\nThe one before had no phone/cell and no keys she could have taken with her , no other possibility and the parents locked her out \n\nThis one had all of the above including reminder from op to get her keys with her when leaving and the option to call a friend and go to a friend's house which she decided against.\n\nAlso the parents were completely healthy op has a broken arm and leg so is in pain and with difficulty moving especially going up down stairs \n\n\nVery different situations", "> Ask one of the neighbors yelling at her to let her crash on their couch.\n\nJust lol. \n\n>Call a friend. Rent a hotel room. Sleep in her car.\n\nIt's 3AM. Who's gonna pick up? How is she getting there? If she had car keys, don't you think she would have house keys too?\n\nSame questions for the hotel. She is 18; not 35. You are practically expecting a teenager at a vulnerable position to figure this out. In reality, even the options you mentioned are definitely NOT easy. Also we have no reason to believe she didn't call friends before sleeping outside. The way it's written, OP thought calling a friend and crashing at their place at 3am with no means of travel at a drunk state at 18years old is a simple phone call.\n\nAnd honestly, walking to a hotel as an 18yo, checking in probably for the first time by yourself, drunk at 3am is a surefire way to get in a seriously precarious position.", "Then they should stop getting up and letting her in. They enabled this nonsense.", "I mean, they can't be that mad at it, if the solution to sister forgetting her keys is still opening the door at 3 AM.", "Seriously, it would make their lives so much easier if they got the new lock and then could sleep through the night instead of having to let her in every time. If I was the parent, I'd be pissed and would probably get the new lock and make the sister pay for it lol", "I've seen them on sale for less than $100.00. It's worth it to have the peace of mind, I think.", "But that's what I'm saying. The parents are perfectly aware that the sister does this and they haven't made any moves to fix it.", "No, she could have called a friend, or just been responsible in the first place and brought her keys, like OP reminded her it seems multiple times to. It's not hard to check for the big 3 everytime you leave the house; Phone, Keys, Wallet. She is also 18, so it was illegal for her to drink (at least if she was in the US) anyway. She made poor choices and decided to be stubborn, if she can call and yell at her brother she can call and ask someone she knows for help. OP didn't know that she slept on the dog bed until morning. The neighbors would be buttholes as well for telling her to shut up instead of trying to offer help, but it sounds like they've probably been through this before with her.\n\nIt's also really dangerous and painful for someone to attempt to go downstairs with broken limbs, especially if they're not carpeted. If he slipped and fell, which he would be at increased risk for considering he has an arm and a leg broken, then who would have helped him? Obviously not the sister, she was shitfaced. \nYeah he still has that risk in the morning but at least he isn't butt tired doing so. I'm amazed at how many people lack the ability to judge the sister for how foolish her decisions were. \n\nPS. Everyone seems to be calling OP \"he\" so I'm hoping I didnt accidentally misgender them, apologies if I did.", "When you're recovering from serious trauma, everything is somewhat unfamiliar.  And a house you don't live in generally is also somewhat unfamiliar.  She asked OP to put themselves in danger.\n\nI didn't say anything judgmental about the sister going out.", "OP is literally disabled.", "My dad refused to let me have a key because he thought I would lose it.  So my mom taught me how to jimmy the lock on the side door so I could get in.  Mom left for work before he did, so it he came home early and I was inside I would just tell him he forgot to lock the door.  He used to get so mad at himself for forgetting but he never figured it out.", "\"And had 3 paper rounds and 2 jobs at age 12\" - my pops", "I'm a millennial, but I was 6. Now my siblings aren't allowed to walk to the neighbors house alone, at 13!", "We had to get up in the morning at ten o'clock at night half an hour before we went to bed, drink a cup of sulphuric acid, work twenty-nine hours a day down mill, and pay mill owner for permission to come to work, and when we got home, our Dad and our mother would kill us and dance about on our graves singing Hallelujah.", "I was gonna say, I think I was letting myself in before 8", "I'm a millennial and I never even owned a set of house keys for my parents' place as we never locked it. To be fair, I grew up in BFE (our town's population is less than 1000) and our house was 7 miles out of town in the middle of a wheat field 🤣\n\nMy parents did eventually start having to lock the doors, but I was an adult by that point and lived too far away to have a key lol", "Ok Grandpa", "I let my 10 and 7 year old walk to school and I’m just waiting for someone to call the cops", "Same here. I got ankle surgeries on both ankles a few months apart when I was living on the third floor of a dorm with no elevator. I was fortunate enough to be close friends with some of the people on my floor who just happened to be very large men that lifted regularly. They would take turns giving me piggy back rides in and out of the building😂. I meal prepped tasty, high protein/complex carb meals for all of them as my piggy back tax. If I didn’t have those guys, going downstairs was out of the question. Slippery stairs, crutches, and pain meds don’t mix well.\n\nUsing the stairs with one leg requires two arms. If I was down an arm and a leg and sister was too drunk to carry my ass back up the stairs, I wouldn’t have gone down to let her in. Most I would have done is thrown a blanket out the window and unlocked my car with the key fob so she could sleep in there.\n\n***\n\n~~Also, why didn’t sister wake up the parents if it was such a big deal?~~\n\nEdit: sorry, parents were out of town.", "Same after my back surgery, I actually got yelled at by a nurse for going up the stairs at home when I had my weekly phone call with her.\nNTA", "This! I broke my ankle.  Had a cast for months.  Walking up and down the stairs is a pain. I would make her do a devils promise in writing. If I have to suffer then I would take advantage of it.", "ADHD here. It was actually my 3rd grade teacher when I was 8 lol. \n\nBless that woman, she made the biggest difference in my life. I could never remember to get my planner signed every day and then put it back in my backpack. I always showed up to school with an unsigned planner or no planner at all. I always forgot and lost EVERYTHING.\n\nInstead of punishing me, she held me back from recess one day and talked to me about how some people have more trouble remembering to do everything they’re supposed to do because their brains work a little different. She told me not to beat myself up because it was harder for me to do those things than it was for other people, but I still needed to find better ways to help myself figure out a solution that works.\n\nShe made a “shoe rule” for me where I wasn’t allowed to take off my shoes when I got home until my planner was signed. Then, I could take off my shoes and the signed planner (and anything else I needed the next day) went on top of my shoes so I didn’t forget it the next morning. She bought a big pack of glittery shoe stickers and glitter glue and we decorated my planner together so that it helped me remember. \n\n… so here I am, nearly 30, putting everything next to my shoes.😂 I reached out to her a few years ago to let her know how much of an impact she made.", "Doom pile. First step is to dump everything; keys, phone, wallet, shoes, pants in a highly visible, out of the way spot. That's where my keys and wallet live. My phone gets collected when i need it/think about it. \n\nIt's not perfect. I still forgoet my phone about 5 times a month. Luckily I have a job where swinging by my place isn't a huge issue, but I've had other jobs were I just go without a phone for a day and that's okay. \n\nIf i was rich I'd have a house smart phone or a tablet or something that does everything my phone does and allows my phone to live in the doom pile but it's not worth.", "For OPs sake, let's hope their parents see it the same way you do. Otherwise, OPs choices might also land them outside without assistance.", "Yah but it seems like it's 2 or 3 AM when this is happening, (I'm assuming from how it's written) how quickly would that lose its shine?", "I’ve had roommates do this, and sure, it’s hella annoying. But I’ve seen plenty of news articles about alternatives, and as much as I might hate my roomie in the moment, I couldn’t live with myself if they were kidnapped, assaulted, killed, etc.", "Yeah makes sense to have your inhaler in your bedroom at night. I think most people just leave purse/wallet/keys near the front door so it’s just quicker and easier to grab when you leave and put down when you come home. I don’t think having that stuff in your room is wrong though", "I don’t necessarily think it’s weird to have them in your bedroom. Most people just have them near the front door so it’s easy and quick to grab them right before they leave and put them down right when they come home.", "At 3 AM? It's very possible she made calls and no one picked up. Because you know... It's 3 am.", "You're missing the point. Something could have happened 2-3-4 hours from the moment the sister came home. If OP got down in 15-30 min, it would still be better than nothing.\n\nIdk, it baffles me how people don't get this, I'll stop trying to explain...", "Does he never leave his room? Bathroom, eating, doctors appointments? Dudes in a a leg and arm cast, not disabled. He was just being a vindictive dick.", "Dude, what's your point? If there's a possibility of getting hurt by going down the stairs, then that possibility exists all day, and he does it anyway since he said they are alone.\n\nIt would literally be fine if it took him 30 min, but leaving her outside overnight will never be fine. Do you not understand that it's simply not safe, especially for women, to be alone at night, and ESPECIALLY if intoxicated? The risk outweighs the punishment. I mean, I'd rather break both my arm and leg than get raped, if we're talking about what could happen.\n\nGod I hope your family never has to depend on you if this is your thinking...", "Just because OP was able to get down the stairs does *not* mean it was easy for him. Also it would've taken time for any kind of help to arrive.", "Can't you just bring your room mattress down and put it in the floor? I would do that using the stairs was so difficult.", "Fair, I can see situations where that is not practical. I suppose it really depends on how difficult it would be to get a proper bed into the living room.", "Again, he had no problem going downstairs in the morning without assistance. Either you can or can’t, this guy is making excuses for being an AH to his sister, the time on the clock doesn’t change his physical abilities. I actually have delayed gastric emptying and if eating a big breakfast saved someone from a dangerous situation I’d do it for the minor discomfort, in fact sometimes it happens on accident because it’s hard to gauge the actual limit until it’s too late. I’d much rather put myself in an uncomfortable situation than leave someone in a dangerous one.", "I have a feeling the parents won’t be happy with him either, and they won’t care if he’s got a NTA rating from Reddit. If these were my kids, and I have kids of this age, the daughter would get a lecture about responsible decision making and underage drinking but the son would get a lecture about not being an AH and leaving his sister in a potentially dangerous situation. He is staying there for assistance with his condition but doesn’t show equal grace and compassion to his own sibling.", "I live in Denmark so this is a legitamate concern when I go out drinking. If my friend gets shitfaced an falls asleep at the busstop, they might not wake up again. I am taking 0 chances with that", "OP is capable of going up and down stairs, otherwise they couldn't have been left home alone. And she did go down the stairs the next morning. \n\nThe sister was definitely an asshole, but if OP had left her outside in a dangerous situation and something serious happened to her, then it would be in part OP's fault, because she asked for help and while it is a huge inconvinience to OP, it is not impossible.\n\nIf the house had a gated backyard, was in a safe area and the temperature was quite high, then the likelyhood of something happening to the sister is quite low, so she learned a lesson the hard way. Depending on how drunk she was, and if the dog bed was in an unsafe place for the sister to sleep, then OP would definitely be the AH.\n\nOP is not going to have to get surgery again because she had to walk down the stairs at 3am instead of at 8am when she usually gets up.", "The amount of people on this subreddit that think its not your responsibility to put in any effort to the health and wellbeing of your friends and family is insane. If OP wasnt injured is it still not their responsibility? Whats the maximum amount of effort you are willing to put in to ensure your loved ones are safe.", "Once the mistake is made, you cant go back in time and change it. Im not saying the sister isnt an asshole, just that after a bad choice is made, the alternative to not helping fix it could be far worse than any lesson that may be learned instead", "So being raped or murdered after drinking is 100% on the victim? Gotcha, hear you **loud** and clear", "If it was that risky, he wouldn’t be sleeping upstairs, and especially not alone. It’s irresponsible to forget her keys, but the possibilities that could befall a drunk woman sleeping alone outside are not a just punishment for the crime of repeatedly not checking for one’s keys.", "Your logic is really messy here. No one makes the choice to be assaulted. That choice is entirely on the person doing the assaulting, no matter what the victim is wearing. However, in this circumstance, there is no other 3rd party. It's just the sister and her choices. She chose to leave her keys. She chose to go out drinking. She chose to get drunk. She chose not to call a friend. What if OP wasn't there, or she lived alone? The outcome would have been the same... her choosing to sleep in the dog house. \n\nIf someone is assaulted, their choice was taken away. In this circumstance, none of her choices were taken away. That's why people are saying, \"she made the choice.\"", "Yeah, she wasn't hurt so we don't have to take into account her losing toes.", "Let's say op did come back down the stairs. Because op is hurt, it could take up to 5-10 minutes which is still plenty of time for rape or murder to happen.", "Assuming she doesn't come home drunk and leaves the door open you mean", "Reading this comments I feel like you are the disabled ones ahahahah\n\nOP said he is injured (with cast in arm and leg) and he had NO problem in going downstairs in the morning to wake her up\nAnd THAT means... he is not disabled", "Lmfaoooo", "But it was their \\*parents\\* that walked to school uphill both ways, though.  :-)", "That is crazy to me. Don’t get me wrong, 5 was way too young to be left alone without adult supervision, but 13? Most of us were babysitting at that age.", "We walked 5 miles to school and back-all uphill, in the snow! 🤣that’s what our parents would tell us.", "But you try and tell the young people today that... and they won't believe ya'.", "🤣", ">My parents are currently out of town \n\nParents were not around at the time to do anything.", "And, in addition to parents being out of town, what would she have done if OP hadn’t been broken, and wasn’t even there?", "Lmao I'm picturing OP making a compromise for next time that they can install one of those tree house buckets to lower a sleeping bag for her to sleep in instead xD", "parents were out of town", "Parents were out of town/away", "Agreed, I had major back surgery (have had 5 actually all in my 20's but this happened on surgery #2 which was the largest but not the worst) I had come back to the USA specifically to have this surgery so I stayed with my dad. My dad is lovely and very kind and caring but can't do a lot physically to help me as he is disabled (has an above the knee amputation and older prosthetic leg) and every step he takes is painful and he also struggles with terrible nerve pain in his stump (residual limb) as well as having the bottom of it where the skin was folder over and sewen shut split open constantly meaning he has a perpetual deep wound on the part of his stump that carries all of his body weight and he needs to move and use to make his mechanical knee function. When people ask about his condition, I describe his experience of walking like this: imagine that you are 200 lbs and every step you take is being done on your bare elbows on hard pavement covered in lots of sharp gravel. It makes every step you take count and you have to be very calculated in what you do and how you do it just to manage the basic necessities of your day. When you live like that you really start to reassess how important things are to you, like cooking a proper meal or showering daily, cleaning the house, etc. it makes a lot of things fall by the wayside. A lot of people see how some advanced prosthetic legs have really helped amputees and so assume that's how it is for all amputees and sadly it's just not the case, many people can't use the more advanced prosthetics or simply don't have access to them. That example I gave doesn't even touch on nerve pain or other things amputees can have going on but I think adequately describes how it feels for him to walk. Also he falls a LOT and when you don't have a leg, you can't catch yourself to break your fall, you just slam down and often break ribs.\n\nAnyway, So I would have to be beyond desperate and truly near death to ask him to physically help me move my body or bring me stuff.  Anyway, after being discharged and coming home I had no choice but to drag myself crawling, crying and moaning in pain to get up the stairs and then was stuck up there for a week. We managed by him setting food and drink for me on the highest stair he could reach, or my younger sister brought stuff up when she wasn't at school. Thank goodness for those commode / shower chairs and a walker. Those allowed me to manage in the bedroom and bathroom but it was absolutely hell on earth. Being disabled and only having another disabled family member to rely on, especially one who is much worse off than you is such a scary position to find yourself in. I'm going through it again right now with eye issues/surgeries and losing my vision to genetic bs, it makes everything so much scarier. It's hard for him too as he wants to help and support me but is stuck watching me struggle because he simply can't help me how I need, through no fault of his own.\n\nEven now with all my issues I routinely push my body past its pain threshold and physical limits to help him with things because I know no matter how much I'm struggling and suffering him trying to do the same task will hurt and exhaust him 20 fold. Luckily he's the most understanding person I know about pain and physical limits and reminds me to not push myself and to slow down and do things at the pace my body requires but I'm stubborn and life doesn't always allow that. \n\nIn regards to the nurse yelling at you, she's totally right, my neurosurgeon said I shouldn't lift or carry anything heavier than a home/office phone. It's very common after back surgery to herniated a disk (or reherniate the disk they just cleaned up) if you push your body. Also most back surgeries involve cutting through your muscles that support your core so its very easy to get hurt. I feel for you and hope you're doing better. :) back stuff sucks sooooo much.\n\nI feel for OP here and can't really say she is wrong, only she knows her condition and the sacrifice required to go down stairs at that time to help sis and so she's in the best position to make the decision. Sis was well warned ahead of time and knew what the consequences would be for her lack of responsibility but failed to take it seriously (and as someone with ADHD I understand how she might be struggling but its still not right to make it someone elses problem. (I bet younger sis felt she could guilt injured sis into giving in) and by demanding injured sis to bend to her will she completely belittled and downplayed the level of sacrifice she was requesting which is generally inconsiderate and an asshole thing to do.", "I have a little chant “keys, phone, wallet” and pat my pockets; phone & keys in right pocket, wallet in the left. Since starting work I added, “security pass”, which hangs around my neck. It’s so deeply ingrained that when i’m on holiday and don’t have keys or a security pass, my heart skips a beat every time I leave somewhere.", "Oh, what a great story about your shoes and planner!   That teacher deserves a medal!", "More secure to not have them right by the door in case of a smash and grab break in, especially if you have multiple vehicles and leave keys at home when you're out.", "It’s also possible that she went out with friends and those people are also awake. And unless OP neglected to say that she did try, I’m inclined to think she didn’t. \n\nBesides, OP would be risking further injury trying to navigate the stairs alone, and would absolutely be dealing with increased pain. If they tripped and rebroke a limb, sister still isn’t getting inside and OP is now is an emergent situation.", "Something could've happened in the 15-30 min, it may have taken OP to get to the door as well.\n\nEdit: I'm a woman who knows all too well how fast things can happen.", "And using the moral hierarchy of the injury to feel justified in this behavior. Yuck. OP should concentrate on healing themselves instead of controlling and smearing the behavior of their sibling.", "He likely has help getting down the stairs and it still takes time to go down the stairs with an injured leg.", "Tell me you've never been hurt this bad without telling me you've never been hurt this bad. Let's say op did manage to get downstairs, could op rely on her to get back up the stairs? They literally said they're JUST starting the healing process in a comment. Op is in EXCRUCIATING pain. Op would've been stuck downstairs all night most likely as the sister was too drunk to help them back up the stairs.", "It doesn’t matter, easy or not, fast or not, OP’s decision was the most AH of all possible options.", "And maybe their parents don't want anyone sleeping on their living room sofa.", "Would it be the same if OP was 2 hours drive away?  I mean they COULD drive over there and open the door for them but would they be an asshole for not?", "Again, I didn’t say you cannot do these things without assistance. I said they are difficult and often painful. \n\nSister could have remembered her key when asked all those times before leaving for the party or could have contacted a friend and stayed with them. \n\nIt’s an ESH situation.", "Yes, not leaving others in dangerous situations is very important. One of my friends was left in a field once when he and a couple others were walking back drunk. If he had fallen down slightly different he would’ve landed in a puddle and most likely drowned. Just because the sister wasn’t seriously harmed here doesn’t mean it the situation couldn’t have been dangerous.", "Is DK that cold? It barely goes under 0 even in the winter.", "That's not how disability and mobility issues work... just because you can do something at one time does not mean you can manage it at a different time, and it doesn't mean you can do it more than once. I know this very well as someone who is disabled and has had many back surgeries and also has a father who is an above the knee amputee. It's not as black and white as that and I really don't like when people tell other people what someone with disabilities is capable of without talking to that person first, it causes so many unnecessary issues, misunderstandings and often rude and invasive remarks. I got injured in my early 20's ans am mid 30's now and I routinely get dirty looks or abusive remarks for using my handicap parking plaque that I truly need and use with consideration. Please be aware that many disabilities and issues are not outwardly apparent to others and if you see me doing something I very well might be pushing my body beyond its limit due to desperation and then won't be able to walk or move for 2 days afterwards. Injuries and disabilities are complicated and we should defer to and believe the person experiencing it when they say what they can and can't do and know that is the answer for that specific moment, not an always rule. This would go a very long way to making life easier and far less confrontational and stressful for all people, disabled and not disabled alike. Cheers :)", "It's painful and difficult to move with a cast and dangerous on the stairs especially with an arm in cast.\n\nAlso I'm not so sure op should have been left alone at home or sister just ditched op for the party .\n\nTbh I'm kinda sick of hearing you are responsible for someone else choosing to drink and do stupid things.\n\nIf op would have been ok I might consider ESH but as is the responsibility lies alone with the sister period.\n\nYou aren't responsibile enough to drink with limits - (having enough judgement to take care of yourself after drinking )don't f@king drink", "You don't simply walk down the stairs with you leg in a cast. You slide down on your bum, step by step, holding one leg awkwardly in the air to try to avoid the jolts. In one hand you hold (or frequently fail to keep hold of) your crutches, and the other hand you use to push yourself forward and lower yourself down each step until your triceps give out.  How you do it with only one arm, I don't know. Once you're at the bottom, you've got to somehow push yourself off the steps and into standing position only using one leg and one arm, and get your crunches into position before you fall over.  And then you sleep on the sofa because you can't face going up again.", "The amount of people on this sub who think adults shouldn’t be accountable and responsible for themselves is insane. Again, this wasn’t a one off this is something she does ALL THE TIME. Where’s the demand for her to become a responsible adult?", "The only person whose health and well being of the sister IS THE SISTER.", "She continuously does this which makes it not a mistake. A mistake is something you do once and fix. This is blatant, repeated, irresponsibility and inconsideration on her part.", "What? She slept in a dog bed in her own yard. She could have been kidnapped and assaulted at the party (and honestly that would be more likely). She could have got into a car accident in her Uber (assuming she didn’t drive). She could have been poisoned by party snacks. Stfu. Assault is never the victims fault. But it CERTAINLY wouldn’t have been OPs fault. Assault is the fault of the perpetrator. Not anyone else.", "Bruh.. that wasn't the case here and you're the only one wanting her to get raped with your messed up hypotheticals that, oh shit new flash, didn't happen.", "Some house styles, like raised ranches, have stairs that go from the entry way to the living area. So I’m assuming OP did not choose to have to manage stairs, but is instead at the mercy of the literal house.", "That's a very interesting line to walk, mentally. So someone who sees a dangerous situation should never interfere because, if they hadn't been there, the outcome would be the same?\n\nWe should never stop to give the heimlich because, if the dying person had chosen to eat the bite of food that's now choking them at home, the outcome would be the same? Man made his choice, I suppose.\n\nI suppose I should tell everyone I work with to stop giving life saving heart surgery because no one took away the choice of that 45th hamburger for the guy on the table? I mean, they consciously made choices, knowing the risks, for years right?\n\nYou're utilitarian, if nothing else.", "If you would vote differently because she had been hurt, then that's dumb.\n\nEither she deserved it because OP told her so, or OP is an AH for having the opportunity to help and choosing not to.", "On top of that. What if op fell down the stairs. Because the odds of falling down the stairs when you are already in that shape increases. \nSo apparently it would still be op's fault because she didn't ziptie the keys to her sister", "It is, certainly. I'm simply saying it's either wrong for OP not to help, OR the sister deserved whatever happened because she forgot her keys.\n\nI'm not into the moral relativism of \"it's ok because she didn't get hurt.\"\n\nPointing out that we often hear \"she deserved it because she dressed like that,\" \"she deserved it because she drank too much,\" etc. often in a space where people are foaming at the mouth to say \"she deserved it\" isn't popular, but any form of meaningful thought on Reddit rarely is.", "You liked that, here's another good one.  So when I was 12 or 13 I wanted one of those baseball alarm clocks where you threw it to shut off the alarm.  Mom said in no uncertain terms would I get one.  Dad knew she said no and got me one anyways.  Mom comes into my room to say goodnight and tells me when the alarm goes off in the morning to throw it through my bedroom window (she told me I would not get in trouble and she would give me $20 if I did it). Alarm goes off and I throw it through the window like I'm Nolan Ryan.  My dad got his ass chewed and I made $20.  It was glorious.", "2 miles each way in the snow", "I love how quickly this devolved", "Lol", "I was watching a 2 and 4 year old by myself at that age.", "Don’t forget, we only had one shoe between our siblings and us because we were too poor to afford the other one, so we would have to take turns carrying the others and hopping in one foot because snow is cold", "Oh, oops.", "“Hadn’t been broken” made me laugh, but you make a good point. I bet if OP wasn’t there she’d have found a solution. She’s just salty that OP wouldn’t bend over backwards (too soon?) to make things more convenient for her.", "A dog door with one of those keyed collars so OP's drunk-ass sister can crawl through. Unless she forgets the keyed collar along with her actual key.", "So glad I’m not the only one who does this 😭 I will sometimes literally say out loud “my __ is not in my pocket and that’s on purpose because it is __” because otherwise every time I move around my brain will go THE THING ISNT IN UR POCKET WE CANT FEEL IT EMERGENCY ALERT lmao", "I don't have a song, but I check to make sure I have my phone, keys, and wallet 3 times before I'll ever step out the door!\n\n1st check after getting dressed, 2nd check as I walk to the door, 3rd check when I open the door, but before walking out!  no, I don't have ocd, just too many times forgetting over the years.", "Yup, before work USUALLY, keys, wallet is in my bag, phone, and earpiece. Truck driver so all of those are a necessity, and luckily I work close to home for those times when \"usually\" doesn't happen.", "Poor mom (who is too old for her own ADHD diagnosis) raised 3 of us. We already have our own kids, and Sunday dinners still end with her saying \"wallet, keys, cell phone\" as we're leaving.", "I do the same exact thing but with physical pats.  I pat my pockets and belt loop every time before leaving the house. I  make sure keys are clipped to belt loop, check pockets for eye drops, lip balm and nose tissue, check my neck for phone (it's on a neck lanyard and also has my wallet attached). and only then can I walk to the car and double-check. I already brought out my insulated water bottle and then go. I also keep doubles of everything in my car in 2 different spots. Lots of eye drops, lib balm, boxes and pocket packs of tissue, Nasal spray,  water etc. Anything I could possibly need while out has a double or 2 that live in the car. Also in the car I have 2 magnetic dashboard phone stands, one for my phone and the 2nd is for my popsocket wallet and for hanging my keys on it via a hair tie. This makes it impossible to exit the car without my necessities. \n\nI also set up a little station in my room/house where I stage the things I will need to take with me and I make sure it's in a spot that I won't eaisly miss when leaving. \n\nAdhd is so damn hard but lots of little tricks and techniques allow me to be a generally responsible,  successful person. I still really really struggle with time blindness and use lots of alarms and timers but I still really can struggle at times, especially if anyone else is around as I'm trying to get ready and out the door as it causes too many intrusions to my mental process and distracts me from staying on task. I just get to excited to talk sometimes lol... this reddit account is case ans point lol", "Teachers like her deserve the world. \n\nTangent here… sorry OP. I have a knack for teaching and developing curriculum based off of individual learning styles for complete understanding, long term retention, and growing self efficacy. It’s really important to me and she was the perfect example of it. \n\nThe saddest thing about the way our education system works and most parents’ attitude towards teachers today(in the US) is that teachers like her no longer have the freedom to teach/help their students in the ways they know will work best. They get in trouble for it. The good teachers have to just sit there watching kids struggle, know how to help, and then DON’T because they would be risking their job. The, “It takes a village,” mindset is dead. \n\nIf a well seasoned teacher suggests solutions to social/academic/behavioral issues they’re seeing in the classroom, a lot of parents don’t want to hear it and are likely to put the teacher on blast or report them. “My child has done nothing wrong.” “This teacher is singling out my child for no reason.” \n\nWhen my 3rd grade teacher didn’t let me go to recess that day, kept me in the classroom, pointed out the things I struggled with, and came up with special rules for me that didn’t apply to other students, a parent might claim, “My child is being discriminated against, singled out, and punished for their disabilities.” “It was very inappropriate for that teacher to pull my child out of recess and be alone in the classroom with them with nobody else around.”\n\nA lot of the good teachers out there that legitimately give a shit about our kids are miserable and depressed. It’s heartbreaking knowing that today’s kids are less likely to get the kind of help I got from that teacher.", "Yeah I understand the more secure part of it, just personal preference too", "How would OP know she didn't call anyone if he had the gall to turn off his phone knowing his sister was drunk and outside?\n\nYou all don't love your family, man. I'd rather fall down the stairs again and call 911 than letting my little sister fending for herself at night, drunk, in the cold and without a way to communicate with me in case of an emergency. \n\nYell at her all you want in the morning. Glue her keys to her neck if needed be. Don't leave a woman outside to potentially get sick, kidnapped, raped or even die because you want to say \"I told you so\" in the AM.", "He says he went down the stairs the next morning, which means he was alone as his parents were out of town\n\nDude was just being a dick.", "And a broken arm don't forget. It makes it even more difficult and dangerous", "And that would still be better than leaving the sister outside where should could be raped or kidnapped or murdered since she was drunk! Wtf, how do people not understand the possibilities...\n\nIdk man, no matter how much I hated my sister, I'd never leave her alone at night. If I broke both my legs, I'd rather call the damn cops to come and help her than leave her outside alone.", "No one said OP was responsible for her sister’s drinking.\n\nSometimes people make poor choices, but that doesn’t mean we make them suffer disproportionate consequences, especially when it’s possible not to. As people are saying, if it had been cold or a high-crime area, would it really be an appropriate punishment for drinking and being irresponsible about one’s keys to freeze to death or be assaulted? Obviously not.", "You can yell at her the whole next day and youd be fine, but putting her in a potentially unsafe situation that you can get her out of to punish her isnt the answer. Drunk people dont behave rationally.", "Whats the maximum amount of effort you would be willing to put in to help a family member or friend in a vulnerable situation they got themself into?", "I have a sister. I wouldn’t want her to freeze, be assaulted, or get Lyme disease in pursuit of “learning a lesson” no matter how much I think she needs to learn. This is a weird take.", "So dramatic.  In fact, it is pretty common behavior related to the combination of immaturity and intoxication.  It happens to almost everyone at least once in their lives.  I’m saying the price may have been too high for the low possibility that she taught her little sister anything at all.  It’s just not how we learn our lessons.", "Does that address the potential consequence of leaving a drunk women (who in theory OP cares about at least a little) locked out in the middle of the night?", "She could have been assaulted or mugged on the way home, thereby losing her keys. According to OP and you, that’s just too bad and she should still have to sleep outside. “Comes with the territory” or something reading your replies", "Exactly!", "More lmao cause this is my kids with their dad and I.  It was a constant one up between us and they played the game right along.  I love it.", "...barefoot...", "So, who's going to be awarded the Darwin Award for this forced devolution? :-D", "I'm sorry but I laughed about the tick....", "Just make her wear the collar and tell her it's sexy. Some people definitely think it is so it's not even lying!", "One of my kids ended up at The Carroll School.  A private school for only dyslexic kids.  Actually, they are the place that developed Orten Gillingham, the gold standard for teaching dyslexic kids.  The comorbidity for dyslexia and ADD appears to be high, from what I’ve seen (is there research?  Dunno, but, so many of those kids clearly had ADD) So, while my kid was there, they came up with NCLU.  “No child left unorganized” (a pun on NCLB). They had a last period, homeroom (5-7 kids), that was 5minutes long, where the teacher checked in with them to make sure they had their homework, books, laptop, plugs, etc.  Just a quick thing to try to help them be successful.   \n\nThey all had IEPs, obviously.  They could all have extra times on tests.  BUT, they taught self advocacy, in age appropriate ways. In 4th grade, as a math test was reaching the end of the period, they would be reminded that if they needed more time, they had to write MT at the top of the page. If they didn’t, they couldn’t have it. They were reminded, they didn’t have to figure it out for themselves, or anything, they only had to cooperate.  When they wrote MT, the teachers arranged for the time, not them.  It was part of a gentle, ongoing, every day push towards independence.  I really liked that place!", "Let me rephrase that. He likely has help to make it FASTER and less painful. The sister knew she needed her keys. She's an ADULT. I was remembering to grab a key when I was 8 because I KNEW I needed it, just in case my parents weren't home. It's not that hard to remember a key", "with a broken leg, sometimes the stairs are a once a day thing. they're *draining* and op was probably exhausted from being woken up. \nnot defending him, id have busted my ass for my sister even in that state. but just explaining", "This!!!", "Again 'we make them suffer ' . Op didn't make her suffer squat she put herself in the situation it's not op s responsibility. \n\nAnd op told her to call a friend and go sleep at their house. The sister decided not to - again drink or not  her responsibility not op s .\n\nIt's not punishment it facing the consequences of your own actions.\n\nJust as you can't force anyone to do what you want including sober you can't force them to do so drunk.\n\nThey need to learn to be responsible for themselves.", "I’m not sure why everyone keeps saying OP put her in this position. She made the sober choice to not leave the house prepared. She put herself in this situation. She is an adult. Not a child. At some point, she needs to be responsible for herself. What is no one was home at all? OP is only there temporarily and parents were out of town. Then who would you all put the blame on?", "- I just commented this somewhere else: Honestly, this would have been a different conversation if OP didn’t have a broken leg and a broken arm to try to navigate the house and stairs with. He is there to recover, not to babysit an adult. She continuously makes the decision to forget her keys at home. This was the one time she needed to be responsible for herself and she wasn’t. This is on her, sorry. Edit: spelling", "No one forced her to sleep outside. She had options, she chose not to utilize them out of spite.", "Honestly, this would have been a different conversation if OP didn’t have a broken leg and a broken arm to try to navigate the house and stairs with. He is there to recover, not to babysit an adult. She continuously makes the decision to forget her keys at home. This was the one time she needed to be responsible for herself and she wasn’t. This is on her, sorry. Edit: spelling", "And that same drunk ADULT cares very little about the rest of her family.", "She didn’t have her keys. She regularly forgets to take them with her. She did not bring them when reminded. Again. For probably the hundredth time. This wasn’t a “whoopsies I’m always responsible and lost my keys” moment. And she called OP. She could have just as easily called a friend- probably even one that was still awake from partying with her. Again, she figured out and arranged for herself to get home, I don’t think it’s unreasonable to expect that she can make arrangements for herself for the night.", "While carrying 20 books and their sibling", "On my hands without gloves in the snow.", "My little brother is dyslexic (almost every male on my dads side is) and BOTH of our parents have ADHD, so we were screwed from the start😂. I would’ve killed for him to be in a program like that. I dragged him through school all the way from kindergarten until the end of his senior year when I left for marine corps boot camp. I found out the kid tried dropping out. I felt so bad because I thought the coast was clear for me to leave because he was on track to graduate.\n\nWhen I got that letter, I went out on a limb and requested to make a phone call home. It’s not something you just… get to do. They actually let me, thank god. He got the ass chewing of a lifetime from myself and my drill instructors. He changed his mind pretty quick and graduated high school. \n\nA program like that would have been so nice for him. He’s a fucking genius but he just can’t read/write. Not a single day of college and he just got promoted to a mechanical engineer position at a major oil drilling company at 24 years old.", "That's about how I feel, I just think OP is a bad person for using his injury to punish his sister instead of just dealing with some pain. Dude is in a cast RN, should be used to pain AND probably has medication to alleviate it", "If Nobody was there then therw would be nobody to put the blame on, and if something did happen to her it would be her fault, but who gives a fuck about fault if something happened? If I left my sister outside when I could have helped her and something happened to her, I wouldn't be able to live with myself even if she put herself in that spot.", "We get it was on her, you don't need to be callous though.", "Sure,  I’ve been the guy with the broken keg.  I get it.  If she knows her sister isn’t able to find her keys, a loving sister would stash a key somewhere for the sister to find it.  3AM call “I‘m locked out, let me in!”  OP “Remember, I put an extra key under the flower pot”.  Immediate set of problems solved.  The bigger problem of having an immature sister with a binge drinking problem can be addressed after a goid night’s sleep.  Someone has to choose to be the adult, and no one should be left to destroy her own life over a night out with friends.", "...and a bucket of coal, for the furnace.", "At Carroll, they are continually reminding them of all the famous architects and entrepreneurs who are dyslexic!  One dyslexic lawyer my family knows, David Boies, who doesn’t take notes and speak from them.  So opposing counsel has trouble, as he questions witnesses on the fly, not following any rational pattern.  It’s really hard to prep witnesses when he is going cross examine them!  My kids loved this. \n\nA dyslexic embroidery engineer, [Tricia Ngygen](https://thistle-threads.com), has put together many embroidery classes, lessons, and developed a whole series of reproduction cabinets, frames, and things. (Link to her store and blog).  She used to design specialized gear for the military.  Fought her way through MIT.  I crawled through MIT, never reading a textbook. My friends read them and taught me each chapter!  But I don’t have issues writing, just reading non stories. I can decode or I can comprehend, just not at the same time. Stories and knitting patterns I can read fine. So, we assume my kid got the dyslexia from me, mine is just sub clinical.", "If nobody was there, there still would be someone to put the blame on.  The same person the blame is on if there were 100 people there.  The person who negligently left their keys behind.", "Maybe but OP could not help. OP was in a cast that makes going up and down stairs very difficult. A fact that the sister knew. If she didn’t want to sleep on a dog bed, she could have brought her keys or phoned a friend.", "OP could have called the police. Let them know she had broken limbs and on pain medicine and unable to safely navigate the stairs at that time. Tell them you are worried for her safety. Something tells me a lot of people would consider OP the ass,  if she had done that and temperatures were above risk of hypothermia.", "Lmao so OP should have babied her? Be fucking real. Sister is AN ADULT. Not a silly 13 yo who sometimes forgets her house keys. She can hide her own keys."]}