{"id": 30855, "submission_id": "17tukgs", "title": "AITA - wife's parents passed away and she wants a 6th child to help with grief", "selftext": "As the title mentions, my wife's parents passed away 3 years apart from each other with the most recent in 2022 when my wife was 36. Since her parent passed in 2019, she has mentioned wanting another baby to help with the grieving process and focus her love. I have been on the fence and we have gotten to a point of potential divorce as a result. \n\nFor back story, we already have 5 kids with the oldest going to college next year and the youngest at 4 years old. After the youngest, I got a vasectomy. We went back and forth over if I would do it or her, but I went through with it because I mentioned she had already done enough by having 5 kids. She went with me to the procedure and was there for me through the process. \n\nFast forward to today, I've been back and forth, but am not 100% certain on having another and getting a reversal. She says I'm inconsiderate of her and that I broke our wedding vows by not being there for her in her time of need. \n\nMy concerns are financial and that I'm starting to enjoy the ability to do things we couldn't do with younger kids/babies. She says that I'm being selfish by not taking her want into further consideration or having a reversal by now. \n\nAm I the asshole for not having a baby to support my wife through this tough time in her life and did I break my wedding vows?", "created_utc": 1699825265, "permalink": "/r/AmItheAsshole/comments/17tukgs/aita_wifes_parents_passed_away_and_she_wants_a/", "score": 360, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I did not agree to wanting baby after my wife's parents passed away. We have 5 children already, but she claims I'm the asshole and broke our wedding vows for not agreeing to have baby to help her grieve and put love and focus on a new baby.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. The cure for grief and depression is not childbirth, and even if it were, your own desire - or lack thereof - for a child is as important a factor as hers.\n\nThe idea that you are somehow breaking a vow is ridiculous …. why is she not supporting your needs? She needs therapy, not another baby.", "NTA. \n\nShe already has 5 children to \"focus her love\" on. Using a child to heal her grief would be unfair to ALL of the children. It would put too much pressure on the baby to growth up as mommy's emotional support object and it would likely cause resentment towards a new baby by the older children. \n\nWhat your wife really needs is therapy.", "Nta. Your wife needs therapy, not a baby.", "A CHILD IS NOT A BANDAID!!!", "NTA.  She already has 5 kids to love, unless she's one of those parents who only loves on babies and then leaves older children to raise themselves, or worse, parentifies the oldest one.", "NTA. Maybe think about getting a puppy or a kitten or therapy to help her with her grieving process. Human babies don’t make good emotional support animals though.", "NTA. 5 children is more than enough. Oldest of 5 here ... Don't let yourself get talked into it either.", "NTA. She needs intensive therapy not another child.", "Thank goodness you already had a vasectomy. What a terrible reason to have a kid and not likely to be any more successful at solving the problem than having a kid to 'save a marriage'.  Your wife needs therapy and grief counseling.\n\nNTA.", "Children are not emotional support animals.  Eek.", "NTA.  Wanting another kid to focus her love is so messed up.  She's got five other kids to focus her love. I can see her completely shutting out the others and smothering this poor kid.  What your wife needs is therapy and a lot of it.  Your poor other kids - Jesus, she's cast them aside so she can have a shiny new toy.", "It’s a terrible burden to put on a baby.", "NTA - what will happen when this  child doesn’t solve her grief?", "NTA and grief is a very poor reason to have another(6th!) child. Babies should always be a joint decision and you have very valid reasons for not wanting another one. Encourage your wife to seek therapy, join a grief group or find some other ways to channel her feelings.", "NTA \nShe needs a therapist.", " NTA\n\nWanting another baby \"to help with the grieving process and have something to focus her love\", isn't really logical thinking. That feels right up there with people who have a baby because they think its going to save a failing relationship. She has 5 children and a husband to focus her love on. \n\nShe sounds like she could really use some grief counseling or something. She should at least do that and get her feeling sorted out before taking any steps to try to have another baby.", "NTA it’s not right to bring a baby in the world to take on the job of healing their parent. Beyond that, if she’s in such a fragile state I can’t imagine what it’d do to her if she miscarries. Miscarriages aren’t uncommon. Anyhow, there are plenty of children for her to love on already. I agree with the others who’ve mentioned therapy.", "Unfortunately, that child’s gonna be in for a miserable 18 years if it only exists for a “purpose”, I’ve lurked around this sub long enough to know that. NTA", "NTA - hold firm.  Your wife is being narcissistic, selfish, and manipulative.  Do \\*not\\* have another child with her, another child would be an absolutely enormous financial and time burden that you don't want and likely cannot handle.", "NTA. Having another baby won't help her grieve. I think she needs to go to therapy and deal with her grief not only about the grief she's experiencing now, but also her grief over the fact that she's done having children.", "It doesn’t work. I had a 3rd baby got the same reason. \nGet a puppy.", "NTA. You did not break your wedding vows. Grief is a HORRIBLE reason to have a child. Your wife needs therapy.", "INFO - why can’t she channel her grief into loving her current kids and husband?", "NTA. A baby shouldn't be born with a job. And a baby born to your wife under these circumstances will have a job. The job of healing your wife's grief.", "NTA. She has 5 children including a 4 year old to “focus her love on”. Your wife needs professional help. Popping out another kid to help her feel better is not healthy.", "NTA\n\nIf your wife wants to focus on love, sleep deprivation is not the way forward. And she already has five living children (one of whom would have been very young in 2019) to feel that love.\n\nAnd I don't believe reversals of vasectomies are as easy as the movies make it seem. \n\nYour wife needs time, love, understanding... possibly some form of therapy could help... But don't saddle a child with being a grief baby.", "NTA. I am an example of why not to do this. My parents were struggling majorly with grief and marriage issues. They had me.\n\nFrom the moment I was born I have been told I was born to fix these issues. I am now in intensive therapy and have major trauma.\n\nI also have a lot of issues with my mom due to this (she was the one that wanted another kid to fix things and was a major component in a lot of my childhood trauma).\n\nPLEASE DO NOT HAVE A KID TO FIX ISSUES!!!!\n\nAlso, if your wife is majorly dead set on this, do not have sex with her until it's worked out. I know people personally and have heard even more accounts of a partner sabotaging birth control or protection to force a baby (from both men and women).", "Stick to your guns. Five children is more than enough, you've had a vasectomy, and her irrational misplaced \"more kids or you're a traitor!\" line is... nonsense. Parents die. You don't need more children, no matter what the excuse is, and she doesn't get to override your clear desire to NOT have a sixth baby. NTA", "NTA, and in no way have you broken a wedding vow. She needs grief counseling, not another baby. If she did have another, the poor kid would be saddled with all of her issues. Grief counseling all the way.", "NTA & one has to wonder how fragile your marriage is when divorce is being dangled as a consequence of you not bowing to her desire. That’s aside from the accusations she’s leveling about “breaking your vows”. Which vow, exactly, says one spouse must always agree to everything the other wants?", "> She says I'm inconsiderate of her and that I broke our wedding vows by not being there for her in her time of need.\n\nYour reluctance is based on logic. Her \"need\" is based on emotion. She's attempting to be manipulative, and is seeking something that is not going to solve the problem. She needs intensive grief therapy. She has 5 children and a husband to love! The 4 year old doesn't need to be replaced by something new. *New things won't fill the void her parents left - she needs help to deal with that.*  Therapy is really important.", "NTA. Having a(nother) kid DEFINITELY needs both parents to be on board. You not wanting a kid is just as valid as her wanting one.\n\nBut the real problem here is that your wife is hurting and she is making poor choices to try and make herself feel better. A baby is not an emotional support animal. Your wife needs therapy so she can learn how to handle her grief in healthy ways.", "NTA she needs therapy and a cat. I moved across the country to be with my husband, who was in the military at the time, and I had no one near me. No family, no friends, and my husband was gone for long periods of time. I adopted 2 cats (sisters under a year) and it helped my loneliness and depression immensely. I eventually made a friend (wife of one of his coworkers) but before that my cats helped.", "NTA your wife needs therapy, a hobby and maybe a puppy, all of which are cheaper and less time consuming than another human. Grief is not a good reason for a baby.", "NTA. \n\nI don't think this is the right reason to have a child. A child is not meant to grow up as a therapist. I think it's called emotional incest where the child becomes responsible for the parent's emotions?", "Your wife needs counseling. \n\nShe mentions that she’s grieving. Having a child is NOT the answer. Therapy is.", "I want to know, what exactly is wrong with 1. You and 2.-6. your other five kids for focus her love upon? \n\nI’m so lost as you probably are as well - how does your not being sure you want a reversal that you got “because she did enough” now translate into “breaking your wedding vows?” I mean you all literally said this in your vows?? Somehow, I doubt it. It’s breaking your vows for believing her and visiting Dr. Snip?? That’s a painful procedure- I was with my ex husband when he had his done!! \n\n\nWow, she is being unreasonable. You’re NTA", "NTA… your wife needs therapy for her grief.. a child isn’t going to fix her losing her parents.. \n\nBefore you get a reversal, get her into therapy.. especially with some of things she’s saying to you.", "NTA, her behavior here is pretty manipulative, not agreeing to another baby is not breaking your wedding vows 🙈Don’t know if she’s always like this or if it’s just the unresolved grief but she needs a therapist, not another baby", "NTA Your wife is simply not being realistic right now and in her pain she is being incredibly selfish. How would the rest of your children feel if they knew she needed another baby to help bandage an emotional wound? My guess is they’d feel like they weren’t good enough for her.", "NTA. Making a major life decision during a time of immense emotional turmoil is just about the worst decision ever, especially when that decision involves other people. Children are not cute little accessories to cuddle and play with to help you when you’re sad, this is an actual human being that she’s talking about and it’s so irresponsible to bring another child into the world/your family to “get over” her grief. It’s no different than having a child to try and save a marriage, it may distract from the problems for a while but it will not fix anything and ultimately that child will likely suffer for it.", "In addition to the other logical reasons already spelled out there is also the risk if she were to become pregnant at her current age (guessing 40 or close to it) that this may lead to complications or other issues with the birth or disabilities for the new child.  This is not fair to that possible child or the consequences for the rest of the family.", "NTA You two agreed on a plan, and you had a medical procedure based on that plan. I'm sorry she's having a rough time but aside from another child not being able to solve this anyway it's a *massive* life change that would require both partners consent. She can't pull the marriage vow card--you didn't vow to go along with anything she ever wants, you vowed to be there for her. And you are.\n\nShe needs therapy, not a distraction, or this will never end. She'll just keep trying to have more kids every time the sadness re-emerges until she's too old to have more and the eldest ones start having grandbabies she can distract herself with. I've seen this happen a **lot**. You can delay grief but you can't run from it.", "She should get a dog, not a baby. NTA", "NTA. The cure for complicated grief is therapy. Please don’t let her talk you into this. It would be a terrible thing to make a child responsible for his mother’s happiness.", "I appreciate all the comments and feel guilty even posting this. She is a great mom and we have amazing kids so please don't interpret that way. I just don't understand the reason for wanting a baby in the situation and I feel like a jack*** for not understanding. We have gotten dogs (2) and 2 cats since. But she can't shake the feeling of wanting another baby. I should mention that I initially wasn't thrilled when we found out about baby 4 and with baby 5, like an asshole, I mentioned abortion because I was fearful of being able to provide. We have had some issues outside of this involving my parents and how they've treated my wife and kids. For years, I was blind to it, but eventually cut them out of my life for the betterment of my family. I don't talk to many friends because not many understand having 5 kids or large family for that matter. She has me feeling like a complete a hole and told me that I didn't meet her in the middle. I think she means going through with the procedure even if it didn't take and we couldn't get pregnant. But being unsure of wanting a baby, I didn't take that step. I wanted to provide a backstory in case I'm missing something. I just feel terrible she's so upset with me over this. I've even said \"let's do it\" but she says she doesn't want to have a baby with me if I don't truly want one. So I'm at a loss as to what to do! I really appreciate the feedback.", "Is your wife in grief counseling? A child isn't a bandaid.\n\nNTA.", "NTA- kids shouldn’t be born with a job. It’s unfair to saddle them with adult responsibilities like fixing mommy’s grief of keeping their parents marriage together. These are adult problems, a kid isn’t going to fix them. As others have said your wife needs a therapist not a baby.", "NTA, snother child isn't going to make her grief disappear.  She needs to focus on the family she already has. She is being swlfish for wanting a child to help with her grief, a child is not her emotional support crutch.", "NTA- she wants a baby now… how will she feel in 5, 10 years time will that child feel resentment from either or both parents?  Honestly I don’t think your wife is in the right frame of mind to make a 20 year commitment that you are not 100% behind…", "Good lord please do not allow this, a child is not a coping mechanism \n\nShe needs therapy \n\nNTA", "NTA. No more.", "NTA your feelings are also important. Also having another is not an answer.", "I suggest you & your wife make an appointment with a financial planner to discuss retirement and college costs.  Has your wife been working outside the home?   Meeting with someone who is not emotionally invested would be a good reality check.\n\nNumbers don’t lie.", "NTA\n\nBesides what everyone else has said, if you had your vasectomy 4 years ago it's pretty much 50/50 that it'll be reversible anyway. What's she gonna do if this is the case?", "NTA. Already so much good advice that I don’t need to add to saying the same thing.", "Making a baby to salve grief or any other kind of emotional discomfort is problematic.  Does your wife typically look to her kids as a means of distraction from pain?", "NTA.\n\nYour wife needs therapy, not a baby.", "Her claim that you're breaking your marriage vows is absurd.\n\nThe decision to plan another child belongs to both parents.\n\nNTA. I'm sorry for her loss and her grief, but all children should be desperately wanted. It's never a good thing for one parent to be forced into it. Stand your ground.", "Nta.?it’s bodily autonomy and just like her you have rights to not father any more children.", "NTA\n\nThat'd be so much pressure  to put on this baby. A way to focus her love? A way to grieve?", "NTA. Your wife needs therapy, not another mouth *you* have to pay to feed.", "Her biological processes may be driving this as well.  I became incredibly clucky during peri menopause. I got a dog. \nNTA. Counselling would be great. Also underlying this may be questions of identity once your youngest starts school. Motherhood can become an all encompassing identity for some people. \nOh. NTA again. You wife needs therapy.", "NTA. A sixth kid will not help her. You have five already and she needs to focus on them.\n\nThis isn’t a need of hers. It’s a want. And kind of a horrible one considering the expense and loss of freedom that you’ve dealt with many times before.", "NTA - your wife supported you having the vasectomy in the first place, so she obviously wasn't considering more children. A reversal is not a sure thing. And having a child because you are grieving is not a good reason to have another child, your wife needs counselling, not a pregnancy.", "NTA.  Possibly OP could encourage wife to babysit for new mothers nearby?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAs the title mentions, my wife's parents passed away 3 years apart from each other with the most recent in 2022 when my wife was 36. Since her parent passed in 2019, she has mentioned wanting another baby to help with the grieving process and focus her love. I have been on the fence and we have gotten to a point of potential divorce as a result. \n\nFor back story, we already have 5 kids with the oldest going to college next year and the youngest at 4 years old. After the youngest, I got a vasectomy. We went back and forth over if I would do it or her, but I went through with it because I mentioned she had already done enough by having 5 kids. She went with me to the procedure and was there for me through the process. \n\nFast forward to today, I've been back and forth, but am not 100% certain on having another and getting a reversal. She says I'm inconsiderate of her and that I broke our wedding vows by not being there for her in her time of need. \n\nMy concerns are financial and that I'm starting to enjoy the ability to do things we couldn't do with younger kids/babies. She says that I'm being selfish by not taking her want into further consideration or having a reversal by now. \n\nAm I the asshole for not having a baby to support my wife through this tough time in her life and did I break my wedding vows?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "One of the biggest mistakes you can do is to create a new life built from grief. She needs therapy not a new child. NTA", "NTA", "NTA for a million very sad reasons.", "Five is already plenty.  She needs a therapist.", "Children are not emotional support animals ffs. Nta.", "NTA. A child is not a cure for grief. She needs therapy.", "NAH\n\nIm reluctant to call your wife an AH in her grief.  I think she is just not thinking clearly.\n\nYou should lovingly comfort her in her grief, but also (gently) tell her that making serious life decisions while she is grieving is not advisable.   \n\nShe probably needs to take to a grief counselor right now, and perhaps even the two of you could visit a marriage counselor together.", "A baby is not a tool for grief support and I think her desire is misguided. She needs therapy to deal with her grief, not rampant hormones and sleeplessness. NTA. You deserve an equal say in this matter and a baby is a ”two yes, one no“ type of situation, if there ever was one.", "Having a child to avoid the grief process is resoundingly irresponsible. Children should not be brought into the world to avoid pain and discomfort. NTA", "NTA. She is NOT thinking clearly. She can focus her love on the kids she already has.", "There’s something called prolonged grief disorder, and it could well be your wife has that, I am having a hard time thinking of a worst reason to have a child ( and I can come up with many) than the one your spouse is proposing , \nDon’t give in, but help her seek professional help, it could make a world a difference \nGood luck to you", "And let’s just remember that vasectomy reversals are not guaranteed by any stretch of the imagination. At all. NTA", "NTA\n\nYour wife needs grief counseling, not a baby. Babies don’t “fix things” & god forbid she has a miscarriage or pregnancy complications which would make everything so much worse. She’s not thinking clearly here. If she won’t get counseling or change, divorce may very well be your only option.", "I’ve lost both parents and a brother in 8 years. Grief is fickle and consuming at times. But having another child would not cure it. I mean, I could maybe be ok with a pet. But not a whole ass human.", "A baby should never be born with a ready made job.", "NTA-  this is reproductive  coercion-  ‘give me a baby for my emotional support’. Is not a good place to start. \n\nYou should encourage your wife to go to therapy to deal with her grief.", "Absolutely NTA she would cause so much emotional damage to that child", "NTA\n\nShe doesn’t need a child as an emotional support animal, she needs therapy!", "NTA. Having a baby is not going to help with her grief. It’s just going to make her pretend not to grieve. Creating another person is not the answer to losing a parent. Plus your youngest was an infant when her first parent passed. She has her grief baby. \n\nYou are there in her time of need. You are making sure she doesn’t create a situation that causes financial hardship on your family. Plus the other kids are going to resent this baby because she is going to treat her grief baby different than the others. You should tell her for you to begin to consider reversing your vasectomy you want to go to therapy with her to work through everything.", "NTA. A kid is a living breathing being, not some emotional support doll. Kids shouldn't be brought into this world bc someone is depressed", "NTA! A child is not an emotional support animal. She needs grief counseling and maybe a literal support animal.", "NTA. Your wife can focus all her love in your 4 year old", "A baby is not a replacement for therapy.\nBy not seeking proper therapy she is going to create mentally scarred and unstable children.", "NTA. Babies don't fix problems. She needs therapy...not just for the grief, but for her atrocious coping. Five kids is plenty and you've already had a vasectomy with her knowledge, consent, and support...holy moly.\n\nYou have not broken your vows, and she's being incredibly manipulative by trying to GUILT YOU INTO CREATING A HUMAN.\n\nHave you sought marriage counseling?", "NTA. A baby is not an emotional support animal and her wanting to create another human for such a reason is insanely selfish. She needs to get grief counseling. \n\nAnd that \"breaking the vows\" bit? Thats just straight emotional manipulation and abusive.", "NTA, as others have said she needs therapy. This child would have an immense responsibility thrust upon them by being the \"piece to try and mend the hole\". No one deserves that.", "Your wife is nuts.", "That poor (potential) child. Children are not emotional support animals, not at any age. Your wife needs a therapist, not another child. What an insane amount of unnecessary pressure and guilt to put on a child who finds out (and they will find out) that they were brought into the world because their mother needed something to focus her grief on.", "Having a baby because of grief is a terrible idea. Your wife needs counseling. She has 4 more left at home that need her attention. Not to have it taken by a baby.", "INFO: If your youngest is 4, then why didn’t focusing on them help her grief during that time as she puts it?\n\nShe doesn’t need another child. She needs therapy.\n\nEdit: NTA", "I am sorry for her loss but DO NOT have a baby... Do you know of anyone with puppies? Or kittens? If grief therapy isn't an option then gind a puppy... way better than a child.", "NTA.\nShe needs therapy.\nAnd maybe, a dog?", "NTA even if you had all the money in the world. She's not in a place to have another kid, she doesn't want another kid, she wants a distraction. If the 5 kids she has aren't enough to focus her love on, then how are they going to be treated when a baby arrives?\n\n\nYour wife needs therapy, but your 5 current children need to know that their parents love them and support them l.", "NTA and your wife is acting like a dumbass. Tell her to get some therapy. What a ridiculous excuse to have a child.", "NTA\n\nShe can get an emotional support cat or dog or go to therapy, a kid is a real person not someone a parent can use to hide from her issues", "NTA. You’re allowed to not want to have anymore children.", "I barely approve of emotional support animals and she wants an emotional support human. NO. You already have five other kids, are those kids not enough? I'd be creeped out by her. Babies are not toys. NTA.", "NTA - Your wife needs therapy or maybe an emotional support cactus, not an emotional support toddler.", "NTA. Your wife needs therapy, not another kid", "NTA.\n\nYour wife needs grief counseling. There are 5 children that she can already \"focus her love\" on.", "Having a baby to fix your grief is so wrong!!!  Don’t do it. Get her to a counselor!!!", " NTA - why can't she pour that love into her current 5 kids?\n\nOr a dog?\n\nDogs are great because they will always just be home for you, no growing up and flying the nest. And they give back the love and kindness they receive in a way that is less work and more consistent than with kids. \n\nSounds like a wacky combo of grief and empty nest vibes.\n\nStay strong. This is a really unhealthy reason to want a kid. And it's legit you don't want another.\n\nSupporting someone through grief is not \"putting aside your life completely to cater to every whim\" and the fact she is playing that card I think is further reason to double down.\n\nKids are for life yo. And not an emotional crutch, but a whole new human", "Babies aren't emotional support animals. They are little humans who have needs that their parents are supposed to fill, not the other way around. If you don't have the energy, time, and resources to support another child, then don't have another child. Your wife needs grief counseling, not another baby.", "NTA. Was she a stay at home mom? If her parents have passed on and the youngest in full-time school, she may be feeling a bit lost in regards to purpose and direction.", "NTA. Get her some grief counseling and maybe suggest an emotional support animal. Bringing a child into the world to make yourself feel better is not fair to the child!", "NTA. A baby isn't going to fix her grief. Babies aren't bandaids or fix-its for problems we have. She already has 5 children to pour her love and attention into.", "NTA   Maybe your wife can volunteer at a hospital to rock babies who need human touch.", "NTA\n\nIt's a terrible idea to bring a child into the world as a way to overcome grief.\n\nTherapy would be much better and probably less expensive.", "NTA. Jesus Christ a child is not an emotional support animal and her reasons for wanting a 6th child are horrible.", "Your wife has five kids and what sounds like a loving husband to pour love on.  Get her a puppy or kitty.  Thank God you got the vasectomy.", "NTA she needs grief counseling not another kid.", "Spend the money on therapy for your wife. It is a shitty thing to do to bring someone in this world to replace someone who has left this world. That puts an unreasonable set of expectations on a child from the very start.", "Nta.  She needs therapy   Get her a puppy.", "YTA to yourself for letting this go on for so long.\n\nYour wife is acting out of her mind. She needs medical help now. This isn't the kind of thing that stays contained. Your kids have noticed. The four year old you have has noticed. This has affected them. You don't know what's she's said to them when you weren't there.\n\nYou didn't break your vows. She's using DARVO to make you look like the bad guy. She's making you responsible for herself so she doesn't look crazy. She's emotionally abusing you.\n\nShe doesn't want a child. She wants an emotional support animal. If she's acting like this, you have no idea what'll happen if the baby doesn't act the way she wants it to. \n\nThis is a giant ass red flag. Either get her medical help or get divorced over not having another kid  because this is insane.", "Putting her grief on a child, and expectations that a CHILD could be the cure to depression, a CHILD could have the responsibility of 'curing' Mom,  is not sane. Someone should talk to her doctor, she needs therapy, not 18 more years of childcare. You need to be the strong one in this. NO.", "nooooo!  don't do it", "And, the financial cost to do the reversal, plus the cost of another kid. \nI was at work the other day and overheard 2 people talking about their kids. The guy says \"yeah so x kid wants to go to college next year, so I told him to figure it out now, I've got 7 other kids, I can't pay for his college\". \nAnd I just think, ya know, another of people only have 1 or 2 kids and can't afford it.. but damn, OP is already considering financial implications...with 5 already.", "She needs therapy. \n\nAnd has she stopped to consider that 5 kids and a husband are enough people to focus her love on?\n\nShe is using her grief to manipulate you into another kid, reversing a decision you both made and you followed through on surgically, with complete disregard for your feelings. Not great!", "Op please read this comment. 💯💯", "Here’s what I don’t get… the youngest is 4, her first parent passed away four years ago, isn’t that already her grief baby?", "Yeah - get a dog or something, not a kid, if she is seriously unable to quell her desire to \"focus her love\".", "Absolutely.", "Agree. Grief counseling is such an important part of living.", "They don't even stick.", "That was my thought, too.  Maybe less for the grief part but the number of people I know (including me, lol) who got a puppy when their youngest kid started kindergarten or 1st grade is pretty high.  Like, we still wanted something small and cute to nurture but weren't up for another human.", "Oh god don’t get a pet to fix your wife’s grief, OP.", "I’m just sitting here thinking about the fact that I have a mom that isn’t dead, but isn’t good at being an emotionally available mother. I went through grief at not having a supportive mom for my pregnancies. But having 5 healthy pregnancies and a supportive mom and then to get reminded that she isn’t here to support you is a one way ticket to ppd.", "This. 👆", "1- You werent thrilled with #4.\n\n2- You didn’t actually want #5.\n\n3- You dont want #6, but you’re “considering it” and saying “let’s do it”, to… i dunno? Shut her up? Make her happy even if it makes yiu miserable (which is always a great thing for a kid)?\n\nWhat is wrong with you? GROW A SPINE AND DO NOT LET HER MANIPULATE YOU. \n\nWhat she’s suggesting is VERY unhealthy for a future child. And YOU don’t want it. STICK TO YOUR DECISION.\n\nThe best you can do is to find help for your wife. She needs grief counselling NOW, and she DOESNT need a bandaid-kid.", "not to bring up a terrible situation either, but what if their baby was sick, or god forbid miscarriage, etc. then what happens? if she is depending solely on this baby to cure her grief without going to therapy or getting some sort of help, its only going to worsen the situation.", "Uh yeah, she can't focus on the kids she already has??", "OMG THIS.  Yes.", "No, a dog is also a serious commitment of 12-18 years, and one should not make that decision while grieving.", "They're often sticky tho, at least while young.", "XD XD XD", "That’s a real thing? An ESA could be good for this woman", "I do tend to agree. Although I think I would definitely leave a full discussion to OP as they know their wife and the details of the situation. I know that everyone handles grief differently and they said their wife's last parent passed \"in 2022\" but not when in 2022. I know when my dad passed there was a significant difference in my grief one year after his passing and two years after his passing."]}