{"id": 30863, "submission_id": "17tvsst", "title": "AITA: my cousin wants to bring a surprise baby to my baby shower", "selftext": "My cousin texted me a week ago telling me that he had a baby that no one in our family knows about. He said he’s bringing it to my wife and my first baby shower and can’t wait for everyone to meet her. (He hasn’t even told anyone she exist) I at first was excited but then was confused why he’s waiting until our baby shower to tell everyone when the baby is 2 months old. My wife hasn’t said she’s upset but I know the baby shower should have all the attention on her and our future baby. Am I an asshole if I ask him not to bring her?\n\nUpdate: My wife and I collectively posted this. We both don’t know how we feel on it but are leaning that we don’t understand the point of waiting until our shower. Second it’s a cogender shower. ", "created_utc": 1699828528, "permalink": "/r/AmItheAsshole/comments/17tvsst/aita_my_cousin_wants_to_bring_a_surprise_baby_to/", "score": 34, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Should I tell my cousin to not bring his baby? And I think if I do it will cause a rift in the family.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  This is like a wedding.  No surprise announcements, no one should be getting engaged, announcing they're pregnant - or announcing they just got married, engaged or 'Surprise! I have a baby!\"  Tell him to announce it now or you will.  And do not bring it to the shower. At all. This is not his day.", "NTA- ladies and gentlemen you’ve heard of wearing a white dress to a wedding…now let us present bringing a new baby to a baby shower!!!\n\nTell your cousin to get a sitter. How did he even acquire this baby that no one knows about? The drama of it all…that baby is not invited to your wife’s baby shower!!", "Nobody gets to steal the thunder at some else's milestone event. This would include cousins so excited to steal your thunder by bringing a surprise baby to pull everyone's attention of your baby at your baby shower.  (This is right up there with proposing at someone else's wedding reception.)\n\nTell your cousin that unfortunately the surprise baby will have to be a surprise at some other event, but that the baby can't come to your shower.  \n\nNTA", "Just how long has your cousin known about the baby? The pregnancy? Why was he hiding it? \n\n He's hijacking your baby shower, thereby having YOU pay for HIS party (which is what it will be when he shows up with a surprise baby. It would be interesting to know if he's even paying child support. (Assuming he's not married? What a weirdo.)\n\nCall him and dis-invite him from the shower, unless he hosts his own damn party. \n\nNTA", "NTA\nThis the time to celebrate your wife and your baby. Bringing this MASSIVE news is def. Stealing your moment as a growing family. He can organize his own party and have his moment then.", "NTA that’s just super rude of cousin; hijacking your event for his kid.", "NTA, but ask your wife specifically if she thinks it is a good idea. Some people don't like to share the attention in good moments and others do.", "You know he’s going to steal all your gifts, right? His baby is already here, and yours doesn’t need ‘stuff’ yet…", "NTA, but I wouldn't ask.  I would send a group chat to the whole family congratulating them on their new baby.  Then there is no possibility of them making an inappropriate announcement at your baby shower.", "NTA. This should be a decision made with your wife after having an honest conversation about it. It’s a very strange time to announce (and bring) a living, 2mo child that no one knew about. It will certainly change the vibe of the gathering.", "NTA.\n\nIf he wants to show off his baby, he can plan (and pay for) his own party.", "NTA. Your baby shower is neither the time nor the place to introduce his baby.", "NTA. Guests should only bring their children if the baby shower invite specifically says so (I'm assuming yours doesn't and that nobody else is bringing their babies). Tell them to have their own post birth baby shower.", "What is it with some people and always needing to be at the centre of attention, and even going as far as to completely steal one's thunder to do it?\n\nBig NTA.", "NTA\n\nTell your cousin to schedule their own baby shower and you will be sure to attend but your baby shower should be focused on your family.", "Stop him please!  That is for mother and baby.  He would be robbing your wife!  Upstaging your child’s first party!", "Nta\n\nTell him if he does, he's responsible for half the costs since he wants to make your celebration about him without having to put any effort", "NTA. You should never hijack someone else’s event with your own news like this. And this is just weird why does no 1 know about the baby?", "NTA. This is your baby shower not his sip and see. If your wife agrees I would ask he not bring his baby as it would distract the attention from the mama and baby who the shower is actually for.", "I would make a family group chat of everyone that’s going to be at the baby shower and send a screenshot of his text message", "Nta this shower is to celebrate you and your wife, not your cousin. He'll upstage every thing.", "NTA but this is ultimately up to your wife. How does she feel?\n\nPersonally, I would have been fine with the baby coming as I don’t like being the center of attention. All of the family will be gathered so it’s a convenient time to introduce the surprise baby.\n\nHow does one keep a baby secret anyway? That’s the weird part.", "You're an asshole if you DON'T say something that ensures he does not bring some secret baby to your baby shower. Why does he have a secret 2 month old baby? Weird.", "NTA. If he's been keeping it a secret for two months why is your baby shower the proper time for him to show it off? Absolutely ridiculous of him to think that's okay. Tell him no and to tell his family like a normal person does.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy cousin texted me a week ago telling me that he had a baby that no one in our family knows about. He said he’s bringing it to my wife and my first baby shower and can’t wait for everyone to meet her. (He hasn’t even told anyone she exist) I at first was excited but then was confused why he’s waiting until our baby shower to tell everyone when the baby is 2 months old. My wife hasn’t said she’s upset but I know the baby shower should have all the attention on her and our future baby. Am I an asshole if I ask him not to bring her?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nYou can try to talk to him about not making that announcement at YOUR party, but he probably won't respect this. You know him better, do you think he'd actually NOT bring her if you asked? Have you tried to have a conversation about it? Have you talked to the baby's mom? Most new moms won't want their baby, at two months, to be out and about and surrounded by strangers at a party, with all the germs.\n\nDo his parents even know? Is he planning on hiding it from them, denying them the chance to meet her until he can go full attention hog?\n\nYou have some options. \n\nTalk to the mom, and tell her he is using the baby as an attention prop and bringing it out to be passed around at YOUR baby shower. It's likely she's already had one, and he's jealous, OR they don't have enough friends to warrant one, and he is trying for not only attention, but a money grab.\n\n\nWhat you might do, is ask him if he has any pics of her :D Whether he does or not, post a CONGRATULATIONS on social media. Tag all the family. Tell him you can't wait to meet the new member of the family. Ask when he's going to have a party for her to introduce her? Will it be his parents, him and baby's mom hosting, and when/where/time it will be!\n\nNot the best idea, was it?\n\nYou might consider calling his parents and congratulating them on being new grandparents. Encourage them to make arrangements on a belated 'welcome to the family' (DO NOT CALL IT A BABY SHOWER) \n\nOR\n\nHave the party at a venue that has doors that shut and lock, not your home. Uninvite him and make sure the managers running the place know to keep him out. If you are THAT determined to keep him out.", "I’m not the type to be mad about things like other people getting engaged at my wedding or people celebrating their birthdays at my birthday party. But bringing a surprise as big as this to a party for you and your wife is beyond the pale. \n\nWhat if all the reactions aren’t as expected? \nHow will the surprised family members ever return their attention to the other new parents? This seems too much, and is the type of news that deserves its own party. \n\nYWNBTA", "NTA. This is about your cousin and his baby. They can do a family dinner and surprise everyone at the dinner they plan.", "It's neither the time nor place to debut his baby. NTA", "NTA. Tell your cousin you’re so excited for him and that you would be more than happy to help him plan a belated baby shower or dinner for family to get together and celebrate his child but that you and your wife are just too excited about this shower that you’ve spent time and money planning for everyone to help welcome your new baby. Thank him for being so understanding and ask if there’s a timeline you can help him plan his special surprise.", "NTA \n\nTell him to have his own party. What he’s suggesting is insane. Then again, the whole ‘secret baby’ thing is crazy to begin with. \n\nIf he brings the baby, drama will ensue. I have so many questions and I’m not even related to any of you.", "NTA - Dudes don’t go to baby or wedding showers.", "NTA. maybe suggest the introduction happen another time, thank them for telling you but let's face it this will steal all attention when you are hosting something for your baby.", "NTA. Tell them this is inappropriate and ask them not to bring the baby. This shower is about your baby. \n\nIf they say they are bringing the baby anyway, then tell everyone about the baby before the shower.", "Op and ops wife, hi! Please don’t be bad or guilty for not wanting your cousin to bring this baby to your big event. It’s not that you don’t want the baby, you just don’t want the spectacle. It should be about you. Cousin is an idiot for even thinking that would be ok to suggest. Tell him to throw his own party for his grand reveal", "NTA but your cousin is. That's completely taking away from you and your wife's celebration. Everyone will be all over the baby and it will be front and center. I'd tell my cousin to introduce the baby on his own time.", "NTA\n\nHe’s specifically planning on stealing your event. You planned and paid for this party for your child.\n\nHe’s had months to plan a party for his kid.", "NTA. Your baby shower is not the time or place to introduce a surprise baby.  This event is about your baby, and the focus should be there. \n\nI'm guessing your cousin sees this as a \"safe\" way to break the news, where nobody will cause a scene maybe?   Again though, not cool", "It’s YOUR DAY YOUR BABY SHOWER. It should be about your baby not theirs. Tell them you’d prefer them to have their day before hand maybe.", "OP should tell everyone invited to the shower at least a month before the party so they have time to meet the child", "The baby is 2 months old so…hopefully he’s known about it for at least a few months…? Lol \n\nYa actually I’d say he can only come if he brings the baby AND the baby mama. If you’re gonna hijack it let’s go all the way. Present the whole family and let’s do this thing", "Significantly more than even announcing a pregnancy or engagement at the event.  No ones going to be thinking about the baby to come at all when there’s a new surprise baby actually there.  Cousin can’t come I’d say…otherwise he will just being the baby anyway or announce it there.  Maybe OP can tell his parents (or the cousins parents?) and let them be the ones to share it before the shower? Someone needs to announce it prior to.  Very odd to have a surprise baby regardless!   OP is NTA", "He said wife hasn’t specifically said she’s upset but op “knows the attention should be on her and their future baby.” So if he had any common sense he’d tell cousin to fuck off", "NTA. That was my first thought. He's counting on folks giving the stuff to the in-your-face baby with plans to replace the gifts later, and he won't be concerned if later never comes for OP. \nDO NOT let him come !", "This is exactly where my mind went. What a weird situation. NTA and I really want an update on what happens.", "Brilliant!", "No, just tell cousin absolutely not and keep secret baby a secret until after his own shower. Why even bring it to everyone’s attention?", "The shower is this Sunday. 😅", "Hmmm no the showers probably coming up soon and it’s not op’s job to announce his cousins surprise baby. Cousins waited this long he can wait a few more weeks", "I know he said that, but asking if she is upset and if she likes the idea have different directions. Different people and families and cultures have different view on this. I know the most common sentiment here and in the US it seems is that THIS IS YOUR DAY, YOU SHOULDN'T SHARE IT, but in my family for example and my culture, good news are for sharing and celebrations are a chance to share the joy and love and excitement. Love isn't finite amount to hoard it. It is a chance for both young parents to connect with each other as well, maybe bond over their children being same age, foster some future playdates or events. This is especially true when families live so far away that it is complicated to organize a get-together often enough to give these news separately. \n\nAll I am saying is - there are different people, so the best OP can do is talk it through with his wife before deciding.", "I may be cynical, but I think a cousin who would ask to bring a secret baby to your shower is the same kind of cousin who would ignore a \"no\" and do it anyway. Better to be safe than sorry.", "NTA. Tell him your wife’s special day is not the time nor place for his surprise kid.", "Text them the post then because they need to see what we collectively commented", "Call everyone invited to tell them about the baby, ruin the surprise.  \n\nAnd tell cousin that if he brings the new baby you will turn them away. He can visit relatives another day, not at YOUR baby shower.", "INFO — there's a story behind why no one in your family has heard about this baby yet, why your cousin reached out to YOU, and why your cousin told you they were bringing the baby rather than asked whether it was okay. How much of that do you know? \n\nThis baby could be your future baby's best bud. Talk to your wife, then talk to your cousin, and find a way to welcome both babies with love, whatever that looks like.", "\"Oh sorry cousin you're not invited\" then ?", "Ok…so that would be cool for you and your family then.\n\nThe fact that op even is aware that the attention should be on her pretty much speaks to how he knows she wants the day to go. Aka attention on her. Aka he’s aware that a random baby showing up would be quite the scene stealer and she wouldn’t like it. \n\nWife also shouldn’t have to say she’s upset. He can probably tell from her vibe and body language. How can she ban a baby from a baby shower and not lowkey be the bad guy? Like oh a baby’s gonna upstage you you’re worried about that?\n\nMe personally I would outright say ya don’t come it’s my day I’m the pregnant one and we’re celebrating me, you can have any other day of any other speck in time to announce your child to everyone, not this day. But I’m a little more aggressive than most people. So therefore op just needs to step up for his wife", "I don’t think I’d put anything past a cousin who would even have a secret baby tbh", "Thank you! Someone with reason finally", "Just text them what I commented below", "No, he shouldn’t mention the baby to anyone. As far as anyone knows the baby does not exist until after his and wife’s baby shower. If cousin chooses to announce it before then, then whatever, but this weekend is about op’s baby", "Ya the story is probably that cousin knocked up some random and didn’t tell anyone. So now he wants to announce it at someone else’s event where everyones there and has to be polite and nice so he doesn’t get scolded or freaked out at by the parents probably", "“Hey sorry cousin we’d appreciate if you didn’t announce your new baby at OUR first baby shower. If you can’t get a sitter we understand if you can’t come. Can’t wait to catch up another time”\n\nEasy", "To be fair in my culture we don't throw baby showers, definitely not before the baby is born. All sort of gifts and so on that you would give a young expecting couple, friends and family usually give separately in advance or right after they are notified the baby has arrived. So the idea that you are throwing a celebration for an event that hasn't occurred yet is a bit weird to me.", "It will be OP'S DAY Only if they can keep cousin from showing up. Otherwise cousin and gift-giving relatives will make the day about cousin.\n\nHow do you propose that OP makes sure that attention stays on Op and her baby?", "Do you guys not have bridal showers either? It’s basically just a fun gathering where people bring gifts to help the couple prepare for the baby and play games and eat food. It’s supposed to be fun", "I mean phones exist? Call cousin? Say “hey if you value our relationship at all you won’t do this grand reveal at my event?. So either baby stays with it’s mom and you come alone or you don’t come at all.”\n\nHopefully cousin isn’t so hellbent on this idea, hopefully he was just like “hey maybe this will be fun” not thinking that this is a big deal to ops wife. Hopefully he can see reason and isn’t a total asshole about it. \n\nBecause who crashes a baby shower with another baby after being specifically told not to? Like that’s clinical. \n\nIt would be a good movie plot I guess but let’s remember this is real life. COMMUNICATE WITH THE COUSIN OP ITS NOT THAT HARD. If he’s a dick about it say ok don’t come, inform one or two key other cousins to be like lowkey security and deal with it if he does show up", "No bridal showers, we do have hen and stag nights tho, but I think that is more of an import from US/media. The gifts are usually given at the wedding reception or afterwards directly to the couple.\n\nWe do have celebration for new babies, but it is 40 days after the baby is born. It is a bit out-dated tradition that involves only the female relatives and friends and any children (either gender) that they bring to the party. My culture used to be very patriarchal in the old days, so usually if you have guests the woman would be expected to take care of everything and serve the guests. So after a baby is born there was a 40 day \"ban\" to visit that newborn's house unless you were a female relative (because they would be helping the young mom with the chores and the baby and not require her to serve them). So after those 40 days are done, the grandmas would throw a party to introduce their grandchild to the larger family/friends and their children, on which party you usually bring gifts and there are games with the other children or the adults trying to give wishes for the baby's future and fortune. Nowadays it might be that the male relatives would attend too, maybe. Although usually they would be celebrating in a different place after dropping off their wives/children ;)"]}