{"id": 30972, "submission_id": "17v4y0o", "title": "AITA for turning the Internet off after my boyfriend took over the TV when I was watching something?", "selftext": "I'm home full time on maternity leave and my boyfriend works full time. We live in a studio apartment that I inherited years ago so our bed is in front of the only TV, which is also connected to my boyfriend's PC/Xbox. There have been multiple times that he has come home from work at 4-4:20pm and I will be sitting on the bed nursing the baby and watching TV and he will just grab the remote, sit directly in front of the TV (so I can't see the TV at all) and do whatever he wants (YouTube or gaming). I've brought it up several times in both conversations and petty comments (\"yup, I definitely wasn't watching that or anything\") and it's always a \"I worked all day, I just want to relax\" or a \"you got the TV all day, if I want to watch YouTube or play a game after working, I should be able to\". And honestly, it's not an issue of whether or not he should be able to. Of course he should. He busted his ass all day. But it's the disrespect I can't get over. It's the fact that he sees me watching something and doesn't care; just switches it off and sits directly in front of the TV without saying anything to me. \n\nWhen he did it the day before yesterday I had a bit of a flip out moment because my show was over in 20 minutes anyhow and he could have just waited. I told him if he did that shit again I would be cutting off the Internet (I had it paid up for a year and it's in my name). He said some \"I'm sorry babe, I just had a bad fucking day and want to relax and you get the TV all the time\". Again, the issue is not him wanting to use the TV. It's the fact that he takes over the TV without so much as a \"can I turn this off and use it?\" I told him that. I told him communication goes a long way. I thought the conversation went well but apparently not because as soon as he got home last night he was pissed off (bad day at work) and grabbed the remote from my hand and immediately took over the TV. So I shut off the internet. He is pissed at me saying that he shouldn't have to ask first and that since I saw he was having a bad day, I should have just stepped back and not done something I knew would piss him off further.\n\nETA: My show gets over at 4:30, 15-20 minutes after he gets home. He can wait. Especially considering he turns on his game and then goes to eat dinner that I prepared for him anyways so the game just sits there untouched until he's finished eating", "created_utc": 1699976496, "permalink": "/r/AmItheAsshole/comments/17v4y0o/aita_for_turning_the_internet_off_after_my/", "score": 260, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like an AH because cutting the Internet off was petty and childish but I did warn him and I'm tired of communicating about it with no change on his end.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You're *obviously* supposed to immediately stop existing on your own space when he comes home because that's what *he* needs. Also, the baby should be seen and not heard and dinner should be on the table.\n\nHe took the remote *out of your hand* it doesn't get any clearer than that. He doesn't view you as a human deserving of equal treatment and respect. Do with that information what you will, but I'd at least pack up and stay with my mom for a fee days - without restoring the internet.\n\nNta", "Having a \"bad day\" every day is no excuse for being rude and entitled.\n\nNTA.  \n\nIn fact, repeat as necessary until he learns to ask politely.", "INFO:  does he even talk to you? Say \"hi, how was your day?\" or does he just come home, ignore you and take over the TV?", "\"I should have just stepped back and not done something I knew would piss him off further.\"\n\nYeah, OP.   Why aren't you letting your bully bully you the way they want to?  Why are you forcing a partner to have a conversation?  /s\n\n\"can I turn this off and use it?\"\n\nThis is a reasonable expectation.  Your BF is being very unreasonable.  NTA  Keep doing it.", "> ...I should have just stepped back and not done something I knew would piss him off further,\n\nIt's never a good sign when a partner shifts responsibility of their mental health onto you. This is effectively showing that your BF has no manners or that he doesn't think that manners should apply to you when he's angry. Not a good look. I'm also a little curious if you BF equates a day of childcare to watching TV all day... because it's not. NTA. \n\nPersonally, if this keeps this up I'd consider pulling a parenting 101 move and removing the tv from the apartment entirely for a week to punish the household collectively.", "NTA\n\nYou two sound like your teens though. \n\nYour BF is a punk. He needs to grow the hell up and learn some manners, why the hell did you make a baby with this guy?", "SIs, you are home with a newborn - its not like you are sitting around eating bon bons all day. Even if you ARE sitting around, you are up with the baby multiple times per night and watching a show during marathon nursing sessions is NOT just \"sitting around all day watching TV\".\n\nYou warned him to check himself, his behavior and his disrespect towards you and then followed through with your reaction. NTA. He needs to figure out how to behave kindly to the mother of his child because he is acting like a petulant teenager.", "NTA. He's treating you with contempt. Your problems are much larger than the TV watching.", "Y T A to your self for reproducing with this misogynistic selfish asshole with an anger problem and not setting hard boundariea about his behavior. Tell him the nexr time he does it the xbox goes and no gaming on the PC. If he refuses? Throw him out. Seriously. You were NOT at home relaxing with the TV all day, you are recovering from a major medical trauma (all birth involves injury including a dinner plate sized wound on the uterus do not @ me people) and CARING FOR HIS CHILD. You are working through a meducal leave and this ashole thinks you have been lazing around and \"got the TV all day\".\n\nNTA but do yourself and your baby a favor and get this shitty disrespectful asshole in line NOW or get him gone and file for child support.", "NTA but I have a feeling there’s a bigger issue going on here. I wonder if he’s harboring some resentment against you, some people mistaking my see maternity leave as a vacation and the fact that your show is on at the time he gets home he probably thinks, wrongly, bc that’s what he sees when he gets home that you’re probably doing that all day. I’m not saying that excuses his behavior but his possible resentment and communication issues are what really need to be addressed. Maybe look into couples counseling to help you guys get through this bc what he’s doing is not ok", "My goodness, seems he’s making you responsible for raising TWO babies. I’m missing what country or culture you’re living in, but where I’m from you are NTA and his behavior borders on abuse as well as being incredibly immature. The whole “I worked all day” nonsense completely devalues the work of being a new mom. Whoever raised this entitled pr*ck did a terrible job and is now leaving the work to you. Putting your foot down now and having clear boundaries is all you can do. Hopefully he’ll start to respect them, but I wouldn’t be surprised if maybe he doesn’t *want* you to kick his sorry butt out. Good luck.", "NTA Having a bad day is not an excuse for having no manners.", "NTA. \n\nYour bf’s unwillingness to show basic respect is impressive. Saying, “Hey babe, how long is left in your show? I had a long day and would like to watch X or play Y game when you finish” is so simple. Plopping down and changing it in the middle of your show is just fucking rude, especially if you’re 100% okay with letting him relax doing what he wants if he just shows a little decency.", "Why are you married to such an AH? It's your apartment kick him out  let him pay child support, and  he can pay for his own TV.", "NTA, it’s just fucking common decency and manners to ask first. That’s the start and end of this.", "Awful\n Disrespectful. \nImmature \nSelfish \n\nCan't you make it on your own?  You can do better.", "NTA\n\nHe doesn't get to take his bad day out on you by being a douchecannoe to you. Respect is a two way street and he needs to start showing you a heck of a lot more of it.  If he views having to wait -30mins for the TV as disrespectful to him you have a much bigger problem here.", "[removed]", "NTA and I would be furious too; \"past me\" would have wanted to be just as petty and leave him with the baby for a few hours while I went and did whatever I wanted to do every time he just decided I didn't exist. I don't have kids so I don't really know how feasible that is at whatever age your baby is.\n\nSince you think getting another TV is not feasible, if you can financially afford it, get a tablet or another small portable device (Black Friday is coming up depending on where you're from). Honestly, I personally prefer watching shows on my tablet or phone because I can take it wherever I am and put some headphones in and block out the noise from my gamer as well.\n\nI'm not sure what show you're watching and if you can watch it on Netflix or some other app or if you can get your cable or TV provider's app on your phone or tablet, but that would be a great option.", "NTA. You are also busting your ass all day. Being postpartum and caring for a baby is WORK. \n\nYour boyfriend is dismissive, rude and disrespectful. It doesn't matter if he had a bad day. You're not his emotional punching bag and he can learn to handle bad days like a mature adult. Also, if he *must* watch something on youtube immediately, he has a phone doesn't he? \n\nI would have a big conversation with him to address all the ways he is disrespectful and let him know that you will no longer tolerate it. When he comes home, after decompressing for no more than 30 minutes, he should be caring for his child so *you* can get a break. He should be cleaning up after himself at least. You're not his servant at the ready when his highness finally deigns to eat dinner.", "My wife would straight up leave me if I disrespected her like this on the regular. And she'd be right to do so. NTA.", "NTA He is being completely rude. He can't even claim to just be ignorant as you have talked to him about it and explained how it makes you feel. \n\nThe only way to get through to someone who doesn't care how what they do makes *you* feel is to make *them* feel bad from some kind of negative consequence. That extreme would be completely unnecessary if they had any empathy for others and were willing to listen and compromise. \n\nTLDR: Oafs get the rap on the knuckles.", "NTA but your bf sure is. The disrespect is unreal. How do you tolerate it?", "Sounds like he's blaming you for making him mad. Also sounds like he's heard your complaints and is letting you know he isn't planning to shape up. So now you have to decide what you're going to do with this information. Do I continue living miserably in a tiny box with a guy I'm basically letting live here for free and my tiny child, or do I let this guy know that if he can't respect me he can find someplace else to watch TV and have his pity party after work? \n\nWhat in the actual hell is going on with people?", "I'm not telling you to leave the guy, because I don't know you or your relationship but I can tell you that I'd leave the guy. Not even for what he's doing with the TV and remote. But for the things he said when you brought it up how it bothers you. You exist to serve him and be a nanny. That's the vibe I get from his response. Is this the relationship you want?", "NTA but also... buy a second TV? They're like $200-300 for a decent new TV. He's being incredibly rude, but also this fight doesn't need to keep happening.", "[removed]", "I have a bit of an ESH feeling here.\n\nHe's a butt cuz he won't talk to you. It sounds like you don't even get a \"hi honey. hi baby.\" he just runs to the remote (and if it's in your hand the least he can do is say hi) but that's me. I'm a \"you don't come in and not speak to me\" kinda person.\n\nthat aside. You're asking for simple communication, something that isn't that hard. Just a \"when this is over, let me know so I can have the tv.\" it's not like you're asking him to do a river dance for your entertainment while he games.\n\nNow you. You're a butt because you \"understand\" that he should be able to come home from work and do whatever cuz he busted his ass all day, but as soon as he does this, you make it a hill to die on.\n\nNow for me. I love the turning off the internet thing and am gonna use that, for different situations, like someone didn't get their homework done and is on YouTube, or someone straight up disrespects me in my own home and thinks they can finish their season of the young and the restless... IDK what people watch, I've been binging Big Mouth as of late.\n\nNow moving forward. Y'all could get another tv, smaller, and mount it on the wall on the other side of the bed. He can wear headphones (I say HE can because with gaming there's usually things like talking to teammates and he'd benefit the most out of being the one with a headset.)\n\nBut also... moving forward, y'all need better communication. You have to be going a little stir crazy with only the baby to talk to seeing as he barely talks to you. and he needs to talk to you about his day and not just expect you to read his mind and judge the badness of his days.", "You’re both assholes… glad you found each other so no one else gets stuck with you.", "Get a second TV and a headset!", "Nobody is the asshole. It's hard to exist as two separate humans in a space, which quite frankly is built for one. \n\nYou need to buy another TV. And a chair or something. Then you both get your ways. Ta daaaaaa", "You can only afford one TV? ESH", "He work all day to support you and the baby and you complain about a damn tv yeah you inherited the studio but he the one that keep on the bill and still feed y’all if you just complain about tv maybe it a good ideas for you and him to live separately not together the way you acting just for a tv it not good for the baby", ">the issue is not him wanting to use the TV. It's the fact that he takes over the TV without so much as a \"can I turn this off and use it?\" \n\nESH, Everyone Sucks Here.\n\nHe's obviously a rude asshole. Period.\n\nBut if you don't have an issue with him wanting TV when he gets home, then don't get midway into your own show around that time.  Turning off the internet was petty and Mom-ish.\n\nThe two of you are probably headed for a lot more of these nonsense arguments if you're living in a single room with a baby to boot.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm home full time on maternity leave and my husband works full time. We live in a studio apartment that I inherited years ago so our bed is in front of the only TV, which is also connected to my boyfriend's PC/Xbox. There have been multiple times that he has come home from work at 4pm and I will be sitting on the bed nursing the baby and watching TV and he will just grab the remote, sit directly in front of the TV (so I can't see the TV at all) and do whatever he wants (YouTube or gaming). I've brought it up several times in both conversations and petty comments (\"yup, I definitely wasn't watching that or anything\") and it's always a \"I worked all day, I just want to relax\" or a \"you got the TV all day, if I want to watch YouTube or play a game after working, I should be able to\". And honestly, it's not an issue of whether or not he should be able to. Of course he should. He busted his ass all day. But it's the disrespect I can't get over. It's the fact that he sees me watching something and doesn't care; just switches it off and sits directly in front of the TV without saying anything to me. \n\nWhen he did it the day before yesterday I had a bit of a flip out moment because my show was over in 20 minutes anyhow and he could have just waited. I told him if he did that shit again I would be cutting off the Internet (I had it paid up for a year and it's in my name). He said some \"I'm sorry babe, I just had a bad fucking day and want to relax and you get the TV all the time\". Again, the issue is not him wanting to use the TV. It's the fact that he takes over the TV without so much as a \"can I turn this off and use it?\" I told him that. I told him communication goes a long way. I thought the conversation went well but apparently not because as soon as he got home last night he was pissed off (bad day at work) and grabbed the remote from my hand and immediately took over the TV. So I shut off the internet. He is pissed at me saying that he shouldn't have to ask first and that since I saw he was having a bad day, I should have just stepped back and not done something I knew would piss him off further.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "You are the mommy of two.   You have an infant and a toddler.   Sadly, you soon have two toddlers.   Eventually one of the toddlers will grow up.  The other will just expect his mommy continue to fuss over him while he plays video games.", "NTA, it’s not that hard to let you finish what you were watching and then ask for it. It’s called basic manners. I’m sure if he let you finish whatever video or show you were in the middle of you’d be reasonable.\n\nIs he 5 years old? Because that’s around the age where I was struggling to share the tv and video games with my sister and had to learn how to take turns. I think I got over that phase at, oh idk, maybe 7 years old? After my mom banned me from the TV for a week for refusing to share nicely one too many times I got the message. Sounds like you’re applying a similar principle here with a grown man.", "NTA\n\nThe lack of communication part irked me, but the game sitting there while he eats dinner part sent me into orbit. It sounds like he's doing this on purpose to be an AH because he's jealous you're home all day, regardless of how much respective work each of you are doing. You need to get him to go to couples counseling because he strikes me as the type to not listen to anyone but a 3rd party (maybe not even then, but at least you gave it a shot.) Hopefully hearing from a therapist that what he's doing is disrespectful and all it takes is a simple question to solve, he'll change.\n\nI don't jump to \"throw the whole man away\" because sometimes it takes people to hear a 3rd party to understand what they're doing is wrong, but that may have to be an option if he refuses even that.", "NTA - so not only is he treating you like a complete after thought but now apparently you are responsible for his emotional regulation.  I mean obviously it's all your fault that he's acting like a dick.", "I'd start hiding the remote in a different room.  \nAlso he can stream TV on his phone. I watch Netflix on my phone app since I don't have a TV.\n\nIf he asks where it is. Tell him you can use the TV after your show is over. Since you would like to find out how it ends.\n\nOr be super petty and switch off the internet at a good part in his show or towards the end. Two can play this game. \n\nOr take the TV to a friend's house and watch TV over there", "Info. \n\nDo you eat together? Or does he just eat when he wants.\n\nIt sounds like you are no longer of service because you are recovering so screw you?\n\n\nCouples counseling \nNTA", "NTA. He is extremely disrespectful, he clearly thinks he's the most important person in the room.", "NTA. You're asking for basic respect. I've never in my life walked into a room, took the remote from someone, and just changed the channel without asking. I don't give a damn how long they've been home. It's sooooo rude.\n\nIf he walks in from work, tell him what time your show ends since he can't seem to understand basic manners and respect. It's so weird that he keeps doing this when you've had a specific conversation about this.\n\nJust he just disregard your requests and be disrespectful all the time?", "I was wondering in all this that nobody seems to mention. Does he not interact with his newborn baby at all? I mean I don't like kids and will never have a child but if I were to have one I would make sure to interact with the damn child if for nothing else but to create a strong bond with my offspring. And I would make that the first thing that I would do when I got home after being away all day.\n\nNTA all the way. I think you should demand that he takes the baby the moment he comes home and interacts with her while you finish your show", "Back away and not do anything to piss him off more???\n\nI'm guessing he's a child of abuse?", "NTA. \n\nHim saying it’s your responsibility to not make him mad is a huge red flag. It almost sounds like a threat, honestly. Very concerning for him to be so inconsiderate and then push the blame to you, as if he can’t control his own feelings or anger.", "Nta. Get a second remote.  Absolutely insist he stop acting like he owns the place. It's your home and you are still working (nursing is work) so while he had a tough day,  your tough day is not over yet. \n\nand move whatever he sits on that blocks you.  \n\nHe cannot act this way,  period. He gets home and asks what you and his child need,  he does not get home and start goofing off like a teenager after school.", "NTA, but honestly, this is how domestic abuse begins, and he's already put hands on you, considering he took the remote that was connected to you, from you against your will.\n\nI am concerned about you. Please be careful.", "NTA, having a bad day is no excuse to treat you poorly. He needs to learn that- the easy way or the hard way, but he NEEDs to know.", "RESPECT goes two ways.  NTA.", "NTA.  You are however an AH for staying with this loser.  You have a brand new baby and all he cares about is himself and what he wants.", "I'm not gonna vote on who's the AH, i just wanna ask one question (not info)\n\nare you parents or are you the f\\*cking children? how are you gonna be raising a kid with this attitude? \n\n&#x200B;\n\nSorry if i was a bit Harsh, but cmon!!! you Both should act a bit more like adults. If you take out the reference to maternity and work from this post you could pass for 15 y/o", "NTA and his “you get the tv all day” comment implies that he thinks you sit around all day watching tv when you have a baby to take care of. My hubby will take over our tv in the living room on weekends (sports) but always asks me if I there is something i want to watch / am I watching what is on. \nYour boyfriend sounds like a jerk; just because he has a bad day he shouldn’t be coming home to you and his baby and taking it out on you. If you don’t call him out on his behavior now, it will only continue as your child gets older.", "What's the saying, a woman should be home barefoot, pregnant and cooking. That's her only job.  Just cause he is having a bad day doesn't mean he should disrespect you and make you have a bad bay. NTA", "Absolutely agree with this. Taking the remote out of OPs hand is freaking wild!\n\nAs if \"hey can I have the TV after your show?\" is too difficult a sentence. Completely disrespectful behaviour!\n\nNTA OP.", "Yeah, but it's her apartment.", "If he's having a bad day everyday, sounds like at least part of the problem could be solved if he looked inward.", "Depends on how he is that day. He always comes in and fusses over the baby but there have been days in the most recent weeks where our communication is incredibly minimal. It's been a huge change. Prior to the baby we were great but there's been quite a bit of distance since having the baby. I'm sure hormones and just the general learning and changing of having a baby is the factor but I'm not sure.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "We don't have room for another TV or I would. The studio apartment that I inherited is small. It's like one room that is probably the size of a double dorm room.", "Did you miss that OP lives in a studio?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "The apartment is mine. The bills have been paid up for a year, by me (internet, electric, water, house tax). The only bill he pays is his own insurance. I have grown our own food for the past 3 years. I have a green house and pay farmers to board our yearly 2 pigs and 1 cow. The only thing he will have to pay this year, since I cannot, is the butcher cost to slaughter off our livestock, which is $480. And yes, he also has to buy his daughter things she needs, which he is responsible for. I have been doing this since before he came around. He works for his own leisure. I made sure I have everything taken care of well before I even thought about dating.", "Did you miss the part where she's on maternity leave from her job? She may or may not be getting a paycheck now, but she's providing care for their child. So she provides him a place to live and cares for his child. Sounds like their contributions are equally important. \n\nBut even if they weren't, he's being rude and extremely disrespectful. He is TA. Nothing excuses his behavior.", "My show gets over at 4:30, 15-20 minutes after he gets home. He can wait. Especially considering he turns on his game and then goes to eat dinner that I prepared for him anyways so the game just sits there untouched until he's finished eating.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Uh… this is not hormones. Yeah there is a learning curve to adjusting to a baby, but he’s not going to have “hormones” that make him straight up ignore you and be rude. Time for couples counselling.", "He's not the one who just had a baby.  His hormones are the same old hormones he's always had.  He's just being a jerk", "Whoa dude what hormones does he have that have turned him into a massive gaping RUDE arsehole??! It doesn’t get much more disrespectful than this - that’s active contempt, fuck that", "You could mount a small tv on one of the walls. Win-win\n\nHe is absolutely an ass for the way he goes about it, though.", "Nope. I've lived in 3 different studio apartments. One couldn't fit two TVs. The other two easily could.", "What does he actually bring to the table?", "Then I agree with you I just going by the information what you post but it seem like you the main provider of the family and he not I recommend if he can’t respect you and even ask for the tv maybe y’all should live separately until he can respect you", "You should add that to the post.\n\nThat's just fucking petty. It's not about his long day or how tired he is. He's trying to assert power.", "Well, you chose this asshole---as your partner and the father of your child.  I guess the two of you can just continue to antagonize each other over every petty annoyance, that sounds like real fun. /s\n\nLike I said, definitely ESH Everyone Sucks Here.", "Father's go through a lot of hormonal changes and physical changes pre and post child birth.\n\n\n\nhttps://dornsife.usc.edu/news/stories/fatherhood-changes-mens-brains/\n\n>To learn more about plasticity in new dads’ brains, our research groups at the University of Southern California in Los Angeles and the Instituto de Investigación Sanitaria Gregorio Marañón in Madrid, associated with the BeMother project, collaborated on a new study. We recruited 40 men – 20 in Spain and 20 in California – and put each into an MRI scanner twice: first during their partner’s pregnancy, and again after their baby was 6 months old. We also included a control group of 17 childless men.\n\n>We found several significant changes in the brains of fathers from prenatal to postpartum that did not emerge within the childless men we followed across the same time period. In both the Spanish and Californian samples, fathers’ brain changes appeared in regions of the cortex that contribute to visual processing, attention and empathy toward the baby.\n\nNot just changes in the brain. Men will have lower testerone, higher oxytocin, higher prolactin, higher vaspopressin, etc. \n\nMen can also be diagnosed with PPA and PPD. \n\nThese fields of study are very new. Hell the first brain study referenced above was just published last year.", "I've thought about that but he has his guitars mounted all over my walls so there's no where for me to put a mount. He collects guitars so he has them mounted everywhere, which makes this place feel even smaller.", "Or just get a cheap laptop or tablet to watch TV on", "This definitely reads as passive aggressive by the partner", "Well maybe he needs to decide what’s more important to him.\n\nLook, I’m not saying he’s right at all; but if this is becoming a source of contention between you both, then I’m all about the problem solving solutions. \n\nYou could even find a decent used tv on marketplace.", "Yep. Gaming laptop. He can watch whatever he wants or play a game.", "One Love has good information on what a [healthy relationship looks like](https://www.joinonelove.org/signs-healthy-relationship/) and what an [unhealthy relationship looks like](https://www.joinonelove.org/signs-unhealthy-relationship/).", "Nta update us when you dump him.  An kick him out.", "Why dosnt this \"man\" have an office pc setup to use while he waits his turn. You're already taking care of one child, don't let him be another one", "NTA, just wanted to say you're working. You're a new mom and you're taking care of your baby!", "YTA ... You have the TV to yourself for 8h+ a day.\nJust DVR your shows and watch them the next day.", "Nta, he doesn’t respect you at all. I’d kick him out- problem solved. My boyfriend waits until we agree on something to watch and then automatically pauses it if i get up for something. If we can’t agree he watches stuff on his phone. That is how it should be.", "NTA. Boyfriend needs to grow up and show some consideration.", "The conversation clearly didn’t go well, however it felt, because the next day he said “he shouldn't have to ask first” and continued the behaviour. \n\nHe gave zero credit to that conversation you had, well done on following through on consequences, because clearly that’s the only kind of communication he responds to.\n\nNTA, but hopefully that will help him take you seriously enough to actually negotiate a compromise on this instead of just ignoring you.", "NTA, having a full-time job doesn’t mean he can walk all over you and be disrespectful.", "NTA. He’s being rude. His wants aren’t more important than yours and the fact that you’ve been home certainly doesn’t decrease the amount of respect you deserve.", "NTA that is your boyfriend who is fucking too cheap to have his own place and has decided that what you have is yours.  Sorry, I had a bad day.  He treats you like you are an accessory, in your own apartment that you own.  \n\nYour boyfriend has issues where he can't even ask how you and the baby are in the apartment that you own, what does he bring to the table besides sex?  You have allowed him to live with you, with your child in a really tiny apartment so he can tell you what you can and can't do in your place when he gets off work?  I get you had a baby, I get you don't want to rock the boat but what is this man doing all day that he can treat his baby momma like shit when he walks in the door and expects you to accept his behavior?", "This man doesn’t care about you.", "Can one or you watch on a laptop?  You say in one breath that it's not the channel changing and that he deserves to watch TV after a full day of work but in the next you say he can wait 20 minutes for your show to end and these statements seems incongruous.", "NTA.  But you should hand him the baby and go for an hour walk every time he commandeers the TV.", "TLDR; NTA. It sounds like he is extremely immature and actively resents you for being on maternity leave instead of understanding it and respecting you as a new mother of his child. He sounds like an overgrown child. His behavior is repulsive 🤮 I’m so sorry you are going through this.", "NTA.  This is abuse, especially if he's not even watching.  If he can't respect you enough to ask when your show is ending, he's a jerk.  It doesn't matter if he had a bad day.  You didn't cause it.  He can chill for 15-20 minutes and let you finish what you're doing or he can figure out a different set up so both of you can watch what you want at the same time.", "NTA and I feel your pain. My dad is the same way. My mom and I will be eating lunch together and watching TV and my dad will just come into the room and change the TV because he HAS to check the score on some game.\n\nIt's especially infuriating because he has his own TV in what's basically his \"man cave.\" He has kind of stopped doing it recently because he did it when my 3 year old was watching something and in typical 3 year old fashion, she has no filter and told him off. 😂", "NTA, having a bad day doesn’t automatically mean he has the right to be rude to you and completely ignore what you’re asking of him", "NTA and honestly I’d be upset if I was home with the baby and my partner didn’t come in and immediately give me a break. I get so touched out by the end of the day. My husband has from 8pm to however late he wants to stay up, but I need a couple hrs when he gets back.", ">And honestly, it's not an issue of whether or not he should be able to. Of course he should. He busted his ass all day. But it's the disrespect I can't get over.\n\nThis is reasonable. Acknowledgement you exist, interest in your wellbeing, and a \"S'ok if I flip on my shows/games now?\" is a ***pretty low bar*** to expect here. Letting you finish a show is also not unreasonable.\n\nYall might need either a bigger place or a second TV with a headset, but your husband definitely needs some manners.\n\nNTA", "NTA. I can’t believe this is a conflict between two adults who have a baby together and not two unsupervised 7yos.", "[removed]", "NTA.\n\nI'm not sure procreating with someone who has so little respect for you was what we would call a \"pro gamer move\".\n\nYou tried to communicate and even lay it out there that you're not going to fight him over the TV, you just want to be treated with basic respect. But even that was too much for him. He's telling you who he is. Up to you if you're going to listen.", "Studio?  That ought to be a blast once there are three of you.", "NTA\n\nI'm sorry you have two babies.", "Clearly a huge lack of respect for sure... he needs to work on that as well as this constant stress and bad days from work!\n\nNTA by a long shot, hope things get better asap", "> He is pissed at me saying that he shouldn't have to ask first \n\nHe said that? Seriously?\n\nYeah, you have to ask, buddy!\n\nNTA.", "NTA who see’s the mother of their child feeding their child and has 0 respect, he is a massive AH", "NTA especially since is 2023 when you can watch YouTube on literally any device you own.", "NTA\n\nMy autistic brother figured out sharing and asking to take turns when he was like 8. I'm sure your husband is capable of it. But no, the problem is he doesn't want to. He thinks that whatever he wants immediately takes priority and that he has the authority over you to make that call.", "Yes but you both are.   Relationships are about communication and understanding.  If you arguing over tv wait till the kid is born", "Nta. \nI don't care that he's worked all day it's not a valid excuse for being a disrespectful ass. \n\nHe sees you are using the TV. That should be enough for him to either ask  politely or stfu and wait.  Instead he disrespects you  shoves you aside and treats you as unimportant as if you are just in the way and you let him because of his weak excuse of having worked all day.    Aye well mate so has the vast majority of people and they don't go home and act like Inconsiderate thugs.  So do better.   \n\nAs for you. Remove the remote batteries and make a damn point of he's gonna pull it out your hand. It's your apartment   you were using the TV and he will have to respect that. If he doesn't like it he can get his own TV for games", "NTA - also I would start to hand him the baby as soon as he gets him and let him know you need a break as he’s been child free all day he doesn’t understand that you need a break", "Leave now.", "NTA. Send him back to the 1950s where he belongs.", "Rude is rude. And he is rude.\n\nFunny how it's all about his day. And about not pissing him off.\n\nHe doesn't give jack shit about respecting you. Did you know this before you had a child with him or are you just figuring this out now?\n\nNTA", "You get the fuckin TV all day because you are home taking care of his baby! Of course you do. If he were at home and you were working, I'm sure he would be happy if you did the same thing to him, right? What a jerk he is, NTA", "NTA. That is unacceptable behavior \nAnd that edit! Absolutely not!!!\n\nHe should get a second TV and watch with headphones on,  or watch on his phone. And leaving the game in touched? WTF kind of power play is that? What he is doing is incredibly disrespectful, condescending and aggressive.", "Reminds me of my ex-husband with his fucking entitled attitude, except my EH never said \"I'm sorry\" in his life.", "NTA. You warned him what would happen. You tried communicating. He could ask instead of snatching like a toddler. That is incredibly disrespectful and not something you should tolerate at all. If he keeps that up,  he'll be setting a bad example for your kid.", "NTA but if you stay with him you will be.", "NTA. You do realise this man does not respect you right? Like at all. Notice how his bad day at work become your fault? Honey there's not a red flag BIG ENOUGH to fly here. \n\nIn the immortal words of Maya Angelou: \"When someone shows you who they are, believe them the first time.\" \n\nPlease go and talk to a trusted friend or family member and share what's been going on. I have a sneaking suspicion this isn't the first time he's treated you like crap.", "All of that - but kick him out, it's her apartment. \n\nThen, after thinking about it for a few days, watching TV uninterrupted, she can kick him out for good.", "Because OP has been home eating bonbons all day, not caring for a newborn. He's an AH and obnoxiously so.", "Internet she pays for in an apartment she owns. She should dump all his stuff on the front lawn and set it on fire.", "Big \"why did you make me hurt you\" vibes.", "This is the type of dude you'd leave a baby with?", "What is OP doing that is immature?", "he can watch his phone or get an ipad or kindle.", "How is OP wanting NOT to be disrespected in a home she provides with internet she provides an AH move?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "> woman should be home barefoot, pregnant and cooking.\n\nAnd if not pregnant, in a sexy lingerie, cooking of cleaning, so she can get pregnant again. ^((/s))", "Home in the home she provides to be disrespected in, naturally. NTA", "\"If you meet one asshole in a day, you met an asshole. If you meet assholes all day, you're the asshole\" feels pretty applicable here.", "Yep.", "> It's been a huge change. Prior to the baby we were great\n\nThis happens a lot around here: now that you are stuck with him for life because of the baby, he doesn't need to take account of your feelings anymore. It seems that, with guys like your boyfriend, once a major relationship milestone is passed, and it is more difficult to leave them, they behave worse and worse. \n\nI don't know if his behavior changed when he moved in, but since engagement and marriage milestones were passed by when you went straight to baby, he might not have been as comfortable letting you see his true self. Frankly though, him cluttering your walls with guitars makes me think that you have been the frog in the pot and he's been slowly turning up the heat.", "Do you know what my husband did when I was on maternity leave? He would come home from work and take the baby so I could rest. Having a newborn is exhausting. He may work a demanding job but yours is demanding in a different way and he should respect that.", "Housing is rough and it's not always as simple as moving - but being in a studio with a newborn can be really hard - no one has any space to decompress or distance. If this is out of character for your partner, maybe push for couples counseling or have a conversation about the feasibility of moving. When we lived in a small apartment my husband would use the gym for 20 minutes or go for a short drive if he had a particularly bad day to avoid bringing that mood into a small space. It's fair that he needs to decompress - it's not fair that he's not treating you like a person.", "Are you thinking you're going to need to upgrade your space now that you have a little one? I know it's probably not too claustrophobic right now, but in a year when that child is walking you're going to be wanting more space and also wanting a room you and your partner can get a healthy amount of quiet/intimate time.", "He plays PC and Xbox, so a phone wouldn't resolve it. I vote for a TV on the wall. He can quit being a dick too though", "And still you went and got yourself a hobosexual.\n\nI don't mean to offend you, but you seem so smart and strong, don't allow him to continue disrespecting you.", "I'm just going to tuck this expression away and save it for later.", "My thinking exactly.", "Where do you put your things?"]}