{"id": 30984, "submission_id": "17v6e6h", "title": "AITA for taking off in my fiancés truck unannounced, knowing he doesn't want me driving it?", "selftext": "He doesn't want me driving it because the power steering is going. But anyways, we are down to just his vehicle because my head gasket went 3 weeks ago. I'm on maternity leave, as I just had our baby 5 weeks ago. Maybe this is why my tolerance is 100% gone. \n\nSince my head gasket blew, he's been having to pick up groceries for dinner after work. But he literally works right directly beside the grocery store so it's not out of his way and would literally take at most 10 minutes to grab groceries (we live 15 minutes from both his work and the grocery store). But as of maybe a week and a half ago he stopped going to the grocery store after work and just came home and would leave a couple hours later to go back to the grocery store, complaining the whole time about not wanting to drive (\"I'm so tired of doing everything and not having time to myself to relax\"). By the time I have finally convinced him to leave to go pick up stuff for dinner, it's almost 7pm every single time. Never fails. And it could all be avoided if he would just take the time to walk the 5 feet to the grocery store before coming home every day. \n\nWell, last night he gets home at 4:30. I specifically asked him earlier in the day to grab groceries before coming home but he didn't because he \"just wanted to come home\". He played with the baby for maybe an hour before I finally asked him to go get dinner because I was actually hungry for once (I've barely been able to eat since having the baby because food is gross to me right now). He said he would \"in a bit\" and sat down on the couch with a beer. 45 minutes later he got himself a bowl of cereal and sat back on the couch. So I grabbed the baby and his keys and just left to go grocery shopping myself and I took longer because I did a BIG shop so I don't have to depend on him any more. Maybe 30 minutes later he calls and asks where I am and why I took his truck knowing he doesn't feel it's safe for me to drive and I said \"I was done waiting for you. I was hungry, you didn't care so I did it myself. If you didn't want this happening than you should have gone to the store before coming home.\" He says I'm an AH for taking off with the baby without saying anything to him and that I should have just waited until he was ready to leave.\n\nETA: just to clarify, he said the power steering was going and that's why he didn't want me driving it, but the power steering was 100% fine. It drove normal with zero issues. I've driven his vehicle plenty in the past but ever since I had the baby, he doesn't want me doing anything or going anywhere. This is the first time I've gotten out of the house other than our babies doctors appointments in 5 weeks. The power steering was an excuse at best. The truck is in my name so it is not considered theft but it is his vehicle so do with that info as you will.", "created_utc": 1699980437, "permalink": "/r/AmItheAsshole/comments/17v6e6h/aita_for_taking_off_in_my_fiancés_truck/", "score": 504, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like an AH because I knew he didn't want me driving his truck and I took it anyways because I'm tired of depending on him and I was starving.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "THE TRUCK IS IN YOUR NAME. You can leave the house any time you want. You should not allow yoursel to be isolated. Work hard to get out and do things a couple of times a week. Cultivate friendships, visit relatives, make new friends in a parent group. Having a person trying to isolate you is a definate red flag. It is a means of control.\n\nYour 'Partner' is also not concerned about your health and welfare, if he refuses to bring home food and makes you wait. This is another means to control you.\n\nYou need to create a plan B. An escape plan. Find a way to save cash in a safe place, know where your documents are. Have a place to go.\n\nNTA\n\nEDIT after reading your comments about how he moved you away from your support group because he was depressed? GET IN THE TRUCK AND GO HOME", "NTA\n\n>The truck is in my name so it is not considered theft but it is his vehicle so do with that info as you will.\n\nNo, it is NOT his vehicle. And since you do not have another vehicle at this time, I would suggest you take control of your property. \n\nUntil such time as your primary vehicle is working/replaced, you will be dropping him off and picking him up from work. This will have the added advantage of allowing you to go to the grocery store before he's done work.", "NTA. You do need a better solution but right now you're reliant on him and he seems to be holding that over you. The edit is especially odd - is he being deceptive in suggesting his truck isn't safe for you to drive? Ultimately I realize it's generally not 'cool' to take someone's vehicle without their knowledge or permission but in this case I don't see how it was avoidable.\n\nI suggest you look at alternative arrangements that don't make you - and now your child - dependent on him...this is giving me the heeby jeebies for you. Maybe look at getting a rental car or staying with family who will let you borrow their car. Something here needs to change.\n\nEDIT - I see elsewhere that the truck is actually yours, that's an interesting detail. He doesn't get to decide for you that you can or cannot take it, in my eyes.", "NTA\n\nI'm sorry but it sounds like he's keeping you a prisoner in your own home! Not out for five weeks? That's ridiculous! I'd tell him to watch the baby when he gets home and go without him. He needs to get over whatever insecurities he has about you living your life with a baby.", "He has isolated you from all your family and friends and doesn’t want you to go out? Get someone to collect you when he is at work (try discussing it with him first if you think he may listen)  and go back to your family. This situation worries me a lot.", "Think it's time to move back to your family. He moved you across the country, isolated you from everyone and everything, and now controls your every move. This is not OK. Do not marry this guy. Get ahold of your family and see if anyone is willing to help you get back home safely. These situations tend to escalate into violence. Even if they don't, that's no way to live.", "NTA\n\nVehicle is in your name.\n\nHe just didn't want you using it because he is trying to play control games.", "NTA. You're clearly a capable adult. I'd be asking myself why is it so hard for him to do the bare minimum? And why is he so resistant to you leaving the house? Neither look good from here, but you know more than me about his norm.\n\nAs for driving a vehicle that's lost power steering — it sucks, but it's not impossible. I wouldn't even call it particularly dangerous, provided you drive according to the situation. My old truck used to drop all of it's power steering fluid for funsies.", "So, to summarize, he refuses to shop and he refuses to let you out of the house on your own.\n\nWTF...\n\nNo.  NTA.", "Don’t marry him until these control issues are fully resolved through pre-marital counseling, and plan to wait at least a couple of years to ensure any changes he makes are real. He talked you into moving to a remote area away from your support system.  He’s capable of fixing your vehicle, but he hasn’t. He doesn’t want you using the vehicle he uses even though it’s in your name. He lets you go hungry even though you’re breastfeeding, and he plays passive-aggressive games about shopping for necessities.\n\nIf one of your friends listed all these red flags, you’d tell them to get out.  It may be time to go back to work to start putting money away for a move back home, with or without him.\n\nNTA", "NTA This is bizarre that you have a man who isn't letting you out of the house when you want to go out of the house.", "OP, your husband's behavior is similar to the stereotypical spouse abuser.\n\n1. Separate spouse from family, friends, supportive group etc etc.\n\n2. Keep them separate from those mentioned above, so as to strengthen control over them.\n \nAnd the list keeps getting worse. Use caution. Maybe I'm wrong here and there really is something wrong with the truck IDK. But be careful, as I said his behavior is similar to the stereotypical spouse abuser. Look it up online if you don't believe me. Protect yourself and your child OP.\nNTA BTW.", "Girl. He's a *mechanic*. He doesn't want you going anywhere, and I'd bet he sabotaged your car to keep you home.\n\nThe truck is in *your* name, it's *your* truck.\n\nHe moved you away from friends and family across the country because he was \"depressed\"? No. It's because he wanted to isolate and control you. Take your baby and move home before this gets worse, because it will *only* get worse.", "Leave", "NTA. You asked him to go get dinner and he got himself cereal? And lied about the power steering? You have 2 children on your hands", "NTA based on your edit. The truck belongs to you and was not broken. Go do with it as you wish.", "NTA.\n\nHe's big into power moves.  Don't put up with it. If your name is on the title, it's YOUR F'ING TRUCK.  \n\nI'll give him this--he's thought it through.  If the power steering goes out, the truck can still be driven but it takes more STRENGTH.  And he's such a big strong MAN.", "This sounds like a power play especially as there's nothing wrong with the car. I would leave the baby with him next time or better still leave him altogether.  To get food for just himself what an arse.  Why did you have a baby with this selfish person", "So he’s controlling your movements. You have a newborn and not enough food to eat. You are so clearly NTA but wow are you in an abusive relationship. Please don’t be one of those women who says but he hasn’t hit me. This is abuse and you have a child to think about. Please think long and hard about this relationship. \n\nIf you were my daughter I would already be packing the truck.", "NTA but why on earth are you guys not buying enough groceries for at least a week at a time? That way you can eat whenever you’re hungry and you won’t have to wait.", "NTA\n\nI get being tired after work, especially with a new baby in the house. \n\nHe however is not recognizing any of your needs and even considering changing his behaviours (actually doing a weekly shop with you so that there is food in the house like he agreed to or giving you any breaks to get some rest as well)", "NTA the truck is in your name so the truck is yours 🤷🏽‍♂️ you don't need his permission. this is the family's car and if he isn't stepping up for the family then you are forced to take matters into your own hands.", "NTA.\n\nJust read that the truck is in your name. That makes it *your* truck, not his, so you can drive it any time you want. *He* needs *your* permission to drive your truck.\n\nDude is a controlling loser.", "NTA and this post is one giant red flag. You are trapped at home dependent on a man that's unreliable. You need to take steps asap to get your independance back, make a savings acount for just you and start pooring whatever money you can into it just in case. \n\nIt's appaling that he leaves you without food for hours just because he can't take 15 minutes out of his day, in which he already sounds like he does less than the bare minimum in childcare. I'm dreading to think about how your household chores are divided.\n\nAnyway, you did nothing wrong, you did something incredibly right, you took care of yourself and your baby. If your husband is seriously giving you a hard time for finally taking care of yourself tell him to pound sand.", ">The power steering was an excuse at best.\n\nNext time, take it to the shop while you're out. See what they have to say.\n\n>The truck is in my name so it is not considered theft but it is his vehicle so do with that info as you will.\n\nIt's your vehicle then. It's your name on it.\n\n>I specifically asked him earlier in the day to grab groceries before coming home but he didn't because he \"just wanted to come home\".\n\nIt's not an excuse. He should've gone on the way home.", "NTA\n\nIt’s a truck in your name and it’s to get groceries for your family. He’s not doing it, but it needs to get done. Could/should you have told him? Yes/maybe. You’re frustrated and he’s being unhelpful.", "Why aren't you guys using online pickup? You order when he is at work and schedule it for when he's getting off. He doesn't need to get out of the car at most places. Text him the confirmation info with the time. He will feel obligated to pick the food up that's already paid for and has a pick up time.", "Nta, in fact I think you should take it to the mechanic to have the power steering looked at. Once he says it's okay your husband has to admit what this is about. Side note: post partum depression also can affect men and they are rarely evaluated for it. Do you think he's having symptoms or extreme thoughts?", "NTA for this but you are one to yourself.  He is trying to control you and manipulate with lack of transportation - isolating.  VERY BAD SIGNS - if he is already showing such disrescpect and controlling manipulation you need to get rid of him - NOW.", "NTA Do what you have to do to keep yourself fed and sane.\n\nThat being said, he is waving red flags all up in your face.  He has you completely isolated at one of the most vulnerable times in your life and you are concerned you maybe an asshole for taking his car to get food?  You are missing the bigger picture here.", "Oh boy, OP. NTA, but You need to get away from him for now, and go back home where you have friends and family to support you. Do not say anything to him, as his behavior is genuinely troubling, and I’m very suspicious about what he is up to or how he might react if you tell him you intend to go back to Maine for a while.\n\nIf he is the one who told you your car’s head gasket blew, he may have lied about it. He was definitely lying about the steering on the truck. He clearly wants to isolate you, and is showing a pattern of increasing abuse by withholding food from you and your baby, literally ensuring the only things to eat in the house are not sufficient for you to stay well-nourished as a nursing mother, while he sits and eats in front of you.\n\nPack up necessities for yourself and your baby and put them somewhere out of the house where he won’t see them. Even if that means putting them in a garbage bag and setting it somewhere he would assume it’s trash if he sees it. When he gets home from work, while he’s in the bathroom or whatever, quickly grab your baby and your things, get in *your* truck, and go. Call your family and explain your situation, so they know to expect you or can offer you some help.\n\nOnce you are a fair distance away, or have gotten to the nearest city big enough to make you hard to find, you can call him if you feel you should. Tell him he’s free to get your car running again so he has transportation, but this time it’s *you* who needs a change, and you’ll be in touch with him again as soon as possible. How he reacts to that will tell you how carefully you’ll need to proceed from that point.", "As someone from Arizona, any change he needed he could’ve gotten from literally any other state. He’s a mechanic and you guys moved to the boonies of AZ? Why? Cost of living in the boonies and in literally any other state would be the same or less. There won’t be more work as a mechanic in the outskirts of major cities. He’s acting shady as heck honestly. You should start driving him to and from work so you can have use of the truck and not be stuck honestly. Also he’s a mechanic and won’t fix your car? And the truck is yours? I know a blown gasket is essentially a car death sentence but priority should be finding you some sort of way to get around. And that would be dropping him off at work (why would he need the car?) and picking him up. Y’all should really get out of there tbh. Go back to Maine or literally any other state closer to home because there was no reason to take you across the country for some “change”. You can get change in Florida, New York, Kentucky, Louisiana, Colorado, fuck even Texas. But he took you as far as possible from your support system without breaking the bank as possible (CA super expensive so that’s why I assume he chose AZ). This smells like the beginning of an awful time for you and it’s fucked he hasn’t taken your mental health into consideration.", "It sounds like you could use a break from the baby, so maybe the better option if for him to come home after work and you can go out by yourself while he plays with the baby for an hour .", "Even if the power steering completely went out, its barely harder to turn than old no power steering cars.\n\nI think he is doing a sexism,  but maybe he is legitimately concerned due to the recent pregnancy. \n\n&#x200B;\n\nNAH giving him the benefit of the doubt.", "NTA. If your power steering goes. You have to turn the wheel more. There are generally no safety issues tied to losing power steering. I drove a car which had a short in the power steering. Took 2-3 months to figure it out. Power steering would die while driving. Made me feel old timey spinning the wheel so much.\n\nEdit. Apparently newer vehicles it isn't good to run without power steering. The steering would feel heavier long before you have an issue generally", "NTA. It’s in your name so he has no right to tell you that you can’t drive it. I don’t care who is paying for it. Your name on the title gives you the right!", "NTA but like, serious question, why do you and your husband go to the store every day instead of going once a week and getting everything you need? Much more efficient and just genuinely smarter and makes more sense? Also would solve your problem.", "NTA, but fun thing about power steering, it comes and goes, until it goes. then you get to really see how heavy that truck is next to a car. I'm gonna say NTA because he really doesn't seem to give a fuck what you need, but on the other hand, if the truck really is starting to go, you should definitely have him fix that sooner rather than later. he's not gonna be able to drive it soon either.\n\nI've (rarely) forgotten things my partner asked me to do. but when reminded, I don't just not do them. especially if it's a pressing need, like food. most of the time, it's me getting her food, even when she's not asking for it, just in case she wants to eat. I'd definitely address the fact that he seems to not worry much about what you tell him you need. (and get a second opinion on the truck. it's gonna suck if he's right)", "NTA\n\nSounds like you went mama bear and made a potentially bad choice but he isn’t doing what he needs to do (providing for the home).\n\nTry making a list for 2-3 days of food so he only has to stop 2x each week.", "ESH. You for this situation, your fiance in general.\n\n\nYou shouldn't have taken his vehicle. As someone said, as far as you knew the power steering was going, and you put your kid in it.\n\n\nAlso, why can't you just order groceries online? A lot of supermarkets will even deliver for a minimal cost.\n\n\nAnd why was he going daily? Why can't you just do a family shop on Saturdays or something?\n\n\nBut your fiance is awful. It sounds like he just wanted to trap you having a kid. Do you trust him enough to leave the kid home with him? He's an equal parent. Does he do anything with the kid/around the house when he gets home from work? And if he's lying about his car, he is definitely just trying to keep you home and stuck.", "Power steering is going. “Going” being the key word here. \n\nIt’s not gone yet so in an emergency or absolutely necessary situation it could be used but soon it will likely leave you stranded because you would struggle to control the vehicle without power steering and since it’s going it basically impossible for him to tell you that we have 182 more miles till it completely gives out or maybe it’s 915 more miles. Their is no way for him to know the exact limits of the power steering system when it has a leak or how long before that leak turns into no more power steering. \n\nIt’s amazing how you probably expect him to get the vehicle fixed/ maintained but you won’t respect and trust when he says it shouldn’t be driven.", "[deleted]", "Why do you need groceries every day? Most people I know go once a week. Then pick up the odd thing on an as per need basis. If he was home why didn’t you leave the baby at home and take the truck by yourself? If you ever had your power steering go when you drive you’d know how scary it is (super hard to turn the wheel, it feels locked).  I’m sure being home and not going anywhere for weeks must get old fast, maybe get the power steering fixed, that way you can take the truck with or without the baby and get out and do stuff (run errands, visit a friend/family, whatever).", "YTA\n\nYou took your infant in a potentially unsafe vehicle rather than having a snack or bowl of cereal. Or ordering delivery, or getting a taxi/uber, or calling a friend or family to take you on a grocery run.", "YTA. Demanding he attend to everything just because you’re “done” is crap. If you need him to go to the store, he’s allowed to do it on his schedule. Your attitude is very bratty.", "Yta", "Once he took a drink of his beer he was no longer legal to drive anywhere.", "People are assuming he is lying about the power steering because it worked on this drive.  That is not always the case with a pump failing.  \n\nOverall, I am going to say NAH.  Without knowing more, it just isn't that simple.", "YTA. You stole his vehicle and drove off with his kid.", "ESH. He is because he is behaving selfishly and inconsiderately, in my opinion. What I see as his immaturity is impacting his quality as a partner and a father. You are because you drove your baby in an unsafe vehicle, not to mention that you essentially stole his truck because you took it without permission.", "Yta\n\nMainly because he said there's a mechanical/ safety issue with the vehicle and you took your child in it. If you left the child with him and just went yourself, then different judgement. \n\nInfo- is your car getting fixed, or are you two just waiting till his truck breaks down too?", "[deleted]", "ESH. Especially your fiancé. He sounds immature and arbitrarily controlling, and that's concerning give the overall situation and the fact that you just had a baby. And I think it's really important for you to get out of the house on occasion and not feel so trapped and isolated. \n\nAbout the grocery shopping in particular, I think you need to change up your shopping routine. There is no reason to shop every day. Just do meal planning and shop once a week. Then he doesn't have to shop after work, you'll know what you're having for dinner each day in advance, and the whole thing gets much easier.", "ESH. He's lied about the car apparently, and overall has been unreliable to you right after you gave birth to his child. He's clearly the AH. But you... the only way you found out whether you could use his car was to put your baby in it ? I like gambling as much as the next gal, but not with a 5 weeks old's life.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHe doesn't want me driving it because the power steering is going. But anyways, we are down to just his vehicle because my head gasket went 3 weeks ago. I'm on maternity leave, as I just had our baby 5 weeks ago. Maybe this is why my tolerance is 100% gone. \n\nSince my head gasket blew, he's been having to pick up groceries for dinner after work. But he literally works right directly beside the grocery store so it's not out of his way and would literally take at most 10 minutes to grab groceries (we live 15 minutes from both his work and the grocery store). But as of maybe a week and a half ago he stopped going to the grocery store after work and just came home and would leave a couple hours later to go back to the grocery store, complaining the whole time about not wanting to drive (\"I'm so tired of doing everything and not having time to myself to relax\"). By the time I have finally convinced him to leave to go pick up stuff for dinner, it's almost 7pm every single time. Never fails. And it could all be avoided if he would just take the time to walk the 5 feet to the grocery store before coming home every day. \n\nWell, last night he gets home at 4:30. I specifically asked him earlier in the day to grab groceries before coming home but he didn't because he \"just wanted to come home\". He played with the baby for maybe an hour before I finally asked him to go get dinner because I was actually hungry for once (I've barely been able to eat since having the baby because food is gross to me right now). He said he would \"in a bit\" and sat down on the couch with a beer. 45 minutes later he got himself a bowl of cereal and sat back on the couch. So I grabbed the baby and his keys and just left to go grocery shopping myself and I took longer because I did a BIG shop so I don't have to depend on him any more. Maybe 30 minutes later he calls and asks where I am and why I took his truck knowing he doesn't feel it's safe for me to drive and I said \"I was done waiting for you. I was hungry, you didn't care so I did it myself. If you didn't want this happening than you should have gone to the store before coming home.\" He says I'm an AH for taking off with the baby without saying anything to him and that I should have just waited until he was ready to leave.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta If the car us in your name it's yours tell him that an show him this post.", "NTA\n\nEither he could have done the big shopping so he wouldn't have to go often or make the 10 minute shopping after work. \n\n>power steering is going\n\n\nHonestly sounds as an excuse.", "Nta. The truck is in YOUR name. It sounds like he’s on a power trip to keep you in the house and dependent on him.", "Nta so he'd rather *waste gas* than go right after work?  His choices are 1- get groceries  or 2- you get groceries.  He refused option 1, so option 2 it is.\n\nEdit- omg, it's YOUR truck. I'd start driving him to work in the morning and picking him up.", "NTA.  I was prepared to say you were TA right off the bat,  but after reading and especially knowing the truck is actually yours,  NTA. If he didn't want you going,  he should have done the shopping before he got home.", "NTA.  He has usurped a dangerous amount of your freedom.  I dunno if he meant to, most likely he just didn't think about it, but intent matters less than results.\n\nyou need to get out.  For the child's sake if not for yours.  This relationship has gone toxic.  So far it's not completely dead yet, but the best way to save it is for to you raise your banner and fight him on equal ground.  I don't think you're gonna do that if you stay isolated from your places of power.\n\nEither way, the best path for you begins with you getting into that truck with the baby, going back home, and talking with a lawyer about custody just in case.  Even if it doesn't come to that you should be ready so no matter what, talk to the lawyer.\n\nHopefully he can get his head on straight and check himself and be a less selfish husband.  Hopefully he comes quickly to ask for terms.  Name them.  They start with you not being trapped entirely at home again, and probably with him being OK with you getting at least a part time job and a bit of financial independence.  Those are the minimums, don't let him talk you down from this.\n\nIf he responds with rage that you took your own power back from him -- well, he'll be waving more red flags than a parade in P'yongyang and there will be no disguising his true nature anymore.\n\nAlso even if negotiations go well make sure you always have a way to raise your banner again if he goes all paternal again.  As a man myself, men are stubborn creatures and rarely abandon an idea after the first try.  you're going to have to enforce the \"equal\" in the marriage of equals given his tendencies.", "I too am concerned that your fiancé is playing some sort of a power game. But it's impossible for we strangers to judge.\n\nWhile I understand his wish to just get home, at  best he is being really unkind and selfish. I hate to think of you being so dependent on him when he is so uncooperative. \n\nHe is a father now and his first responsibility is to love and care for you, for yourself, but also because you are the main carer for your and his baby.\n\nI really hope you can resolve this.\n\nNTA\n\nEDIT - having read your comments, please run.\n\nYou are being deprived of food -a breastfeeding mother!  How could he be so cruel! 😢😩\n\nYou need to get away because this is classic isolation (moving away because he needs a change!) and control. Plus DEPRIVATION.\nYou cannot make him better.\nBlessings on you and your baby.", "Sounds like he is an ass.   \n\n\n And it's not his truck if your name is on it.... It's your OP.   \n\n>\"I was done waiting for you. I was hungry, you didn't care so I did it myself. If you didn't want this happening than you should have gone to the store before coming home.\" He says I'm an AH for taking off\n\n\n\n He didn't care... And it seems it doesn't...  Do you really want to tie yourself down to him in marriage at this point. Because him acting like this would make me reconsider....\nI think I would be moving out or moving him out and just taking him for child support at this point\n\nNta", "You’ll find you’re actually raising two babies now. NTA, seriously consider couples counselling if you want this relationship to continue. What an absolutely useless excuse for a husband, honestly.", "Why can’t you both do a big shop for the week on the weekend? Shopping everyday for dinner is insane.", "So you're 5 weeks post partum and he's rolling in from work with no groceries, playing with the baby for 1 hour and grabbing himself food when you said you're hungry and then parking his arse on the couch with a beer? Is he kidding?\n\nHe needs MAJOR reality check - his behaviour is vile at worst and juvenile at best. He should be doing everything he can go take care of you. You've just gone through a major trauma. \n\nAlso, why is he trying to keep you in the house? That isn't healthy. You need to make sure you're going out with the baby regularly, if you feel up to it.\n\nFinally, if the truck is in your name, it's *your* truck.\n\nEdit to add: NTA", "NTA.  He needs to get over it.   Start leaving him with the baby while you drive your vehicle where you want to go . You can go grocery shopping and spend an hour or 2 on your own.", "NTA, if he doesn't you want driving YOUR truck, he should go buy his own.", "NTA. \nAll he had to do was pick them up,  he didn't so you did.", "INFO: In what world is a 5 week old eating baby food?", "NTA.  \n\nIs there a reason he wants you dependent on him?  And out of \"his\" truck?", "NTA - he was disrespectful of you. I would do a click list once a week where he just pulls up and they put the groceries in the truck. It’s annoying to go multiple time a week.\n\nThis is also the time to have your car towed and have the car fixed. Material leave goes by fast.", "ESH!\n\nFirst of all there are so many solutions to your grocery shopping needs other than relying on him. Secondly the truck is in your name, I say just take him to work and enjoy your day having a vehicle at your disposal.", "NTA, 100%, you were in the right.\nBeing shut in like that after having a baby is also terrible for your mental health! \nCongratulations on your precious baybee 💜💜💜", "Girl. Take the truck back and leave this rotten man. You will take better care of yourself and baby than he takes of either of you.", "NTA! My ex did this to me, and in the end he got physical with me, and that’s when I told my dad to get me the hell out of there with my son. I’m sorry sweetheart but he’s only going to get worse, this is just the beginning. The truck is in your name, pack up a bunch of things and go back to your parents for a while. That will force him to walk to work. I promise you if you stay and it get worse then you will look like the asshole to yourself.", "Read your story, not reading all of the comments........first and foremost question/issue, WTF are you doing day to day groceries when according to your post, you did a big shop and it wasn't an issue? I could see having him grab a missing item or two once a week. Ex, some milk or bread, not shopping every day or every other day. \n\nTwo, if you have a baby and are down to one vehicle, why aren't you guys looking for another vehicle in case of emergencies or off hour needs?\n\nThree, while his behavior is definitely questionable, it's also reasonable to plan a weekly grocery trip instead of stopping every day. I honestly don't blame him for getting tired of it. Especially when there's more important things to come home and take care of (you and the baby).\n\nTruthfully, as of right now (subject to change) ESH.", "NTA\n\nso basically he's trying to control you\n\nand doesn't give a sh\\*t about your health if you with a newborn is not getting food.\n\nThat said, do you have delivery services around You.  Walmart's service is great(and cheap 98 per yr) with Minimum of $35 order, it's \"Free\", tho I always add tip.", "NTA. He is enjoying having you be dependent on him, but doesn't want to actually be dependable. He got to the point where he was isolating you and letting you go hungry. F. That. \n\nThat truck is in your name and you can take it whenever you want to. Also, go out at least once a week. You'll spin out if all you never get any time with other people, especially when he's being so cold and neglectful.", "NTA\nHowever, I would have left baby home.  To reduce risk to baby in a truck (front seat only) which might be defective, to give you a better break, and to give him a chance to care for baby. \n\nTry to get your car fixed asap. Being home with a baby is safest if you have a working car. Plus helps you regain independence. Until the, maybe you can Uber places", "OP - he moved you away from your family and he's doing his best to control you now.  His \"depression\" isn't a good enough reason for moving you away from your support system - especially when HE's refusing to be your support system now that he's gotten you away.  There are a million red flags here - please pay attention to them. I'd personally have someone check to see if the head gasket on your car is really blown and I would take MY TRUCK to the same mechanic and ask about the power steering too.  I think he's lying about one or both of these things.  But most importantly, I would move back closer to my family where there is actually support and not someone who is literally keeping you from eating and having groceries - with a new baby too.  He's isolating you from your family and it's very much a thing abusers do.  He could get more groceries - but then you wouldn't be quite as dependent on him.  Please please go see your family.", "NTA get in your truck and put the baby in the car seat and drive home to your family.", "I hope you have a support system near by \n\nNTA", "NTA", "NTA.\n\nSeeing the edit, the truck is yours, so no issues.", "NTA for making sure there is food in your house.  He is the AH for not getting groceries when it is convenient AND for not realizing you and the baby were gone for over 30 mines", "Why not shop once a week? Why go to the grocery store every day?", "Shop for the week, not for the night. I shop\non Saturday mornings. Meal prep on Sunday. You could do it together. This is a dumb reason to fight. Plan better.", "Yta\n\nNot for doing what you did but for not telling him y'all were outta the house.", "NTA\n\nI’m not sure if it’s about power, control, laziness or a combination of the three but he’s ridiculous.", "Not his truck. Your truck that you let him use.  Start taking him to the work in the morning and keeping the truck so you can go places and do things during the day.  \n\nRun it be a mechanic and get that power steering checked.  \n\nHe is being oddly controlling leading to borderline abusive.  Red flags. \n\nNTA.  Your truck. Take it back.", "NTA. your husband needs to stop being lazy and be a responsible person.", "NTA. You have a controlling husband and are in a tough situation. Loads of \"red flags.\"", "It's your truck so no. If it was his truck yes. If there was no reasonable belief that the truck was unsafe no, if there was a reasonable belief that truck could be unsafe yes since you took the baby.", "My ex-husband sold my suburban to buy a creamsicle harley fatboy when my kids were 6 months and 2 and a half. He had his work truck.  I was stranded for days at a time.  He hated my family and made me leave them behind. \nThe day I ended up leaving was when I had pneumonia and he took all the handsets for the phones when he went to see his family and took the kids. He just figured I’d die. He forgot that old princess phone I kept for old times sake.\nAlways have an escape plan.", "Would you approve of a man treating your daughter like this? Isolating her? Letting her go hungry?\n\nLeave this dude. Go back to Maine. Take the truck.", "NTA. And the truck is in your name? Take it any time you feel like it! You don't need his permission.", "NTA\n\nHe weaponized his false competence, so you just helped him out. See Paris Paloma’s song, Labor.", "Bigger question why don't you both do grocery shopping once a week?  Or even even other week, which is what my Mom did.  Why daily?", "NTA you didn’t steal shit\nAnd why did it take him a half hour to notice??", "NTA, but the details you share here are ringing alarm bells.\n\nI'm not going to play armchair psychologist (and yes, I know this is Reddit) but isolating you, leaving you without a vehicle all day, being unwilling to do the minimum of buying food for his family (and shopping every day? How much extra money is that costing you?). It sounds really sketchy, OP. I know you're exhausted and just getting by as best as you can, like most new moms, but please give his behavior some serious thought.\n\nCongrats on the squish!", "NTA get your independence lady", "This!", "So I'm here with my dark and twisty brain to ask if there is any chance he didn't sabotage her car?  He really seems to want to keep her at home and it seems like a big coincidence that her car would go out right now.", "I agree.  It's time to assert some independence for your own sake and see how he handles it.  \n\nHe's dealing with some very powerful parternal instincts for the first time and I think he may not realize just how much je's letting them dictate his responses and just how much of your agency he's usurped.  \n\nYou need to respond by taking away the power he's usurped, and that means staying with your family for a few days to break his hold.  If he's wise, he'll come to the table with a compromise.  If he isn't?  At least you know.", "I actually wasn't allow to drive for like 8 weeks because of my C-section, I don't know about vaginal.", "Am I the only one who noticed he didn't realize she and baby were  gone for 45 minutes?  Wtf?", "100%", "Are you sure your gasket is blown? Have a mechanic or Triple A or your dad come look - not one of his friends who \"knows about cars\" Sounds like he IS gaslighting & isolating you...nit good for your physical or mental health or baby.\nGo.And get a 2d set of keys for both vehicles in case he \"misplaces\" them.", "agreed NTA", "You do need a certain upper body strength to handle a vehicle with no power steering.  Iff she's got some meat on her bones that shouldn't be a big issue but if she's light of build that might be harder on her.  I definitely know some women that couldn't handle it -- or at least couldn't handle it easily or for an extended period of time.", "I almost kinda sorta get it, but then I really don't. to me, if I'm worried about my wife that had recently given birth, and ACTUALLY worried about her, I'm either 1. making damn sure I got everyone she wanted and needed so she doesn't have to put 2. going with her where she needs to go. and that's why I agree with you. you can't just lock her away. she'll go crazy. it's not fair or okay, and it's not \"protective\". it's different. I don't like it", "I think a trip to visit her family for a couple weeks is appropos, just to remind her partner that she CAN do it and is in fact still her own human.  I think OP will learn a lot about the kind of man her fiancee is by how he responds to that.", "I agree.  Reddit jumps to that conclusion a bit too quickly, but I think in this case it's appropriate to remind him that you're a human with agency.  He appears to have forgotten.", "It's because hubby is buying the groceries. It would appear that getting him to shop is like pulling teeth. So once he gets there, he is only willing to buy the BARE MINIMUM of what he can get away with.\n\nEdit: A quote from a comment by OP\n\n>He won't buy groceries that last more than a day. When I've asked him to, I'm met with a \"we will just do that when I'm off work and you can come with me\" but it never happens.", "I feel like some people in the thread are overstating the power steering thing. I am not a large or powerfully built woman. In my early teens I would have been under 45kg and my grandpa taught me to drive in a fucked out range rover with no power steering and I managed ok. I wouldn't be pulling any tight u turns but it was fine. \n\nPeople are talking like you'd need to be able to wrestle a horse into submission to drive without it.", "It wouldn't shock me.  Parternal instincts are very powerful and OP's fiance is brand new to them.  He may not be doing a lot of thinking with his brain right now.  But that's all the more reason why OP needs to remind him that she's her own self and deserves to be treated as an equal, not a mate to be kept safe in the cave.", "Yeah I could understanding not wanting the baby to ride in an unreliable car, but if he can drive it OP can drive it. Why is it safe enough for him but not her? The sexism is concerning.", "Not necessarily true any more.  I blew the fuse to the power steering in my truck (2014 Ram)  and it took all my strength, and I'm not a small person, to move the steering wheel.", "This! Hubby and I usually go once a week and pick up what we need for meals and snacks we might want. \nEvery day! Oh heck no lol", "I have tried doing that but then he calls me from the store, bitching that he can't find what's on the list or says \"we will just do this when I'm off work so you can go with me\" and then it never happens.", "I live in a secluded area in Arizona. When you pull up Uber or drift, it says there's no one delivering in my area. Grocery delivery isn't a thing for the store that's near us. It's literally just a mini-mart connected to the mechanic shop my fiancé works at and it's the only thing around for miles. All of my family and friends live in Maine. We moved here last year after my fiancé said he needed a change. I don't know anyone here. I breastfeed so he does what he can but that's limited to diaper changes. He usually just holds or talks to her. He usually doesn't do anything around the house, no.", "It’s HER VEHICLE, by the way.", "He won't watch the baby without me there because I breastfeed and he panics if she starts crying but yeah, I see what you mean.", "It seems HE refuses to shop for more than one day at a time. Which is a bit of a bad sign...", "He won't buy groceries that last more than a day. When I've asked him to, I'm met with a \"we will just do that when I'm off work and you can come with me\" but it never happens. I breastfeed so he won't watch the baby without me there. All my family and friends are in Maine. He moved me out to the middle of nowhere in Arizona last year because he was depressed and needed change. I don't know anyone here. There's not even Uber or dryft in this area.", "Just curious, I used to have a car without power steering, there was no problem steering as long as the wheels were rolling, you just had to use a lot of force when the car was standing still. Is it different with modern cars? Otherwise there would be no problem driving it.", "Fun fact: You can safely drive vehicles without power steering. All it does it make turning take more effort.", "I live in a very secluded area of Arizona. My family lives in Maine, there's nobody ubering in my area and my friends also live in Maine, where we moved here from last year. This grocery store is a small mini-mart connected to a mechanic shop, where my husband works and is the only thing around for miles. I'm lactose intolerant and cannot have milk and I have no lactaid left. We have no snacks here. There was nothing here to eat outside of raisen bran cereal, which I refuse to eat even with lactaid, or canned veggies, and he knew that and still expected me to wait and watch him eat while I was hungry. Which he knew prior to even coming home. And as I said, the power steering was fine. The truck drove normal.", "Not an unsafe vehicle.... He brings her home food for one day. He moved her away from her family. He won't take her out of her house. His reason for moving was that he was depressed. THIS IS HER VEHICLE, she can drive it and has the intelligence to know if the steering feels off. But with the multitude of glaring RED FLAGS, do you really think there is something wrong with her vehicle?", "She can't call family of friends to babysit because they're in Maine and allegedly needed to move all the way to Arizona. He successfully isolated her from her support system.", "Why would she call family or friends when her f!%$ing husband is sitting right there. What kind of flaming asshole sits and has a beer after skipping groceries when his hungry post-partum wife is begging for food. FOH.", "reading comprehension isnt your strong suit", "You realize that a car still steers and drives without power steering right? Apparently not.", "Um, why? She’s doing just as much work for the family and is trapped at home and he can’t even make sure she can feed herself?", "Did you miss the part where the vehicle is in her fucking name?", "Technically speaking the truck is in my name so it's not considered theft but yeah, I get what you mean.", "There is nothing unsafe about no power steering in a car - my first two cars didn't have power steering - it just means you have to put more muscle when turning - its NOT unsafe to drive.", "He's a mechanic. That's the thing. He works at the mechanic shop. If there was truly an issue with the truck, he would have fixed it. I think he was just telling me something was wrong with the truck and he doesn't feel safe having me drive it because ever since I had the baby, he hasn't wanted me to go anywhere. He says he doesn't want me or the baby going out and getting sick. So I truly think him saying the truck has issues was a lie because when I drove the truck, the power steering was fine.", "Everytime I've asked him to pick up groceries for the week versus getting groceries every day, he will call from the store and say things like \"we will just do this when I have off work and you can come with me\" but then it never happens. Or he will call me bitching because he can't find something on the list I sent him with and say \"fuck this, I'm not going to sit here searching for that\" and in the end, he just refuses to get anything more than what we need for dinner.", "She has no control over the shopping routine. He won't let her go anywhere by herself, lied about the power steering on her car and refuse to do more than a days worth of shopping. Which is why op bought a lot of groceries when she went, as stated in the post.", "It's her car. That's probably why he lied he can't report it stolen if she uses it to go back to Maine. He also refuses to watch the baby.", "He’s a mechanic. He wouldn’t drive a car without power steering when he could so easily fix it.", "no need to sabotage the car if your control of your partner is strong enough that just telling her it’s messed up will do the trick. \n\nop, it’s your truck, it’s your life, and he is not in charge of either. go home to your family so you can have a stable supportive environment. and food. you also need food. nta.", "Not going to lie, that crossed my mind too. But I love Reddit and horror movies so I think I always assume the worst", "Kinda hard to sabotage a head gasket, you's have to take the engine apart to get to it.", "I highly doubt it.  Head gaskets are not something a person sabotages.", "If it's the head gasket, probably not. You'd literally have to take the engine apart. That's why they are such a pain in the ass and expensive to replace. Depending on age/mileage,  it is probably just worn out.", "lol what a literally INSANE THOUGHT. You watch too much TV", "If that were the case, why is he not just buying more groceries on one visit?", "Most fathers I've known generally want their wives and children to have enough to eat; only the abusive ones deny their families food and try to imprison them in their own homes. The \"paternal instincts\" you're seeing look a hell of a lot more like coercive control and abuse to me.", "I was absolutely driving five weeks after a relatively uncomplicated vaginal birth. There are people back to work at 6 weeks pp in the US.", "Why weren’t you allowed to? Did the doctors tell you not to? I was driving 4 days after I had mine and nobody said anything about it.", "I had a pretty complicated c section and was ok to drive after 4 weeks (they told me their methodology was 1-off pain meds 2-severe pain was no longer an impediment).", "In fairness this is kinda instinctual in men, and wise men recognize this and fight the instinct, but not every man is wise.\n\nFor new fathers the hormones surrounding protecting mate and child sometimes get out of hand and the new dad can become absurdly overprotective unless he's brought up short and made to realize what he's doing.  In most ways we're still what we were a million years ago, unless we consciously choose not to be.\n\nWhich is as much as to say, hubby might not even realize that it's gone this far or that his behavior is as far over the line as it is.  Definitely confront him over this because he needs a behavior modification.  But if you can manage to put things in perspective for him he might surprise you by realizing he went overboard and apologizing.", "Guess you don’t think women could drive before power steering became standard in the 60s.", "I agree 💯 percent.", "First things first - she should take it to the shop to see if there actually is a problem.", "Depending on the car and their builds he very well might be able to drive it and not her without power steering.", "Were you stationary or rolling?\nBecause taking all someone's strength sounds about right when you're stopped", "That's because he's trying to keep you isolated and under his control. This bullshit about the power steering proves it. He not only lied, he did so in a way that made it looked he was worried about your safety. \n\nHe wants you trapped in the house, but he's too lazy to do the things that need to be done to sustain the household. This is not sustainable and it is a terrible environment for both you and the baby. \n\nI really hope you come to realize how messed up this is sooner rather than later.", "This part\n\n>then he calls me from the store, bitching that he can't find what's on the list\n\n... is classic weaponized incompetence. He's not familiar with the store, doesn't know how to shop and is VERY ANGRY at you for \"putting him in that position\" (at least, that's how he sees it). Exactly the type of thing my ex used to do, and unfortunately he successfully trained me to do EVERYTHING in terms of domestic chores.\n\nThe weird part is that, while your spouse is refusing to do the chore of shopping, at the same time he is actively trying to prevent you from doing it. None it makes any sense to an adult with a brain. It's like he has the thought processes of a 14 year old.", "I think you need to go stay with friends or family for a while. You don't need this hassle while handling a newborn.", "Yikes. I’m sorry. I hate saying things like this on a post because I hardly know your life or husband but not only did he lie about the truck to keep you from using it but he moved you away from your entire friends and family and isolated you from everybody. This seems very intentional on his end. \n\nIf you all moved because he had to for a job or something that’d be completely different but it’s very odd he decided he all of a sudden needed a “change” when you’re pregnant and that change just so happened to be taking you away from you entire support system to rely on him alone. And he’s not even reliable. \n\nSo it for real seems like when you say he isn’t letting you do any thing or go anywhere it makes me sad. Then to find out about him lying about the truck, the only reason I can think is because he doesn’t want you to have any access to the outside world if he’s not with you. Oh btw if the truck is in your name it’s yours not his. He may be the primary driver but it’s your truck. Who makes payments on it or pays for insurance? \n\nAlso I HATE HATE HATE to be this type of person on Reddit, I hate when people analyze a post and take it to extremes with their assumptions BUT I HAVE to put this out there just to make you think.\n\nYou say the gasket broke on the car you were driving 3 weeks ago. You also mention your husband is a mechanic. Why has he not fixed your car for you yet? That’s odd and further points to him controlling you. He’s a literal mechanic who works at a shop and he hasn’t fixed your car for you in 3 whole weeks? What’s his excuse for this? \n\nWas there ANY signs that something was wrong with you car before the gasket broke? Or as far as you know it was working great and then happened to break? Did your husband have access to your car at any time before it broke down? \n\nIt’s extremely suspicious and convenient for your husband, who is a mechanic mind you, moved you away from your entire support system while pregnant, is lying about the only vehicle you have access to being unsafe, and you’ve admitted that he seems to not let you do anything or leave the house at all recently, for your car to just happen to break down. Again with him being a mechanic it’s even more sus that he hasn’t fixed it yet. Is it at all possible he purposely sabotaged your vehicle? Knowing that would leave only the truck meaning he has more control over you?\n\nAlso it’s REALLY odd and kind of sad that you were gone with the baby for a whole 30 minutes before realizing you’re not home. It seems he only cares about you if you aren’t some where he knows EXACTLY what you’re doing. When you’re home he doesn’t care to be reliable. When you finally decide to do something for yourself that’s when he acts like he cares about you. \n\nIdk it’s all very odd and I really feel for you because a lot of this implies a controlling husband who will only get worse with time. Again I hate speculating this much on Reddit but this is something that I HAD to say to you and hopefully you can get some support!", "Did you want to move to AZ? A secluded area in a more conservative state?", "He works at a mechanic shop and can't be bothered to fix your car asap? He can't bother to make sure you have something to eat and by extent your breastfed baby? The more I hear about this person the worse it gets...\n\nSeriously OP, go visit your family for a week or two, and think things through when you are surrounded by people who care about your well-being. Just go and see the contrast.", "This sounds terrible. Maybe you and the baby should take an extended visit home to Maine. Some support and social interaction could help you figure out what you want for your life. Since he is a mechanic, ask him to fix your vehicle. If he won't, then pack up while he's at work, load up either when he's home from work or early Saturday morning as I am sure you are the one getting up with baby and just take off in the trck since it's yours. He can figure out how to get himself to work on Monday/the next day.", "Sadly, I think the “change” he needed was to isolate you and remove all support so that he could be as self-centered and he wants and you have no recourse. Please get out now, his emotional abuse will only get worse", "What’s keeping you in this marriage?\n\nHonest answers only.", "Honey. It's your truck. Pack the baby and run!", ">He won't ~~watch the baby without me there because I breastfeed and he panics if she starts crying but yeah, I see what you mean~~ *parent*.  \n    \nFTFY. You (and your daughter) deserve better", "WHAT.\nTHE.\nF*&K.", "[deleted]", "Ahh, Finances. One of the top 3 reasons relationships fail. A harsh reality.", "I'm starting to see red flags that indicate some sort of abuse, but I also spend way tooi much time reading Reddit.  Separating you from a support system aside from him?  That doesn't sound good.  How soon does he expect to have your car working?", "Yup isolated you to control you. Just like I said in my other comment. Getting you away from your family in some way is an important step in that plan. So is lying to you about a vehicle you own. Because if he owned it and you tried to use it to leave he could report it stolen. He's probably going to sabotage it now.", "# RUN!\n\nThis man is abusing you. He isolated you from family and friends, he is emotionally manipulating and controlling you so you are reliant on him. PLEASE RUN FROM HIM! Open an account in your name only, start pooring whatever money you can into it and get yourself out of there.", "Oof. He was struggling with his mental health and moved you both away from all your support network and then had a baby which we all know is a great deal of emotional upheaval for several months at the very least.\n\nI'm concerned for the wellbeing of all of you right now. Is there anyone local that can be of help?", "NTA- come back to Maine.  Stay with your family and relax. Come before a big storm. His behavior is not ok.", "I’m sorry to here that. Him not wanting to do a big grocery shop run probably has to do with his financial situation, I think most guy have a hard time admitting there broke ($), it really hurts the ego (speaking from experience). And having a baby away from friends and family, I’ve been there too, it also can be really hard. Is he from Maine also? Maybe you guys should have a talk about going home…🤷", "Can you ask a family member to come out and visit? Like a parent? So that you can not be so alone and get your truck “fixed” like he said.", "Well, it’s a truck, so unlike a car, a truck (all trucks) are rear wheel drive, so the rolling power in a car is all in the front Wheels allowing forward momentum to carry you making it easier to turn the wheel regardless of having power steering loss. Although you would know from experience that even though you are moving forward in a car it does feel a little different not to have the power steering. On the other hand, with a truck when your power steering goes it takes a lot more forced to turn the wheel even at higher speeds. Furthermore, it is more common to have power steering issues that are intermittent. Meaning that one minute you have power to the wheel and the next minute you don’t, which can cause real confusion in the strength you’re using in your arms to turn the truck thereby causing an accident.", "Yeah, but it's a real big shock if the power steering cuts out when you're at speed. That is not a good or safe situation if a small correction should be enough to avoid an obstacle, accident, or take a curve, and you suddenly have to adjust. And OP said it was on the fritz.", "Even if the power steering were fully out, the truck would've drove fine and you would've been fine. Thirdtryisthecharm doesn't understand that power steering is just a quality of life improvement.", "You are NTA, but you should get back into YOUR truck and go back to Maine. This dude is bad news, and the quicker you break out of this isolation, the better. Please don’t raise your child in this toxic and abusive household.", "She shouldn't have to call them, but he is an AH and not going. That's the point of the post.", "Did you read my other comments? Apparently not.", "If the truck is in your name, then you are 100% NTA.  Your fiance is very much the AH, however.  Your comments about him not really wanting you to leave the house or go anywhere since having the baby are extremely concerning.  You need to have a very serious conversation with him about this & if he doesn't change his behaviors, you should start planning an exit strategy.  Good luck OP!", "Girl, he has isolated you from any other support and stranded you in the middle of nowhere with no food. You are totally dependent on him.\n\n A man who gave a shit about his partner and baby would not have them stuck home with no transportation every day. What if something happened to the baby and you needed to get her to help fast? \n\nStart dropping him off and work so you have a vehicle. Do your own shopping. Call your family and plan a visit. \n\nAnd please- Consider getting some legal advice about going back to Maine with the baby and staying there. Maybe check in with a domestic violence resource close to you. Because this has all the hallmarks of abuse and I am worried for you and your kiddo.", "Technically speaking, you should get your baby and the most important possessions you have and hightail to Maine in your truck.\n\nPlease, hear what a lot of people here is saying: this is a pattern of behavior that is not healthy, he is conditioning you to accept abuse, he is \"bitching\" and complaining to get you to stop you asking him to step up as a father and as partner.\n\nTake your vehicle, go to somewhere safe (family if you can) and start caring of yourself and your baby. I do think your partner is too selfish and immature and it could devolve in a dangerous situation.", "That's a pertinent detail - you should add that to your post. I think the spirit of the response still stands, if it is 'his' vehicle you should get his permission BUT if he's withholding that and preventing you from having what you need, your action of taking it for an errand was 100% reasonable.", "I beg to differ. I have had power steering go out in a vehicle I was driving. She says the power steering is “going”, not gone, so it could unexpectedly completely go out while she is driving. That’s what happened to me in a big, heavy vehicle. I didn’t have the strength to turn it in anything but an angle. Depending on the road, the traffic, and the strength of the driver that can be hazardous. Had I known there was no power steering, I might have been more cautious or planned in case I had to suddenly move to the side - for instance if a car was coming at me from front or side, but I didn’t And someone pulled out from a side street to my right that I couldn’t see because of the position of a truck in the right lane. I hit the steering wheel so hard I broke it, broke 4 of my lower teeth off, some of my teeth on the right went through my lower lip, and the blow blew a gash on my chin that went all the way through. I still have scars. I might not have been able to avoid the crash even if the power steering hadn’t gone out while I was driving, but I might have if I could have made a hard left.", "Friend…..\n\nthis is _all_ wrong.\n\nCan you hear Whoopi talking? “You in danger, girl.” NONE of this sounds reasonable, respectful, or safe.", "Find someone near you to check it out. Without him. I don’t trust his word, since he seems to want you isolated.", "I bet head gasket was fine too", "And the question about fixing *your* car?\n\nAnd, if he's a mechanic, it means he knows if the power steering is about to go more than you would, unless you are also a mechanic.", "What a wanker! NTA", "I don’t know how you fuck a man who throws a temper tantrum over groceries.", "I don't recall anything about him not wanting to shop for more than a day's worth of groceries. What I remember is that he doesn't want to shop after work. Maybe I misread.", "The messed up car is the one OP mentioned at the beginning where the head gasket blew which is why they are reliant on the truck", "You could drain the coolant, run the engine until it overheats, then refill it to cover your tracks. Overheating can wreak all kinds of havoc, so you couldn't rely on damaging the head gasket and only the head gasket, but it's usually the first thing to fail after prolonged overheating. \n\n(I'm not a psycho, I just know a thing or two about fixing cars.)", "Meh, just run it without oil ;) Ask me why I know? sadness. Check your oil levels regularly folks.", "You can overfill the oil, run it for a week and then drain excess oil.   This is another way to blow a head gasket.  There are a few.  Most would leave little to no evidence that it’s intentional.", "Maybe he just told her it was the head gasket. Maybe she doesn’t know enough to challenge him on it. 🤷‍♀️", "Yep for C-section I was told I couldn't by my OB.  I wasn't even out of the hospital til after 4 days with my first. I had to sit with a pillow along my incision to even ride in the car. Seat lap belt also would be along where that is. Minimum I have seen is waiting 2 weeks but it is large abdominal surgery. I was also still on pain meds for a while.", "C section", "The doctor that forbid me, said it was because if I need to stop suddenly it could pull stitches and cause a lot of pain.\n\nWhen I complained about it to a nurse about five weeks later in a follow up, they said it was for insurance reasons and best to get a doctor to clear me otherwise I'd might not be covered by insurance even if I wasn't at fault, because a lot of insurance policies basically consider this an exception that they don't need to cover.\n\n\nThe first two weeks I personally could not have driven, especially that first week as I was in too much pain regularly. But at four weeks it did chaff a bit needing to be driven everywhere and I thought I could manage it.", "Yeah I was able to fly at 3 weeks with my first but driving I was in way too much pain. It was very rough as I also had contracted Cdiff while pregnant. It also maybe different for each practice and patient to patient. My son I went home after 2 days instead.  I know they gave me a detailed list. My youngest was also over 8 years ago", ">For new fathers the hormones surrounding protecting mate and child sometimes get out of hand and the new dad can become absurdly overprotective\n\nSo starving his \"mate\" is protecting her? In what world stressing out the mother of your child, being borderline abusive, and not caring for what your \"mate\" asks is instinctual? To me OP's husband has the instincts of an asshole, not a protective and attentive father.", "If he was acting on instinct to protect his mate, he'd feed her. My husband went into overprotective mode, it didn't involve leaving me without food while he ate a bowl of cereal.", "theres something so unbelievably icky abt the word “mate”. “the mate”, she’s a human being and a mother. to boil it down to “instinct”, you realize that’s not entirely true? if it was instinctual there’d be less deadbeat fathers", "Oh f××k off", "is there some medication you're supposed to be taking that you aren't", "Wow, if he has all these protective instincts, maybe he could protect her from STARVING by BUYING FOOD.", "If that was true, then you'd think he would at least make sure that's groceries, rather than coming home, fixing himself some food and having a beer so he can't go get food for everyone else.", "They didn't have grocery stores and cars back in the caveman times.", "Rolling.", "Yeahhhhhhh as soon as I saw that OP moved very far from home and her entire support system because her fiance \"needed a change\" right about when she got pregnant...and now since the baby was born, her car \"isn't working\" and can't be fixed...and he won't let her use the truck and won't do an extended food shop himself...and they live miles from anything...my heart dropped. \n\nOP, I also hate to say this just based on one reddit post, but those flags are real, real red.", "All of this.  I hope OP sees it.", "What does the state being \"more conservative\" have to do with anything?", "They aren't married", "But he won't allow any of the solutions. \n\nHe won't get more than one day of groceries so that he only has to go once or twice a week.\n\nHe won't let OP drive the truck because \"the power steering is going,\" except a) it isn't and b) he's a mechanic, so why doesn't he fix it? (Or her car, which has been broken conveniently since just after the baby was born and his behavior started to change?)\n\nHe won't watch the baby without her there. \n\nYou can only communicate with someone who is interested in having two-way communication and solving the problem. Doesn't sound like he is.", "I'll tell you one thing if you grocery shop every single day for your food you'll end up spending more overall. One well planned large shop per week is the way to save money. 🤷‍♀️", "I see, thank you!", "Just say out loud you're a bad driver and don't know jack about cars, it's ok, we'll believe you...", "My concern wasn't if the power steering was out. My concern was it suddenly cutting out while OP was driving. There is the potential to find the power steering gone at a crucial moment.", "No? I don’t have time to source out all of your comments. I’m replying to this specific one.", "Since he is a mechanic he could fix both vehicles.\n\nThis way the baby and the mother of his child would be driving in a safe vehicle.", "Or he’s controlling and isolating her as abusers do. Did you not think of that?", "Understandable. Yeah she says that when she asks him to go on a big shopping he refuses and says they should just go together.", "ohhhh. totally missed that. thanks!", "I think she would have noticed him doing that. Should have said there is no EASY way to blow a head gasket deliberately.", "[deleted]", "I had a c-section and was told that as long as I was able to shoulder-check I was fine to drive. I drove 4 days later, however that was a mistake as I was in a lot of pain for the rest of the day. I thought it was odd that the nurses didn't tell me to a wait any sort of minimum time to drive. Only restrictions I was told about was no lifting over 10lbs for 6 weeks.", "I feel for you! I had c diff years ago - not pregnant thankfully, but that was awful!", "I agree with you.  But the instincts are there.  As I said (and Reddit being its usual illterate self didn't care about), wise men fight these instincts, but it's dumb to pretend they don't exist.  Instinct shapes nearly everything a human with a physical brain does, they're hardwired into us, we can only choose to resist or comply.\n\nthis is why men need to be taught to think with the brain on top of their necks rather than the other one.  Because the other one is guided almost purely by primitive instinct.  If we want something more, both sides have some things to overcome.  Men in particular.", "Many conservative states are trying to do away with no fault divorce.", "100% agreed, but if you’re living hand to mouth, then you have no choice.", "in other words, you dont know shit about cars or power steering systems", "There's also the potential for a tire to go flat at a crucial moment. Or potential for the car to skid. Anyone who drives should know how to deal with that.", "Strange, I just reread the post twice and don't see anything there about how he refuses to go on a big shopping trip. She did a big shopping trip so she wouldn't have to deal with his annoyance over getting groceries every day.", "Drive it while it’s running hot - if it was already an issue it’s pretty easy honestly.", "it would be OP’s husband who would have done this, not OP", "What? What kind of condescending shit is this?!", "Then why didn’t he go hunt or gather food before coming home? Why did he make only himself some food? Your comment is BS because if that were true he wouldn’t complain about having to do ‘everything’. He would make sure his ‘mate’ was fed and rested and takeover for her when she needs him to.\n\nStupid incel alpha male crap.", "*I see, thank you for actually answering me* and not the knee jerk down vote that's so common on reddit.", "I'm not defending this poster, the husband is the AH; but I have to respond to this: what do you mean by this comment? I can think of 3 or 4 times in my life (been driving 30 years) that power steering has gone out in my car while driving it. A couple times it happened to me in the middle of a turn (you don't forget a crap in your pants like that lol).\n\nSo not real sure what you're inferring unless talking about super new vehicles? The last time this happened to me was in 2013 with my 2012 work truck; so still fairly modern but not ultra modern yet still computerized.", "Yeah but this was an identified problem. Would you drive with a bald tire? Or on a road you know may have black ice?", "In her comments she says he refuses to buy stuff for more than one day.", ">Everytime I've asked him to pick up groceries for the week versus getting groceries every day, he will call from the store and say things like \"we will just do this when I have off work and you can come with me\" but then it never happens. Or he will call me bitching because he can't find something on the list I sent him with and say \"fuck this, I'm not going to sit here searching for that\" and in the end, he just refuses to get anything more than what we need for dinner.\n\nOne of OP's many comments", "Gotcha. I read the post but not every one of their comments."]}