{"id": 31000, "submission_id": "17vjvws", "title": "AITA for not wanting to exclude my son for Thanksgiving", "selftext": "My oldest son has mental health issues, (schizophrenia and psychosis) and he can be a bit out there when he's not on meds. He has been known to self medicate with street drugs as well and that's never been a good combination. For the past month and a half, he has been off illicit drugs and taking the meds RX'd by the doctor. He seems to be in a pretty good place.\n\nMy oldest daughter who is his big sister, is coming into town for the holidays but doesn't want to be around him at all. She wasn't here while he was going through all of this but has heard about it, while it was happening from family members. She says she would like to just stop in at the house and get a plate of food and then have everyone except for him come to the hotel to celebrate an early Christmas, exchange gifts and play prize games (that I plan out and pay for). I don't feel like its fair to exclude him, especially since he is clean, following the Dr's orders and is acting pretty much like his old self again. I think it will discourage him and cause him to not want to continue trying. He is really excited to see her and doesn't know how she feels. I told her she would have to tell him herself, because that's between them.\n\nShe says its not fair that she is coming all the way home, paying for a hotel and then not going to be able to spend time with anyone.\n\nEdit: I should have also mentioned my son is living with me and I am getting legal guardianship of him, so I am making sure that he is taking his meds and going to his appointments.  Both of them are adults.\n\nAITA for not wanting to exclude him?", "created_utc": 1700016964, "permalink": "/r/AmItheAsshole/comments/17vjvws/aita_for_not_wanting_to_exclude_my_son_for/", "score": 149, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I refuse to exclude my son from Thanksgiving with the family.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. She is fully allowed to not come around her brother if she doesn't want to be but what she can't do is dictate others not to be around him or make others choose sides.\n\nYour daughter is TA, not you.", "Schizophrenia has a genetic component and your daughter ought to step back and be thankful she wasn’t robbed of her own sanity like her brother has been.\nYou’re nta, your daughter is.\nMy oldest son also has schizophrenia, he is just as much a part of the family and as valuable as my other kids.\nYour daughter sounds like she needs to educate herself about mental illness.", "You say your daughter wasn't there for the worst of his behaviour and therefore doesnt have any reason to refuse to see him, but you don't have to be present during a hurricane to know you dont want to be present during landfall and to heed the warnings and evacuate.\n\nSame for your son. He's clean now,  but could go off his meds at any point and your daughter,  for reasons of her own,  doesnt want to be present for that. Sorry it bothers you,  but people get to choose who they associate with. \n\nNow,  expecting you to cook/plan/provide food,  games,  gifts,  etc,  and exclude your son is silly and feel free to tell her hell no,  that if she wants to attend YOUR party she has to respect YOUR guests,  but if she hosts her own party at her own hotel room and doesnt invite your son,  well,  the same rules apply.\n\nShe can throw her own party,  with her own guest list,  food, games,  etc,  and so can you. No one is stopping either of you,  though I feel sorry for the rest of the family caught in the middle.\n\nYou are right that she needs to tell her brother the truth. When it comes to that,  stay neutral,  that's between them.\n\nBut you get to choose who comes to your party and so does she.\n\nNTA,  but I do understand why your daughter doesnt want to be around your son.", "I mean, I've been in the same boat with family and an Ex. \n\nIn my experience someone who doesn't take their meds without being monitored will eventually stop taking them anyways. I've seen it time and time again.\n\nYour daughter has the right to be weary and unless you're going to take personal responsibility to make sure they're stable and behaving properly, I don't see why anyone else should be put in a position they are uncomfortable.\n\nYou can even argue that their illness isn't their fault. At the end of the day their behavior, like taking drugs or suddenly dropping their medication(s) is their fault and it's a choice they're making.\n\nNo I don't think everyone excluding him like that is good for their recovery. But the daughter is allowed to feel different about this.\n\nNAH", "NAH\n\nIt's only been 1.5 months that he's been off illegal drugs and taking his prescription drugs as instructed. Who knows when the holidays come around he may well be back on the street drugs or not taking his prescription drugs at all or not in the right way. How long do you think it will take you to find out if/when he's gone back to using street drugs? I think it's also common for people with this kind of mental illness to stop taking their prescription drugs because of their undesirable (side) effects when they feel they are doing better, not fully realising that their feeling better is all due to the positive/intended effects of the drugs, not because they 'got better'. They quit taking the drugs because they think they are better and can manage on their own, and they can't, they fall back into their reckless/dangerous behaviours, they end up getting in (serious) trouble, get admitted, get put back on prescription drugs, and the cycle starts again. I hope your son is different but you can't guarantee that. You can't guarantee that he will still be clean on the holidays or that he won't act in an aggressive, dangerous, or scary manner.\n\nIt is totally fair to not want to spend time around someone with such severe mental health issues who chose to use illegal drugs and is only super recently clean and only recently been back on the prescription drugs. She shouldn't have to subject herself to that as she is probably scared for his behaviour. I would be too if I had heard stories of how bad it got. I'd wait for him to be more like 6+ months clean and taking his prescriptions. You don't get to decide when she should feel safe to be around him.\n\nBut it's your house and you get to decide who you invite. If you insist on including your son, then I understand you don't like your daughter's suggestion of basically taking the party you planned elsewhere, but you are inconsiderate to her feelings and fear. But if you are planning to stick to your plan, you need to tell your daughter. Why not suggest doing something with her and a few other close family members that SHE invites on one of the other days of her trip? If she's going through the effort and expenses to travel and get a hotel then you should make time for her in a way that she feels comfortable. Otherwise tell her not to bother coming home and she can choose to not come at all as it will just be a waste of her time and money if you don't want to see her without your mentally ill son.", "NTA sounds like you're trying to be a good father imo", "NAH. \n\nYour daughter is allowed to host an event at the hotel if she so chooses and invite who she wants. \n\nYou’re not an AH for wanting your son to be a part of things. But she’s not one either for wanting to maintain some distance.", "I don't think we can force adult siblings to deal with each other. But, I also don't think one of my kids gets to ask me to exclude their sibling from anything having to do with my home, my time, or my family.\n\nI'd put this back in my daughter's lap. Even while I understand her apprehension at dealing with her brother, she's still the one with the problem with his presence. (He's had troubles, so she expects trouble to intrude, it seems?)\n\n\"You'll have to tell your brother you don't want to be around him yourself then. Life is messy and you can't claim moral high ground while expecting me to do your dirty work sweetie. If the two of you can come up with a visiting schedule you can both live with, I'll be here waiting on you at your scheduled times. But you won't ever be able to tell your brother that I don't want him around.\"\n\nNTA. I understand her. I just think she's putting you in an untenable position and that's not fair to your or her brother's progress. Good luck. I don't think its fair to you to put you in the middle.", "NAH.\n\nI get where you’re coming from but I get where your daughter is coming from too.\n\nYour son has made progress. But it’s just been a month. You can’t expect people to not have reservations about a volatile person in such a short period of time.\n\nIf your daughter wants to drop by your house for a plate, then tell her she is welcome to do so but you will not be kicking out your son during her visit or ask him to stay hidden in one of the rooms. You get to say who can be in your home. But at the same time your daughter gets to say who can come to her hotel room.", "NAH\n\nAt a month and a half, people can still be tweaking and have cravings after getting clean. It takes time to truly see if someone has gone sober. Relapses early in sobriety are very common, unfortunately. \n\nIn her eyes he is a drug addict. Its harsh, but he hasn't been clean that long. So her not wanting to be around him makes some sense. \n\nYou're his dad, and no parent wants their kid excluded. \n\nI don't think either one of you has invalid reasoning. It may take time for her brother to earn trust and work his way back into her life.", "NAH. You want to help your son with his recovery and mental health, and that's the right thing to do.\n\n...but I also guarantee your son's done something that's completely got your daughter on edge about being near him. Hopefully, it's only something as minor as stealing a few bucks from her to feed his drug habit... But drugs, psychosis and schizophrenia are a combination that means something really, really, bad could have happened and she has legitimate reason to be afraid of him.\n\nMaybe you should talk to your daughter about exactly why she doesn't want to be around him?", "Not at all, I think excluding him would be wrong and is unfair to put him through given that he already struggles with mental health issues. I think it's worth talking to your daughter and seeing if you explain to her the implications of not inviting him, remind her that that is her brother.", "Your house you don’t have to (not should you exclude) him if you don’t want to\n\nBut that may mean she doesn’t come at all.  Are you prepared for that?  Maybe try and find a compromise-can you go see her a different week or something?", "NTA - Family should support each other, especially during the holidays. Excluding your son could discourage his progress and hinder his mental health. It's important to communicate and find a compromise that works for everyone.", "NTA\n\nAnd well done refusing to meditate between your adult children. This is no longer your job. If your daughter doesn't want to see him, she needs to own it. And, it seems unyielding and unforgiving, though somewhat understandable, to refuse to see someone because of the mental illness and behavior that never directly affected her. It's hard when people use street drugs to treat their mh; you often get the worst of both worlds (dug seeking behavior and poor mh). Your son is lucky to have your support through this.", "Leaning towards YTA. Your daughter has reason to not want to be around her brother. She knows that he has been self medicating and is probably weary and nervous to be around him. She doesn’t have to be present for his harmful behavior to be impacted by it or become scared of him. She is traveling home and paying for a hotel and is basically missing thanksgiving just to avoid seeing him. If she wants to have some gathering in her hotel to have some sort of holiday celebration she should. Especially when they celebration is not interfering in the official family holiday celebrations. \n\nYes it may be hurtful to her brother but she isn’t asking for him to leave his home during thanksgiving. You are only protecting your son and aren’t caring for your daughter at all. She is traveling, paying for a hotel, and making other plans with family. She is doing her part to accommodate her brother and not force him to miss an actual holiday. He gets thanksgiving and real Christmas.\n\nYou are getting guardianship of your son, having him live with you, and enduring he’s taking his meds. You are doing a lot for your son, she is taking steps to not force a situation and you can’t lift a finger to help her out with that or to make sure she gets some holiday celebration herself?", "It sounds like she is judging him too harshly for what is an illness. And she hasn’t even experienced it.", "NTA but it’s probably difficult for her.  Maybe say you genuinely want her to come.. that he is doing better and wants to see her… but if she gets uncomfortable at all, you will understand and will help her make a graceful exit and meet up with her later.", "OP you're definitely NTA and neither is your daughter.  Bottom line all of this is \"grown folks business\" I've always been told, so you just need to move forward with your plan and tell your daughter this.  If she wants to participate then she's going to have to face her brother.  If she chooses not to and it doesn't go well with your son then there's nothing you can do.  If she does and it doesn't go well with your son there's nothing you can do.  There's no control over the situation whatsoever, nor over your children, and the sooner you realize that then you'll just keep focusing on controlling what you can.  It'll work out the way it's supposed to.", "NTA - I don’t usually agree with this bullshit about ‘you made them break their sobriety’ but in this case it defiantly won’t help.", "NAH - you are totally allowed to want him to feel\nIncluded but your daughter is allowed to now want to be around him. It leaves you in a shitty place and I agree with you that she should share with him directly that she doesn’t want to see him.", "NTA. I'm confused. Has anything specifically happened between both of them? You also stated that she heard from family members and wasn't around when your son was going through his mental health issues. It seems like something is missing. If not, then your daughter is judgemental and has no right to dictate how things will go if she is coming home to visit. She does have the right to not be around her brother and she needs to be an adult and communicate her issues with him to his face. You are not the middleman. Celebrating early Christmas, playing prize games, and doing gift exchange is a whole event. On top of the fact that everyone but him can attend. Why did she even bother deciding to come home?", "Info: Personally I’m usually against the age & sex being required because I believe it adds nothing but bias. In this scenario though it’s needed. Who is every one? Are they adults?\n\nEven without that though, I don’t believe this is just over what you say it is. There’s no way she would be taking it to this level just by hearing about her perfectly normal brother via 3rd party sources. \n\nIrregardless NTA. You pay for it & she’s the guest", "NTA for not wanting to exclude your son, but if you agree to her plan of an early Christmas you're pretty much saying it's okay to treat him this way. \n\nWhy does your daughter expect everyone to come to her hotel to celebrate Christmas with her like she's some sort of visiting dignitary?  Why should the rest of you have to go to the trouble of taking everything to her when she's the one being unreasonable?  This is just a recipe for an awkward Christmas for everyone except your daughter.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy oldest son has mental health issues, (schizophrenia and psychosis) and he can be a bit out there when he's not on meds. He has been known to self medicate with street drugs as well and that's never been a good combination. For the past month and a half, he has been off illicit drugs and taking the meds RX'd by the doctor. He seems to be in a pretty good place.\r  \n\r  \nMy oldest daughter who is his big sister, is coming into town for the holidays but doesn't want to be around him at all. She wasn't here while he was going through all of this but has heard about it, while it was happening from family members. She says she would like to just stop in at the house and get a plate of food and then have everyone except for him come to the hotel to celebrate an early Christmas, exchange gifts and play prize games (that I plan out and pay for). I don't feel like its fair to exclude him, especially since he is clean, following the Dr's orders and is acting pretty much like his old self again. I think it will discourage him and cause him to not want to continue trying. He is really excited to see her and doesn't know how she feels. I told her she would have to tell him herself, because that's between them.\n\nShe says its not fair that she is coming all the way home, paying for a hotel and then not going to be able to spend time with anyone. \n\n AITA for not wanting to exclude him?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "A lot of people here shitting really badly on the daughter. \n\nWhile I absolutely agree that she cannot tell OP who to invite to his celebration that he is hosting in his house, he also cannot dictate who she invites, or doesn't, to the event she is hosting in the hotel that she is paying for.\n\nOne thing a lot of people seem to have overlooked, or not considered, in their attacks on her is the fact that her brother did not become schizophrenic and psychotic overnight nor, suddenly, while she was absent.\n\nI would not be surprised if the daughter has experienced a great many situations where her brother made her feel uncomfortable, unsafe and/or scared. His recent desire to self-medicate and the behaviour that stemmed from that may have been the straw that broke this particular camel's back as far as she is concerned.\n\nOP is right that his daughter needs to have a discussion with her brother and it would be unkind, in my opinion, were she to say she never wants to see him again. However, it would not be unreasonable if she were to give him some kind of, I don't know, boundary/goal/target. For example, she would be happy to see him again if he stays on his meds for two/three months. I fully appreciate that giving such 'targets' to someone with such severe mental health issues may be neither possible nor realistic\n\nFor OP's daughter to have such a strong reaction, there has to be more to brother and sister's relationship than is being described.\n\nUltimately, NTA for wanting to include your son at your own celebration but a soft Y T A for trying to dictate who your daughter can invite to hers", "He's also a drug addict. Yes, he's been sober for a month and a half, but he's just beginning the recovery process. He's taking medication for his schizophrenia now, but that's a very recent change as well. It's common for relapses to happen, especially when the underlying reason for the addiction remains unresolved. Reconnecting with family after an addiction is hard, because in many cases, they've seen the cycle multiple times before. Sobriety, promises, relapse, repeat. There comes a point where most people have to take a step back and see if the loved one actually remains sober for a period of time before jumping into reconciliation again. In his case, it's twofold - is he actually staying sober AND is he taking his medication? Trust has to be earned, and that takes time. That's something that should have already been discussed with him and should continue to be discussed throughout his recovery process. Some relationships can recover, some can't, some relationships get rebuilt but are never the same. The person in recovery needs to understand and accept that.", "I should have also mentioned my son is living with me and I am getting legal guardianship of him so I am making sure he is taking his meds.", "Happy Cake Day", "NAH for sure. I’ve been in a roughly similar situation as the daughter. OP can have the son around all she wants. Daughter can choose not to associate with the son. \n\nI would just encourage OP to have some time or activity dedicated to the daughter without the son. Maybe not the whole Christmas party, but something. If they don’t the daughter could feel like OP is choosing the son over the daughter. That breeds resentment really quick. The son lives with OP so obviously gets a lot of OP’s time and attention. OP needs to make an effort to spend time with daughter too.", "I should have also mentioned my son is living with me and I am getting legal guardianship of him so I am making sure he is taking his meds.", "I don’t think that’s entirely fair. Normally children can go visit their parents whenever with no issue. Op has the brother living with him, which is fine, but if the daughter is scared of/nervous around the brother and such brother lives with OP, op should be making an effort to see his daughter and spend some alone time with her. Putting it on her to figure it out with the person she is nervous around/fearful of is a bit shitty especially when op is willing to take guardianship of the son, make sure he is on his meds, and move him into his home, but is somehow not willing to go out of his way to see his daughter after she makes an effort to travel and pay for a hotel to see him? \n\nOp is doing a lot for his son, he could do a little to accommodate his daughter as well.", "The guy, who killed and cannibalized the guy beside him in the bus, has never done anything to me. Never met him either. I still wouldn’t want to be around him at any given time. And he’s been ok for years.", "They are both adults.", "As a former drug user I honestly agree. I relapsed so many times, and even after getting clean and staying clean, I was still pretty tweaky after just a month and a half. It took awhile for me to get back to my real self, and I was also battling ptsd and still do, which made it more difficult. So yea, mixing schizophrenia into freshly being off substances can be hard for loved ones to deal with, not that I’m judging him, but he probably needs more to time to straighten out before he can be fully trusted again.", "I have friends who’s kids end up self medicating with illegal drugs before they were properly diagnosed. As someone mentioned schizophrenia does have a genetic component and no one knows how it’s triggered - could be childhood, trauma, drugs - either way, your son is doing his best and it sounds like your daughter should learn more about to be a supportive ally. Have you heard of NAMI? They have online and in person support groups as well as free courses to teach family members how to be a better support to one suffering from mental illness. Good luck to you.", "OP is gaining legal guardianship over the adult son and knows this to be true. I’m a recovering alcoholic. I’ve been sober for a bit over 5 years now, zero relapses. They DO happen, but that doesn’t mean they’re a given. There are people with 30 or 40 years who haven’t ever relapsed. But REGARDLESS, he is family and HE LIVES WITH OP. Sister doesn’t get to make a single decision about who’s invited to Thanksgiving at mom’s house. And then to demand everyone but her brother come play games that OP IS PAYING FOR? Nope. She’s an entitled brat who’s lucky she hasn’t had mental health struggles. \n\n\nI also have a mental illness that is NOT schizophrenia, but is known to have a low rate of medication compliance. It can be overwhelming or scary when I’m unmedicated, but I’m much more of a threat to myself than anyone else, and I have a baby sister that I would personally be CRUSHED if she chose to not want to be around me because I was struggling with my mental health in that moment. Sister will absolutely be safe. I’m sure from the way OP talks that he would be in the hospital if he was in a dangerous space rn. Sister is horrible and ableist and this poor guy’s heart is going to break, considering how excited he apparently is to see his big sister.", "Its strange when he self-medicates its a drug addiction but when he is taking his meds its medicine. \n\nHe will never be off medication but that's not addiction?", "Info: Did anything ever happen between the two when they were growing up?", "That doesn't change the fact that he needs to want to remain clean.\n\nI've been on this exact Rlrollercoaster w/ a sibling. They liked self-education route much better than the therapy/drugs. Unfortunately, this isn't uncommon w/ schizophrenics who discovered self-medication. My mother believed my they would be clean THIS time, everytime they got out of detox. Every single holiday was horrible for decades. I still hate the holidays.\n\nYour daughter is taking the right approch\nYour son had to prove he can stay on his meds before family/friends will trust him. He needs to understand his behavior caused damage. You can not coddle him and pretend his addiction is in the past and everything is fine now. A big part of getting clean is accountability. He has a psychologist and if he goes to NA, he has a sponsor. So he should have support to help him process this. If he doesn't, get him professional support. You can not make him better by coddling him. He has to learn how to manage his emotions and disappointment w/ the help of the professional/semi-professional resources at his fingertips.", "Drug addiction is when it negatively impacts your life.", ">Schizophrenia and the drugs associated with it are a life long treatment and are addictive. Ive never seen the difference between drugs bought from the street and drugs given by dr if that person ios trying self-regulate  \n>  \n> There are millions of humans addicted to the drug they get from the Dr.  Anti-depressants are a good example, humans can be on them for life. Just because the medical system gives drugs out does not mean they don't get humans addicted.   \n>  \n>Oxycodone is handed out like sweets and are truly addictive.   \n>  \n>Ops son self medicated and he is an addict, he gets drugs from the Dr and he is not addicted.", "Schizophrenia are huge drugs that truly negativly affect a person,", "Info: did his mental health issues affect her childhood? Did things change or have to be compensated for him? \nWas he prioritised over her because his needs were higher?", "Nta", "NTA\n\n>She says she would like to just stop in at the house and get a plate of food and then have everyone except for him come to the hotel to celebrate an early Christmas\n\nYour daughter wants to shove the family into a single hotel room and rearrange the celebration just to avoid her brother. \n\n>She says its not fair that she is coming all the way home, paying for a hotel and then not going to be able to spend time with anyone.\n\nIt is her decision to travel and get a hotel. No one is holding her at gunpoint. If she wants to avoid her brother in his own home, she has to accept that it'll affect the rest of her trip.", "NTA!! Your daughter is free to go no contact with whichever family member she wants to but right now she is forcing that decision on everyone which is wrong. She needs to understand that she’s not a princess and doesn’t get to dictate everyone else’s relationships. \n\nIf she wants to do gifts with her family and exclude her brother do it to his face for the whole world to see, then they can decide if they wanna cut off someone capable of such cruelty.", "NTA\n\nAt first I’d say N A H, but she can’t demand people visit her simply because she spent money on a hotel. She has every right to limit her interaction with her brother, but she can’t turn around and then demand people visit her. The same way you can’t force her to visit with her brother, she can’t force you to visit with her. She’s making a decision based on information someone else gave her about her brother’s past behavior and choosing not to make a changed or new decision based on what you’re telling her of his current behavior. That is 100% allowed, but it comes with some consequences regarding who is willing to visit with her and if they find her wants/demands feasible. If you don’t, it’s also 100% allowed.", "INFO: since when does the daughter know that your son is living with you? When everything was planned before he became sober 1,5 months ago (which is not a long time) and everything was booked with the expectation that the son won't be there, her reaction is more understandable.", "NTA\n\n\"You have no reason to be upset. I am not stopping you from seeing anyone. I simply will not be a party to excluding your brother over Thanksgiving. Especially when he has done nothing to you, and is excited to see his big sister. If he ever sought to exclude you, I would do the same for you. I will not support any decision that excludes any of my children over the holidays.\"", "OP, please be aware of what it's like to be the sibling of someone with serious physical or mental health problems - it frequently includes growing up with the family ignoring one's needs, because the needs of the unwell sibling are so much more pressing, or being pressured to become an unwilling or unqualified caregiver.  It can also mean that the healthy sibling is not protected from problematic or abusive behavior from the sibling, which BTW can  lead to estrangement from the sibling, parents, or entire family as an adult.  And that's without the addiction, relapse, and medication issues, which believe me have made everything far worse over time. \n\nSo yes, you want to meet your son's needs, especially now, while you see hope for recovery and a better life.  But do you also want to be the parent who never meets your daughter's needs?", "Info: so how was it for your daughter growing up with her brother? \n2nd info: what on earth makes you think 1.5 months makes a drug user \"clean\"? You're in for a very, very nasty shock shortly.", " NTA. He lives there. She is visiting. She doesn't have to spend time with him, but her plan is just cruel. You don't have to be a part of that. You also cannot make her willing to be around him. If she and others go back to her room, fine. You two don't go.", "NAH", "NTA.  Tell her it's her decision if she wants to isolate herself from her family. The thanksgiving you'll be attending is the one at your house with everyone in the family invited, including your son.", "NTA\n\nYour daughter is either straight-up evil or scared of him for some reason. I frankly don't think you provided enough info to understand whether she just \"doesn't want to interact with the crazyman\" or if there's a valid reason behind. \n\nHowever, assuming that he's truly better, clean and behaving reasonably and that there's no big past fracture between the two, your daughter is TA. And a big one too. If all of this is true, she would frankly deserve to be the one that spends Christmas alone.", "He can't control that he's schizophrenic. \n\nI've had many a holiday with and many a holiday without my schizophrenic family member who is on meds, but they're always imbalanced, either he has hallucinations and hears voices or he's super depressed. It's been rare for me to see him happy and cognizant. He lives in an institution with nurses who regularly make him take his meds. I remember one celebration when I was young where he almost caught our house on fire, so he's never been back to our house since.\n\nBut this is heartbreaking. I can't say whether your daughter is an AH or not though, based on his prior self-medication and being newly sober (besides prescription). I'm torn, because I agree that this is likely to set him back in his recovery and, as he has been acting like his former self, it seems cruel to exclude him.. But it's also new, and he's unstable because it's a new normal. Maybe his sister being afraid to be around him spirals his recovery. Or maybe he's included and somebody makes a comment that spirals his recovery. Maybe even, he becomes paranoid thinking his family see him different now (when nobody did anything), and *that*'s what causes him to spiral. It could be anything.\n\nInitially, I thought N T A, but as I've considered my own family's experiences, the parents of my schizophrenic family celebrating with us, but without him, I can't say for sure that your daughter is an A H for hoping for a holiday around somebody's precarious mindset.", "Your daughter seems to have missed the spirit of the holiday season: love, peace, and togetherness. Shame on her. She is TA. You are not, and neither is your son. Please disregard your daughter’s absurd and cruel demands. Put her in her place.", "The only concern is if he's done something to her in the past that she doesn't want to disclose", "Oh boy. I feel for you. My ex-husband is schizophrenic with multiple addictions. He was highly intelligent, and a phenomenal baseball player, he was being scouted by pro teams when his illness started becoming apparent in his early 20s. His family's idea to help him was to take him to faith healers, etc, because his mother thought his stepmother had put a \"root\" on him. (Southern term for spell or curse) I got him committed against his will when I was pregnant with my daughter, and he did well for about a year and then a cousin of his got out of prison and started coming around and everything went to shit...again. Stealing, violent, not sleeping for days ...I absolutely know what you have dealt with. I'm going to say NAH because obviously you love your child, but having seen someone in the grips of a schizophrenic flip out I can understand your daughter feeling the way she does. Love, light, healing and strength to you and your family. 🩷", "Info needed for me\n\nWhat was their relationship growing up?\n\nDid your son have his mental health issues as a child?\n\nDid you treat them equally growing up?\n\nThere can be a lot of reasons why she doesn’t want him there that have nothing to do with the addiction part.\n\nIt could be possible as a kid your son was always causing problems from his Schizophrenia and as such your instincts were to spend more time with him.  In doing so you spent less time with and ignored your daughter. \n\nYou also could of treated them differently.  If daughter wasn’t allowed to go play till her chores were done regardless of how she felt about it.  Whereas son could go out and play if he didn’t do chores all to avoid the meltdown/hurting his feelings.\n\nThose are just the reasons where your actions could influence daughter’s decision now.\n\nThen there is the possibility of how son treated daughter when they were kids. \n\nDid he always bully her?  Like did he have episodes where he thought she was an enemy and started punching her? Did he constantly say mean things to her because he couldn’t distinguish reality from fantasy? Did he have an episode where he SA’d her as a result? \n\nWhat were your responses to her? “Oh honey he couldn’t help it.”\n\n\nI am not saying your son or you actually did all the above.  There has to be a reason why she doesn’t want to be around him now.  Have you talked to her without judgement to find out why she doesn’t want him around?", "NTA\nI understand that your daughter doesn't trust your son right now but it is something that's between them and not for you to sort out. It's strange that she's so against even seeing him when she didn't have to deal with anything he has done directly. Shw doesn't get to dictate everyone's xmas because she's got a bee in her bonnet about your son.  Also I would like to add that there is a study that says people who are supported by family instead of shunned during recovery have a much better chance of staying sober and clean. As long as he isn't hurting you, you are doing the best thing you can for him but make sure you seek outside help if he slips.", "Nta.  Your daughter though doesnt deserve a family.  Go NC.", "Totalky agree!\n\nOP, Please don't join her in excluding your son. Your son needs all the support he can get. I also agree with you that being excluded like this could set his progress back. \n\nNTA", "Or expect them to bankroll the exclusionary event.", "#NTA.", "You’re being overly generous in saying that the daughter was spared from the effects of mental illness.  She doesn’t sound like that much of a prize.", "Bingo. 💯❤️", "The daughter feels how she feels; the problem is that the daughter wants to \"stop in and get a plate of food\" which makes it sound like takeout, then have OPs invited guests go to the hotel for a Christmas gift exchange.\n\nIf daughter wants to have a gift exchange she needs to.plan it for another time, one thst doesn't piggyback OPs event and take her guests away.\n\nI'd be livid. OP invited, is cooking and hosting but her daughter wants to take her guests away.\n\nThat's a separate issue from excluding the son; it's absolutely rude.", "To me the problem is that rather than declining the invitation and planning something for another day, the daughter wants to grab a plate and the guests and go.\n\nThere are many rude situations on this sub but this one takes the cake.\n\nThe daughter should invite her chosen guests to an event she plans, not depend on her mom to provide dinner, then whisk her guests away, with the exception of her brother.\n\nShe can do something Friday or Saturday and provide fo9d herself", "His daughter is hijacking his Thanksgiving dinner guests. That's incredibly rude. Instead of planning an event another day that she's hosting, she's depending on his meal, then taking his guests away. And thst doesn't strike you as rude?", "Excluding one child due to his disability is not “meeting the needs” of the other. He is currently medicated. He is trying his best. His sister doesn’t have to see him if she doesn’t want to, but to demand the entire family exclude him from the holiday celebration? Nope. Not even close to acceptable or appropriate.", "But OP says the sister was not there to witness any of this. I don’t see how your comment pertains to this particular situation.", "Normally would agree with your very valid points, but OP says that the sister wasn’t around to experience the fallout of the brother’s addiction/mental illness.", "Sister is allowed to bow out herself but stopping in to get food then inviting everyone aside from him over for a different event that she still expects OP to plan and pay for is both entitled and cruel.", "The daughter who wants to eat OPs Thanksgiving dinner, leave her brother at home and steal OPs guests for her own event? That's not something to accommodate.", "Fair point, well made. \n\nI misread the post and you're absolutely right. That is not a nice thing to do at all.\n\nIf she wants to host and pay for an event of her own, that's one thing but to try to 'steal' OP's event is not on.\n\nWhilst I agree with you about this, I still maintain that there must be more to the story than we are being told. Few people would go from 0 to 100 over a single event", "This. My uncle is a schizophrenic and was violent and sadistic with me long before he officially qualified for the diagnosis.", "No one, literally no one, is buying antipsychotics off the street. People with schizophrenia need antipsychotics to live and function. Would you call a diabetic who needs insulin a “drug addict”?", "Dude it's really simple what are you on about? Mental health drugs help regulate emotions and symptoms of mental health issues. Crystal meth and heroin do not but make the unwell feel better for a short time -aka self medicating. \n\nDon't even try and pretend they're the same thing.", "There are a lot of “huge” drugs that, in the wrong dosage, can kill a person. One is Tylenol. Another is insulin. Pretty much any drug you can name can have adverse side effects. That’s why you need a licensed and experienced prescriber to help manage medications. \n\nUntreated schizophrenia is really, really harmful to one’s wellbeing. It’s not a mild condition that can be managed without medications. I wish it were, but that’s not reality."]}