{"id": 31022, "submission_id": "17vw0ll", "title": "WIBTAH for removing my 23 son from life insurance and not including in will because he disowned me?", "selftext": "I am a 43F currently serving in the Army for over 18years. I have three children 25F, 23M, 17M. Over the past few years my 23m son has been genuinely upset that I will not transfer my GI BILL to him. Those unfamiliar with the military, service members are able to transfer their education benefits to their spouse or children after serving a certain amount of time. However, I accidentally exhausted my GI BILL.  My daughter and oldest son never really showed interest in college, nor were my sons grades of the best.  Once my son moved out after HS our communication was minimal. Our relationship prior to him moving out was alao strained. As a parent, I hope I am not the only one to say my son and I just did not get along and could never seem to connect as he got older and got worse the older he got. About two years ago of him going no contact he messeged me, not to ask how we were doing or anything, but straight to the point that its my fault that he no longer qualifies for grants due to our incomes combined and why I did not transfer my GI BILL to him. I Informed him that I had exhausted it and that he is more than welcome to speak to a recruiter.  He then said I should have set 50-100 aside each month to pay for his college. At this point I call him entitled and told him I don't owe him anything once he moved out of my household.  (Summerized conversation) We go no contact again for a little over a year and recently another messege straight to the point asking how I exhausted my GI BILL, again told him he can go see a recruiter about it, but I also explained it wasn't intentional, and was unaware that when you take one class they doc you a full semester. Non,the less this conversation still ended on that I should be responsible for his college.    Let it be clear, before I joined the army I was a single parent having my first child at 17, living in poverty making less that 11k a year. I joined the army at 25, paying for college tuition out of pocket was never an option. I did the best I could as a parent and I know I would never win mother of the year. In both conversation I did apologize for the mistakes I made along the way. As, it's clear they bother him, but this conversation ended with him stating he does not view me as his mother and blocked me on everything. He made it clear to his sister that he does not view me as his mother and I am nothing more than an egg donor. \n\n It is time for me to update my life insurance and do a will and I am considering excluding him. WIBTAH?", "created_utc": 1700061948, "permalink": "/r/AmItheAsshole/comments/17vw0ll/wibtah_for_removing_my_23_son_from_life_insurance/", "score": 1261, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. WIBTAH Considering removing my 23yr Son from life insurance and will 2. Because he disowned\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Feel like there’s some missing missing reasons here.", "\"It is time for me to update my life insurance and do a will and I am considering excluding him.\"\n\nDo it.  He can't cut you out of his life and then demand that you give him something later.  NTA  He can't have it both ways.\n\nIf he wants money for college, he can talk to a recruiter, get a loan, or pay his own way.  Or get a scholarship, just like I did.", "YTA lmao ppl love to bring kids into this world then treat them poorly, fail to provide for their future, do not set them up for success, then turn around say-\n\nUR UNGRATEFUL!!! I DONT OWE U ANYTHING !!! DO IT URSELF!!!\n\nsuch a strange mentality. like, u all up and down this post trying to find a reason to justify cutting ur son out of ur will\n\ncounterpoint: who is the adult here? who has been an adult here for the past 20 years? why are u comparing ur mind and ur decisions to that of a 23 y/o? \n\nat the end of the day, do what u want, its ur life, but i have a feeling u might find urself at the end of it, alone.", "Did you ever figure out where the children were coming from? If you’re struggling with the first, maybe don’t opt for a second and third.", "YTA. After reading your comments, this is not the reason why he disowned you. Look in the mirror.", "YTA- but not for what you asked. \n\nYTA for not taking the time to figure out the full extent of your benefits. Ignorance of it and saying “I DiDnT kNoW” is not an excuse. There were plenty of ways to get this information: senior military members, career counselors, school counselors. Etc. \n\nI say this as a former single full-time military mother (retired in 2021) who has a bachelors degree and still has enough GI Bill left over to give my kid a shot at college. I can understand how he’d be upset. \n\nBut N T A for disowning him because what’s done is done and you cannot go back and change it.", "YTA\n\nIf your child hates you at 18, it means you were already screwing up royally when they were 5-12yrs old. They didn't become this way magically, you created the problems they're now struggling with.", "I'll probably be down voted but here goes anyways.\n\nYTA\n\nYou admitted you were a bad parent, and you yourself said you were a \"child raising a child\" while it's within your right, to have as many children you want but once you realised the responsibility of having one child you should've atleast spaced out the other two.\n\nAgain, it's your right to have to have children, but then don't go making excuses for your inability to pay for their upbringing. As a good parent, it was your duty to set aside some money for their education. And 23 and even 25 isn't considered old to go for education. And you're telling me if you loved your children you couldn't put away a few dollars for their education.\n\nAnd holding a 23 yr old to his words, and that too a second time, that means he cut you off at 21?\n \nYeah, there is definitely more more going on here than you're letting on.", "I think the parent is probably impossible to speak with.  Kids don’t cut their parents out of their life but the fact that you now\nConsider to retaliate against your own child that will most certainly cause even more grief once you pass is truly sick.  Even if you have a minimal relationship when you die and ppl find out you cut out a kid ppl will always say the parent was the fault.    Don’t do it", "YTA in general. Not over this specifically I guess. But you’re a shit parent who had more kids than you could properly afford and take care of.", "Info\nHow involved were you as an ACTIVE parent? Did you have a lot of oversees/abroad/away from home tours/missions?\n\nCuz I feel like you're missing things here.", "Reading the additional context in your comments, YTA.\n\nYou admit that you were a terrible parent and then took 23 years to apologise to him, all whilst still making out that he was as much of the problem as you are. Given how you're responding now, it's quite clear that you still haven't evolved past this (by your own words) authoritarian parenting style.\n\nYou outright said that you only considered the \"necessities\" to be food, clothing and shelter. You turned your nose up at the idea of college, and you've made no mention of affection or spending time with him.\n\nNow, you want validation to cut him out despite this all stemming from your own mistakes?\n\nNope; YTA.", "YTA By your own admission you were a terrible mother. By your own admission you had the power to help your child get through college and squandered it through your own ignorance. You refuse to elaborate on why your son left as soon as he left school and why your relationship is so strained. Now you want to make sure that he can definitely not get any financial benefit from your life and death in any way because he's confronted you about the things you admit to.", "I'd have more respect for you if you just admitted you dont love your son", "ESH.\n\nThere definitely missing details as to why their relationship is so strained. What happened that cause the strain on your relationship? Not enough for a definitive YTA or NTA.", "Your post is slightly confusing, I'm an educ counselor, vet, and retired mil, who works for the DoD education dept, so I'd like to try and provide more insight based on your situation. \n\nIf you are Army AD, then you aren't tapping into or haven't used your GI Bill, You're using MilTA....unless you have a disqualifying factor that rendered you ineligible for MilTA.  Are you currently ineligible to recieve MilTA while still serving? \n\nWhen you retire and if you receive a certain VA rating (100%), your spouse and kids can receive VA Chapter 35 DEA educ benefits\n\nKids fall off your servicemember benefits once they turn 18, unless they have factors where you are still providing 51% or more support...I.e.,  kids as full-time college. \n\nRegardless of his or your views, it seems that you simply have conflict, and needless to say, you are/were the servicemember, so you get to decide what to do with your entitlements and benefits. \n\nIf you have SGLI, again, your adult kids are no longer apart of your life insurance plan....unless 51% support is in effect. \n\nIf you have VGLI, it's the same thing. Ineligible at 18...unless 51% support...yadayada. \n \nSo, can you please clarify your current servicemember status and residing state? I can possibly provide you more guidance on benefits eligibility and entitlements.", "I'm going to go with ESH\n\nYou have no obligation to support him after he moves out and also cut contact with him. He's an adult he made his choices. As an adult he needs to step up and support himself.\n\nHowever..... From what I've read you are not far from fault here either. From the sounds of it, you joined the army when you have a child and as far as I understand that takes up a lot of your time. So not only did you go into an organization that takes away from being a mother, you had 3 kids total and him being the middle. The whole middle child syndrome comes to mind. It sounds like you had limited time with him to begin with and you spread it thin with 3 kids and being in the service. Also what you said about your parenting, you didn't seem to try and connect with him just punished him. It doesn't seem like you built a relationship with him or cared to. And you wonder why he doesn't want a relationship with you. You may have apologized for being a bad mother but those are only words. I'm not saying you need to give him money to say you love him but you sure the hell are not doing anything to make that apology genuine.", "YTA. If you make enough that he can't get financial aid IMO, you're responsible for helping with tuition.", "You were a shit mother then, you’re a shit mother now, and you will continue to be a shit mother after you die. YTA", "YTAy  \n\n\nOf course YTA. Your son, is a child. He's 23 and struggling. By your own admission his upbringing wasn't easy. Struggling hard working mom, apparently didn't ever get along with her, bounced from the home as soon as he was able to. And now as a young adult (child) he's fearful for his future, he does feel like he's owed something because of how shit his upbringing was.   \n\n\nAnd you know what? You dont get to stop being a parent when  your child is acting up. When they're hurting, when they fuck up.   \n\n\nTBH you sound like a shit person all around. Your primary concern should be how to reconcile with your son. How to rebuild this relationship with your first born. Not how quickly you should be ripping out out of a will that by the sounds of it, doesn't have much in it anyways.   \n\n\nLike one final dagger to him eh? He hates you in life, you want him to hate you in death too? Because thats where you're headed.   \n\n\nSwallow what little pride you have and be a goddamn mother to him. For once.", "YTA, stop playing stupid. You’re too old for that.", "Info This really feels like some stuff is missing. He has exceptionally strong feelings about you having messed up his ability to pay for college. For starters, how did you exhaust your GI bill?", "YTA. Kids don’t cut their parents out for no reason. Your replies indicate that you were not a great parent. I get the poverty thing. But why have 3 kids and as a single mom join the army?\n\nIt’s very difficult for kids to get loans or aid because it’s tied to their parents income. So you are blocking him. Why is there no money in the GI bill for him? Did your other kids use it?\n\nNow you want to be petty and retaliate against your son by removing him from your will and benefits? This alone tells me you’re the problem.\n\nWhat have you done to actually reconcile? Other than make excuses and call him a difficult child? Any family therapy? Listening without justifying?", "ESH. Just from your account, the other perspective is: Your son was the second kid born to a 19-y-o not ready or secure to be a stable parent. He spent much of his life in poverty, with a mom who enlisted while he was quite young, who readily admits she made various mistakes raising him, leading to a tense relationship. He moves out to escape the tension and tries to make it on his own but is now blocked because of the irony that your income has raised to the point that it is making him ineligible for grants he is trying to get. So he is a kid who grew up poor and now is blocked from certain aid because your circumstances have changed. And your response to that is he’s entitled and you don’t owe him anything once he moved out, as if motherhood only exists when your kid is under your rule. \n\nHe’s acting beyond rude and cold, but any parent who says they don’t own their child “anything” is proving themselves to be a donor rather than a parent, and your decision to remove him now just proves that.", "why do you keep having children if you can’t even provide the bare necessities for them to eke out a life for themselves? YTA.", "YTA. I can’t exactly put my finger on it, but there’s something wrong about this post. Just in the wording, I can tell there’s more between you and your son that you’re looking for more reason to justify cutting him out.", "Well to him you are the AH.  \n\nWhy did he think the GI Bill was going to be available to him? \n\nWhy did he not know that there wasn’t a college fund?\n\nHow involved have you been in his education?", "Disopned or not. Hes still your son.   So why wasnt your relationship close.  Why did he go low contact.   Do you still love him..", "I'm also a Gen X parent.  I'm a 43M army veteran with two kids (18F & 10M).  It's been tough raising kids when the expectation of parenting is radically different than when we were raised.  You and I both know that a successful military career requires discipline and dedication.  We, often times, hold our children to a higher standard of discipline than civilian parents.  It's not a bad thing, it's just a thing.  The kids don't really understand it, and never will.\n\nLike you, I used up most of my GI Bill on myself.  I have about a year left that I am saving for my wife's Masters degree.   My oldest is in college right now.   I understand what you're going through.  As far as your son's education is concerned, does your state have any benefits?  Texas has the Hazelwood act benefits.  Here in California we have CalVet.  My daughter is using CalVet fee waiver, VA-DEA (Dependants Educational Assistance) and Pell Grants.  She's on track to graduate debt-free without having to work while in school.\n\nI suggest you keep him on the SGLI DD93 and just not tell him.  He is your son, after all.\n\nYou will be TA if you remove him.  Be the grown up, keep on truckin.  Provide for your children in the event of your unfortunate demise.  It's the least we can do as parents.\n\nYou're not alone.", "YTA based on all of your comments. \n\nYou actually sound like a boomer talking about this whole generation thing blablabla. It’s not about the generations it’s how you treat people and well, he decided he doesn’t want to be treated that way. You were born in 1980 and not 1940, what you lack is self awareness and the ability to reflect your life choices without falling into victim mode. You’ve become really (or always were) really bitter and are taking it out on your son. \n\nPlus, why are you telling him to talk to a recruiter the whole time? You know, not everyone wants to join the army and maybe you should’ve done the same in order not to waste your GI Bill on taking one class… \n\nYou’re just looking for sympathy in the comments which is why you hold onto comments that tell you that you don’t own your son a thing (surprise, you had him and no it’s not enough to just provide a roof and food) and the anecdotal evidence of someone not needing a degree in order to succeed. \n\nSince you like talking about generations so much, maybe get real evidence on how much a degree is needed nowadays.", "I’m confused how you exhausted your GI Bill while in service? If you’re active duty you would’ve used your TA instead? If you were Reserve your GI Bill grows by the time in service you have (meeting the criteria for 100%)", "I feel like we are missing information here. A kid doesn’t hate his parents just because", "There is some context I think you might be overlooking.   When it comes to student financial aid the guidelines expect the parents to contribute until their 26th birthday or they get married.   The 50-100/month is probably the expected parental contribution the school’s Financial Aid office is telling him his parents should be contributing based on his FAFSA and income information.\n\nI think there is a failure to communicate here that is based on existing issues and further contributing to those issues.\n\nAs for your life insurance - who it is left to and how much is your decision (except some states make your spouse primary regardless of your choices)", "YTA\n\nLike I get it, you're not obligated to properly educate your child... but goddamn if you actually gave a shit why wouldn't you?\n\nWhy would you keep having kids after you had your first one at 17? Since you don't mention it, I have to assume they are from different fathers...\n\nIf you aren't connecting with your kids who's fault is that other than YOURS? You're going to blame a child for their relationship with an adult? Because that's completely insane.", "You sound like a deadbeat mother, it happens, but since you are also only sharing one side of this story no one will ever know the truth.", " You’ll be dead but you want to hurt him after that. That will guarantee he has no relationship with his siblings. What’s the end goal? Just to hurt him? You win.\n\n2 words:  unconditional love\n\nJob as parent:  be a source of support in your kids life. (Not talking financial)", "It’s not a question of asshole or not. Do you want your child to have a little bit of financial comfort after you pass, or don’t you?", "YTA for your comments.\n\nI cannot possibly imagine considering myself a good parent or bad parent by how much my parenting coincides with the law. If you need the law to tell you how to treat your children, you had no right to have them in the first place.\n\nThis post is leaving out MASSIVE amounts of information. It totally feels phrased to give you the NTA judgement. I bet if your kid went on here and wrote his side, it would be a *very* different story…", "Cutting off the kid right after highschool is pretty terrible. Looks like 0 support from the mother after highschool. I cannot imagine being in that shoe as the kid.", "It sounds like you did little for him when he was in your care, so cutting him out of your will tracks.  I’m coming from a biased view of things: Children don’t ask to be born - life is not a gift for the child, a child born is a gift to the parents. Full stop. There’s also the saying, “Can’t take it with you”. What you’re attempting to do now is petty and vengeful. He went no contact because you suck as a parent. The *least* you could do is split any inheritance equally among all of your kids. Anything less makes you a monster. Reddit loves to say that no one is owed anything by anyone but I disagree. You chose to bring a bunch of kids into this hellhole. All of your earthly possessions should be distributed equally among all of your children when you pass. YTA.", "YTA. And as someone also using their GI Bill, you don’t get docked an entire semester for taking one course. If you’re full time (12 credits) it would be but one class isn’t enough to even qualify over a normal semester. I can understand why your son is upset because he probably did look up your benefits and saw your story wasn’t making sense.", "YTA  This is a decision you could regret later on. \n\nYour  relationship to your child while he was still a child was your responsibility to manage, not his. Yes you have apologised but now you're planning on continuing on with behaviour that will strain your relationship further. Your son does need to accept his lot in life and maneuver around that if he wants to go to college but just because you apologised doesn't mean he's going to forgive you on the spot, that kind of thing takes years, and when he finally gets there he's going to find out you didn't really mean your apology and decided to cut him out of your life assurance and will, putting you back at square one. If you're happy to never have a relationship with your son, go ahead. But just as much as his actions have consequences, so do yours.", "Yta. Your a bad parent.", "YWNBTA.  But hoo boy this one hits home for me.  \n   \nYour son is trying to communicate that he wants to do something with his life but doesnt feel very well set up.  Expecting you to fix it retroactively isnt productive, but maybe you can help him figure out how to get his fafsa done and get started in school.  I know its hard but the 30,000ft view of this with emotion removed show a kid trying to figure out what to do with himself.  Obviously his anger at you is misguided.  But its not permanent if you dont want it to be.", "ESH.\n\nThere are quite a few missing missing reasons. Kids don’t usually cut off their parents for nothing. \n\nAt the same time a child can’t cut off their parent and expect their money too.", "Yes you'd be an asshole", "Posts like this make me thankful for my parents that didn’t just throw me to the wolves the second I turned 18. You’re a bad person and an even worse mother", "YTA, gee can't imagine why you don't have a good relationship with your son. You realize as a parent it's your job to nurture the relationship, especially during the difficult teen years?", "Your son is who you raised him to be. YTA.", "YTA. Children don't cut off their parents for no reason. In my part of the world, parents also don't stop providing for their children as soon as they turn 18. Being a parent is a lifelong task. That does not mean spoiling your children, but I can think of very few scenarios where you would cut them off from education and healthcare. From your post, you seem vindictive and like you want to punish your son.", "This is going to be an unpopular take but I don't think you should do this. A) He's your son, even if he's being a little prick. Presumably you love him no matter what. B) It doesn't give you anything but petty revenge which probably won't sit well with you in the long run. C) **Upon your death, his relationship with his siblings will be ruined bc he will expect them to share regardless of your wishes. They won't thank you for putting them in that position.**", "As some one on the other end of this deal (the child) I feel like there is a lot more that you are at fault for that you are admitting. HOWEVER, I do advise that you edit your insurance and will. I have been NC from all of my biological family for 10+ years and I will NEVER accept money at any point in my life were someone to show up at my door saying that they had died and left stuff to me. And I would really hope that they got the message long before they died that I wanted nothing to do with them and just leave me out of it altogether and not pop up later in my life through one final act of trueness of having me hunted down for a piss pot of money at their death. I am neither entitled to money they leave when they die because it will have been years since I had anything to do with them, and neither would I want to.", "YTA- really hard to say without knowing the efforts you have made to connect with him, especially now that he’s an adult. Most teenagers are assholes by default. Sounds like yours excelled at it. Maybe he still is and always will be. But have you ever called him and asked if you could take him to dinner and talk? Are you in any position now to help him with anything besides your go talk to a recruiter advise? If community college was $1500 for the semester would you be able to help him out? You don’t owe him, but you are his Mom still whether either of you like it or not.", ">Our relationship prior to him moving out was alao strained. As a parent, I hope I am not the only one to say my son and I just did not get along and could never seem to connect as he got older and got worse the older he got.\n\n>I Informed him that I had exhausted it and that he is more than welcome to speak to a recruiter.\n\n>I did the best I could as a parent and I know I would never win mother of the year.\n\n>My daughter and oldest son never really showed interest in college, nor were my sons grades of the best\n\nYou are leaving out so many details and you seem like a horrendous parent.\n\nYTA", "YTA and just repeatedly telling him to see a recruiter is extra fucked up.", "YTA. A bad parent who had kids too young and kept having them despite not being able to afford them. Then you don’t care about their needs beyond the bare necessities. No wonder he doesn’t want to talk to you", "ESH.   It would be a petty tit-for-tat where you should be the bigger person.  You have the right to allocate your benefits and estate however you wish, but I don't think it is right to exclude your son.\n\nWould the recruiter have divulged your personal records to your son?  I would find that very concerning if they did.  \n\nThat said, you screwed up and while your son is not entitled to you paying for his college education, I can see why he is upset that benefit was wasted.  His way of handling his disappointment by going NC is being an AH, but I also think severing things on your side would also be acting as an AH.", "You would BTA. Good grief. You’ve admitted you gave him little or nothing through his life so far. His grievances against you may or may not be exaggerated but clearly he has some genuine reason to resent you. I would wonder, for example, why you had multiple children when you were impoverished and unmarried. If you have anything at all to leave him after your death or even now, it shouldn’t be conditional. If you don’t love your own child regardless of how he feels about you, then you are something far worse than an AH.", "While, I personally feel NTA, I feel we are missing significant aspects to this story that could open the door to good-faith arguments in the other direction. The fact he is so hung up on a single aspect leads me to believe there was a prior agreement in place regarding his education that he planned on.", "You remind me a lot of my mom. She came from no money. Worked hard as a single mom to provide, but that was it. No involvement with my personal life, though she was somewhat supportive. She never tried to help me get a job or driver license. Just the constant reminder that I need to be out of the house when I was 18 because that’s what she did.\n\nHere we are two decades later, and it’s still the same picture. She works, but now has no one to bring home money to. It’s too late to fix old wounds, as I’m not interested in going back to the past. But the hurt is still there, and is what compels me to be a better parent than she was. \n\nMoney and careers don’t matter if your kids resent you for them, especially if you can’t understand where the root of the problem lies. (it’s definitely not because of any of your children)\n\nAs someone who hurt like your son, but never told her how I felt, YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am a 43F currently serving in the Army for over 18years. I have three children 25F, 23M, 17M. Over the past few years my 23m son has been genuinely upset that I will not transfer my GI BILL to him. Those unfamiliar with the military, service members are able to transfer their education benefits to their spouse or children after serving a certain amount of time. However, I accidentally exhausted my GI BILL.  My daughter and oldest son never really showed interest in college, nor were my sons grades of the best.  Once my son moved out after HS our communication was minimal. Our relationship prior to him moving out was alao strained. As a parent, I hope I am not the only one to say my son and I just did not get along and could never seem to connect as he got older and got worse the older he got. About two years ago of him going no contact he messeged me, not to ask how we were doing or anything, but straight to the point that its my fault that he no longer qualifies for grants due to our incomes combined and why I did not transfer my GI BILL to him. I Informed him that I had exhausted it and that he is more than welcome to speak to a recruiter.  He then said I should have set 50-100 aside each month to pay for his college. At this point I call him entitled and told him I don't owe him anything once he moved out of my household.  (Summerized conversation) We go no contact again for a little over a year and recently another messege straight to the point asking how I exhausted my GI BILL, again told him he can go see a recruiter about it, but I also explained it wasn't intentional, and was unaware that when you take one class they doc you a full semester. Non,the less this conversation still ended on that I should be responsible for his college.    Let it be clear, before I joined the army I was a single parent having my first child at 17, living in poverty making less that 11k a year. I joined the army at 25, paying for college tuition out of pocket was never an option. I did the best I could as a parent and I know I would never win mother of the year. In both conversation I did apologize for the mistakes I made along the way. As, it's clear they bother him, but this conversation ended with him stating he does not view me as his mother and blocked me on everything. He made it clear to his sister that he does not view me as his mother and I am nothing more than an egg donor. \n\n It is time for me to update my life insurance and do a will and I am considering excluding him. WIBTAH?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA for not planning to pay for any of your kids' college in the first place. GI Bill is irrelevant, you should have been saving out of pocket. That's the only thing that really stood out to me in your post, that you think it's perfectly acceptable for a parent with a good job to not save for college. Your son is correct that per FAFSA, you have screwed him.", "NTA but why were you even using your GI bill instead of Tuition Assistance for a single class a term?", "Depends. Do you love him no matter what and want the best for him? Or could you take it or leave it?", "NTA. HE MADE HIS CHOICE VERY CLEAR.", "Career Army (30 plus years) here. The GI Bill was meant for YOU and also gave you the option to transfer it to family if you chose to. You certainly are not obligated to.\n\nBe careful with making rash decisions on your estate, though you certainly could make any decisions you wish. But once you’re gone, the survivors are the ones that have to deal with the fallout for the rest of their lives and it could be terrible for them because you wanted to punish bad behavior of your son.\n\nIf you decide to do that please consider a handwritten letter explaining why you made that choice.\n\nThe healthcare is also your decision. There is no law that requires coverage of adult children unless, of course, it was agreed to in a legal court or something. If it costs you more including him on the policy, then YES totally cut him off. If not, that is up to you but I personally feel it’s justified based on his behavior towards you. Again, that is your decision.\n\nGood luck, OP.", "Recently retired military here. \n\nNTA. I'm sorry you're going through this with your son. I know it's painful. He may or may not mature into a place of understanding how life works. \n\nChildren are not OWED the financial cost of college. Full stop.\n\nBut,  I'll continue. You know full well the difficulties of life, you had to buckle the 'f' up, pull up the big girl pants and better your circumstances.  If you had been educated about the rules of Bill money, you may have transferred benefit... but that isn't OWED. if parents find themselves in a position to help their kids.... great. Life doesn't always work out that way. I'm using ALL my money for my own degrees. My son had to join to get his own money. Life is tough, it doesn't doesn't care about your feelings or hardships. Life just is,  and you have 2 choices as a person. At some point,  you have to learn to survive and thrive on your own as a grown-up. If he let's this turn him bitter, his demise or stifled achievement is his own doing.", "NTA. \n\nI’m so sick of Reddit immediately assuming that anytime there’s a strained relationship between a parent and an adult child, it must be the parent’s fault. It is not a parent’s job to get walked all over or constantly placate a toxic person, and sometimes their kids grow up to be assholes or entitled despite the parent’s best efforts. \n\nThis kid is very clearly only interested in their mom’s money, and the mom was well within her rights to use her GI bill to educate herself in order to advance in the army and better be able to support her family.", "If you promised or told him you'd help. And now aren't yeah you're a dick if not then no you're not. But like... Have you actually tried to help him with the education. From your post it sounds like since the relationship was strained you just checked out and didn't really try to support him or his education..\n\nTo many unknowns to give a verdict.", "NTA I’m guessing what actually happened is he hangs out/is friends with people with well off parents who paid their kids colleges. He should know better as they are still a small amount of people overall (most college students still need financial aid and some loans to go to school). \n\nMy mom was a single mother and yes a lot of my well off friends graduated from college debt free while I had student loans - but I understood her situation and it was never held against her. I find this new mentality of “you had your children and now you must pay for everything for them, even as adults” bewildering. You can only do what you are able to. At least your other two children understand that.", "NTA. It is not a parent's obligation to pay for college. It's nice if they can, if they want to, if they choose to. My parents couldn't, so I went to community college and worked full time, and it took a lot longer for me to get a degree than it did other people but I also was gaining work and life experience. When other kids were in dorms I was in my own apartment. I was learning to budget and pay bills while a lot of my friends were using their parents' credit card. Sorry your son blames you for his life not being what he wishes it were. I hope he grows up one day.", "NTA\n\nI have no idea why he thinks he’s entitled to your GI Bill benefits. He isn’t the one that earned them. Having your parents take care of your post-secondary education for you is a luxury.", "YWNBTA\n\nYou can exhaust your GI Bill many ways - like OP described, or after 10 years of inactive use, it's just *poof* disappears. She served and did her time, the GI Bill being one of the benefits she signed up for. You *can* certainly transfer any remaining funds to a child, but that doesn't mean they're entitled to it. \n\nHe chose to go LC or NC. The decision to leave him out of the will seems like an easy one.", "You’re still AD? Why TF did you use your GI bill & not TA??? \n\nNTA for cutting him off, but something is off on this. And yes, I spent 24 years on AD & my husband spent 30. My son is going to college on my CH35. I’m quite familiar with the GI Bill & the requirements.", "NTA\n\nYep, I have three sons myself and I can appreciate the difficulty you face as they get older and make poor choices and then want to pass the responsibility on to you.  My oldest did finally get his head out of his ass and the younger two are doing well, still plenty of ugly arguments and me putting the oldest through a wall when he was a 17 and caught with drugs. \n\nToday years later all the kids almost daily call me and are doing well. At one point I did have to cut all ties with the oldest and wait for him to repair the bridge. \n\nI would agree with you that you should remove him from your policy and not tell him, or his siblings. Honestly, it's not their business. If the situation resolves itself down the road it can again be changed but it's important to reward good and condemn bad. \n\nI myself am a combat vet of multiple engagements and theaters. I recall taking my mother off the policy and switching it to my sister. My mother blew a gasket! She demanded I change it back and when I confronted her about her poor decision-making and terrible money management she doubled down and these are the very reasons I should give her the money. I told her my sister would make sure she was cared for and not have a good time at the expense of my life.  That really the point here, you don't want the kids to spend the money on fun, you have the insurance to provide for them if you die.  Think how your son would spend that money and you will likely come to the same conclusion.", "AH or not, You need r/legaladvice not this sub. For the record, NTA. He doesn’t get to dictate /spend your money.", "A lawyer asked me when I was making my will, is there anyone who would feel left out that was not included in my list. I thought of my brother, whom I have no relationship with. \n\nSo I left a very small amount to him just as a token he was on my mind. \n\nYou would not be the AH if you choose to exclude him. However, even with a strained relationship, is that something you want to leave beyond you? That it would be your last and final word?\n\nJust think about what you want and how you would want your last conversation to go.", "Don't exclude him from the will. Instead, name him specifically and leave him like $20 or something. Harder to dispute.", "Is it possible to have his portion go into a trust that he cannot touch until he turns 50?  Perhaps by then, he will have matured or have children and put the money towards their college fund.  NTA btw.", ">I accidentally exhausted my GI BILL.\n\nNTA   \n\n\nbut... howTF do you not know what the GIBill entitles you to?   \nHowTF do you not know what other options are available to you for college \\*WHILE YOU ARE STILL ON ACTIVE DUTY\\*??", "NTA\n\nHe’s 23 and asking for college money?? Give me a break. He’s a full-fledged adult now. His mommy and daddy college assistance opportunities have since expired. \n\nAnd no reason to keep a son in your will that wants nothing but money from you.", "Understand you being upset. But would include all 3. But don't tell him. He sounds like a horses ass but in the end he is your son. NAH", "NTA.\n\nI would like to remind commenters that this was not “AITA for questionable child rearing.” OP was asking if they should/should not exclude him. \n\nThe way he has been towards you, i would exclude him. He can’t have his cake and eat it too. Rather not have a child benefit from my death when they hate me. Thats cruel.", "NTA. If you’re disowned you’re not family or even friends so he gets nothing. \n\nLeave him $100 in the will, this way he can’t sue and argue that he was left out by mistake.", "Why would you leave anything to a person that has disowned you?  \n\nBut make sure it is clearly stated in your will that you are deliberately leaving him out so that he cannot come back later and try to claim part of your estate.", "NTA\nI’m sorry your son sucks.", "NTA\n\nHe's a year off from being a non-traditional student, and not subject to your income requirements.\n\nHell, when he applies, he can fill out that he is 24, does not live with you, and would get no help with loans and depending on the school he could still get loans.", "NTA the military does a really bad job communicating the hoops you have to jump thru to get certain benefits, it was my SIL, who joined a military wives page and read it voraciously, that made sure they got what they were supposed to get. Not your fault at all. Also, you are entitled to your own educational benefit. It sucks being poor, you did what you could to get out of it. Leave him $3 to buy some eggs.", "NTA. He _is_ acting entitled by accusing you of him not having it easier.", "NTA. It sounds like he experienced some trauma whether that was intentional or not. He needs therapy. You might benefit from therapy too. I'm guessing he sees a lot of his friends having their parents cover their education and he may have assumed that was therefore your responsibility. You do not owe him your GI Bill benefits as those were originally intended for you to begin with. He's ultimately responsible for his own financial decisions.\n\nHe's drawing a line and a boundary and it's incredibly fair for you to do the same. Leave a note him explaining everything if the unfortunate does end up happening. Then he can at least be aware that he brought this on himself.", "NTA- He's made his choice then. But the future isn't written in stone. But for now, there's nothing wrong with helping your son live by the decisions he makes.", "NTA \n\nHaving a parent pay for your education is a very big privilege that not everyone is entitled to or can have. I wouldn't say it's normal (am UK so maybe biased) but I only know of one person personally that has had their degree paid for by parents. \n\nI'd reinforce the disownership - me bring petty", "NTA - he cut you out, that’s what comes with it. I went NC with my parents 5 years before they passed away and guess what? Zero help, zero contact, nothing. That’s how it works. He doesn’t just get to reach back out when it’s convenient for him.", "NTA and if he’s no contact and has said these things nobody could blame you for excluding him! I will say I would talk to your other children at some point and give them a heads up! In the event of something happening you won’t be here and so he will go after them and what they receive trying to claim his part! Clearly he won’t have any claim but it will still probably be a headache down the road that they could know about before hand", "NTA \n\nI don’t care what these people say you did the best you could and provided a better life than what they would have had if you didn’t enter the military. He can’t be mad at you for using the GI bill for yourself and if he is he’s entitled. Don’t allow him to have any of your life insurance; he’ll misuse the money and demand more from his siblings.", "I disagree that parents have a duty/responsibility to pay for a child’s college education. That’s pure BS.  I don’t know how that even got started.  If they want further education, it is THEIR responsibility, not the parents.  Kids can work for it or forget it.", "NTA. No child is entitled your money or your earned benefits to pay for college, a wedding, a house, a vacation, insert other demand here.", "Sounds like he’s upset that he has to make his own way through school and doesn’t want thousands of dollars in student loan debt. Well thems the breaks - he’s figuring out life sucks - but it all sounds much deeper than a GI BILL.", "NTA what an entitled piece of work. Imagine thinking you are entitled to anything that was earned by someone else. I liked the \"call the recruiter\" line though lmfao", "NTA\n\nHe cut you out of his life, it is what it is now.", "Don’t take him out of the will, he can contest it. Give him $1 to show that you did this on purpose. That way it’s harder to contest it", "NTA. Cut him out/off. I'm saying this as a 43 year old marine vet... I agree with you. Your boy should go see a recruiter. Maybe he will grow up then.", "   As a veteran, 1st I'd like to thank you for your service. HOOAH!!!\n\n   In a nutshell, NTA. He chose to move out and go no contact. Looks like he chose to separate himself from his family. Respond accordingly.\n\n   You don't need to apologize. You found a way to provide for your children. The military isn't always the safest way to do it. But you did it. Being a military child, he still has plenty of options to find support for schooling without joining. He hasn't looked hard enough. And he does sound a little entitled expecting things. Pat him on the shoulder and welcome him to the real world. No one's gonna wipe his chin or his butt anymore.", "You don't owe someone an education. YWNBTA for removing a person from your life insurance/will. He wants nothing to do with you unless it's money related.", "I don't understand why this is even a point of contention....for transferring benefits, you have to have a minimum of 4 years left on your contract (or after signing a 4 year contract 30 days to submit transfer), which i'm only assuming that you're wanting to do 20 years and retire, and your child is only eligible from 18-26...\n\nJust tell him he's about to age out of eligibility.....NTA", "NTA You have every right to cut him out if he's dissowned you. \n\nYou said that he couldn't get grants because of his \"parents\" combined income. So what is his father doing in all of this?", "So your son wants nothing to do with you? Fine then. If that’s how he feels, than anything that was going to him in that will has nothing to do with him either.\n\nGo ahead and exclude him. You’ll be doing your two other kids a favor. NTA.", "Firm NTA.  He is entitled to nothing from you at this point.  Even if he were in your life he is not entitled to your money or benefits.  Him not being in your life makes it even more ridiculous", "YWNBTA.\n\nIf your son wants free college, he can either join himself, or he can follow Plan B here: He can [establish residency in California, wait until you are retired with \\*any\\* percent disability, and he can subsist on poverty wages to get his tuition zeroed out](https://www.calvet.ca.gov/VetServices/Pages/College-Fee-Waiver.aspx).  \n\n\nOr he can learn German and go study there. Or go to many other European countries for zero tuition. It's not as lucrative as the Post-9/11 GI Bill is, but there's a lower risk of having to kill someone or be killed.", "Yeah, people don't cut their parents out for no reason. Start digging and you usually uncover the rot.", ">\\- \"However, I accidentally exhausted my GI BILL.\" WTF How? (Well, she gave some sort of explanation later in the post.)  \n>  \n>\\- \"Once my son moved out after HS our communication was minimal.\" Did something happen?  \n>  \n>\\- \"Our relationship prior to him moving out was alao strained. As a parent, I hope I am not the only one to say my son and I just did not get along and could never seem to connect as he got older and got worse the older he got.\" What happened between them? It is awfully generic and vague.  \n>  \n>\\- \"that its my fault that he no longer qualifies for grants due to our incomes combined\" Not sure how it is possible with him out of the house.  \n>  \n>\\- \"At this point I call him entitled and told him I don't owe him anything once he moved out of my household.\" Not a missing missing reason, but I do not like her tone.  \n>  \n>\\- \"and I know I would never win mother of the year.\" Why?  \n>  \n>\\- \"In both conversation I did apologize for the mistakes I made along the way.\" Which ones?\n\nI counted 6, plus an AH hint.", "Gotta be. OP is a military parent, I could write the script myself. Authoritarian, inflexible, no two-way conversation...", "Even so the son cannot expect to receive any financial benefit from a parent they cut off, justified or not.", "She admits to not being mother of the year.  There is definitely more here…", "Probably, but it still doesn’t mean that the song is entitled to his parent’s GI Bill. It never occurred to me to be entitled to my dad’s and he used it (as it seems OP used hers) for his own schooling, as actually intended. It’s just a nice perk if the service member doesn’t use theirs that it can be transferred to children. My brother later chose to go to a service academy precisely because he didn’t want to pay for college. He later used his partial GI bill to get his masters. \n\nWhatever the reasons they are estranged, it now is what it is. The kids had no interest other than what he can monetarily get. She should take him off.", "Our relationship has always been strained. As I mentioned we never really got along. Not abusive, he just never agreed with my parenting techniques. I am a GEN X, so my patenting style was more authoritarian, not the new parenting techniques that are used today, sit down talk it out and thats what he expected. As he got older he disagreed with every aspect of my parenting. Now, in these conversations we had recently I apologized for some of the things and tried to explain that having children at a young age I was a child raising a child and learning as I went. I made mistakes and I was just trying to be a better mother than my mother, but I also mentioned he needed to  he has to accept responsibility for his actions as he was not a poster child. It is hard to explain his personality and I will not bash my son as he is still my son but he has been one that feels as if everyone owes him at a young age, and TBH I believe this is where most of our conflict arises.", "Yup, whole lotta stuff left out, obviously on purpose.", "100%. OP, I’m sorry to say but you didn’t provide enough reasons for me to feel like this situation is an exception to the rule. YTA already, prior to the will changing. Google “missing missing reasons” if you don’t understand what that means, and read up.\n\nDo what you want with your will, certainly you don’t *owe* your child any material things at this point so it’s understandable for you to make changes according to the relationship you have (or do not have) with him. But your view that your son is the AH for his treatment of you… Doesn’t sound like it.", "This and make sure to include in the will that he is intentionally excluded and follow legal advice to make sure it is done properly so he can’t contest your will.  Most likely you will need a trust.", "i just want to let people know here that in the US until your child marries for the first time, regardless of age even at 25 for scholarship and financial aid purposes they are considered your dependent. and WILL NOT qualify if you have a household income over a certain level.\n\neven if they do not live with you.", "I hate that this is the top comment when this is about so much more than college money. OP has been a shit parent to the point that her child would disown her (not a light decision to make) and OP even acknowledges she could be doing better to care for her child and just isn't. These aren't new development. This is years of OP being a terrible parent and then saying \"oh well we just don't get along\"", "True, but there are quite a few missing missing reasons in this post:\n\n\\- \"However, I accidentally exhausted my GI BILL.\" WTF How? (Well, she gave some sort of explanation later in the post.)\n\n\\- \"Once my son moved out after HS our communication was minimal.\" Did something happen?\n\n\\- \"Our relationship prior to him moving out was alao strained. As a parent, I hope I am not the only one to say my son and I just did not get along and could never seem to connect as he got older and got worse the older he got.\" What happened between them? It is awfully generic and vague.\n\n\\- \"that its my fault that he no longer qualifies for grants due to our incomes combined\" Not sure how it is possible with him out of the house.\n\n\\- \"At this point I call him entitled and told him I don't owe him anything once he moved out of my household.\" Not a missing missing reason, but I do not like her tone.\n\n\\- \"and I know I would never win mother of the year.\" Why?\n\n\\- \"In both conversation I did apologize for the mistakes I made along the way.\" Which ones?\n\nStill, he cannot have it both ways.", "Go ahead and cut him out but I'm gonna say ESH, it sounds like it was a lifetime of OP not being their for her children so I don't exactly see OP as faultless here", "[removed]", "Also? Isn’t the GI bill mainly supposed to be for the actual person serving their country? I know you can transfer it to your kid but you don’t have to it’s not a requirement or for most an expectation it’s their to help service members get a foothold in their civilian life at least that was my understanding.\n\nNTA and I’m sorry your middle child turned out to be a selfish entitled brat. He left and basically went bo contact. You don’t cut someone out of your life and then turn to them for a handout.\n\nNTA", "Better yet, put everything into a trust so that it can't be contested, make your other children power of attorney over everything if something were to happen and so on.. my dad did this for my grandpa and thank goodness he did before he passed, because my dad's sisters are trying to force their hand on who gets to take grandpa. \n\nThey didn't care 3 years ago or enough to visit when less than an hour away, but when my dad passes, he matters all of a sudden.  People are vultures.  My one aunt didn't even say goodbye to her own father who is turning 97 this year before she left.. but she is the first one to go for possessions.  Disgusting", "Exactly. He can join the military himself and earn his own GI Bill like OP *earned* hers.", "genuinely asking, how could you qualify for a scholarship if you didn’t do well in high school? not saying he’s in the right at all, just curious.", "100% agree. \n\nThe kid is 23. As soon as he turns 25, he should be able to qualify for financial aid without his parents income counting.", "\"my mommy was awful to me, do the same to your kids\"", "and let's be real here, if he hasn't figured it out at the age he is currently, then it would be a serious waste of tax payer dollars to give him money to go to school. he likely would not use it for what it was intended because he could go to school, buti bet his credit isn't good enough for a loan.", "Seriously, love the \"I'm not responsible for you now that you aren't under my roof\" take. So many people have kids just to act like their responsibility to a life they brought into this world magically ends once they are legally an adult. It's one thing to want your kids to be independent, its a whole other thing to abandon your responsibility to them all together because \"they are grown now\".", "Missed point. That was in my teens until I joined the army. I was trying to give a back story on the fact that I don't come from money.  But okkkk", "Right? Like why use the GI Bill when active, when all branches have TA that covers classes 100%. At least it was like that in my years I served between 04 and 17.", "Yeah, one of their comments said college isn't a necessity but they provided the food, shelter, medicine, the general bare minimums a parent has to provide. College is certainly a path not everyone needs to take, but if the son regulalrly expressed a wish for college and OP did absolutely nothing for it, not even to help the son find a way for college beyond just saying \"find a recruiter\", then that sucks.\n\nThe son may be entitled, but OP's parental responsibilities didn't end the second the son turned 18, although legally that could be the case. If the OP made no effort to help, no effort to support the son in any way to pursue higher education, then the OP is also an asshole. ESH based on the information given in the post and OP's comments.", "He also does not qualify for financial aid due to the parents earning too much from what I am reading so then not helping with education costs actually makes education even more expensive for their child.", "OP YTA \n\nI get the sense that OP has known for a long time that he couldn’t get aid and she chose not to put anything aside. \n\nI also get the sense that OP has been pushing him to join the military for a long time and not trying to help him out at all.", "Wow. No wonder kids are so entitled nowadays. No, 23-24 year old adults are not entitled to parents paying for their education, just like 18 year olds are not entitled to have their parents pay for their education. \n\nYour argument that people should feel awful for having children when money is the only primary concern is ridiculous. Look around. There are so many happy, healthy families that aren't even close to having a pot of money.\n\nI'm a military brat. I was raised by an authorized father and mother. There were expectations and rules. I loved my parents until the day they died. My three sisters and I never had any expectations of my parents paying for college. Yet, somehow, all of us went.\n\nI don't think for one minute OP is a terrible parent! Military life is so very different from civilian life. There are rules for every member of the family because if little Susie causes an issue, Dads is in the Co's office answering for it. Possibly, severely punished. \n\nI really think empathy and understanding are severely lacking in your judgment of OP. You don't know the circumstances of OP's life and her choices for having children. I didn't see OP making excuses about having her children, nor should she. \n\nSetting aside money for higher education is a luxury. Not a right. Some people just don't have it. Especially, rank and file military. This doesn't mean she is neglectful. The children likely had all the essential needs provided by OP. That's a good mother.\n\nOP has a good relationship with her other children, presumably. I think her middle son is just an immature, selfish, whining, entitled brat that has hurt his mother deeply. As a proud military brat, he needs to toughen up and get to work.\n\nOP, you are NTA. He needs to grow up and stop blaming you for all his problems.", "I also love how she mentioned that she apologizes for her parenting \"mistakes\" when she talks to him on the phone. \"I'm sorry for how I treated you... I mean I'm going to still keep treating you bad and my behavior won't change but... I'm sorry.\"", "When I was in my early 20s, I absolutely agree. Did I work my way up out of a welfare system and was able to provide them a decent life yes! We weren't rich, but I was able to provide. You act as if the majority of parents can afford to pay for their children's college. Sally Mae would be outta business if that was the fact.", "You know what else children NEED? Love, respect, ENGAGEMENT, quality time, role modeling...sounds like OP met the necessities for *survival* not healthy development.", "OP really tried to justify it because he played too much video games, his grades were falling, and his hygiene was unkempt. That child sounds depressed ma'am.", "When I would fail a class under TA, I would use my GI BILL until the money was paid back for TA. This was a repeat cycle until I got my degree, and I'm currently in NC.", "She joined the army *to get her children out of poverty*\n\n\n\nSo happy for you and your entitled life to think that joining the military isn't out of obligation and desperation", "He doesn’t want a relationship, but he wants the benefits from *her* job. The GI Bill is for OP, and OP can decide what to do with it. OP’s son is acting like he is entitled to that money, and he’s mad that *she* used *her* benefit.\n\nWe don’t know the whole story. OP has discussed her parenting style, but it seems like a normal one to me as that’s how my parents parented me (they’re gen x). If I didn’t do something, my parents took away what I enjoyed as punishment. Just like OP took away what son enjoyed when he wouldn’t do something. At the end of the day, the whole gentle parenting is a crapshoot. It sometimes works while it sometimes creates kids that think they can get away with anything because there are no negative consequences to their actions. However, we don’t know all details of how OP actually parented, especially since it seems the other two kids are perfectly fine. OP could have tried communicating, but son just did not listen so OP resorted to taking away games. More often than not, parents do try to communicate in some way. Are they the most effective? No, but they do try and talk about it.\n\nAt the same time, we don’t know anything about the son and his actual attitude. Seems like he didn’t want to do anything and fought and pushed back every chance he got growing up. However, we don’t know all details. We’re having to fill in gaps with assumptions based on the context provided.\n\nIf he didn’t want anything to do with OP, he wouldn’t be trying to get her GI bill money or say she should pay for his college. You can’t barely speak with someone just to contact them when you want money. It doesn’t work like that. He wasn’t trying to better the relationship nor was OP.  Like it’s always said in this thread, there are consequences to our actions. OP obviously did something to son to cause a rift and they’re seeing the consequence, just like son is seeing consequence of going NC.\n\nBut, at the end of the day, whether the GI Bill could be used or not, OP doesn’t have to give those benefits away. \n\nI’m going with NTA because if he goes NC, he isn’t entitled to anything. However, OP, you do need to sit down and have a frank discussion with your kid. Like you said, he’s 23 and you’re older and reflecting on the past and your mistakes and don’t want to be like your mom. You’ve gotta figure what is going on and try to mend your relationship with your son. It’s never too late to try.", "First I didn't Block him. He blocked me when he realized there's really no benfits left. I used the GI BILL, as it is my entitlement when I joined the army to get my degree. I joined the army to better myself and get out of welfare. And I'm real confused how I'm labeled as such a shitty parent because I acknowledge my faults and apologized.", "Bare necessities is food, clothing, and shelter. They had that and then some. College is not a necessity and I haven't had a kid 17 years.", "Right? It will cost her nothing to include him, but she wants to “teach him a lesson” from the grave. Gross.", "So shortly after he moved out after HS we did set up FASFA. At that point he was entitled to some benefits wasn't alont but he still could attend atleast a community College. Fast forward few years, I've got promoted he got a job at that time and no longer qualified and blamed me on why he couldn't attend.", "I would fail a class TA. Then use my gi bill while that was being paid off. I hate school with a passion and only got this degree for promotion. It wasn't until I went to enroll in a class and it stated I had no funds. This is where I learned about the 1 class/semester eatating up all the hours. So, it was an accident. I did intend to give each kid a portion, there 2 so you know it doesn't pay the entire 4 years.", "Not to mention the fact that you’re not eligible at 18+ years in to transfer it to him anyway. So there’s that; even if you hadn’t exhausted it.", "Oh look another shit parent", "Horrible advice.   Listen if you cut him out when you pass away and the others are left in the will not only was your relationship ruined with your son, but now you have strained their relationship as siblings. You basically are dropping a bomb and when you die, it’s gonna go off and destroy for generations.", "Thank you for that insight. I have been so torn over this. It is time for me to update my dd93 and SGLI. I find it so silly that this generation is so quick to cut ties with family members if they don't get what they want. It baffles me, cus it's not like we are upper class and the expectations was always there. Literally poor, and then enlisted. So, we got by. I don't understand this mindset. I truly appreciate your feed back. Glad to hear you reconciled with your children.", "She's asking if she's morally in the right for excluding her son from the will. Legally, it's her money so she can do whatever she wants with it. Since she's drawing up a will I imagine she already has sought legal counsel about it.", "Yes so she can continue her tradition of being a shitty parent. I'm sure the son won't even be surprised by his mother's asshole behavior after death.", "Even if your treatment of then led to them hating you", "FAFSA requires parental income in all applications until you are 24 years old. Their income DOES affect his ability to get school loans, regardless of their living with him or supporting him.   \n\n\nSo yes, this hugely affects his ability to get loans and go to school. And let's not even get started on pulling himself up by his bootstraps and working full time while attempting to afford school and cost of living.", "He did mention the student loans several times. I said there's scholarships, community College,and he can also join the army. Cus what I have left out of this post is that he does not work has not held a job more than 6 months and his GF since high school takes care of him.", "I disagree, my mother cut contact with my grandmother because my mother is sociopathic. My GM never actually did anything to her. My mother acts like she’s a victim, though. Sometimes people believe her because she is actually pretty charming and convincing. I could imagine the comments she’d receive if she posted on Reddit. Probably a lot of people just encouraging her more.", "Sometimes they do", "Plus he refers to her as eggdonor, that doesn't happen lightly either", "You didn't read? He cut her off because he felt entitled to her gi bill and didn't get it.", "Per reddit people often cut their parents out for what I would consider very minor things.  Regardless of reasons it is OP’s money to do with as he pleases.  The “child” is an adult and is entitled to nothing more from his dad.  The son chose to cut the dad out for whatever reason he may have had.  The dad has no obligation to leave him anything (and no obligation to leave him a anything even if they did have a relationship).  You aren’t entitled to your parents’ money period.", ">\\- \"that its my fault that he no longer qualifies for grants due to our incomes combined\" Not sure how it is possible with him out of the house.\n\nUntil you're 25 they want your parent's income information for grant purposes no matter if you live with them, talk to them or even know them. I couldn't even apply because my father had been estranged for over a decade and I couldn't get his info (plus my mother made too much anyway for me to hope for a grant), and I was living with roommates away from family at the time.  \n\n\nOur college financial application processes suck in this country.", "Re: qualifying for grants, your parent’s income is counted so long as you’re a dependent student.  You can become independent by getting married, getting an undergrad degree or turning (I think) 25. There might be other possibilities but it is entirely possible her income counts for him, notwithstanding she’s not actually financially supporting him.", "My dad was military and him being gone a lot made our relationship strained. It still is to this day for a number of reasons.", "I wonder how often OP was at home too for her kids. Did they have routine? Did they have security? Did they have a parent they knew they could call if they were in trouble?", "Yep, not is there a loan/grant you can apply for? But 'speak to a recruiter' OP wants them to join the military\n\nAlso, exhausted the GI Bill accidentally the first time but also the second?", "Both my parents were Marines, this generalization is ignorant and not true at all.", "if your parents knew they would be making enough income to disqualify y’all from financial aid and scholarships they knew they were making enough money to start a college fund and chose not to.\n\nregardless of if you are okay with it or not your parents did make financial decisions they knew would harm their children.", "> I am a GEN X, so my patenting style was more authoritarian\n\nDude I'm Gen X. Authoritarian isn't everyone's style. It's probably more that it's what you learned to do.", "That’s such a damn cop-out. “I’m Gen X!” So? So am I. So is my husband. We aren’t more authoritarian because of our generation or because my husband was in the military.\n\nYou sound just like my husband’s mother. If she wasn’t dead, I’d assume you were her. She also told him that he was responsible as a child for part of her parenting because if he would have been a better kid, she wouldn’t have had to be the way she was (although it was way worse than that). You are just not a good parent or person. Maybe one of these days you will grow up and actually take full and complete responsibility for your actions instead of putting some of the blame on a child. \n\nYTA", "“Not abusive, but”.\n\nNo, you were abusive. If your son disowned you and had a “strained relationship” with you over your “authoritarian Gen X parenting style” it is because you were a crappy, abusive parent to begin with. You’ve made that clear from your post and responses so far.\n\nAnd you trying to excuse your crappy behavior because you were a *young parent*? Tough. That’s not your child’s problem.", "You’re blaming your kid for being a bad kid when you admit you were a crappy parent?", "You’re not Gen X if you’re 43.  I’m 46 and in that weird Gen X/Millennial age.  Don’t blame your age for your bad parenting.", "How do being Gen X and being an authoritarian parent go together? You're looking for excuses. You being an authoritarian parent seems to reflect your personality and not the year you were born.", "My mom doesn’t think she was a shitty, abusive mom either", "You're a massive asshole.", "How did you exhaust the GI Bill? Even setting aside a very small portion would have been immensely helpful for him as far as in State tuition, scholarships, etc. I can understand his frustration at your lifestyle being challenging and then no help.", "I’m GenX. I have two 19 year olds and an 18 year old. “Authoritarian GenX parent” isn’t anyone I know. Our Baby Boomer parents for sure, but you using GenX as an excuse is just wild to me.", "Nah. I’m gen X and have an 18 yo. I raised him with kindness and compassion, not authoritarian bullshit. By the time your son was born there was a plethora of parenting materials out there as well as parenting classes and even the internet. Being gen X has nothing to do with your parenting style.", "... you're not GenX, you're a Millenial or a Xennial if you really feel on the cusp. And even GenX moved past the dumb boomer bullshit of authoritarian. \n\nYTA for punishing him for being frustrated he can't go to school because of how FAFSA is. Considering how crippling student loans can be it's understandable. \n\nThe whole he wasn't a perfect kid is not a valid response, as you were the one failing him if failed to thrive. You may have been doing your best and it's not fair for him to entirely blame you sure. It's still on you as the parent to try and do what you can to advise and help. But here you are being petty trying to remove him from everything as how dare he be unhappy with your parenting?", "Oh so you're a bad parent.", "You lack emotional intelligence, and probably general intelligence, got it.", "lmfao what a lame excuse of a mother, he indeed got our of an egg donor, least he could do would get at least a benefit from such an ass", "Don’t feel like you need to justify your parenting to strangers. Especially strangers who have never experienced the military as a career. My husband and I have a combined 58 years of military and we’re also very strict parents. And yet our children (all 4 of them) are all very successful and loving adults that we are super close to! They call us both several times a week just to visit and they vacation with us as much as possible. We split our GI Bills amongst three of our kids and our 4th had his own. But we had also already had stable careers that we planned to use until we retired so college wasn’t a thing for us.", "Like the people who specifically leave 1 dollar to a relative", "OP nta\n\n\nThe son cannot have it both ways. And if he's not qualified for scholarships is because he's still using the home address as his place of residence. If he's already moved out he needs to change the address and then he might be considered for scholarships again.  Otherwise the sun can do the hard work and get a job so he can afford it himself..\n\n\nAs far as cutting him out of any benefits if she passes.\n\n Not only will she need a will but in this day and age having a video will with the lawyer in the background holds a lot more weight. This proves if she was of sound mind. \n And gives her a way to explain due to the fact that her son has gone no contact and cut her out of his life and considers her not his mother and  that he is not entitled to anything of hers when she dies", "It’s more common to leave a very small amount to prevent the will from being contested.", "FAFSA considers a student to be independent of their parents when:  they turn 24 OR\n• They are married. \n• They have dependents. \n• They are working toward a master’s or doctorate program during the award year. \n• They are a veteran or active duty member of the US Armed Forces.  \n• Since the time they turned 13, their parents were deceased, they were in foster care or they were a ward of the court.  \n• They have been emancipated or someone other than a parent or stepparent has been appointed their legal guardian.  \n• They are determined to be an unaccompanied youth who is homeless or at risk of becoming homeless.", "This isn’t true. I qualified for tons of aid because I did not live with my parents NOR did they claim me as a dependent on their taxes NOR was I on their insurance. If you have no financial ties to your parents and they do not claim you then financial aid follows suit.", "That totally depends on the scholarship.  I had a full, 4-year academic scholarship that had nothing to do with my parent's income.", "i agree with this. he is clearly bitter and acting like an a$$hole however if her parenting was not good, can you blame him? plus she serves the army i can understand how didn't get time and stuff, so tbh no one could be blamed. situations ar just fuckedup", "Seriously. Adults don't go no contact with their parents for no reason. The fact that her son moved out the second he legally could should let everyone know that OP has been an AH during her son's entire life.", "The icing is cutting him out of her will.", "Thank you! I was thinking the same thing.", "Oh yeah crystal clear OPs a shit mom that doesn’t care about her kid. Nothing in the world would keep me from talking to my kids for years.  Just saying she didn’t get along with her son? Gotta be fucking kidding me.", "Under a certain age, regardless of your housing status, FAFSA will still require your parental incomes for loan determinations. It is INCREDIBLY frustrating, since I lived on my own since I was 19 but still had to report my parents incomes.  \n\n\nEdit to add: FAFSA is 24 years old to exclude parental income.", "With the \"not qualifying for grants\" stuff- if hes in the US (which seems to be the case), there's a good chance he still has to report his parents income as it's required for any student under 24.\n\nThere's ways to file to get an exemption, but they aren't easy to get and I've heard of plenty of cases where people weren't able to get the exemption despite being estranged from their parents.\n\nIf they're still in contact but just don't talk much, then it's likely he is filing with her name on there. And honestly, I'm not convinced she's being fully open about the situation. Reading her comments she seems REALLY determined to downplay any potential fault she has here.", "i’m gonna paste a comment I made above just so people are aware how the US laws work around what is considered a dependent for university financial purposes.\n\nin the US until your child marries for the first time, regardless of age until 25, for scholarship and financial aid purposes they are considered your dependent. and WILL NOT qualify if you have a household income over a certain level.\n\neven if they do not live with you. \n\nregardless of family issues you should set your kids up for success the cut off for aids and grants and scholarships is 200,000. a household making 200,000 really should have been saving up for their children’s college knowing that their income would disqualify them from aid.\n\nmy child could never do anything to me where i would purposely choose to neglect their future success and set them up to fail, especially if i had the disposable income to do it.", "I could get financial aid even when I was moved out. Because I was too young. Despite being a legal adult and my parents not helping me. Untill this year. It fucked me over because I'm 25 and only just got an associates. All because I couldn't afford full time schooling.", "As the OP is 43 years old and has been active duty in the Army for 18 years (2 years short of retirement eligibility), there is nothing preventing the OP or any other service member from utilizing any remaining GI bill benefits once they retire from active service. While OP may have already received a degree while serving on active duty, there is nothing preventing her from continuing her education once she retires. The fact that the son feels he is entitled to any benefits that the OP earned is disheartening.", "I exhausted My gi bill to get my degree\n\nHe moved out with his GF to CO and would must touch base on holidays to say thank you because I sent money. \n\nI can't answer that as I still don't know even after talking to a therapist other that teenag  e years and personality conflicts and different views on how things should be done. \n\nHe doesn't qualify for government grants cus they include parent income until 24. \n\nAt that point in conversation he was telling me what I should have done and what I owe him. So I will keep that tone. \n\nNo parent wins mother of the year. We aren't peferct parents. We make mistakes and learn as we go. \n\nI was trying to do what my mother never did as accept that I wasn't perfect that I could have done things differently. I wasn't abusive, I didn't neglect them, I just could have been a more emotionally connected parent.", ">Still, he cannot have it both ways.\n\nSure he can. She sounds like a horrible mother. Keeping him in the will is the least she can do...when she dies in about 40 years.\n\nAlso, she now makes enough to send him to college, due to FAFSA, which she glossed over.", "I wouldn't remove him.  Try to think about what it was like when you were 25 and struggling to make it.  He could change in the future.  Where is the father?  Out of the picture I guess?  If you leave everything to his siblings, it will cause a WAR between them after your death, do you really want the other kids to have to deal with that?  Unless you are really old I would wait and see how things go before making any changes.  And, what about all the questions above?  OP could answer.", "There are tons of scholarships that aren’t based on academic achievements. Some of them have other requirements like “accepted at a school and have a single parent.”", "That all depends on the scholarship.\n\nMy tution/dorm, 4-year academic scholarship definitely did.  But I also got 3 additional scholarships to pay for books and fees that were based on my college grades/needs.  There were so many scholarships going unclaimed, you really just had to put your name out there.  That was mid/late 90s, though.", "How was he supposed to figure stuff out? According to OP's comments, she wasn't around much and only considered food, clothes and shelter the necessities she owed her kids. Based on the comments, it doesn't sound like she actually raised her kids in a loving, maternal, guiding manner.\n\nThe son is 23 now and not allowed to receive additional grants for an insanely expensive institution BECAUSE OF HER and she's refusing to support her own child because he's fed up with how little she's been there for him throughout his life.\n\nOP, YTA.", "If you leave, and cut contact with me except to tell me when you decided to demand something off me, I'm not going to indulge you.\n\nThe son is an adult, he can start to act like it.", "You struggled with one at 17 but decided to do it again -in poverty - at 19. And you were already military and 26 with the last.\n\nYTA", "Very few people do. You are not special. And I’d bet since you’ve been in for 18 years that you missed out on and failed at being a parent who was there for their own children. You served during a time where the military was sending people out like candy. How many birthdays, milestones, school programs, and their hobbies were you absent for? Have you tried to have an actual conversation with your son about why your relationship is and has been strained for so long? Or do you immediately go on the defensive? You dropped the ball on this. If your apology isn’t genuine and one where you can accept and admit to your faults then it was never an apology to begin with. I have a sneaking suspicion that since he was the middle child he was probably ignored the most too. Especially since it’s obvious that you don’t even like your own child. YTA. I hope you can learn from this. Maybe even offer up therapy for one or both of you. And don’t try to bs me on cost of it. I know for a fat fact that the military offers it for free.", "Her explanation makes no sense to me on how she exhausted her GI Bill, how is one semester going to exhaust it. Also in some states, they have a separate gi bill that can be used an sometimes transferred to your kid.", ">not even to help the son find a way for college beyond just saying \"find a recruiter\", then that sucks.\n\nOP is double the AH for telling the son this.", "That was my situation. My parents were very bad with their money but on paper there was no reason why they couldn’t have helped pay for my education so my financial aid package was minimal. It wasn’t until I was 25 and no longer had to use my parent’s information on my FAFSA that I got enough money to finish.", "Her response was to tell him to join the army lol. Cycle continues.", "Also you can usually write a letter and get this financial aid exclusion waived. So OP is refusing to help in any way shape or form and is literally intentionally remaining an obstacle.", "💯 she’s totally unaware.   She will never see that she was the parent and the initial problem.   Most of the time kids react ( often poorly) to how they are being treated.   Whatever happened the child didn’t get enough of what they needed from the parent and thus the avalanche into a downward spiral of the relationship occurred.   Instead of trying to take a pause and go to counseling and find out what she needs to do, the parent wants to say I was poor and this is what I had to do.   And I get she did what she had to do to survive but at the end of the day at what cost it was the cost of her relationship with her middle child and now instead of trying to repair it she wants to further exacerbate the situation, and then when the kid learns that his parent has passed away. He also has the horrifying factor to learn. He’s been cut out of her will and then the kid will start the whole cycle of going back through his life, trying to figure out why she never really loved him and he’ll never get answers because she’s dead.", "My teen immigrant mom paid for my entire college fund off mcdonalds and cna checks. She started saving for my future as soon as she found out she was pregnant. You simply made and continue to make stupid decisions.", "I’m not acting like that at all. My parents couldn’t afford college either. But they didn’t have children they couldn’t be *there* for. Raising kids involves much more than just providing education, food, clothes, and a roof. That’s just what you literally *have to legally provide* to not have them taken away from you with possible charges for neglect. I’ve been on welfare. I’m playing the smallest possible violin.", "So your kids lives were only terrible for the first 10 years? You say that as if it’s nothing. Maybe take some responsibility instead of trying to make your child do it for you.", "You accidentally exhausted your GI Bill because you didn’t know how it worked and were irresponsible with it. If your response is going to be “well it’s mine to do what I want with” don’t bother because it will only make you look more childish", "Read the comments and what people are telling you OP... It's about how you're treating your son. Not blaming you for not being magically wealth... Which 99% of us are not.\n\nYou're avoiding looking at the mirror and admitting fault, and continuing to cause trauma when your child comes to you for support.", "Ok, so it's not that you're continuing to cover his health insurance and expenses. It's a question : Do you list him as a beneficiary of your insurance benefit in the event of death? \n\nGirl, hell no!  He's a young man yet a legal adult. The number of parents I speak to daily in your shoes is astounding. \n\nHe wants the benefits and entitlement but wants you to further sacrifice and pave his path for him. 63% of mil dependant kids don't fully use their parents' free education benefits as they tend to drop out or let it go to waste. By the time they reach 23 or 26 yrs of age, it's no longer an option, then those are the moments they're ready to get serious about life and need your help. \n\nYou took the entitlements that were available to you and made the best of the situation. I.e, obtaining a degree. \n\nDid you elect to enroll in post 911 or MGIB (chapter 30 vs chapter 33)? \n\nWhen you view WAVE, have you exhausted all 36 months? \n\nDid you opt for the GI Bill kicker or top up upon your initial enrollment? \n\nI had a similar situation with my son, and i told him if he wants the benefits, then join the military like I did! End of discussion. \n\nThey love playing the disownment speech, card, and talk and yet will eventually circle back to needing mom and dad for something. These weak azz kids built different. \n\nMines tried it too. I told him I hope he let's that mindset fuel his passion in life to be successful, and two yrs later, he was knocking on my door apologizing, lol.", "Two things can be true. She did her best as a parent, but her best wasn’t enough for him as the child.", "> She joined the army to get her children out of poverty\n\nAnd now since she makes a lot of my (by FAFSA calculations), he can't get grants for college. Every decision she has made seems to make his life worse. And now she's doing it again. Which is her right. But such an Ahole.", "No one said differently.", "Yes. The military prays on, and relies on the desperation of poverty to sucker people into contract work. We're well aware.", "But then she is doing stuff to keep them in poverty. A huge part of the gi bill is getting that college degree to open up opportunities to make significant money", "I can get one oopsie baby but being in poverty and then choosing to have more kids makes that a choice", "I call BS on someone being so poor that they join the Army and them being immediately so much better so they decide to have another child.\n\nShe is lying.\n\nAnd besides, the fact that she thought it was her only choice, doesnt absolve her from responsibility for her actions. And plenty of people get out of poverty without joining the army and making another child.", "What’s the point in neglecting your family for avoiding poverty, when there’s eventually no family to come home to?", "While that was a good decision on her part, the rest of their sentiment is accurate. It doesn't sound like OP viewed their relationship as anything more than as an authority.", "Good catch on the fact that no other commenter seems to have noticed.  TWO out of THREE children are normal, happy, etc.  ONE of THREE has problems.  If you boil it down to a math equation, 2>1 (two is greater than one).  Even if one child was \"normal\" and the other like the kid in this thread, I would not necessarily say that OP is the A.\n\nThere are lots of younger people on Reddit and most of them can only see things from their perspective and that of their acquaintances because they haven't lived long enough.  That's why you guys are mostly saying this is OP's fault.  You need some more living under your belts.\n\nOP may not win mother of the year awards but NTA.", "Kids don't usually go no contact without a reason", "Read back on things you wrote here. You blame your son, when he was a literal child, for the way you parented (or not) him. \n\nYou may have apologized but you take no responsibility for the things you’ve done, and that just shows how much of an insincere “apology” that was.", "What you did isn’t erased by an apology. The fact you expect your son to get over whatever he experienced because after 20 years you realized you were a bad parent shows how much of an AH you are.", "You apologized, and when he didn’t immediately forgive you, your first impulse was to punish him by cutting him out of the money you’re planning to leave to your other kids.\n\nIf you want to be a good parent, you need to accept that he gets to forgive you (or not) in his own time.", "Didn’t you waste it taking only 1 class?", "My view of you is just growing and growing as a giant, pulsing AH every comment that you ignore people's actual insight and get weird and defensive.\n\nOP... You're putting off some very strong fences of denial here...\n\nReflect and listen to people if you want advice and to grow as a parent.", "How long has it been since you last cared about his feelings?", "If you have children you should plan on a college/start of adult life fund for them.  They will invariably have major expenses when they’re just starting out, whether that be from setting up a business, furnishing/buying a home, or investing in education.  It seems like you a) didn’t bother planning for this at the outset and b) never revisited the idea because you thought he couldn’t hack it.  Neither reflects well on your parenting style.", "You're a really bad parent.\n\nWhen you do the bare minimum you get the minimum results.", "you seriously think your kid can have a decent life without being able to go to college? seems like we have differing opinions on bare necessities, and that’s sad.", "It also includes loving attentive parents that make time for them even over other things in life - but keep pretending he's cutting you off for no reason", "What about love and happiness?", "So you actually intended to help your kids with school and now you’re mad they’re asking for help? Makes sense.", "It’s often been my experience that the people who claim younger generations are “so quick to cut ties” are blatantly ignoring the reasons for why their children have cut ties from them. That, or they will say that “they did the best they could” as an excuse without recognizing that even their best can mean that they have still failed their children, or they will apologize and promise that they will do better and then go on with the same behavior as before.\n\nI’m not saying that this is you since I’m only getting a small glimpse of the situation here, and I do think it is wrong that your son is asking you for money after cutting you off, but frankly you are reminding me of the parents I have debated on cutting off with this comment and some of your other ones. And my parents would claim surprise if I did that even if I stapled my 99+ list of reasons why to their front door like I was Martin Luther and everything.", "> \"I find it so silly that this generation is so quick to cut ties with family members if they don't get what they want.\"\n\nYou mean like you cutting ties with your son because he didn't behave the way you wanted him to? It sounds like he's been trying to sit down and talk to you for a long time and you've refused to listen to him.", "I cut ties with my parents for a long time because we had a ton of issues with things relating to my relationship with my husband, politics, basic human rights, boundries and the ability to have respect during basic conversations (Please can we not discuss topic x, but we can discuss Y and Z instead.  Then the parent jumping hard on me about topic x.).   \n\n\nWe cut ties because we understand creating and discussing boundaries and are attempting to protect our mental health and well being. Everything else in this world is so damn difficult, feeling love and support from a parent in whatever ways they can provide (Note it DOESN'T have to be money) is huge.   \n\n\nYou might not be able to provide your son money for school, but you could certainly help him with a room to live in while going to a nearby school, or offering your time and support in finding a trade school or other opportunities that may interest him in the interim.   \n\n\nInstead, you probably pounded his skull into the ground with how important college is, but oops, forgot to actually plan to help you with it! Sorry bud!", "He cut you off because you’re a terrible parent", "Actually we cut them  off because we don't feel the need to keep people around who only hurt us. You assuming it's only because we don't get what we want says a lot about how you treat your children. Why do you feel family means hurting them is okay?", "Funny how the only insight is the one that agrees with your (already determined) plan", "That’s why I also gave my judgement", "It’s still not the question OP asked. \n\nYes, parenting styles 20 years ago sucked ass and OP apologized. Yes apologies don’t solve everything, but that does not absolve OP’s son of his cruel behavior. \n\nYou don’t tell someone fuck you and then demand a cut of their death.", "and you know that since you’re both oh so close", "There’s always a reason, even when parents want to act like there’s not\n\nETA: aaaand op gives us the reason in comments", "Yeah. I was going to say this. Luckily for me, our grown daughters still call every day and enjoy our company. \n\nSometimes parents are jerks. Sometimes horrible. Assholes and abusive. \n\nBut sometimes adult children are assholes. Period. (And it’s not always the parents fault. Sometimes people are just assholes in spite of their upbringing) \n\nWe (Reddit) always assumes the former but the latter always gets off Scot-free in the collective mind.", "Short of a diagnosed mental disorder..\n\nThere is always a good reason.\n\nAlways.", "Just read Reddit once too often? Only place I ever hear the phrase", "Their relationship was strained before this.   There is more to the story", "Nah, read it again: their relationship had always been strained and when son left home he went no contact.", "Their relationship was strained well before that, didn't you read?", "Highly unlikely that’s “it.”", "That's OPs opinion...not necessarily her son's. Most people don't cut parents out unless something very significant and damaging happened.", "Nuts that it lasts that long. In Canada it’s four years after finishing high school. They increased it to 6 years in Ontario and that really screwed things up for a lot of people, especially because there was no adjustment period. \n\n4 years is a reasonable amount of time to consider your parents I think. And there were avenues to have them disregarded.", "I wonder how OP managed being an extremely poor single parent with him and the daughter, and what the impact on the kids was. Also who took care of them while she was away? I’m guessing she remarried, but there’s no mention of a husband.", "Damned if you do, damned if you don’t. OP was a young single mother when she joined the military - it was a last resort. If she hadn’t done that and was instead at home struggling to take care of her kids, she’d still be judged. Women can’t do anything in regard to parenting without being judged. The military also has a lot of men but you never hear people judging military men for being gone. I wonder why that is? Could it have something to do with the belief that women are “supposed to” be the caretakers and should put their kids first, but dads don’t have to?", "Was their parent getting shot at overseas and unable to be that call?", "I’m going to keep replying to comments with the same information, because everyone seems to be unaware\n\nIn the US regardless of if your child lives with you or not they are legally required to report your income for any financial aid, tuitions or grants, if they are not currently married or had their first marriage.\n\nAge does not matter, Edit: this is incorrect the cutoff is 25\n\nunless you can provide evidence of home abuse and neglect or an inability to contact your parents through legal means, US laws assume the parents have financial burden for their children’s college if they make above the cutoff of i believe 200k\n\nand all applications for tuition aid, federal aid, or scholarships will most likely be denied.", "OP admits to be authoritarian but blames it on being Gen X.", "In your circumstances....guess what?! Everyone has a different experience in life and upbringing, even identical twins.", "This point seems to be soaring super high over everyone’s heads.", "Eh, I guess it depends on the situation. Like how people “make too much” to qualify for food stamps, when they’re barely surviving on their income and food stamps would be helpful. Also, there are academic scholarships that aren’t need-based, so I’m sure there must’ve been *some* options for the son. I’m not saying that OP isn’t in the wrong, I’m just saying that the situation is a bit more nuanced", "I mean hey they could have not known the decision would harm their child. Which is kinda worse, cus it means they didn’t even do any research.", "Its not my responsibility to pay for their college.  If they want to attend optional schooling they have the option of getting a job or joining the army.", "Nobody is from 0-100% a top parent! It’s a learning journey. That’s what my mom (GenX) told me, and she is a good one (in my eyes). OP said she was still a child (with 17, that’s true) so she needed to learn a lot in a short time. These aren’t excuses, they are just facts. Facts, OP said in her post.", "Sure if you call trying to better myself getting out of proverty to properly provide for my children, ensure that I didn't follow my mother's footsteps and be an abusive acholic a crappy parent. I wanted him to keep his grades up, do his chores, personal hygiene, which was a constant struggle as all he wanted to do was play video games. So, id take away is games or other things, rather than talk about his feelings.  I'll take being a crappy parent any day.", "I’m 43 and I really HATE the Gen X pride in “we don’t give a fuck” attitude. Drives me nuts", "I know your type. My mother was similar. You aren’t asking because you’re dying soon or genuinely concerned, the real root of all of this is so that you can feel a modicum of control over him- whether you tell him you excluded him or not. Which I 100% believe that you would tell him. Like having a surprise up your sleeve your next argument or tell his siblings so they tell him and he comes back. \n\nMy father was in the military for 21 years. He says that we sacrificed as a family. That his service was our service too. And it’s true. There’s a huge toll on your family. That’s why there’s stuff for beneficiaries as well. You pulled a huge bonehead moved spending your whole GI bill. While college isn’t a necessity, the odds of getting a solid job without college are very low.\n\nIt’s clear that you don’t value your kids’ feelings or dreams. You might even resent them. You should go to therapy imo.\n\nI had to cut off my mom for several years. She said all the same bs that you do. But then she finally went to therapy and realized that she hasn’t been alright at all. She has genuinely apologized, like where she realizes her mistakes and won’t repeat them. and we started talking again. But it’s hard work and the first step is realizing that being better than your mom doesn’t make you a good mom. Being a child raising a child isn’t an excuse because by the time her was 5 you weren’t a child anymore. You still act like a child, but you aren’t. Grow up.\n\nNTA for removing him from your will, YTA if you tell him and for everything else.", "As my mom doesn't either, and this is where I was trying to be different from her and acknowledge my faults, apologize for any hurt I may have caused. Things I wish mother would do. Many without grown children can pass as much judgment as they wish.  Non of us are perfect parents, we all make mistakes, we try to raise our kids to be model citizens. When you do it with little to nothing the first almost 10 years of their life, it's survival mode and it stays that way TBH. Am I hurt he had decided to cut me out his life absolutely, so this is why I'm here seeking advice on life insurance and the will.", "They took one class per semester, and that uses the entitlement at a non-prorated rate.", "Right. More than likely he is viewing the GI Bill issue as OP purposely refusing to help.", "They didn't understand how it worked and took classes not realizing it used up a whole semester. It happens.", "No. Please. Don’t do this. I’m an estate attorney and it just makes me crazy that this misinformation is out there. Giving someone a dollar or a small inheritance does not prevent them from challenging the will.", "It gets more complicated than that. My step-mom had to declare that a step-sister is \"dead to me\" because Ohio.", "And then state if they challenge the will they then forfeit the dollar given to them", "[deleted]", "This is inaccurate.  Your parent’s income is considered in factoring for federal aid and grants until you’re 25.", "Depending on where OP lives they can just have an addendum in their will about \"heirs specifically excluded\" that will offer a brief explanation that someone who would normally be assumed an heir will receive nothing from the estate. My grandmother did this. A short little paragraph stating specific people being left out and a one sentence reason why was all she needed.", "This is not at all true. Adding them at all creates a whole shit show of other issues. You have to exclude them entirely, and if you want to make it ironclad, put your shit in a trust\n\nEdit to add; ANYONE can challenge a will. I just went through this mess myself. Adding anyone as an heir entitles them to stuff they otherwise would not. So DON’T do that.", "That’s not how things really work. Like you can do it but as an estate attorney commented that’s not the way.", "That must be a recent change.  When I got out of the military at 21 fafsa wanted financial information from a man I hadn't spoken to in 4 years at that point.", "Can a child get married at 18 then divorce at 19 and be considered independent?", "It depends on that military thing. Idk why but I was considered dependent yet underneath my mom till I got married in 2013 then I was considered independent. Maybe the branch? Idk tbh I just know it didn’t qualify for me and I was army NG. 2011-2019", "This is not true at all anymore.  Even if you live independently, FAFSA requires your parents’ income until 25, marriage, or enrollment in graduate school.  So many can’t get loans now because their parents refuse to fill out FAFSA.", "An academic scholarship is not Federal Student Aid. FAFSA stands for Free Application for Federal Student Aid.", "academic scholarships are hard to come by and they are definitely not given to someone starting college at 23. and if he was an outstanding athlete he wouldn’t be worried about money at all but these are all what ifs.\n\nwhat is for sure is that OP knew once they were getting seriously into the military after their first 3 years that once their kids were college age they would not qualify for aid.\n\nand likely made many other decisions from her comments that alienated her child.", "The issue isn't really with him going no contact or being angry at her, but that he feels entitled to a large sum of money despite having no relationship with OP.", "seconding your frustration on this. i left my dad's house at 16 and moved in with another relative, and when i applied for fafsa the first time at 17 he wasn't willing to give me the numbers to fill out the paperwork. called fafsa to see if i had any other options and their only reply was, \"get yourself legally emancipated.\" 🙃", "We have the same requirements in my province in Canada.  My father refused to share this information with me, so I was out of luck when it came to applying for government loans for school.  It meant that I had to work full-time and go to school part-time for 4 additional years in order to get my degree.", "Basically the government expect you as a parent to save for your kids college career if you make a certain amount of money. So if your parents have a high income you don’t qualify for much student aid. Doesn’t matter if you don’t talk to your parents. Doesn’t matter if they in fact saved money or are willing to support you financially. The government expects parents to actually support their kids if they can. \n\nI don’t know, this post (to me at least) screams missing missing reasons. \n\nThen again, I could care less if my dad left me out of his will. We don’t talk. It probably would hurt, but more because it would be another example of him caring more about my siblings than me. Which is why we don’t have a relationship. So it wouldn’t be about the money, it would be about how he’s always acted.", "Also, it sounds like he is still a Dependent in the eyes of the military if he is on her insurance. If she is claiming him as a Dependent on her taxes to keep his mil benefits, that'll do it. Hell, if she gets him off her insurance/taxes, that might be what he needs to qualify for fin aid.", "> the cut off for aids and grants and scholarships is 200,000.\n\nI'll be curious if this changes over the years with the rising COL across the board and the crippling student loan debt that current parents might be saddled with. My partner and I make about $160k combined (pre-taxes), but we don't have enough spare money to put more than maybe $50 a month into our child's college fund because we're both saddled with student loan debt ourselves while also trying to deal with medical debt and the constantly rising cost of groceries, gas, etc. By the time our child goes to college, I'm sure we'll have hit $200k, but they likely won't have a college fund big enough to not need aid of some kind.", "Here's an up-to-date source for assessing whether one would be considered dependent or independent:  \nhttps://studentaid.gov/sites/default/files/fafsa-dependency.pdf", "I had to get married for this reason. My husband And I married for money (but we got engaged for our love) so he can have benefits and have myself considered independent. My mom and I were in NC and we also didn’t mind marrying young (me being 20 and he 23 **we’re two years apart im Sep baby and he’s Jan baby lol) despite being in the military I was still considered dependent underneath my mom for some reason. I just know the ppl at my second college where much more informative than the first college I went to lol", "True.", "\"I'm sorry for my faults, I was a child raising children.\"\nGood.\n\"But my faults are your fault too.\"\nBad.\n\nTbh I'm pretty sure that's indicative of the main reason he cut you off", "You literally write you were an emotionally distant parent and an authoritarian and you can’t figure out why your relationship with your then teen son wasn’t good? Jeez, i can’t imagine!", "You have a whole bunch of threads of people insisting that you've been a bad mother and that you shouldn't continue the path you're going down and YET you keep hammering that you don't see what you did wrong or underselling it. What about the fact that your child doesn't like you and your response is to punish them doesn't get through to you? How can you call yourself a mother? \n\nPeople don't cut off their parents for no reason, they do it because their parents are detriments for their happiness.", "Probably would have a much better relationship if you had actually acted like a parent", "I understand. Your answers (not only this one) are giving a better portrait than the original post.\n\nWhat I pointed is something that is often looked for when people suspect the full picture is not given.", "He keeps asking about using the GI Bill. She keeps explaining It's not applicable. The only way he can is to join the military. I'm not sure what more she is supposed to tell him here.", "But it WAS hers to use as she wanted. It's not a benefit that is owed to anyone else. And how is a kid going to go 'no contact' and have no relationship with her but still expect financial support as a grown adult? Can't have both. \n\nESH but ppl are allowed to do whatever they want with their own money, before and after they die, when it comes to adult children.", "And that’s my issue with OP. It’s not even really about the money. She just doesn’t and hasn’t shown up for her son. Yet she somehow still\nthinks she’s a victim. \n > i don’t owe him anything once he moved out of my household\n  \nShit parent \n\n> I know I would never win mother of the year\n\n**Shit parent**", "Right, you can't have it two ways. You can't first say that you did it to bring your kids out of poverty and then kick them out of the house and say you're not responsible for anything they need when they turn 18. \n\nAlso, you can be an excellent, loving mother while still being poor. Lots of kids have moms who struggle financially and still manage to love their kids and make sure their kids feel secure and cared for. This woman obviously hasn't managed to do that with her kid(s) even though she brought home a paycheck every month.", "THIS", "ESH, but have you actually interacted with many people in the service?\n\n> someone being so poor that they join the army and them being immediately so much better so they decide to have another child\n\nThat is textbook enlisted family economics. Not that it's smart decision-making, but this is both believable and quite common. Enlisted single-parent families with three or four kids on WIC is actually so common that at least one branch has dedicated trainings and seminars on managing exactly that situation.", "She got better income by joining army, while kids were looked after by grand parents. Then she got preggy in a hookup, so one more child. \n\nI don't see it being an unrealistic scenario.", "I could easily believe it but I do wonder whether the last kid was born before or after the army & just.. like… who the hell was taking care of these kids. She doesn’t mention a husband or a grandma at all.", "So you think it would be better to be hungry and unhoused?", "They ate food, had a roof over their head, were clothed, and had healthcare.  Many kids do not have that.  You’ve obviously never truly been poor.  Being hungry is painful.", "That is the parenting style OP said she chose", "That reason doesn't have to be good though.", "Which is why I said several times we don’t know the full story. We can only judge based off the context provided. We can create a story of what did/has happened and base our judge off of that. You’re building a straw man doing that. \n\nAlso, I’ve seen several people go NC for some perceived slight against them, which is what OP’s could be doing. If they ask anyone about their situation and try to get validation for their actions, everyone says they’re being ridiculous. This doesn’t undermine how they feel, but it doesn’t mean that no one can point out the illogical nature of their thinking. People can feel how they want but people don’t have to agree with how they handle those feelings.\n\nBut again, we don’t know all sides. We’ve only got the one.", "Bad parent how?", "Based on their responses, what evidence do we have that they *ever did*?", "Or at least be there emotionally when they come to you for help...\n\nOP just insulted him and told him to pound sand.", "My twin sister chose to not go to college. I went to college. At 25 I was making $90K. At 25 she was making $220K in sales. I’m really proud of her. \n\nThat being said, stop pushing the narrative that to have a decent life you need college. A lot of people don’t end up getting work in their major and just end up with school debt and regret.", "So parents that can’t afford college education for their kids are bad parents? Wtf is wrong with you. I had an okay childhood, middle class, and parents never contributed to my post secondary. And I never expected it. As it was for me. Nor would I have ever felt comfortable taking such a substantial amount from my parents when they could use it for retirement. My education, my problem. I took loans, just like so many others. Pay it back and move on.", "College is not a necessity. Not everyone can afford college. Not everyone SHOULD go to college. I didn’t because I knew I wouldn’t be successful with it, and it would be a waste of money and time. I have a decent life.\n\nWhen I was in high school, it was drilled into our head that if we wanted to be successful, we’d go to college. It was a lie then, and it’s more of a lie now.", "It's just not in the possible for everyone to send their child to college on the parents dime. Have you seen tuition costs these days", "big dawg, i’m having a decent life and i haven’t gone to college, nor will i for another decade almost because i enjoy the work i do, the work i don’t need college for.", "What a weird and elitist worldview.", "I didn't go to college. I make $110k a year.", "You sound like one of those awful people that look down on blue collar workers.", "My neighbor is a plumber and he has 7 bathrooms in his home, a heated pool, and 4 double car garages.  Nice people- he does not have a degree.  Being a hard worker and having a skilled trade will get you a long way and without crazy student loans.", "Absolutely! Certifications which cost a fraction of a degree can Land you jobs paying upwards of 60k plus on the low end. Where many ungraduates struggle just finding a job. As in my post he can always join the army, and theres other means of financial aid and scholarships. Once a child turns 18 a parent is not legally obligated to that child, by love we try to still care for them but there come a point where helping, taking advantage, or feeling they are owed. I'm happy that you are in a tax bracket that you can afford to send three children off to college. Unfortunately, the government doesn't pay me enough, but I make enough now to have a decent living.", "You seriously think he cant have a decent life without college? Oh well better tell that to literally the vast majority of Americans. Lol what was the logic there? College is not a bare necessities regardless of ur definition.", "Makes just as much sense to cut ties with someone completely and then go demanding their assistance after?\n\nPeople aren't obligated to keep up relationships with their family if they don't want to. But they probably won't be getting help from their families afterwards either.\n\nBecause people aren't obligated to help strangers, which is basically what this kind of person amounts to when there's no relationship. You want help? Better not burn any bridges before asking for that help. Otherwise you're either greedy, wanting to take advantage of someone you don't care about or your morals are for sale for the right price if you do retain a relationship with someone you loathe just to benefit from them in some manner.", ">That, or they will say that “they did the best they could” as an excuse without recognizing that even their best can mean that they have still failed their children, or they will apologize and promise that they will do better and then go on with the same behavior as before.\n\nSome of us never even get the apology.", "Don't forget, she thinks being a parent ends as soon as they're 18.", "\"how dare you cut me off when you don't get what you want, which is for me to stop treating you like trash\" like they just cut the back half of the sentence off as if we can't fill in the gap ourselves.", "Fair enough. I also think she's NTA.", "No my daughter talks to him", "Im to lazy to scroll, what is the reason?", "Sometimes the reason is not the parents (in an abusive controlling relationship for example. Or mental health issues mean things are very skewed in their head v actual reality. Or they're just an AH. It's not always the parent)", "> ETA: aaaand op gives us the reason in comments\n\nha! called it. authoritarian etc", "The son is entitled, and lazy (not working and his GF supports him). I think the college benefit would have been wasted on the 23 year old", "Nah, I would say that most of the time there is a good reason, always is a bit much. Kids can grow up to be jerks, even with decent upbringing. It happens.", ">Short of a diagnosed mental disorder..\n\ndiagnosed mental disorders are often intertwined with childhood neglect / abuse", "If there IS a good reason the son has his nerve begging for money.", "Right? She kind of hints at it, but won’t actually say what those “mistakes she made along the way” are. There is FAR more to this story. \n\nStill, she can do whatever she likes with her life insurance.", "Money related issues can make people behave like insane assholes 🤷‍♀️", "Not necessarily. I have a cousin who is a grade A asshole who cut off the whole family and told everyone we didn’t do enough for her. She told her parents that they were abusive to her because they were controlling her whenever she was punished for things like underage drinking, drug use, and theft. Even admitted she was never physically abused nor could she ever tell us anything that was verbally or emotionally abusive, either. Some people are just entitled assholes.", "People cut their parents out for every reason under the sun.", "Could be...not the children's fault if so. Parent could be doing best *they can* yet still negatively impacted child. They are not mutually exclusive.", "Pretty sure that actually makes it worse for the kid.", "Did they sign up and still have fucking kids?", "This doesn't magically make the trauma of your parent  being gone go away.", "Up to age 25.\n\nIt's a mess.", "Age does matter. As do a whole bunch of other things. Getting married is NOT the only way that the parental income does not matter. \n\nAnd things is ONLY for FAFSA linked aid in various forms. LOADS of other money sources Do not in any way shape or form care about parental income.", "You've this a couple times -- can you provide a source? This does not line up with what I learned about FAFSA - where parental income wasn't counted after age 24, marriage, being in a program for a graduate degree, or being legally emancipated/ward of the court and some other rare cases. \n\nI last filled out the form in 2011 when I was in grad school, so it could've changed.\n\nI just looked at the site for federal aid - [https://studentaid.gov/apply-for-aid/fafsa/filling-out/dependency](https://studentaid.gov/apply-for-aid/fafsa/filling-out/dependency) the first question for determining your dependency status appears to be your age, so I'm interested in seeing where you got your information.", "I am not sure how that changes the fact that their response was speak to a recruiter and using their GI BILL for one class a second time that meant their kid didn't qualify", "Guess what?! That is exactly what u/AchieveDeficiency 's point was!", "It always gets me when parents say they always worked for their kid to get good grades (and I’m sure always preach how college is important) but then the kid reaches 18 and then it’s suddenly, I don’t owe you any help with college, you’re not entitled to anything, etc etc. \n\nMy own father only ever cared about my grades on paper and then made it known when I was 16 that he had no intention of helping me, only his golden child in his shiny new family. \n\nMy mother couldn’t afford to send me to college but she started when I was young figuring out what I would need to get scholarships, etc. \n\nDid you ever try to help your son figure out other ways to pay for schooling? Did you preach about expecting him to go to college but then give him no guidance or help?", "I don’t see anything wrong with this parenting style except for the talking. But(!) not all young boys wan talks about their feelings & stuff like that, especially if they are in there teens… I remember my younger brother…he would rather talk to me & older sister than our mom. Not because she was a bad one, just because it would be awkward for him. Teen-stuff…", "You can’t blame a kid for being a kid. Maybe you should look at yourself and what YOU created.", "Wow you did the bare minimum parenting. Fucking congrats.", "Same.  Plus, my Boomer mom taught me the difference between authoritative and authoritarian parenting, from a child psychology book written by a man born in 1922, so using age as an excuse is pretty flimsy", "Speaking from experience of having a parent who always apologized and never knew why, just so they would proceed with the hurtful behavior - that was not an apology. I might be jumping from 0 to 100, but this fact alone makes me see why your son did not want to continue the relationship apart from the money aspect with you.\nYou can't just apologize for being a bad parent and all of it go away, it really makes me think that there is more to it than it meets the eye. My mum also did \"try\" to make me responsible the way that you did (from what I saw in the comments), while also trying to get through poverty. I will forever be grateful to her for that, however  she also abused me quite a lot and then refused to admit it, because she magically never remembered it so I would end up being the liar. Look at yourself first before trying to boast how bad your son is on the internet, then saying that you would never do it, yet continue to do so, just to add up that you are a bad parent. We are aware of it from the entire post thank you. If anything I feel bad for the son that his mum just boasted about it on the internet. \nWith that being said, you are NTA for excluding him out. It is your money at the end of the day.", "You didn’t break the cycle of abuse, you just modified it.", "Sounds like you’re looking for validation to cut him out. Did being his parent end for you when he was 18? If you think so, sure, do it. I’d be interested to actually hear his side from his own mouth. Sometimes when children are (emotionally) neglected they carry pain with them into adulthood.\n\nI don’t know anyone who has loving, supportive parents who have gone no contact.", "Just because you were different than your mother, doesn’t mean you were any less shitty.", "You don’t acknowledge it years down the road after they already hate you, you acknowledge and recognize it as it’s happening and then apologize and change immediately", "So you acknowledged you being a terrible mother when he’s 23 years old? How noble.", "If you think only other parents have the right to judge one's parenting, you're beyond out of touch. It's clearly evident you're incapable of seeing the perspective of anyone other than your own. Some of us may not have grown children, but we all had parents and can speak from our experiences with that. You're not arguing with children here, you're arguing with adults, peers, maybe even experts in some cases. But judging by how defensive you've gotten, it's clear you're still the teenager that joined the army way back when.", "I’m also an attorney and it’s also such a pain in the ass for the Executor who has to track down disgruntled beneficiary and give them the damn check for a dollar.", "Oh interesting I didn't know that I've only read about people doing it. I appreciate knowing it's not true", "I also thought that was true, thanks for clarifying", "As a Non-American I've read this and sort of just \"accepted\" it as truth. I mean, it never has and never will apply to me anyway we have other laws here so like, why would I question it? But thanks for letting me know that this is not the case.\n\nJust a question out of curiosity (if you feel like answering), how has this dumb thing even gotten out there as a \"truth\"? Is it based on any reality? As I've \"understood\" it, leaving any amount no matter how small was simply so that no one could challenge the will based on having been accidentally forgotten. But, like, if you have inherited something no matter how small, how would you even contest it? On what grounds? Can't a person do what they please with THEIR money?\n\nSorry those were a lot of questions I absolutely don't expect you or anyone to answer them. I guess I can google it if I ever feel the need to. xD", "Why doesn't this work?", "I'm sure the prospect of losing a whole dollar would easily dissuade anybody.", "Sounds like he disowned her because he’s a spoiled and entitled punk.", "Be that as it may, OP admitted she wasn't winning any Mother of the Year awards. He is grown and has made his choice and it wasn't communication and forgiveness.  He chose to cut off contact and OP has every right to respond the same. He may very well have his reasons -- all the more reason then that he should *not* be looking to her for any assistance whatsoever.  He said she's \"just the egg donor\" ....so be it.", "A lot of people don't seem to understand this. The parents income is taken into account when a person applies for financial aid. Till they're the age of 25. \n\nPart of the problem in America with education. Is the parents don't feel it's their duty to pay for post-secondary schooling. This seems to be a modern American concept. \n\nA lot of places in the world. It is the parent's responsibility to ensure the child is secure in their future. I blame modern American conservativism.", "Not if you have moved out and have formally change your address.\n\n\nIf you're still using the parents 's house address then yes. Even if you're in your 30.. ask me how I know.", "Yes, exactly!!!", "yes again as i said thats an a$$hole move, but he is bitter.maybe he thinks if she wasn't present in their life at least she could give the money lol", "Gonna add and say in UK, you have to use your parents income until your 25 regardless of when you moved out which is ridiculous. Not surprised to hear such a process in place elsewhere.", "I'm sorry you had to go through that too. There has to be a better system, but that gets into a much bigger issue bracket than this thread. \n\nI just hate all the comments that are \"he's an adult now, not your problem!\"", "Me too.", "I get the government expectation. Unfortunately, that expectation is based on a unicorn of life going a certain way and not most peoples' realities.   \n\n\nI agree that OP has a lot more going on than just not paying for college though.", "Financial Aid won't run him solo until he's 24.", "Unless we all get out there and start voting to expand our rights instead of settling for shitty laws and politicians, our children will not be able to afford college unless you can pay for it cash.", "Actually seems to be happening more and more these days for no reason other than they are young and haven’t lived life. Unfortunately until people get some life and perspective and perhaps a child they learn that oh, Mom was doing her best because this is hard as hell. I remember one post about a sister who didn’t want her older sister to come to her wedding because she didn’t stand up for her in high school. Not that she was cruel or did anything to hurt her just didn’t stand up to peer pressure.", "Good parents don’t just do the bare minimum or what they are obligated to do. Also the kid going no contact and having no relationship was a consequence of her bad parenting.", "> allowed to do\n\nJust because you can, doesn’t mean you should.", "Yes such a good point.", "Yet another reason why BC should be free", "Nope, kids stayed with me unless deployed. But nice assumption", "I took care of the kids. I got married at 27. Kid at that time. Was married 10 years. Prior to marriage my mother did watch them while on deployment", "They wouldn’t be if OP didn’t choose to have more kids while already in poverty", "what is up with y’all? Providing food, a roof,clothes, healthcare and education is literally requirements to have a child. If you do not meet those requirements, you will lose custody of your child and possibly face neglect charges. Doing the bare bones minimum does not make you a good parent, it doesn’t even make you a decent parent. It makes you someone who literally just provides what they are legally obligated to provide. A.k.a. a shit parent..", "Do i have to link you to your own comments? Don’t be obtuse.", "Well you were definitely a bad soldier getting knocked up as soon as you enlisted lol", "that’s more a problem of crushing student loan debt and astronomical fees than higher education.", "wtf is wrong with you? just because you are lucky enough to be able to pay back your debt doesn’t mean that others will be. Millions of people are being crushed under student loan debt.", "Really telling of reddit’s demographics", "Education is considered a human right in many places. Hardly elitist to believe that giving someone tools can help them build a better, more fulfilling life for themselves.", "If you think your obligations to the child *you brought into this world* ended the second they turned 18 you were never a fit parent in the first place. And quit blaming your income for why you aren’t providing for your children. You are the one that decided to have three kids without having the means to take care of them.", "“Once a child turns 18 a parent is not legally obligated to that child”- this right here says anything and everything anyone needs to know about you. A good loving parent doesn’t say shot like that, you should be ashamed. You clearly weren’t a great parents which you can say here and claim to have apologized for but I doubt it was a real apology. It was one of those “I’m sorry, now get over it” apologies I’m sure. You need to really take a long hard look at yourself and actually hold yourself accountable instead of making excuses. You were a “kid raising a kid” because of mistakes you made so while it is tough and I can sympathize with how hard that must have been it wasn’t the kids fault, it was yours.", "“Once a child turns 18 a parent is not legally obligated to that child” - this statement right here makes you an ABSOLUTE AH. You should not have had kids plain and simple.", "“Ummmm legally, I’m no longer required to pay for my child. I could do so out of love but we didn’t get along when we was a kid so we don’t have a relationship.”\n\nBruh. YTA.\n\nIf you start *any* conversation about your child with “well according to the *law*…” you should not have had children. You should not need the law to constitute how you treat your children. Omfg.", "And where were you when your son was a minor? You can wwsh your hands now that he is a legal adult but you were responsible for him until the minute he left your home and by the sound of it, you did a crappy job.", "You do owe him. For a lifetime of neglect. Pay up. YTA", "No wonder he's no contact with you. yta", "Parenting is more than a legal obligation. If that’s how you treated parenting…. Girl YTA. \n\n\nYou want all the power, privilege, and praise of parenthood while showing your true colors. You don’t give a shit about your kid as a person.", "And a child is never obligated to help their parents. Ever.  So make sure your assets stay stable lol", "Surprised she even talks to you", "Was your daughter parentified?", "Yup. My brother cut my dad out. He can’t even verbalize his reasoning for it. My dad can be very annoying and even I have trouble talking to him for more than 30 minutes. But my dad is a good guy and he’s trying.", "Nah.\n\nKids adapt behaviors from their environment. They aren't magically born \"jerks\".", "I meant more in the sense of a *physical* condition that is causing mental problems, like autism.", "Ok boomer", "Asking a parent to FINALLY show a smidge of responsibility is hardly begging.", "Agreed. I’d say she’s the AH in that she’s __only__ cutting him off because he removed himself from her and then asked to use the GI bill. She seem to feel just keeping a roof over his head and food in his mouth and not being her mother was good enough parenting. \n\nPart of parenting is that, once your child is grown, they’ll come to you with your mistakes. And, being the parent, you have to be willing to listen and apologize without pointing out your child’s flaws, now or in the past. “You know what, you’re right. With x going on, I didn’t really think of how much I was effecting you. I’m sorry honey, I love you and I want to make things right between us.”", "As a former trust and tax accountant I’m well aware of that. \n\nIt seems they were pretty much NC before this, but he’s trying to go to college but can’t bc even though both parents have income to disqualify him they’re not actually contributing what’s expected by financial aid. It’s just an extra thorn after everything else.", "I'll tell my brothers kids they shouldn't exist.", "this parent knowingly did not set aside a college fund for their 3 children because they didn’t care about their children. Read their comments. someone making enough money to disqualify their children (200k a year i think) is making enough money to set aside a college fund.\n\nand kids don’t cut out their parents for no reason, if your child hates you it’s definitely something you did. \n\nthey failed their child. and wasted their GI bill making poor decisions.", "He is no longer a child. He is an adult, who has full capacity of understanding how things work. You are trying to paint a picture as if this was a horrific living situation, as it was not. So, you can continue to troll but it's not productive. Has he become an Entitled adult? Yes. did I somehow contribute to that behavior? I don't see how, but if I got to be the Blame, so be it.", "My wife is fond of the phrase \"The axe forgets, the tree remembers\".", "My mom was the same way. She repeatedly violated my privacy since I was child. As an adult, we would have \"heart to heart\" conversations where we would cry and hug and she would apologize.... And then a short time later she would do the same things again. Eventually I got to the point where I told her that since her behavior didn't change, her apologies meant nothing and I didn't want to hear them.\n\nI bet you couldn't guess that she's no longer allowed to contact me.", "Also an attorney, 1000x this.", "Yeah. There are ways to minimize the risk of a Will challenge and/or make it unlikely that a challenge would succeed. But state laws, and facts and circumstances of the situation are important and in the end there is almost no way to completely prevent someone from filing a lawsuit.", "To be clear, the specific exclusion of a particular family member (different states have different laws but generally it applies to spouses and legal descendants) does not prohibit a will challenge.  Anyone that has a claim against the estate in some form, can challenge the will.  But the specific exclusion makes the challenge almost certain to fail IF there is no law to the contrary AND there are no other factors such as loans or promises.  Very necessary if you want to exclude someone but does not cover all bases.  A lawyer can help make sure that the bases are covered based upon a particular person’s circumstances.", "I just went through hell bc my stepdad disowned both his daughters and they went through hell and high water to challenge it despite knowing they were not entitled to shit. \n\nIf he left them a dollar, they would have had even more ability to claw their way in. \n\nIt took over a year for them to give up and cost us several thousand dollars.", "This happened to me. I remember the conversation when I called FAFSA about the form. \"Why is it asking for my parents' income? They have no part in this. They are not helping.\" Dude: \"Are you married?\" Me: \"No. But I am an adult and my parents are not helping me with school at all. I don't live at home.\" Dude: \"Sorry. You have to put their income.\" Me: \"...\" Him: \"...\" And then I cried and cried because I knew I'd be screwed. And yes, I was. Still paying off loans and cannot set much aside to save for my kids because I'm paying mine.", "In my opinion education isn’t that affordable. I don’t know many 18 year olds who can afford it either. As a parent we were prepared to pay for school for our twins as neither qualified for for financial aid due to our income. But we had to pay the in state tuition in full and one semester for both was around 18K. Then they both dropped out and guess who didn’t get any money back. They started during Covid and it was a shitshow. I believe our of state tuition for one semester at the same school was like 30K. \n\nThe whole situation just makes me so upset.  Kids either have to get astronomically high loans or parents pay if they have any money saved.  Sure you could apply for scholarships but those don’t seem to be given out unless you are extremely impoverished, or standout somehow. \n\nI know college is free or heavily subsidized in other countries but in the US it’s just not affordable. When I was a student I was able to move out, have a part time job and pay my rent and my father helped me with tuition which at the time was somewhat affordable. I think my books cost almost as much as the classes.", "No unless you’re married or have your own dependent you are considered a dependent on the FAFSA if you are under 25 no matter what your address is. I moved out at 18 but still needed my dad’s information for financial aid until I had my daughter when I was 21.\n\nEdit: And yes I formally changed my address. I always update my voter registration when I move and I used my new address for all my college paperwork, I moved to a completely different city and county.", "You are mistaken. Even if you move out, your parents or guardians financial info MUST be used for the fafsa. There are a couple of ways out of it, such as joining the military or getting married. But simply moving out is not one of them. A lot of people think it is and they even make arrangements to move out right at 18, thinking this will work but no.", "I'm going to echo what others have said and tell you that you are misinformed. I'm not sure if it varies state to state, but I can tell you that in MN I did not qualify for a grant because of my parents' income regardless of living in an apartment away from them. And you MUST give them your parents income on the forms unless you are over the age of 25, emancipated from your parents, married, or have a child. I qualified for a grant once I had my son at the age of 21.", "Yeah that's probably the case but it doesn't excuse or justify it at all, or make OP TA in this limited situation. She might be TA for how he grew up but that's a separate issue.", "It's crazy because nothing else in your life at that point is reliant on your parent, so why are student loans??", "Poverty is a wicked thing. I have a good relationship with imperfect parents today because I recognize that they did the best they could with the cards they were dealt. That's what the OP sounds like to me. I am an adult. I put myself through college. At some point when we are adults, we are responsible for our own lives, regardless of 'good' or 'bad' parenting, and not paying for college doesn't qualify as 'bad' parenting for me. \nGo no contact because you didn't like the parenting, fine. Then expect financial support as a twenty something? Not really how that works.", "And what happened when you were deployed?", "“Took care of the kids” leaves a lot of space for parentifying. Did you do absolutely everything and not expect other kids to watch each other, manage their behavior, etc.? Teaching them how to make a pbj or cook is fine, as long as you didn’t leave it on them to feed themselves. \n\nI agree that leaving your kids with an abuser is iffy, though I understand that you were in a difficult situation. \n\nDid you go after the baby daddies for child support, btw? Did welfare hook you up with a social worker? What job did you have? It must have been tough to live on only 11k with 2 kids.", "But you can’t really isolate the two in America, so it’s both. Getting a higher education for most people comes with debt. There’s plenty of people that choose to not go that route and do just fine. A lot of people think of degrees as their golden ticket to landing a decent job and making a living and then are terribly disappointed when that **still** doesn’t happen.", "And the solution to that isn't always \"my parents should have paid for me.\"  I'm in the same boat as them in the sense that I won't take large sums from my parents.  I didn't go to college for more than a couple classes.  I just care about them and want them to be able to retire comfortably.\n\nThe idea that we \"need\" to go to college just for a degree is part of why so many people are suffering under that debt.  That and college being a scam in the US for how much it costs anyways.  A lot of jobs require degree then pay the same as jobs that don't.  Going to college without a plan is all around a terrible idea in both this economy and country", "“Lucky enough” is ironic given this person says they paid for their own college, got a job, and paid for it themselves. But yeah… luck lol. \n\nYou are making more of an argument for people to NOT go to college than to go. People aren’t making a decent living if they’re also being crushed by loans.", "There are many paths to success that don't involve college.", "The idea you can't have a decent or fulfilling life without college is wildly elitist.  Baffling that anyone would disagree with that.  Education being a human right in some locations has no bearing on how elitist that take is.", "Confused where you drew thar conclusion from where we are simply talking about college. But ok.", "bro you just verbalized the reason. and you weren't even trying.", "So all those kids who assaulted or murdered ppl must be because their parents/upbringing?? Lol i know this sub is mostly kids, but yall really think everyone is born nice till their parents fuck them up. Sometimes assholes are just assholes.", "Ooh, my bad, didn't catch that, thanks for clarifying", "You think an ageist insult will hurt me?  🤣😜😆🤭😝😹😂", "Ask them in 20 years how they felt about growing up lmao", "More like tell your brother him abandoning them for 10 months a year isn’t serving his kids or his country.", "But but but she was poor and having a kid at 19 or whatever. Why can’t they all just pull themselves up by their bootstraps? I’m sure it’s just as simple as it was 30 years ago /s", "The same way you were an adult when you exhausted your bill?", "So he’s just supposed to accept the fact you were a crappy parent? Your son didn’t pop out of your vagina like that. He’s a product of the environment YOU created. Sounds to me like the only entitled adult here is you.", "[removed]", "My mother's family all have clauses in their wills that anyone who challenges the will can't be a beneficiary of it.", "I’m curious how often you come across this misinformation cause reading the post I knew someone would say the $1 thing but I was curious how quickly someone would jump in to correct it. I guess it just sounds smart like a neat and tidy way to say that you didn’t forget the person and wanted to make a statement from the dead. Maybe it’s a good TV or movie plot device since it’s very spiteful and kinda funny everyone getting money or property ect and then $1 stands out as a clear insult. Do people ask for you to write that in and you have to explain that’s not how things work?", "Exactly. Giving them anything makes them an heir and entitles them to notices and other information they otherwise wouldn’t.", "I know some people who got married just to get their parents info off the FAFSA, as that was the easiest way to get college education without crazy debt...", "Health insurance is available until 25 now; there may be other benefits.", "I’m sure it’s not what you are trying to say but it comes across as “even if I’m a terrible parent you need to continue having contact with me and a relationship no matter what if you ever want support from me in the future”. He’s reaching out for support from his parent who has not been there for him in the past which in this moment is help paying for college and she is calling him entitled.", "Poverty truly is awful. That’s typically why intelligent and empathetic people don’t have *two whole ass kids* while they’re already struggling with providing for their first. Does it mean OP broke the law? No. But she’s an awful mother.", "Yea the people nowadays still acting like college is the end all be all is wild.  The number of jobs that require a degree but pay the same as jobs that dont is sky high and if anything only getting worse with time.  I'm not against college but its not some magic bullet.  Even with a lot of help from parents you can walk away with a lot of debt", "which is why I said fees are a problem and need to go down or eliminated altogether; did you not understand what I said or are you spraying comments just for the sake of commenting?", "Cool. Not every education path is viable for everyone. And vocational/technical schools, bootcamps etc. don't give broad general education that benefits your life outside of work - they give you work specific education that helps you perform a job. I'm of the opinion that human beings aren't simply cogs in machines whose only role in life is to consume and produce work.", "Context clues and reading your other comments babe. You don’t exist in a vacuum here.", "Aside from mental issues, people aren’t born evil.", "Ok boomer", "Well considering he's out and was in when they were young kids, niece is 20s now, they are quite proud of him and happy he is home. But they had honest conversations about where he was and what he was doing. So yeah, go fuck yourselves", "They didn't understand how it worked. Simply being an adult doesn't mean mistakes are impossible. They owned that they made a mistake in exhausting their GI Bill but quite frankly, it was their benefit to use,  not their son's. If their son wants to have a GI bill that they are actually entitled to, they have to enlist.", "Sounds like some projection going on here.  I don’t hear crappy parenting, I hear someone doing the best they can with what they have to work with.  No parents are perfect, and any adult that wants to roll over and cry about it instead of making their own efforts to be better (like OP did) isn’t going to win any sympathy except from others that don’t want to have any accountability.", "Also it seems she raised two other well adjusted children. So maybe...", "He is an adult now.  Whatever his upbringing, he is now responsible for his actions and his life.  Time to put on the big boy pants, accept responsibility for himself, and move on.", "Yes that’s a common clause. It doesn’t always work but it can provide a disincentive to challenge.", "My grandparents had this but it was very specifically that if a beneficiary challenges *and loses* then they get nothing, including the original bequest. \n\nEven with a no-contest clause, a court could decide that there are valid enough grounds to allow it.", "As mentioned above, those types of clauses don’t necessarily keep anyone from challenging, and shouldn’t if they have a valid case.\n\nI am not an estate lawyer as the commenter above, but I have been an executor multiple times in a few different states and in all the grounds for challenging a will were that 1) the person was under duress when the will was prepared/signed, or 2) they weren’t of sound mind when the will was prepared/signed.\n\nIn both cases, if the court agrees with the challenge under either of those grounds the clauses people mention like the $1 thing are just as invalid as the rest of the will.", "I was one of those \"beneficiaries\" of a $1 inheritance, though I was not insulted by the news, just hurt. (I had been falsely accused of taking things from the elderly family member in question - it later came out that it had been my aunt who had done so). \n\nI sent a letter back to the probate attorney basically saying, thanks but no thanks. No dollar was ever sent, and i wouldn't have cashed the check anyway.", "And boy will they use and twist anything and everything they can.", "If you and your parents choose to go that route. I was basically estranged from my parents in my early 20s, likely for similar reasons as OP's son. Just because something IS an option, doesn't mean it is being used.", "Idk what terrible even means in this whole scenario. Saying a relationship is over and going no contact, means a relationship is over to me. I genuinely don't understand why if something warranted that scorched earth reaction, multiple requests for financial support for college follow. It's not money to stay housed. It's not medical support. It's 'I want free college'. I can't relate, because my threshold for cutting off relationships is clearly not the same as OPs son, and my threshold for demanding support as an adult is also clearly not the same. That's fine. I'm not submitting her for mother of the year here. I just think a dude in his twenties needs to figure out another option than staying mad at his mom for not setting him up for better success in adulthood.", "Oof making it about intelligence now? Where were her good parents that she should have had when she was a child having children, since her grown son is still a child in your eyes? He is in a better position as a young adult than she was. He can figure it out, without free college and without an inheritance.", "Yeah, I hate the attitudes with college (as we see on this thread lol). People act like getting a degree sets them for life and we see every single day how much that is not the case. I thought that way at 17/18 but now at 26 I can look back and have so much more respect for people that didn’t go and are doing great.", "I don’t even think YOU understand what you are saying lol. You’re making one argument that isn’t true, and then backing it up by more of your personal thoughts that is contradicting your original statement. I’m just pointing out that your argument sucks if you think this person working hard to carve their way in life is luck. \n\nNot everyone wants to live their entire life as a victim to a system of high education costs, some people find different ways to go about things and find happiness with their success. You think fees need to go down? Cool, join the party of most of America that thinks that. Your personal opinion on something is not going to change what is reality NOW and that people do the best they can with what they have.", "I don’t follow your logic. Because the son is an adult he understands how things work and therefore his situation is his own fault, but it’s not the mom’s fault for not understanding how things work despite being an adult? Talk about double standards.", "Turns out there isn't a magic switch when you hit 18 that downloads all the things adults need to do to your brain. We have these things called \"parents\" which are supposed to prepare us for putting on our big boy pants and taking responsibility.", "That absolutely doesn't work. Either you are a beneficiary or you or not. And as a beneficiary, it is your legally protected right to challenge a will. This also helps protect elders against elder abuse and estate fraud.", "Yes, but I was responding to the “nothing else is reliant at that age” which is incorrect in that case, even if for some it is irrelevant.", "Because OP turned out so great? Does the world *owe* you anything? No. It’s a cruel place. I am aware of that. But it’s also a place where I can call out an asshole when I see one. OPs son is not her first child. Its her *second*. And yes I **will** make it about intelligence because uneducated people have more kids. **statistically**", "Hmmm OP seemed to indicate having been 17 when the oldest child was born, 19 when the son in question was born.\nSo perhaps based on this very argument OP also wasn't hit with some magical switch to make them understand adulting and being a model parent? And perhaps would have needed some extra support to help her avoid some mistakes?\n\nOr is the son only one who should gave gotten more support and help, from a parent he has cut ties from and seemingly only wants to benefit from now?", "It depends on the jurisdiction. In my state they are disfavored but not completely invalid.\n\nYour point about prevention of elder abuse is an important one. Some disinheritances are done for good reason. Others are the result of fraud or undue influence."]}