{"id": 3108, "submission_id": "z3blua", "title": "AITA for never eating my step sister’s food ?", "selftext": "I (18f) have been living with my step mother’s family for about seven months and it has been a ride. Firstly, I’ve had a tumultuous relationship with my step sister (also 18f) who has done some bewildering things.\n\nShe has put bleach on my favourite clothes “accidentally”, put my step brothers (19m) lube in my room and told them that i was being weird. She has told her brother that “I liked him a bit too much”, she put her panties in my room, burnt my favourite antique book, tried to put pink dye in my conditioner and ruined all of my film in my cameras.\n\nI have told my step mother and my father about this which they have discussed with her but she just calls me delusional and a “liar”. They let her off the hook and it happens on repeat. \n\nRecently, my sister started to offer cooking our meals when she has never cooked for us before. Suspiciously, I have chosen to not eat her food and when everyone asks me why, I just say I’m not hungry even though she seems pissed. This may sound crazy but I think she is capable of doing something to my food, to try to make me “sick”.\n\nNow, that I’ve been doing it many times, my father has told me to stop being hostile and to get a plate. I told him the same thing and didn’t eat it. But, he pulled me aside and told me I was making our relationship hostile with her kids. He said that I should be the “civil one”.\n\n\nAITA for still denying to eat her food?", "created_utc": 1669268514, "permalink": "/r/AmItheAsshole/comments/z3blua/aita_for_never_eating_my_step_sisters_food/", "score": 332, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) Denying to eat her cooked food.\n\n(2) This may seem like I’m trying to purposely be hostile.\n\n**[Check out our upcoming Reddit Talk with Iliza Shlesinger on Nov. 28th!](https://redd.it/z29rfu)** \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYou need to find a new living arrangement if you don’t feel safe. Delusion or not, you shouldn’t feel this way for the long term.", "NTA but whoa holy gaslighting step sister! \n\nYour dad needs to advocate for you. YOU are his child, not the grown ass adult that's behaving like a territorial 10 year old. \n\nCan you live with your mom or another family member?", "Uh, NTA, but you either need to get some sort of security cameras or find someone to take you in. Your dad is failing you. Is there another relative or friend you can stay with?", "NTA.  She is absolutely planning to tamper with your food, and your Dad is probably scolding you because she's been crying crocodile tears to her Mom and him about you not eating the food.  Do not eat anything she's been able to mess with, and if there are other family members you could live with, please reach out to them to ask--this isn't a safe place for you, and clearly your Dad and stepmom aren't interested in taking any action to protect you.", "NTA.  She sounds like she's building up to something bigger.  And calling you delusional and a liar is her gaslighting you. \n\nDo you have any other family members you can stay with?", "NTA\n\nNext time someone challenges you after she serves food, challenge them to switch plates with the one she made for you.\n\nIf you think she may have given up messing with your plate after all the refusals, and just enjoys playing the victim while you refuse to eat this may not work.  You could always try eating once and challenging your dad to switch the next time.", "NTA. I’d be very wary of this too. \n\nIf you’re forced to put up with this situation, can you be sure she is not plating your food and that everyone fills up their own plate from the pot/dish? Buffet style is the only way I would trust my food wasn’t tampered with. And if she DID do something, everyone else would be affected too and might finally do something about her shenanigans.", "NTA. You have good reason to be suspicious. If your dad and/or stepmom say something again, ask to switch plates with them (assuming you all get the same meals& portion sizes) and see what happens.", "NTA, You should move out asap if you can, maybe get a lock for your door? You're right not to trust her or food she cooks for you.", "NTA - Can you not live with your moms family? Your dad is TA and is enabling her with his shit wife", "NTA\n\nYour family needs therapy. You've expressed concerns about her behavior and they were swept under the rug, of course you don't feel safe eating her food!", "NTA. Not by a long shot. Hold your ground but if you want to throw a \"civil\" bone at the family, tell them you'll eat what she makes IF you get to make your own plate/bowl up. When they complain point out that if there is nothing to worry about there should be no problem with you serving yourself AND one of the adults can watch you do  it.  If they say no then make yourself something to eat and if you can start reaching out to your more sane relatives if you have any about living with them.\n\nWhen you do finally move out make sure you get EVERYTHING and honestly have a friend come over to play guard dog in your room to keep your step sister from messing with things.", "NTA better safe than sorry.", "NTA\n\nI would be very suspicious with her too!  Watch your back! She sounds like a Disney villain. LoL. \n\nCould you ask for a lock on your door, if you don’t already?  Because I would not trust her not to sneak in your room to do something nasty and cruel!", "OP, are there grandparents you can stay with? this is an extremely hostile living environment and it's not good for you to be in it.", "NTA If it ever comes to that, make sure you swap plates with your dad. However, I wouldn't be surprised if dad reacts the same way as the husband of the woman whose MIL was poisoning her - he knew, and was furious she wouldn't just go along and get poisoned. Your dad is more than aware of how your stepsister is treating you, only he is furious that you won't be a quiet victim. Keep on taking care of yourself, and get out of that abusive situation as soon as you can. Good luck.", "NTA.  This person has given you reason to be suspicious so you need to look after yourself.", "Nope.  She's a loon.  Don't trust her.  NTA", "NTA.  A. You don't trust her because she's given you reasons not to trust her.  Whatever the circumstances are between you -we only know one side- the fact is that not eating her food is probably smart.  You don't eat food made by people who have otherwise antagonized you.  Roman emperors knew that.\n\nB. Taking the high road, being the 'civil one,' means not contributing to the nonsense.  It doesn't mean assuming everything is okay when she has made it clear that things are not okay.\n\nC. Hopefully you're working on getting out of that situation.  By your description the girl is one dumb trick away from getting you a night in jail, if not worse.", "NTA\n\nIt's a pity your own father doesn't believe you. Try to gather some proof. Maybe buy yourself a small camera, hide it in the room, and leave recording on.\n\nYou're smart not to eat the food she cooks. She will put something in your food when you're not looking, and then make fun of you the next day. Your family will never believe it was her, because they all eat the same food. \n\nYou need outside help. Is there anyone you can go to? Grandparents? Aunt/Uncle? School counselor?\n\nYou need an adult on your side, this is a hard battle to fight alone.", "NTA\n\nGET OUT OF THAT HOUSE ASAP", "Take some food from the plate she gives you as a sample and have it tested. If it comes back positive or negative then you have your answer. Absolutely NTA. She seems malicious and manipulative I'm glad you're being vigilant.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (18f) have been living with my step mother’s family for about seven months and it has been a ride. Firstly, I’ve had a tumultuous relationship with my step sister (also 18f) who has done some bewildering things.\n\nShe has put bleach on my favourite clothes “accidentally”, put my step brothers (19m) lube in my room and told them that i was being weird. She has told her brother that “I liked him a bit too much”, she put her panties in my room, burnt my favourite antique book, tried to put pink dye in my conditioner and ruined all of my film in my cameras.\n\nI have told my step mother and my father about this which they have discussed with her but she just calls me delusional and a “liar”. They let her off the hook and it happens on repeat. \n\nRecently, my sister started to offer cooking our meals when she has never cooked for us before. Suspiciously, I have chosen to not eat her food and when everyone asks me why, I just say I’m not hungry even though she seems pissed. This may sound crazy but I think she is capable of doing something to my food, to try to make me “sick”.\n\nNow, that I’ve been doing it many times, my father has told me to stop being hostile and to get a plate. I told him the same thing and didn’t eat it. But, he pulled me aside and told me I was making our relationship hostile with her kids. He said that I should be the “civil one”.\n\n\nAITA for still denying to eat her food?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You shouldn't take things from people you don't trust. It's not hostile behaviour, it's defensive. You wouldn't put your hand in a bears mouth, would you?", "Have you thought about getting a nanny cam for you room? This way you have some video of her going into your room and doing things.\nI wouldn't touch the food. Violence always goes up when its not stopped. And your parents aren't stepping in.", "NTA. You are being abused and he doesn’t want to rock the boat.  You see where you stand.  Get out as soon as you can and go no contact with all of them.", "[removed]", "NTA\n\nWhy is it always you who has to be the civil one? And why does he think a civil is synonymous with doormat?\n\nTell him and his wife clearly and repeatedly that you’ll eat the food she prepares when she apologises for and stops the shit she’s been pulling.\n\nAnd start moving your stuff out of the house somewhere safe while you prepare to move out.", "NTA.  I'd be getting a camera to hide in your room until you move out.  \n\nDefinitely don't eat the food, for sure yours would get something extra in it.  Or what you could do is take it but swap plates with someone, because if theres nothing wrong with it then swapping meals with another family member should be fine right.", "Hang on a minute... she literally has *bleached your clothes* but you are the hostile one for not eating whatever crazy girl has cooked?\n\nAsk your father where his compassion and care was when she destroyed your property, attempted to ruin your hair and made you out to be some sort of sexual deviant who steals her underwear and stepbrother lube? You ARE being civil. You have always been civil. HE is letting YOU down because obviously his wife's daughter has some major issues with you and he isn't doing anything to defend, help or put a stop to it.\n\nNTA. I wouldn't eat her food either. TBH, I'd have looked at different housing options right after the underwear/lube thing.", "Nta.  If he won't protect you or believe you to avoid making waves, he should at least have the decency to keep his mouth shut while you ensure your own safety.", "# NTA", "NTA. Don’t eat it. Prolly has slugs in it or some weird shit.", "What in the world? She's gonna poison you. I believe it.", "Tell your dad you'll eat her food if you can get a plateful and then switch with him so he eats yours and you eat his, but without everyone else knowing.   Lets see if she poisons him first.  Her prior actions are serious and disturbing.  I hope you're going away for college.   NTA", "NTA. Do you have any allergies? If you do decide to eat her food, switch plates with your dad and have him deal with the consequences of whatever she's trying to sneak into your food.\n\nI was glad to read you were getting out of there soon. I hope you can lock down all your stuff (start living out of a suitcase since you are moving soon) so she can't tamper with them anymore. And if you have a room to yourself, consider getting a camera to watch your stuff.", "NTA get a camera for your room. Catch the weirdo on film and show the uncaring ‘adults’ the truth.", "Agreed, get out of there. OP, do you have close friends or other relatives you can live with?", "I would stay with my mother but six feet under wouldn’t really be comforting for the living💀", "Brilliant idea.", "Tested for…? It’s not like there’s one test that returns “THIS FOOD WAA TAMPERED WITH!” \n\nLikely she’d start with something low stakes like spitting in it, and the only test I can think of for that is DNA testing, lol.", "That sounds expensive and she wouldn't get an answer back until she's already moved out", "Tested for WHAT? \n\nDo you guys think you can just dial a magic number and have CSI come out and do a full test on something for ANYTHING? With no reason given? Without knowing what to test for? With no one having gotten sick or hurt?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I'm so sorry for your loss. You definitely don't need to deal with that type of nonsense on top of grieving. \n\nHow about grandparents, aunt's, uncle's, cousins?", "I'm so sorry for your loss. I saw you said it happened a while ago, but I need to say... This response damn near made me spit my drink on my husband.", "Oh lmao, it’s fine!!! I was just being overly facetious plus it happened over 6 years ago. I’ll be fine, I’m renting out a place at the start of December!", "NTA. \"Bewildering\" is not the right word to describe her behavior: psychotic is more fitting. She's undoubtedly up to something nefarious with the food so you're right to avoid it. Also, get a lock for your room to protect yourself and your belongings until you're able to move out.", "NTA. Tell you father he and your STEPMOTHER make the relationship bad with them when they dont defend from your stepsister. \nThey dont doit nothing about It. Put a lock in your room. And Tell them, sorry, but You don't trust in her enought to eat the food. And if something apens you are sure they dont gonna be doin nothing about It. \nIf you can, please live that House soon as posible.", "[removed]", ">Recently, my sister started to offer cooking our meals when she has never cooked for us before. Suspiciously, I have chosen to not eat her food and when everyone asks me why, I just say I’m not hungry even though she seems pissed. This may sound crazy but I think she is capable of doing something to my food, to try to make me “sick”\n\nTake one for the team and get her ass thrown in jail on attempted murder charges. If she puts anything not fit for human consumption or medication she would be in deep shit.\n\nAlso when you get your own place, go back once and thrown away all her left shoes. Cut out all the backsides of her pants, and sprinkle capsaicin (the chemical that makes peppers hot) on her tampons. Replace her shampoo with cooking oil. \n\nIf you need more ideas, i got plenty.", "NTA. She sounds like someone who would laugh at you when you vomit blood on the plate and make a stupid comment about it and everyone siding with her.", "Some parents are just so incredibly stupid and dangerous to their children it’s exhausting! MOVE OUT!!", "NTA. But i would suggest to switch plates with your dad or stepmother or make sure it is a family style dish you can take yourself. Then you can eat it and should be save", "NTA Do not eat that food!!!", "NTA. You really need to make arrangements to live somewhere else. But in the short term, privately tell your dad that you will eat a meal that she cooks, but only if you swap plates after everyone is served but before eating. \"I don't want to believe that she'd do something to my food on purpose, but a lot of coincidental things happen to my belongings when she's involved. This would make me feel comfortable, and there really shouldn't be a difference between our food. Should there?\"", "NTA Here's an idea, agree to eat her food but when she gives you the plate switch with your father. Let's see what happens!", "NTA especially if you're allergic to something the rest of the family isn't. That's how she'd do it, 'oops, does that have peanut, I didn't realise'.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You sound like me \"it's fine, my trauma just made me funnier!\"", "NTA and thank God you'll be out of that situation. Agree with you step sister is definitely up to something by cooking for you.", "I'm not hurt. I'm a lot tougher than people think...", "That's why I got such a high score on my mental health evaluation!", "NTA\n\nI'd be incredibly suspicious too. \n\n>Now, that I’ve been doing it many times, my father has told me to stop being hostile and to get a plate. I told him the same thing and didn’t eat it. But, he pulled me aside and **told me I was making our relationship hostile with her kids**. He said that I should be the “civil one”. \n\nSo basically your father doesn't want to rock the boat. He cares more about being liked by his stepkids than his own daughter's safety and wellbeing. If he's so confident that your stepsister is innocent then challenge him to switch plates with you.", "NTA. She's abusing you and your father and stepmother are enabling her behavior. You need to find somewhere to go. She'll continue to be abusive if her actions are not addressed soon. Future relationships with family, friends, possibly even her children whenever she has them, will all be effected. If you have friends or family that you can stay with, I suggest staying with them until an agreement can be made. Your parents don't understand or care about the severity of the situation or the stress it puts on you. Honestly, you should be prepared for your father and step mom to take her side too. It happens sometimes. But, family is not blood. So don't feel obligated to stay if you don't feel safe.", "Nta, I think you should take up cooking too and serve the food with a fake smile. See how she likes it. Eat the food she is cooking but grab your dad's plate. Play the same games she is playing but kill them all with sugary kindness. Good luck!\nGet the hell out of there as soon as you can.", "NTA. It's completely reasonable to be worried that she would tamper with your food. What isn't reasonable is that your father and stepmother refuse to do anything about your stepsister's hostility. She burnt an antique book, that can only be intentional. The sooner you leave, the better. It really does sound like she's working her way up to doing you actual physical harm.", "NTA. Get a nanny cam for your room and have video proof of what she is doing. Then go to your dad.", "NTA. But, why does your father suck so much? Can you ask him why he doesn't care about you, and won't protect you?", "NTA. If you dont feel safe is there somewhere else you can live? Mum? Grandparents? It sounds like your sad isnt taking your feelings and concerns seriously which is worrying. Try talking to him alone just you two and if nothing changes maybe you need to look at alternative living arrangements.", "NTA. Don't eat her food. I'll think she was going to screw with me too. I'm pretty sure she plans to do so. Enjoy your new place.", "NTA. But prepare to move out. She has some issues with you, it will not end well.", "NTA. Do not- DO NOT eat the food. I read this sub for a laugh most days, but this genuinely disturbed me. Your fear is rational. You wouldn’t feel that way if you didn’t have very good reason to. It’s not normal to actively avoid food when hungry; your intuition is telling you that something is wrong.\n\nThis is very dangerous. People like her will continue to experiment with escalations- especially when they see no consequence to their actions. Do not interact with her, get a camera as suggested, and please leave if at all possible.", "NTA don’t do it", "NTA.\n\n> He said that I should be the “civil one”.\n\n\"I don't understand.  Why does she not need to be civil?\"", "Next time your Dad asks you to get a plate tell him you’ll gladly eat his, if he eats yours.", "Question.  Is everyone else eating the same food an not getting sick?  Do you have allergies?  If the answer is everyone else is eating the same food without issue and you have no allergies, eat (but serve yourself).  But I won’t call you the A H here bc she sounds like a complete lunatic.", "NTA.  But log it all point out that if you get sick after eating a thing she makes you're calling an ambulance and the police.", "Nta. If he won't protect you or believe you to avoid making waves,", "OP, to add to this, in the meantime, tell your stepdad that you will eat when she cooks ... but you and he are going to switch plates.", "She's undoubtedly up to something nefarious with the food so you're right to avoid it.", "NTA. This person has given you reason to be suspicious so you need to look after yourself.", "Great solution!", "Make sure they don't get keys, that the landlord never lets them in and you get a doorbell camera. I'd put nothing past this girls, she sounds seriously screwed up.", "Wow. Now I know why I'm writing jokes to maybe try at an open mic night. \"Better to laugh than cry\"", "Lol. My husband just did a mental fatigue questionnaire for his occupational therapist, and I \"bragged\" that I aced that one."]}