{"id": 31109, "submission_id": "17wv4r5", "title": "AITA for interfering with my cousin’s childcare? (Now she has to travel internationally with a baby on her own)", "selftext": "Basically my cousin Ray is getting married early next year in my dad’s home country. He wants to travel there for the wedding.\n\nMy cousin Faith lives in the same country as my dad and wants to travel with him to go to the wedding but also return home for the first time since she got married and had a child (1yo.)\n\nIt would be a long journey and I guess she wants help. \n\nBut she never asked my dad his plans. He’s taking a connecting flight so that he can have a layover for a week in my country and spend time with me and my kids.\n\nSo when she told my dad she plans to travel with him, he told her that he intends to stay a while with me and that she should travel from point A to B alone and then my dad will meet her at B airport and travel together to point C.\n\nNow Faith is calling me begging to tell me to tell my dad not to stop over at my place or to let her and her baby stay at my place too.\n\nShe and her mum (dad’s sister) have gotten increasingly aggressive and I’m like am I TA for wanting to just spend time with my dad without being responsible for a guest?", "created_utc": 1700162681, "permalink": "/r/AmItheAsshole/comments/17wv4r5/aita_for_interfering_with_my_cousins_childcare/", "score": 163, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1 I encouraged my dad to break up his international flight so he can visit for a week. I didn’t extend this invitation to my cousin and her 1yo. She’s been suggested to fly out after my dad and meet him the day he leaves from my place so they can make the final journey together (my idea).\n\n2 she says I’m the AH for not inviting her, she says I’m TA for not caring that she’s not experience at travel and for taking away the childcare she was relying on (my dad) for her kid’s first flight\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYou and your father aren’t responsible for your cousin. You, or your father, have no obligation to change plans to accommodate her. \n\nYour aunt has such as issue with it, she can fly over and be a travel buddy for her daughter if she’s that incompetent that she can’t travel alone. \n\nThis is not your problem to solve.", "NTA\n\nShe's married.  She has a spouse and a second parent for her child.  If she needs help on her kid's first flight, she should be making plans to travel with her spouse so they can share parenting duties for their child.  Especially as she is traveling to attend a wedding which presumably her spouse would be invited to.\n\nIf she needs help from someone besides her spouse, she needed to ask for that.  Not ASSume it would be provided to her by default.  But she assumed and then got bit when it turned out your dad made other plans.  Oh well.\n\nAgain, if she REALLY needs to push someone for that help with her child, I suggest she start with her spouse/child's parent.  And then move to her mum.", "\"I understand what you need here  Faith But, I already made plans and the plans didn't include you. So, this just isn't doable from my end. I'm looking forward to just being with my dad. You'll have to make arrangements and work this out for yourself. I apologize for prioritizing myself, but that's not negotiable. I don't want to give up time with my dad to help you out. He's my dad, after all. *I want to spend time with him.* Hope things work out for you. Bye.\"\n\nNTA.", "NTA and neither is your father. No one was even asked whether they would provide childcare! This isnot tour problem or your father's problem.", "NTA, your cousin made her plans without asking the person she was expecting to help her about them... it is not yours neither your dad's fault she didn't think asking was an important detail of her plan...\n\nYou and your father do not owe her anything and if your plans are already settled, let them be and enjoy your dad's company.", "NTA. Your dad has offered a reasonable solution, especially since it doesn't seem like he was asked if he would be willing to help. Surely your cousin can handle 1 leg of the trip on her own.", "NTA. It's completely reasonable for you to want quality time with your dad without having to take on the responsibility of hosting a guest and their baby. Your cousin should have asked your dad about his plans before assuming she could tag along. It's important to set boundaries and prioritize your own needs.", "NTA\n\nShe's not that special that you and your dad have to cancel your own plans just to accommodate her.\n\nShe cannot expect that everyone will drop everything to help her out - and then to react that aggressive is simply the icing on the cake.", "NTA. You dad should not have to give up a visit with his family.  It would be nice to invite her if you could but if that’s not possible, she’s an adult and will have to figure it out on her own. Maybe bring a friend with her to help her with the baby on the flights.", "NTA. Also I know 1 year olds are hard but plenty of people solo travel with their 1 y/o, it’s hard but not impossible. Especially bc it’s only a short time that she wouldn’t have your dad’s help. If she can’t handle a bit of time alone traveling with her kid she should reconsider going or find someone else to go with her", "NTA. The second Dad said she should meet him at B airport to travel to C, she should’ve known that was the polite way of saying no.", "You didn't interfere, your dad had his own plans. She's a grown ass woman, she can ask him herself.\n\nAnd if the answer is no, then the answer is no. Most airlines can provide special assistance with young children, and the wedding is next year, she can figure it out.\n\nNTA", "NTA, it sounds like your dad wants it to be just the two of you also since he told her to meet him at point b.", "NTA - You and your dad don't own her anything. Plus, she anticipated and believed, in her head, that she had a claim to your father's time,", "NTA.\n\nYour dad has a plan.  You have a plan.  They depend on one another because they were made with each other’s consent and knowledge.  \n\nCousin made a plan on her own, no consent or knowledge and TOLD others they would participate in her plan and it fell flat.  Don’t just tell her know tell her h e l l no I’m not changing my plans.  We’re doing us.  You go do you.", "NTA.\n\nYour dad has already told your cousin 'no' to helping her, please do not allow this woman to go around him. HE ALREADY SAID NO.\n\nThe sheer effrontery of your cousin.... you should count yourself lucky that you don't live anywhere near her.", "NTA. How are you interfering? Those plans were already made and you haven’t opened your mouth. She’s the one interfering in your and your dad’s plan because she didn’t plan properly.", "Nta", "NTA.  Your cousin is an adult who can go without needing someone to hold her hand.  She and your aunt have no right to demand anything or blame you for anything.  Personally I would block them and go no contact.", "No is a complete sentence.   Tell your cousin that your dad is spending a week with you and your family and you will see her at the wedding.   Anything nasty she says, turn it right back around and repeat other.", "NTA, she assumed and guess what assuming makes of you?\n\n She is acting highly entitled and she should have asked your Dad his plans first. She isn't even being asked to make the whole journey by herself, just half. Even if it was the whole journey, still wouldn't make you or your dad the asshole simply because she didn't ASK. Your aunt can take a hike.\n\nWhat does your dad say about her asking this?", "NTA.  She wanted him to be a free babysitter. Sorry. She shouldn't have made assumptions. Nor should she try and use you as a free hotel.", "NTA, you deserve time with your dad without being responsible for a guest.  Your aunt can step in and help her daughter vs dumping it on her brother.  That part is a little weird - your daughter is travelling with her newborn and rather than help her out, the aunt has her brother do it (OP's father).", "NTA. I frequently traveled with a one year old solo. Is it difficult? Yes. Impossible? No. \n\nYou’re not responsible for her lack of planning and neither is your father. She has a husband who should be the one to help. Or she could use this as practice to travel on her own with the toddler", "Absolutely positively NTA. Faith should’ve been upfront about her plans and intentions with your dad from the start. That’s her fault, not yours! \n\nNeither you nor your dad are obligated to change plans or accommodate hers, especially if neither of you were aware of her “need” from the start.", "NTA. They made an assumption that your Dad would fit in with their plans. He made his own plans. He has a right to stick to those plans. You are NTA for being happy your Dad chose to stick to the plan of visiting you.", "NTA, what an entitled pair. Does your dad know they’re harassing you? Yes, traveling with babies and small kids is hard, but that doesn’t make it everyone else’s problem to solve.", "Noooo, don't let her take advantage of your dad! She has a husband and a flying mother. Not your issue. Your dad deserves bonding time with your kids. NTA", "# Hi Faith, Thank you for checking in with me but unfortunately Dad and I have fixed plans during his visit and I cannot accommodate any other guests. He mentioned to me that he can meet you at point B on xx date so you can travel the last leg to Ray's wedding together. Have a great time at Ray's wedding and maybe we can catch up some other time. Also please let your mum know that we cannot change the plans we made or add anyone to our itinerary. \n\n# Hugs xx, \n\n# OP and OP's Dad. \n\nWhy can't she travel with baby alone? Millions of people travel with kids.. I did and so did my husband separately from me.. I once did a multi - country month long trip with a 7 month old alone.. Husband traveled with two under 5 to Europe for a month as well. We managed individually and together with our kids.", "Nta", "YTA. \n\nWould it kill you to be a tiny bit accommodating?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBasically my cousin Ray is getting married early next year in my dad’s home country. He wants to travel there for the wedding.\n\nMy cousin Faith lives in the same country as my dad and wants to travel with him to go to the wedding but also return home for the first time since she got married and had a child (1yo.)\n\nIt would be a long journey and I guess she wants help. \n\nBut she never asked my dad his plans. He’s taking a connecting flight so that he can have a layover for a week in my country and spend time with me and my kids.\n\nSo when she told my dad she plans to travel with him, he told her that he intends to stay a while with me and that she should travel from point A to B alone and then my dad will meet her at B airport and travel together to point C.\n\nNow Faith is calling me begging to tell me to tell my dad not to stop over at my place or to let her and her baby stay at my place too.\n\nShe and her mum (dad’s sister) have gotten increasingly aggressive and I’m like am I TA for wanting to just spend time with my dad without being responsible for a guest?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  She didn't even ask him for help so that he could give her the necessary information. She has to figure out her travel alone. Have fun with your dad!!", "Question, please… With so many different countries involved are there any cultural differences that would make your cousin uncomfortable traveling alone with a baby?", "NTA", "NTA", "INFO - where is the father in all this? Why is he not taking care of the child?", "NTA. This is your planned time with your dad. Why doesn't she have another adult to travel?", "NTA\n\nYour father - her uncle - is not her child's childcare. Your father has other plans.", "NTA. It was rude of her to assume she could travel with your dad so he would help her, it's rude of her to ask your dad to change plans and not see you, it's rude of her to ask you to forego seeing your dad, and it's rude of her to ask to intrude on his visit and for you to host her. \n\nIf your aunt cares so much, then she should travel with Faith and help her out. Also, how did she conceive this kid? Through immaculate conception? If not, where is the dad and why isn't he helping?", "Yeah, I'm curious why her spouse isn't traveling with her too. Especially to a wedding.", "Want, not need. Faith doesn't *need* OP to do or change anything at all; she just *wants* it.", "Great except the words \"I apologize...\". Nothing to apologize for at all.", "faith doesnt need anything, she just wants a babysitter.", "This is too much IMO. All OP needs to say is, \"I'm sorry, Faith, but my dad and I already made plans and we can't change them. He can't change his travel arrangements and I can't accommodate any more guests.\"", "Honestly, I wouldn't be thrilled to host a cousin and their one-year-old child while I was catching up with a seldom seen parent. It's wouldn't be comfortable for OP or their Dad TBH.", "lol what the fuck. OP isn’t responsible for the fact her cousin doesn’t want to fly alone. She doesn’t have to accommodate having a baby around when she just wants to spend time with her father. \n\nWhat a ridiculous response.", "WTF??? A tiny bit accommodating? Come on. Cousin is in the wrong.", "What I wouldn't give to spend a week with my pops. That's not a selfish want? Its a child/parent thing?", "This is a wild take. Her lack of planning and assumptions of others are the problem here, not the OP having previously arranged time to visit with family.", "Wrong AITA thread. Sorry. Faith really should seek assistance from her husband or her mom - anyone who actually WANTS to help her out. I agree with you.", "The selfishness in this SR is next level nonsense.", "It's amazing how just rude and selfish people in this SR can be.  Astonishing.", "I don't disagree with this sentiment, but with this situation, you're off base.  It's the height of rudeness what the cousin is doing.", "My father raised 9 kids. He's gone now. And in our adulthood, we often got to hang out with dad. The memories are precious to us.\n\nNo one should feel like they can't spend time with their parent for someone else's *convenience*. \n\nThat expectation is what's selfish.", "Not accommodating an inconsiderate and presumptuous person isn’t rude or selfish, but your attitude sure is.", "I'd imagine inviting yourself along to a family visit between a parent and adult child with kids, without any real interest in it aside from your own convenience, to be the selfish thing here.\n\nYou can call other people rude or selfish all you want, but its the cousin that is both of those things."]}