{"id": 31105, "submission_id": "17wvepj", "title": "AITA for laughing at my BIL for when his son got a zero on is project he did.", "selftext": "So my child is three grades ahead of my sisters kid. I’m going to call the teacher Mrs. Cat. Now personally I don’t really like her but I do respect her. She is a very no nonsense women and she will make sure that you learn. She has the highest test scores for years. Very clear in her expectations with parents and that she won’t put up with our crap.\n\nI’m a bit ashamed to admit, that I sent her a whole list of question about her class and she literally sent back, the pdf of her handbook that I already had and told me to read. Every question I had was answer in the first few pages. There are other stories about her but really is a no nonsense teacher and she truly doesn’t care about the parents feelings. She taught my daughter extremely well. \n\nNow there is a project where you make a model of some Native American groups home and write a small paper about it. Well my BIL did that whole project. Mrs Cat made a quiz about the paper that was written and gave it to his son. Well son failed it and admitted he didn’t do it.\n\nI saw the email that was sent and in a very professional way ripped my BIL a new one. His son got a zero and is allowed to redo the project at school.  He went in and person and according to him got ripped a new one.\n\nHe was complaining and going to take it to the principal and I started laughing. I told him this as hilarious and I hope he learned his lesson. He’s now pissed at me.", "created_utc": 1700163422, "permalink": "/r/AmItheAsshole/comments/17wvepj/aita_for_laughing_at_my_bil_for_when_his_son_got/", "score": 819, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I laughed when my bill got ripped a new on for doing his kids project. I could have been nicer about it even though I think it is halarious\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nSome parent complaining when he cheats for his son and is caught and his son has to pay the price.... except he can redo in school.  Was your BIL more upset he was caught, or that he got a 0?  He needs to apologize to the school and have his son with him so his son can see that cheating is not allowed and even an adult must accept punishment and doing it with grace.", "NTA. Helping your kid with a project is one thing but to do the whole thing is way over the line. He's hurting his kid's education and the teacher called him out of it... good for her! What is he going to say to the principal... \"I did my son's project, he didn't learn anything he was supposed to by doing it himself, and the teacher was mean to me\"... that is hilarious!", "If the parent does the work FOR the child, the child won't learn.\n\nNTA", "NTA You weren't laughing at your nephew, your were laughing at your brother in law.\n\n>Now there is a project where you make a model of some Native American groups home and write a small paper about it. Well my BIL did that whole project. Mrs Cat made a quiz about the paper that was written and gave it to his son. Well son failed it and admitted he didn’t do it.\n\n>I saw the email that was sent and in a very professional way ripped my BIL a new one. His son got a zero and is allowed to redo the project at school. He went in and person and according to him got ripped a new one.\n\n>He was complaining and going to take it to the principal and I started laughing.\n\nWhat is going to complain about? He was a dumbass that did his son's homework and got caught and called out. The teacher has given your nephew the opportunity to resubmit the project. What the heck does he think the principal is going to do?", "NTA - Your BIL is not helping your nephew by doing his work and I'm sure that's exactly why she gave the quiz. She knows that too many parents do the work and the kids haven't learned anything. Let him take it to the principal - the principal should put him in his place and tell him he's not the student, his son is.", "I hope your BIL has fun explaining to the principal how he did his son's work and expected his son to lie and cheat and pass it off as his own, and how the teacher was inexplicably mean to him.\n\nGood for the teacher for allowing the child to redo the project.  His father's dishonesty is not his fault.\n\nNTA", "NTA. Your BIL getting busted is funny, but not so much for his kid. Hope he learned his lesson.", "NTA- Bil ego is bruised, and he is doing diservice to his son by doing all the work himself and not letting him learn.", "NTA. At all.\n\nThis teacher sounds pretty great. She let the kid come in and redo the assignment? She directed her ire towards the adult decision maker instead of the child? She by your account is known for this no-nonsense personality and isn’t acting differently towards your BIL? 10/10 teacher behavior. Hurt feelings are not fatal, in fact, they’re rarely even harmful. Nice to see someone out there still encourages resilience.", "NTA\n\nHopefully he has learned a lesson here and while its absolutely fine to help your child with their project its not ok to do all the work for them.", "NTA I laughed so much when I read this post. I think this teacher sounds fantastic. She might be 'tough', but she sounds fair and consistent, and children need this. \n\nI'm in my fifties and studying to be a teacher (yikes!). I hope I can be as good and confident as this teacher sounds.", "NTA, he did his son's work, he got caught, he tried to be entitled and got in trouble again, yep pretty funny except for the fact that he did the kids work.", "NTA, or if you are then I am, too, because I also laughed.", "NTA\n\nTeachers give assignments for the kids to learn.  If a parent does it for the kid, they learn nothing.  If you do it WITH your child, you get fun bonding time and you child learns something.  Looks like your brother-in-law learned something here too.", "NTA. He’s projecting his anger (shame) on to you. Laughing might be a smidge much :) but hopefully he learned a lesson.", "NTA. PLEASE update if he tries to take it to the principal lol.", "NTA, Mrs. Cat sounds like a very competent teacher, and your bil tried to game the system. In my view it is better the kid fails and recognizes that he has to get started on it and not wait until the day before. Agonizing for the parents but good for the kid.", "Do you remember what the teacher wrote in the email where she professionally ripped BIL a new one? I could use a laugh.", "Former teacher here. The angriest I’ve ever seen a parent is when she wrote her kid’s essay and I gave her a failing grade. She didn’t follow directions at all. Kid was fine. Mother was livid. \n\nNTA", "The teacher is 100% right to do what she did, but that's not the question here. The question is were you an AH for laughing at your BIL, and yeah, I think you probably were. Delighting in others misery, even if they brought it on themselves, is almost always an AH move. The teacher has this one under control, and your laughter didn't help her, your BIL, or his son.\n\nYou don't have to be wrong to be an AH, and YTA in this situation, even though I agree with you and the teacher on what the kid needs.", "What your BIL did not do was help his son. The child learned nothing, as evidenced by the test. She was quite right to deal with his father. \n\nHe should have had the sense not doubling down and doing so again.  go into school. When you make yourself look foolish once there's no point in doubling down and looking foolish twice. Your laughter was well-deserved. NTA", "YTA and Mrs Cat can go fuck herself", "ESH, seem to me like this teacher is too self-important and needs to be knocked down a level or two.\n\nBIL shouldn't be doing his kids projects.", "YTA for laughing at your BIL's situation, but I can understand why you found it amusing. It's important to remember that everyone makes mistakes and has different learning experiences. Rather than laughing, it would have been more supportive to offer some advice or encouragement to help him and his son understand the importance of completing assignments.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my child is three grades ahead of my sisters kid. I’m going to call the teacher Mrs. Cat. Now personally I don’t really like her but I do respect her. She is a very no nonsense women and she will make sure that you learn. She has the highest test scores for years. Very clear in her expectations with parents and that she won’t put up with our crap.\n\nI’m a bit ashamed to admit, that I sent her a whole list of question about her class and she literally sent back, the pdf of her handbook that I already had and told me to read. Every question I had was answer in the first few pages. There are other stories about her but really is a no nonsense teacher and she truly doesn’t care about the parents feelings. She taught my daughter extremely well. \n\nNow there is a project where you make a model of some Native American groups home and write a small paper about it. Well my BIL did that whole project. Mrs Cat made a quiz about the paper that was written and gave it to his son. Well son failed it and admitted he didn’t do it.\n\nI saw the email that was sent and in a very professional way ripped my BIL a new one. His son got a zero and is aloud to redo the project a school.  He went in and person and according to him ripped him a new one.\n\nHe was complaining and going to take it to the principal and I started laughing. I told him this as hilarious and I hope he learned his lesson. He’s now pissed at me.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta. I wish teachers did what she did for me when my dad would take over my homework and do it for me. I’d ask for help formatting, cause I didn’t know how to do things like add pictures to word, and instead he’d edit the entire thing. Change the words, google and add his own images. And he would tell me to be quiet when I tried to ask him to stop. And teachers didn’t care if I told them, telling me to take the A.\n\nShe sounds like a good teacher who actually wants her students to learn.", "NTA\n\ngrown-ups like your BIL are the reason good, qualified teachers are leaving the profession in droves", "NTA... these are the parents educators hate.\n\n&#x200B;\n\nAsk him if his son doesn't get a job in the future, is he going to ask to speak to the manager? You see where this is going...", "NTA. \n\nHis ego on many levels is hurt. As a parent, a father, and a male. \n\nI’m a male, and I often remind myself to check my ego.", "NTA...\n\n> He was complaining and going to take it to the principal\n\n...but honestly Y-T-A for not immediately saying \"you know what, you're right, and I'm gonna come with you for support!\"", "NTA. She sounds like an great teacher. And your BIL isn’t doing his kid any favors.", "NTA.  He’s being ridiculous if it was a different situation and the child just got a zero because they tried and failed that would be mean I would laugh your PIL to.", "NTA. He actually went in to complain that his kid got a 0 on a project he did?! I would laugh too.", "NTA - at least the kid is being given a chance to redo it.", "NTA, he deserved it and that's hilarious lol", "NTA", "NTA. \n\nI hope he takes it to the principal so he can get laughed at again. Maybe then he'll learn his lesson.", "LoL it reminds me Brian did the SAT for Mag and failed. Your BIL is an idiot and he has the balls to complain. For shame. NTA", "NTA.", "NTA. These parents that think that they can convincingly write like an elementary school student crack me up.", "He's gonna take it to the principal? \n\nYes, I did my son's homework how dare the teacher figure that out?  \n\nI'd love to see that conversation. \n\nNTA", "NTA it IS hilarious! I admire the teacher taking the time to make up quizzes based on each project as well. That teacher puts a lot of time into teaching the children.\n\nI never understood parents like your BIL who do the kids projects for them. It helps no one and the kid learns nothing. What was even the point of him doing it?", "I just want to say I LOVE Mrs. Cat-she sounds like a good teacher.  She is not a cruise ship director, she has a job to do and I like that she doesn't take parents crap. I'm kind of similar.   NTA-a parent who would do their kids project needs to be put in their place.", "NTA, my highschool bully had his mom do the same thing in college, except he got expelled over it and now cannot go back. His mother ratted herself by emailing the professor complaining it was only a C after she said all the work she did. Found out when she posted on Facebook complained and admitted the whole thing. The shocking part was the comments of parents agreeing with the mother. They are idiots to say the least.", "NTA\n\nThis teacher is a hero. What gets lost in this whole \"parents do the project for the kids\" thing, aside from the fact that they don't learn anything from the experience, is that the kids who DO do it themselves feel like idiots because their projects usually look much worse than the Professional jobs. It can be a real confidence killer.", "NTA. Just because he cheated his way thru school doesn't mean it is right to do it.", "NTA - I can't imagine an adult pissed at his BIL/SIL just because he cheated for his son and got caught by the school and you laughed.", "Lol NTA. He had it coming.", "NTA, it's hilarious", "I think he is mad that she ripped him a new one and truly didn’t care about his feelings. Or he got mad he was caught", "100%. You could always tell which students always had their parents do the majority of the work for them when they get to college and have no idea how to do work or learn (I was a grad TA for many years).\n\nI will admit my mom did one school project for me. It was my senior year in high school and my horrible AP government teacher (I can't tell you how many parents complained about her to the admin) assigned us to make posters representing political parties. No text, just print out or cut out pictures representing a political party. We also didn't have to give a presentation on it or anything. Just turn it in. I was overwhelmed in my other classes and my mom decided that I was going to learn literally nothing new from this project (she asked me what the main political parties in the US were and what some of their basic platforms were). And so she printed some stuff out from online, glued them on the poster, I got an A and I am no worse off for it. But every other assignment she would help me with if I needed, but I was responsible for doing them.", "really, you don't think the dad knows the importance about assignments, maybe the kid, but not the parent. Than he doubles down and goes in person to the teacher and gets ripped again. Yeah, i would have laughed also.", "So now OP has to teach her BIL how to be honest?", "Hey, he should be grateful for the free lesson...", "Don't forget he also wants to escalate to the principal that his son got a zero for not doing any work! I know I laughed.", "Yeah she should send him a bill.  I don’t teach unless I’m getting paid for my time."]}