{"id": 31124, "submission_id": "17x1jn8", "title": "AITA for telling my friend that her house is disgusting?", "selftext": "Tl;dr- my friend makes me feel bad every time she comes over to my place and comments on how smelly it is. No one else can smell anything. I finally lost it and yelled at her, pointing out how her house always smells like dog poop and she called me TA for making her feel incompetent. \n\nHi all. Annie (24F) and I (22F) have been friends for years. While we generally get along great, she always makes me feel insecure every time she comes over to my place.\n\nFor context, I’ve got multiple cats and work extremely hard to keep my home clean and smell-free. I’m talking air purifiers in every room, vacuuming twice daily, steam mopping everyday, dusting furniture, changing bedding very frequently and ensuring all pet products, including bedding, dishes, fountains, litter boxes etc. are very clean and sanitized. Cats also get groomed regularly. I don’t just do this before guests, this is my daily cleaning routine (I don’t work). \n\nEvery single time Annie comes over to my place, she makes me feel extremely self-conscious and without fail, makes comments regarding the “smelliness” of my house. “Dang if you’re gonna have guests over, at least make sure your house doesn’t smell like shit” along those lines. Every. Single. Time. It’s gotten to the point where I’ve gotten paranoid about inviting people over. \n\nI’ve asked ALL my friends and family if they can smell anything in my home and literally everyone says no and praises how clean I keep it. Even my brutally honest friends have said that my house smells like absolutely nothing. There’s no weird “cat smell”. Now I’m worried. Is she lying or is she the only one telling the truth? \n\nThings came to a head three days ago. We went out and decided to relax at mine on our way back. Before even entering my house, Annie pulled out perfume from her bag and upon entering, proceeded to spray it everywhere while saying “phew, this thing’s a saviour!” \n\nImmediately, my flat-faced elderly Persian who already has trouble breathing started sneezing continuously. You guys, I lost it. I yelled at her telling her that she’s either a liar or she just wants to feel better about herself since her house always smells like shit. She’s got two huskies that she rarely grooms, her backyard always smells of dog poop since she never picks it up and her house 100% has the “dog smell” but no one says anything because we’re too polite. \n\nShe started crying and called me TA for making her feel bad about her house. She works full time and I don’t, so she said that having a clean house is a privilege and that I’m being boastful. I countered with “then stop saying things about my house!” to which she replied “you don’t work so you should keep your home cleaner”. \n\nAll my other friends are on my side but I can’t help but wonder, AITA?", "created_utc": 1700179267, "permalink": "/r/AmItheAsshole/comments/17x1jn8/aita_for_telling_my_friend_that_her_house_is/", "score": 96, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > It’s understandable that Annie’s house isn’t in pristine condition at all times and I shouldn’t have compared ours since I have the time to keep it clean but she works full time and doesn’t have as much time to devote to cleaning. It was definitely judgmental of me to say that considering our circumstances.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Why are you friends with a person that is berating and belittling you like this? You have one life and you're wasting some of that time on an asshole", "Wow I had a \"friend\" like this. I stopped inviting her over because she'd always point something out that was \"messy\" about my place yet her apartment was an absolute MESS, I mean shit everywhere, and I was nice enough to never say anything. It made no sense but I found out that she was just a toxic person who deep down had some jealousy towards me for whatever reason. Sound similar? \n \nDefinitely NTA. She had it coming. Even if your place was dirty or smelly, a real friend would bring it up nicely and not be disrespectful EVERY single time they go to your place. I'm sure the perfume is more a life saver for her own stank lol. Oh and I love how she admits that you in fact do have a clean house and she doesn't because she works full time. What a joke. I think it's time to reevaluate that friendship", "INFO: Why are you friends with this person?", "Absolutely NTA I would’ve been like “it’s YOUR smell bouncing off the walls” and sprayed her with her perfume 💀", "NTA. Annie is not your friend. She’s the kind of person who has to put others down to make herself feel better. Those types never get better. Kick her to the curb.", "NTA This doesn't sound like a friend to me, especially one who'd ever be invited to my home.  \n\nFriends don't make snide comments like that.  If she was a true friend and your home really did stink, she would tell you in a way that isn't rude or insulting.", "NTA. Your friend needs to learn some manners. It's not okay to constantly criticize someone's home when there's no evidence to support their claims. It sounds like you take excellent care of your place and shouldn't have to feel insecure because of her comments. Keep doing what you're doing and don't let her bring you down.", "NTA, time to stop allowing her in your home.  \n\nDoes she go out of her way to put down other stuff about you/your life?  \n\nIt sounds like your reaction made her reveal some deeper resentment and jealousy she has.   She thinks telling you your house stinks makes her house better.  She doesn't want to you to think you keep a cleaner home than her.  When you didn't take it, she exposed that you not working is an issue as well and she uses it as her excuse for your cleaner house.  \n\nShe sounds like the kind of person that belittles anything a normal person would admire or envy because she makes everything about her.    Does she put down nice things and accomplishments of others?   For example, if you were to start taking a class and get a degree would she sincerely congratulate you or would she say things like \"If I had extra time, I'd do that too\", or \"I read something bad about online degrees, I wouldn't waste my money\".  \n\n\nIf you really wanted to see her blow her top, offer to show her some housekeeping tips you've learned.", "NTA\n\nI also don’t work & have two cats. people love to assume that when you don’t have a job, you should be spending every second of the day cleaning, cooking, or doing something productive when that isn’t the case. yes you should do it more than normal i guess, but no one should ever tell you “since you don’t work, you should do this more” like ??? no absolutely not, that’s a shitty friend. \n\n& side note, my cat has respiratory issues so he can’t be around any perfumes, air fresheners, ect or he’ll have an asthma attack. if someone walked into my home with a bottle of perfume & started spraying it everywhere, i would also lose my cool. much worse than you did if i’m being completely honest. it’s disgustingly disrespectful & id like to assume your “friend” knew about your cats health issues since she’s been around for so long….which makes it even more disrespectful. some people just need called out on their shit & get off their pedestal.", "NTA. Annie is being a brat.", "Nta\n\nShe is insecure about her own home. Honestly, her behavior is disturbing. I wouldn't be inviting her over anymore.", "You continue to be friends with this person because....\n\n&#x200B;\n\nAnd don't say: \"because we've been friends for so long...\" or \"she helped me through some thing...\" or \"then I wouldn't have anyone...\" \n\nbecause any reason really to stay friends with someone who constantly criticizes you is not a good reason at all.", "NTA. So she can insult other people but can't cop it back. Nah man, not how it works.\n\nIf she is too busy to keep her house clean and pick up the dog shit, she should not be a pet owner.", "***you don’t work so you should keep your home cleaner***\n\nAnd your reply should have been that your home IS cleaner.  And to advise your 'friend' not to let the door hit her on the way out.\n\nShe went above and incredibly BEYOND rude that it is literally unforgivable.\n\nNTA.", "NTA. It's super weird that she cares so much about the cleanliness of your house when you are clearly going above and beyond to have it be clean. \n\nI honestly wonder if she smells, like her house probably, and she gets nose blind to it, but then when she's at your place with zero competing smells, she starts to smell it. And that's why she smells it everywhere at your place, cuz it's her smelling everywhere she goes. \n\nI have a chronic illness that during flares sometimes I smell things much stronger than normal and also smell things that usually are so faint that people usually don't smell them at all. It could be that she has something like that, though it seems improbable since it happens every time she's at yours. And because I would never ever spray a bunch of perfume when I'm like that, I'd probably feel so ill I'd puke my ever living guts out. \n\nAlso, who the f*ck thinks it's okay to start spraying perfume all over in someone else's house! And who the f*ck thinks it's okay to announce every time they are there that it stinks! Like you said, her house actually stinks and none of you said anything out of politeness. Her behavior leans more towards being jealous and making up a thing about you to make herself feel better, which is just not the type of person who makes a good friend imo.", "This is going to sound weird but being in a fresh clean environment may be emphasising lingering particles from her own living space in her nose and around her face. Especially if her poop smell is as bad as you say it is - dirty dogs and dog poo festers and lingers everywhere.\n\nThat’s giving her a benefit of the doubt that she’s not projecting, which is also a high probability. Either way, she is rude af and you are NTA", "NTA the only way I can see this being done without malice is that she's not used to being in clean air and can suddenly smell herself instead but doesn't realise.", "NTA, although you are wrong in calling this person a friend. You are correct when you say that she just wants to feel better about herself.\n\nBesides, everyone knows that cats smell better than dogs. LOL", "NTA, cut her loose. She basically admitted she does it to make you feel bad out. Because she’s jealous you have time and resources to keep clean. She sounds exhausting.", ">I’ve got multiple cats \n\nIs there a reason you're not saying how many? Because if you've got 10 cats then she might not be wrong.\n\nNTA regardless. The solution to her sensitive nose is that she doesn't visit any more. You're not a hero for screaming about her house being disgusting, so I assume you realize your friendship is now over.", "YTA to yourself if you continue to be friends with Annie. OP end this friendship.", "NTA\n\nSome folks have a stronger sense of smell or are triggered by some smells (so it’s stronger for them than others). Your friend needs some manners and some self-awareness", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nTl;dr- my friend makes me feel bad every time she comes over to my place and comments on how smelly it is. No one else can smell anything. I finally lost it and yelled at her, pointing out how her house always smells like dog poop and she called me TA for making her feel incompetent. \n\nHi all. Annie (24F) and I (22F) have been friends for years. While we generally get along great, she always makes me feel insecure every time she comes over to my place.\n\nFor context, I’ve got multiple cats and work extremely hard to keep my home clean and smell-free. I’m talking air purifiers in every room, vacuuming twice daily, steam mopping everyday, dusting furniture, changing bedding very frequently and ensuring all pet products, including bedding, dishes, fountains, litter boxes etc. are very clean and sanitized. Cats also get groomed regularly. I don’t just do this before guests, this is my daily cleaning routine (I don’t work). \n\nEvery single time Annie comes over to my place, she makes me feel extremely self-conscious and without fail, makes comments regarding the “smelliness” of my house. “Dang if you’re gonna have guests over, at least make sure your house doesn’t smell like shit” along those lines. Every. Single. Time. It’s gotten to the point where I’ve gotten paranoid about inviting people over. \n\nI’ve asked ALL my friends and family if they can smell anything in my home and literally everyone says no and praises how clean I keep it. Even my brutally honest friends have said that my house smells like absolutely nothing. There’s no weird “cat smell”. Now I’m worried. Is she lying or is she the only one telling the truth? \n\nThings came to a head three days ago. We went out and decided to relax at mine on our way back. Before even entering my house, Annie pulled out perfume from her bag and upon entering, proceeded to spray it everywhere while saying “phew, this thing’s a saviour!” \n\nImmediately, my flat-faced elderly Persian who already has trouble breathing started sneezing continuously. You guys, I lost it. I yelled at her telling her that she’s either a liar or she just wants to feel better about herself since her house always smells like shit. She’s got two huskies that she rarely grooms, her backyard always smells of dog poop since she never picks it up and her house 100% has the “dog smell” but no one says anything because we’re too polite. \n\nShe started crying and called me TA for making her feel bad about her house. She works full time and I don’t, so she said that having a clean house is a privilege and that I’m being boastful. I countered with “then stop saying things about my house!” to which she replied “you don’t work so you should keep your home cleaner”. \n\nAll my other friends are on my side but I can’t help but wonder, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. My brother does this to me, I do have pets. But his house reeks of mold and weed from roommates, the smell just smacks you right in the face when you walk in. So I started pointing out to him how bad it stinks when I go to his house. When I do that, he stops saying things about mine.", "She isn’t a good friend if she is a friend at all. Don’t accept anymore invitations or invite her to your house", "NTA. It sounds like you keep your house quite clean and I doubt that it smells. Annie has no manners and for some reason is trying to make you feel bad; this is not how a true friend behaves. Personally, I wouldn't want someone like that for a friend.", "Nta", "No, you have been a punching bag that doesn't hit back for years. You have been the victim of a bully for years. And like all bullies when you hit back, she cried victim.\n\n\nNow keep hold of that anger at her, she deserves it. Don't let her back in your home or life. You are just a person she puts down for her own pleasure and to assuage her insecurities. Is that who you want to be? NTA", "No, you have been a punching bag that doesn't hit back for years. You have been the victim of a bully for years. And like all bullies when you hit back, she cried victim.\n\n\nNow keep hold of that anger at her, she deserves it. Don't let her back in your home or life. You are just a person she puts down for her own pleasure and to assuage her insecurities. Is that who you want to be? NTA", "NTA.  She is not a friend. She tries to make you feel bad about yourself to the point where  you are questioning yourself and others about your home.  She is not a nice person. I would reconsider if you need this kind of negativity in your life.", "NTA you just put her back into her place.", "NTA - Shes not your friend, shes just a petty person who belittles you to make herself feel better.\n\nGet rid of HER stink once and for all.", "She’s insecure about her smelly house so she projecting. NTA op but your friend needs to mature and apologize for being a jerk.", "NTA.  She's regularly rude to you, and spraying perfume in your house is even worse than what she says.", "She's a toxic, jealous bitch.  She's **not** your friend. Cut her out of your life.\n\nNTA.", "NTA, she stinks. Clean her out of your life.", "NTA\n It's time to end this friendship", "Your \"friend\" (who is no friend at all) is a bully, and like all bullies can't handle it when they're called out on it.\n\nNTA, and do everyone the obvious favor of never inviting her to your house again.", "NTA", "NTA. I knew someone with a husky and I LOVE dogs but omg this dog smelled. They need to be groomed regularly. So I can just imagine. Reconsider this friendship.", "Ugh this reminds me of a guy I used to be interested in. He was always making me feel like shit about my house (such as toys on the floor...I had a toddler) when he had lots of dishes in the sink and his place was definitely don't what I would consider spotless...he even told me he proposed to his ex wife when she was doing housework! We both worked full time btw. Exact same hours. That's when I noped out of there so fast 😅 you are NTA at all. People like this don't like to get called out on their BS but they need a dose of reality.", "NTA- I had a friend who would point out the tiniest thing wrong at my place while hers is a gross mess too. They’re insecure and projecting.", "Sorry not welcome anymore. But if jealousy there is say", "NTA! She tried to make you feel like your house was musty because she’s insecure about hers.", "If you want to stay friends meet outside. No more house calls. A true friend would gently tell you there’s an issue if there is one and not be as obnoxious as this one. \n\nNTA", "NTA: It's never right to come into someone's house and comment on their stuff and upkeep of the house. it's downright disrespectful and your \"friend\" isn't your friend.", "Yep time to get some boundaries. She is very immature and jealous that you don’t work and she is he’s she could keep her house that clean. Tell her to beat it and use the free time to make better friends NTA", "NTA at all my friends house smells wiffy and is an absolute tip but I go to see her and never say a word about it, she always says excuse the mess, blames everyone else for the mess her's is pure laziness, but I always say I come to see you not the mess", "NTA\n\n1. This is not a friend. This is a toxic person.\n\n2. I worked 80 hours a week and kept a clean smell free home with 2 dogs and 2 cats. It can be done it's just not fun. At all. \n\n3. Good for you standing up for yourself!\n\n4. Get better friends.", "nta", "I've matured a lot, but at that age, that girl would've had that perfume bottle snatched out her hand and taken it upside the head IMMEDIATELY. \n\nThe unmitigated audacity.", "honestly when I'm stinky & go somewhere clean I can smell myself much more accurately (eg going from the gym to my house). \n\nthis girl is 100% smelling her own stinky ass in OP's nice clean house.", "This made me cackle", "My feelings exactly!", "Ah I feel you about the respiratory issues. My flat-faced Persian is 14 years old and has never really been able to breathe properly. I make sure to not use any strong/synthetic fragrances so when she did that and my baby started sneezing, I completely lost it! And yes, she was aware of kitty's health issues. I never stop talking about it lol.", "That’s what I was thinking: Annie might be one of those cat haters who constantly have to tell you how much better having a dog is vs. a cat. The “smell” might be just one more piece of “evidence” to her, so she brings it up whenever she can. \n\nThose people are annoying because people should be allowed to like what they like. My sister is like that, she mocks every cat owner (and any pet free person) constantly because she thinks everyone who doesn’t have a dog is missing out on the greatest thing in life. She does this “ew, cats” thing like it’s the funniest thing ever. I can totally picture her acting like Annie. \n\nOf course, OP’s “friend” has obviously been in undercover hater mode for awhile now, so I hope OP thinks carefully about their criteria for friendship and whether or not Annie really deserves this status. NTA", "She’s probably knows it too and is insecure about it so she wants others to feel like that 😭", "I have never thought about it this way. In hindsight, she's never really interacted or acknowledged my cats and is very much a \"dog mom\" (think 2012 Tumblr style). She hasn't made any gross comments outwardly about my cats, but she does have the tendency to one-up me when I tell stories about my cats with her stories about her dogs. \n\nI remember this one specific instance where I was complaining about not having a lot money at that time since my cat just went through a major surgery, and she did bring up how she's spent more on her dogs after they swallowed a mouse trap or something. But then again, she does tend to one-up others as well so idk if I'm reaching.", "It’s entirely possible that I’m projecting because of my experience with my sister. But in any case, a wise person once told me that the title “friend” is pretty special—and should only be given to people who live up to it. Just food for thought."]}