{"id": 31157, "submission_id": "17xjycm", "title": "AITA for sending my son to his moms without clothes?", "selftext": "Ex-wife and I live in different states and I am the primary parent. My son goes to visit his mom four times every year. Thanksgiving, Christmas, spring break and summer vacation. All together it comes out to about 12ish weeks out of the year. \n\nBefore,  I used to pack my son's bag with multiple outfits making sure to fold everything nicely even sending warm outfits as his mom lives in an area where it snows. But so many times now when I get the bag back, the clothes are thrown in there all wrinkled and they even seem unwashed. I've sent him with his nintendo switch and a few games. Many times now when he gets back, I find articles of clothing missing and even some of the games that are quite costly have gone missing too. \n\nI've really become annoyed by this to the point where I decided I'm not going to be bothered to make all this extra effort. She should already have clothes there for him. So he left today and his mom made a big deal about me not sending any clothes along. She said she didn't have any socks or underwear. Was I wrong to expect her to have something at all? How can you have zero clothes for your son?? She argues that I'm the primary parent and that he outgrows the clothes too quickly. I feel like clothes should last at least a year or two before they get outgrown especially if you size up.\n\nOther information that might be useful. \n-it was her decision to move out of state\n-she pays zero child support. \n\nPlease comment any other things that might need to be known for an accurate judgement.\n\nEdit: I did not take these actions to \"get back\" at his mom. If I wanted to get back at her I would go and get child support from her. I did this in order to avoid the frustration of having to worry about things going  missing and wondering what may have gone missing that I didn't even realize. ", "created_utc": 1700241384, "permalink": "/r/AmItheAsshole/comments/17xjycm/aita_for_sending_my_son_to_his_moms_without/", "score": 644, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I sent my son to his moms without any extra outfits.\n2. Did this with no warning or heads up.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You sound pretty bitter.  You do realize that your son is paying the price for all of this, not his mother.  I personally would have packed everything he may need, as usual, so he knows he has his dad on his side.  As he gets old he will think about it, and how you always had his back.  If it bothers you how his clothes come back wrinkled, start showing his how to fold and care for his clothes, as he will learn to respect them, and everything you do for him, and he will also realize everything his mother does not do.  \n\nConsider this a miss step, and get back up to being the stand up father you are.  Good luck.", ">I've really become annoyed by this to the point where I decided I'm not going to be bothered to make all this extra effort.\n\nThe extra effort is for your child, not your ex.  You are punishing your child by sending him unprepared. YTA.\n\n> I feel like clothes should last at least a year or two before they get outgrown especially if you size up.\n\nYou go ahead and \"feel\" like this should be reality...it's not, lmao.", "YTA \"My son goes to visit his mom four times every year.\" Kids grow. I'm sure she has a handful of things, but for four visits a year she's not going to have what your son needs- particularly, and this is important, because YOU ALWAYS PACK HIM A BAG.\n\nYou didn't TELL her you were going to do this? At least she could have prepared if you had said something, even if it pissed her off, she'd have been ready for your son.\n\nDid you say, \"hey, kid is missing this game, can you look and see if he left it somewhere?\"? Did you say, \"hey I'm a big frustrated with the way kid comes home, do you mind washing/folding his clothes he brings home and making sure he isn't missing anything?\"? Then YTA. Hell, that's what my clothes look like coming home from a trip.\n\nTo be petty with your ex, you hurt your son instead. Good job.\n\nAnd no, OP, you wouldn't have been the AH if you just talked to her instead of doing this immature stunt.", "YTA.\n\nShe’s right that a seven year old is going to outgrow clothing quickly. Seasonal clothing for child that age only fit correctly for one year, two at most. \n\nShe’s also not only the primary parent but also spends small amounts of time with your child. Things that feel instinctual to you are things/habits she hasn’t needed to learn. \n\nRegardless of all that, if you had informed her that she needed to buy/have clothing and she didn’t then she would be at fault here. Instead you surprised her, using your child as a tool to teach your ex a lesson.\n\nI’m on your side when it comes to being disappointed that your son’s things come back home missing and disorganized. It absolutely shows a lack of thoughtlessness and care. This isn’t a vacation with minimal access to a laundry room. Does she have a washer and dryer?\n\nThat being said, if your ex is thoughtless when it comes to your son’s things then you need to protect your son from that thoughtless. It doesn’t matter whether you *should* be in this position, at least not when it comes to protecting him. Fair or not your son is the be who suffers if you don’t step up.\n\nBefore his next visit let your ex know what she needs to buy and the sizes in a email/text so you have confirmation she received it and follow it up after the trip to have a record of whether she did or didn’t get him necessities. Pack your son a minimal amount of clothing he’s about to outgrow - that way he’ll have enough to be safe/healthy if his mom doesn’t step up. If he’s bringing his games, have 5 in 1 games or other cheaper, inexpensive ones that are “special” and only for trips. If you’re worried about something happening to the system itself then have him bring another form of entertainment.", "I hate to say it, but ESH ~~Y T A~~.\n\nYou're trying to punish your ex, but your son is the one who suffers for it. By now you know she sucks at caring for him, that means you have to step up- for his sake, not hers.\n\n&#x200B;\n\nEdit to change judgement - can't let the mom off, she's definitely an AH.", "INFO: Did you mention the situation with the missing clothes and games to her?", "It's normal for people to return from a trip with dirty laundry. You leave home with clean, folded clothes. You wear the clothes. You return home with a bag of dirty laundry. You're being absurd to complain about that.\n\nIt's also absurd to expect her to keep a wardrobe of clothes for your son that he would wear a scant handful of times. And it's absurd for you to expect your son to not wear his favorite clothes when he's at her place.\n\nYou are the primary parent. You don't have a 50-50 shared custody type situation where it would be reasonable for a kid to keep a bunch of clothes in each home. Your ex-wife gets the kid for holiday visits. He goes on vacation to see her, and you should be treating these visits more like him going on vacation and not like him having two homes. Because he has one home, and it's yours.\n\nYTA", "Your ex is the asshole but you are not helping.\n\nYes she should have some clothes for her child but you should also ask where the things are that your son did not take back home things that went \"missing\"\n\nDoes your ex have any other children?\n\nBut saying all that I do think you should make sure your child is well clothed has what he needs, as you are the main caregiver.", "NAH - I understand the frustration.  Buy cheaper clothes or second hand to send to her house.  I’m not saying junk clothes, but don’t send his nicest things.", "She SHOULD be paying child support. It is not revenge, it is making her take care of the child she helped create. Put that money away for college if you don't need it. Also, make sure your custody is legal, cannot remember if you said it was.\n\nIt is fine if you don't want to pack a bag. IMO it is her son and she should have stuff for him. But yeah, you should have given a heads-up just because you have always packed a bag before. \n\nAlso, you do NOT have to give up all holidays (unless court ordered), that is not fair for you or your son, who I'm sure would like to spend Christmas with you as well.", "INFO: why isn’t she paying child support?", "INFO: how many days is he actually staying there?\n\nNTA, she isn't paying child support and your child is there a fourth of the year. She should have clothes and entertainment on hand.", "YTA. I would say that your feelings are pretty rational, however your execution is poor. Your kid is caught in the middle and shouldn't have to be used a pawn to make a point to your ex. Pretty shitty actually.", ">Other information that might be useful. -it was her decision to move out of state -she pays zero child support.\n\nGenerally speaking, this pushes this from Y T A to ESH. Neither of you seem to be putting your kid's needs first here, and are more focused on passing the buck for his care.\n\nLike I get your point, but sending your kids somewhere without a change of clothes is bad parenting, even if your ex should be doing more. You don't get a pass on that point.", "YTA - when I come home from a a trip my suitcase is also full of wrinkled and dirty clothes. \n\nYou are just going to punish your kid. Sure it would be great if your ex was a bit more conscientious, but is that worth hurting your kid over?", "IF you are the primary parent then it's your responsibility to make sure he has clothes with him, unless it's in the court orders she must have everything he needs in her home as well. Also it can be hard to size up, as you never know if a child is going to skip a size or not. \n\nESH", "YTA. You screwed your kid over to get some sort of retribution.  Disgusting parenting.", "Petty if you didn’t let her know first", "But is it a trip when you are visiting a parent? And it is not for a weekend, where I understand that she didn't get time to run a load of laundry, but a week or more. Is she not doing laundry for herself and her household within that time? She can easily run a load prior to the kid leaving. She doesn't have to iron them. Just sending her child back with clean clothes is a given. \n\nAnd what about missing items? Like games and stuff? She is taking out her frustrations on him too. While he is not 100% right, if he was a mom, then most of this reddit would be in his corner. We have all seen the other post where mom's have complained about the same issue and they are always N.T.A. just because OP is a man does make him a T.A..  for this I will definitely say NTA.", "YTA\n\nMy ex and I stipulated in our custody agreement that we are responsible for providing clothes when our son is at our respective houses. It’s actually written in our settlement.\n\nI think the best route to take would have been to call her in advance, not a week before but at least a month or two, and inform her that she would need to purchase clothes for him as you would not be providing any. If she isn’t paying child support I don’t think that’s too much to ask since she clearly isn’t respecting the items you are sending over. Giving her zero time to prepare is petty and you need to be above that.", "YTA (and understandably so). I say that as someone who has been in the same boat as you. Sadly, this course will only have a negative impact on your kid while giving ammunition to your ex. I feel for you. Can only recommend that you take a step back and re-evaluate. And keep your eye on the prize that this phase of you and your child’s life will pass.", "ESH.\n\nShe should absolutely have clothes for her own kid,  even if he's only there 12 weeks out of the year. She knows how to contact you to ask for current clothing sizes. \n\nOn the other hand,  you're not packing for your ex,  you're packing *for your son*. Sure,  by not packing for him you're forcing your ex to be a parent (which she clearly doesn't want to do) but you're also putting your son in an awkward and uncomfortable position where your ex may be telling him how irresponsible you are and you don't care enough to pack him a bag. Whether he believes that or not is irrelevant, it's still an inappropriate, uncomfortable position for him to be in, and you're directly contributing to that. \n\nAnd why in tf is she not paying child support?? You should seek support, if only to replace the stuff she loses or forgets to send back.", "NTA with a caveat - the main thing is your son is comfortable and happy. So do what leads to that endpoint", "YTA  \n\n\nSaying \"I don't know\" is rude and dismissive. Ask. You chose not to ask, and went straight to retribution.   \n\n\nKid is 7 and you are sticking him in the middle of something that he has no idea what is going on?  \n\n\nKid is 7 and thing go missing? That is the way kids are.   \n\n\nHow about you dial back all this anger that you have. Anger that you are heaping on the child.", "NTA\n\nif stuff is coming back dirty or is just missing she is not taking care of his things. Even electricals have gone walkies.\n\nSo many times on reddit we hear about kids clothes going missing or given to stepsiblings. I think you have done the right thing", "YTA.  The poor kid has no socks & underwear because you're aggravated at your ex.  \n\nYou could have sent him down there with a couple of each to get him through while the ex got her act together.  It's not his fault that his mother doesn't prepare for his visits.", "I can appreciate why you wanted to punish his mom.  \n\nThat’s justified imo you’re not an AH to his mom  but unfortunately, your son is suffering as a by product of the punishment on mom.  So you’re an AH to your son.  \n\nBut I think you and mom should get on the same page and make sure that next time you send him, send an extra bag of clothes for her to keep there so you don’t have to deal with her nonsense", "I agree that she should have clothes at the ready. He's still her child too. But, I'd be honest with her. \"You get on my nerves. First you send him back with a pile of dirty clothes you couldn't be bothered to launder and then you got worse and didn't even send some of his favorite things back with him. So, I'm letting you manage you because no way I can fix you.\"\n\nNTA. Most kids who go back and forth between their parents do literally have *some* clothes and games and toys and books in two homes.", "NTA does she plan to be a babysitter to her child forever or step up and actually parent? She is just as responsible for providing for him when he’s with her. Wtf?", "Soft YTA - mainly because you put your child in the awkward situation of having no clean socks or underwear (and likely no pajamas) and he's already visiting a house where he is not a permanent resident.\n\nDon't fight your battles through your kid. That's just cruel to the kid.\n\nExamine your custody agreement. Sue for child support if you want to. But make sure your child is safe, clothed, and not humiliated because of your issues with your ex.", "NTA. She can purchase items for him with her own money .", "Your ex sounds like a piece of work but in this conflict YTA.  \n\nYou’re combining a bunch of complaints about the travel aspect of your custody arrangement, some valid and some petty, and then switching up your behavior without warning in a way that won’t actually fix your frustrations. As others have pointed out it’s normal to return from travel with dirty laundry, and dealing with it is part of the homecoming ritual. You shouldn’t be sending expensive electronics with a traveling 7 year old (or younger if the loss happened a few years ago), so those lost games are on you as much as her.  \n\nIf you want to scale back how much you pack for your kid, that’s fine! A single change of clothes plus extra underwear would make sense, to cover him if he ends up stuck somewhere in transit or other mishap. But a conversation ahead of time, or even an email to inform your ex of the change and give her notice to buy clothes would be the way to handle it.  \n\nFrankly your kid will very soon be old enough to take on responsibility for his own packing and laundry, with progressively less supervision from you, so this problem will solve itself soon if you let it. I was a kid going back and forth between houses at his age, and clothing was always frustrating. I have a horrible memory of one of my parents being angry at the other because I had the “wrong” coat with me, such a small thing, why was it a fight? Once I was allowed to choose what I was bringing and storing in each place it was a lot less stressful.", "It’s normal for kids to forget some of their clothes or toys at the other parents’ place.\n\nWhy are you punishing your son?", "YTA\n\nyou're being petty, and it's your son who's suffering for it. who's going to be affected most by your wife not having underwear for your son? it's not her!\n\nif you must have petty squabbles with your ex wife, keep it between the two of you. do not let it affect your son.\n\nif you have a problem, you tell her. you ask her \"hey, could you maybe wash his clothes before he comes back next time?\" simple as that. sounds like you never brought this up with her, which means she didn't even know this was an issue. to her, you just randomly decided not to bother giving your son clothes. she doesn't even know why! how is that dealing with the issue?\n\nthat was immature and pointless. next time you have an issue, bring it up at the very least, and *don't let it affect your son*.\n\n>i feel like clothes should last a year or two before they get outgrown\n\nyeah! and i feel like i should get all clothes for free because i deserve it. anyway. let's get back to reality, yeah?", "YTA - if just a little bit. I understand it's frustrating to have his items go missing and have his clothes be unwashed. But you're unintentionally punishing your son by not sending him with any spare clothing - you don't have to pack him multiple outfits. At the minimum, at least make sure he has enough clean underwear and socks to last him. As for expensive things going missing, definitely agree he shouldn't bring electronics. Maybe he can have books/other lower cost items to keep him occupied.", "YTA  - Your son isn't some tool for you to use to get back at your wife. His comfort takes precedent over you and your wife's arguments.", "NTA she should have those items", "NTA and I’m sure the YTA people would be doing what you’re doing after some time. They need to get off their high horse", "NTA - If she can't even provide basic necessities for your son during his visits, then it's completely reasonable for you to stop sending clothes. Plus, it's not your responsibility to replace the items that go missing. She needs to step up and take care of her own child.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nEx-wife and I live in different states and I am the primary parent. My son goes to visit his mom four times every year. Thanksgiving, Christmas, spring break and summer vacation. All together it comes out to about 12ish weeks out of the year. \n\nBefore,  I used to pack my son's bag with multiple outfits making sure to fold everything nicely even sending warm outfits as his mom lives in an area where it snows. But so many times now when I get the bag back, the clothes are thrown in there all wrinkled and they even seem unwashed. I've sent him with his nintendo switch and a few games. Many times now when he gets back, I find articles of clothing missing and even some of the games that are quite costly have gone missing too. \n\nI've really become annoyed by this to the point where I decided I'm not going to be bothered to make all this extra effort. She should already have clothes there for him. So he left today and his mom made a big deal about me not sending any clothes along. She said she didn't have any socks or underwear. Was I wrong to expect her to have something at all? How can you have zero clothes for your son?? She argues that I'm the primary parent and that he outgrows the clothes too quickly. I feel like clothes should last at least a year or two before they get outgrown especially if you size up.\n\nOther information that might be useful. \n-it was her decision to move out of state\n-she pays zero child support. \n\nPlease comment any other things that might need to be known for an accurate judgement.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: how old is your son?", "Had this happen so many times that I just sent the kid with a chance of clothes. Noticed other parent ahead of time. NTA.", "Kids grow through clothes quickly at 7yo. Things that fit him at Easter break might not fit at Thanksgiving. I don't think it's reasonable to expect her to have a new full wardrobe for him at four different times of the year for a couple of weeks each time. . \n\nIf it's expensive clothes that are being ruined or going missing, don't pack expensive clothes. Get some thrift store stuff for the visits. If she has something planned where he'll need a nice outfit, she can buy it. It would be considerate if she washed the clothes and repacked them neatly (I would), but she's clearly not considerate. Nothing you can do about that. \n\nAnd don't send expensive toys if they just disappear.\n\nI sympathize. My ex and I had week-on-week-off custody. I used to pack cute outfits when daughter went to him, but I'd get them back stained/torn, if I got them back at all. I couldn't afford that. I told him we could each provide clothing for her at our own houses, and started sending her back to him in the same lost-and-found outfit she'd come to me in. The nice things I bought her stayed at my house.\n\nESH except the kid.", "NTA\nAnd I was a divorced mom with primary custodial, minimal child support (he hid money) and because I moved out of state, paid transportation costs. \n\nShe should be supporting her son. Seems like she doesn’t. She should have gaming systems and clothes and anything else your son needs. \n\nSuggestion though: as your boy gets older, allow HIM to lead you in what he takes. And if he forgets HIS things there, don’t make it a big deal. He won’t want to leave meaningful things where he can only interact with them  a few times a year. And teach him how to pack and do laundry for himself as he grows lol", "My ex did this with me.  I stopped sending anything.  Not even diapers or bottles.  He should have them and my budget didn't include replacing things missing that he kept taking.", "Neither you nor your ex look good here.\n\nYour ex should really be washing your son's clothes and sending him back with clean clothes. He isn't going for a holiday. He is visiting his mom, and she needs to wash his clothes because it is part of parenting. I don't think it is unreasonable for your son to have some clothes at his mom's house either. He should also return with everything  he went with.\n\nYou need to make sure your son has enough clothes to visit his mom not doing so as a point of principle is ridiculous.\n\nYou should also tell your son to bring all his games home with him.\n\nHave you tried to talk to your ex about this and set expectations for you both to follow? This is your son. You both need to set a good example. Both you and your ex need to behave more like adults.", "You aren’t punishing her you are punishing your son.  How petty and small are you? YTA", "YTA. You’re only punishing your child. Why would you think that his mother has a full wardrobe at her house for him when he’s there 12 weeks a year and is still growing and changing sizes.  You’d rather your 7 year old go without so you can fight with your ex.  Classy.", "You were worried about socks and underwear going missing? Sure.", "NTA, if she relies on you to provide everything he needs,  she can take the time to round up his things and return them to you.   I spent years sending new,  well fitting clothes, and getting back a bag stuffed with old, stained outgrown things, and having to again buy the kid clothes", "Oh good grief ESH you both need to be transparent about these disputes in advance. I believe you should have told your ex what you were sending.", "NTA. She doesn’t even pay child support she can afford go to a second hand store before each visit and buy 3-4 days worth of clothes.", "INFO: You didn't write anything about talking to your ex and son about the whereabouts of the missing items. \n\nDid you talk to them at all about this?\n\nAlso: Do you really expect your ex to wash and fold the clothes before sending him back ?", "I would send at least underwear, socks and a few clothing options and major outer wear, snow coat, boots, hat and gloves. If mom doesn't have anything else, she can totally get them. Especially if her outgrows stuff so often, as she claims and given that the weather at her chosen place to live is much colder than where he usually is, at your home.", "ESH - I get where you’re coming from, but if you planned on not sending him with much, you could have communicated that beforehand to ensure that you’re son isn’t uncomfortable. Yes, she should have at the least, socks and underwear, but I would bet that she assumed that at the least, you would send him with socks and underwear (especially if you always have before). I understand that you did not do this intentionally to hurt your son, but that’s going to be an inevitable byproduct because of the way that you did choose to handle this. Also, without knowing what her financial situation is like, it may be really difficult for her to get those things without notice, which again, only hurts your son.", "YTA. Despite your protestations, you did do this to \"get back\" at her. How do I know?\n\n>But so many times now when I get the bag back, the clothes are thrown in there all wrinkled and they even seem unwashed.\n\nand \n\n>I've really become annoyed by this to the point where I decided I'm not going to be bothered to make all this extra effort.\n\nAlso, \"making sure my kid has clothes\" isn't extra effort.", "NTA your ex isn't paying child support so why can't she get him clothes when she has him. I mean c'mon now it's not that hard to go get a pack of underwear and socks especially since she isn't paying child support. Why should you have to provide everything. Where is her support of her son. \n\nHonestly i would take this to court so that the court can tell her its her job to have these things available for him when he's with her instead of you getting crapped on by her not wanting to do even the bare minimum for HER son.", "YTA\n\nI don't think you can blame your EX for your son's clothes being messy when he gets home. When I used to visit my dad after my parents divorced, my mom would pack everything nicely, too. When it was time to leave, I \"packed\" by just throwing everything back in my duffel bag. Second, your EX sees your son 12 weeks out of the year. Kids grow quickly. Why would she keep clothes for him at her house when she doesn't know if they'll even fit the next time she sees him?  If you're the primary caregiver, buying clothes is your responsibility.", "YTA. Why are you punishing your kid instead of talking to his mom like an adult?\n\nAlso, am I the only one who washes EVERYTHING after a trip? I don't care if I didn't wear it or if it got washed while I was out of town. The first thing I do after getting home is rewashing everything. Why can't you do that as well?", "Send a care package w clothes and treats for the whole house.  Going forward send clothes and don’t expect them back.  That boy is growing.  Most times they won’t fit for more that 20 minutes anyway.  As for the electronics, buy something used /refurbished if the mom can’t /doesn’t have.  With the knowledge it’s not coming back.  AND YOUR OK W THAT because you do it for the comfort of your child.  As primary just make sure your kid is okay.  \n\nIt’s was a nice to send nice stuff etc but now you know it’s not coming back that way.  So send the stuff that makes the kid comfortable just not his favorites.  \n\nThis isn’t worth the frustration your putting yourself through.  \n\nPlease just send a box 📦.", "YTA. Your job is to provide your son with what he needs, not taking away said stuff when he visits his mother as a way to take a jab at her.", "ESH \n\nThis sucks. Cause now all three of you are negatively impacted. \n\nConsidering that she only sees him four times a year, she probably doesn’t have much stuff for him. The older he gets, the more he’ll also want to wear his familiar clothes vs the surprise ones at moms. \n\nYou didn’t give a heads up that you were doing things differently this time. I do get it, single dad here as well and things would get lost in the shuffle often. \n\nNot sure the age of yours. But at one point, you can start making a list. So when they’re packing his stuff back, he has a check list of what to bring back. \n\nI wouldn’t worry about the dirty cloths or how they’re packed. You divorced for a reason, her style isn’t gonna change cause you’re no longer there", "Your ex should have asked ahead of time if he would need anything upon his arrival. If she isn't going to treat his possessions with care, especially considering she pays nothing for his support, then she needs to provide her own. \n\nNTA:  She isn't going to let him go without clothing. she just expects you to provide it.", "ESH.    If he only visits 4 times a year it’s not that surprising she hasn’t got loads of clothing for him.    Refusing to send basic clothing only makes him suffer.    Get the child support you are entitled to to help fund what goes missing.", "Soft YTA — I would have sent basics (socks and underwear) and clothes you don’t care about getting back. \n\nOn one hand I agree with your wife the he might not fit clothes left behind when he returns for the next visit. That’s why you should clothes you don’t want back.", "YTA. Are you trying to humiliate your child? As someone whose parents divorced when I was very young and had to be transferred to the other parent via a 12 hour car ride across 5 states, this sounds horrible. After traveling all I would want to do is eat, brush my teeth, change into my own pajamas, and go to bed. By not giving the kid some clothing you denied him the comfort and familiarity of wearing his own clothes in a place away from home. This would have caused me all kinds of stress as a kid. The time and effort to go shopping with the less familiar parent, the exhaustion after traveling, and the feeling that my primary parent doesn’t love me enough to be concerned with my needs would be so upsetting. \n\nWhat exactly is your end goal by refusing to give your child clothing? If my parent had done this to me it would have become a source of resentment and evidence of how little they valued me. Do you want to damage your relationship with your child? Because that’s what you are doing. Sure, kids forget things. Call the other parent and ask for them to look for the missing items!!! \n\nIt sounds like you are trying to get back at the other parent at the expense of your child. That, or you have a tit for tat attitude of keeping score of every item each parent contributes at the expense of the child. The other parent is correct that a child outgrows clothing quickly and that last year’s items might not fit. Stop keeping score and start thinking of the child’s wellbeing. 🤦‍♀️", "NTA\n\nIf this post were reversed and you were not paying any child support (even if it is not court ordered), every post would be calling you a deadbeat.\n\nYour wife is a deadbeat.\n\nShe pays no child support and expects you to provide him with ALL of his clothes.\n\nYour wife is a deadbeat.", "ESH she should be paying child support. Put it away for college. You both have put your child in the middle. She should have been making sure anything he brings with him gets home again. So yes she has created this bad situation. But your child is the one paying the price. Text her and tell her she has 2 choices. 1) make sure he gets home with everything he takes. 2) you will text her with his sizes 2 weeks before he goes to her and she can buy clothes and keep them. You will also send 4 outfits with him and expect them to be returned. \nSince she is not paying any support to you as the primary parent she’s getting off cheap. You and his mother are the adults so act like it.", "Honestly, I had my nephews for 10 days because their Dad got married, they were at the wedding, but I provided care for the honeymoon.\n\nTheir Mom let a 6 yo and 12 yo pack their own bags. One kid only had crocs and no socks - so promptly got blisters. The other had no undies - there were other miscellaneous missing important items (but they had their gameboys!). I just went to Walmart and spent not a lot of money getting things that would last a month. When I was dating someone with kids, we went to Marshall's sometimes as well to get yet another winter coat... Who freaking leaves home without a coat when it's in the 30s?\n\nAnyway - at the end of the day, I do think you should have sent some items. Maybe not all the items, but some. I do understand your frustration -  but sometimes you just have to say to yourself \"That's why they're the ex.\"", "I can understand not packing enough clothing for his entire stay, but packing absolutely nothing just makes you seem bitter and like you're doing this out of spite.\n\nKids do grow fast. It's not unreasonable to not want to guess about sizes or have the kid there to try things on and make sure they fit before buying them. \n\nYTA.", "I went through the same thing with my ex but I gave him a few weeks to purchase everything the kids needed. If you didn’t warn her you are the AH.", "A kind ESH. I get why you did it. It’s got to be frustrating to see your ex not put in the effort or care for things. But the short term win you felt wasn’t worth it. I’m a petty soul and I recommend if you give into impulses like this, bare minimum you needed to give her a heads up warning that “next time I’m not sending clothing because of xyz” to CYA. But really try not to give into impulses like this that could hurt your son. Some missing clothing and an extra couple loads of laundry four times a year is worth making sure your son knows you value his comfort over avoiding some inconvenience. He probably won’t remember that sometimes clothing didn’t come back or came back dirty but it’s likely he will remember that you didn’t send clothing with him if your ex makes a big deal about it.", "YTA.  It is extremely petty to send your son without clothes just because some get lost, wrecked, and they aren't cared for as you would prefer.  You shouldn't have to pack for the entire time there and you can inexpensive basic items with him, but you should pack at least something", "ESH except the kid\n\nMy mom had to do something similar when the grandkids would visit.  She would get them in rags and send them home in nice clothes that were never seen again.  She then made a policy of sending the kids home in the same clothes they arrived in so their mom couldn't use her to outfit her other kids. \n\nI suggest going to a thrift store before he visits his mom and only packing the cheap stuff you don't care if he loses.  Poor kid shouldn't have to go without entirely just because his mom sucks.", "I appreciate your words of kindness. Thanks for the advice! Always try to show my boy that I love and care for him!", "This is the crux of the matter. Does it suck that your ex doesn't provide these things? Yes. Does it suck that your son doesn't always bring everything back with him (depending on age, it's hard to say if this is really a him problem or a mom problem)? Yes. But do you want  your son to have no clothing/no appropriate clothing for a week while he visits his mom? Your son is the one who is going to suffer if you don't send clothes.", "I have told her in the past how frustrated I have been with how things have been returned and gone missing and they were never returned. I just expected her to have some clothing for him. I know I would have some. I'll be communicating more in the future.", "You took the words out of my mouth.  Yeah, mom should have at least something for the kid to wear.  I can sympathize with perhaps not knowing what sizes or styles he wears as kids really do shock you with their growth spurts.  But it's a SIMPLE question to ask the primary parent.\n\nOP knows she isn't going to do that.  So why make the kid suffer?", "I don't want to come off like I'm arguing, but how am I trying to punish my ex? I had no idea she would have zero clothes for him.", "Yes, I've mentioned all these frustrations to her.", "All of this, plus you are absolutely doing your child a disservice by not asking for child support. That is money owed by the non-custodial parent (who in your case just so happens to be female). I was in her position after I joined the army when my kids were in double digits, and I absolutely paid on time and in full, just like he did when the kids were little and I was the primary.", "Well, hang on. If I go somewhere and stay in a hotel, I return home with dirty clothes because I didn't have access to my washer and dryer in the hotel, but surely OP's ex has access to laundry facilities – maybe in her home, maybe communal machines in the basement, maybe a laundromat, but we all know she doesn't just buy herself all new clothes all the time; she does laundry for herself. And if her son is staying with her for any length of time, she is almost certainly doing laundry for herself during that time, so it doesn't really seem unreasonable to me to expect her to also do her young child's laundry. Heck, when my brother, SIL, nieces, and nephew come to visit, they do laundry before they head home precisely so they don't arrive with suitcases full of dirty clothes – and they have the option because (much like OP's child) they're staying in our mother's home, not a hotel.\n\nAnd I think OP also has reason to be concerned about the child not returning home with all of his belongings; the ex needs to ensure that the kid's things don't go missing (or, worse, \"missing\").\n\nI absolutely think it was an AH move to send the kid with no clothes at all, but I don't think OP is *entirely* in the wrong here.", "It is not AH to expect her to keep clothes when she doesn’t pay child support!  Good grief!  What a deal…buy clothes versus hundreds a MONTH!", "Child is not going on a trip like a vacation. He goes there for a week or more at a time. He is going to a parent, who also does laundry for herself and her household. Or do you think she throws away dirty clothes and buy new ones?", "Because I've up until recently been pretty well off and I know they can use every dollar they have so I didn't see a need for it.", "He's staying for a week.", "How is kid being used as a pawn?   OP can pack the minimum (2 changes of underwear) and let her know that from now on, she will be clothing him when he visits her.    Unless the mom decides to take him out in the snow with inadequate clothing, the kid won't miss anything and if she does that, it can be solved with some court attention.", "Mom doesn't pay child support, which means that she is 100% responsible for his needs when he is with her.", "My nephew is 4, and he always knows where his phone is. He'll, he even knows where is the Ballon he got 2 days ago.  Why, because he loves it and knows that they are his. \n\nThe kid is not losing them, but rather is mom is proly taking it for either new kids or family's kids.", "My intentions were not to piss her off. I'm trying to keep my sanity for when he gets back I don't want there to be anything missing. I feel his mom should have things on hand for when he's there 25% of the year.", "Why can’t the mom run to the store and get socks and underwear? What is her job as mom? What responsibilities does she actually have?", "I agree, NTA, and it's like all the Y T A commenters think running to Walmart for socks & underwear is not a possibility for a grown ass mother", "I have discussed her sending dirty clothes back and the missing items. She just shrugged it off. Seeing as he still wears some of his clothes that he got from his 5th birthday two and a half years ago. Yeah I'd say they should last. Even longer if she sizes up.", "But the kid is the one paying the price. He could have at least sent an extra set or two instead of kiddo arriving without anything to change into.", "7", "I have. Son has gone back and never recovered the games. No games go missing when he's here. And yes I do expect her to wash and fold them if I'm doing it too.", "Create a list of things send it with the kid and send it to the mom. Checklist of items going back to dads.", "How old is the boy? Is he old enough to take of his own belongings? A ten year old should be pretty self sufficient but a five year old needs adult supervision", "I would agree with the above poster. Also, if you think about it, yes he loses his clothes there, but she is not taking them to wear herself. He will wear them when he goes back again. They will fit, if you size up.\n\nIf you try to look past her shortcomings and not let those get in the way, your son will appreciate you when he grows up.", "A couple of weeks before he flies out send her a list of what you are sending with him on the plane and tell her his current size shoes/clothing/jacket so she can provide what is needed on hand.\n\nGiven he is there for 4 weeks between mid November and the end of December, it is totally reasonable for you to expect her to have clothes on hand for him but you need to communicate that. Screwing over your son isn't fair to him. At least by communicating with her what you are sending and his current sizes you can ensure she will have what he needs on hand.", "Communicating that you’re frustrated is only half the equation. Communicating what changes you are making in response, with enough advance notice for her to adjust is the other half.", "Sue for child support!  Every non custodial parent should pay!  Not fair to your child if you don’t.  If you don’t need the money save it for their future.", "So because you expressed frustration in the past, you decided to punish your son and ex-wife by changing up what you send with him without telling her? If you want to change things up, fine, but you have to actually tell someone so you know your son will be clothed.", "How can you say you had no idea she wouldn't have clothes for him? You said yourself you normally send him with multiple outfits, you clearly have a reason for that. You know she's not pulling her weight. \n\nI did change my judgment - while I do think you very intentionally neglected to pack clothes to prove a point, it was wrong for me to put the blame solely on you. She definitely sucks.", "It comes across like you’re choosing this method to inconvenience her because she’s been inconveniencing you for so long instead of just communicating with her. Without any indication that you spoke to her about a need to provide clothes prior to your son’s arrival, for all we know you packed your son into a plane without even a backpack with toiletries or a change of clothes or anything without a word to your ex that she would need to provide any of this. \n\nThe age of your son is also relevant to this, because at a certain age he can indeed be outgrowing clothes too quickly for anything kept at her house to still fit him next time he comes, and if he’s much older than that and this is a common for him as you lead us to believe he could be repacking his own suitcase. In fact, if he’s older than, let’s say, 12, he should probably be packing his own suitcase or helping you pack it anyways.", "Why would she have clothes for him? He doesn’t live there and is probably an entirely different size every time he visits.", "She should have clothes for him.   You said she doesn't pay child support?   What kind of court ordered arrangement do you have?   Whatever the arrangement, clothing her own child when he's with her should be the minimum expected.", "But it's something you should have checked. It's her fault for not having the clothes, but you're responsible for him. If you were purposefully not sending clothes, you should have at least told her \"go buy clothing if you don't have it because I'm not sending any\". \n\nAlso, INFO: have you spoken to her about this? Have you asked her where the clothes and games are?", "Then NTA!", "Sometimes when we visit family we do laundry while we're there, but usually, we won't - usually, we'll just take enough clothes for the week or so that we're there. And we never do laundry right before we go home, so we can travel home with clean clothes, because we'd rather spend our valuable vacation time doing something enjoyable with our family rather than folding laundry.\n\nI'm sure she does laundry during the six week summer visit. \n\nThe missing belongings thing is a concern. It's not necessarily evidence of bad faith - kids are quite capable of forgetting where they've put things down, and if mom doesn't track what arrives with the kid and ensures that it all goes home again, then it's easy for me to imagine things getting left.\n\nHow does mom respond to OP saying \"hey - kid didn't come home with his XXX game / pink jacket / whatever. Can you look out for it and put it in the mail?\"", "The kid doesn't live with her. He visits four times a year. If he's there every week, keeping clothes there makes sense. For four visits a year, clothes traveling with the kid makes sense.\n\nI don't know why the mom doesn't pay child support. Did OP not ask for it? Did a court assess that her liability for child support was zero, because she has no income?\n\nI think whether the mom should pay child support and where the kid's clothes should be are different issues.", "To clarify, he stays four weeks a year?", "You are correct. OP could absolutely do that and he wouldn't be the asshole. However, he didn't do that. Per the title, he sent the poor with with nothing. So....", "Right. But OP said he arrived with none. I think a couple would be a good solution.  Mom either does laundry more or goes out and gets more.", "The other parent sees the kid seasonally. Nothing she has in her home from the last visit will fit him. Is she to buy and entirely new wardrobe every time he comes when he has perfectly good clothing?\n\nWhy does the kid need to do without because OP doesn’t want to do a load of laundry?", "Some underwear isn't enough, especially for a kid who will almost certainly end up with muddy clothes sometimes", "And what parent has no clothing at home that belongs to their offspring? Socks and underwear and pajamas are the least of what each parent has to provide.", "Trust me it doesn't matter if child support is paid or not. A parent always makes sure their child has what they might need, in case the other parent doesn't have it or won't provide it. I even have to send shampoo with my eldest when they visit their other parent.", "Just a thought for next time. In his backpack, send a pair of PJs, a couple pairs of socks, a couple pairs of undies and a change of clothes. Let her know that is what you are going to do so that she has the latitude to run to the store to buy him some clothes before his arrival.\n\nNTA. He should be able to fit in his clothes for a good chunk of time he is there. But, make sure he has the things he needs upon arrival. He's just a little guy - he shouldn't be put in a position where he is uncomfortable because your ex is selfish.\n\nSend this text tongight:\n\nName, I apologize for the confusion. Just for the record, moving forward, I will be operating under the assumption that you have appropriate attire for him at your house for the climate in which you live. I will send him with his backpack for the plane and a change of underwear, socks and clothes, but you will need to furnish a wardrobe for him at your place for his visits given the difference in attire needs between the two climates. A couple of weeks before his arrival I will shoot you his current clothing sizes so you can shop as needed for him. Currently he wears a size 8-10 (or whatever size he is in).\"\n\nNTA for not sending the clothes with him but Y T A for not communicating with her that you are going to do things differently.", ">I feel his mom should have things on hand for when he's there 25% of the year.\n\nWhat did she say when you mentioned this and the missing items in the past?", "Why shouldn't she do her own son's laundry when he's at her house?", "I see that now. Next visit should run more smoothly.", "If I were to do this again with her knowing full well that I'll be doing the same would I still be an AH? I feel like is the biggest reason for me being an AH because I didn't give her any warning.", "I'm choosing this not to inconvenience her but to avoid an inconvenience to myself later on when he gets back. If I'm an AH here would I still be one if I let her know this is how I want to go forward so she knows for next time.", "He lives there 25% of the time. If you went to one parents on the weekends, would you be packing a bag every single weekend?", "She can buy him clothes any time.   She pays no child support, she can step up and buy what he needs while she is with her.   He says the visitation is court ordered; she can complain to the court and see what that gets her.", "1 week for Thanksgiving, 3 for Christmas, 2 for spring break, and 6 for summer.", "My ex - My child couldn't even use their shampoo or conditioner. I had to provide that", "Very well put. Thank you for your input.", "That he outgrows things too quickly. Which I don't buy because he has still been wearing 5t clothes earlier this year. I'm not asking her to shop at the gap. Just a trip to Ross. Buy a couple of outfits, not a whole wardrobe. Buy some of them oversized and they should last a year of two minimum. Never got any closure on the missing things. She pretty much just shrugged her shoulders in a sense.", "It’s like, 90% that you didn’t talk to her about it first, and the other 10% is expecting her to already have clothes on hand that will fit him when he visits her so infrequently and kids grow so fast. Even if she had clothes for him from the last time he visited, would they still fit?\n\nHonestly, I feel like a better choice overall is to send him with inexpensive clothes from Walmart or somewhere like that, so it’s not a big deal if they don’t come home with him. And I would recommend not worrying about the clothes not being washed before he comes home. Her time with him is already so limited. Asking her to sacrifice part of that time to do laundry instead of giving your kid fun memories with his mom feels mean somehow.", "That depends on your son, but generally yes, communication so that your son doesn’t suffer would make you not an AH. He might be of an age where he would prefer to bring his normal clothes that he feels comfortable in and refusing to allow him that would be an AH move, but if he doesn’t care then the communication of expectations and boundaries keeps everything moving like it should. Unless, that is, you know or believe your ex is unable to provide these necessities and you’re sending your son anyway. That’s a big AH move and to not be an AH you would need to have the custody arrangement reevaluated. \n\nBasically, this situation is complicated, and anyone calling you the AH in this situation is doing so because what you’re doing doesn’t just impact you or your ex, it puts him in the crossfire. From the tone of your post, you don’t seem like the kind of guy who wants your son to suffer or struggle as a result of your actions, so what you need to think about is if this new hands off approach to avoid being inconvenienced is more helpful or harmful to your son and then go from there. \n\nNo matter how you go forward, I wish you the best.", "Missing clothes would annoy you for sure, but that seems a minor inconvenience compared to the problem of your son having nothing to wear.\n\nHave you talked to your son at all about his stuff going missing? It sounds like you value the missing clothes more than your son. I’m sure that’s not true, but that’s how this is coming across since you’re prioritizing his possessions over his comfort.", "Yeah of course, because I would want to wear my normal clothes that fit me.", "That's not really my point. My point is if she does not have clothing for him and isn't prepared when he gets there, she might not know until all of his clothes are dirty that there are no extras. Stores might be closed. Would she make him continue to wear dirty clothing? I also don't know the age of the son, but kids are messy. It's not fair to the son that both parents are not prepared to keep him clean and healthy. \n\nI'm not saying OP is TA. Obviously, the mother is. I'm saying it's still his responsibility to ensure his son has everything he needs, especially knowing that the mother is clearly not doing her best to take care of him. All he had to say was \"I'm not sending clothes so make sure you have them.\"", "NTA, she isn't paying child support and your child is there a fourth of the year. She should have clothes and entertainment on hand.", "Is this part of a court agreement or informal?   Either way, she should furnish clothing for the climate where he visits her.   \n\nA key question here is how your son feels about these visits.   Does he look forward to them or is he going because you insist?", "This is almost identical to the cross-state custody agreement that my parents had. You need to think of the child’s needs and wellbeing instead of using the kid as a pawn to get back at your ex. Terrible parenting.", "omg. So much a holiness.", "I know you came for judgement, so NTA. You are unfortunately the only responsible parent when it comes to your child's property. She should be able to provide for him when she has custody. But you know she's not going to change so I would advise you to pursue child support if you think it wouldn't be much hassle to win.", "Thank you.", "That's the only part I felt wrong on, but I do intend on continuing this moving forward. So her having the heads up for next time should leave her better prepared.", "Court order. He loves visiting his mom.", "Court order. He loves visiting his mom.", "Yeah I definitely agree. Has she addressed the fact that she doesn't return clothes or items of his? Are they just like littered around her house?", "They got left at her inlaws house apparently. Games straight up disappeared and never found or repurchased and I was never sent any compensation.", "Don't buy game carts. Just download them into the Switch. If you've added the extra SD card for storage, you should be able to keep at least a few decent games on it for the time he's away.", "Did this dance for years. \n\nWe had a tight budget, so the kiddo and I went shopping at thrift stores for things she liked, washed them and packed them. I didn't send electronics until I was sure she could manage them on her own with no parental help. Because the clothes were thrift store, I wasn't as upset about a hit to the budget. When kiddo asked, I said sometimes it's hard to keep track of everything so when you need an extra set of things, sometimes we have to budget, and she said, Oh, ok.\n\nI was furious that the other parent kept keeping the things we bought, but there's nothing you can do about it. So get things the kid likes but that are easier on the budget, and try to let go of the anger.\n\nAnd go after child support. That's your son's right - to be supported by both parents. It's heartbreaking when one parent feels they no longer have any obligation, but as long as the kid's a minor, both parents are obligated.\n\nUnfortunately, plenty of time post 18 for your son to see what sort of person his mom is. Maddening it may be, but I have chosen to not pull back the curtain on the other parent's utter selfishness and lack of care. The kids are seeing that from other parent as they get older, and it sucks.\n\nSo I try not to add to it but do the best for kiddos within my means.\n\nThe switch wouldn't be going without conversation with kiddo about how *they* need to make sure it all gets home. And if you suspect nonsense happening where someone is relieving your son of his things, tell son to just text you if someone takes his belongings and won't return them. Then call mom and handle it between you two.\n\nNTA, but work with your kid for HIS comfort re clothes, even if his mom is TA.\n\nedit: typos", "NTA. It is common that with coparenting that what the child arrives in or leaves in is what they return in.  Secondhand stores can provide clothing for children that grow so fast. I wouldn't send games or toys anymore because they aren't coming back.", "NTA it is her responsibility to take care of him and provide while he's in her care. Tell her exactly that. And of it becomes an issue then file child support.", "**Boo on parents who “size up” their children’s clothes so they last longer. Buy your kids clothes that fit fucking christ.**", "Nta, does she have a history of stealing? Or drugs? Sounds like maybe she's not fit to be a parent, especially if she's stealing his stuff to sell", "Everything she said was true.\n\nYTA. You don't even have the courage to tell the truth here about why you did it.", "Can't believe so many YTAs. If the genders were swapped this thread would be a screaming \"weaponised incompetence\" at the dad.\n\nNTA OP but there's plenty on this thread.", "You put your kid who relies on you for everything - in a really tough spot with no warning.\nYou could have given mom the heads up but - chose not to? It’s vindictive and is a retaliation against her that actually hurts your kid most of all.\nBecause of that Yta.\n\nIf you had given her the heads up with time to plan and access and remind her that in lieu of child support covering him for a few outfits is a reasonable accommodation. But you didn’t. And surprised pikachu that this is the outcome. Double Asshole.", "Very vindictive. You should have sent some clothes you didn’t care about. Think about your kid, not his mom. YTA. Don’t put him in the middle of your bickering. \n\nAnd you should go after child support if it would raise his standard of living.", "Dude YTA. You sent your son on a trip with no underpants. You sent a literal child with no agency of their own into a situation where you knew they'd be at a disadvantage and now you're all wide eyed disingenuous \"oh no I just didn't want his chonies to get lost, that's all.\" Boy, bye. If you're pressed about it hit up your ex wife for child support to cover the costs, like an adult. Don't do shit like that to your kid. That's gross and traumatizing.", "Really depends on how custody is set out.\n\nSome dual custody it’s clear both families are expected to provide/keep clothes, etc.\n\nWhere you have clear primary custody, especially if there’s aid, probably YTA.\n\nEspecially as You’re basically punishing your kid.\n\nBuy cheap used clothing for the trips and keep the nice stuff home.", "YTA you are the main caregiver, you are the responsible one, and you can't imagine how it would feel to not have any clothes to sleep in or clean clothes to wear the next day. The person you're being an a****** to is your child. If you're having an issue with things not coming back that you've sent with your child you need to take that up with the adults separately. Whether you're packing taking a picture of everything you've packed sending it to the other co-parent and saying that everything should be back in this bag and everything should come back clean and folded the way I sent it to you. Sending a child off on a trip without things will make them feel very unwanted and unvalued buy all the adults. Again the person that you're being a jerk to right now is your child. It may be slightly inconveniencing the adult but think about how your child's feeling. If you don't trust the other adult with more than two outfits and no games then that's what you need to do. But supply nothing it's hurting your kid dude. Do better be better.", "YTA.  If you are concerned about expensive items being taken, make a trip to a thrift store or Walmart.   Send him with cheap stuff that doesn't matter if it gets left behind.  Same way with games.  Don't let your son suffer because his parents are in a pissin contest.", "YTA for not putting her on child support. That money should be going towards your son’s future. NTA for not sending clothes, but you should have given her the heads up.", "YTA \n\nIf you are changing the way you are doing things, you need to communicate that with her. Tell her you are sick of not getting items back, and will be sending fewer clothes. Ask her to buy a couple things for her house, especially things like socks and underwear. \n\nThat being said, if clothes last about a year, and she lives somewhere with seasons, she really is spending money for clothes that are only worn twoish weeks out of the year. He is most likely not wearing the same clothes for Christmas break as he does for the summer. At least send him with a couple outfits to take some load off.", "I get that you don't want expensive items not returned. I get that you feel like she can't be bothered to wash/fold stuff before throwing it in suitcase.\n\nThat said, make sure your kid has enough clothes(it does not have to be as many outfits as days he's there.  Ie 7 outfits/7 days.  It can be 4 for 7 days--she can do a load of laundry).\n\nAlso if you are worried about good clothes going and being left/ruined--Take a trip to a thrift store and make it a fun for him--let him pick out his Mom Clothes.  \n\nGames--no don't send those. She can buy system herself. Or you can invest in a cheap Walmart priced Tablet and program it for kid safety then send it along with him.\n\nBut yes YTA if you don't send a least a minimum number of clothes sets so that your kid has only one set of clothes.  (Kids do outgrow clothes--and I don't know how fast your kid is growing).", "Sorry OP but unfortunately ESH here other than your son.\n\nIt might be annoying for you that your son's clothes are dirty or messy, and that some of his things are missing, but it's nothing compared to what your Son goes through having to move from place to place.\n\nYour Son needs to feel as supported as possible no matter what, have home comforts and feel loved. If his clothes are mostly coming back unwashed, things are missing etc then maybe his life at his mother's isn't as stable as it is with you (or maybe his Mum gets him to pack his own back and doesn't check it). If the only stability you can give him during the time with his Mum is helping him pack his bag and making sure he has everything he may want or need while there, then you need to suck it your irritation for the sake of your son.\n\nMy (29f) parents split when I was 18months old, I was almost always living out of a bag until I bought a house with my bf at 25yrs. I haaaated living out of a bag/bags, never feeling like I could get too settled anywhere because I'd be gone again in a few days. Knowing I'd likely leave something important behind and have to go back for it, making it take even longer for me to be able to get settled until the cycle started again.\n\nWhen I was in primary school I didn't want to bother anyone so if my parents had put out my clothes for the day and didn't include underwear, then I wouldn't wear any that day. If I ran out of clothes at my Dad's (I lived with Mum mostly) then you can guarantee that I wouldn't go to my Dad and ask for more clothes or let him know what I was missing, I would just take dirty clothes out of the wash pile and put them back on. I have ADHD so not sure if this was anything to do with that or being an insecure child that desperately didn't want to annoy anyone.\n\nAs I got older and I was able to pack my own bag, obviously I had everything I needed, and I'm pretty sure my parents would talk me through the list of things to double check I'd packed it. Although there was always something I'd forget and leave behind, the amount of times that my parents had to come and drop off my cuddly toy to the other parent 🤦‍♀️ luckily they only lived 10min drive apart.\n\nIf things are missing when he gets home, can't you get your ex to mail them to you?", "YTA.  Your son should go live with his mother.", "Do get child support and use it to pay for.the extra clothes. I get where you're coming from, but you can't send the kid w/o clothes.", "NTA. She doesn’t pay any child support and she should 100% have clothes for him and if she doesn’t, Walmart is everywhere.", "YTA its your son who suffers from you being petty with his mother.", ">I feel like clothes should last at least a year or two before they get outgrown especially if you size up.\n\nI wish. My son needed a full new wardrobe every six months until he was 16. My daughter - every season until she was 17. Some kids grow faster than others. \nI get it - your ex is irresponsible. How old is your son? Can he take some responsibility for his things?", "YTA\n\nYou should have at least sent a couple of changes of clothes.  To send the child with nothing makes You the AH.\n\nIf the child goes 2 months between visits, then yes, the child WILL outgrow clothing before the next visit.  Clothes do not always last 2 years, kids outgrow them. I’ve had my kids outgrow clothing in under one school semester.", "Uhh...yeah you did.  You did it to get back at her.  Look, we all get it!  She's a bit of a mess, and this kind of thing gets old.  But, being the bigger person is the gift you give your son, not her.  We all have times when we ask ourselves, \"Why me?  Why do I always have to be the grownup?\"  And in this situation, the answer to that is easy...it's because you're the one who decided you were going to give your son a happy, drama-free life.  Good job!", "YTA.  You’re going to inadvertently punish your son for his moms decisions.   You’re right that it’s unfair, you’re right that you had been more responsible than his mom ( or at least it sounds that way).\n\nDo you want to be “ right” and petty, or give your son what he needs, even if it means taking on work his mom should be doing? \n\nDon’t make him a pawn.", "My sister went to a thrift store and bought stuff to send with her daughter because, if the clothes came back, they were stained. Also, you can go on Next Door or Buy Nothing app and people are usually good at donating underwear and/or clothes free.", "NTA, I grew up visiting my dad a few times a year. As an adult I helped my brother with his kids. Who visited their mother once a month or so. I consider myself a source of knowledge on this subject.\n\n\nMy dad kept socks and underwear at his house for me  he even had a dresser and a bedroom. My mom always sent me up with a duffel bag of clothes and I hardly wore anything out of the bag because my dad would buy bigger sizes of clothing so I could wear them for each visit in a year. As I got older and grew less he started buying me more clothes so I could take some home with me. At no point during this decade, did he ever complain about having to provide me with clothes. If anything it made my life easier because I never had to worry about forgetting my clothes because my dad had a dresser for me. (An incident where I left my clothes in my mom's car because we all got distracted looking at a black bear and halfway to my dads my mom called saying. 'you forgot something' and we laughed it off and Dad said, well good thing he has clothes at my house) There were a few times I didn't even bring a bag. Just a backpack with my Gameboy and a bunch of books to keep me busy during the drive.\n\nPart of being a parent is providing for your kid, if she doesn't respect you enough to provide her own kid with clothes because he grows, then she is a delusional idiot.\n\nA pack of socks and underwear is maybe $10, she can deal with it.", "YTA, not for being frustrated, but because you have essentially punished your son for his mom’s actions. Personally, I’d have a discussion in which I was clear all items return with him, or you will pursue child support to cover the costs of lost supplies. Don’t put your kid in the middle.", "NTA she is his parent too the least she can do is buy him clothes", "How old is your son? Because if he’s young enough, he’s likely growing a lot more quickly than you realize (you probably don’t even notice because he lives with you) and his mom genuinely may not have enough clothes that fit him. If this is the case, YTA for not packing a bag for your son, especially because the only one paying the price for your actions is him.", "NTA she should easily be able to provide what he needs when her son is there, cause lord knows if the shoe was on the other foot the moms would be all over you", "Send basic things. You can get great stuff at the thrift store, shorts, jeans,tshirts. 1 pair of well worn sneakers. This way if something goes missing it wasn't a favorite or expensive. Don't sent expensive gaming gear. She can entertain him during this time. Then just let it go. You won, you have your child almost all the time.", "NTA with the exception that you should have communicated to the ex that you will no longer be sending a bag along with info on his current sizes. Letting her know in advance can help assure that your child does not do without.", "NTA she is also a parent and should know what her child needs and does not need.\nShe knows when her child is coming to visit her, so she should be an adult and make sure she has what he needs in her house. \n\nIf her excuse is that he has grown out of what she has, then go buy some more.\nIf she can’t afford it, go to goodwill, or any second hand store to buy what is needed. \nNot having underwear or socks for your child that YOU KNOW is coming over is absolutely ridiculous and neglectful.", "ESH. Not packing games and toys is a good idea. Making your son uncomfortable because you can’t send clothes is rude.", "Do you tell her what sizes he's wearing before his quarterly visits so that she can make sure she has some clothing that fits?  Thinking back, I can guarantee that my own kids were not wearing the clothing that fit at the 4th of July picnic to Thanksgiving dinner--and even if it were the right size it wouldn't be warm enough.  They certainly couldn't wear the winter clothes from the previous year.  If your kid has normal, healthy growth I doubt he can either.  \n\nTo be fair, it is perfectly reasonable to ask mom to make sure everything that went to her house comes back to yours.  If your son is old enough to have a gaming system, he's old enough to start taking some responsibilities for it and can be expected to double check that at least the games are in the bag.  \n\nGentle YTA here, not necessarily because you sent him empty handed but because you didn't even give her a heads-up you were doing something differently this visit.  You might think you're standing up to her, but it's possible you're hurting your son far more.  Unless you know for a fact that she has the ability to immediately go out and get him a couple outfits and something to sleep in, he just might be wearing the same clothes for several days.  Does she have enough money immediately available to do that?  Does she have time to go shopping?  Does she have transportation to go shopping?  If the answer to all of those is not yes, you're just making the situation worse for your son, not her.  If you're angry the clothing is wrinkled and/or dirty when it returns, are you positive she has the ability to wash them?  \n\nMy stepchildren didn't come empty-handed to my house, but rather with ALL their dirty clothes.  Their mom didn't have a washing machine, the nearest town with a laundromat was ten miles away, and she didn't have a car.  I grumbled more than a little about all the goddamn laundry I had to do every other week, but the alternative was for those kids to wear dirty clothes, sleep on filthy sheets, and dry off after their baths with mildewey towels.  And I wasn't ok with that result, so I did it anyway.  Sometimes it's not the \"fairness\" of a thing, but the effect it has on someone else, that should drive our decisions.  \n\nAnd oh-- just stop with that whole \"buy 'em big for next year thing\" already.  I had to have several surgeries on my arm as it grew because my grandma shared this philosophy.  At six years old I fell down the stairs and broke my arm in four places because my pants--already too long and rolled up as it was--fell down and tripped me.  Plus I looked stupid wearing clothes that didn't fit--and I know this because people both children and adults told me so.  Don't do this to your son.  Not only at her home, but at YOUR home too.  Kids deserve adequate clothing, and that includes a proper fit as well.", "YTA. Refusing to provide clothing for your child because of a petty grievance is abuse.", "This all could have been avoided with a phone call and you know it. When it comes to your kid, you two need to be on the same page, not this petty bs. Your son is the one that pays the price. Be a good example and show him how adults can put aside their differences to take care of something important.", "YTA - You sent your kid away without his stuff. His favourite hoodie, his favourite t-shirts, the socks that make him smile.  Imagine if you had to go on holiday somewhere but weren’t allowed to take anything with you.  And you weren’t even sure if anything was going to be provided let alone if you’d like it.  \n\nAlso, kids grow and change. What they like to wear changes.   You’re basically asking them to spend a the first day shopping for new clothes or that your son just gets whatever your ex thinks he might want to wear.\n\nSend your kid with his stuff but put in a list of everything that you’ve packed so you’ve more chance of getting it back (and don’t do it in a passive aggressive way either).", "NTA but you should be making her pay child support, that is for the benefit of your son, even if you don’t need it to help raise him.  Put it into an account under his name to use it for college when he is older.", "NTA", "Going against the grain. She is a parent. Part of her responsibility is to get with you to know kids current size to get him clothes. She is supposed to make sure he is entertained. NTA… if roles were reversed everyone would be calling you an ahole.", "Really at the end of the day who am is bearing the brunt of not having clothes? It’s your kid. Your ex is mildly inconvenienced by having to get clothes for him but making him have clothes there and at your place and not moving back and forth between them is just stupid. \n\n Idk how old he is but if he’s old enough to have a switch then he’s old enough to be responsible for the games. If he forgets them then he will have to wait until he sees his mom to pick it back up. \n\nAlso at the end of the day your ex doesn’t know every single thing you’ve packed for him so it’s just as likely that she didn’t realize something is missing when she sends him back. \n\nThink I have to go with a respectful YTA.", "YTA. This isn't about your son at all. You can wash his clothes when he gets back. This is about punishing your ex-wife for doing something you don't want her to. Your son is the only one who suffers, so YTA all day long.", "NTA \n\nShe's not paying support, she should have money on hand to by him some cheap clothes for the lithe time he's there...a pack of underwear, a pack of socks, a couple of t shirts and goodies and some sweats, done. \n\nMy bf used to just send his kids with their school supplies. So much stuff was 'in the wash' or 'forgotten', he had to rebuy a crap ton. Turns out the ex was selling it all on FB after the kids came home.", "YTA- at the very least you should have given mom a heads up", "ESH. I swear to God I understand where you're coming from. My stepdaughter sees her mother every other weekend, but usually less than that, and mother has sent texts refusing to purchase or provide clothes anymore. She feels it's \"not her job since she's not primary parent\". I was livid, I wanted to send SD without clothes so she would see that her mother doesn't care enough to clothe her, I wanted mother to be inconvenienced and have to scramble and make excuses and look even worse. But guess who suffers? The kid does. So you send the clothes anyways, because more than wanting to show anger at the other parent, you should want to show your child they can always depend on you to do what's right for them.", "YTA. Sending your kid anywhere without undies is not cool.", "NTA. \n\nthere are posts on this sub all the time where the situation is exactly the same but the genders of the parents are reversed, and every single time people suggest the primary parent stop picking up the other parent's slack. \n\npart of being a parent is providing for your kid, even if you've moved out of state and only see them 4 times a year. it shouldn't be that hard for Mom to ask what sizes her child wears now so she can have things ready for him. or even go shopping with him when he gets to her.", "YTA and you did do this to get back at her. Why should she have clothes for your son when he doesn’t live with her. You should lose custody over this stupid little trick.", "I’m you in my kids situation. My kids go to their dads and I don’t see things again, they come back stained and dirty, games missing etc. It really sucks. \n\nHowever, this isn’t my kids problem. They do the best they can and I’m not going to send them without necessities or say, you can only play with XYZ at my house because I paid for it. \n\nYou are the primary parent. Don’t punish your kids for your choices of their parent. YTA.", "ESH. Since he is going for a visit, send only play clothes, no nice clothes. Underwear and socks are not that expensive. As for his gaming, that stays in your home, or send only one game. I seriously would keep it home. One pair of tennis shoes. That isnit", "It’s not your ex who suffers when you send your child with nothing. It’s your child. They should come first. YTA", "YTA\n\nYou are making life hard for your son is a misguided attempt to inconvenience your ex.  Get over yourself.  Tale care of your kid.\n\nIf you have issues with the actions of the non-custodial parent, you should discuss it with her.  Not play passive aggressive games with your kid's clothing so he's the one naked at mom's house.", "I basically agree with the idea that it is just misstep but also have you considered maybe your son packs his bag to come back and is forgetting stuff and just shoving it in there last minute.", "NTA, unless you failed to let the other parent know ahead of time that there would be a change from the ‘norm’, so they could prepare, or they just don’t care and expect you to handle everything. \n\nThis is a frustrating aspect of coparenting from a distance. Yes, you want to make sure your kid is good to go, but you also get sick and tired of throwing money away or not being able to plan. \n\nI went through this for many years with my ex, until our child hit adulthood. I eventually started adding a typed list of items that were packed for our child. The list was in an envelope with a note to the other parent each time. Our child knew to hand the note off to them upon arrival. A backup list was packed into a pocked of the suitcase. It was up to our child and the other parent to ensure everything made it home using the list. \n\nYes, some things still didn’t make it here and there, but it drastically altered the situation for the better moving forward. As for wrinkled or dirty clothing, I don’t ever mind that. It’s just a load of laundry, and at least it made it home!\n\nWe are back in this situation while caring for our nephew part-time. It’s a long story, but we often end up having to pick him up to stay with us for multiple nights with near zero warning. His mother cannot get herself together enough to pack for his stays. We typically have only what he showed up in. \n\nWe have been buying him full wardrobes each year for the last few years, since his mom got him back from foster care. Unfortunately, we end up sending him home in ‘our’ outfits and he shows back up in clothes that are too small/stained/damaged/smell like cat pee/etc. to continue using. That means we don’t send him back in them (we typically take him to school and she picks him up when visits are over, again often with very little notice). We are already down to only one pair of the five new pants we bought him recently. We have one other pair that is too small. \n\nI’m sick and tired of supplementing her in this way. She spends nearly no time with him, so she buys his love with expensive gaming systems and computers instead of clothes. She knows we won’t let him go without these things, so she won’t step up. \n\nThe best way to handle this, if your ex is someone you can communicate well with, is to do just that: communicate. Don’t be mean about it, but let them know the issue and come to a compromise that works for everyone. If that won’t work, then keep letting her live in the bed she has made. In our situation, there is little hope, but that’s not always the case (as demonstrated with my child’s other parent). \n\nOne last thing: If you go with the list, be sure to explain that she will be paying the cost to replace any missing items upon your child’s return. Typically, knowing an invoice is on the way helps folks remember to get things done!\n\nWishing you much luck with this! No matter the outcome, always make sure your kid is good to go!", "How old is the kid?", "What about your child?   It must be awful to not have your own possessions when not at home … I think you’re awful.   Your child will think it too … just wait 😬", "The clothes are for your kid, not to make her life easier. Imagine being a child of divorced parents and you hear this back and forth bickering over some damn clothes. Like … please don’t do this.\n\nIf he sees her only 12 weeks out of 52 - are you really expecting he’s going to fit in the same clothes?", "I completely understand where you're coming from though. Every single item of clothing I provided for my grandson who lived w his useless-ass father, went home w him and was never seen again. (Mother is useless too.) I provided all his clothes for his entire childhood. My mom (great grandmother) would go to his school to pay his lunch bill bc it was so high, all they'd feed him was peanut btr and jelly lunches. His dad wouldn't apply for free/reduced lunches or send lunch money. My grandson said most of the clothes were taken by his stepmother and sold. Anyway, he's grown now and as soon as graduated HS, he came to live w me. But the courts wanted him w a parent, idiots.", "So the child suffers because you got mad that he brought home wrinkled clothes?", " ESH\n\nLike I said in another comment, and I stand by it, I would not rely on her to have what your son needs bc she only sees him 4 times a year/12 weeks out of the year (as a mother, IDK how one can do that...but thats my own personal thing...). \n\nShould your ex have a handful of things? Yep. Should she maybe communicate with you and ask what sizes he is wearing, maybe have a few emergency clothes, or just simple \"I was thinking of you and thought you would like this shirt/pants\", yes absolutely. BUT\n\nYou should never put your son in a position where he feels like he is in the middle, that he is the root of the problem. I understand your frustration but this was not the way to handle this.", "ESH \n\nSo she honestly should have the basics at her house. The stuff missing in a terrible but the stuff wrinkled and dirty is not that big a deal. I’m assuming she can afford to buy a coup of outfits, so it shouldn’t be a big deal for her to take some responsibility for clothing. If you know she can’t afford to then that was super unfair to your son. And leaving him to deal with having nothing when he gets to his mom is also unfair to him, that’s why ESH I do understand your frustration tho. \n\nIn the future I would send a checklist of everything your son has packed. Teach him to understand what he is bringing needs to come home and have him be a least a little bit responsible for checking over the packing list. His mom shouldn’t leave it all up to him, but you have to work with what you’ve got.", "Info - Did you let her know ahead of time that he would not be bringing any clothes? If not, you’re punishing your son more than her. I understand not sending him with nice clothes or the Nintendo, but if she wasn’t given a chance to buy clothes ahead of time, at least sending him with old play clothes for a day or two would help. Mostly so your son is not stuck wearing items that don’t fit or are uncomfortable and he’s not left in the uncomfortable position of a surprised, angry mom.", "It sounds like you need to take it out on her, not your son, and collect child support.", "YTA\n\nIt doesn’t matter how long you “feel” clothes should last, the fact of the matter is he’s a growing child and all the spite in the world won’t change that.", "YTA \n\nYou sound bitter. Just get child support so you can feel better. Good grief.", "You could send him with a few things to wear but from a secondhand store, that way if they don't come back, it won't be a big deal. Kids grow fast and summer clothes won't always fit the next summer. She chose to move away. She doesn't pay child support. If the stuff came back, crumpled or not it would be ok. If you sent games and they aren't being sent back, she is being mean to the son because she is denying him his things. Maybe it shows she doesn't care.", "NTA. I find the a-hole votes astounding. Doesn’t matter how often she sees him, she should have clothes for her child. If the roles were reversed, they’d be calling you a deadbeat father.", "YTA. My father never had clothes for me and I saw him about the same schedule. He would never know exactly what I would want to wear, my size, since kids grow like weeds, wouldn't be able to go shopping for me without that info. My mother always sent me with my own clothes. You really sent him with nothing? WTF? \n\nIf things are missing, TALK TO YOUR EX like an adult. It's possible stuff got misplaced, broken, etc. \n\nYou deprived your son to spite your ex. Bad parenting.", "NTA I’ve been here sending clothes and games and things are missing and broken. And guess who has to buy these things all over. She should have things or go buy so cause that’s what you have to do. This use to grind my gears!!!", "I knew a guy who would pick up his kids and they would change out the clothes they came in and they when they left they would change back into those clothes.", "Im going against and going with an NTA. She IS the mother it is her obligation to have clothes to your child and something to distract him regardless if you send it or not. \n\nI remember more than one post about a mother complaining that the father didn't have clothes or games for the kid and being applauded. She IS wrong, and if you communicate with her before, she is even more wrong for ignoring.\n\nHonestly? Buy clothes cheaper and send him the minimum and tell her to step up as a parent.", "I can understand you’re being frustrated about the game is not coming back. But it’s not a big deal that the clothes are washed and folded perfectly when they come back so long as they come back.", "YTA.  You punished your son to even the score with his mother.  The only one really hurt here is the kid caught between two immature adults.", "ESH.\n\nMom needs a summer wardrobe for kiddo.\nIt makes sense they’d get it the first week.  Minimalist, enough for two weeks between laundry.\n\nYou need to realize clothes come back worn, and plan on laundry. I’m assuming you have more clothes for kid.", "ESH go for child support and use it to buy Walmart clothes you don’t care if you get back. Problem solved.", "YTA - How do you think that clothes can last 1-2 years without outgrowing them? We are replacing clothes every six months (every season) and there are very few articles of clothing from last winter that fit them now. Don't use your child to make a point to your ex.", "NTA\n\nAs a single mum, I can concretely say this. The other parent also has a responsibility to clothe and take care of ttheir kid or they are placing extra mental load and emotional/ physical labour as well as financial costs on you.", "YTA for putting your vindictiveness toward your ex above your responsibility to care for your son. He doesn’t deserve to be put in the position of not having enough clothes. If you have an issue then use your big boy words and address it, don’t be passive aggressive and petty", "NTA\n\nMy grandmother would buy me the best toys for Christmas, and would let me take them home with me. Well, my mom’s second husband thought I was spoiled I guess, and made me give my best toys to the daycare. One was a red Barbie corvette, that went from a two to four seater, and another one was a 3 foot tall dollhouse that my grandmother had hot glued every furniture piece in it so I wouldn’t lose them. \n\nAfter that she forbade me from taking anything she gifted me, other than clothes, home until we left him. \n\nBut she always had clothes for me; underwear, nightgowns, shirts/pants, shoes. I would pack clothes but I didn’t have to talk a whole lot and if I grew out of them, she would buy me new ones. And we only visited two months during the summer and a week at Christmas. And now that I think about it, I think my mother had the same issue with my dad and grandma. She was the primary and they didn’t think they needed to keep clothes for us.\n\nA parent, custodial or not, should always be able to buy clothes for their children, and want to. It’s not wrong to expect and assume that the other parent is taking care of y’all’s child during their visitation.", "You need to send clothes and games with your son. He probably does outgrow his things often. Son does not need this to be a point of contention. Take the high road. You are doing a great job!", "kind of a reversed situation i supposed but my dad had partial custody and we all lived close together and at a certain point any time he’d buy anything for me he’d just send me back home in what i was wearing and wouldn’t let me bring many of my toys because he’d never see it again and i wouldn’t know where any of it went. totally understandable.", "YTA. Contrary to your edit, you are trying to get back at your ex and using a child to do it is gross no matter how you go about it.", "So you are angry with his Mum and chose to show it by punishing your son?\n\nYTA.", "ESH.\n\nShe is right that children outgrow clothes very quickly, but even then, she should have least some essentials. But you are an asshole for sending your kid without any clothes just because you are pissed at the mother. The only person who suffers here is the child.", "YTA. This is about your son not your ex. You should have given her a heads-up that you were not sending clothes with him. It is reasonable to expect that your child has grown since the last time he was with her and even if she had some items he may not fit it them anymore.  Send a checklist of all items so there is no confusion. Your decision effectively hurt your son. Be the better person.", "Just remember it's the child that gets hurt in these Shity situations. Time with their mum shouldn't be overshadowed by your annoyance. I understand not sending the games but the bare necessities should always be covered no matter how annoying it is when it comes home. Don't make your child suffer becaus eshe cba. It's cruel and who knows how she speaks to your child because of the inconvenience.", "How old is this child that clothes last for a year or two?!?!?!? Exactly how many sizes are you sizing up? In any event, one extremely simple solution is to make a list of what is packed and put a copy of the list in the suitcase so you and your ex both know what should be in the bag when he returns home. Anything inadvertently left behind can be mailed.", "Slightly YTA. \n\nYou could have sent a few basics, enough clothing for a day or two until his mother can take him shopping. Sending him with nothing impacts him more than necessary.", "YTA. You don’t say how old your son is, but it’s slightly unrealistic for mom to keep a wardrobe for someone who spends like, 1/5 of the year there. You could have AT LEAST packed like 2 outfits so mom could take him shopping. \n\nBut I also understand the frustration of things going missing. My daughter’s dad lives out of state and if I send something, it 100% isn’t coming back and it’s super annoying. But, I had it written into our parenting agreement that he is responsible for having what he needs for her. Now that she’s getting older she does take a couple of things but in general it’s still his responsibility.", "NTA I seen another similar post but the parent was mother...the other parent was selling the items or giving them away as gifts. \n\nYou have primary custody and she pays no child support...she should have plenty of money to buy socks, underwear etc for her child....also why does she get Thanksgiving and Christmas...just something that bothered me....\n\nShe needs to be responsible adult ensure all articles of clothing are there, she should have extra when he comes or buy some when he visits....SHE IS NOT PAYING CHILD SUPPORT:", "Info:\nWhy didn’t you use your words to communicate with her about this? \nIf you had and she refused to acknowledge it, then nah NTA", "Esh.  This poor little guy is punished now because you are being mad at his mom. Now who knows what if any underwear he will end up with or socks or clothes that fit/clean,etc. You can either send a list of things he needs prior or send the items and deal with possibly not getting them back. \n\nIf it really bothers you,take it to court and go for child support since the cost is becoming an issue.\n\nYour child will know who supports him...be that person.", "Don't stoop to a bad parent's level.maintain a higher level, and keep caring for your kid \n\nIf she doesn't have clothes for hi., make a printed list and include in his case so she knows that you know what you sent. \nDoes she have kids of her own out there? Do you suspect her of stealing the clothes and games? Or is she careless and just ensuring they're packed? \n\nYou're the primary parent for many reasons. Being petty won't force her to be a better parent if she doesn't care. Do right by your kid, and learn to laugh it off.", "NTA legally she has to provide clothes when he's there. The courts would agree with you here. Each parent is responsible for providing for the child during their parenting time..", "I wouldn’t care about stuff coming back unwashed or wrinkly, that’s petty imho. Constantly missing stuff would piss me off. If you communicated with her about the missing items and your change to not provide things, then NTA. She can stop by Walmart and pick up some socks and underwear.", "a as", "ESH.  \n\nLook, I get it.  Having been the primary custodial step parent to a birth mother who saw her children on the same schedule as yours, it got to be too expensive to send their clothes with them on these visits only to have them returned stained, smelly and even molded one year or not returned at all. \n\nWe didn't feel right sending them with nothing at all, so we just made sure to pack up things that were older, cheaper ... think play clothes, not school/church/dress up clothes.  She could supplement anything else they needed while they were there.", "ESH. Your critiques of your ex are valid, but you decided to figure out if she had clothes by….sending your son on an interstate trip without them. Do you not see that the only person this harms is your son? \n\nIf the missing/dirty clothes and items bothered you that much and you wanted to not send any, why didn’t you pick up the phone, explain, and **confirm that your son will have clothes when he arrives.**", "Sending no clothes was wrong, as it makes it hard on the child. As someone else pointed out, next time send a couple packages of underwear, T shirts, etc. The basics. Send some older clothing so it’s not a big deal if it doesn’t come home with him. Leave the expensive stuff at home.", "Nta how on earth do you pay nothing for your child then expect not to have things for them ready and not return some things at the same time? It's screaming entitled.", "Soft ESH.  You don't mention how old your son is. Your OCD may not be his so unfolded clothes may just be his way of packing.  With that said, it is not a vacation and it is not up to you to provide everything for him while he is not in your custody.  She's a parent and responsible too for his welfare.  Communication could have been better and you know it. \nAs a child of divorce, I know the struggle of not having my own stuff at the second house. While you love the second parent, it is not home. However, with expensive games not coming back, that's another story. If your son cannot remember to bring them back on his own, he shouldn't  be taking it with him. Your ex can provide one for him there. You could try to compromise and send a list of all REQUIRED things for your ex to make sure she checks for before he comes back but you are not an ATM and she's a deadbeat who doesn't pay child support. She can afford to provide entertainment if she is unwilling to ensure valuables are not returned.", "YTA. I get being upset that things are going missing but ultimately the only person who is suffering from this reaction is your son and it will result in a negative relationship. And if your son really is only going four times a year then she won’t know what side clothes he needs, kids grow and sizes are different in shops. I can be a size 12 in one shop and a 16 in another, it’s the same with kids.", "YTA he's not at her house often or regularly, it's not surprising he doesn't have a lot of clothes there. All you've accomplished is making your son's arrival awkward for him and reminding him that his situation is challenging. There's no reason why you couldn't have sent a few basic outfits with undergarments. Or at least called in advance to confirm if he had what he needed there. And does your kid really have many clothes that last 1-2 years??? You are being a petty asshole for sure here, don't do that to your kid", "Dude, I'm the full time parent who never gets the kid's stuff back and I'm here to gently tell you YTA. \n\nKids grow so fast, she has no way of knowing what size he'll be when he gets there. So it's unreasonable to expect her to have everything, especially when *you didn't bother to warn her that he wasn't bringing a bag*. That was a dick move. \n\nMy way of coping was to buy thrift store clothes or always send my kid in stuff he was about to grow out of so it doesn't matter if it comes back. For the switch, my kid was only allowed to take one game - for a long trip, I'd buy him a new one so it would last the week. \n\nBasically, **you have to decide if you hate your ex more than you love your kid**. If you do, keep sending him with an empty suitcase. If you love your kid more, take the hit and suck it up.", "NTA she should have clothes there for him.", "Does it really is so much work for her to buy clothes for HER son? It is the least she should do and more considering that she is not giving child support and is only a mother 12 weeks a year. \n\nJust because you are the main caregiver does not mean that she has to have fewer duties and responsibilities with her child, on the contrary. She is taking the easy part of being a parent. \n\nAt least she pays for the plane ticket? it would be the last straw if you were also the one to pay for it. \n\nNTA, for your child's own good, demand child support", "ESH - If you have an issue with stuff not coming back or stuff coming back in good condition, you need to communicate. If you were planning on sending him with nothing, then you should have at least told her so she could be prepared. In the end, it is your child that suffers for the petty issues that you and your ex have.", "Nta. \n\nIt gets expensive after a while to provide a wardrobe of clothes for your house but also for round at hers too. My ex used to take it for granted that I'd send our daughter with what she'd need for a weekend but I'd get half of it back, crumpled and smelling awful.\n\nI stopped sending her in anything except what she was wearing at the time and whilst it took a while, she's now got appropriate clothes for round at his too. \n\nSince you're sending him away for a longer period of time it may have been appropriate to warn her in advance but it's not difficult to pop and get some new clothes, tell her to splurge some of the missing child support on it.", "NTA but Time to teach your son how to take care of his own stuff, be responsible for it.", "YTA because the person you’re hurting isn’t your ex, it’s your son.", "my son is 16 now and we went through the same thing with his Dad\nYes, it annoys me but it’s more important that my son has clean clothes and shoes that fit well when he visits Dad\nKids will remember how you handle these kind of situations and appreciate when you keep the drama low", "I've been on both sides of this. I am currently the NCP of my 11yo daughter and her dad and I agree that we send the bag of clothes because what your ex said is true. However, I make sure everything stays together and comes back washed. If I didn't her dad would be within his rights to stop sending things. \n\nNTA.", "YTA\nkids grow m, how does she even know what size he is until her gets there?\nYou should have sent at least something. And if they not cleaning clothes etc bothers you then talk with her about it. Passive aggressive actions serve absolutely no one.", "Ntw", "You sent the kid somewhere with no clothes.  A place where is only goes for a few weeks at a time a couple time a year?  YTA and throwing a pissy fit because your kid doesn’t pack all his stuff into the suitcase for the return trip or keep track of his games.\n\nAnd no one believes your edit as your very actions scream revenge.  You are a pitiful parent.", "Send him with the clothes you won’t miss, the ones he’s about to outgrow. Always send socks and underwear, even if they’ll get lost, does it matter?\n\nMaybe your ex expects the kid to handle his own packing and laundry, and your kid just throws it all in haphazardly hoping you’ll deal with it when he’s back. Kids can be lazy about chores, and a 7 yo can feel overwhelmed with laundry if he doesn’t do it regularly at home.", "When people come back from trips, they generally have a bag full of unwashed/wrinkled clothes, and have forgotten a few things. That's just life. You dump them in the washer, make a list of missing stuff to ask about, and carry on. You have him for 40 weeks/year, and she only has him for 12. Of course his clothes and stuff are in your home, and it's not \"extra effort\" to pack them, it's 100% standard and necessary. YTA", "YTA you sound like petty little baby. my boyfriend was a child in the same situation as yours. both his parents fucking sucked, his mom abandoned him and his dad was abusive.", "YTA and from your edit, it sounds like you're in denial about your motives. No good parent would send their kid without clothes. You're being petty, and expecting your child to suffer for you.", "YTA. You're punishing *your kid* for no damn reason.", "YTA  \nNowhere did you indicate that you talked to either your ex-wife or your son about this situation before taking such drastic action. If your kid is old enough to be traveling with his Switch there is no reason to presume that he shouldn't be responsible for managing the contents of his own suitcase. If he only sees his mom four times a year it's not unusual that they both see their time together as a vacation and don't focus on things like laundry. This was the height of pettiness and didn't serve the best interests of your son.", "Ridiculous to send him without clothes", "YTA\n\nYou're punishing your kid. What does it matter if the clothes come back wrinkled or unwashed ? As for the recent development of missing items - just don't pack expensive electronics or clothes.", "Esh", "YTA, for not giving her the heads up before you sent him. This is a discussion you have before just doing it.\n\nMy brother and his ex don't exchange clothes either. The clothes my nephew has on is the clothes he goes home in. They had that conversation when my nephew was much younger.\n\nOnce you've had the discussion you need to keep his mom updated when his clothing size changes. That way she can be prepared for his visits.", "Info - I can’t tell if you’ve tried to have a calm conversation with your ex about this in the past or if you just went for the extreme option right off the bat…\n\nYou’re ultimately punishing your son, not his mom. You’re showing him that he can’t depend on even ONE of his parents to make sure he has what he needs. And you and your ex are going to make him feel like his basic needs are a burden, that he’s a Problem. That’s unacceptable. \n\nWhether or not your ex can be a responsible parent and have basic clothes etc for him, YOU should make sure your kid is taken care of.", "YTA. As a child of parents who behaved like this, your children are watching and listening. If you want your child to feel they’re not important enough to have clothes that fit (the basics), then continue. Or be the bigger person and make sure their time with their mother is a success for them.", "ESH - Sending son without clothes only hurts him. I understand not sending his best clothes, but since you know she only sees him four times a year, it would be beneficial to send him with at LEAST enough to get him through his week. \n\nNow I can understand only sending the essentials, but sending him sans pants isn't kind to him or to his mom.", "So he doesn’t grow at all between Christmas and spring break?  Spring break and summer? Summer and thanksgiving?  \n\nYou’d rather he travel several states then arrive and rush to the store to get essentials like socks and undies rather than take them with and risk getting them back dirty or wrinkled?  So he doesn’t deserve the continuity of his own things going with him?  Try going to your next 2 weeks vacation and not taking any luggage!\n\nYTA.  Your inconvenience vs your kid thinking 2 parents don’t love him enough to cover the basics of clothing or don’t love him enough to get past themselves.", "INFO: How old is your son? If he's less than 12 then Y T A for thinking clothes last more than a year before they grow out of it, and sizing up so baggy clothes, makes your son look like he wearing hand me downs.", "NTA. Send cloths and file for child support.", "I have a niece of bitterly divorce parents whose parents are complete assholes.  Add the mother and mother in law and kid can’t catch a breAk.  I suggested buying two sets of same clothes and label dad or mom in each instead of all the fighting about who paid for what clothes and a tooth brush and who paid for the last birthday cake.", "I would send a small pack of cheap socks and underwear from wal mart and a few outfits from the thrift. Do not send anything that you expect to be returned.", "You can order something on Amazon and have it shipped to him at his mom’s house.", "YTA if you didn’t warn anyone that you weren’t sending the things you typically do. Although I do understand why you would no longer send things.", "I can see your point of view. At 7 he could change sizes quickly but for a few weeks she could get by just fine with a few clothing items that go well together from Walmart. It would be a small investment. Mom should be putting some effort in and asking what he needs and his current size. She made a choice to move away from her child thus making visits harder. \n\nI will say though that his comfort should come first. If he’s a little uncomfortable being at her place then being in his own clothes may be nice for him. \n\nNTA as long as you’re ensuring he feels comfortable and secure and you’re not weaponizing him (doesn’t sound like you are).", "YTA. You’re absolutely using your child in a way designed to get back at her, despite your denial.", "So you normally send your 7 year old son with clothes and an expensive toy to his moms house.  Logically, I assume the kid, who again is 7 and from your comments loves visiting his mom, is excited and doing activités with her and most likely misplaced/forgot his expensive toy. \n\nLook, she should 100% be doing laundry, but I don’t really trust your side due to how angry, petty, and vindictive you sound.  Is she sending him home with a couple of articles dirty ?  That’s reasonable because people don’t do laundry every day.  The clothes not being nicely packed, it’s not great but is everything in the bag and the bag isn’t damaged then it’s an annoyance but your not married to her anymore and it seems a stupid hill to die on. \n\nThird, you  normally send him with clothes and instead of giving your ex a heads up so she could be prepared you chose to let him go to her without basic necessities.  She should have clothes for him, and I’m sure she can find a way to keep some stuff at her house in a few sizes to accomadate him but why the fuck would you send him with nothing.  Does it make you feel good to have done that ?\n\nI get that your angry and hate your ex with almost every fibre of your being, that’s abundantly clear from your post but congrats on being a class A jerk and choosing to put your son in the middle and use him as a pawn against your ex.  Do better at least for your kid, get a court order for child support, get in legal that she has to keep minimum X items in her home for your son, and get some fucking therapy and don’t pull shit like this again.  Your child is not a pawn.", "YTA.  You punished your son because you don't like his mother.  You sent your son without underwear and socks!  Seriously?  Who does something like that?  You're supposed to be the adult in the room, and you threw a temper tantrum for which your son pays.  YTA.", "Did you communicate to your ex __in advance__ that you were doing this?\n\nIf not YTA.\n\nEven if you did, YTA. You’re making a mountain out of a molehill and trying to weaponize your child. Do better for his sake.", "So you’re angry at your ex and you’re an adult, I guess. Still you decided that your kid should suffer so you can have a dig at your ex? And your telling us it was no dig at her? \nIt sounds you have a very tiny di… ego I mean and maybe you should start managing your emotions and talk about how you feel and what you expect of others. Your child seems old enough to have his shit together, too. \nYTA", "Who’s going to suffer?", "My daughters mother wouldn't send back clothes at all. \n\nWe kept having to rebuy for our house. \n\nSo we finally stopped sending anything but what she was wearing.", "YTA. Dude, you took it WAY too far. Your son is paying the price for your pettiness. Hope you're real proud of yourself.", "YTA. She sees him a few times a year. I wouldn’t keep clothing for a family member I see 4 times a year even if they were my kid. Why would I? It’s been established I don’t need it.", "NTA. My daughter goes to her dad's every other weekend and after the very first visit I told him he needed to get basic things for her. He did, and she just started taking one change of clothes to come home in. \n\nI totally get where you're coming from, and maybe next time, just send socks, underwear, and a couple changes of clothes. She can provide the rest, she's his mom.\n\nHow old is your son? Might be worth reminding him to take care of his switch and games. Maybe you'll even learn where the missing ones are.\n\nAnd get child support. You deserve it.", "YTA. You said that you didn’t do this to get back at your ex but, you are. You’re making your son go without over some wrinkly/dirty clothes.", "I think there’s a compromise to be had here. Let her know she will need a few things on hand ahead of time, but send him with the things he doesn’t wear as often, or things that aren’t in super great shape. That way if it goes missing, oh well. Costco/Target/Walmart- get a few cheaper things to send in his bag. I wouldn’t send all the games with his electronics. Maybe have him pick 1 or 2, so it’s easier to keep track of. \n\nI know you shouldn’t have to do this, but it might be the easiest way to support your son, make sure he has what he needs, and not lose a ton of money in the process.", "NTA because I honestly think you have not looked at this from an outside perspective. I have two sons. They outgrow their clothes pretty fast. I would send him with 4 days worth of clothes. I did not see how old he was. I would NOT be sending games with him. If mom wants to buy games then go for it. \n\nBut if it was me I would not send games because it might give him extra time to hang out with mom versus being glued to his games. It is also a lesson in responsibility. He is not keeping track of his expensive items. This could actually be his fault.", "YTA. Your son needs clothes that fit him for his visits. Poorly packed clothes are a hazard of a child travelling anywhere. \nInstead of punishing your son by neglecting to pack clothes for him, you should teach him to pack, and how to separate dirty clothes from clean. If he travels with valuables, give him and Mum a list to check back when he packs to return. \nIf something is left behind, it is reasonable to ask Mum to post it back. \nYTA for not ensuring your son has everything he needs for his stay.", "YTA, don't be petty, it's your child. She sounds like a mess and quite unprepared, But your son shouldn't suffer over it. I understand not packing a bag for the entire time, but a couple changes of clothes, winter jacket, and undergarments are a bare minimum.", "I agree with his mom. Not taking the same care as you to clean and fold and pack the clothes doesn't justify sending him with nothing with no heads up. Then you frame it as her bad parenting \"how can you have zero clothes for your son??\" Kids do grow quickly, and you'd set an expectation that he would come with clothes. Glad you reached out for some perspective, it can be hard to see the big picture. I agree with other comments, that this behavior and lack of communication is coming at the expense of your son.", "NTA.\n\nShe can go shopping with him now and buy things.  Sounds like a good bonding time for them.", "Why didn’t you tell her in advance?\nWould have been less surprising, as of now your poor son sits there with not enough clothes because his parents can’t talk like adults", "It’s just washing? I had the same problem. Even more frustrating was when they’d not return school uniforms and shoes… same no child support, and large absences where I’d see activity on fb that their selling things, and there’s all my kids stuff… \n\nI can understand electronics not being sent, but clothes that need washing is just punishment for your son….", "YTA. It’s not about your ex, it’s about your son’s comfort. Would you want to go to another person’s house to live for weeks at a time and only wear clothes and underwear that you aren’t used to wearing and that may not even fit you anymore, with none of your belongings or entertainment items? Who cares if the clothes come back unwashed - it’s essentially a trip/vacation for him and you can just wash them at home. Kids misplace stuff between locations, your ex isn’t holding onto his belongings.", "I’ve seen a post just like this but gender roles were switched and there was no YTA in sight 😂regardless ESH your son should leave with at least a couple of outfits, socks etc especially for just in case,but she needs to be paying child support asap especially since she’s not buying him his own clothes or things.", "Info: how old is your son? Did he pack his own bag at all?", "Sorry but in this case I feel the ex-wife should have some clothes with her. Her excuse of him outgrowing them would also apply to the husband but that doesn’t stop him from buying them as there is a need. I mean she doesn’t pay child support, can’t she buy a pair of pyjamas/socks/some underwear? Responsibilities are two ways.", "Yta. \n\nI spent every weekend at my dad's house for years and years as a kid. I didn't have a single article of clothing that I kept there. Not even a pair of socks", "Not totally the asshole. Perhaps you need to update the custody agreement to include clothes/games etc. that go from one home to another are returned and if not, the party where it disappeared has to compensate the other.", "File for child support and don’t feel bad about it whatsoever. Your son will still ask for help after he is 18. This is the only time she is legally required to help. You’ll likely still pay health insurance until he’s 26, will want to help with college, etc. You also need to save for your own retirement which benefits your son, too. (No one wants a parent that becomes a financial burden as they age.)", "YTA. You could’ve contacted her and let her know ahead of time you wouldn’t be packing anything. You also could’ve at least packed the essentials like underwear and socks or one outfit change. But it sounds like you wanted to get back at her so you didn’t and the person this effects most is your son.", "I understand your frustration but you should've given her ea heads up so she can prepare for it.", "NTA she has to provide for him when it is her turn. This includes clothes, food and ANYTHING else he may need. Just like you do. \n\nFrom experience letting toys and stuff go back and forth is just a recipe for disaster.", "Kinda ESH here. While I get what you are doing it's gonna suck for your son. Since your wife isn't paying child support she should be able to afford clothes.\n\nThere have been other instances of divorced parents where one will actually take (steal) anything the other sends over. The solution suggested should work for you. Go to a Goodwill store and get a bunch of cheap play clothes for your son to take. Let of a loss. I'd definitley not send anymore expensive video games but send clothes because you give a damn about your kid.", "Info: did you ever discuss the issues with her? Did you at least warn her this was going to be the case? I can see both sides here. You’re sick of not getting clothing back which is completely valid. She’s also got a point that buying him clothes for there is pointless if he’s at a stage where he will outgrow them before he comes back. Sounds like better communication is needed", "YTA-  your wife has very little time with your son.  If she bought clothes for the last trip they wouldn’t fit, or be out of season for the next one. \n\nDropping this on her without any warning is extra YTA. \n\nDid you even talk to her about this before you pulled your little stunt?  Try being a grown up and talking to her first next time.", "NTA. But. You should claim child support and use it to buy clothing to go to his mom’s. OR revisit the custody agreement and get a condition put in that she has to provide clothing and necessities while your son is with her. It seems like she won’t be motivated to care unless she is forced. \n\nKid’s clothes also don’t need to be expensive - thrift stores and Buy Nothing groups often have great stuff and at least then it would be less irritating to discover that things don’t return.", "She pays no child support and she ‘loses’ and and mistreats his stuff? NTA. She needs to parent up.", "Yeah, I'm going with YTA. If you are the primary parent, you know how fast he grows. If he sees her every few months, nothing she had for him the previous visit is likely to fit. So she'd be buying him new clothes every time. **Which is exactly what she told you.** That's just shitty on your part, and putting your son in the middle. Do better.", "I had this problem and started including a list of everything that had been packed in the suitcase, and would also send a copy of the list to my sons and their dad the day before picking them up. It didn’t help that the clothes were always returned dirty, but sons got in the habit of checking everything off the list before leaving. They also got a hour of my time or a treat if they got home with everything.", "So you arent sending things your son NEEDS (clothes) to be comfortable at his moms and you arent doing it to get back at her? YES you are! You are of the mentality \"I'll show HER!\".. pretty pathetic! I had full custody of my youngest daughter and her father lived in another state. If an item or 2 didnt make it back, so what? Its to be expected. I live in Ohio and he lived in Florida. I was not going to depend on him to make sure she is comfortable while there. There are things you put aside for your child. Stop being petty. So what if the clothes come back wrinkled and dirty? You would have re washed them anyway, right? My youngest is now 34 years old. As much as I disliked sending her to her dads for visits, it was good for her. What I wouldnt give to have those days back. Back when she needed me and counted on me for her happiness. Time goes by too fast to be like that.. angry about little stuff. Pick your battles.", "YTA because you pulled this without telling her. Expecting someone to read your mind is asshole behavior, and putting your kid in the middle of a fight between so-called adults is doubly asshole behavior.\n\nYou could have communicated your plan to not send clothes (which, 🙄) and would have kind of been in the clear. But as it stands, you made some shitty choices.", "If she can’t provide basic necessities for her child, stop sending him there. This isn’t about being petty. I have a friend waiting for his divorce to get finalized, and his ex sells every damn thing he sends with his son and claims she just forgot. I sewed an Apple AirTag in his backpack just to help him out. She dropped him off one time shirtless with no shoes-at 11pm. Keep track of everything going missing, and send her a damn bill. You’re not the one in the wrong here. Good luck!", "ESH Go get your son the child support he deserves from him mom, you are doing him no favors by letting her avoid her responsibilities to him. This also wasn't something to spring on her, she should have a heads up so the house could stocked with the things he needed.", "YTA the clothes are for the kiddo and you sound like a bitter ex. Get over it and do what’s right for the kid ciggie butt brain.", "NTA During HER TIME it is HER JOB to provide everything needed for your kid. Plain and simple.\n\nThe judgement of you doing it to get back at her wouldn't be the same if the mom posted this.\n\nYou shouldn't need to send him with anything. She should be making sure he has stuff. It's that simple.\n\nHowever you could have forewarned her that you wouldn't be sending him with anything anymore. In that regard you failed your son this time around\n\nShe's used to you packing for him so you could've told her that from no one she needed to be prepared. Let her know his current sizes and all. Suggest she size up so it last longer.", "Yta, but I get it. I live in the same state and make less than my ex, he only recently got clothes for the kiddo and they're finally starting to be ones that fit (he was chronically buying too small things). He also constantly broke things she took over there..like my bfs Nintendo ds that he let her borrow, my ex decided to take it apart for some stupid reason. He also is awful at packing lunch and I have to go to the school sometimes. It's frustrating but I can't have my kid be without clothes or food, especially ones that fit well and she likes. It's kind of a sunk cost thing. Maybe get a set of clothes from the thrift store to send with him? Include toys that are still fun but not a horrible thing to lose? It sucks but no clothes isn't a good option", "INFO: Did you communicate to his mom that he won't be arriving with clothes?", "Here’s the thing. You’re really not punishing her. You’re punishing him. Bitter divorces are so hard but he shouldn’t be put in the middle. Don’t do this again in the future. Don’t send things you aren’t willing to lose. I know you’re putting your son first when he’s with you. Make him the priority even when he’s with his mom!!  You can be the bigger person!!", ".... Only four times a year he goes to his mother's house.... And you expect a child to still fit in the same clothing for 1 to 2 years....!?!?!?! Are you absolutely certain that you are the primary parent...?", "YTA. Only four times a year but then state that’s 12 weeks, so about 3 months of the year. Yes, she should have some of the basics or be contributing child support so you can buy clothes but No way your that naive to say the clothes should last a year or TWO… kids grow like weeds.", "I understand where you are coming from however YTA because you didn’t give mom any notice just expected her to have everything already.\n\nOtherwise yea totally.  It would take one bag of missing things for me to call and tell her to use the child support you should be getting and spend it on some clothes and accessories for the child", "ESH. \nI don’t see anywhere that you say how old your son is. But from 5 on, they should be involved in packing their clothes, first with your help then with you double checking and then you shouldn’t even have to check, but you might anyways. \n\nIf your child is old enough to bring a switch with a bunch of games, they should be responsible for them. Or you send the switch with a single game or two. Or buy the digital ones that don’t need the card. But the game console going should be approved by her. “Son wants to bring his switch with some games, I want to make sure that’s ok because it’s something you’ll have to help him be responsible for.” If she doesn’t want it, it stays home. If she does, then you can say “where are these games”. Best thing to make a list and send it with him or in a message to her so it’s tracked what he has this time.  It’s a lot to keep track of.  \n\nClothes. Yes every parent should have basic clothes, or one would think. However kids grow like weeds and if you usually send enough to get by, why buy more? You need to speak up. And say “he’s not coming home with his clothes that I send. If I have to replace stuff all the time, I’m going to stop sending it. Either that or you need to pay child support so I can continue to support him.  Things will get forgotten. But she should be helping by mailing it back. \n\nCommunication is key. Helping your son take responsibility will also help.", "NTA If I understand correctly she doesn't pay child support or otherwise contribute financially and you have him about 80% of the time??? \n\nNow she's bitching about not having clothes for him and he grows too fast??? WOW! I  can see why you have custody...she literally doesn't seem like she wants to be responsible for him at all aside from visitation.  I'd do the same thing if he has his belongings coming up missing all the time.", "YTA:  I understand your frustration, but this is just hurting your son.  Aside, from the games I don't see the big deal.  Would it be nice if she laundered his clothes (big yes).  However, it sounds like it is like a big vacation for them, during his visits, so the washing of laundry might not cross their minds.  The games, I wouldn't send physical games with him, kids lose stuff and other people can take them.  No way clothes are going to last a kid 1-2 years unless they are in they are like 17-18 and even that isn't really reliable guide post.  My son hit puberty and we had to buy him new jeans like 4 times in one year, because he just sprouted that quickly.  If you didn't want to send anything, it could have been extra pants and shirts.  Underwear and socks are essentials in my opinion.", "ESH - Petty on your side, there are more adult ways to handle this.  WTH is she sending back dirty clothing, and keeping games?\n\nPrint out a check list of things sent, keep a copy, and have them both go over it to ensure things return to you?", "NTA as much as you annoyed her by doing this she is still his mother and parent. When she noticed he didn’t have clothes she should have bought it", "Since she's proven to be useless, go after her for child support and use the money to buy him extra clothes.", "People are going to hate my comment but NTA. She pays zero child support, she only sees him on holidays. She can go out and buy a pack of underwear and some outfits, AGAIN she's not spending any money throughout the year. How hard is it to go out and buy some outfits and send it with you? She's making it more difficult than what it is. Okay he's going to outgrow it, send it back home with him. If you send clothes with him the other times, she can definitely go out and buy some. She's just being a lazy parent.", "YTA. Grow up, man. If not for yourself, at least for your son’s sake", "Honestly, I can understand it. I have split custody of my oldest son and I 100% expect my ex to have clothes and stuff for him. I've sent nice clothes, games ,etc with my kid only for it to get torn up or it disappears. \n\nOne example is his switch. It's a 5 hour car ride to my ex's house so my son prefers to have his switch with him for the long drive. Well my ex seems to think he needs to ground my son if he so much as farts so he immediately takes my son's switch away and only returns it when he drops him off. I stopped allowing the switch to leave, but I got him books. \n\nMy solution about the clothes was to get a couple cheap sets of clothes that are his travel clothes and he only takes those over there. None of his expensive stuff goes since I don't want it getting torn up or disappearing into his half brother's room. \n\nSo NTA to me, but there are solutions without putting your son in the middle. I'd set up a travel bag with the cheaper clothes and get books", "YTA- your son is going to suffer because you are mad at your ex. That’s not fair to him . Just an idea- you could call her and tell her what your problem is. It was not right just to spring it on her. You have your son for 40 weeks of the year, and you know what size he currently wears.\nMaybe your son throws his stuff in the bag and he’s forgetting stuff.\nYou sound petty and angry.", "I don’t think you’re the asshole, but you do need to communicate better. Depending on how old your child is, he could very well outgrow clothes between each trip. You definitely should have told her that you were not sending clothing this time. \n\nHowever, she’s not in the clear either. If she’s not paying child support, then she should at least be contributing to his needs and making sure he has adequate clothing. Honestly, in this situation, I’d be tempted to say, “okay, I’ll pack and send his clothes, but, since I’m paying for all of his needs, you can start contributing. By paying child support.”", "My ex used to keep the nice name brand clothes our son had on when he picked him up for weekends from the sitter. His girlfriend had a kid the same age who would mysteriously end up with new clothes while mine came home in rags and mismatched shoes. It won't apply here, but after I told my sitter, she sent him with one shoe, or a shirt too small, jeans that had a broken zipper. Only took two visits of them buying replacement clothes before the good clothes started showing up. He lived local and had plenty of time and money to stop on the way to his house. OP, I would be so frustrated at his mother. She KNOWS he is coming and not like socks come in 20 different sizes!  If you sent nothing, would she step up as a parent and do right by her own child?", "Nta. In my custody agreement my ex is supposed to provide him clothing for when he is with him. He never does and complains. Its annoying", "YTA and you know it. Yes you absolutely are putting your son in the middle to get back at his mom. The thing is your son is the one who has to suffer and feel like a burdon on both of you. He will remember you being an AH to him and sending him with no clothes or his video games. He will remember how you treated HIM and how you made him feel like crap. You better never do that again. Maybe your relationship can recover from that 1 time if you stop doing it, but otherwise you will damage your relationship with your son forever.", "Don't send anything to moms that you are not willing to lose. But do send him with the essentials. Maybe not a full wardrobe for his time there, but a solid 4-5 days worth of clothes. Mom can do laundry while he is there. And ask her to return him with the clothes washed. \n\nNTA, but sucks for your son.", "Eh. Should she have clothes? Maybe?\n\nIs it practical, financially viable and a good use of the earth's resources to purchase an entire wardrobe for 3 weeks when sometimes a kid will outgrow those clothes before the next visit if they are young? \n\nDoes your son have favourite clothes he wants to take and wear? \n\nIt's probably in the best interests of your son to just send clothes for him.\n\nPs, this is a very common complaint!", "I am finding it hard to believe that ANY parent Who has primary custody would think clothes last a growing child a year or two, lmao! \n\nYou sound like you loathe your ex… \n\nYou have no issue sending you own child to his mom’s house, so I’m sure he has some stuff there and feels welcome and lived and safe there, but where he has none of his comfort *stuff,* with nothing? \n\nThat’s just shitty. \n\nYou’re not “winning” by behaving this way. \n\nIf something happens that upsets you, you have to use your big boy words and tell your ex!", "I can understand her not having complete wardrobe of four seasons worth of clothes for someone who’s only there a few weeks in the year…\n\n“ i’m willing to send clothes with him, but I’m also going to send a checklist of items that he came with and I’d like you to check those off as they come back cleaned. If this doesn’t work, then I won’t be sending close or games with him in the future.”\n\nAlso, tell your son that when he’s done with the game, he needs to have a special spot where he puts things because you’re not gonna replace things he leaves behind", "Punishing your child because you're mad at his mom. Yta", "esh\n\nyou shouldn't expect mom to stock clothes for a kid that basically vacations at her house\n\nmom is either neglectful or stealing small things to sell locally i.e. switch games. she should be washing his clothes if he's not old enough to pack his own bag.", "NTA you both should have enough clothes in your homes to be suit your son needs", "YTA and I am going to level with you here. Being this petty shows you probably shouldn't have custody. You might be the more stable parent between you and your ex but you still did a horrible thing to your child. Sending your kid to another state for multiple days without basic necessities is neglect and neglect is abuse. She should have called CPS on you for that. She now could easily have a court case on you.\nAnd the child support thing is you just being bitter. Your kid will remember your bitterness. Grow up.", "Info: how old is your son? I've been in this position before, and age matters here.", "So it's possible your kid is just losing/forgetting some stuff, and you decide his mom should have to buy him a new wardrobe? How does that make sense?", "NTA.  I don't even know how to wrap my head around the y - t - a responses, to be honest.  You didn't send him off into the wilderness unclothed, you sent him fully dressed **to his mother.**  If she spends $20 buying some socks and underwear this time and he's completely outgrown them next time, who cares?  She can spend another $20 next time.  Hell, she can spend $200 buying him a suitcase worth of clothes *every single visit,* and it would still be significantly less than she'd spend if you put her on child support ffs.", "NTA  but she should have things there for him or get his sizes so she can have clothes there... kids grow out their clothes quickly not a few years... my daughter has clothes she just got last year and cant fit them ... as far as games and anything expensive dont  send it....\nAnd as far as child support eventually it will catch up with her... maybe tell your son to keep his stuff in one  place and make sure he brings all his clothes back..", "NTA she should be preparing for his visits and be providing the essentials. She doesn’t pay support. It doesn’t take much to ask in advance what size he is and get a couple outfits and take him out again for more if need be.  If she can’t provide the bare essentials then I’d be reconsidering if she can handle the responsibility of visits at all.", "NTA. My friend used to send his son with the clothes on his back because the mom would keep all the clothes and return him with old, dirty clothes. She should have his own stuff at her house!!", "WHAT? Clothes for a kid should last at AT LEAST A YEAR. You do not live in a reality or your child has something wrong that keeps them from growing normally.\n\nHad kids of my own and have grandchildren now. They constantly need(ed) clothes. My son went on a growth spurt when he was around 8 and in 4 weeks outgrew his brand new shoes, then outgrew the pair I replaced them with. 3 sizes in 4 weeks. Pants 2 inches to short. I had just bought new school clothes. By the end of the 1st month of school, nothing fit. It was worse he reached high school. He went from 5'4 starting freshman year and ended it at 5'9. Girls went their own spurts, too. Height, shoes, and bras and pants that at the hips but are not too short are a NIGHTMARE.\n\nMy grandchildren are out growing clothes faster than Mom and Dad buy them, too. A constant rotation of clothes to the donation pile and a need to buy because they out grew list. \n\nYour ex has your son on a few holidays a summer vacation. The weeks and months in between, any clothes she buys most likely won't fit when he comes back. How in world is supposed to buy him clothes if you don't communicate with her about his growth, sizes, needs, and likes? \n\nYou are also assuming that she is packing his suit case, because YOU pack his suit case. It sounds to me like your son is putting his clothes in his suit case and not doing a very good job, because no one has shown him how. Or taught how to store his games so he doesn't loos or forget them when goes to his mom's. \n\nInstead of taking things out her, try working with your son on how to learn the small things. Then, TALK with your ex about what he needs, sizes and how his growth etc is going so she can be prepared when he comes. \n\nAs of right now YTA.", "Go to a second hand clothing shop and send those clothes with him. Then if they don't come back it doesn't matter", "Maybe get some secondhand clothes to send, instead of his nicer school clothes. Or clothes on the verge of outgrowing so that it doesn’t matter. Then just know you’re gonna have to get a new pack of undies and socks when he gets home. And toys he doesn’t mind losing. \n\nOr you can send a list of items and hold her accountable to send them back. That way there is no question. \n\nBut don’t send him without having the conversation about not sending anything. By doing that, it’s an ESH for me.", "How old is your son? \nWhy can’t you make a list of all of the items you’ve packed and then at the end of the trip they do a check of all of his belongings before packing the bag. \n\nThen you’re getting what you want, you’ve made life easier for your ex and you’ve taught your son the importance of independence. Which I have no doubt he understands to some extent as the child of divorced parents, but this is definitely a teachable moment.", "Hey! My ex husband is like this. His mom would buy clothes (bc that’s a woman’s job - to shop for clothes for your child), and my ex would leave our son in 1 diaper all day resulting in pee/poo explosions. He’d bring the soiled dried poop caked all over clothing to me and demand I clean, wash and dry them then return to him the next morning. I did it for awhile bc I didn’t want our son to suffer but I needed to stop. More evidence of neglect for me to save. \n\nGrandma is kind of an airhead and would buy clothes much too small for our son. Again not my job so I stopped saying stuff about it. Our son is 3 not 18 months old, he can’t wear that shrunken outfit. 🤷🏻‍♀️", "NTA and is there a reason why you're NOT getting child support, other than a choice you made? If it's by your own choice, you're doing your son a disservice. If you don't necessarily need it to provide for him now, you can put it in a savings account or education plan to help him in the future. Having clothes for her own child to wear aside, she should be fulfilling her financial obligations.", "NTA I would be beyond frustrated to send my kids in the clothes or with toys and not have them back. Having the clothes not washed and crumpled in the bag is no big deal honestly not everyone cares about that but not having things returned would be a hard stop. I would have mentioned this to her though in advance. “Last time I sent son with A & B and they didn’t get returned so you are going to have to provide clothes and toys yourself this time” so she’s not scrambling for outfits. She doesn’t pay child support so she can figure out a few outfits for her kid regardless of how fast they grow.", "NTA as a child whose mother didn’t pay child support, while my Dad was financially responsible for all us kids.. I think you expecting her to provide clothes, entertainment, etc. is the least she can do for her son. I hate it when one parent takes the bulks of the responsibility of raising the children, and the other still whines because they need to buy 1 or 2 outfits. Yet, you provide outfits all year!! You are NTA!!!", "I had a similar problem with my ex. Our daughter came home unwashed and he wouldn't feed her or take care of her clothes. My attorney told me to send a wardrobe and food for her. It was a good solution.  Ex was still an abusive ah but the visits went better. \nBtw he used to send shitty diapers back in her suitcase. \nIt was sickening. Is that a perversion?", "As someone else commented-send him this time with some extras meant to kept there— underwear socks -T-shirt’s -sweats…. Ur NTA—-she is big time😉", "Agreed. I'm in my 30s now, but as a child of divorced parents, being in the middle of fight over which belongings stayed at which houses and what things of mine they would agree to let me take here or there fucking sucked. My mom (primary parent) was actually always cool about it but my dad was super petty. Like dude, this situation is not my fault. I get that you bought the pants but they're MY fucking pants so can I just wear them back to my mom's house. Jeez.\n\nClearly I'm a little bitter still, TWENTY years later lol. Come on OP. I get the frustration with your ex but don't make your kid deal with this bullshit.", "Very much agree. Sending the kid to his mother’s without clothes doesn’t really punish her, it punishes him. He’s the one who has to go without.", "Agree! Also OP should teach his son how to roll the clothes up so they don’t wrinkle. My 10-year-old nephew recently visited us (without his parents) and before leaving, he washed all of his clothes in our machine (with a little help from me about the settings), then rolled them up neatly and packed his own suitcase. His mom had taught him to do that and he took pride in knowing how to take care of his possessions. He was also very careful to check the guest room and house the night before he went home to make sure he didn’t forget anything.", "Totally agree, minus expensive things like a switch.", "Definitely best comment. \n\nJust remember OP that your son is a person and is also caught in what your ex does that is annoying. In this instance you told your son you can solve your own issue with her by making him pay the price.", "This is really good advice. I am a stepmom and we have the same problem here. Officially we are not the primary household. Unofficially it is 50/50 during school weeks and we have our (step)son more during vacations. We buy all the clothes. They bought a coat two years ago. And shoes last year. Everything else he wears is bought by us and we pay for his activities. We could pick the fight but we choose not to because we want to keep everything friendly. Our (step)son will realise when he gets older that we will always be there for him and he is our priority (with his little siblings on our side). We pay for his stuff because he needs them and he should not be the victim of seperated parents. He did not choose that. So we buy him everything we would buy our other children, even when his mother is dropping the ball. Yes, sometimes it is frustrating that we send him off with great clothes and we always get him back in the oldest clothes that barely fit anymore. We just buy him new clothes whenever it is necessary. Sometimes you just have to bite your tongue even when things aren’t exactly right. Annoying but I cope by screaming internally and then moving on. Don’t take it out on the other parent because the child will be hurt as well.", "I would not send the Switch- that’s expensive and she should know how to entertain him. Socks, underwear and clothes are required. It only hurts your son to go without.", "Or just buy a fabric pen and mark up all his clothes (and other belongings).", "Great answer and advice.", "Sounds like the ex found the post", "This is the only important comment", "YTA.", "It's obvious someone else is buying clothes for this kid if the parent thinks the clothes last that long.", "agreed! I am surprised I don't see more ESH... bc  E S H !!!!! lol", "So the mom's correct for not having the basic essentials of her son?", "So it's ok that mum makes little to no effort to prepare and look after her own son whenever he visits? She must be capable of making a call or sending a text or email asking what size the boy is before he arrives. It's not rocket science.", "or she can be a mother and provide what her son needs when with her no excuses, for crying out loud she dont even pay childsupport lol", "He didn’t go to a hotel he went to his mothers who’s job is it to keep his clothes clean. I agree he should send clothes cause it only hurts the child by not sending clothes. Games and extra she should have those at her house for him. Seeing as she doesn’t pay child support she can afford to have toys for him. \n\nI think if he doesn’t want to send clothes he needs to send her his current size before hand and tell her to buy him clothes. Not just not warm her he won’t have anything.", "I agree, a parent should provide clothing for their children. He didn’t, so she should", "She does not pay child support and it's her time with him so she should have everything that he needs but she doesn't. I she doesnt know what size to get her kid then she should be communicating with dad to find out. HER time HER responsibility. \n\n It does not have to be in a court order to say that she needs to have stuff for her kid.", "Bc he hates her for no longer being with him. So instead of punishing her once by taking custody he chooses to punish his kid too for existing and needing things to survive.", "[removed]", "Or he forced her to actually go to the store and get necessities for her kid. Which she should do. Especially considering she will have him for three weeks next month.", "I should try a social experiment and post this a month from now and flip the genders huh? Hopefully the post doesn't get hot enough that it's recognizable.", "And this is why my husband and I have bought my stepdaughter upwards of 25 pair of size 10 underwear, even though we have her less than the half the time. Her mother refuses to go through her clothes to get rid of things that are too small and so she frequently comes to our house in clothes that are too small.", "You could also get some basic clothes, like multipack t-shirts, undies, and socks. Send them in the packs. Tell his mother, hey, now you have clothes. No more excuses.\n\nI'd still keep sending clothes, though, and making sure your son sees it but not rubbing it in his face.\n\nAnd stop sending anything but clothes. If she's losing/keeping stuff, just only send the basics. I went through this with my ex until my kiddo got old enough to manage for themself, then it became a non-issue. If they have no 'cool clothes' here, they deal with ex to get them back here.", "The best phrase I heard after my divorce, \"You have to love your kids more than you hate your ex.\"", "Does mom have a family?  Is she keeping things for half or step siblings? Why is it ok for mom to show disrespect of the child’s belongings?  She should have clothing. She should, as a parent, be prepared for each visit. She could ask if he’s in the same sizes. She pays you nothing. Besides feeding him, what does she do for him?  I feel he should have clothing at both parents. It shouldn’t just be your responsibility to provide them, then have them disappear on her watch.  Tell her either all his things return with him, or she will supply his needs at her place. This isn’t disrespectful to him. It’s setting boundaries and making her be an f’ing parent. Of course you’ll never see him go without, but set this up before the next visit so she can be prepared.", "I ditto this remark. My son has a similar situation with his child. The child DOES realize who had their back. Your son is the one who truly suffered instead of her.", "Maybe send clothes but no more expensive electronics. NTA", "Have you asked your son what happens with the missing items like the switch games? If he's old enough to travel alone it seems like he's old enough to pack his own bags, unless the stuff is getting stolen by someone at Mom's house", "As someone who grew up in a separated household, I saw many instances where my parents fought each other THROUGH ME and/or USING ME to get to each other. I know you don't think you're fighting THROUGH your child, but you definitely are.\n\nWhen you get frustrated at your ex for stuff she does, or doesn't do, for your child, think about how your actions are effecting HIM. \n\n* If you send him to his mom's house with clothes, you are setting him up for success, and when it's super cold out he'll remember \"I'm glad dad sent my favorite jacket with me!!!\". \n* If you send him to his mom's house with zero clothes, you are only hurting him. Sure, his mom has to deal with it on her end, but your son now has to deal with whatever she decides to do. Maybe she buys him nice clothes, maybe she doesn't, but the one thing I know is his favorite clothes won't be there (because they're still at your place). And your ex will constantly be bad mouthing you while she's buying clothes for your son, which only makes YOU look bad.\n\nAre you right that his mom should have a set of clothes at her house specifically for him?? Of course you're right about it!!! But have that conversation with her about it, and not punish him for his own mom.", "If she's not even paying child support, she should be able to purchase her own son some clothes.", "Part of what makes you sound bitter is this:\n\n>If wanted to get back at her I would go and get child support from her.\n\nChild support is for the child, and it's not about revenge. \n\nYou should get child support for your son. Use the money to buy clothes for his trips to his mom, and sock any extra away for his college fund. \n\nPut your son's best interest first.", "As a stepparent who goes through this. Don't send important items like a game system, buy some things to send with him and even make it easier by saying they're for his mom's house.\n\nThe only thing we let go to mom's is phone for contact and entertainment. Everything else is things we won't cry if it's gone. Even on a weekly basis.", "Except when you don't- like when you sent him to his mom's with just the clothes on his back and no games and made him feel like a burdon to you both. Remember, you're making major core memories by pulling stuff like that. Core memories that will cause resentment to everyone involved both now and for years to come. He'll be relaying your jerk moves in therapy when he's in his 40's and acting like a jerk to his kids & wife because that's the example you set. Change your actions now, OP, so you can change the future. Yes, this is the Ghost of Christmas Future talking. Take heed.", "I totally get the frustration. Clothes leaving and not coming back were always an issue with my brother and his ex from both sides. \n\nRecently the kids came to me in shorts and t shirts in winter. I was so pissed. We and bought them both clothes since their dad wasn't coming until late. I didn't cause a fuss with them, just let them know we're going to go get comfy trackies hang out in and let them pick out what they wanted. As silly as she was being, it was the kids who ultimately suffered from her actions. So if it's an ongoing issue, don't send him with anything expensive or you arent willing to lose and know you're doing it so your kid never feels the sting of being without essentials. Adult problems aren't for the kids to deal with. He'll know you always have his back and when he's older he'll understand what you did for him.", "How did he feel about not going with his own stuff? It's not what you're doing for her, it's what you're doing for him. (providing stability in a time of change)", "Maybe buy some cheap clothes to send with him next time. And no Switch.", "We had this situation with my stepson years ago. His mom had no respect for the items we purchased and sent. We tried discussing with her whether we should just both have separate wardrobes at our respective homes. That went nowhere. Ultimately, it stressed the kiddo out so we shut up and just bought replacements as we would have if he, or we, had lost the things. It wasn’t fair for him to bear that stress.", "You should send mom a inventory list (like a email with pictures as well) of what your son is arriving with and the expectation of what he will be coming back home with and what Is an acceptable depreciated condition (like video games/consoles should come back home as they went pretty much i.e in clean and in good order/working/usable condition) , but for things like clothing maybe receiving 75% of the items back or at least a reasonable explanation of what happened (like ruined shoes got tossed, lost socks/undies etc. ) and clothing should be repacked washed or replaced by them. \n\nTeach your child how to know if other adults are taking or not taking care of him properly etc. Clean clothing is also apart of daily hygiene routine. \n\nAlso if you have a court order for CS she should be paying, if not it could come back to bite her in the a** later on. \n\nYour kid as an adult could go to court and have them make her back pay.....get it now and put it in savings or a trust.", "Agree with the above comment. It affects your son the most. Have your tried the adult thing and communicated this issue and your feelings about it with your ex?", "My non custodial parent didn't have clothes for me at their house and I was forced to wear my step mother's cast offs which didn't fit (when I forgot to bring my clothes).  It was awful having to go places and meet people looking like that.  \n\nI was uncomfortable and self conscious and even though I knew my noncustodial parent should have provided me clothing, I was the one who felt the shame from not having it.  \n\nI hope you will reconsider, I understand your frustration but you're child is going somewhere where they are an outsider and don't have strong friendships and supports built over years of daily time together and this will only make your child feel badly.  You ex will simply claim it's your fault entirely (likely in front of your child and others). \n\nPlease, at the very least send weather appropriate clothing that fits and looks well tended (even if it's not the super expensive stuff he might have). \n\nI went an entire vacation to the beach wearing a wet t-shirt with bikini bottoms because if a noncustodial parent decides they have no obligation to clothes you outside of the child support they pay, your suffering is meaningless (I'd forgotten to pack a top).", "You sound like my ex, who has on several occasions contacted me to say that he can't handle my son anymore and wants to rethink our custody arrangement.. but then when he cools down, retracts that thought, and denies me any extra time with my son when I try to bring him back to court for more custody. \n\n\nStop taking shit out on your son.\n\n\nHow old is he?\nIf he's any older than 10, you're in the wrong for not putting more responsibility on the son for remembering his things. If he's bringing such valuable items, and so few of them he should be keeping track of his stuff instead of expecting everyone else around him to do that. \nObviously if these things actually go MISSING that's different... But if he's just forgetting his belongings, that he knows he won't see for months, that's on him for not being expected to hold any responsibility over himself and his belongings", "Switch games are very small.  The kid probably lost them himself and OP is blaming the wrong person.", "She should have plenty of money for clothes since she’s a non-custodial parent that doesn’t even pay child support.", "Honestly at this point if he truly believes she is incompetent then the visitation should be moved to his state where she travels to them and gets a hotel. Instead he punished her and his kid and came to reddit to whine about it.", "When I sent my kiddo for summer, he packed/chose a weeks worth of clothes. Worst case, and sometimes it was, he had enough to last until laundry.\nIn summer, I slipped him cash to get a couple things. He loves thrift stores, and has voluntarily continued shopping. He started at nine, he’s 31 now.\n\nOnline shopping became useful, too.", "sorry, but I wouldn't expect someone who only sees their son 12 weeks out of the year to have everything that he needs. Kids grow like weeds. \n\nI get your point but look at the other side of things.", "Put some responsibility on your kid maybe? It's his things he's forgetting. \n\nIf the kid is old enough to have a switch in his possession. \n\nHe's old enough to be taught to take care of him a belongings.", "Info: Can you explain why your post says \"she didn't have socks or shoes\" and then \"how can you have zero clothes for your son\" in the next sentence? \n\nThe math ain't matthing here", "But why does your son have to suffer?? I get that you don't like his mom, but you should love your son more than you hate his mother. Take the high road and take care of your kid. Not sure why you had to toss him right in the middle. Did you explain to him why you didn't pack his bag the way you usually do? Did you tell him he won't have clothes because you're teaching his mom a lesson? I don't get it, what the fuck are you trying to do here? If my son was dropped off without proper clothes for the week I would have went straight to my lawyer to jot down this little incident, you know, in case I ever need to use anything against you...", "She should 10000% have clothing for him, but don’t punish your child for her inability to care for her child properly. Send him with enough clothes for at least a few days, or the full trip. And as a mom of two, one who is a teen… they can grow quite quickly. I bought my 13 year old clothes in the last few months that no longer fit. Bro has grown 2 inches in a couple months. His feet are bigger than mine now! It’s bittersweet. But like others have said, make sure he knows you are on his side, always, and the one taking care of him.", "So you approached her aggressively and by accusing her. Not by simply asking what happened? Nope.", "I am going to be completely honest, when I read that she was the one that wanted to move out of state and only sees her son 12 weeks out of the year, my heart hurt. I am a mother of 2 kids, yes they drive me insane, and I am tired and some days are hard ,but I look forward to picking them up. \"MOMMYY!!\" and then running to me with open arms. I can't imagine only experiencing my kids for 12 weeks out of the year.....", "I’m baffled by this sub today. Mom is just as capable of going to the thrift store and grabbing some clothes as dad is of packing them.", "I read all of your garbage. You deserve all the YTA verdicts you're getting. You just proved it. Pout more.", "I was on the fence but this just proves it, you’re blabbing on about how much you love and care for the kid yet you’re sending him without clothes. Why is it automatically the mom’s fault that things aren’t coming back exactly how you left it? Do you know how tiny those switch games are? They’re very easily lost, especially going back and forth travelling yet you jump straight to its HER fault. You seem to be looking for any sort of reason to hate your ex and be petty about it", "Up next you will be pouting when your ex tries to get custody or moves closer to try for 50/50 at least. \nBased on your comments and not knowing her side I could bet money you are that guy who would punish an ex by taking custody bc you had more money to do it and the only way for her to get away from you and not end up homeless was to just stop fighting in court.", "This response solidifies the YTA decision for me.", "Her failure to manage her life is not your/ our kiddos fault. NTA.. but she should be supporting him and kiddo should be in therapy with all the traveling back and fourth.", "Dude I have more stuff prepared in my appartement for the random neighborhood cat that visits me one hour a day than she has for her litteral son who stays at her home almost 3 months a year total. It's 4 visits a year, but 25% of the year, the kiddo should have his room, with toys and clothes. Maybe not as much as in his dad's home, but there's a minimum.", "100%. But he should have sent one or two--enough to get him through changing when he gets into his pjs or a clean set to go to the store with her the next day is the way to go.  Kid shouldn't be in dirty clothes because of the parents' issues.", "You and your husband are awesome. Your stepdaughter is lucky to have you!", "We do that when the dog goes to visit his grandparents!  Takes the pressure of everyone trying to remember what was sent and what needs to come back.", "And add that there will be a request for replacements or funds for the things that don’t make it back.", "This is a good idea. It's kind of sad, though, that packing to go see your mom for a while is similar to packing for camp. A 10-year-old shouldn't be \"visiting\" his mother.", "Mom could be keeping things to sell or give to her friends. Don't blame a child.", "It's not a question of whether she has money, but rather whether she's going to actually get the kid clothes, and in a timely manner.", "So... every adult without kids has plenty of money? How does that possibly make sense in your brain?", "Truthfully that seems pretty wasteful to me to buy a ton of clothes for the kid to wear a handful of times before going going back to dad and he’ll have outgrown them/they won’t be seasonally appropriate by the next visit.  I’m assuming the summer visit is longer and that makes more sense for her to have clothes.    But for a couple weeks?  She should be paying child support and that should cover her portion of clothes for short visits.", "She is, but he didn’t even have socks and underwear for the next day if Dad didn’t pack any.", "She would have to buy him clothes if she had custody, so yes, she is to buy some clothes that fit him. She’s not paying child support so she should have the money for it.", "Yes, she is the one who makes him travel, she is responsible to see that her child has appropriate clothing for *her* environment.", "So it's ok his kid had to suffer. He didn't warn her that he would no longer send stuff for the kid. \nHe could have taken her to court for CS and chose to do this to his kid? \nMom should have just called CPS and said Dad left kid here with no clothes, boom now she has custody. Or if she doesn't get custody his literal neglect of his kid is on record. Bad move.", "There is zero reason for the OP to provide a snow suit when the only reason the kid needs one is that he is visiting his mom.", "Or course he blames her. He hates her. That much is clear.", "He actually really loves going back and forth!", "I do that for me, when I take myself away anywhere overnight. \n\nTakes the pressure off me, trying not to leave random things in hotel rooms or friend’s houses!", "Does the pupper have a suitcase full of stuff : o", "Or are sent back in an unclean state!", "Yeah she could be, or the kid could be forgetting them or losing them. That's not exactly uncommon for children, especially younger ones. \n\nThat's not to say that mom shouldn't be doing a better job of helping him take care of things but I don't think its outrageous to say that its possible the kid lost them", "Why not?  My kids knew very well that they were supposed to keep track of their things when packing up to go between my house and their mothers.", "If the clothes are coming back in a crumple mess though, the mom shouldn’t necessarily be blamed. Like if the kid if 10, she probably expects him to manage putting his clothes back in his suitcase by himself.", "Also if OP didn't warn her she wouldn't have known to budget for new clothes and it probably would have to come out of the budget for fun/activities. Just because she doesn't pay child support (which she should be, tbh) doesn't mean she's constantly swimming in disposable income. We have no idea how much she earns/what she pays for rent. \n\nFrankly, OP should be going after her for child support. I would personally consider that less \"getting back at her\" than the petty stunt he pulled, regardless of the way he views it. That money is for his son, not him, and she should be paying it.", "That's correct; it's not wrong to change the expectations but it has to be done *after* you communicate an issue and give her a chance to adjust her behavior. *Then* you communicate what you're changing and give her enough time for any action she needs to take. In this case, making sure she knows all your son's current sizes and letting her know that he is/is not in the middle of a growth spurt would help a lot. This step is also when you can get feedback and see if she has reasonable objections or a different idea that might work.\n\nAlso it's very important to *be consistent* in the way you handle the issue.\n\nJust keep in mind that you're there to do well for your son, and try not to let frustration dictate your words and actions.", "I mean, growing up from 1-15 years old, I saw my father every other weekend and my mother (and when I got old enough, me personally) packed a bag with clothes. And I was only traveling 1.5 hours away, meaning if I truly needed something, my mom could have gotten it to me with relatively little inconvenience. If I had to get on a plane and fly somewhere by myself, that would mean I needed to be even more prepared just incase something happened, I would have anything I needed.", "Also you can make an itemized list of things you send to her (especially expensive games etc) and when he returns with out them you can reference what you sent and ask that she ship them back to you- or send replacements to your house.", "Has your son expressed distress about how his mother treats his belongings?", "I don't know. A couple of pairs of pajamas and 3-4 outfits that are worn over and over again and washed every few days hardly seems wateful.", "So they run to the store. Those are everywhere.", "Okay, but she didn’t and dad wanted to stick it to her and now the kid has no clothes. So sure, he can be morally right but to it’s the kid that suffers.", "2 weeks for Spring Break?\n\nWhat school gives 2 weeks off for Spring Break?  That is a week at most.  Congrats you outed the story as fake.\n\nChristmas is similarly 2 weeks and not 3.", "That's not something to lose custody over, in my opinion. He raised the issue with her, and she ignored it. Yes, I think he could have been more explicit with her, but I think she's the asshole for just continuing on doing what she was doing without trying to improve the situation. I doubt the kid suffered. The mom had to go out and buy him some clothes real quick.", "That i agree with but the father should make sure he has the basic clothing with him.", "That's really brilliant when traveling", "Not a suitcase but a shopping bag! Food in ziplocks. Soft food in its plastic containers. Blankie. Joint health chews. Leash. Collar. Holiday or themed bandanna.", "Not worth it, IMO.  Laundry facilities exist.  Failure to SEND his things, now, that's something to get annoyed at.", "Because there’s a lot we don’t know. If the child is younger or is neurodivergence(ADHD or Autistic for example), they would not be expected to keep track of everything, especially without a list.", "But the missing switch games?", "They're unwashed. Why would you fold unwashed clothes", "Is the deadbeat mother unable to buy her son a couple t-shirts?", "You must really grow a lot during the week if your clothes don't fit you from one weekend to the next.", "This - my mom did the same thing when I was growing up. I remember packing my bags back up with my dad and us going through the list to make sure everything was on there. Also, take pictures of everything laid out so she know what everything looks like.", "Shoes and winter coats definitely would be though", "My kid is off for 3 weeks for Christmas.", "Maybe, maybe not. It really depends on if Mom takes him to court for it. \nBut if she fit enough to have unsupervised visits out of state then she could easily be fit for custody.\nHis choices are: \n1 get CS to replace lost items.\n2 or only send things that are inexpensive and can be replaced. \n\nIf he wanted custody so bad part of what comes with that is dealing with unhelpful exes. \nIs she shitty for not returning everything? Yes. \nBut he has really high expectations that the clothes will be perfect upon his return, the kid is 7 they are messy no one comes home from vacation with clean clothes. \nBeing the primary custody parent means you are the one doing most of not all of the care tasks for your kids. \nIf he doesn't want the extra laundry afterwards then he can tell her \"next visit I can only send 1 week of clothes, are you able to do laundry during this time?\" \nIf she ignores it he can document it and try to get visits where she comes to their state of residence for the visits so he can give more oversight to his kid's belongings. \nHe had multiple solutions and chose this one.", "He's visiting for a week -- 2 changes plus what he wears on the trip should be sufficient.   If not, mom can buy what she thinks is needed.", "Switch games are tiny & easy to misplace.", "It happens. They fall down couch cushions, drop under the bed, etc. There could also be other kids using them that forget to give them back.", "Buy digital games. They load faster anyway\n\nI mean damn, I’m 30 and I’ve fucking lost switch games before. They’re small as hell", "I’ve folded unwashed clothes so they’ll all fit back into my suitcase for the flight home.", "I absolutely think she is an AH. But OP is also being an AH for taking his irritation out on his son. He may not have meant to, but this directly affects his son.", "OP says he visits his mom 4 times a year.", "I mean, you can get those from Goodwill and then re donate them afterwards. Not everything needs to be new.", "Or maybe the mom can buy some fucking clothes for her kid. She doesn't even pay child support.", "Yes and OP also says that he's with his mom, 1 week for Thanksgiving, 3 weeks for Christmas, 2 for spring break and 6 weeks for summer holidays. You telling me she shouldn't have any clothes at her house for her kid? Clothes that fit?", "Or just send them back with him afterward. When I was with my ex-husband we had a similar arrangement with his kids and we always got them a few new outfits we knew they’d like to wear while they were with us and let them take them home to add to what they had at bio mom’s so they could continue to wear them. I’m voting ESH because OP should be focused on his son and making sure he has what he needs, not the ex, but the ex should also have clothes for her own kid.", "Dude, if she has court ordered visitation but wasn’t required to pay court ordered child support, there’s a reason. I’m not saying she’s a\ngreat parent, but OP deciding to retaliate by not be a great parent just means they both suck. 🤷‍♀️", "Child support and visits are separate court orders. He just wants to be petty and complain.", "Of course she should. But kids grow a lot in 4 months and she doesn’t. \n\nAnd OP knows she doesn’t. \n\nSo the kid is going without because OP wants to stick it to the ex.", "Why do you continue to buy expensive games if they get lost? Buy digital copies and invest in a high storage SD card and you’re all set.", "OP said he could go after her for child support if he wanted to.", "Girl doesn't even have to pay child support, she should be able to provide for her child. The kid is still in 5T clothing. There's also tons of second hand shops that sell children's clothing as well as FB where some people are willing to give things for free. It's not like the kid needs a ton of clothing but to not even have one or two pairs of pants or a couple of shirts, is crazy. If she's not even trying to provide the basic necessities, like clothing for her kid than maybe the custody agreement needs changing. She knows when she has her visitation, there's no reason she can't prepare ahead of time and have something."]}