{"id": 31160, "submission_id": "17xfmxi", "title": "AITA For Starting Dinner When Friend Was Late To The Reservation?", "selftext": "Background: A close friend of mine is habitually late. Sometimes just 5-10 minutes (no big deal); often 15-20 (annoying); and the last time we hung out over an hour late (so my patience has run out). It’s not work related or cultural or anything, just bad time management, I guess. \n\nThe Incident: he wanted to try a new, popular restaurant that required a reservation. I let him pick the day/time (Thurs 8pm). I warned him it’s new and packed and to be there on time, or early even and enjoy the lounge area as I’ve heard it pretty cool. \n\nYou can see where I’m going with this. I got there early to allow for parking and such; was seated promptly at 8. Had my drink in hand shortly thereafter. At 8:15 when the server asked if I wanted to order an appetizer while I waited, I just ordered my meal. I hadn’t heard from my friend who could’ve been 15 minutes or 60 minutes late, and I honestly didn’t want to waste the money or calories on an app I didn’t want. \n\nFriend arrived around 8:30 surprised and upset I had started eating without him. In retrospect I do feel kind of bad, and I would’ve waited for someone not habitually late. Maybe I was a bit petty…", "created_utc": 1700229498, "permalink": "/r/AmItheAsshole/comments/17xfmxi/aita_for_starting_dinner_when_friend_was_late_to/", "score": 256, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I ordered my meal and started eating before my dinner companion got there 2. It was probably rude of me. I *could’ve* just waited before ordering. He felt awkward eating staggered like that.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA He's the one who is rude. Habitually late = habitually rude. It would be one thing if he were usually on time. In that case, I'm guessing you would have waited, supposing that there must be a good reason. In his case, you know it's just another example of his middle finger being given to you on repeat every minute he's late. He just cares about his own time. Not yours.", "NTA.  You are being an AH to yourself by feeling bad about the food.  This gives your friend an excuse not to ever take your time seriously.  The only way your friend will learn is if this happens every time from now on and that he misses out on an experience he wants.  Your friend is being very selfish.  It's not up to you to always bow down to your friend's selfishness with being always late.  Your time is a perishable commodity and can't get back when used.", "NTA. \"You want to know what's actually annoying? I've been sitting here by myself waiting for you for 30 min already.\"", "He was 30 minutes late. Didn’t call or text with a reason. Even if it was dumb it would’ve been much more respectful and responsible to do that. You are a good friend for even putting up with this behavior. He needs a reality check. Wasting someone’s time equals huge disrespect. Tell him you won’t be able to remain friends if he continues doing this. At the very least he could at least warn you that he will be late.", "NTA. Actions have consequences. It's not only rude to you to be late, but rude to the restaurant. They only have the table booked for so long. I'd reconsider dining with your friend in a place that requires reservations because he's already demonstrated that this doesn't work for him.", "NTA.  For me, the one thing you can really never get back is time.  You can make more money, you can replace things, but with time once it’s gone, it’s gone.  And communication can go a long way.  Let me know and I will adjust to accommodate, but to just show up 30 minutes late, just no.", "NTA  \n\n\nFriend picked the time and scheduled for 8. You were there at 8. \n\nWhy should he be surprised that you started eating when he shows up half an hour late? \n\nIf you had been that late also, neither of you would have gotten the reservation, they'd have cancelled that shit on you.\n\nThe late friend is the rude one and the asshole, and they need to stop wasting your time.", "NTA. Most restaurants won't hold a table for that long. Most restaurants don't sit people until everyone is present. Your friend is a JERK.", "NTA. This is the right way to deal with people, who repeatedly waste your time by being late. It is annoying, though, to have to sit and eat alone when you were expecting to enjoy your meal together.", "NTA\n\nAnd honestly, you were lucky you were sat and didn't lose your reservation.", "NTA\nWhen the reservation is for 8 and you show up 30 minutes late without the courtesy of a phone call I can’t understand what you have to be upset about. If you continue to dine with him in the future, this is the way to go. \n\nYou shouldn’t have to give a whole ass adult a fake time (invite him for 7 when the reservation is for 8).", "Them being late that much for nothing other than poor time management means they don't value your time. This isn't so bad with being a little late to a party or something, but a 1 on 1 dinner with a reservation, did they expect you to sit on your hands for 30 minutes? NTA", "Nta *he* chose the time.  I don't wait for those who are perpetually late.  You know what time the event starts, you aren't the center of the world.\n\nOfc when someone texts me and says, 'running late' I will wait.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBackground: A close friend of mine is habitually late. Sometimes just 5-10 minutes (no big deal); often 15-20 (annoying); and the last time we hung out over an hour late (so my patience has run out). It’s not work related or cultural or anything, just bad time management, I guess. \n\nThe Incident: he wanted to try a new, popular restaurant that required a reservation. I let him pick the day/time (Thurs 8pm). I warned him it’s new and packed and to be there on time, or early even and enjoy the lounge area as I’ve heard it pretty cool. \n\nYou can see where I’m going with this. I got there early to allow for parking and such; was seated promptly at 8. Had my drink in hand shortly thereafter. At 8:15 when the server asked if I wanted to order an appetizer while I waited, I just ordered my meal. I hadn’t heard from my friend who could’ve been 15 minutes or 60 minutes late, and I honestly didn’t want to waste the money or calories on an app I didn’t want. \n\nFriend arrived around 8:30 surprised and upset I had started eating without him. In retrospect I do feel kind of bad, and I would’ve waited for someone not habitually late. Maybe I was a bit petty…\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, did you eating prevent him from eating when he finally arrived? Did you finish eating soon after his arrival and immediately bail cutting the dinner plan short? Nothing about you starting your meal changed the intended outcome of the evening - you two spending an evening together. I don't really understand why people get uppity about starting their meals if it's amongst close friends/family. It might be nicer overall to eat together but at the end of the day what difference does it make apart from you not being hungry and cranky when he arrives?", "NTA maybe next time he won’t be late!", "In the future if you value his friendship, set up the reservation an hour ahead. This way the dude will probably be right on time. That is probably, lol", "30 minutes late? NTA", "NTA, but since he would have made the reservation for 2, I'm shocked this restaurant chose to seat you before your entire party had arrived.", "While I would usually say a phone works 2 ways, you could have called(imagine if something had actually happened) NTA - he is the one who wanted to do this.", "[deleted]", "You friend has the audacity to arrive late and ask why you're eating. Eff that friend in the face.", "Why would you feel bad? Your friend is a self absorbed person who has no regard for anyone but himself. Habitually late people just don’t care enough about others to change their ways. They justify it by saying it’s no big deal and they’re here now so what’s the problem? Having to adjust plans to accommodate these people is a pain so stop waiting around for this jerk and do what you want to do when you want to on your time, not his.", "Book a dinner cruise that leaves the dock on time. NTA", "NTA, but I think I'd just stop eating out with that person.", "NTA\n\nI am very interested in the fact that I dont see anyone saying YTA... I mean you are not, but the number of people around me that are late for everything suggests that I am wrong. \n\n&#x200B;\n\nWhen leaving for an event. We would all meet at one location to make sure we had all equipment, sometimes people would carpool so would drop off their kids so they could ride with others. It is amazing how many parents say we are wrong for leaving before they dropped off their child. Like listen lady, we left 15 minutes late, an HOUR ago.", "I have a friend who is always late,  at least 20 to 30 minutes. Drives me nuts.I was always telling her that I was going to order my meal if she was late again. I finally did it, and she was really surprised when she finally showed up. She's never been more than 5 minutes late since.", "That’s kind of how I felt when I said, “f*k it, I’m just starting my dinner without him. Dinner started at 8 dude. You want to eat dinner with me, get there at 8.” \n\nBut afterwards I felt a bit petty..", "I was concerned about the restaurant getting annoyed, too! It’s a new spot and reservation are booked solid. I didn’t want someone else to be held up because we started our meals late! \n\nDefinitely no more reservations-required spots! Lol. I hoped maybe having that time requirement would make him on time…nope.", "I’m learning that thanks to this post! I don’t usually eat at reservation-only places! And this place probably won’t be reservation-only in a few more months, it’s just new so everyone is flocking to it! Lol. I didn’t realize that many won’t seat just 1 of 2 people! \n\nMan, I’d be so pissed (at my friend) if I had gotten dressed up, drove 30 minutes across town, waited 30+ minutes, and then couldn’t eat because he can’t get his ass somewhere on time!", "I get where you’re coming from, but I don’t want to play those games, know what I mean? We’re adults. He picked the reservation day and time, I shouldn’t have to trick him into being on time.", "Could you please explain why the friend was annoyed? I honestly don’t understand. Was OP supposed to wait indefinitely to order? Why does the friend get to be late, not call and be annoyed?", "Why should OP have to adjust their time to match someone who is too rude to show up on time and doesn't even bother calling or texting to let them know? 'Friend' has zero reason to complain or be annoyed. NTA", "I think that's the only way some of these people wake up to themselves. Luckily your friend realized she was the problem.", "I had a friend who was always 20 to 30 minutes late for everything and for years I just dealt with it. Then she got a boss who started writing her up every time she was late and she got put on probation. Now she's rarely more than 5 minutes late.", "You're right. You shouldn't have to play those games. Just tell him the truth. That him being habitually late is him being rude every time he does it. You are not going to put up with it anymore and while you would wait for someone else you won't wait for him. He's used up all benefit of the doubt. Now him being late just means he didn't take care to be on time. Okay. You no longer care to wait.", "NTA I had a friend that was always late. One time I get to the restaurant. After 15 minutes I call the house and her husband answers. Yeah she's about to hop in the shower and get ready then head that way. \nExcuse me? She's already late and she's just now even getting in the shower?? I was done. I told him tell her I'm going to get a to go plate and head home. Maybe we can try later.  Her husband, \"Well it won't take long if you can just wait.\" I told him look not trying to be an ass but she's already 15 late, and then add on the time to shower, dress, etc and y'all live 20 mins from here. I'm not sitting here over an hour late waiting. Well try again later.\n\nShe was never late again after that", "NTA you're lucky they even took you to a table. Where I live, especially if it's busy, they won't seat you until the whole party is there. You know in case you sit at a table for an hour not ordering anything while they lose money.", "NTA. My wife is a perpetually late individual. My wife also knows that if she's a minute late for when we are supposed to leave, I'll just go without her. Amazingly I've only ever had to do it once while we were still dating. A lot of times people who are chronically late continue to be that way because they know people will wait for them.", "in my 20's i developed the unfortunate habit of being late all the time for everything. this was before cell phones so i couldn't even alert my friends of my expected late arrival time. eventually people got fed up with it (and who could blame them?) and would just go into the movie theatre, club, order at the restaurant etc. without waiting for me. it never occurred to me to be angry at them for doing it, and in fact it forced me to start being more cognizant of my time management. you did the right thing, OP. definitely NTA.", "NTA\n\nWhat your friend probably doesn’t consider is he’s also putting YOU in the position to deal with restaurant staff if they refuse to wait for your friend as well", "Honestly I’ve had a friend like this but for mental issues like ocd and stuff but whenever we do anything with a time I lie alllllll the time and tell them an hr or so early then scheduled, sometimes it works and sometimes it doesn’t lol", "NTA Most fine dining restaurants in my locality don’t hold reservations for more than fifteen minutes.\n\nAlso, they usually won’t seat any member of a party until all are present.", "I’ve started doing this.   It is disrespectful to the person/s you are meeting to arrive late.   My DIL has a huge problem with this.  A bad habit she learned from her mother.   They both learned early on, that if we say we are leaving at blah time, we leave.   If we are meeting at this time, you need to be there.   No “oh well” or “but”.   \n\nI told my DIL it was extremely disrespectful to me and my time to be 45 minutes late and that was unacceptable.  She tried to cry her way out of it and I wasn’t having it.  I again told her that her time is no more important than my time is and that whoever told her she was special and could use  “her name tie” was wrong.  She then apparently complained to my son who said, well, I told you, don’t be late.  Mom waited 15 minutes and that is a lot longer than she normally does.  Funny how when you realize people will leave without you or eat without you, you can manage to be on time.   Shockingly, since then her mother (and her) have come to understand that if we are leaving at 10 am. We leave and will leave your ass to figure out your own arrangements.", "It's not petty to eat on time, go into the movie without them, etc. \n\nNTA", "NTA - He was upset?! 30 min late and he has the nerve to be UPSET? I would have opened the gates of hell on him . This kind of behavior is so rude and inconsiderate it makes my blood boil.  Being always late to things is just a sign of a self involved person that doesn't care about anyone else.", "NTA. He can't have it both ways. And it sounds like it was just the two of you? Extra rude of him.", "NTA. You don't need to feel bad for not continuing to accommodate your friend's lack of respecting your time.  Good for you!  It's not petty you just showed them a consequence that should have happened long ago.", "NTA. Maybe your ride friend will learn to be on-time going forward! They could have at least called you to let you know they’d be late.", "Maybe your friend needs to be upset about himself. Not an NTAH for ordering. I used to be late all the time, too, until I read something about how being late tells other people how much you don’t value their time. I didn’t want to be that person anymore, so I’ve actively made strives to change. He’s pretty damn entitled. NTA", "It’s rude to you, but also consider how it can be rude to the staff. I worked at a restaurant in college and if the place is new and full of reservations, they are relying on a loosely regular meal time. Someone arriving a whole hour late and then taking time to look over the menu and order is super rude to the staff and can throw off their night. Also, the server isn’t able to seat more guest, turn over more dinners and get more tips.", "NTA.\n\nYou said it yourself - you would've waited for someone who isn't habitually late. At a certain point, it's completely fine to treat people how they choose to act instead of continuing to give them the benefit of the doubt.\n\nHopefully he sees this as a wakeup call to start being more respectful of not wasting others time by always making them wait.", "They were late and they didn't even call to warn you?? They just showed up late? No text even? \n\nNTA, they are TA. Hell, I call in late if I suspect I'm going to be late just in case. Usually show up on time or less than 5 mins. late. But you call, if for no other reason than to be repectful of another persons time.", "Where I live now, the popular restaurants won't even sit you until your whole party arrives, and if you are more than 15 minutes late cancel the reservation", "NTA, not petty and not in any way rude. But I know who is...", "NTA. He's a half hour late. That means at the very least his car broke down or there was an accident right in front of him on the way to justify this behavior. In either case, why should you sit there and starve because he cant be bothered to be on time? Tardiness is a HUGE sign of disrespect, especially if its chronic.", ">Could have been 15 minutes or 60 minutes late\n\nDid you try calling them? \n\nWhat was their excuse for being half an hour late?\n\nHave you had “the talk” with them how you feel extremely disrespected for them doing this regularly and if they won’t stop, you’re gonna stop making plans with them?\n\nI have a family member that is like this, and they are well aware that we don’t wait for them for anything anymore. Sometimes they get frustrated, but we don’t care.", "Real friend wouldn’t habitually keep you waiting.  You’re convenient.", "NTA.  You're late, you miss out.  This isn't fucking complicated.", "NTA It looks like he pretended to be upset to prevent being told off in the first place.", "NTA. \nListen, I’m a late person too (you don’t need to hate me, i promise i hate myself). \nHe could have at least texted you. “Hey my gps says I’ll be there in 30 minutes” is a really easy thing to type.  Then you would have known if you wanted to order your meal or wait. But he was too rude to even keep you posted.", "Life doesn't stop just because you can't show up on time. NTA.", "NTA.", "NTA he knew the time and was half an hour late without at least letting you know he was running late? That's just disrespectful", "NTA - I have a rule, I will wait up to 10 minutes with no communication and up to 30 minutes (depends on situation/excuse/frequency) with some communication. Then I would leave (or start dinner as you did).  Assuming your friend is not a first responder who had to pull over to deliver a baby or was involved in a car accident which led them to be unresponsive until seconds before he walked into the restaurant (yes, I'm being facetious), there is simply no excuse to show up 30 minutes late without any text/phone call.", "nope five ,ten minutes ok but thirty is downright rude.", "nta.  i’m a habitually late person myself (partially a cultural thing but i can still recognize that it’s a terrible habit) and i always encourage people to start things without me if i’m late.  being late should be nobody else’s problem and your friend shouldn’t expect you to constantly accommodate to him.", "NTA Do this every time. Your friend doesn't care to make the effort and sees your waiting on his arrival as what he is due for existing in your life. Your time has no value to him. He probably assumes it has no value to you unless he is there.", "Now he knows you won't waste your time on him. NTA.", "Request for info: Did you text your friend and ask where he was / what his ETA was?", "NTA.\n\nThe only way the chronically late will learn to be on time is when people stop waiting for them. 10 minutes after the time you agreed on is sufficient. Go ahead and order. If you finish before they arrive, pay your check and leave. If they say they'll be at your house to pick you up and they're 15 minutes late, go on your own or cancel. If you're picking them up and they make you wait, leave. Stop letting them hold you hostage to their tardiness.", "NTA but if I make plans with someone like that, I'd set the plans \"early\". 8pm reservation? Tell them 7-7:30. Otherwise, I wouldn't even plan anything with them.", "NTA. Sometimes things come up that cause lateness (or even born without a clock something I’m guilty of) but the proper/courteous thing is to contact once you know you’ll be late. It sounds like this friend needs to start giving themselves a fake time so they’ll be on time(which is a thing multiple relatives of my family has to do).", "\"In retrospect I do feel kind of bad,...\"\n\nWasted feelings.", "NTA.  He's got a track record of being late, you had no way to know whether he'd even show up, and if it bothers him that you went ahead and ordered, he can bloody well show up on time in the future.", "Some people are just completely unable to be on time for stuff (myself included, crazy severe OCD that can't fully be treated with medication), but those people are generally self aware. I can't imagine getting pissed that my friends started dinner when I arrive 30 minutes late. That's his problem, not yours.", "Lol. A friend of mine did a dinner cruise birthday dinner…so many people didn’t make it!!! Getting to the marina at 7 doesn’t count. You have to be parked and on the boat by 7!!!", "Yes, many places won't seat if the entire party isn't there.", "I hear ya! I thought I’d get at least a couple, “you’re an impatient asshole! What if he had an emergency/had to work/was stuck in traffic?!” Probably because it was a full 30 minutes. Like if I had ordered at 8 and he got there at 8:15 I’d get some ytas \n\nI remember meeting up with 3 of my friends in Manhattan. 2 are Latina and culturally always late; the other just has a bunch of kids and runs late. So there was no way I was going to go there early…there was a delay on the train, and I was 45 minutes late…and STILL the first one there. Lol.", "This is the way.", "That’s awesome you’ve changed your ways and to show people you value them! Good for you! :)", "I didn’t call/text him because I was ticked off. This is why I wonder if I was petty. The last time we hung out (2 weeks ago) he kept me waiting for over an hour…outside, in the cold (he had the event tickets and I had ubered there). So, I thought maybe he’d make more of an effort. So when he didn’t, I just said, “f*ck it. My patience is gone.” \n\nPlus it probably wouldn’t have mattered. It always goes a little something like this: 10 minutes after the agreed upon time “sorry, I’m running late. I’ll be there in 10 minutes.” 15 minutes go by. “Hey sorry. Pulling up now.” Another 10 minutes goes by. “I was here, but parking is crazy!” \n\nNo particular excuse or anything. Sometimes I think he just has a bad sense of direction. Or he doesn’t account for things like finding parking and walking to the restaurant. He’ll sometimes post memes on FB about being an introvert and happy when people cancel plans. So maybe he just has a tough time leaving the house or something.", "He’s been one of my closest friends for almost 20 years. He just sucks with time management. I’ve seen him be this way with other loved ones. He’s a solid guy who’s there when friends need him (just not on time) :P", "I did not. And that’s probably what made me a bit of an asshole. The last time we hung out was 2 weeks ago…and he was over an hour late…and I had to wait outside, in the cold because he had our event tickets and I ubered there. So I was ticked and out of patience. I had thought maybe he’d make the effort to actually be on time for a change! \n\nAnd honestly I don’t know if I would believe him anyway. He usually underplays his ETA. Like “sorry! I’ll be there in 10 minutes!” Then 15 will go by…”ugh, traffic sucks!” Etc.", "I always just told friends like this \"reservations are at 7:30.\" If they showed up on time, \"I thought it was 7:30, must've wrote it down wrong\"", "I had a coworker who is so consistently late. When he asked someone out on a date he prefaced by saying he would be late. Like at that point it’s a choice and not an accident.", "Yeah, I have a hard time being on time in certain contexts (OCD and ADHD here) but I wouldn’t expect that to free me of any consequences. I would feel worse if people waited for me tbh.", "You weren't being petty. This is actually the best way to deal with habitually late people - proceed with your activity without them. It takes away their control over the situation and once they start missing out on things they change their ways.", "NTA and you're not being petty. Your friend is rude as.\n\nMy take on it is this: as a relatively healthy, gainfully employed human in a 1st world country, I live a life filled with infinite resources. I'm very fortunate.\n\nFor example, I have an endless capacity to give and receive love. I can make new friends. I can make more money. \n\nThe only resource that is finite is my time. \n\nThe clock ticks for all of us. When it runs out, it's over. There's no begging or buying more.\n\nSo I guard it zealously, and try to use it wisely. I respect other peoples time, and I don't give my time to people who squander it. \n\nThat doesn't mean I work 24/7 or hustle myself to death lol. I relax, waste time, have fun. But I choose how I spend my time. I certainly don't waste it waiting around for someone who doesn't think my time matters. Because in my eyes, that means on some level, they don't think I matter. \n\nAnd before anyone comes at me, I know ND people exist and some of them struggle with this. Those people in my life, I give then grace and we work on strategies together. That's different. But some people are just AHs.", "lol\n\nGrowing up my dad taught me to do Golf Time. \n\nIf you are 15 minutes early, you are on time. \n\nIf you are on time, you are late. \n\nI actually beat out a guy more qualified for the job because I showed up 15 minutes early, and he was 5 minutes late.", "We don’t bother calling this family member I mentioned any more either, and I don’t fault you for how you handled this situation at all.", "Amazing what being held accountable can do for shitty people!", "I’m going to be late to an event today but it’s because I’m going after work. I’m so glad the other person is going and is starting without me. You’re NTA."]}