{"id": 31205, "submission_id": "17y3tpg", "title": "AITA for waking my boyfriend up at night and asking him to take me home?", "selftext": "Me [21F] and my boyfriend [23M] have been together for about 6 months, and I used to stay at his place all the time; we were basically living together. However, last week we had a terrible argument, and I decided to pack all my things and go back home. When we made up we agreed that we would let each other know when we're ready to go back to how things were before.\n\nLast night I went over to his place for dinner and stayed for a while, and this was the first time I returned since we resolved the issue. When he picked me up, he asked if I wanted to spend the night or go back home and I told him I wasn't sure and would decide later.\n\nAfter dinner we got into bed to cuddle a little but around 10 pm we fell asleep. I woke up around midnight feeling uneasy about staying there. I mulled it over but, for some reason, felt uncomfortable staying and had the urge to go back home, so much that I couldn't fall back asleep.\n\nFinally, around 12:30 am I woke him up and asked if he could take me home (it's a 20 minute drive). At first, he asked if I could stay and that he'd take me home first thing in the morning, I explained that I couldn't sleep much but laid back down anyway. He got a bit annoyed, went to the kitchen, and when he returned he told me I should have told him earlier. I explained that I accidentally fell asleep and that I was feeling weird staying there. At that moment, he told me to try to sleep since it was late and he didn't want to go out at that hour and he laid back down.\n\nI thought he was probably right to complain (I only remembered at that moment the he had been awake since 5 am and was surely very tired) and I didn't insist. I got up to drink some water and then went back to bed. After a few minutes, he got up upset and told me to get dressed. I tried to convince him to come back to bed and that I'd stay, but he got even more upset, raised his voice slightly, and said I was being disrespectful to ask that at that hour. He drove me home but he didn't say a word the entire way and didn't even kiss me goodbye.\n\nI know I wasn't very kind to ask him something like that last minute, which is why I believe I could be TA, but at the same time I didn't feel like ignoring my feelings. I also felt a bit hurt because he didn't try to reassure me nor did he ever bother to ask me what was wrong.", "created_utc": 1700303902, "permalink": "/r/AmItheAsshole/comments/17y3tpg/aita_for_waking_my_boyfriend_up_at_night_and/", "score": 17, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I woke my boyfriend up at night to ask him to take me home. This might make me TA because I probably could have handled the night there without disturbing him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "> he didn't try to reassure me nor did he ever bother to ask me what was wrong.\n\nYou woke him up in the middle of the night and you expect a therapy session? Geez.\n\nI get that you shouldn't have to stay at a place where you're uncomfortable, but YOU caused this annoying problem. First, by falling asleep there, and second, by failing to call a cab instead of waking him up.\n\nYTA", "YTA\n\nThere are so many examples of your selfishness in this post.\n\nYou didn't consider him at all. Didn't consider his lack of sleep, how dangerous tired driving could be. \n\nDidn't consider *any* other options such as staying on a couch or getting an uber. \n\nDidn't consider that when you treat him rudely, he shouldn't have to bend over backwards to reassure you or kiss you. \n\nIt kinda feels like you're still in teenage mode and you expect to be catered to without thinking it through. That's not fair in an equal relationship.", "YTA\n\nAt that moment you either stay or you find another way to go home (taxi, uber, etc). You don't wake someone who's been asleep for two hours up just to take you home.", "Whether you're TA or not, I'm pretty sure you're his ex now. 20 minutes one way is a 40 minute drive total, and it's really disrespectful to wake someone up at such an hour and ask them to drive that much for you when it's not an emergency. You should have either taken your own car, or called for an uber. YTA.", "YTA. \n\nWaking someone up to bring you home is indeed not a cool thing to do, and I would have reacted harshly to that. \n\nIf you want to go home, leave a note and go home, alright. But don't wake someone up to drive you home.", "Of course YTA. You made him drive the better part of any hour in the middle of the night. Why would you think you're not TA?", "YTA\n\nYou can’t decide in the middle of the night you want to leave, then expect a kiss goodbye \n\nSurely you could have headed to the lounge and watch tv until a decent hour", "YTA you are very annoying", "YTA.  It often takes a long time to fall asleep.  There are people who fall asleep as soon as their head hits the pillow.  Others might be relaxing with their eyes closed but wide awake for hours, hoping to fall asleep at some point in the night.  On top of that, it can be extremely hard to fall asleep if you are angry or annoyed.\n\nIf he fell asleep around 10, he was well into deep sleep by 12:30, but you woke him up to ask him to drive you 20 minutes home?  That's about an hour round-trip.  If he has trouble falling asleep afterward, he might be up until 3:30 or so.  \n\nBut even if he hadn't driven you home, the damage was already done.  By making an unreasonable request, you angered and annoyed him.  Enough that he had a hard time falling asleep.\n\nAnd when he realized his sleep was ruined, he then figured he might as well drive you home.  Both to give you what you asked for, but also to get you out of his sight.  And oh yeah, he was pissed by the time you got home.\n\nDon't know how your BF will handle the situation.  But if my GF pulled crap like that, she wouldn't be visiting my place again anytime soon.", "YTA.  By waiting until he went to bed, and fell asleep before making a decision.  You should have called an Uber.  If I was forced to do this for you at this hour I wouldn't pick you up again.", "YTA and most probably the ex by now. What were you trying to accomplish? If you were uncomfortable, just take an UBER", "YTA. Time to grow up.", "YTA you can't wake up people when you can just take an uber. Next time decide right then and there if you will stay or go.", "Personally, if I fall asleep at 10pm and then get woken up at 12:30 for a 40 minute drive, there’s no way I’m falling back asleep. I would be up for *hours* after that. \n\nYou should have decided if you were staying or not *before* 10pm, or called an Uber if you didn’t want to stay there in the middle of the night.\n\nYTA (doubly so if he had work the next morning)\n\nYTA", "YTA… and seriously… get over yourself. You had one argument and not you feel uneasy spending the night??? When you previously we practically living together!!!!! GROW UP", "The comment about him not asking you what was wrong is what swings it to a solid YTA for me. You didn't wake him up to take you home, you woke him up to make a point that you were still angry about whatever this prior argument was.", "YTA. If he's smart you won't be seeing him again anyway.", "Yeah, no sorry but YTA\n\nAs people are saying Uber/Taxi. If you needed to leave so badly. \nYou were also comfortable enough to fall asleep in the first place, so where did the sudden discomfort come from?", "YTA. I would give you all the reasons but you seem to be getting enough in the comments. \nTake them into account and stop being this way. I would’ve been pissed too if I were him. He probably got up and did it so you couldn’t use him not driving you home against you in your next argument.", "info You guys got taxis where you are ? Was there a couch ? Is there a reason you're not including here for your ... changing discomfort ?", "YTA, that's honestly insane, the fact you have stayed there heaps beforehand, and literally fell asleep there once again, surely you could just stay at that point... I would've been pissed.", "As someone with trouble sleeping. last night fell asleep at 11:30pm woke up at 3am to pee and havnt been able to get to sleep again currently 6:20 am I hope he dumps your ass", "AH or not isn't the important question here. What on earth happenee that you feel so uncomfortable sleeping at his house?\n\nI'd say YTA for putting yourself im a situation where you are so uncomfortable that you so urgently need to leave.", "Sometimes I wonder, do people read their own stories before posting? How can any sane human read this and think they are NOT the asshole", "YTA,", "YTA. Of course he's mad. You woke him up in the middle of the night instead of being an adult and either waiting until the morning or calling yourself an Uber. You were the one being disrespectful, not him.", "Yta.\nThe guy I'm seeing is more than happy for me to spend the night whenever I want, however I like my bed & space and choose not to, if we ever fall asleep & I wake up ready to go home, I write him a note saying 'I had a nice evening & talk tomorrow' and then cab it home... Also about 20 mins away from my place. It's not that deep", "YTA, asking someone to drive 40 minutes round trip after they’ve been asleep a couple of hours should be pretty self explanatory.", "> I also felt a bit hurt because he didn't try to reassure me nor did he ever bother to ask me what was wrong.\n\nWell why didn't *you* do that? You can clearly see he was distressed and worked up after being woken up in the middle of the night. You can see he was very upset. Why weren't you trying to reassure him about *his* feelings?\n\nThese were your choices, but you're not taking ownership or responsibility for them or for what you want. If you want to go home, that's fine - leave a note and make your own way back instead of waking him. There's a lot of you demanding things from him and no reciprocation. YTA", "YTA. It honestly sounds like you were just trying to cause drama or punish him for the (apparently still unresolved) argument you had.", "You’re a mind fucker", "YTA.\n\n*You* caused the problem and then expected him to want to kiss you goodbye and comfort you about how the problem you caused wasn't a problem? YTA.\n\nYou should have driven yourself over. If you're having so many problems that you aren't comfortable spending the night, it's *your responsibility* to ensure you have a way to get home. When you woke up and weren't comfortable staying there, it was *your job* to get yourself home: uber, public transportation, etc. It wasn't his job to wake up and drive an hour in the middle of the night.", "I’m not going to judge you because I’m a big believer that women should trust trust their feelings. If something made you uncomfortable about staying, I think you were 100% correct to leave. However, I don’t understand why you didn’t call a taxi or Uber. If you’re not comfortable enough to stay, it seems odd you’re ok with him driving you home at that hour.", "YTA you fell asleep for a reason just go back to sleep??? u felt the need to wake him up in the middle of the night for what??", "YTA \n\nYou're immature, selfish, rude and think the world revolves around you, apparently. \n\nYou realize that it's 2023 and Uber exists, right? \nAre you 21 years old or 7? \n\nIf I were your bf , that night would be the last time we would speak.", "YTA", "YTA\n\n&#x200B;\n\nWhy didn't you take an UBER or a taxi?", "YTA.\n\nUber/Lyft is a thing.", "YTA...ever heard about Uber?", "Si lo sei", "YTA", "Never heard of an Uber or a cab? YTA", "You could have called a taxi and not bother him considering he was up at 5am. I would of been upset too if I got woken up at 1249 cause my partner wanted to go home. Take a cab.", "YTA you should have got an uber. Also, this relationship needs to be over. No reason you two should be together if this is how you feel about each other. You don't trust or respect him and he is (rightfully) annoyed by your selfish and wishy-washy behavior. You're both young and there are other fish in the sea.", "YTA. Do you not have a phone to get an Uber? This was so disrespectful and frankly dangerous. He was awake since 5 and slept for maybe two hours by the time you woke him up. He shouldn’t have been driving. And he was already awake and wouldn’t be able to go back to sleep after you woke him up", "he is not a person you visit anymore without your own means of transportation", "YTA\n\nYou sound very bipolar. You want to stay. You don't want to stay. You want to stay. You want a kiss goodbye.\n\nLike what? You couldn't have slipped away and gotten an Uber? \n\nDo you even know what you want, like at all?", "YTA. Trying to see this from bf perspective I’m not sure I would stay together. You pack your stuff and go home after a fight, ok maybe that was warranted. But you’re also so flippant even about a night over there where you can’t be comfortable with him and on a whim change, and immediately depend on him while you’re actively telling him you’re uncomfortable with him. \n\nNow throw that on top of the general fact that nobody wants to be woken up in the middle of the night to get negative news and what’s honestly a chore. At least from this story alone, I don’t know you otherwise, but the fact you couldn’t see a problem with some of these actions alludes to some entitlement that you should address. And for future scenarios if you’re not sure about where you’re staying that night, the “escape” plan comes down to you, not the person you’re trying to get away from.", "Ytah. No doubt in my mind.", "YTA. Get an Uber leave a note anything besides waking someone up due to your indecisive attitude.\n\nAlso sounds like this relationship has or will run its course very shortly.", "YTA", "YTA. \n\nIs there a reason you couldn't find your own way home? Why does he have to drive you?", "Ah yes.  Nothing says kids playing adult games. 21 and shacking up. Sounds like let’s play mommy and daddy games.", "Look I get feeling uncomfortable and wanting to go hone. I've been there. I've done it. But I've driven or taken a taxi or something. Waking someone up to give you a lift is a bit of a dick move. Not the worst but not cool. And he did take you home - and i would have been leery if hed outright refused - is he grumpy about it? Yes but he has a right to be\n\nI think arsehole may be STRONG but it was Not Good and he has reason to be vexed", "Yta", "YTA, but if it’s any consolation I don’t think situation will arise again, at least not with him.", "YTA\nHow old are you? Seriously what the hell…", "grow up\n\n&#x200B;\n\nYTA", "NAH but that was a break up drive. Next time you are with someone and get that feeling, listen to it, but also just take an uber without waking them up. \n\nWaking him up to drive you wasn’t nice to your ex, and I am glad it was still safe. He was really tired and groggy from lack of sleep, plus your inner voice said not to stay the night. If your inner voice says go, you go. But you don’t get in the car", "actually i think NTA. you fell asleep by accident and you DID tell him you’d make up your mind later. \n\nyeah it was a little inconsiderate but he shouldn’t have been so snappy about it. he could’ve offered to get you a cab instead of being so cranky. \n\nanyway my standards are clearly higher than the average person lmao but if it was me - my man would always get up and take me so he could ensure i got home safely and was comfortable.", "No one is to blame really.\n\nIn fact, I like the sound of that guy. He was clearly annoyed with this but ultimately couldn't go to sleep knowing youre not comfortable staying. \n\nWhy wont you call a taxi?\nM", "ESH. You were TA to wait so long to tell him. He is TA for convincing you to stay then making the decision on his one. That you need to leave and being mad at you for it, after you already agreed to stay.\nYou seem inconsiderate and he seems very controlling.", "NTA but you didn’t handle this very well. If you’re not comfortable staying somewhere you are absolutely within your rights to leave and forcing you to stay would be an A-H move, however, as others have said, you should have tried other options besides making him drive you, besides the fact he’d been up since stupid o’clock (as you note) driving tired can be as dangerous as driving drunk so you put both of you in a dangerous driving situation.\n\nIt also sounds like you moved too far too fast in your relationship, you’ve only been together 6 months and were practically living together before you’ve even really gotten to know each other. If your relationship continues you need to live separately while you actually develop it. Stay over on the weekends sure, but sleep in your own bed at least Sunday night to Thursday night (which doesn’t mean you can’t see each other during the week, just don’t stay over as if you’re living there until you’re further along in your relationship.)", "I am puzzled by the comments right now that Y T A for waking your bf because you want to go home. If you hadn't woken him when you left, he wakes up, you have disappeared, no word, not said goodbye, potentially not locking the door on your way out (unless you have your own key).. would have been way more disrespectful and alarming.\n\nI think NTA. You weren't feeling okay staying there and that comes in the heels of a very big argument and first time you are staying over since then. You wanted to go home. Sure you waking him up is disruptive to his sleep but if your partner doesn't feel OK to stay that should disrupt you as well. \"You should have said earlier\" is not OK comment, earlier you felt it was OK but you have since changed your mind and are now uncomfortable. Sure, maybe after the first time he said \"Not doing it now\" you could have just picked up  a phone and called a taxi or something, but would have been a pretty significant sign for the relationship, right? You instead tried to adapt and now he is the one uncomfortable because he knows you are and you are just trying to hide it. Until that moment I was willing to give N A H. But his reaction after, calling you disrespectful and giving the silent treatment ruled that out. I don't think it is worth trying to rebuild a relationship where you are being manipulated in this way.", "This one is actually pretty tough and I think I'm landing on NAH.\n\nY'all did agree to speak up when you wanted to leave, so fair enough. But it was also 12:30 am, two and a half hours into sleep, so I get him being a little grouchy about it all.\n\nNext time, have an exit plan in place just in case. Plan to call an Uber if it's late. Decide between you two if waking him up to let him know about the Uber and lock the door is appropriate or if you should leave a note abd bounce (and how to handle locking the door in that case).", "NTA. People can get woken up for one million different reasons. The fact that he woke up is nothing, but the fact that she woke him up because she probably wanted attention or created a situation to get attention because she is still a bit too immature to understand and communicate her feelings. He is also probably immature because he did not do enough to make her feel understood or she would not have needed the reassurance / attention at that moment. Someone wanted to break up more than the other which creates insecurity and strong emotional feelings. THEY'RE YOUNG / BASICALLY STILL KIDS ! Whatever you do - don't get pregnant !!!!!!!!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMe [21F] and my boyfriend [23M] have been together for about 6 months, and I used to stay at his place all the time; we were basically living together. However, last week we had a terrible argument, and I decided to pack all my things and go back home. When we made up we agreed that we would let each other know when we're ready to go back to how things were before.\n\nLast night I went over to his place for dinner and stayed for a while, and this was the first time I returned since we resolved the issue. When he picked me up, he asked if I wanted to spend the night or go back home and I told him I wasn't sure and would decide later.\n\nAfter dinner we got into bed to cuddle a little but around 10 pm we fell asleep. I woke up around midnight feeling uneasy about staying there. I mulled it over but, for some reason, felt uncomfortable staying and had the urge to go back home, so much that I couldn't fall back asleep.\n\nFinally, around 12:30 am I woke him up and asked if he could take me home (it's a 20 minute drive). At first, he asked if I could stay and that he'd take me home first thing in the morning, I explained that I couldn't sleep much but laid back down anyway. He got a bit annoyed, went to the kitchen, and when he returned he told me I should have told him earlier. I explained that I accidentally fell asleep and that I was feeling weird staying there. At that moment, he told me to try to sleep since it was late and he didn't want to go out at that hour and he laid back down.\n\nI thought he was probably right to complain (I only remembered at that moment the he had been awake since 5 am and was surely very tired) and I didn't insist. I got up to drink some water and then went back to bed. After a few minutes, he got up upset and told me to get dressed. I tried to convince him to come back to bed and that I'd stay, but he got even more upset, raised his voice slightly, and said I was being disrespectful to ask that at that hour. He drove me home but he didn't say a word the entire way and didn't even kiss me goodbye.\n\nI know I wasn't very kind to ask him something like that last minute, which is why I believe I could be TA, but at the same time I didn't feel like ignoring my feelings. I also felt a bit hurt because he didn't try to reassure me nor did he ever bother to ask me what was wrong.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Honestly I don't know what's wrong with you people, y'all weird. lol", "YTA. Driving while you’re tired is as dangerous as DUI. He asked you several time to avoid this situation and you didn’t give a firm answer. At that point, you lay on the couch or call an Uber to take you home but it was rude and disrespectful to wake him up", "YTA that's ridiculous. He was in no shape to drive being that sleep deprived. There are Ubers, Lyfts, and cabs. You should have called one.", "It was his continuing punishment for the argument.", "Yeah you are. Just lay in bed till the morning princess. It wasn’t an emergency", "YTA. No considerate person would do this. If it was an emergency of course, but this was deffo not an emergency. You were just being selfish and entitled. Seriously if you wanted to go home so bad you should have called a taxi or uber smt. The audacity and then to be surprised that he his upset 🤦🏻‍♀️.", "Stay single. You are not mature enough for a relationship. YTA", "YTA.\nYou have plenty of growing up to do. Caring is not a one-way street.", "YTA  \nUBer or drive your own vehicle. He was right to be annoyed.", "YTA, call an Uber next time.", "YTA. If you’re feeling uncomfortable staying somewhere make sure you have the ability to take yourself home. There’s this thing called Uber…", "Yeah the tired driving really stood out to me. So reckless.", "Not to mention a 40 minute drive when he’s only had 2 hours of sleep, and now also in a mood. It’s so dangerous.", "especially since he’d been up since 5 the previous day! i’d be upset too, just out of exhaustion. the morning after, i don’t think i’d be inclined to still be mad at my partner. but his reaction is 100% valid for in that moment. she disrespected his sleep, which is sensitive to a lot of people.", "I agree", "Yeah and he had been up since 5:00am.", "this!!!", "That's exactly why he did it", "OP doesn't share also why it changed from basically living together to her packing her things and going back home previously in the relationship, but I doubt it is something small or trivial.", "📠 this woman is a piece of trash", "Only normal response in this entire thread", "Why isn't she to blame? As you pointed out yourself, she could've just called a taxi. She didn't need to wake him up and make him drive 40 minutes roundtrip at that hour.", "This is where I stand - I also live domewhere where uber and raxis are unlikely late at night.. \n\nSo... its nit necessarily arsehholisj behaviour..... but it MAY be arseholish to be put out by hus annoyance. He did what she wanted, yes he's annoyed but he has a right to be", "Where exactly does OP state the BF convinced her to stay?\n\n>he asked if I wanted to spend the night or go back home and I told him I wasn't sure and would decide later", "They dosed off at 22:00, she woke up feeling uneasy at 24:00 and tried to adapt, then woke him at 24:30 after realizing she really wants to go. \"So long\"? It was literally just past midnight and both of them are in their early 20s.", "\"You're not the asshole. But here are all the reasons that you were in fact the asshole.\"", "agreed on the moving to fast part cause who basically lives with someone only after 6 months, if not shorter!", "She could have sent a text message explaining or left a note. Or just woke him up and said I’ve called a taxi.\n\nYou are puzzled because you are not thinking rationally perhaps?", "If she changed her mind, then she could have called for a car service. They were already living-ish together. I’m doubtful she didn’t already have a key.\nHe’s not being manipulative by being annoyed with his girlfriend. Maybe he doesn’t want to talk to her at midnight for no reason? She made her decision to stay there when she fell asleep. She lost the chance for him to drive her home. They just got back to solid ground and now she’s acting like this? Nothing even came of her leaving.", "lol it’s hard to imagine people like you exist. You’re that selfcentered that you think disturbing others for your indecisiveness is ok?? On top of that, you call the poor guy manipulative? He never forced her to stay, he gave her options and asked that she tell him at a reasonable time. She decided to stay and then started flip flopping on whether to stay or not. He got understandably upset (only slightly) at the stupid game she was playing and gets labelled as manipulative lol. \n\nTelling someone to be reasonable isn’t manipulation, it’s common sense. The guy didn’t slept since 5am, he was in the middle of sleeping and got woken up so he could drive her back. Driving in the middle of the night, tired and sleepy could be dangerous. Obviously, OP is too stupid to think of that and instead worried about the slight uptick in his voice and lack of goodnight kiss. If I was OP’s boyfriend I’d have a hard look at the relationship.", "you are just as exhausting as OP.\n\ngrow tf up, both of you.\n\nalso, OP, YTA!", "Some people have a lot of trouble sleeping so being woken up is a huge issue. Like I'm hoping this is a fake story because I'm getting annoyed reading this because I can't get back to sleep after only getting 3hrs ish today. Went to bed around 11:30 woke up around 3am to pee and havnt been able to get to sleep again. This guy wasn't able to get back to sleep after being woken up to the point he drove her back home. He most likely wont get back to sleep for at least 2hr doing the round trip and probably pissed off.", ">People can get woken up for one million different reasons. \n\nCan people be asked to drive 40 minutes roundtrip in the middle of the night for one million different reasons?", "Wait until you find out about snow plow drivers.", "Probably because whatever they’re argued about, it was about her.", "It was dumb for sure, she should have gotten an uber or taxi rather than asking him to drive her or staying in a situation where she felt uncomfortable, but I don’t think that necessarily makes her an arsehole.", "Since when are you unwilling to disrupt your sleep ONE night for your partner in a relationship? What is wrong with people.", "What solid ground exactly is in the fact that they dosed off after cuddling at 22:00 (she never decided she would stay the night) and when she wants to leave it is making him mad. Also \"he doesn't want to talk to her at midnight for no reason\" - \"My partner is feeling uncomfortable staying the night with me in our formal common residence and I see no reason to ask her why\" ... the only reason not to talk about it is ... \"because I know why\".", "To me, it doesn’t at all sound like they were back on solid ground for her yet if she was feeling so uncomfortable and unsettled. I also think there are many guys who if she’d stayed and later mentioned she didn’t feel settled and wanted to go home but stuck it out would say “babe i wish you would have just woken me to say that, I hate knowing you were feeling like that all night, I’d have taken you home”.", "You are making it sound it was more than one time thing after a period where they were literally having a break in their relationship because of an unspecified by OP so serious of an argument that she packed her things and moved out.", "I mean I definitely agree that disturbing sleep can be a problem. To me it reads like this is the first time this issue has come up, so I get him being grumpy and her not thinking about the impact, only \"the agreement was to speak up if I needed to go home\".\n\nIt happening once is fine, shit happens. It's all about how it gets handled moving forward. Plan on an Uber in case sleep attacks happen, decide in advance if \"hey I'm heading home\" is a wake-up decision or if a note will suffice, everyone gets what they need and no one has to drive 40 minutes while sleep-grumpy.", "\"Her incredibly selfish behavior isn't because she's an asshole. It's because she's just dumb.\"\n\nOk. Sure. She's not an asshole. She's just an idiot. That sure sounds better.", "That's exactly what makes her TAH", "But 'asshole' on this sub doesn't literally translate to being an asshole. Read the rules a bit to explain, but it's more a moral judgement of who is right or wrong in a situation.\n\nFrom your comment, you do find her to be wrong in this situation. If you also find the boyfriend wrong, this should at least be an ESH for your judgement.", "OP needs to grow up.  \n\n\"Drive 40 minutes round trip in the complete middle of the night because I just sort of 'feel' like going home.\"\n\nHow is this defensible?   She can't take a freaking taxi and leave a note explaining everything?  What the hell is going on here?  *What the hell is going on here*???", "It's ONE thing if there's an emergency, but why would it be a ONE night if she thinks it's okay to wake him up based on her random whims? If this wasn't a break up now, she would continue to wake him up as she pleased.", "Once again. She is old enough for any of the driving services. It doesn’t matter if she accidentally fell asleep. That’s a decision by itself. She’s responsible for herself. \nIt’s an AH move to wake someone up then be shocked that they aren’t receptive to something they perceive as bothersome/annoying. At least he drove her home in the end. Putting her first since he didn’t have to, especially since they’ve been on shaky ground very recently.", "She made her decision to stay there by falling asleep at about 10pm... Decision needed to be made by her by that point surely, and he probably thought that she was just going to stay the night like a normal person would at that point.", "Ok and?? She was comfortable enough to come back to his place, she was comfortable enough sleeping for a few hours and she was comfortable going back to sleep after she “remembered” he hadn’t slept since 5am. Why is her comfort more important than their safety and his wishes of not driving sleepy in the middle of the night? She literally didn’t give a single fuck about anything other than her own comfort. She didn’t tell him at a reasonable time, she didn’t get up and call an Uber/cab, she didn’t consider the fact that that was her first time being back after a huge fight so maybe it’s best to take things slow. She literally did everything her way, caused distress to her partner and then cried about how he didn’t kiss her goodnight or “bother to ask her what was wrong”", "How many times did your partner get to be inconsiderate and rude and entitled before it becomes a problem????", "It is literally 12:30 when she woke him up and they are in their early 20s.  \"Complete middle of the night\" is a stretch even for people that woke up at 5 am to go to work.", "Decision by indecision, you mean. Or him assuming she would stay because ... she is unable to articulate decision? Besides, people are allowed to change their minds and reverse decision. Honestly, this sounds so stupid. His partner, with whom they had almost broken up recently, is not feeling comfortable staying and spending the night at the place where they used to stay and sleep until last week. This should be very disturbing for him, but NOT because it literally disturbed his sleep because she wanted to go.", "She \"just feels\" like going home. His response should be he \"just feels\" like not driving for 40 minutes at 12:30 am.", "You missed the entire two paragraphs where she actually agreed to stay until the morning then after he told her he would drive her in the morning:\n\n>At first, he asked if I could stay and that he'd take me home first thing in the morning, I explained that I couldn't sleep much but laid back down anyway. He got a bit annoyed, went to the kitchen, and when he returned he told me I should have told him earlier. I explained that I accidentally fell asleep and that I was feeling weird staying there. At that moment, he told me to try to sleep since it was late and he didn't want to go out at that hour and he laid back down.  \nI thought he was probably right to complain (I only remembered at that moment the he had been awake since 5 am and was surely very tired) and I didn't insist. I got up to drink some water and then went back to bed. After a few minutes, he got up upset and told me to get dressed. I tried to convince him to come back to bed and that I'd stay, but he got even more upset"]}