{"id": 31217, "submission_id": "17y8yva", "title": "AITA for not attending thanksgiving with my families because my half-sister is not welcome", "selftext": "Throaway account because some friends follow my main and I don't want this attached to my main.\n\n\n\nI (25m) have three siblings (26f, 28f) from my parents (49f and 50M). I also have a half-sister (7f) I'll call \"May\" who is a result of my dad's affair. My dad had an affair with a woman in her 30s, whom I'll call \"Mary\". When my mom found out about the affair, they had a huge fight, and it wasn't long before we also knew about it. My two older sisters and I went no-contact with my dad, and my mom divorced him. Initially, I didn't want any contact with my dad until I found out he got his affair partner pregnant. So, for the sake of my sister, I decided to reach out to \"Mary\" and my dad. My mom and sisters didn't approve, but they couldn't really stop me.\n\n\"Mary\" developed cancer when \"May\" was around 6 and unfortunately did not survive because they caught the cancer late. After that, my dad didn't want anything to do with \"May,\" so I decided to get custody of her from my dad. \"May\" is now 7, and I absolutely adore this little girl. She's a little ball of sunshine despite everything that happened to her.\n\nWhen my mom and sister found out that I decided to take custody of \"May,\" they understandably went ballistic. But I told them it's my choice, she's my sister, and I'll take her in—I don't care if they like it or not. That shut them up quickly.\n\nNow, the issue at hand: My mom is hosting Thanksgiving this year and wants me to come because my sisters and their partners are attending for the first time, along with some aunts and uncles. I told her that if I'm attending, \"May\" will also be there with me—I won't leave her alone during the holiday. She didn't like that and told me she didn't want \"May\" there. I said then I won't be coming, and that's final.\n\nA few days ago, I got a message from my mom stating that if I'm going to choose my dad's affair child over her and our family, then I shouldn't bother contacting her ever again. I agreed. Now, my sisters are on my case, angry that I won't be coming and that I'm choosing \"May\" over them. I told them they're welcome to do the same as my mom did—cut contact with me—because \"May\" will always be in my life. Technically, I have full custody over her and will also officially adopt her soon from my dad. \"May\" is my responsibility, and I love that little girl to bits.\n\nI talked to my friend, and he said what I'm doing is unfair to my mom and sisters, and going no contact is terrible. I'm conflicted. I understand that they don't want anything to do with \"May\" since she is the result of dad's affair, but they can't expect me to leave her alone during a holiday. AITA??", "created_utc": 1700321660, "permalink": "/r/AmItheAsshole/comments/17y8yva/aita_for_not_attending_thanksgiving_with_my/", "score": 1482, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) not attending Thanksgiving because I will not go without May. Since I have custody of her and I love her. \n2) Because I decided not to go to thanksgiving and I'm \"choosing\" her over my mother and sister and I might ruin my relationship with them.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - I understand how hard it would be to accept May as family, but they are the ones choosing to go no contact over it, not you. \n\nHow May was created is an uncomfortable fact, but it certainly isn't her fault. Good for you for adopting her and making an ugly story a beautiful one. Hopefully someday, your family will see it that way too.", "NAH\nTo me there are no a holes here. What you are doing for your sister is very awesome. At the same time though you cannot expect your mother and sisters to be on board. Would it be nice if they were? Yes but they are not obligated to. Your mother is probably still hurting from the affair and truthfully it is better to keep your sister away from that negative energy. Hopefully with time and some therapy your sisters will come around but your mother may never and you will have to come to deal with that eventually. Your dad and the affair partners are the real buttholes here.", "Nah. You made the decision to care for this child. Your mom and sisters did not, and their reasoning is acceptable, especially your moms. \n\nFair or not, you made a lot of decisions that hurt your mom, and it seems she's can't take anymore. Perhaps therapy can help, but I doubt she (or anyone) would want to be a grandma to husbands affair child. Taking on the  hold is a de ision you made, and you knew there would be consequences (as there is in all things). One of those was crating more distance with your mom and sisters.\n\nYour dad made a mess of his marriage to your mom and his family, then a further mess by abandoning his small child after their mothers death. \n\nInfo. In the year or so that you have had custody of your sister. What has your dad done to try and get back on his feet? Have you made time to be with your mom and sisters in general?  hired babysitters, planned playdates, etc, so you could spend time with them? Because I can see how they may have felt abandoned by you throughout this process as they felt abandoned by your dad. (Therapy could help)\n\nIf you truly want to find a way forward then I suggest you attend family therapy with your mom (and older sisters not 7yo). I suggest you attend individual therapy anway to help process what is happening.", "NAH People are so quick to jump on your mom and your sisters but can't realize how this devastated the family. They're not over what happened. I can't imagine your mom's pain of losing a long term partner of over 20 years. She built her whole life around this guy and had kids with him. And he betrayed her and now has a lifelong evidence of that too. And for your sisters, can't imagine family being ripped apart, seeing their mom devastated like this. You saw it too. And for them to see you reaching out to the affair partner and make nice with her, this would be beyond heartbreaking to your mom especially. It seemed to them like you chose your dad and justified his affair and gave your seal of approval too. Your mom is going to take a long time to recover, if ever. Your father traumatized her in the worst way.\n\nYou did right by the little girl that your father abandoned. She shouldn't be alone during the holidays. She needs someone in her corner.\n\nI can't blame anyone but your dad and his AP. Did either of them show any type of remorse for what they did?\n\nI'm not going to call your family hateful for wanting to keep distance from the evidence of a brutal trauma, especially your mom.", "NAH look it’s great that you are going so far for your half sister (I think it’s truly wonderful, I really do) BUT she is a living, breathing, walking, talking, piece of heartbreak for your mum. This is the biggest physical evidence of how badly your father betrayed his wife and family. \n\nAs much as think what you are doing is admirable, please try to see it from your mother’s (and your sister’s) side. She had been betrayed and cast aside by the man she loves and built a family with. \n\nNow there’s a living, breathing reminder of that pain. It’s not the child’s fault but it’s not hate and anger fuelling your mother’s feelings. \n\nIt’s pain. \n\nIt’s heartbreak and betrayal.\n\nPlease don’t forget that.", "Nta/yta\n\n\nBut your mother isn't obligated to invite the personification of her betrayal.", "NTA \n\nyou’re doing the right thing. Your father’s actions are not fault of your little sister, and your family should try to reconcile with that, as hard as it may be. You’re not choosing your sister over them, your family is choosing a grudge against an innocent child at the expense of their relationship with you.", "NAH. You did what you felt was right, but your mother cannot be expected to accept her husband’s affair baby into her home.", "You chose your sister. That’s okay, but you can’t expect your mom whom divorced her husband to be welcoming. That’s just madness. \n\n\nIt’s just a sad thing. That child will grow up knowing that she was the cause for a rift between your mother and sister. It would be best to be NC so she doesn’t experience any bitterness.\n\nI applaud your mom for keeping her distance because children can feel where they are unwanted. Make sure you keep her around people that will love her. No child should grow up around people that hate them. It’s better for her to set this boundary then a child be mistreated emotionally. \n\nNAH", "you seriously cannot expect your mother to take in your fathers affair child. I understand why your mother is hurt and it is unfair to her", "It’s only been a year since Mary passed and you gained custody of May.  I imagine the wounds are still fresh for your mom and sisters so sitting out this year is probably still wise for everyone involved.  I would reach out to them again later, maybe after the adoption is final.", "NAH except for your father. I completely understand your perspective- May is an innocent child and you’ve stepped up for her, which means she ought to be included in your family holidays. I also understand your mother’s perspective- she feels as though she’s been betrayed twice. It’s not logical but cheating can be legitimately traumatic. Your father is the real villain here.", "NTA. Your mom is allowed to not want be around this child, but she can’t reasonably expect you to leave a 7 year old alone on thanksgiving. The real a hole is of course your dad. Putting everyone in such a shit situation is unbelievable", "NTA. Your dad is a piece of work. Your mom wants you to leave a 7 year old alone for a holiday? Also, they're the ones threatening to go no contact with you. That's their choice.", "Can I just say, you are a very kind person for adopting your half-sister? She’s just a little kid, her mom passed away, and it’s not her fault she was the product of an affair. I’ll admit I had trouble understanding the post because I’m really sleepy, so sorry if I’m confused about things. But genuinely, I think you’re doing a very good thing. Your family shouldn’t hate May for something she has no control over.", "NAH. I understand the position you are in. However it is flatly unreasonable for you to expect your mother to open her home to May and for her to serve her food.", "NTA. May is a child and is not responsible for any of the circumstances that brought her into this world. You’re doing right by her and that’s truly commendable. Research shows that children can bounce back from unthinkable trauma if they have at least one adult in their lives that loves them unconditionally. \n\nYour mom sucks, but let’s assume she needs therapy to deal with her triggers over your dad’s affair. Your sisters are definitely TAH. There’s no reason they shouldn’t be able to see this from multiple perspectives and know what’s right. \n\nYour family wants to put this all in a box and never think about it again. May prevents them from doing that and that’s not how life works. \n\nCarry on, best half brother ever.", "You're a parent now. Your kid has to come first. This estrangement was inevitable as soon as you assumed custody of May. No one should force a situation where your Mum has to be around a child she will always view as the \"affair baby\". No one should force a parent to neglect their child for family unity. \n\nYour sisters need to accept your decision to adopt your sister and this estrangement. They need to decide if they can maintain a relationship with both of you or if it's too difficult to be around May and No Contact/Low Contact is best. NTA", ">said what I'm doing is unfair to my mom and sisters, and going no contact is terrible.\n\nWell what else are you supposed to do? Dump May on the street? You chose to adopt her so it is what it is. Going NC is fine. NAH though because I understand why your mom doesn't want her around.", "NTA since you are her guardian and even plan on adopting her. For all intents and purposes she is your daughter now. Your father is a giant asshole for causing this situation in the first place and abandoning that child after she lost her mother.", "You are not going no contact. They are! Understand: you did something amazing for a little girl who is blameless and suffered a lot. Your mom should be fluffing proud she raised a great human being. \n\nThey are the ones messing up! They are choosing their wounded pride over their son + a blameless child that needed help. \n\nNTA.\n\nThe rest of your family, though, my god!", "NTA…you did and are continuing to do the right thing by her. Let them cut contact, but don’t block them…they may change their tune later…but if they give you crap onto the old blocked list they go. In other words, let them cut contact if they want but leave the door cracked until they demonstrate it should be closed. Yes…she’s an affair child and I understand how that upsets your mother…but she’s a 7YO blameless child in this and persecuting her for her soon to be not in the picture father is simply wrong…any moron can understand that.", "YTA. You are forcing people to accept the affair child. Your mother and your sisters owe this child nothing. \nJust part ways with your mother  and your full sisters.", "YTA based on the fact you want to have a product of an affair at your mother's house. I know I'll get down voted but so be it. You are insulting your family.", "Nta, mom needs therapy? What you're doing is an amazing thing for a child that is seen as unwanted by some. She didn't ask for this life. Hard pill for your mom to swallow, I get that, and that's too bad she can't see how selfless you're actually being.", "You are NTA for taking the sister in and staying with her on holidays \nMom & family are NTA for not wanting a relationship with the child however they ATA for making you choose between an innocent child you adopted and them when they could instead choose to be low contact with you \nDad is TA on all fronts", "NTA but instead you are an incredible human being mate! None of this is poor Mays fault she didn't ask for any of this. You just had the empathy and decent human nature to care for a lovely little girl that's related to you when no one else would.", "I don't get how everyone (except the people on reddit lol, I mainly meant your asshole family)\n\nIs trying to blame everyone except the people actually responsible for this:  your dad, and his affair partner\n\nYour half sister is SEVEN \n\nShe's a fucking CHILD\n\nI understand it's uncomfortable, and all of that \n\nBut the only person responsible for your dad's shitty, selfish decisions are your dad, and Mary, depending on if she was aware he was married at the time\n\nPunishing you, or your half sister, when you are the only one stepping up, and actually taking care of the literal, innocent life created, impacted, and destroyed, because your dad is a selfish asshole, is ridiculous \n\nNTA \n\nDon't let anyone in your family, or otherwise, convince you, or gaslight/manipulate you into thinking you are anything but a stand up person\n\nEta\n\nI don't think you are wrong for sticking up for your half sister, who you have custody of, because your dad stuck his dick where it didn't belong, and *surprise* baby!  And now there is a child, and *surprise to no one* he doesn't want anything to do with her\n\nI don't think your mom is wrong for not wanting the reminder of her husband's affair around, either, even if may is innocent in all of this\n\nWhat i do think your mom, and sisters are wrong for is threatening to go NC with you, because you actually care about May's well being while everyone else is holding your fathers actions against her, which is absurd\n\nEdited again \n\nHolding a child responsible for the crimes of their parents is ridiculous \n\nOn any level\n\nYour mom's response of not wanting your half-sister around her is reasonable, but for her to decide to cut you off, because you stepped up when every other person in your half-sisters life decided that because of the circumstances of her birth, she was trash and didn't deserve a chance?  \n\nI can't reconcile that\n\nYou are your moms child\n\nShe doesn't need to have a relationship with your half-sister if she doesn't want to, and can set boundaries there, that is reasonable \n\nBut cutting you off completely, because you didn't cut off your half-sister?  That is unhinged", "NTA. Good on you for stepping up and taking care of May. Your mother and sisters need to be able to separate your father’s actions from the fact that this is an innocent child.", "May is about to become your child and it's your job to protect her. She is completely innocent in all this. It's not like you're asking to bring your father to dinner. I understand why May would be a reminder of your father's betrayal, but it's sad that your mother is willing to basically disown you because you are adopting an innocent blood relation. However, it might be too soon to involve May in the family holidays. She won't get a warm welcome. Find something else to do/somewhere else to go this year. After your adoption, you might be able to introduce her to the family on occasions that are less fraught, e.g., summer cookouts. NTA for keeping your distance and protecting May from the hostility.", "Nta, you sound very lovely and mature. Your mom chose no contact, that's her choice.", "NTA your sister is 7 and has lost her Mum. Why are your family taking it out on her? She's just an innocent kid", "NTA\n\nOf course you are right in this situation. It's hard to understand why everyone is against you in this knowing you are adopting May. Also impossible to understand your dad basically dumping his own daughter after the death of his current partner when May was already 7 years old.", "You're not chosing her over them. They are chosing to hate a child for her father's sins. Your mother laid down that particular ultimatum. \n\nI think it was a pretty deep betrayal for you to reach out to your cheating father and his affair partner and wanna play big happy family with the fruit of their multiple-life ruining actions. \n\nHowever. The kid is essentially orphaned. Is that what your mother wants? Would that make her feel vindicated? If the affair baby went to foster care? Or worse? Cuz that's pretty gross. You should tell her to get her head on straight. Nta.", "NTA.\n\nThey can't actually expect you to leave her alone. I know it's hard for them especially your mom to see her. But that's not mays problem. What's you're doing is great,  keep it up my man", "NTA. It's hardly unfair to stand up for a literal child when adults want to blame her for an affair. Especially when said adults thought it was appropriate to leave a child out of a holiday dinner that the child's guardian was invited to. NC is a difficult choice to make, but it sounds like it might be your best option right now, to be revisited in the future if you want to.", "NTA.  Obviously, because you’re choosing to put the  needs of a child above your possible anger with your dad.  You’ve drawn your line in the sand and are compassionate enough to realize none of this is May’s burden to bear.  You’re not choosing to go no contact.  You’re choosing to prioritize a child.  What do they seriously think is going to happen?  Your dad has already checked out.  Where do they think you’re going to park your child on this traditionally family based holiday?  Would any of them leave a  young child alone for hours on end?  The idea of that just seems preposterous.  In that respect, and in this specific circumstances, your mom and sisters are definitely AHs for thinking you should leave May behind.  \n\nThat said, your mother and sisters are on their own journey with regard to how they feel about the affair and the resulting child.  Does it suck that they’re not in a place to accept the presence of May?  Absolutely.  Does that automatically make them all assholes?  That’s less cut and dried.  It takes a lot of emotional bandwidth to get beyond our own complex feelings about a situation and view the various parts as possibly independent of each other.  I get that it’s easy, from the outside, to focus on the innocence of this child and how none of this is her fault.  And how anyone who doesn’t see that must be heartless.  And that is absolutely true.  But they have no relationship with May, so her innocence is an abstract concept that gets buried under the weight of their own emotions.  This is their issue to deal with.  And yes, I believe they’re on the verge of just becoming total AHs (instead of just being situational AHs) if they continue to allow their resentment about the affair to influence how they treat May.\n\nSounds like you’ve accepted this and are not allowing it to impact the choices you make with regard to May.  Unfortunately, this leaves you on a solitary journey in your effort to make sure May doesn’t suffer because most of the adults in her life are too busy looking inward.  You’re not required to offer up grace to the adults at the expense of this little girl.", "Classic case of a parent forcing the sins of a cheating spouse onto a resulting child. The only “crime” they’re holding against May is that of her own existence, she hasn’t done anything to warrant their disdain, all the fault lies with the mother and father.\n\nAbsolute NTA, your sisters and mother are quite frankly despicable for expecting you to completely abandon a 7 year old with no other family on Thanksgiving all because the father couldn’t control himself and she was the unwilling result. They need to get a grip and point their fingers in the right direction.", "Your family are all wankers and I'm genuinely baffled by how a hero like you managed to evolve from.that shit show. Few more people like you and the world would be a damn better place.", "NTA!  Not the kids fault at all.  Your mom needs to get over herself… the rest will follow her lead so… \n\nYou and May can have a beautiful holiday all your own!\n\nThank you for being a generous hearted person!  People act like the ability to love is so finite and it’s the complete opposite!", "NTA.\n\nI just want to add as a children's social worker there are few things that break our hearts more than a child that is unwanted by any family and left in the system.\n\nI too had a cheating father that I'm no contact with, but you're doing a valiant thing by taking in your half sister at an insanely young age. I truly hope your family realizes the harm they want to impose on a child that never asked to exist and that their hearts can grow and change.\n\nEdit: Dude, I'm hoping his family grows up but OP has no obligation to engage them damn y'all are salty assholes.", "NTA. Family is supposed to support each other no matter what. It's heartwarming to see how you've stepped up to take care of your half-sister. Your mom and sisters need to understand that May is now an important part of your life, and it's only fair that she is included in your holiday plans. Stick to your decision and prioritize the well-being of your little sister.", "NTA.  You didn’t choose the no contact, your Mom did.  It is wrong to place blame and resentment on May - and your adult relatives should know that.  However, if this is all very new and raw, I can see why your Mom (and possibly the rest of your immediate family) may be uncomfortable right now.  She/they might not have the emotional tools to treat May with kindness at the moment.  You surely do not want to subject May to a hostile environment.  But, I think your Mom is wrong.  Being a mother, she has some awareness that while this isn’t her child, it is your sibling.  It is unfair of her to try and make you choose.  May has already had enough tragedy befall her, and you are her savior.  Know that what you are doing for her is something the vast majority of people wouldn’t be willing to do.   This sounds like a really tough situation and I hope the best for you.  Peace and love", "NTA May didn't have the affair with your dad, she's just a child your Mom must relax", "NTA. I’m very proud of you and I think punishing this  little girl for her parents’ mistakes is reprehensible, and grown adults should know better.", "NTA, you're not cutting contract they are. You've taken responsibility for this girl's welfare, and you're taking it seriously. Much respect.", "NTA", "NTA.  I understand your mom and sisters POV, however you are not the one making the decision to go NC.  As they don’t seem to be able to accept your place in Mays life, it’s nest for you both to keep your distance.  You cannot subject the little girl to your mom and sister’s hostility.  Again NC is their choice and you are respecting their decision.", "NTA but you are a bit. No more than a bit naive to not think this would cause issues farther down the road. You are choosing a kid when your dad played the sperm doner, over your mom who gave birth to you.", "NTA. Your mother should see May as your adopted daughter rather than the personnification of her ex husband betrayal. And she is the one stating the ultimatum so you have no choice here as you can't let down May now. However the real A H here is your father.", "NTA\n\nTo be clear in this situation you aren't dying on this hill. Your Mom and Sisters are. It's one thing to not want a relationship with May, that's their choice. But their ultimatum shows that they're willing to cut you off for caring for an innocent child, and now they're trying to twist this back onto you to salve their guilt.\n\nNext time you talk, make it clear that THEY are the instigators in this. Not you!", "NTA.", "Yta big time ahe is not there relation. An affair baby is not innocent", "You chose this path.  While I agree the child is the innocent in this, your mom doesn't deserve to have the affair baby thrown in her face.  So, you do you, and leave them alone!!  Let them live in peace, and you take your decisions and live your peace.  They do not have to make allowances for what you chose to take on. You chose the side you wanted.", "What a wonderful human you are to step up for that innocent little girl. You know it already, but NTA. I understand it’s hard for your family, but she is a child. They could leave it at you not joining thanksgiving instead of taking the nuclear option, but the fact they went that way shows their true selves….", "I will never understand white people & this whole concept of a “half” sibling. Maybe because I grew up in a culture of unwedded pregnancies & baby daddies/baby mommas. I’m also confused on how anybody would care enough about the relationship between there mother & father to go as far as to completely stop talking to one. Maybe that’s because I can count on 1 hands the amount of times I’ve seen my parents have a conversation face to face. \n\nI say all that cause I’m trying this empathy thing this sub is always screaming about, but it’s very hard to. Dawg you got a little sister who got left for dead & at 25 you’re standing on business. \n\nNTA. Tell them to go kick rocks in the street.", "NTA. It's understandable that your mom and sisters don't want to have a visible reminder of how your dad tore up their lives, and don't want her at a family event.  \n\n\nBut it's unreasonable for them to be upset, given the circumstances, by you not attending said event. Claiming you are choosing May over them is unfair and turning it into an ultimatum is pretty immature.  \n\nYour friend is also wrong: It's not you going NC: that was your mother's decision, and she and your sisters are the ones making the choices here, forcing you into a corner. Your sisters are demanding that their own half-sibling be abandoned, potentially to foster care - which can wind up leading to placement in abusive environments - for their own ADULT peace of mind. That's reprehensible, in my book.", "NTA for being that good to\nyour little sister but YTA bc it’s probably really hurtful for your mom (as someone said “the personification of youk dads affair). You could easily let your sis with a friend or something 🤷🏼‍♀️", "NTA. That’s fuckin crazy. You took responsibility for your father’s daughter because he was just gonna abandon her. And everyone is taking out their emotions on a literal child. Not the grown man that did the action. wtf is even going on. I wouldn’t be able to deal with any of them.", "Nta She's a child and none of that drama is her fault. It's actually your mother who \n decided to go NC. You are doing the right thing even though it's hard.", "You did a wonderful thing taking that poor child in. I get your mom is angry at your father but this is an innocent child. A child that is legally your responsibility and soon will be your legal daughter. Your family cannot expect you to abandon your little girl because they are immature and cannot accept her. They cannot have it both ways. Either they have you in their lives with May or they don't have you in their lives. It is entirely their decision. \n\nYou are most definitely NTA. Your father is definitely the A and so are your mom and sisters for failing to recognize that this is an innocent child who is your responsibility now. I get that it is difficult for your mom to be around May, but she cannot expect you to abandon this poor little girl. She has been abandoned enough already. Sometimes we as adults have to look past our personal feelings and do what is best for the child. \n\nI am sorry you are going through this. Hopefully, in time, your mom and sisters will remember May is an innocent child who didn't ask for any of this.", "NTA. You're doing right by May, unlike your dad and siblings. It's understandable that your mom isn't interested but the fact is, May is your daughter.", "NTA. Screw your family and your friend too", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThroaway account because some friends follow my main and I don't want this attached to my main.\n\n\n\nI (25m) have three siblings (26f, 28f) from my parents (49f and 50M). I also have a half-sister (7f) I'll call \"May\" who is a result of my dad's affair. My dad had an affair with a woman in her 30s, whom I'll call \"Mary\". When my mom found out about the affair, they had a huge fight, and it wasn't long before we also knew about it. My two older sisters and I went no-contact with my dad, and my mom divorced him. Initially, I didn't want any contact with my dad until I found out he got his affair partner pregnant. So, for the sake of my sister, I decided to reach out to \"Mary\" and my dad. My mom and sisters didn't approve, but they couldn't really stop me.\n\n\"Mary\" developed cancer when \"May\" was around 6 and unfortunately did not survive because they caught the cancer late. After that, my dad didn't want anything to do with \"May,\" so I decided to get custody of her from my dad. \"May\" is now 7, and I absolutely adore this little girl. She's a little ball of sunshine despite everything that happened to her.\n\nWhen my mom and sister found out that I decided to take custody of \"May,\" they understandably went ballistic. But I told them it's my choice, she's my sister, and I'll take her in—I don't care if they like it or not. That shut them up quickly.\n\nNow, the issue at hand: My mom is hosting Thanksgiving this year and wants me to come because my sisters and their partners are attending for the first time, along with some aunts and uncles. I told her that if I'm attending, \"May\" will also be there with me—I won't leave her alone during the holiday. She didn't like that and told me she didn't want \"May\" there. I said then I won't be coming, and that's final.\n\nA few days ago, I got a message from my mom stating that if I'm going to choose my dad's affair child over her and our family, then I shouldn't bother contacting her ever again. I agreed. Now, my sisters are on my case, angry that I won't be coming and that I'm choosing \"May\" over them. I told them they're welcome to do the same as my mom did—cut contact with me—because \"May\" will always be in my life. Technically, I have full custody over her and will also officially adopt her soon from my dad. \"May\" is my responsibility, and I love that little girl to bits.\n\nI talked to my friend, and he said what I'm doing is unfair to my mom and sisters, and going no contact is terrible. I'm conflicted. I understand that they don't want anything to do with \"May\" since she is the result of dad's affair, but they can't expect me to leave her alone during a holiday. AITA??\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. None of this is May's fault. I understand that your mom is hurt, and your dad is clearly not at all a good person, but this is a *child* who has done *nothing* to deserve this venom.", "Nta\n\nEveryone in this comment section seems to be forgetting that his father betrayed him, in a far worse way then his sisters. \n\nMy father had an affair and it hurt me and my brother more than it hurt even my mother. Because our father died to us that day. \n\nHe is upset, he went no contact as well, but he decided to prevent generational trauma by standing up and having contact with his sister, and then even took her under his wing when his father abandoned her in the same way he abandoned him. Op is a damn Saint, his mother and sisters are taking out an old shitbags actions out on a little girl, which is pathetic.", "Cry to his dad about it.", "NTA \n\nShe wants you to leave a innocent child home alone that makes your mom a asshole", "NAH.  You can do whatever you want.  However choices come with consequences.", "Why do people always ask friends who inevitably give them bad advice? Forget your \"friend\" and stick to your guns. Cut contact with your toxic family if you must. They want to punish and innocent child for the sins of her father. They're assholes. \n\nNTA", "This is an opportunity for your mother to grow emotionally and she is failing in that regard.", "The father sounds very assholish to me. Twice so.", "Mom and sisters might not be assholes for saying they can't bear having May at Thanksgiving.  They crossed I to asshole territory, though, when they told OP that May should be abandoned or else they were cutting ALL contact with OP.\n\nEdited to fix typo, changing \"hear\" to \"bear.\"", "I just tried to imagine how I'd feel if my husband cheated and my son made nice with the AP, and my chest tightened up.\n\nI wonder if OP has old grudges against his mom or maybe wants to see how far he can push her.\n\nESH", "I doubt sincerely if mom and older sisters would be onboard for therapy like this.", "You could go with N A H (NoBodyIsAn Ah) or E S H (EverybodyIsAn Ah)", "They can't actually expect you to leave her alone.", "Referring to a kid as \"the personification of betrayal\" feels *so* gross and wrong. She's a *person* and she is *innocent* in all this.", "Why even post this. Useless judgement", "She is a 7 year old child, and now the mother’s grandchild, given OP’s adoption. She’s justified in having complicated feelings, but part of being an adult is recognizing the limits of those feelings and choosing to work through them for others’ sakes.", "Exactly this!  Your family is the one choosing their grudge over a child who is innocent in all this over you.\n\nThat being said - how do you have custody of a 6 year old child when they have a biological parent who is alive?  Is your dad not legal guardian?  I’m so confused.", "This.", "But to then go a step further and tell the son that if he keeps the kid he shouldn't ever talk to her again? Mom is definitely TA for that.\n\nOP is NTA", "May is 7 years old.  So the “betrayal” was at least 8 years ago.  May is innocent.  Mom needs therapy.  I have seen firsthand what happens when people remain bitter and don’t attempt to heal from a divorce.  It is not pretty.", "It sounds like that’s what he has been perfectly content doing so far - other family members are piling on him for that stance and telling him to abandon his sister. The mom and sisters are the one pushing it, he’s fine going no contact.", "You do realize that this is a *child* who is an *actual person,* right?", "Her half sister is also her family & no one seems to have a problem dumping her on the street for the crime of being born.", "Somebody is projecting their own insecurities\n\nWho hurt you?", "What do you mean?\n\nShe's a child, why is a child responsible for the crimes of her parents?", "Where did OP say he was white?", "The mother not wanting to be around the living, breathing proof of her ex’s betrayal isn’t her failing to grow emotionally. It’s her being a regular human being with understandable feelings.", "Yep, the dad is unquestionably an AH.  But I'm not sure anyone else here is.", "Exactly. They have the right to not feel comfortable beginning a relationship with May, but going NC with OP because of it is unreasonable. Especially since OP wasn't demanding May attend Thanksgiving, just that if she can't go, neither can he.", "But he is an A towards his mother, but he isn't towards his sisterdaughter.", "Exactly, this is why I hate when people refer to children that came from an affair as 'affair children '. It reduces then to their parents fuckups and it's dehumanizing.", "Why comment on my comment?\nUseless.", "Being an adult is also enforcing boundaries, even if it's to the detriment of your own son. \nHer boundary is healing and moving on from the betrayal her husband's cheating was. The end.\n\nHer son's choices aren't ABOVE her boundary. How sad it is, she has the right to choose her own mental health.", "Nope. Her child choosing to adopt the walking reminder of her husband’s betrayal doesn’t mean she has to work past her feelings and come to accept the child. It’s ok for her to set boundaries.", "From OP's post, it sounds like Dad has willingly surrendered custody of his child.  Which says a lot about what an ass HE is.", "No I mean that the idea that May is their brothers child is fresh.", "I understand that. But OP knows how her mom and sisters feel about everything. She honestly expects them to let her in and not be reminded of the affair?", "OPs mother has zero ties to May and shouldn't have to see a child that's a product of something that tore her family apart. If her sisters want to support mom that's their right.", "Well the fact that they’re  talking about Thanksgiving means their in America. That alone makes the odds high. They refer to “half sister”. That tells me they ain’t black. Sure they could be Latino or Asian but odds are they’re white.", "How is he an AH to his mother?", "So you know that posting nta/yta adds nothing to the conversation. Pick a side", "On yeah well the level of asshole of dad is disgusting for sure.\n\nHer whole family is gross.  She’s better off without them.\n\nAwful human beings.  What a sad, sorry group.\n\nAlso, @OP, I don’t think you should take her there even if they end up caving.  I don’t see them being kind to your sister if she’s there..", "Whether dad is an ass isn’t really relevant here…he is of course but the question is about OP and a 7YO child she has legal custody of and soon will adopt.", "The Dad really needs to get a vasectomy.", "He is forcing his mother to choose. \n\nYet he doesn't say anything about how confronts his dad or what his dad is forced to do.\n\nI'm the end, the mother (the cheatvictim) is the one losing her husband AND her son because of her cheat husband's choices. That's sad af.", "Mind your business and argue somewhere else :)", "I agree Dad's ass'osity is not relevant to OP's question.\n\nBut my response was directly relevant to another commenter's question of how could OP have custody of May while Dad is still living.", "He's not \"forcing her to choose,\" he's just not attending Thanksgiving. She's the one threatening to go no contact, she's the one forcing *him* to choose.\n\nOf course it's painful and sad and I definitely feel for mom, but she is still the one giving an ultimatum.", "The son is NTA.\nThe mother is choosing to lose her son.  She gave the ultimatum of never having contact again.  The son was just not going to Thanksgiving dinner.\n\nETA the child is completely innocent here, sometimes adults have to act like adults and grow the F up.", "Did you read the post?", "Don't post on a public forum if you don't want people arguing with you.", "He is. \n\nWhether you like it or not, by adopting her, he's forcing her around his mom. \nAnd she's not ready to do so, since the child is a personification of the betrayal she endured. \nIt's that simple. \n\nHe is harsher towards his mom that the actual deadbeat dad. And that's fishy. \n\nI have my opinion, you have yours and we clearly don't agree :)", "Or\nOr\nOr\nOr\nOr\n\nDon't argue with people about their opinion that don't concern you? It's creepy.", "Nah. Mom's not TA for not wanting May at dinner.\n\nMom is 100% TA for going no contact with son over it.\n\nIf she doesn't want May in her life then fine but all OP said was that he wouldn't attend Thanksgiving. Mom decided to throw a tantrum and go no contact.", "As opposed to leaving the girl to the system?", "Not wanting contact with the kid is fine. Anyone who doesn’t understand that the child is innocent is an Ahole", "Have you been reading the same post as me?", "I concede that he is, in the long-term, expecting his family to eventually accept May as his daughter, and that is a huge ask. However, it doesn't need to be black and white so early on. There is a third option here; for mom to say \"this hurts me and I don't know how I'm going to get over it or if I can ever accept May into my life. This could very well destroy our relationship.\" All of that would be totally fair and still lets OP know the gravity of the situation. Mom may still end up going no contact, but at least it wouldn't be a knee-jerk reaction. Besides, maybe there is middle ground to find, and they won't be able to do that if she has already given up on him. Then again, mom is human and her feelings are understandable. \n\nI guess I feel like if the choices are adopt a little girl he loves and lose mom over it or abandon a little girl he loves just to appease mom, and he chooses the latter, he'd be an AH to May and himself. I find sacrificing his relationships with his mom and sisters to make such a huge life change in adopting May says how important this is to him. Maybe that makes him an AH to his mom, but if he already sees May as his daughter, it's a sacrifice worth making... so I guess I can see putting him in the justified AH category.\n \nI do have one other question for you, if you don't mind. Can I ask where is he harsher towards his mom than his deadbeat dad? He didn't say anything insulting about her, he didn't even say she was wrong. I mean it sounds like he understands where she is coming from... or is just the act of adopting May that is harsh? Or that he didn't more overtly call out his dad for being an unredeemable AH?\n\n(Don't mind my over-involvement in this conversation, I'm spending my Saturday in bed, sick and bored 🤷‍♀️)", "I'm on a subreddit where a majority of the community argues about opinion. That's what we do here. You posted publicly, which welcomes other members of the community to agree or disagree with your opinion. This isn't new, and it isn't creepy. \n\nIs this your first day on reddit?", "The mom isn’t TA for going NC. It’s ok to have boundaries about who you have in your life.", "Everyone except OP’s dad and the girl’s mom is innocent.", "When will y'all realize we all have DIFFERENT interpretations of the same thing.\n\nY'all love to argue in people's comments and it doesn't make sense.", "He wasn't arguing about my opinion. \nIt was about my choice of judgement. \n\nThis is the end of this conversation.", "No, I’m just wondering where does it say that he’s forcing his mother to choose?", "And your choice of judgement would be....... your opinion.", "A he is right, useless judgement.", "You are insufferable, and an idiot", "NAH. \nWhat you’re doing is great for this little girl who has lost her mother and has a (I can only presume) emotionally damaged father unable to care for his kid. Which is what she is. You don’t wanna leave her alone. strong and mature of you. Parenthood didn’t come to you. You heard it’s call and your it’s champion. \n\nSo why NAH? \n\nThat child is blameless. But your dad is the AH. And that’s all your mom and your sisters see her as. Your dads failure. They’ve taken their stance about that. And you stick to your guns. I can’t denounce your mom for not embracing her. \n\nYour dad should be raked over hot coals though.", "NAH. It’s great you took her in. It’s kind of wild to just expect your mom and sister to be okay with it all.", "In this day and age its entirely possible to self publish a work of fiction - I’m not sure if posters on this sub are aware of that, or maybe they use this sub as a practice ground to hone their skills before taking that leap", "NAH except your dad.\n\nEveryone's feelings is valid in this case, I understand you but I also understand your mom. She owes nothing to this little girl who must be a very painful reminder to her. You decided to step up, it was your choice and I'm glad May has a good home. It's great you're taking your new responsabilities seriously. But you can't force your decision on your family. And I understand how from their perspective it sounds like you're picking one sister over two other sisters and your mom.\n\nYou're just all caught up in a messy situation your dad created.", "NAH\n\nYou took her in and that was very generous of you. But you have to see it from your mom’s point of view as well. While it isn’t May’s fault, she represents the destruction of her marriage and family. Your mom is allowed to have feelings as well. And she is allowed to make a stand that she doesn’t want to spend the holiday being constantly reminded of her husband and his mistress.\n\nYou took her in which was very kind of you. But you knew there were strings attached to that decision. You knew the risk that you may be giving up your family for her. You are not TA but you have to respect that they are allowed to have their feelings as well. Just because you made your decision does not mean they have to accept it and be okay with it.", "Honestly I think NAH..? I can't call you an AH for not wanting to abandon your sister, who you're adopting, on thanksgiving. \n\nThere's also no way I can ever call your mum an AH for not wanting the representation of the breakdown of her marriage and family to start rocking up at family events.", "INFO: You're well within your right to adopt your half sister as you are an adult but I feel like there's some points missing from your post.\n\nWas there ANY discussion about your plans with your mother and sisters regarding tour plan to adopt her beforehand? Not for any type of permission of course as you don't need that but just to at least clarify how the family dynamics will be moving forward with you essentially adopting your dads affair child.\n\nIt just seems to be that you have very little regard to the feelings of your mother who was cheated on and traumatised from the betrayal and also your sisters who were also traumatised by the breakdown of their family. So I'm wondering if you had prior relationship issues with them?\n\nAgain go ahead and adopt the kid and give her a great life but why on hell would you think your mother and siblings are obligated to feel open to being around her just because you made this decision?", "NAH Except dad and potentially afair partner (they may not have known for all we know)  \n\n\nUnfortunantly, there is no easy way to handle this. You had a choice to either permanently damage that child, or permanently damage your mother. That's it. Those were the two choices. As hard as it is to say, either way you would lose one relationship. But you just made a choice, and that choice shapes the entire future bond with them both.   \n\n\nYour sisters and mother are understandably not ready to let go of the pain the affair child uncontrolably causes. Your sisters may one day come around, but your mother will never let go of this. And she shouldn't have to. Not only did her husband cheat on her and have a child, but now her own child is chosing the bond with this kid over being by their mothers side through a very terrible thing. Your mother has every right to be hurt and feel betrayed by you. On this, she is not an AH. Your sisters also aren't for supporting their mother.  \n\n\nBut you are not an AH for not wanting to forever damage a child who had no control over being born. Infact, it's very sweet of you to take in your sister and be there for her through the hate she will have to endure as the product of an afair.   \n\n\nUltimately, it's just a shitty situation to be involved in. Neither choice was going to be easy and both were gonna hurt someone. Your mother is an adult, she knows how to cope and knows how to deal with these things. The child is too young still to fully comprehend it all. She needs someone protecting her still, and it's great of you to step up and take care of her.", "You’re not going no contact with them. They’re going no contact with you. You’ve made clear that you’re open to a relationship with them, but that they can’t exclude your daughter. You’re not the barrier to a relationship here, they are. NTA. Your dad sounds like a monster, and your mom and adult siblings aren’t much better. Kudos to you for turning out a MUCH better person than they’ll ever be.", "Very difficult, I'm actually torn between NAH and ESH.\n\nLook, it's a wonderful thing you have done, taking in your sister and your mother and sisters do not have the right to demand you leave her alone or abandon her, but, from the tone of your post, I don't know if you haven't made things worse than they needed to be.\n\nYour mother has every right to be devastated, and May is a walking, talking reminder of that betrayal. And now through you she's never going to be able to move past that. Every time she see's you with May it will cut her to the quick. And if you forgive me, you attitude isn't helping.  You seem to have absolutely no understanding of your mother's feelings, or even want to give her room to adjust.  Instead of telling your mother that you were taking her in whether they like it or not, did you take the time to explain that you felt a duty to care for your sister? That you didn't want another innocent person to suffer for your father's selfishness, did you even acknowledge the pain you were causing your mother? Even inadvertently. It's amazing what showing a little understanding for other people's views and situation can do.\n\nSame with Thanksgiving. Frankly, you should have turned your mother down immediately, but gently. Stating that this year it wasn't possible, that you were helping May to adjust and that you didn't want to put your mother through any stress by coming since you couldn't leave May (you could also have gotten a sitter for a couple of hours on another day and spent some time with your mother, just to show her that you love her and acknowledge her pain.) Instead, you just delivered her an ultimatum, and when your mother reacted with an ultimatum of her own, it all escalated. Again, giving people space, time and understanding instead of demanding they do things your way can work absolute wonders.\n\nI also think you need to acknowledge to your mother that you have hurt her. You don't need to apologise, because you are doing nothing wrong, but sometimes even doing a good thing can hurt people, and acknowledging that costs nothing but would let your mother know that you understand, and that while it's not something you ever wanted to do, you feel it's the right thing to do.", "Your poor mum.  Her husband’s betrayal literally thanks to you became her grandchild.  Can understand her stance on the matter \nYour sisters I can under their feels as well\nAs I can understand yours and what you did was fantastic \n\nYour dads an asshat completely \n\nAll actions have consequences and some of them hurt    Your mom seems to be still very much hurting and you also  gotta understand she’s just as much of a victim in this as may", "Nah except for your father of course", "Esh.  I'm trying to wrap my head around the logic of you, 7 years ago, becoming friendly with your dad who broke up the family, and his affair partner.  Like what on earth possessed you to do that?\n\nYes May is innocent and all of this, but so is your mom and your sisters. They didn't choose to cheat and break up the family. That was all on your dad and his affair partner.  And I'm sorry, but you asking your mom and expecting her to be fine with may being around is hilarious.", "nah. Jesus Christ Reddit is wild. You’re not wrong but personally? Would never betray my mother like that and I don’t even like her that much. Nor would I want my brother to be a part of the “family” if he did either. And no the mom and sister aren’t assholes for not wanting the affair child around them. but don’t complain about them not wanting contact because of this. You made your bed now lie in it.", "May's creation is not her doing, yet she bears the stain of her start. Did you have to adopt her? Was there no one from her mother's family that could take her in? You did this knowing it would cause your mother concerns.  You are your fathers son, only think what would be best for you, not family. YTA", "NAH - I mean you had to know this was going to be the outcome when you took in your sister.  Did you think that somehow you being responsible for her was going to magically accept her as family? You chose her because you love her and that's great but just because you made that choice does not give you the right to force that choice others. Choices have consequences and you decided to trade your sister for your other sisters and mom.", "How did you get custody and take care of a child at 18?", "NTA.  That said, INFO-Does May not have relatives on her mother's side?  It seems like this would be a good opportunity for her to spend time with them.", "For me, this is a NAH situation. Imagine your mom who was betrayed by her husband and now her son. But May is also part of your life now so that is understandable. Your dad is the awful person here who is getting scott free and again is able to hurt your mom.", "NTA, not even your mom. The only asshole here is your dad for cheating and breaking up your family. His affair partner is also an asshole unless she truly had no idea that she got involved with a married man. You don't provide context about AP so it's hard to make a call there. But your dad? There's a special place in hell. To cheat, lie, impregnate someone else, then abandon the child after her mom dies? Pure asshole.", "NTA - You’re basically May‘s dad. And even though I understand them hating your father and what he did, this little girl has absolutely no fault. She had nothing to do with this, she didn’t ask to be convicted as an affair baby.\n\nSo tell them you don’t chose „your dads affair child“ - But your sister, whom you’re a dad to, and who has absolutely nothing to do with this shit. She already lost both of her parents, she had it worse than you and your sisters on both fronts, and you won’t allow anyone to hurt this little girl any further. You won’t fail her like her parents failed her, and like your parents failed you. You’d never do that to her what your parents did to you, and your father to her.", "Nta. Your mom, sisters, and friend are. Your mom went through the consequences of the affair and moved on. It’s not this girl’s fault she was born, dad is an A h, and mom died. This kid has been through it!!  \n\nIf your mom and sisters can’t be adults and treat this girl as YOUR DAUGHTER through adoption, that’s on them. They are grown ass adults who are telling you your child is not welcome in their homes. It would take time to change their way of thinking, but no one should’ve ever blamed the kid in any of this from the start!  \n\nEveryone can hate dad all they want. You saw a little girl in need of love and you stepped up like the most decent person possible!  If your family wants to cut you out for that, they don’t deserve you in their life!  And your friend is just as bad!", "NTA. You are a wonderful and warm person. I understand your family are unhappy about the circumstances giving rise to May's existence, but is not her fault. She's a child, FFS! Maybe instead of NC, go LC. \n\nIf they won't come round to May attending, maybe you could invite some of May's friends and family over to your place? There's more to family than DNA.", "NTA and good for you. We don't choose our parents and we have no control over their decisions and how we were made. \n\n'May' sounds like a beautiful addition to your life your family is missing out, by their own choice, and that is awesome you are making sure she spends the holiday with any family. \n\nI'm sorry your family is chosing to act like spoiled bratty teenagers over a sweet child. I hope you have a wonderful thanksgiving!", "NTA\n\nThey're pissed you're calling their bluff...\n\n\"well, if you don't leave her home, it's better we never speak again...\" \"i agree\" *surprised Pikachu face\n\nThey have all the rights to never want to see May again, as is their choice, but that comes with consequences they don't want to accept... In Italy we say \"wanting the wife drunk and the barrel still full of wine\"\n\nDrop mom and her flying monkeys, they'll make Thanksgiving miserable for both of you otherwise.", "NTA.  That poor child had no one and you stepped up and took her in when your Dad was an absolute asshole.  I understand your mom and sisters' anger but May is innocent and they're taking out their anger on her.  Thank you for being there for May.\n\nYou should order dinner for the two of you a few days before, spend the day watching the Macy's parade and movies and drinking hot chocolate.", "NTA my dear, you are an amazing person. \nSad your mother will hold a child accountable for what adults did smdh \n shame on your sisters as well. \nYour friend needs to shut it.", "NTA. How are you going to find childcare ON THANKSGIVING?!?!\n\nYou aren’t “choosing” May over your family, they’re choosing to take out a (rightful) grudge against your dad out on a defenseless child who did nothing to wrong them and had no agency in the circumstances of her birth.\n\nIf your family wants to disown or cut contact with you for being that little girl’s only place of stability in her life, good riddance to the trash.", "NTA. \n\nDon’t listen to your friend, because he’s wrong. As for you, OP? You are an amazing big brother/soon to be dad for stepping up when May needed you the most. \n\nI do understand the feelings of your mom and older sisters, but they are wrong too, because they’re taking out their anger over your dad’s affair on an innocent little girl. Shame on your dad for the affair and for turning his back on May. \n\nYou are an outstanding human being, OP. This internet stranger is proud of you.", "NTA\nWhat you are doing it is just beatiful. I admire you!", "Good for you OP. Breaks my heart for this little girl that a bunch of adults are failing her so fucking constantly. Keep being a great brother to her", "*<I talked to my friend, and he said what I'm doing is unfair to my mom and sisters, and going no contact is terrible.>*\n\nBut that is what THEY chose to do, as they want nothing to do with OP's soon adopted daughter. THEY gave that option to OP: \"loose the girl or loose us\" Friend should tell siblings and mom that they are terrible.\n\nI get they don't want to see the affair child. N A H for that.\n\nBut insisting OP joins the festivities and leave the child 'home alone'. They are T A for \"Macaulay Culkying\" the girl.\n\nThe biggest A H is OP's father for cheating on his wife and then turning his back to his own daughter\n\nNTA for standing up for this little girl and spending Thanksgiving with her.", "NTA.\n\nMay is only 7 and is the innocent here. The adults in your family shouldn't be punishing her for your dad's actions: she didn't choose to be your \"dad's affair child.\" I admire you for taking her in and hope everything works out for you both.", "You are wonderful and amazing OP!!!  The people in you life are AH tho.  NTA", "NTA. She is just an innocent child. You’re a saint, and I hope she and you have a wonderful life.\n\nShe may be an affair child but she didn’t choose that.\n\nYour mom is understandably hurt and angry, but to cut you off is extremely nasty and bitter.", "This is such a hard situation. NTA. \n\nIf something happened to my dad and step mom I would definitely adopt my half brother. My dad did cheat but my half brother is not an affair child so I think it would be easier for my mom to swallow. She would definitely feel a certain way about it but I can't see her cutting contact with me over it. That seems rash.\n\nMaybe given enough time your mother can make peace with your decision and come to understand it. I don't necessarily think she's an AH per se. Just really hurt still and putting blame in the wrong place.", "NAH, OP, but don't be surprised if you find yourself suddenly getting less than your share in the inheritance", "It isn't your half-sister's fault your dad sucks. While it's understandable that your family does not want a reminder of your dad's behavior around, I think it's wonderful that you care for her, especially when her father doesn't. She's also a victim of your father's behavior, and I'm very glad that she has someone around who will love and care for her.\n\nI don't think you or your family are being assholes in this situation unless the actual discussion wasn't amicable. They're within their rights to exclude someone, but they also need to accept that your sister is an important part of your life and understand that if they cannot be around her, you'll naturally be around less.\n\nKeep doing your best. You're doing great.", "NTA.  Screw your mom and sisters for doing that to you and you should get rid of that friend cuz clearly they don't have tour best interest in mind.", "She didn’t ask to be born and the sins of your father shouldn’t be held against her.\n\nF everyone in your family.", "N6ta- You need new friends. Your family made that choice for you. They have that much resentment on a child that disnt ask to be here. I'm so happy and glad she has you. I am sure you both will have an amazing holiday just you two.", "NAH  (except for your dad of. He is a MAJOR asshat! ).\n\nI understand your mom and sisters, and I also understand where you are coming from. \nUnfortunately, it looks like a no-win situation.\nBut May is lucky to have you ❤️", "NAH", "NAH - I think what you did was incredibly admirable, but your mom’s and sisters’ feelings are also valid, too. It looks like you’re willing to let your relationships with them go which is an additional betrayal to them when they did absolutely nothing wrong. The real AH here is your dad for the affair and then throwing his other kid away once the younger affair partner died.", "So the dad cheated had a baby who the op got in contact with made friends with he chose the ow way before she died I'm sure his mum is gutted", "Willingly becoming a single “dad” to your dad’s affair kid and choosing that kid over your family is definitely bizarre. The family is in no way wrong for not wanting to see or support the affair child. I wouldn’t want to see or hear about it either. YTA.", "You are a custodial parent in the midst of an adoption. Traveling without your child is not going to happen - ever.\n\nIf you mother and sisters cannot understand this basic fact, it's their loss in maintaining a relationship with you and meeting the ball of sunshine who is innocent of all the drama that led to her birth.\n\nYes, Mom might feel awkward, but that's hers to deal with. Your sisters really are just parroting your mother (they probably feel it's in solidarity, but at the end of the day, it wouldn't hurt them).\n\nI disagree heartily with your friend's take on the situation.\n\nEven if you do get invited, if they are rude or mean to your sister/daughter, you would go LC/NC I would think.\n\nNTA", "NTA you are a beautiful human being.", "NTA. Kids are never at fault in cases like this. I'm glad you see this even though the other adults in the family don't. I hope May can make many happy childhood memories.", "For me YTA, sorry, don't come after me.\n\nYour mother and siblings are experiencing DOUBLE BETRAYAL. First, from the man whom they loved as a partner and as a father.  Second, from a son and a brother.  It's so harsh!\n\nI don't know why did you decide to get custody of the little girl when it was going to create such a hard situation for your own mother? For me, making my mom hurt is the last thing I would like to do in this world.\n\n And one last question, where's your half-sister's mother's family?", "YTA. Not for not wanting to abandon the child during the holidays, but for consistently making choices to distance yourself from your mother and sisters. Not only did you befriend your father's AP, you also adopted the affair child and expected YOUR MOTHER (the woman that your father cheated on and had a child as a result) to be OK? You consistently and obviously betrayed her just like your father did and you're delusional enough to expect her to welcome the living, breathing reminder of that betrayal into her life. Your mother's reaction was the result of you slapping her in the face with your choices repeatedly. It wasn't sudden, you and I both know that. There were no other alternatives for the child's care? Can you honestly tell me that if you were married & your wife had an affair that resulted in a child that you'd welcome that child with open arms? BFFR, OP.", "NTA. You have become this little girls world. She is at this point **your** child. Any other kids you have will be her siblings. You can't abandon her nor would it be sound to ask any other parrent to abandon their kid.\n\n>I talked to my friend, and he said what I'm doing is unfair to my mom and sisters, and going no contact is terrible. I'm conflicted.\n\nWait wait wait let's rewind that shit. You didn't decide to go no contact with your mom. She said \n\n>I got a message from my mom stating that if I'm going to choose my dad's affair child over her and our family, then I shouldn't bother contacting her ever again.\n\nShe put it out there and you said fine. She decided to go no contact with you or at least thought the bluff would work. This is on her. This is the world **she** made. Ain't it grand.", "NTA. \nYour mother said not to contact her again and you said fine, and now she's mad? She made a shitty ultimatum and you called her bluff.\nHelping your sister, whose mother just passed and whose father doesn't want anything to do with her, is very noble. I'm glad she's got you in her corner, because she didn't ask for her situation to be this way.\nAlso, tell your friend to stfu, too. You didn't ask to go NC, your family did.", "\"I sat with my anger long enough until she told me her real name was grief.\" C.S. Lewis \nHopefully one day the mother can see that she and the 7y/o are both grieving the life they thought they would have and stop seeing the child as the reason her marriage ended. It's truly a sad situation all around. NAH. Thank you for showing this innocent child the love she deserves.", "NAH.  You are a good brother and I completely understand why your mother feels the way she does.  That said, you are doing the right thing.  Tell mom you understand and that you love her and want to be a part of her life but that you also have to take care of May and that is the right thing to do.  We all wish you both the best and hope in time you and May can have a better relationship with your family.", "Controversial NAH. What you're doing for May is very upstanding. Your father could learn some lessons from you. For your mother and sisters however may is a living symbol of your dad's infidelity and cause of the destruction of the family. Asking them, especially your mom, to accept this child into their homes and hearts is a tall ask which they are prepared or willing to do.", "Accept that your decision is the best for May but the worst thing you can do to your mother and your sisters are 2 ideas that can coexist. The fact that it was quite easy for you to sweep under the carpet that your father cheated your mother and left his mistress pregnant, does not mean that your sisters should act the same, much less your mother who was and continues to be the most affected by this situation. \n\nYour decision benefited May and deeply hurt your mother and because of how you have ignored her feelings since you found out that you would have a sister, I don't think it will affect you not having contact with them. \n\nWhat did you expect? That adopting May would make your mother magically forget that that girl is the daughter of her unfaithful ex-husband? Did you want her to be his grandmother?\n\nEvery action has a reaction, every decision has its consequences, it's time to face it.", "ESH. your dad had an affair that resulted in a child. The pain and betrayal of that is unbelievable for your mother. Being anywhere near that kid must be insanely difficult for her. You're an asshole because you seem to have absolutely no compassion for her at all. I get the sense of a \"suck it up\" feeling from you. Heartless is the word that comes to mind.\n\n\nOn the other hand you can't leave a kid alone on a holiday. I wouldn't expect you to go and telling you to not contact her again is over the top. In all reality adoption would have probably been the best option for your family here. A kid like that will almost inevitably be an outcast in the family, and you kinda strong armed her into a shitty situation by adopting her. What did you think was going to happen here?", "At this point, May is *your child*, so by choosing her, you *are* choosing family. I'm sorry your mom is in a rough spot, but when the choice is to accommodate the trauma of the generation behind you or to ensure the wellbeing of the generation after you, kids win. Your mom doesn't have to invite someone she doesn't want in her home, and you absolutely should spend the holiday making sure your kid feels loved and wanted and is making good memories. NTA for staying home.", "I was May at one point. NTA. Keep her away from those people because I know how hurtful being excluded and ostracized by adults can be and May doesn't deserve that. She already lost her parents. NTA!", "I mean slight YTA that affair child kinda did break up the family", "NTA- you saved that little girl when you opened up your heart and your home to her and you should always be proud of yourself for doing that. The fact that your mother and sisters are getting upset about this is selfish, cruel and stupid and they should be ashamed of themselves.", "YTA, of course you’re not ta for adopting your half sister, and not wanting to leave her on holiday. But you’ve been disregarding your mother’s feelings for a very long time, I don’t understand why you were so desperate to be in May’s life That you reached out to your cheater dad and his mistress, at that time at least, there was no need for you to do so, even May didn’t needed you And you knew doing so would hurt your mother and sisters, “they didn’t approve, but they couldn’t stop me” You had absolutely no regards to their feelings, or well, them. And yeah, she’s basically you’re daughter now, so it’s understandable that you’re ok with the family going NC with you, But it really seems like you never cared for them ever. \n\nPlus the incident, yeah your mom can’t expect you to leave that girl, But you also can’t expect her to have her in family gatherings. You could’ve just declined, like you took absolutely no efforts for this conversation which is understandably hard.", "NTA. I can understand your mother's and sister's discomfort, but it is entirely on them if they choose to end their relationships with you because you refused to let an innocent child be neglected or end up in the foster system, because of circumstances entirely beyond her control.", "NTA.  0 of this is May's fault.  I can't fully blame Mom for not letting go of the grudge bbut cutting you off from your family over her hurt feelings is over the line IMHO.  hopefully she'll grow up at some point and get over herself and begin to be gracious again.  even if she doesn't, you did what was necessary to keep that little girl out of the foster system so good on you.", "NTA. May is innocent and you are doing right by keeping her away from people who might be mean to her. Your mom may have been cheated on but this little girl lost her mother and her own father has rejected her. How anyone could stay so self centered under these circumstances is beyond my comprehension. \n\nMy dad also cheated and he ended up having a kid and leaving my mom. That kid is now my sister that I love dearly. Despite it hurting, my mom allowed us to have a relationship with her because she saw how it made us so happy to be with our sister and stepsisters.", "NTA. I thought that was going to go in a completely different direction. That child had no one else and it's not her fault that she's the result of an affair.", "NTA by any stretch of imagination. I understand your mom having reservations about being around May, but May is basically your daughter now. So you chose your kid, who has done nothing wrong, over people who at least act like they hate her, if not truly hate her. That’s being a good parent", "Nta\nYou are choosing to adopt your half sibling.  There is nothing wrong(and much good) in that.\n\nTheir feelings are understandable.  But the no contact is Their choice.  What does your friend expect you to do?  Abandon May for night?  Permanently?.\n\nAt this point if you family wants to have a relationship with you, they need to accept your \"daughter\".\n\nRepeat after me, this is their choice.  They are adults who need to manage their own feelings.  \n\nThat said if there is future interaction.  Stick to supervised only until you are sure they won't abuse child(emotionally).", "NTA- Nothing you've done is wrong infact i commend everything you have done. The fact that they can't separate what two adults chose to do & a child is sad. Enjoy your holidays with your child, if your family can't take their heads out of their asses you and May dont need them and she shouldn't be subjected to them. It wont be healthy for her.", "NAH. You have done a wonderful thing. But it's understandable how hard this is for your Mum - and by extension your other siblings. May is a reminder of her marriage breakdown, the hurt she went through and it must be painful. Don't turn your back on her. It's going to be very hard for everyone, but you need to accept that people are hurting. Don't cut your family off. You are right not to leave May on a holiday, but find a way to spend some time with your Mum without her.", "People frequently find themselves upholding toxic values at the expense of everything. Your friend is a dick too. You can go no-contact with whomever you want, especially when those that are being cut off are dicks to kids. I don't care that your sister is an affair baby. She's an affair baby with a dead mom and a deadbeat dad. If your mother can't find some empathy in her heart for a child who has suffered that, then she is morally bankrupt. What you have done keeps this child within the family of origin, and statistically speaking, that matters quite a lot. OP, your choice is not one many would make, but it is in the best interest of your sister. I have been no-contact with my father for 6 years. There have been very many difficult emotional times, but the one thing my children, husband, and I have is peace. That can't be undervalued.", "NTA - You are in the process of adopting this child which will make her your child. While this may be difficult for your mom and sisters would they ever leave their child alone for the holidays at this age? When all is said and done May is as innocent as you, your mother and sisters. It was not her choice to be conceived the way she was.  However, if this is the way your sisters and mother plan on treating May then you are best not having them around her.", "NTA OP, are the circumstances around May’s birth uncomfortable for your mom and sisters? Absolutely. But that doesn’t change the fact that she was not here to make your dad and ap fool around and have her. That was entirely your dad and Mary’s decision and their decision alone. May herself is an innocent little girl who has absolutely no fault in her parents decision to do what they did. And it’s incredibly cruel to treat May the way they are when any angry should be directed at the actual responsible party, the dad", "NTA. There is absolutely nothing unfair about what you are doing.\n\nMay is and has always been an innocent soul in this. Still, not everyone can open their heart to someone who reminds them of an affair that broke apart their family. It is a special heart that can take the risk on getting to know that innocent someone, begin to see them just for who they are (and not always see the past affair), and fully love and open their heart to that person.\n\nMay may have been the product of an affair, but she is NOW essentially your daughter. You are not asking your mom or siblings to develop a close relationship with her (though it would be nice if they could see May as your daughter and let her into their hearts). You are only asking them to (1) not exclude her from a gathering that includes you and (2) treat her with common decency. That is absolutely not too much to ask of them.\n\nIf you do want offer them an opportunity to salvage family relationships, you can ask them if they would be open to joint family counseling. To at least try to get to something good. It may be more than anyone is open to; even if they are, it may not be effective. But I would hate for you to overlook that one positive possibility.\n\nThe alternative is exactly what you are saying to them. You will not attend a gathering without your daughter. If they feel the need to cut you out of their lives, that is their choice. But there is no chance you will abandon your daughter. Your dad was a poor husband and is an even worse father; he spoiled a lot of lives. But now your mom and your siblings are choosing to spoil even more lives in their anger and bitterness toward your dad. Thing is, your dad could care less.", "You're literally the only one in your family who isn't the asshole. Your mom and sisters chose to cut ties with you, not the other way around. Also, your dad abandoned every single child he has ever brought into this earth. Personally, I wouldn't blame or chastise you for not taking May in. I do, however, commend you for doing so. The circumstances of her birth are not her fault, and punishing a child for simply existing is cruel. Glad you have May's back, and sorry that the rest of your family sucks.", " I can understand your mom and that side of the family not wanting your half sister there, a reminder of your father’s misdeeds, but at the same time she’s completely blameless in this and it’s really harsh of your mom to want to cut all contact with you over this. NTA", "NTA - you are doing what all of your family are failing to do - focusing on the needs of a child.\n\nA 7 year old motherless and pretty much fatherless child\n\nYou are choosing humanity over hate.", "NTA … bless you and your wide open heart.   The world could use more people like you.", "NTA-My cousin was the result of an affair. He refers to his dad's two ex wives (because he has half siblings with both of them) as his step mom's. They never hated him or would not allow him to come over because his dad couldn't keep it in his pants. The fact your mother and sisters are being that way towards a child that had no choice in the matter is downright despicable. Hate your dad all you want, but don't take it out on a literal child. That's atrocious, childish, and just fucking shitty. Honestly, I'd give them all an ear full.", "Absolutely NTA, that (amazing) little girl did NOT ask to be here, she did not ask to born as a result of an affair, If your mom is going to be disgusted with anyone it should be your father. HE made those choices and to hold a child responsible for the choice their parents made is absolutely disgusting... I hope everyone gets their due karma for this one, YOU ma'am are an absolute amazing human and if anything your mom and sisters should TAKE NOTES on how to be better humans... I applaud you 👏👏👏👏", "May didn't ask to be in this world. Thank you for being a stand-up human being, having integrity, and doing the right thing by her. She's lucky to have you in her life.", "NTA  Family is who you choose to love and respect . If more people had your morals and courage the world would be a better place.", "NTA good for you this is a sad turn of events but you seem to be the only stand up person in your family I’m glad you chose to be there for “May” she’s innocent in all this and deserves to be loved", "NTA. Hope your family aren’t religious hypocrites too", "NTA. What exactly do they expect you to do? May is your daughter.  Were you supposed to leave her alone with a TV dinner?  May needs you, your family needs Jesus.", "Nta. You are a wonderful human. I'm proud of you for adopting your innocent sister.", "NTA, and I don't understand the n a h votes. Anyone who can be so cruel to a 7yo who lost her mom to cancer and had her dad abandon her is definitely an AH. She's a fkin child, she didn't choose this life, and now someone is trying to pull the only person who cares about her away. Mom in this story is definitely an AH.\n\n\nI am extremely impressed with your resolve, maturity, and your compassion. We need more people like you in this world OP.", "NTA - good on you looking out for someone who has been dealt a tough hand.  Blaming the child isn't the answer and the mom and elder sisters should grow up....", "NTA. Your mom is the one choosing to go no contact, not you. Same with your sisters if they choose to do so", "NTA. You're a great guy, OP. I hope your family heals one day.", "NTA- Drop that \"Friend\" too.", " NTA - May has done nothing to your mum and sisters, I get being angry about her existence but she didn’t ask to be born! And your dads actions towards the child, who has just lost her mother, is proof of how awful he is. Id expect your sisters and mother to be embracing May and putting a united front against your dad. But either way they’re being unfair and if they want to cut you out for being compassionate then they’re the problem. Good luck with the adoption ❤️", "Absolutely not am asswhole!! I think it’s great you stepped up and took her in!", "NTA. Wow you’re truly an amazing person. None of this is May’s fault. I understand it may be awkward for them but they are the ones that chose to cut contact and you have accepted that. When you said you couldn’t attend thanksgiving, they should have said okay and kept it at that.", "NTA - you’re a wonderful big sister and she is so lucky you’ll be stepping in as her mum.\nYour family needs to get over themselves- a 7 year old is not to blame for adults mistakes. They’re huge AHs. Good luck to you and May!", "NAH. You’re doing a great thing by taking May. But also, she probably brings up some horrible memories for your mom and siblings. You’ve got to realize, your dad tore your family apart and hurt them so badly that they never wanted to see or speak to him again, and yes, she’s an innocent child, but she’s also a huge walking reminder of that. They don’t have to want her there and if neither of you can compromise, then so be it.", "NTA. You’re an absolute hero. The rest of your family can go fuck themselves.", "NAH expect for your father\n\nYou have every right to put your half sister first especially when she’s all you got, but your mom has every right to not want to be around her. You cannot expect your mom to be okay with a product of her ex husband’s affair in her home. I would be the same way if I was in your mom’s place….", "NTA. She is legally your adopted daughter. You are responsible for her now. She can't just be a thing you drop at holidays for family. She is your family. You are a package deal now until she is an adult or old enough to decide whether she wants to come or not. Yes it is hard on your mum but your mum has a choice she can accept her as her daughter's child or she can't. If she can't that is fine. But she has to accept that as a mother you can't just drop your daughter for the holidays. If she wants no contact because of that then give her no contact. If your sisters can't accept it either they can choose if they want to go no contacy or not.i am a firm believer that family is something you can choose to create and it doesn't have to be about related by blood. So go build a family with your daughter and give her a family full of laughter and love.", "NTA", "NTA\n\nThe circumstances of this little girl's existence were not her doing. She did not choose how she came to exist. She is a literal child, innocent of the drama your parents and hers created. Your mother and sisters need therapy. Their issues are with the man that created her, and they should not be punishing a child for the actions of a grown man. \n\nWhat you are doing is absolutely right. Don't doubt that for a second. If your friends are making you doubt that, you need new friends. Your responsibility is to the health and happiness of that innocent little girl, not the grown-ass women around you who feel threatened by the presence of a child. Not only did that little girl lose her mother at such a young age, but she was then abandoned by her biological father. She needs you far more than your mother and sisters do.\n\nI would continue to go no contact with them and not think twice about it. They need professional help to work through their trauma. Praying they get the help that they need and that you two have a lovely Thanksgiving.", "NTA. You are a hero, IMO", "NTA so basically May is your adopted daughter and they refuse to have her in their house for holiday events?", "NTA.", "NTA. It's sad how many people don't realize what an AH your family is, and I mean everyone but you.\n\nThis is not the same as not taking in an affair baby, your Mom was actively trying to force the child to be an orphan or be abandoned by your dad. Anyone who thinks that's okay needs to look themselves in the mirror and ask why they agree with someone intentionally harming another innocent person.\n\nEven if the affair and break-up of the family was painful, anything could be a reminder if you let it. The Mom is martyring herself, pretending her pain should take precedence over her child's choices. Again, the Mom is fine to say that being around the child is too painful, but constantly guiilting OP about him trying to help out an innocent is gross.", "NTA, but your family is...well, AHs. Your dad is obviously an AH, but your mom and sisters are AH for punishing a child for how she was born when she can't control that. May is now your dependent, not just your sister. You are her defacto parent. If they wouldnt disinvite your bio child, they don't get to disinvite May, at least not while expecting you to abandon her for the day. I understand your Mom is hurt, but as an adult, she should go to counseling so she's not taking out her anger at your Dad on a literal child. Your sisters too", "People want you to pick grown adults over a seven year old child who has done nothing wrong and has nobody else?", "NTA - You didn't choose no contact, ***they did*** when they decided to exclude May and punish her for something over which she had zero control.", "The mother obviously feel betrayed, and not just recently with the adoption. This has most likely been festering for years unaddressed with anything but dismissal (yes from OP it seems). It really was a betrayal to begin with by choosing to seek out a child relationship that OP absolutely didn't even need in his life nor was obligated to, especially knowing it was at the massive expense of the family he already had and had already been betrayed so badly. Mother probably feels like her pain (and thus her) never mattered to OP, and that can take people to a cold and dark place many do not come back from. In that regard YTH, to a MASSIVE extent.\n\nMother is NTA for the ultimatum of complete NC, the betrayal of her son and not prioritizing his family in the least is more than enough to go NC. OP is the asshole for starting the relationship to begin with and would be with any attempts to bring her into the greater family. Their father betrayed them, and OP didn't prioritize their immediate family and their intense and continued suffering. Had OP stayed away (an easy task), none of this would have happened. OP is fully responsible for this and should have seen this coming, only an idiot wouldn't. \n\nConsequences for actions good or bad, right or wrong, but this was entirely foreseeable. OP is in many ways an absolutely fantastic person and the kid is lucky to have them, but at the very beginning he threw his family under the bus for selfish reasons because HE wanted a younger sister. Op is a shortsighted fool to not see this coming, for betraying his family needlessly, and needs to be ready to accept the consequences of being a horrible son. He is an amazing sibling to a child he never needed in his life, but a horrid son and sibling to those family he already had.", "You might be able to forgive your dad enough to take custody of his affair baby however, it really is stabbing your mother in the back IMO. That child is a constant reminder to your mom on why her marriage fell apart. Obviously, your sisters feel that the same as mom. You are and aren't the asshole. What you're doing is wonderful but is it worth losing your family over?", "You're not an asshole. Actually, I think you're a prince! \n\nTake care of May because she needs you and you love her. On Thanksgiving, be thankful that somehow you turned out well while your parents and siblings sound like unrelenting assholes.\n\nI hope you and May have a beautiful life together! \n✌️ & ♥️", "NTA. I’d pretend to be surprised at the number of people who are saying ESH or adding caveats to their verdicts but posts about affairs always bring out the worst in this sub\n\nLook the fact of the matter is your mother is entitled to complicated feelings about May, but she’s also a 49 year old woman who should understand that her actions have consequences and that she can’t dictate to grown adults who they can and cannot interact with especially when the person she wants them to cut ties with is a minor child in the custody of the adult in question!\n\nIf you were trying to force your mom to have a grandmotherly relationship with May that would be one thing but you’re not, you’re respecting her boundary not to be around May but that comes with the consequences of you not being able to come to holidays or have a relationship with her because you can’t leave a child that is essentially your daughter by herself. Your mom had the choice to either fume and send her flying monkeys after you or she be an adult and get over it. Because again, you rightfully don’t feel comfortable leaving a 7 year old child by herself on a holiday especially so soon after she lost her own mom.\n\nI really hope things cool down for the sake of your stress levels and that you and May can come up with some new holiday traditions!", "NTA- you are adhering to your mothers wishes, she doesn’t want a relationship with you if your sister is around. Where exactly did she think a 7 year old was going to go on thanksgiving if you’re her primary care giver ? Wether she wants to acknowledge it or not the minute may came to live with you was when she became part of your life. She’s obviously allowed to say she doesn’t want May around but she can’t be mad when she told you to chose and you did.", "NTA - While I do feel NC is a bit extreme, your mother is the one that mentioned it. I understand where the affair probably had a toll on her well-being, but THIS IS A CHILD. No child should have to deal with the consequences of their parents. She's completely innocent, and you'regoing to be adopting her. Is your mother just going to ignore you forever because \"May\" will legally be your child? Yes, it's awful she got cheated on, but \"May\" had no part in that. Your sisters should understand that too.", "NTA\n\nMay is innocent in all of this. The only person they should be angry at is your father.\n\nIt’s understandable why a person would not want to raise their spouse’s affair child - but punishing on of their own adult children for choosing to have a relationship with the child - including custody and adoption - is being an asshole.\n\nYour family are the ones making you choose.", "NTA you are a great dad", "You are NTA here op. You're a good man for doing what you did. Your folks can piss off if I'm being honest. They need therapy or something. Everyone here chewing you out for it or referring to that little girl as a \"consequence of an affair\" (which feels incredibly dehumanizing) is TA.", "NTA…the child did nothing wrong….it’s unreasonable your family is treating you both that way.", "You have custody of May. Even though it's not an adoption, even though she's not your actual child, for all intents and purposes, she *is* your child. Your mother is allowed to feel how she feels about May, but she isn't allowed to tell you what to do with your child, and asking you to abandon her on the holiday is cruel. She can be mad about the cheating without taking it out on a child.", "I truly think you might be the only person in this whole family who is NTA other than poor May. Your dad sucks for his affair and then abandoning his child after her mother died. Your mom and sisters suck for making you choose between them and the innocent child you are adopting so she won’t be abandoned after her mother died. Yes, the fact she exists because your dad had an affair also sucks but that’s not her fault, and now that she is in your custody she’s your responsibility. They don’t get to be upset you won’t abandon her for a holiday.", "YTA. You are basically telling your family that affair was okay with you. You are just like your father.", "You need better friends.", "Agreed. NTA. May didn't do anything wrong. OP is an amazing human being!", "NTA. I can understand your mum not wanting to have May in her life at all  as she would be a reminder of her husband's affair.  But expecting you to go to Thanksgiving but to leave May on her own is unfair to both you and May.  She is your most immediate family member now. For May' s sake it is so good that you are in her corner. It is also good you have laid down this boundary now, otherwise you would be put into the same position every time another family event were to come along.", "If a person sets an ultimatum, they need to accept that there is an option that they’ll get tossed to the side. Mom played the FAFO game and op picked their daughter/half-sister over her.", "Exactly! NTA, May did nothing wrong and shouldn’t be punished for your dad’s mistakes. I’d tell your mom and your sisters that what your dad did is wrong but May is a little girl who had no control over what her parents did. She’s a little girl who lost her mom and was abandoned by her dad. May is your daughter now, your mom and sisters need to get over the circumstances of her conception and look at her as your daughter now if they want you in their lives, they don’t ever need to forgive your dad but they need to stop taking it out on a child who bares no responsibility for what happened. You’re a good guy for looking past what happened to make sure your baby sister is cared for.", "Are they mad you are taking care of your dad's love child or are they upset with your dad for breaking up the family?", "I totally agree with you\n\nYes mom and sisters are absolutely not obligated to care for the child or have it around\n\nI do find OP harsh with the replies though. Like \"you don't like it? Who cares?\" OP was right in his decision to adopt the child. Poor kid went through so much and nothing of it is her fault but let's not get surprised by the fact that mother of the post is hurt", "How are the sisters not AHs? I get moms hurt. Her marriage was destroyed by that awful husband of hers and May is a reminder of that betrayal. But the sisters, while having no obligation to include May, have no reason to hate May’s presence so much to the point they’re asking their brother to abandon this child for a dinner. They are the ones drawing a line. They could respect OPs choice but instead are punishing him. So be it. But they are definitely AHs.", "Came here to say the same. Completely understand the Moms POV but that doesn’t make OP AH just because they are stepping up to raise a child that lost its mother and sounds abandoned by its father. The child is innocent in this. Hopefully time and therapy will find a way to fix the fissures that have developed in OPs family. Best of luck in your journey OP!", "I agree with a lot of what you’re saying. And yes, it’s fine that they don’t want May around. But what makes them the AHs is their hostility toward OP for not wanting to come without her. What is she supposed to do—leave a 7 year old at home alone on Thanksgiving? Pretty hard time to find a babysitter. So, it’s ok that they set this boundary, but then they need to respect hers, and not be angry with her for not coming.", "No, we can expect the mother and sister not to make unreasonable, manipulative demands that involve abandoning an orphaned 7 year old on Thanksgiving. They sound like loathsome people. They could easily say, “I understand you can’t leave her alone on the holiday. We’ll see you at another time.”", "The mom and sisters are also AHs because of their ultimatum.  If the Mom would have said, \"I'm sorry you're not coming to Thanksgiving, I hope we can visit some other time but I don't want to see May,\" it would have been fine.  It was the condition she set that May be left home alone and the daughter come OR she will be shut out of Mom's life forever.  THAT is the AH move here.", "The mother is refusing to accept her daughter’s situation I’m real life though. Ops life now includes a child. They are now a package deal. You either accept that or cut contact as she has. Mother is the A H.", "I swear we see so many of these stories and people are amazed that the cheated on partner doesn't want to become close with any kids that resulted as from cheating.  Like, most of the world watched game of thrones, and how cat stark treated Jon Snow was a major catalyst in a lot of the story.  And her reaction and treatment was cruel but it was also really fucking understandable.", "Why are people missing the biggest point? Nobody is saying they need to have a relationship with May. OP isn’t trying to force it either. The reason they’re being AHs in this situation is because of the ultimatum! When you set a boundary to exclude guests to any event(like a child-free wedding or a family gathering) you have to accept that some people won’t be able to attend because of it. They weren’t wrong for not inviting her. They’re wrong for not accepting that excluding her means OP can’t attend because he doesn’t want to leave her behind for that particular holiday. Threatening OP is what made them the AHs in this", "And OP has never said mom has to meet or spend time with OP’s daughter. Mom is choosing to cut OP out of the family because OP refuses to abandon his daughter.", "Mother and sisters are the ones going non contact", "The mom isn’t an asshole for not wanting anything to do with the girl. She IS the asshole for choosing her hurt feelings over her relationship with her adult son who has decided to become a parent", "I absolutely understand where my mom is coming from. But I was just surprised that she'd invite me knowing full well that I have custody and wouldn't leave May alone. I didn't even expect an invite. And as I mentioned in a previous comment, I wouldn't force a relationship with them.", ">It’s heartbreak and betrayal.\n\nBut if a mother decides to cut off son because of his father betrayal, then it's betrayal to her son as well and mother is an AH. I get that she doesn't want to see the child at her thanksgiving and at all and until that she wasn't an AH, but by cutting off now she punishes son for the husbands infidelity.", "I had to scroll waaaay too far down to find someone else for whom this story seemed a little too much of a screen play. I guess he’ll get his Netflix deal!\n\nEdit: the detail that pushes it out of reality is that he's 25m. No way that he would be given custody over the woman's family (which admittedly there may not be a good choice there, but I'm calling shenanigans).", "That’s what I’m thinking too", "THANK YOU\n\nThere is so much being glossed over in the post and something is off here. I want to know why while he was NC with his father about the affair, he found out the AP was pregnant and so reached out to them to establish a brotherly relationship for an unborn child at 18?\n\nAnd then pretty much immediately gain custody when the mother dies over his father?\n\nOP - I mean... is that ACTUALLY your father's baby? This all makes a lot more sense if it's yours.", "I told them that I would get custody of May and that I would also adopt her soon after Mary's death. I gave them a heads up. I knew that taking her in would damage my relationship with them. I didn't expect an invite to begin with, and I don't ever expect to get invited to any occasion because I know that they might never accept May. And I'm at peace with that because it means I'll give May a good life. I never had any relationship issues with my mom nor my sisters. We were all really close. But that took a turn when I went back into contact with my dad. And also when I decided to take May in.", "OP didn’t ask for that. He just said he couldn’t come if his daughter, who appears to have no other available family, can’t come. Mom then chose to cut off her son for skipping thanksgiving.", "Of course the mom isn't an AH about not wanting to see the kid. She IS an AH for issuing an ultimatum about going NC with OP about not abandoning the child on Thanksgiving.", "Mom isn’t just “keeping her distance.” Mom is cutting off her own son because her son didn’t want his daughter to spend a major holiday alone.", "I agree with what you said about my dad; he's an asshole. I don't think he would have stayed with Mary if she wasn't pregnant. After Mary's death, I think he finally realized the gravity of what happened to him: his ex-wife, the mother of his children, divorced him; daughters that don't love him; a son that doesn't respect or like him; and a lover that died. He wasn't in the best state of mind or situation to take care of May. My father's age also doesn't help that he is in his 50s", "OP didn’t ask his mom to serve May food. OP asked not to be cut out of his family for skipping thanksgiving so he could be with his daughter somewhere other than his mom’s house.", "Why?  Which part of this is May's fault?", "Actually it is reasonable.  She invited Op, op brings his minor child. \nOp isn't expecting her to house or support her just include her in one dinner.\n\nPeople invite in-laws, significant other of family all the time that they don't actually like so they can spend time with the person(s) they love.\n\nThreatening no contact with OP unless child is abandoned, makes Mom an AH.", "Did you read? He already told them it was okay to cut contact. He is living with his decisions so why are you telling him to leave them alone when he is clearly already doing that?", "They then should leave OP in peace and not send texts stating other shit.", "I feel so bad for the mom. She lost her husband and her son.", "I love my mom, I really do. And yes, I know there is no coming back from this. But May is my baby sister, and soon I will be legally her father. I hope someday my mom sees my perspective, that I took in an innocent child rather than seeing her as the 'personification' of her betrayal. And if she never does, I understand that. I won't force a relationship between them. I sleep peacefully at night, knowing that my sister is safe with me.", "Mother is TA because she's going NC with OP, instead of accepting OP's decision not to attend without May.", "He’s not asking his mother to take in May. He’s asking his mother not to cut him out of the family for skipping thanksgiving.", "Take in? It's a fucking dinner. Humans are so mind boggling stupid. This is a kid that has nothing to do with anything. It not a \"breathing personification\" of betrayal. It's a parentless child that was abandoned. Fucking egotistical selfish assholes holy shit.   \n\n\nI am so glad my partner is onboard with us adopting and I keep thinking of the things the kids go through while we wait for do to our home study.", "Except OP never even implied his mom should take in May when he already has full custody", "I never said that I wanted her to take her in. I didn't even expect an invite because they knew that I have custody of May and would never leave her alone. It's unfair for them to invite me and just expect me to come without her.", "She isn't being expected to take her in. She's being asked to be civil to a child who has no part in her father's sins for the length of 1 meal.", "OP isn't asking for that though. At no point does he ask her to welcome May. He has just said that because his mum wont have her for thanksgiving then he won't come either because he doesn't want to leave her alone. Which is completely understandable. She is a young child, of course you wouldn't leave her alone. That should have been the end of it. They were both fine in what they said. Completely understandable for mum to not want ex husbands love child in the house playing happy family's but also fair for OP to say that's fine but I won't be coming as I will be with May. But mum shouldn't ask him to choose between May and her and threaten to cut him off if he chooses May. That's the point mum is an AH. Before that I get where she is coming from.", "No one's talking aboutt Mom taking May in.  OP did that.  We're talking about her not even being willing to look at the child for an afternoon.  Even in the most generous interpretation in Mom's favor, that's a bit over the line.", "What is OP suppose to do with the child, it is Thanksgiving and she is not taking in the child. OP is attending the dinner with the child and leaves with the child.", "Reading comprehension not found…..", ">I'm trying to wrap my head around the logic of you, 7 years ago, becoming friendly with your dad who broke up the family, and his affair partner. Like what on earth possessed you to do that?\n\nI've trying to understand this as well, but highly doubt we'll get an answer to the question. Truly bizarre though.", "He's not betraying anybody, yes the dad is an Ah but just because being an Ah to his wife doesn't mean that the kids should absolutely choose a side and loose their other parent. If the dad didn't want contact that's a different story but it doesn't seme this way. That's what shared custody is for after a divorce. The now we have no contact to dad, part seems rather radical to me.", "Choosing a child who needs him over a mother who's got plenty of other children to manipulate.  Choosing not to play mother's mind games and instead stick to his guns.  Choosing to cut ties with his sisters too when they act like obedient little flying monkeys.\n\nI applaud these choices.  Birth is not a life debt and does not deserve respect when respect is not otherwise earned.  Lose me with that garbage.", "The only think Mom is TA for is expecting OP to jump at her beck and call and throw a 7 year old child onto the street because SHE doesn't like her.\n\nThe ultimatum was clearly supposed to make OP panic and get rid of the child in order to keep his connection with his mother.  She considered herself important enough to force the matter and win by applying pressure.\n\nbut a real father will never abandon his child and Mom is now struggling to find a way to rebuild the bridge she burnt with the typical tool of the tyrant -- further ultimata.\n\nThis will end as it often does, with OP happily disowned and living life with his child, and his mother mourning yet another loss, this one self-inflicted.", "That kid is his sister who was orphaned and abandoned. It’s not weird, it’s noble. He’s not the one choosing a family over the other, the mom and sisters made their choice to go no contact. He’s had a relationship with his sister since he found out his dad affair partner was pregnant. That’s years he has known her and she’s known him. So when dad abandoned her, he decided to step up instead of let an innocent child suffer. \n\nPeople willingly become single parents all the time.", "She may be a ball of sunshine, though mother and sisters aren't entitled to be around her. She is a child and a produced child of an affair where her mother knew he was married. They decided they didn't want her in her life and that's okay, some things they said were unreasonable, but his mother is greatly broken from her long marriage and family being broken apart by the biggest betrayal anyone can face. \n\nAs said, it is better she isn't around them and they know it is so it is more beneficial for both child and mother in the long time.", "I knew that taking her in would have irredeemable consequences that would affect my relationship with them. I accepted that and have no problem with it. However, they can't actually invite me to come without her and expect me to come. I would have understood if I didn't even get an invitation to begin with. They already knew that I have custody of her and won't leave her.", "Yeah you do deserve the downvotes tho. \n\nMothers in her rights not to see the affair child, but going NC is an AH move. She’s entitled to be the AH, but doesn’t stop her being an AH to her son.", "OP never expected his mom to have her at the house he clearly told his mother that he wasn’t attending the holiday without May. As he should, May is 7 .", "He didn’t force anything though. He just said he can’t come to Thanksgiving if May isn’t invited, which is entirely fair. I don’t understand why anyone would think an older sibling/adoptive parent would leave a recently abandoned kid alone on a holiday to begin with.", "Agreed 💯 with what you said.\n\n>Your mother's reaction was the result of you slapping her in the face with your choices repeatedly. It wasn't sudden, you and I both know that.\n\nI think OP is a chip off Dad's old block. He doesn't give a shit about his mom at all and it goes beyond his wanting to adopt May. \n\nYTA, OP.", "OP’s mom is also blameless for her husband choosing to fuck some other woman.", "Mom gets to make her own decisions here...no 'must' involved.", "Bro this thread is wild. That poor girl.", "I'd also like to comment that I WISH I had someone in my corner like you are for may... I wish I had that when I was a kid, the 2 people I did get that from passed when I was 7 and 10. 😭😭😭", "None of this is anyone’s fault but OP’s dad and his side piece. No one asked for any of this other than OP’s dad and his side piece. Other people in the family having boundaries doesn’t mean they don’t have empathy.", "Agreed! This comment section is wild!!! Yes, I get that mom is hurt, but hurt 7yo > hurt 50yo. This is an innocent child who is also OP's family, both by blood & soon to be adoption. Even is she wasn't, she's still a 7yo little girl who OP's mom wants abandoned because seeing her is upsetting. Gross.", "First of all, never compare me to my dad. I'm nothing like him. Secondly, I will never force them to have a relationship with may and don't expect them to. I didn't excuse my dad's affair and I lost all trust in him because of the affair.", "Agreed. That little girl deserves the committed parent she’s found in OP. NTA. I understood you mother and sisters stance up to the point where they threaten to cut contact over that child. The dad is a ghastly AH, agreed but the child is innocent.", "I have never understood this illogical hatred towards an entirely innocent child.", "It is absolutely asshole behavior to expect a parent to exclude their first grade daughter from a family holiday. Especially when it’s likely that child’s first or second thanksgiving without her biological parents. That’s like, Disney villain levels of cruel.", "At this point though it's been 7 years. OP is adopting May. She will 100% legally be his daughter. If his family won't accept May, they're assholes. She's innocent.", "OP is a man.", "Everyone except OP are AHs in this situation. The father for the affair and for abandoning his child after her mother died. OP’s mother for giving the ultimatum(it’s fine to not want to see May but she should understand that means there will be times when OP can’t attend). The sisters for also not accepting that the refusal to be around May means that OP won’t be able to attend every event. \n\nHowever, OP and his sisters also suffered a betrayal. Their father’s affair doesn’t only impact their mother. The destruction of their once happy family has a huge impact on the children. Even OP cut contact with his dad and only reached out because he found out he had a half sister. If he didn’t have a new little sister, I doubt he would’ve reestablished contact. So while I agree with your comment, I don’t agree with the implication that OP’s sisters have no reason to be hurt by May’s existence. It’s ok that they don’t want to know her because she would be a constant reminder of their father’s affair. It’s better that they’re not around her because being surrounded by people who hate you for something you had no control over, is far more damaging than never knowing them.", "OP is male", "except the comments are the exact opposite when its a father whose a victim of paternity fraud", "What are you talking about? He just said he won’t go to thanksgiving dinner if the little girl isn’t invited.", "Let's be realistic though. Say that she is fine with him staying home and didn't go a step further. This problem would appear again and again and again. She and the sisters would invite OP and OP would want to bring his daughter along. So he would not come. And when he invites people to his house, his daughter will of course also be there all the time and then they would not come. \n\nIt is kind of hard to keep a relationship alive under these circumstances. \n\n>then I shouldn't bother contacting her ever again.\n\nSo maybe it is better to have clean cut like the mother wants and OP agreed to instead of dragging off the inevitable.", "No she’s not. He’s choosing the girl over his mom, so there is no reason why his mom can’t choose herself over him.", "Setting the boundaries she needs in her life doesn’t make her an asshole.", ">the detail that pushes it out of reality is that he's 25m. No way that he would be given custody over the woman's family (which admittedly there may not be a good choice there, but I'm calling shenanigans).\n\nThis is the power part that felt unreal to me as well.", "OP sucks for not letting his sister end up in foster care. No. Just, no. Mom can feel however she wants about the affair. No one is asking her to act as a grandparent to her son’s now-daughter. But she’s choosing to cut him off because he didn’t want his sister to end up in the system, and that’s just cruel.", "I would be so proud of my children if they took in a child who needed a family, even if it was the product of my husbands affair. Children being raised with love is more important than adults’ hurts.", "Idk if he's \"made nice with the AP\" as much as doesn't want this 7 year old kid ending up in foster care because their dad sucks.", "Thank goodness for this thread. Asking the real questions. Also your post gave me a lot to think about.", "At 18, I was already at university. By then, my dad had told all of us that Mary was pregnant. The reason I got in touch with them is that I would forever feel guilty knowing I have a sister out there whom I might never meet. What happens when she decides to contact us and realizes she's a child from an affair, and no one wants her? May she have a good life", "OP’s mom is also innocent. So is everyone else other than OP’s dad and May’s mom. It’s ok if OP’s mom never wants to be around the product of her ex husband’s betrayal.", "And this is the rest of his future.  How is he going to attend anything of note without her?", "Mom isn't an as for reinforcing boundary , let's be real here , if op is going to be a real father to may then he will definitely spend more time with may take care of may more than anyone else. So if his mother doesn't want to be around her then she wouldn't be capable of maintaining a harmonic relationship with her son either.", "Setting boundaries doesn’t make her an asshole.", "Nah. She has to be feeling massively betrayed all over again here. OP didn’t take in the kid to be cruel to his mother, but it won’t make her feel any better about it.", "This woman was cheated on by her husband, then her own son deliberately reached out to the affair partner, and now her son has taken in the affair baby. I’m surprised she didn’t go no contact the minute he made that decision, never mind Thanksgiving.", "And this is how every major holiday is going to play out from here.  He's not going to attend any of them.", "That’s not his daughter but his sister. He will raise her like his daughter and it may get there, it may not. Depends on the child and how she views him, that will be her choice. \n\nMother should not invite that child into her life if she can’t be nice. No child deserves to be treated as unwanted. His mother knows she can’t see that child as just another child. So she chose to be NC and that’s fine. It has been 1 year of divorce and a bomb being thrown in her life.\n\nOp picked up the bomb and is loving it, but mom is still reeling and has a right to her feelings. She needs to work through it and if she can’t love that little girl then she should stay away.", "And the future is full of things he's going to skip to be with his daughter somewhere other than his mom's house.", "The reading comprehension on this post seems to be lacking. You have it right and sooo many people have it wrong. OP just doesn’t want to be cut off from his family completely.\n\nThe little girl is innocent. OP is NTA. If this was *just* about Thanksgiving, then it would be NAH. I can completely understand why OP’s mom doesn’t want to interact with May, nonetheless have her in her house. But mom cutting off her son for taking care of an innocent child is TA.", "It isn’t about if this is May’s fault. It is about the fact that her presence, for no fault of May’s, is hurtful to OP’s mother for good and valid reasons. \n\nAlthough May herself has not wronged OP’s mother, OP’s mother doesn’t owe May a damn thing. It is a fucking crazy ask for OP to expect his mother to open her home to May, serve her food, entertain her and play happy family. Wildly tone deaf and insensitive for OP to even ask.", "This is not OP’s child. Also this is not just some random kid that he’s bringing, like a step kid. This her ex husband’s affair baby.  No, it is not reasonable for OP to expect his mom to serve, entertain and cater to the affair baby.\n\nI agree that threatening to go no contact goes too far, but if OP is going to expect their mother to have a relationship with the affair baby, I can kind of understand.", "I agree, OOP kissed off that side of the family long ago, they need to realize he doesn't care about them or mom.", "Same.That’s why she’s acting out like this and threatening to cut ties—she’s reached her limit.Somewhere,OP seems awful too.It’s great that he took in that little girl but I wonder why he got in touch with the two cheaters.OP refuses to see his mum and sister’s POV and shows zero loyalty towards them.Idk,I just think something is odd with him too", "She cut contact with her son. She didn't lose him.", "She didn’t lose a son, she’s thrown away a son because he won’t let an innocent child suffer.\n\nDon’t mistake the rightful pain of rejecting letting the affair child in her life with the asshole move of exiling her son because he doesn’t want his sister/daughter to be left to the wolves.\n\nShe’s made the AH choice to cut him off, not the other way around.", "I mean you clearly don’t love your mom because you never even thought twice about the pain you would bring in to her life going this route. Doesn’t mean you made the wrong choice but don’t lie and say you love her.", "Cool. She’s still the walking reminder of the betrayal. Everyone except OP’s dad and the girl’s mom is also a *person* and *innocent* in  all this. Her being *innocent* doesn’t mean all the other people who are equally *innocent* don’t have the right to set their own boundaries.", "Does your mom know about your adoption plans?", "Lol give me a break with this. 99% of the advice given on here is to break up with a family member if they ever dare say something that might be considered hurtful, but now all of a sudden a mom should work through her feelings and accept a child of an affair, and also accept that the son she raised for all those years chose this child over her. lol again.", "Why, you can cut off anyone for anything. There is no need to justify why you don't want to be in anyone's life. No one is entitled your companionship", "No. It’s ok for her to cut someone out of her life.", "Not even.\n\nShe's being asked to respect her sons choice to make the child who was abandoned by the same father that hurt her, and not cut him out of her life entirely.", "He is adopting a child from an able bodied father. A child that was the result of his fathers affair. Come on now.", "Doesn't mean she gets invites.", "You do realize that that doesn’t mean that OP’s mom needs to invite the walking reminder of her ex husband’s betrayal into her home, right?", "and by “no one” you mean her living breathing father right?", "Who dumped her on the street?", "Don't listen to this person, /u/throa45.  You're a hero for taking her in.  Your mom is crazy for expecting you to just ditch a 7 year old on thanksgiving.", "Is it? \n\nInnocent child or not, she'd be around a product if her husband's affair. That isn't fair to OPs mother. Every single time she looks at the child it's a reminder her husband cheated. None of that is fair to OPs family.", "There is no real way for OP and his mom to have a relationship now.", "Of course she is…but taking her distress out on the 7YO is wrong…and she’s slightly the A H for that and for cutting OP out because of her poor treatment of the child.", "So does the OP, what's your point?", "That's quite true and I agree with you on that, it's obviously going to be hurtful from their side of things that's understandable. What I meant wasn't about them not having empathy what I meant was he cares for her when no one else would and saved this little girl from ending up in the adoption system or something.\n\nBasically I was giving the guy praise for taking her on and he's NTA.", "Well you also broke your moms heart by choosing someone else over her, so you both have that in common… \n\nDownvote away.", "I stopped understanding when a 7 year old wasn't invited to Thanksgiving.\n\nThat's just mean and spiteful. The thing that I'd be giving thanks for would be that I wouldn't have to be surrounded by such ugly people they would ostracize a literal 7 year old and have her be alone on a family holiday.", "Me either.", "I feel quite comfortable saying that anyone who demands that a 7-year-old whose mother died, *and*  whose father abandoned her, should now *also*  be abandoned on Thanksgiving by the only relative who had the decency and the heart to take her in and love her, is an AH. OP's mother and sisters don't have to love May, and not doing so doesn't make them AHs, but hating and punishing a small child for the circumstances of her conception is unconsionable – and demanding that she be further abandoned, even temporarily, goes well beyond AH territory. \n\nOP's mother and sisters are *advocating for cruelty to a 7-year-old whose mother died, and whose father abandoned her*.  Only an AH does shit like that.", "The girl’s mother is an asshole for fucking a married man.", "No contact seems a bit harsh but honestly i kind of get it. OPs family especially his mom aren’t wrong for not wanting to be around May but she’s basically OPs child at this point, it’s unrealistic to expect OP to never bring her to anything or bring her around them. Cutting contact is probably best for everyone involved, especially May. There’s really no way for this relationship to continue at this point, the end is inevitable. I just wonder how no one saw this coming did OP not bring this up with his family before adopting May?", "I think they're the AHs for not accepting May for several reasons-\n\n1) it's been 7 years.\n2) OP is adopting May. She will 100% legally be his daughter. If his family won't accept May, they're assholes. What are they going to do, exclude him and his daughter for the rest of their lives?\n3) She's innocent. May had no control over her parents and didn't ask to be born.\n\nI understand being upset about May for a bit, even a few years. But at age 7? When OP is adopting her (he said so in a comment)? That's for life. May is his kid now. \n\nThis is an opportunity for OP's family to bond with May and learn to see her as family (because she IS family) and separate from the idea that May came from an affair, and see her as OP's daughter. I'm sure May is a lovely little girl who doesn't deserve to be alienated from family.\n\nOP is NTA.", "Thus my use of \"might\" and phrasing as that they can't bear having May at Thanksgiving.  I didn't say it was okay for them to say \"leave her at home alone.\" Since it seems to be unclear, I do agree it is asshole behavior to ask OP to \"abandon\" May at any time, and for any duration.", "Everyone other than OP’s dad and the girl’s mom are innocent in this. They aren’t assholes for not wanting her in their lives.", "Nope. OP’s mom and sisters aren’t assholes for not wanting a relationship with OP’s dad’s affair baby.", "Theyre downvoting you but you're not wrong", "I'm going to push back at that because that's not typically an equivalent situation. Paternity fraud sucks and if a guy finds out a baby is not his when the mother is pregnant or the child is a young infant, I don't think MOST people would blame him for walking away. \n\nTypically though, these stories are told when the child is much older. I think if you raise a child they do become \"yours\" even if they are not bio kids. All that said I still wouldn't blame the guy from leaving the mother. Leaving a kid you raised is another matter. \n\nIf the mother in this story had raised the half sister for years and then decided to ditch her then she would also be the AH. IMO not wanting to start a relationship with the girl is very understandable. I think the fact that she is cutting off her son is a harsh stance but this situation is really complicated.", "They're talking about the mother's response to that.", "Yes, and Mom could have said, “I understand. I can’t bear to have May there. I will see you at another time.” Instead, she threw a temper tantrum and went no contact.", "From the OP:  \n>A few days ago, I got a message from my mom stating that if I'm going to choose my dad's affair child over her and our family, then I shouldn't bother contacting her ever again. I agreed.", "No he isn’t. Saying, “I won’t leave my kid alone on Thanksgiving,” isn’t choosing anyone over anyone. It’s being a responsible parent. Mom was the one who decided his choice meant he wasn’t allowed to have any relationship with her at all.", "She is essentially punishing her son for deciding not to leave his child alone on thanksgiving.", "So how is op going to have a long relationship with his mother that never includes the new daughter in any way?", "Yep we loved and cared for my now deceased nephew who was a result of an affair. He is with my Mom now laughing and smiling and giving her hugs again. She and the rest of my family never turned our backs on him even when most people would. My mom had the biggest heart and I can’t see how someone can do that to an innocent child.", "Same here. Would I be hurt about the affair? Of course! But that child is still an innocent who doesn't deserve to be abandoned.", "I got the made nice part from when he reached out to the AP because he found out she was pregnant.", "Oh, ok\n\nWUT?\n\nWhy did you think the unborn child wouldn't have \"anyone\" that wanted her? She had a dad and mom until her mom passed when she was 6, right? And your dad was in her life until then too, right?\n\nAnd you would \"forever\" feel guilty so you reached back out while the AP was still pregnant? I mean, you could have gotten back into contact at any time. When the child was born or a few years old or decide to be there if she did ever decide to reach out. \n\nIt wasn't now or never. For you OR your sisters. \n\nThis doesn't make sense. There are some missing missing reasons here for sure or else this whole thing is fake and you need to think more about the realism of your protagonist's motivations.\n\nBut if it's real, ummm, is that your child?", "They  knew about the child for 7 years, hardly fresh. May lives with OP for a year after her mom's death.", "What’s the point of commenting this under so many judgments?", "Well the mom FAFO. He doesn’t have to have a future or any relationship with her or his sisters going forward. I certainly wouldn’t. And he isn’t an AH for not having one.", "OP is better without his mom in his life if that's how she's going to treat the child he's responsible for.", "Yes it does. \n\nYou don’t get to go ‘oh I’m setting boundaries’ and that absolves you of any judgment. \n\nSome boundaries make you an asshole.", "Copy-pasting because I'm lazy:\n\n\"The girl can't come to my home, I don't ever want to see her because she reminds me of something that caused me pain\" is an appropriate boundary.\n\n\"I and your sisters never want to see or talk to you again because you adopted your half-sister rather than have her be abandoned, despite the fact she is a very young child who is completely innocent in all this\" makes the mom and sisters AHs.\n\nAnd if you can't understand the difference, you're an AH too.", "And so what do\nYou feel should have happened with the young INNOCENT child, who is not responsible for the circumstances she was born into?", "He’s adopting her. She’s his daughter. And no one is asking his mom to even meet May. OP is only asking not to be kicked out of his family for skipping thanksgiving dinner.", "OP isn't asking for that though. At no point does he ask her to welcome May. He has just said that because his mum wont have her for thanksgiving then he won't come either because he doesn't want to leave her alone. Which is completely understandable. She is a young child, of course you wouldn't leave her alone. That should have been the end of it. They were both fine in what they said. Completely understandable for mum to not want ex husbands love child in the house playing happy family's but also fair for OP to say that's fine but I won't be coming as I will be with May.\nBut mum shouldn't ask him to choose between May and her and threaten to cut him off if he chooses May. That's the point mum is an AH. Before that I get where she is coming from.", "It's not that he doesn't care about them. He just couldn't abandon an innocent child. His mom and sister's have each other, are adults and will be fine. Without OP, May has no one. His conscience is ok with grieving his older sisters and mom. His conscience is not ok abandoning his youngest sister, another victim of his dad.", "Her son sought out her husband’s side piece to make nice. Her son decided to take custody of the child conceived through her husband’s betrayal. She’s not an asshole for choosing to not have him in her life anymore.  It’s understandable that she doesn’t want to see what he does next to make their relationship harder.", "She made her choices based upon his choice.  She has the right not to have the affair child in her face.  She is not the AH, she is a victim and her son has chosen to victimize her again.", "It's really messed up. At the same time, unfortunately, that is likely all May will ever be to OP's mom. This is why cheating is so horrible and leaves behind so much damage. Like if he'd left first and then started dating Mary, it would be a very different situation.", ">Her being innocent doesn’t mean all the other people who are equally innocent don’t have the right to set their own boundaries.\n\nThat would be true if she owned up to accepting the concequences of the boundaries. She put out there \"If you are going to prioritize this child you took in  never speak to me again\" and OP said \"I can live with that. Then the sisters as agents of the mother got involved to guilt him because let's be real she was bluffing. \n\nWords have power and if you don't want something don't ask for it. Boundaries should be things that if you want others to respect iron clad you should then accept when they walk or worse honor them as you asked them too.\n\nPlus it's a damn child.", "Completely, that's why they should've accepted what OP chose to do for an innocent child and not try to guilt OP for helping a child in need. That is where they became wrong and a bit disgusting. OP was Nah for asking and they were nah for declining, but they were AHs for shitting on OP for being a good person.", "I think it is totally valid to not want May at the Thanksgiving dinner. That's a decision that is OP's mother's to make.\n\nThe consequence of that decision was going to be one of two things:\n\n1. OP goes, and leaves 7yo May without family on a family-oriented holiday; or\n2. OP does the only humane thing, which is to not go, staying with May instead.\n\nOP has more obligation to the welfare of his young sister than to placating his mother at May's expense.\n\nThe AH move is the issuing of ultimatums, not taking \"no\" for an answer. The mom is actually right: OP is choosing the sister over his mother - and that is exactly the right thing to do.", "Cutting off your child for refusing to abandon their child on a major holiday is an asshole move, even if you call it a boundary.", "That really doesn't sound like healing or moving on...", "‘Boundaries’ are not an excuse to be an asshole.", "She doesn't have to accept the child, but it's wrong to demand that OP leave her for the holiday and threaten to go NC if he doesn't.  She should just accept that OP won't attend.", "OP didn’t ask for an invite for her.", "Because that's all a child is right.... not someone who was abandoned and made a victim by the same man. Not a little girl without a family. Nope, just a walking reminder of someone else's actions.", "Who abandoned her.", "So did someone else in the family take the kid in?", "OP didn’t ask his mother or siblings to see May.", "Look if you want to pretend it’s morally correct to put a kid in foster care, that’s cool, but I’m not going to pretend it isn’t an absolutely fucked premise.", "It really no asshole in this story. The mother pov is understandable and so is OP", "Really?\n\nSo your saying the mum couldn’t accept OP can’t leave a child alone for thanks giving, asking him to keep some distance without going NC. The only healthy path is ultimatums and absolutes?\n\nYeah… if that’s a healthy relationship OP and this child really are better off.", "She’s not taking anything out on the 7 year old. She isn’t in the 7 year old’s life.", "Not just leave her alone on a family holiday, but ostracize her and want her to go into the foster care system after she's already lost her parents at such a young age! I find people like that utterly cruel and disgusting.\n\n And the father is a major A H both for cheating on his wife and leaving his family and for shunning his own young child after her mother's death.", ">I stopped understanding when a 7 year old wasn't invited to Thanksgiving.  That's just mean and spiteful.\n\nNot being invited is probably the safer option.  The child may be innocent but that doesn't erase the anger/hatred and I would hate to see how they would treat her.", "Yeah when I saw the title I thought maybe it was an adult not being invited. Still, but not as gross", "Absolutely. Nasty and malicious.", "Right? God forbid you expect the adults to act like adults and deal with unprocessed trauma instead of externalizing it onto minors", "Yep. You are basically telling the child you want nothing to do with them because of THEM . Like that is so wrong. Glad OP chose May over his Mum and Sisters", "Women bear children from violent rapes & treat them with love bc it’s not the child’s fault so I really don’t understand OPs mom & sisters stance here. They’re bitter & awful if they’d hold a grudge against an innocent child, especially since OPs mom is the one who chose OPs dad, who is the root of all the problems.\n\n\nMom should blame herself for marrying such a horrible man & should be proud OP is such a wonderful person despite coming from this mess.", "Why would they invite her?", "Absolutely! It astounds me about how many people on Reddit believe it is okay to ostrasize, ignore and bully children of affairs. It is not that person's fault they were born. OP is definitely not an asshole, others on this board are though.", "Agree a thousand percent", "OP’s mom lost a man she probably thought was the love of her life. He crushed her, after a long marriage and three kids together. That’s not the kind of trauma people just get over. And her sisters lost a dad as well, the 7 year old isn’t the only one. Being older doesn’t make it easier to deal with, it just means you process it differently. That man hurt these people to the point that they never wanted to see him or anyone associated with him again. And the 7 year old is a walking reminder of that. They don’t have to want her there or have any grace for her - that’s OP’s job as her guardian, and OP is doing so. Nobody is wrong here, but it’s just not something anyone is going to agree on. I’m sure the 7 year old is better off not going to Thanksgiving with people who don’t want her there nor care at all about her anyway.", "Agree completely! She’s seven and her mom just died. Like, how can someone be so heartless? She’s an innocent baby", "And I am quite comfortable agreeing with you, 100%\n\nHow on earth does anyone think that the child deserves to punished here?  Or further neglected?  I get more and more angry the longer I think about it.", "I think that the mom wouldn't be an AH, though, if she'd been more understanding  that OP will have to stay home with May, and had not made it a me vs. her decision. it's reasonable to not want your ex's and AP's child at your house for thanksgiving. \n\nAlso, even though what OP is doing is commendable, adopting May will inevitably put a strain on his relationship with his mom and sister. He can't expect for them to welcome May with open arms. and if i were his mom, I also wouldn't want May attending. Honestly I can't imagine being able to look at her and not break down, and it's fair to not want that reminder at what's supposed to be a happy occasion. This might be selfish given what May has gone through, but it's not OP's mom's job to host May. And even though her reaction was extreme, I understand that she's coming from a place of deep hurt and rejection.", "Exactly. This should be top comment. I can’t believe anyone’s defending the mom & the sisters, they’re as awful as the dad. OP & May are the only ones who aren’t AHs here.", "I could not agree with you more.", "Absolutely -- provided she knew at the time.\n\nWe do know with 100% certainty that _he_ knew he was married at the time.", "She's dead, though. Not really able to pass anything off on her at this point.", "Ok and your point is", ">and separate from the idea that May came from an affair,\n\nThat is easier said than done, especially for the wronged party, OP's Mom.\n\nI ~~thing~~  think that is better to keep May away from this family, there is not good outcome for her.", "But she's not family. The family want nothing to do with the girl.", "Time does not make situations like this better. The mom lost what she probably thought was the love of her life (considering she was with him for a very long time and had 3 kids with him), and the siblings lost their dad. He betrayed them all and hurt them to the point they never wanted anything to do with him again. That does not go away. They do not have to show this kid grace. To them, she is not just a child, she is a walking painful reminder of probably one of the most traumatic things they ever went through. You don’t HAVE to put your hurt and trauma aside for other peoples’, whether they’re 7 or 50. OP chose to, but they didn’t, and there’s nothing wrong with that.", "Nope. It doesn’t matter how long it’s been. OP adopting his dad’s affair baby doesn’t change that she’s the result of the mom’s husband betraying her. She doesn’t ever have to have a relationship with them, and neither do OP’s sisters. Not wanting her in their lives doesn’t make them assholes.\n\nEveryone is innocent in the situation other than OP’s dad and the girl’s mom.", ">**It’s ok that they don’t want to know her because she would be a constant reminder of their father’s affair.** It’s better that they’re not around her because being surrounded by people who hate you for something you had no control over, is far more damaging than never knowing them.\n\nDo you know how to read? I clearly said they’re not wrong for not wanting a relationship with her. I said they were AHs for not accepting that their reasonable boundary means OP can’t attend.", "The problem isn't them not wanting a relationship with her.\n\nCutting OP off because they are being there for the child, however, does make them assholes.\n\n\"I don't agree with your choices, and I don't want to see her at all.\" That's it, they could have left it at that. But instead \"because you love this innocent child that's a walking reminder of what someone who's abandoned her did, we want no contact with you ever.\"", "And what would happen the next time the mother and sisters invite only OP? He would not come. And what about when he invites his mother and sisters to his house and naturally his daughter is there? They would not come.\n\nIt is kind of hard to keep a relationship alive under these circumstances. So the mother's response of preferring a clear cut instead of dragging the inevitable out is understandable. With the mother and sisters not wanting to be around May and OP not wanting to exclude May who is now his daughter, both interests clash to such a degree that a continued relationship between OP and his mother and sisters is just not really possible.", "I do get their mother's anger though. It must feel like her ex's betrayal has also taken one of her children from her.", "Do you realize how traumatic this is for his mother?  Not only did her family life get absolutely destroyed when her husband cheated, but the person that she raised since they were a child ended up choosing a stranger over her. I can't think of a worse betrayal than that.\n\nI understand OP is doing something very kind for the child, but by doing that he is choosing to cause even more harm to his mother. If anything, his mom is being nice to still invite him around. If I was her I would deny I even ever had a son.", "Read the part where his mom initially invited him to Thanksgiving. He says that he won't go unless he can bring his half-sister. I responded to a person that said that OP never said the mom had to meet or hang out with the half sister. Idk about you, but having someone in my house for dinner constitutes meeting and hanging out with them to me.", "He absolutely is. He has chosen his dad’s affair baby over his mom. I’m not saying that his choice was right or wrong, just that that’s what the situation is.", "Her setting a boundary isn’t punishing anyone. It’s better for her to do that than to have to spend the holidays with the product of her ex’s betrayal.", "If his mother were willing, they could still talk on the phone, e-mail, see each other at times as May gets older and more independent. But the mother has cut off any path for them to maintain even a minimal relationship.", "True, but I don't think it was because of the AP and more of like oh shit there is going to be a new human brought into this clusterfuck.", "Getting back into contact doesn't mean I immediately met them. As I mentioned, I was in university and didn't have time to go back home and meet them. What I meant by 'she didn't have anyone that wanted her' was that my dad, being in his 50s, wouldn't be very involved in her life. Mary, for all she was, was a good mom but was alone. She was a woman in her 30s who didn't have much family around. That's why my dad was able to 'manipulate' her and start an affair with her. So, whenever I went back home, I would babysit for her and take May out. There are some reasons here that I didn't include for the sake of anonymity. And yes, she will legally be my daughter.", "Because it's my answer to most of them?", "Whatever. The actual victim here is OP’s mother. She didn’t create this situation. OP did that by reaching out to the side piece and then taking in the affair baby. I’m surprised they were speaking  to him after he contacted the affair partner in the first place. It sounds like they tried to continue but have reached a point where they can’t. I didn’t give him the asshole vote, because I think he genuinely intended to do the right thing, although being a bit dismissive to his mother, but his intentions don’t change how she feels about it. \n\nPeople on here are always advocating for folk going no contact when a family relationship becomes more painful than it’s worth. Here is a family who have done that.", "Ideally, another member of her mother’s family should have taken her in. Or her father not been useless. Failing that, she needs to be somewhere that OP’s mother doesn’t have to look at her. She isn’t responsible for what happened, but she’s the living embodiment of it.  OP should never have reached out to his father’s side piece, but he did. He meant well and continues to mean well, but that doesn’t mean that there aren’t consequences.", "He’s not going to be welcome with his “daughter” ever, so it’s NC. \n\nAgain it will be up to the child to decide. She had a mother and a whole different life. I don’t like when people just erase kids parents. So many kids on here post how they were adopted or new parents came into their lives. How they love they’re new family member but don’t see them as a parent. It will be up to the child for what relationship she may want. It may stay a sibling relationship. You don’t know that. \n\nMy mother raised her brother and he’s never called her mother when they were alive. She had him since he was 5. He would say that my mom raised him, but that’s his big sister. They have both passed, but that’s their relationship.", "People having boundaries doesn’t make them gross.", "So everyone should just pretend the innocent child does not exist? Go into foster care after losing her mom then being abandoned by her dad? Adults cannot be an adult around an innocent child? OP is the only one being rational.", "This is just some bs", "So, the son deciding an innocent child shouldn’t be without any family is victimising her?\n\nShe issues the ultimatum, that’s not a victim but a perpetrator. She had every right not to see the child, but she has no right to demand her son to victimise a child. \n\nIf your blaming a 7 year old for your pain, your an AH.", "Nope. It’s ok for her to set that boundary.", "Oh, right! Society's expectation is that women should get over their feelings and embrace the affair children of their husbands. \n\nIf she doesn't embrace the affair child, she clearly hasn't healed and moved on. Shame!", "Remember what sub we're on.", "Why shouldn't she go NC? it's obvious this relationship is overbl", "Which is good.  So op doesn't go to Thanksgiving and deals with what comes from their decisions, good and bad.", "Seriously everyone in this family sucks, it’s not the kid’s fault she was born.", "How does that mean she’s been dumped on the street?", "OP is still the AH.", "Same. Oh and let’s ostracize her legal guardian because you can’t be chuffed enough to see her as an INNOCENT child who has absolutely nothing to do with the situation. The mom and sisters are cruel  AF.", "Adults who can't hold their tongue about something the recent orphan had no control over are the very definition of assholes IMO.", "Having such negative and hateful feelings for a child who is 100% innocent is completely an utterly disgraceful and makes you an AH. The child literally did NOTHING wrong!", "It astounds me how on a sub that usually pushes for boundaries so many people can’t understand that boundaries can include not being around your ex’s affair baby or not wanting to have a relationship with your father’s affair baby.", ">That man hurt these people to the point that they never wanted to see him or anyone associated with him again.\n\nBy that logic, the mom and full siblings shouldn't want to be around each other either since they are associated with the father.\n\n>Nobody is wrong here, but it’s just not something anyone is going to agree on.\n\nThe mom and sisters are wrong because they are the ones issuing ultimatums, threatening no contact, and shaming OP for \"choosing May over them\". \n\nMom and sisters can be uncomfortable with May coming for Thanksgiving and they can say she cant come. They can also let OP know that, and he, in turn, can say he won't attend, just like he did. At that point, the mom and sisters should have just respected his decision, as he respected their stance about not having May there.\n\nOP is NTA. He's an awesome human being for taking in his half-sister, loving her, and making her his priority when everyone else in her life either died or failed her. \n\nThe mom and sisters are the AHs because instead of accepting that and being proud of OP for stepping up, they are trying to make it all about themselves. It's fine not to want the affair child at Thanksgiving, but it's not OK to shame OP for having a bigger heart than them and threatening to cut contact with him. \n\n>I’m sure the 7 year old is better off not going to Thanksgiving with people who don’t want her there nor care at all about her anyway.\n\nHere is pretty much the only thing I agree with you on. I wouldn't want an innocent child, who just lost her mom, to be exposed to toxic AHs like the mom and sisters either.", "Easier said than done, but that part of the gig for being an adult. Adults have to process and be responsible for they're own emotions and accept the consequences when they choose not to do that. I agree that if mom and sisters aren't willing to be respectful of May, keeping her away from them is best, but they don't get to call OP an AH for it", "What are they supposed to? Maintain a superficial relationship where they never see each other but pretend everything is okay?", "I was thinking that too honestly,there's no middle ground here. And mom has a point that OP made a decision at the expense of their relationship", "Gotcha. Thought it was a legitimate misreading.", "So if all of my family is in another state, does that mean my relationship with them is now not real because it's over the phone and internet and not physical?", "But she is the one pushing him away and playing favorite. Never choose the person asking you to choose between them and someone else. Except if it's a safety issue.", "It only feels like that way because she’s decided that loving her means her kids have to shun their baby sister. If that’s her approach to loved ones, she’s going to lose people. Because that’s a very rigid, manipulative, and controlling way to love other people.", "Not a stranger. His sister. He chose his sister.", "Well, if her trauma is more precious to her than her son, then I guess that’s that.\n\nTaking in the child is not “causing harm” to his mother. His mother’s trauma is between her and her awful ex-husband. She has no right to dictate what relationship her children have with their sister.", "Is op supposed to leave a 7 year old alone on Thanksgiving?", "And all OP said is if she can't go, he won't go. That's not forcing the mom to see her. Much like OP can't force the mom to see May, the mom can't force OP to abandon a child. Which by the way she is a 7 year old child, the mother is almost 50, yes the child may hurt her to see but if she really loved her son more then hating May there is thing thing called being a damned adult (which may include just dealing with being near or, or seeing him at other times)", "And then when mom said his sister, soon to be his adopted child, couldn’t come, he said that he wouldn’t come. Not that he never wanted to talk to his mother again. That was her idea.", "who is two steps away from becoming his daughter.", "His mother is FULLY capable of seeing her son on other days. She is the one who made the \"never talk to me again\" ultimatum, not him.", "He’s choosing his sister, an innocent child, over a vindictive parent throwing a temper tantrum, & he is absolutely correct.", "You mean he’s choosing his sister? Funny how you didn’t call her what she is: his baby sister. Where did you get the strange idea that his mother gets to decide what relationship her kids have with their sister?", "He chose his sister who has no one else to turn to.", "He has chosen his sister, whose mother is dead and whose father does not want her, over his mother, who is a grown woman and is perfectly capable of taking care of herself.\n\nHelping the family member who needs it most doesn't even mean you are choosing them over someone who doesn't need help at all. His mother is vindictive and cruel, and is misdirecting her anger and hatred over her innocent son and his innocent sister. Her behavior is also proof that OP chose right.", "Then you need to read my comment to the end, because there I said she's an asshole for blackmailing her son by cutting him off after he refused to come alone, not for not wanting to see the child.", "In any way.  Is he going to talk on the phone and never mention her?  Mom realizes this.", "That still sounds like he made nice with the side piece.", "Your answer to what though? No question was asked in those comments. It’s not even entirely pertinent since the mom said no contact whatsoever, so it’s not just about big things where May would be there but even small things like phone calls.", "It happens a lot. Family can take custody for all kinds of reasons. Illness, military deployment, better school district...the parent just has to ok it.", "Certainly not.  She respected their boundaries by saying ‘okay - I will stay home then’\n\nThey’re vilifying her for respecting the boundary.  That’s what’s gross of them.  It’s outrageous.", "You adopt the kid then", "Her setting that boundary doesn’t make her the perpetrator. Her acknowledgment that the child is the symbol of her pain doesn’t make her an asshole.", "OP is asking not to be cut out of his family for missing thanksgiving. His family is refusing and is cutting contact with him.", "For asking not to be cut out of his own family? Really?", "You can hold your tongue all you want, people can tell when someone dislikes someone and I don't expect OPs mom to welcome the product of her husbands betrayal so easily", "No, having negative feelings towards the child doesn’t make someone an asshole, but acting on those feelings would. You can’t control how you feel, but you can control your actions.", "You are allowed to have boundaries. But cutting off your family over something like this IS an asshole one.\n\nThe OP didn't give the ultimatum \"if I can't bring May then I'm going no contact\" it was the opposite. OP said they will not leave her alone. Their mother is well within their rights to just say \"okay, well we'll miss you because I'm not comfortable having May there.\"", "Her mum can have boundaries, but her boundaries can’t determine what her daughter chooses to do, and it’s callous of the mum to imagine they should when that means punishing an innocent child to keep her happy.", "Yes, but then you are ignoring the fact that the mother made him choose between her and the girl that he is adopting.", "Every boundary has two sides; one person’s “boundary” is another person’s dick move. This sure looks like a dick move to me. The sins of the father are being visited on the son (or daughter). \n\nOP is being asked to choose between his little sister, who is innocent of wrongdoing, and the petty, cruel, and mean spirited members of his family. I think he’s making the right call. Who wants to spend the holidays with that sort of people?", "You can have boundaries and still have some empathy. This is not that child’s fault. Unfortunately too many people are just not that evolved.", "It’s not a boundary though. It’s willfully and completely disregarding a child for sins committed by their parents and punishing them for it. Like that is not a boundary. That is willful cruelty. OP is right to bounce.", "They absolutely can have their own boundaries, that does not mean that they are not assholes. Actions have consequences. When OP decided to raise his sister, his family could have welcomed her with open arms. They choose not to. The consequences of that is that OP will no longer be in their lives.", "There's boundaries and then there's trying to got and manipulate your daughter for not wanting to abandon her half sister/dependent on a major holiday about family. 7 is old enough to be in school and all the kids will talk about what their families did for thanksgiving. Being traumatized by her ex doesn't give her the right to demand her daughter traumatize her adopted daughter", "Isn't cutting OP out of their lives doing just that? To OP's mom, her husband chose another woman and now her son has chosen a different family", "Nope. Being an adult doesn’t mean you have to be around the product of your ex’s betrayal.", "If those family members never visit each other for the next decades in person, what kind of relationship is that? If they are never truly there for each other at important events?\n\nAlso May is a huge part of OP's life now and parents like to talk about their children. How close could they be even over the phone and internet if OP can't truly talk freely about his life? When he make trips and vacations with his daughter, how can he talk about them without mentioning her at all? What about all kinds of other activities? What about his home life? \"I made this or that for dinner because May love it\" should not be said. If he gets a GF/wife, he can't talk about her relationship with May. If he gets more children, he can't talk what they play with May. \n\nHis mother and sisters want nothing to do with her and I bet also don't want to hear about her all the time, while at the same time she will be such a huge part of OP's life that not mentioning her at all in any ways makes it impossible to truly speak with each other in more than a totally superficial way.", "Please answer me this question, let's forget OP for a sec. Let's say you have a boyfriend or girlfriend who you absolutely love. Let's also say that you tell this person that there is someone out there that has caused you tremendous pain in your life. Imagine now that your boyfriend or girlfriend decides to contact this person, and then wants to bring them around you. How do you think you would feel?", "He is making his dad's affair baby his daughter, and a permanent fixture to his life", "You’re really stuck on this idea that OP is the instigator here. He’s not.", "My answer to why this is happening.  Because Mom knows what's coming.  That's why she's going to do this.  Do you really believe that op can have a relationship with his mother that doesn't include his daughter in some way, even if it's just a mention?", "When your boundry is “abandon a child who’s mother has died and father is in the final’s of world’s biggest AH” then you become an AH.\n\nNot wanting to have the child in her home is a valid boundry. Going NC because OP isn’t inflicting pain (however you want to disguise what the intent is) on a child is AH behaviour.\n\nNo reasonable person can ask the mum to let the child in to her life so fast, but expecting OP to chose to hurt others to validate her pain is unreasonable. That’s intent. That’s not “for my well being i cannot interact” but “my pain demands the child suffers for the crimes of the father”.", "“Throw a whole child away” is not a boundary, boundaries are about what you are willing to tolerate directed at you not what other people are allowed to do with their lives.", "Op's choices have consequences, good and bad.  They're just going to have to live with them.", "They are seeing that they can’t really have a relationship with him anymore. It’s ok for them to acknowledge it and just end the relationship.", "Do you really think that op is going to manage to spend years keeping them apart?  Do you really think that op is going to manage to not bring up/say/share things about their new life and responsibilities to the family?", "Hey OP agreed no contact would be best when he was told by his mother she was done. He's made his choice to put the product of the affair over his own mother and sisters. Hope it was worth it.", "OP is her son.", "Her son isn't choosing a different family even if his mom does see that way. Loving a new family member, particularly a child who's done nothing wrong, doesn't take away any love you have for the rest of your family.", "That's a fallacy because while that would make sense in other situations, the fact of the matter in this case is that it's a child we are talking about here. A child who \"caused\" the pain by existing. No child has the fault. If it was the dad or the person who he had an affair with, it would be a different story. While I do understand if the mother can't handle the pain and may not to wish associate during the beginning, they should make an effort to resolve the conflicting feelings especially since the child got adopted by OP.", "Wait. You’re trying to argue that Mom has the right to blame the kid for existing? That “being alive” is the “pain” the kid is “causing”? That’s a loathsome line of thought.\n\nTo answer your question, no I don’t get to declare other people’s existence anathema and demand everyone shun them for existing, just because it makes me sad.", "They never said OP was an instigator. They are correct in thinking that it’s absurd to think a parent would never talk about their young child.", "I never said he was the instigator.  But he has made this decision and now there are consequences to it.  Also, I notice you didn't touch the question I asked.  Do you think it's possible for him to have a relationship with his mother where he never tries to bring them together in any way and never brings her up in any way whatsoever?  Where the child is completely and always a non factor?  Never a word said?", "OP didn’t make the choice to cut off his mother and siblings. They made the choice to cut him off.", "His mother didn’t say “we can’t really have a relationship anymore.”  She said not to bother contacting her ever again.", "She's more than a product of an affair. She's an innocent child who lost her mom and her didn't want her. She's also my half-sister. I understand where my mom and sister are coming from. But I would never force a relationship between them and May. I didn't ask them to invite me and didn't even expect an invite. I knew that taking her in would possibly forever damage my relationship with them. And whether or not its worth it. Well it is. I would it again without hesitation if it meant that I'd give May a good life.", "No, he is looking out for the safety of his own half sister.", "He made the choice to put an innocent child that is directly connected to him by blood; over his mother and sisters that are too full of negative emotions to even have the slightest bit of empathy to a motherless child that was abandoned by her father.", "Less absurd than a parent never talking to their adult child again at all?", "Yes, I do.", "What would be the point?", "I find it very telling who is calling an actual child a \"product of an affair\". She is your half-sister (their half-sister too btw, everyone seems to be forgetting that) and soon to be your daughter, stick with her.\n\nYour sisters might come along eventually, your mother might too, but don't bank on it. Give May her best life, that is your goal now.\n\nA lot of people are sympathizing with your mom and sisters, and I get it too, but at the end of the day they are adults. They should not put their anger on May and you. Here is the thing about NC, you don't harass your brother to announce it, that is just manipulation.\n\nRegarding what your friend said, is it fair to your mom? She obviously didn't ask to be in this situation, but neither did anyone else. Probably best to actually go NC for a while and give things time to cool down. Taking May in freshened up their trauma, but they will learn to deal, or not.", "While not caring about what his other siblings and mother are dealing with", "The negative emotion is warranted. The child's mother broke their home. They are every damn right to feel the way they do. Why look at someone who is just a reminder of a broken family? Innocent or not.", "So he's never going to talk about his daughter at all, in any way, to his family?  Well, if you believe that, then that's your belief.  I don't see it happening for any real length of time."]}