{"id": 31263, "submission_id": "17ynbde", "title": "AITA for fighting with my boyfriend because he has a friend that is sexually interested in me", "selftext": "Hi,\n\nThrowaway because my boyfriend knows my Reddit. I (26f) have been dating my boyfriend (25M) for 5 years now. We met in college. Our relationship has been really good and healthy so far until something happened last weekend.\n\nMy boyfriend has a big group of friends (all male) that he brings over to our apartment every weekend, they usually watch football or Game of Thrones or just hang out. I don't know these guys super well, I wouldn't call them my friends but obviously I know their names and jobs and girlfriends, etc, we're like accquantinces. \n\nThere's this one friend he has that I'll call Jake that I've always felt kind of uncomfortable around. He would always stare at me whenever he came into the kitchen and it always weirded me out. I brought it up with my boyfriend a few times. Jake is high functioning autistic, and my boyfriend would always bring that up and say he's just socially awkward and he's not trying to be a creep. So I left it alone.\n\nFast forward to this weekend, I was in the kitchen, and I hear them talk about NNN. I wasn't trying to listen in but we do live in a small apartment and the kitchen and living room are side by side. I heard my boyfriend saying he lost because of me, which I thought was kind of innapropriate but whatever. Then I hear Jake saying \"me too\" and all of them laughed. \n\nAfter they had all left, I told my boyfriend what I overheard and he kind of laughed it off. I pressed it though because I wasn't sure if I had misheard Jake saying he lost NNN because of me. Then my boyfriend said that was what Jake had said. I was stunned and extremely uncomfortable which I feel like is reasonable. I told my boyfriend it was really disgusting that he would let Jake say that about me, in our own house, while I was literally next to them, and I also brought up the fact that I've talked to him before about feeling uncomfortable with Jake.\n\nMy boyfriend got really defensive and said he knew Jake had a \"little crush\" on me but it wasn't a big deal. I was really upset that despite knowing that, he let Jake come into our house. Like what could have happened if no one else was around and we were alone? My boyfriend said i was being \"paranoid\" and Jake would never touch me or hurt me, but the fact that he masturbated to me (and I don't even know if it was to my Instagram pictures or some photo he's  taken of me that I don't know about or god forbid, something my boyfriend has sent him) still makes me extremely uncomfortable, and I told my bf that.\n\nFinally he said he would talk to Jake about it, but he kept bringing up the fact that he's autistic so he doesn't understand social cues and it was going to be difficult to explain why it was innapropriate to him. I'm just stunned because I don't understand how my boyfriend didn't stand up for me or say anything, and continued to allow Jake into our home despite knowing he's sexually interested in me.", "created_utc": 1700362530, "permalink": "/r/AmItheAsshole/comments/17ynbde/aita_for_fighting_with_my_boyfriend_because_he/", "score": 38, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I fought with my boyfriend because he has a friend who is sexually attracted to me, and I've epxressed being uncomfortable over it before. My boyfriend says I'm overreacting, and the friend is autistic so I don't know if that makes my worry offensive.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Autism is not an excuse for someone to be inappropriate, or to ignore if they’re making you uncomfortable.\nNTA, your boyfriend needs to do better with respecting your autonomy and ability to feel comfortable in your own place.", "NTA- the fact that he is ‘autistic’ may make it more dangerous but in another situation just bc someone is attracted to you shouldn’t mean they cant be around. This situation is obviously different as he is creepy and staring at you. But a well adjusted male should be able to be brought around even if he finds you attractive. Are you sure it wasnt just a joke on the NNN thing", "For those of us that do not use abbreviations/initials, what is NNN?", "NTA. Autism has absolutely NOTHING to do with this. He is being a creep. Even if it was “just because he doesn’t understand social cues”, your boyfriend should be telling him that he is being creepy & making you uncomfortable, not just using his autism as an excuse.", "NTA autistic with ADHD here. Whatever his status, that was gross. Your BF knew it was inappropriate and went along. He validated his friends creepy behavior and he has access to your home. He needs to acknowledge it was wrong and set boundaries.", "NTA , Jake should really know his boundaries because autism isn't an excuse for creepy behaviours, if your boyfriend isn't going to talk to him through this then you should talk to Jake to now more clearly about his intentions and what's going on, it's fine that he finds you attractive but he clearly knows you have a partner and he shouldn't act that way", "NTA but you are massively overreacting. This guy isn’t a threat, and his comment isn’t some massive disrespect. You heard guys talking like guys. If your man doesn’t think he’s a threat, you should trust that.", "Uhhhhh\n\nWow, this just doesn't seem like a big deal to me, like, not one bit. 🤷‍♂️\n\nI'll say NAH here, I suppose, only because if you feel uncomfortable then I don't feel it's my place to tell you you don't have that right. But this really feels like you're making a big deal out of literally nothing to me.", "Definitely not the asshole, it’s the way you feel so your boyfriend should listen and not make you feel like you’re overreacting. If this other guy has autism then it’ll mostly likely do more harm if your boyfriend doesn’t bring it up with him and he does something similar around someone who could get violent etc. \nAs a guy I’ve always found the whole NNN and the talk around it so weird and pointless anyway, it’s just strange imo.", "NTA - Ah, autism. Or should I say \"autism *wink*\". It is the new get out of jail free card for people who are wildly inappropriate and make others feel unsafe. This guy's behaviour is creepy as and a label doesn't excuse it. Be aware, people like this cause major trouble in relationships.", "[deleted]", "NTA, autism or not, a creep is a creep. I wouldn't want him in my home again. Your bf needs to find a new venue for his weekend friend stuff or next time he stares at you, call him out. \"Jake, why you always staring at me? It's weird.\" And then just dead ass stare at him and wait for an answer.", "NTA- but as long as the weird dude doesnt give off vibes that he would go and do anything to you i dont think its that big of a deal. Him saying that he lost NNN because of you could be an wgo boost to your bf bc he kniws your hot and his friends know it too. 99% of the time guys like that lose to a persons instagram so hes probably not taking creepy pictures. Noone is really in the wrong here its just different points of view for the same subject. If you really dont like him and think he is a real threat to your saftey talk about it if hes just kinda uncomfy to you maybe just let the guy be weird idk", "NAH - Jake made a joke. Yes it was inappropriate, but you were not the intended audience. Boys often make inappropriate jokes with one another, hence why they all laughed. That being said, your feelings are valid and you have every right to feel uncomfortable having heard it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi,\n\nThrowaway because my boyfriend knows my Reddit. I (26f) have been dating my boyfriend (25M) for 5 years now. We met in college. Our relationship has been really good and healthy so far until something happened last weekend.\n\nMy boyfriend has a big group of friends (all male) that he brings over to our apartment every weekend, they usually watch football or Game of Thrones or just hang out. I don't know these guys super well, I wouldn't call them my friends but obviously I know their names and jobs and girlfriends, etc, we're like accquantinces. \n\nThere's this one friend he has that I'll call Jake that I've always felt kind of uncomfortable around. He would always stare at me whenever he came into the kitchen and it always weirded me out. I brought it up with my boyfriend a few times. Jake is high functioning autistic, and my boyfriend would always bring that up and say he's just socially awkward and he's not trying to be a creep. So I left it alone.\n\nFast forward to this weekend, I was in the kitchen, and I hear them talk about NNN. I wasn't trying to listen in but we do live in a small apartment and the kitchen and living room are side by side. I heard my boyfriend saying he lost because of me, which I thought was kind of innapropriate but whatever. Then I hear Jake saying \"me too\" and all of them laughed. \n\nAfter they had all left, I told my boyfriend what I overheard and he kind of laughed it off. I pressed it though because I wasn't sure if I had misheard Jake saying he lost NNN because of me. Then my boyfriend said that was what Jake had said. I was stunned and extremely uncomfortable which I feel like is reasonable. I told my boyfriend it was really disgusting that he would let Jake say that about me, in our own house, while I was literally next to them, and I also brought up the fact that I've talked to him before about feeling uncomfortable with Jake.\n\nMy boyfriend got really defensive and said he knew Jake had a \"little crush\" on me but it wasn't a big deal. I was really upset that despite knowing that, he let Jake come into our house. Like what could have happened if no one else was around and we were alone? My boyfriend said i was being \"paranoid\" and Jake would never touch me or hurt me, but the fact that he masturbated to me (and I don't even know if it was to my Instagram pictures or some photo he's  taken of me that I don't know about or god forbid, something my boyfriend has sent him) still makes me extremely uncomfortable, and I told my bf that.\n\nFinally he said he would talk to Jake about it, but he kept bringing up the fact that he's autistic so he doesn't understand social cues and it was going to be difficult to explain why it was innapropriate to him. I'm just stunned because I don't understand how my boyfriend didn't stand up for me or say anything, and continued to allow Jake into our home despite knowing he's sexually interested in me.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA and jumping on the top comment to let every (I’m assuming) dude (or woman with massive internalized women hatred - and you- know you’re not over reacting. This is gross. Your bf should reinforce your boundaries and stand up for you.  And if you think otherwise now is a GREAT time to consider why no women you know want to be alone with you!", "Dangerous?", "I'm guessing \"No Nut November\"", "No Nut November. It is basically where you dont n(HOMOSAPIEN EJACULATION)t for the month of November.", "Yeah NAH for me. Her feelings are valid but I think OP is also reading too deep into it. Boyfriend defending his friend is understandable but should talk with them to make sure they understand OP's boundaries. OP should let it drop though as long as it's a one time offense. Guys make dumb inappropriate jokes all the time, but usually have better timing and place. This wasn't a good place, but friend's autistic.", "Jake. Not now.", "Because *if* he genuinely is unaware that his behaviour is unacceptable (which I doubt he is, to be clear) his behaviour will most likely continue to escalate", "Yeah if he stares at her and creeps her out and has a mental issue yes that means he probably has less control and less of an understanding of boundaries, its not really a question", "Another redditor told me what it meant.  I busted out laughing.  The things people come up with these days is just funny.", "That's just too funny.  Some of the things people come up with crack me up.", "*nod nod* yeah, I mentioned this above, but that's not actually how autism.works.\n\nAllistic and neurotypical dudes engage in the exact same behaviors, autistic men are not MORE likely to harass and assault ppl.", "None of those things has anything to do autism. OPs bf is one of those people who thinks Autistic just means asshole. That is incorrect, and just feeds into ignorant, ableist bullshit like thinking autistics are dangerous."]}