{"id": 3131, "submission_id": "z3lcef", "title": "AITA for refusing to go to MIL's for Thanksgiving after the turkey was inedible last year?", "selftext": "MIL is a phenomenal cook. This turkey is the first thing she made that I didn't like, but it was awful. I don't think MIL even basted it, so it was dry, overcooked, and like SFIL said \"tasted like saw dust\"\n\nThanksgiving is supposed to be our holiday with my husband's family. MIL does not like this and wants Christmas. As a result she usually treats us kind of shitty on Thanksgiving to begin with, but last year was a mess. \n\nNote I always offer to help with the cooking or bring a dish, and she always turns me down. so last year we arrived, she did her typical routine of ignoring us, and then she served all the traditional sides, this dry ass turkey, and she sat down with some meatballs that were just for her.\n\nEveryone asked why she was eating meatballs and she said it is her house. Her husband whined because he wanted some, but she said they were leftovers and there wasn't enough for him. She said turkey is stupid anyway.\n\nNo one liked the turkey so SFIL decided to grill some steak. He also made a turkey burger for his mom, but said that he wasn't cooking for anyone else because he isn't our \"slave\", so at this point MIL, SFIL, and his mom have different food, and me, my kids, my husband, SFIL's stepfather, and MIL's parents have this shit turkey.\n\nI felt humiliated and said I was leaving. MIL just rolled her eyes. I got some grief from MIL's parents about how Thanksgiving isn't about the food, but I snapped at them that my kids weren't going to be treated like shit. We left and went to a buffet. It wasn't great and the whole day was a let down. My husband acted like I ruined Thanksgiving because he said there were enough sides and we should have stayed as her sides were better than that shitty buffet.\n\nI set a boundary that I would never spend another Thanksgiving with her. She made us feel like second class citizens and she clearly can't cook turkey. Today everyone is mad at me and accusing me of being petty and ruining my husband's relationship with MIL. MIL is roasting a chicken this year, so I know we wouldn't have to eat dry turkey, but to me it is the principle. I am refusing to go, send my kids, and I told my husband he is free to go but I will be extremely hurt if he leaves his nuclear family to see mommy.", "created_utc": 1669300086, "permalink": "/r/AmItheAsshole/comments/z3lcef/aita_for_refusing_to_go_to_mils_for_thanksgiving/", "score": 57, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I know the holidays are really about more than the food, but I am saying we can't spend it with his side due to her awful food. I might be overreacting and taking it too personally when other people were treated the same way. My husband wants to see his mom and feels that I am unfairly favoring my family\n\n**[Check out our upcoming Reddit Talk with Iliza Shlesinger on Nov. 28th!](https://redd.it/z29rfu)** \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH.  Why aren’t you alternating holidays?  Compromise needs to happen on both sides.", "INFO: what do you do for Christmas?", "Wait,  MIL had meatballs, SFIL had steak,  SFIL mom had a turkey burger....and the rest of the group - if I'm counting right,  5 adults and an unknown number of kids - had crap turkey and sides? Right off the bat,  your MIL is a crap host,  especially since it sounds like she made crap turkey on purpose.\n\nBut there are many red flags around your behavior as well. \n\nESH\n\nThe holidays bring out the worst in people.", "I do think it’s shitty to designate your husband’s family only for thanksgiving and never for Christmas. That popped out as a red flag to me. It seems like you’re controlling, critical, and probably not a pleasant daughter in law and they are shitty hosts and there’s probably a lot of anger under the surface on all sides. You said she was ignoring you but cooking an entire thanksgiving meal is stressful and she was probably busy. \n\nYou said she is normally a good cook… she tried her best and isn’t even cooking turkey this year. Continuing to talk about how badly she cooked a turkey which is expensive and a lot of work is extremely rude. Let it go. \n\nThe father in law probably was the rudest one but you have a vendetta against your mil and are manipulating your husband by saying you will be hurt and angry if he goes to see his mommy?? Sounds like you already don’t let him see his family on Christmas.\n\nEsh.", "What principle? Thanksgiving isn’t about Turkey. Why do they get Thanksgiving not alternating holidays? This is such a strange argument, do what you want but everyone seems to have missed the pint ESH", "I'd be feeling some kind of a way towards a DIL who iced me out of ever seeing my child and grandchildren on Christmas, too, although I hope I'd hide it better. ESH", "ESH. You all should have been able to talk this through a long time ago.", "ESH.  You keep calling the kids \"my\" kids.  Are they not your husband's kids too?  If yes, you are going to keep the kids from seeing their grandparents on Thanksgiving?  And your husband is letting you make that decision by yourself?   You are shaming your husband for wanting to have a holiday with his mother, that's not a bad thing.  Your husband needs to grow a spine and learn to stand up to you.   You have made the decision that Christmas is always with your family for the big party.  **Now you are refusing to have even Thanksgiving with his family.**", "ESH.  Work it out.  Make concessions.  Have Thanksgiving at home and visit them for an hour or two.  Maybe visit them for an hour on Christmas Eve. Or do a brunch.    Or God forbid YOU host sometimes?  Or tell your MIL you and husband will bring the turkey.  Bring games for the kids.", "NTA\n\n\nShe purposely did that last year as a punishment.  Hopes that you will decide to come for Xmas since she intends on ruining Thanksgiving if you don't.\n\n\nTake your kids and go somewhere else.", "YTA. Your husband is right. There were lots of other sides and apparently they must’ve been decent enough since they were better than the buffet you went to. Why are you raising such a fuss over one dish? Clearly you care more about food than family", "INFO: Why does she want to have your family for Christmas so badly when she doesn't want 99% of your family over *at all*?", "YTA and quite honestly sound exhausting. It’s unfair that you’ve “claimed” Christmas and now won’t give your husband Thanksgiving either. It’s controlling and ugly behavior. And the “mommy” comment at the end is just mean.", "MIL Troll. Dude, at least take the holidays off.", "Borderline MIL troll. Weird, unsociable mother-in-law with some sort of vendetta against her daughter in law. Step-Father-In-Law who’s rude and unpleasant. Daughter-In-Law who’s making it all about her. Son without an discernable spine.", "This isn't about the turkey. It's about her behavior. NTA.", "NTA. The other day, it was fine for one wife to go to her family’s annual Christmas celebration, but today, it’s wrong for this family to do the same??? OP says her family makes sure the kids have fun, while the in laws make the kids play in another room. That’s not spending time together. OP says MIL treats her shitty usually. I’d say it’s true after MIL chooses not to eat a dry ass turkey but instead expects her grandkids to do so? MIL was fine with her husband making another meal for himself and his mom. OP may not come across as a peach, but idk who would want to spend a holiday with these in laws either.", "If no one likes turkey, why does she make it?  Chicken, ham, pasta are all good choices.  NTA", "Yta. How much attention are you expecting the cook to be giving while cooking a big meal for everyone? Turkey is garbage no matter how it's cooked, easily can have a full meal with just the sides, you made it more dramatic then necessary and you are going to cause major resentment with your husband by dying on this hill. You have an agreement that Thanksgiving is his side's holiday with your family, follow the agreement you made with your spouse for the sake of your spouse.", "tbh, nta. i don't understand how your husband can see how his mom treats not just you and your children like second-class citizens, but also him and the rest of his family, and be okay with that? yeah thanksgiving isn't about the food, but it's also not about treating people like shit during the holiday season because she can't get christmas", "ESH. Every single family I know of alternate holidays.", "INFO: when you say she treats you \"kind of shitty\" what does that mean?  If it was just the shitty turkey then a good turkey can fix that but if in general the day is crappy because of her, turkey or not, then yeah you don't have to go.", "\\[deleted\\]\n\nFair response below.  Am changing vote to NTA", "YTA. This is more than the turkey.\n\nDid you try the sides to see if they were cooked well and just the turkey was a fail? You say MIL is normally a phenomenal cook.\n\nWhy is Christmas never to be spent with ILs? Is husband happy with that? \n\nIt sounds like it is your way or no way for a lot of things. This isn't really about the turkey.", "NTA wow, SFIL is not your slave but you are his guests. I would rather monitor air conditions at the landfill than go to that house.", "NTA \n\nMIL really seems to hate u. find something better to do with ur kids. Thanksgiving is about family and happiness and MIL does not seem to understand.", "Man this sounds like a huge mess. Go do something else this year NTA", "NTA. Never mind about the turkey, but to be spending a holiday in that toxic environment would really be a big no-no, regardless of the quality of the food.", "NTA Really would you care if the turkey was great? MIL treats you like you all aren’t there. Arguing over leftover meatballs? The husband saying he isn’t a slave? WTH? Question is why does anyone go the house for a meal?", "YTA\n\nYou're controlling and unreasonable. It's not all about you, it's not all about the food and you're clearly looking to judge, hold a grudge and cause drama.", "I’d host in the future if I were you. \n\nBut NTA. She sounds delightful.", "NTA", "NTA. MIL deliberately ruined the turkey so that nobody would want to spend Thanksgiving there, justifying people coming there for Christmas like she wants. It's a passive aggressive controlling technique.\n\nYou can go to her Thanksgiving meal, but bring your own (edible) food for just yourselves, like they did as freaking hosts. Or, don't go, because they clearly didn't want you there for Thanksgiving.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMIL is a phenomenal cook. This turkey is the first thing she made that I didn't like, but it was awful. I don't think MIL even basted it, so it was dry, overcooked, and like SFIL said \"tasted like saw dust\"\n\nThanksgiving is supposed to be our holiday with my husband's family. MIL does not like this and wants Christmas. As a result she usually treats us kind of shitty on Thanksgiving to begin with, but last year was a mess. \n\nNote I always offer to help with the cooking or bring a dish, and she always turns me down. so last year we arrived, she did her typical routine of ignoring us, and then she served all the traditional sides, this dry ass turkey, and she sat down with some meatballs that were just for her.\n\nEveryone asked why she was eating meatballs and she said it is her house. Her husband whined because he wanted some, but she said they were leftovers and there wasn't enough for him. She said turkey is stupid anyway.\n\nNo one liked the turkey so SFIL decided to grill some steak. He also made a turkey burger for his mom, but said that he wasn't cooking for anyone else because he isn't our \"slave\", so at this point MIL, SFIL, and his mom have different food, and me, my kids, my husband, SFIL's stepfather, and MIL's parents have this shit turkey.\n\nI felt humiliated and said I was leaving. MIL just rolled her eyes. I got some grief from MIL's parents about how Thanksgiving isn't about the food, but I snapped at them that my kids weren't going to be treated like shit. We left and went to a buffet. It wasn't great and the whole day was a let down. My husband acted like I ruined Thanksgiving because he said there were enough sides and we should have stayed as her sides were better than that shitty buffet.\n\nI set a boundary that I would never spend another Thanksgiving with her. She made us feel like second class citizens and she clearly can't cook turkey. Today everyone is mad at me and accusing me of being petty and ruining my husband's relationship with MIL. MIL is roasting a chicken this year, so I know we wouldn't have to eat dry turkey, but to me it is the principle. I am refusing to go, send my kids, and I told my husband he is free to go but I will be extremely hurt if he leaves his nuclear family to see mommy.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "mil troll, do you not have a family to spend Thanksgiving with? Or are you just taking extra time for your weird fetish this holiday season?", "YTA you refuse to alternate holidays so it's on you", "I don’t think mil dislike you as much as you dislike her.\n\nThe last line throws you so deep into asshole land that you can’t find your way out without a map. \n\n“Told my husband he is free to go but I will be extremely hurt”\nHow is that free to go? You are being emotionally manipulative.\n\nWhy can’t you swap the celebrations? Or do what normal people do and compromise. Celebrate Christmas one day earlier or later with the other set of parents.\n\nWhy is it only your way or the highway? Are you a dictator or is the marriage a partnership?\n\nOh.\nYTA.\n\nOh so YTA.\n\nVery very YTA.", "Christmas is really important to me and my parents have a huge party which my kids love. MIL's Christmas is not child friendly and they would be bored.", "Go to my parents house as they have a huge party every year with lots of stuff for the kids. My in laws Christmas just isn't child friendly and my kids would be bored", ">It seems like you’re controlling, critical, and probably not a pleasant daughter in law and they are shitty hosts and there’s probably a lot of anger under the surface on all sides.\n\nAnd OP keeps calling the kids \"her\" kids. Another red flag.  They're his kids, too (OP calls them his nuclear family).  OP appears to be making a lot of unilateral decisions.  I think you have nailed this situation perfectly.", "She clearly cooked the turkey to come out like crap on purpose or she wouldn’t have made something else for herself. MIL was acting like a child who didn’t get her way bc she’d rather have them over on Christmas. Plus she was rude to all the other guests by serving them horrible turkey on purpose and having something better for herself. She wasn’t just being petty to OP, she was rude to all her guests. And her husband wasn’t any better by then preparing separate food for himself and also being rude to all their guests. They sound insufferable and it’s no wonder OP doesn’t want her Christmas ruined by her petty ILs. I agree they should probably rotate holidays, but based on the ILs behavior, that probably wouldn’t be enough for them anyway. Who is rude to a houseful of guests just bc they are mad that they don’t get to dictate where their adult child spends their holidays?", "A lot of claiming people. Her kids. Her family. Usually family is more than just the nuclear family and one set of grandparents. It just sounds like everyone is being childish in this situation. Except for the kids. They are being pulled around like possessions.", "but MIL's christmas isn't at all enjoyably for my kids. There are no other kids there, conversations are not appropriate, she makes no effort to include foods they like", "She just doesn't interact with us much and gets an attitude when I offer to help. If we point that out she rolls her eyes and says \"well you aren't nice to me either\" She allows her husband and his mom to be rude and sighs loudly when my kids act like normal kids.", "is it for being ignored and being served badly made food on purpose?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Christmas is really important to pretty much everyone 😌", "Idk why you're being downvoted. If grandma wanted you and the kids there she would be more welcoming and a better host. She isn't being child friendly, she isn't being welcoming, and you have every right not to feel anxiety on the holidays. NTA.", "This repeated answer is so lame! Are you not aware that learning to be bored sometimes is good for kids?", "I don't really get this, tbh. My sister is always on my case for calling her \"my\" mom, but she isn't \"our\" mom in 97% of conversations I have when I'm talking about her. I don't think she's only mom mom, I'm just used to talking about her to people who aren't also her child.", "So this really isn't about the turkey then but about general shitty treatment making you feel unwelcome and unwanted.  I think your husband should have been talking to her long before this.\n\nedit:  I think there is more to this story so I am going to withhold judgement as \"you aren't nice to me either\" means there is a lot more to this imo.", "Question: When your kids are acting like \"normal kids\", how are they acting? Are the kids actually being good or are they being onery and acting out?", "But I think making it magical for the kids is the most important thing. My parents do that. MIL does not", "If there’s any anxiety that the kids are feeling , it’s more likely due to their controlling mom causing a scene and making them eat at a buffet for Thanksgiving rather than being “bored.”", "How is it lame to not want your young children to be bored on Christmas? There’s plenty of other days that can be “teachable moments” about being bored. But yeah, let’s ruin their Christmas to prove a point about learning to handle boredom. Wtf?", "It is but on Christmas ? Really?", "He has talked to her but she just shits down", "MIL is an art dealer and her house looks like museum, so if they forget and run in the house or get rowdy at all, I can see her cringe. She has zero patience for any type of whining or tantrum, which I get suck, but they are age appropriate. My three year old called the food gross once (not the shitty turkey) and MIL glared at her and said \"see I'm not allowed to say that about your mommy's food\"", "Letting your kids have a good relationship with both sets of grandparents is the important thing and just because it’s lower key doesn’t mean it’s not good enough.", "I can understand your MIL perspective on running in her house. When kids go to certain houses and places things will be different. My nieces and nephews aren't allowed to run amuck at my house or at their grandparent's house. The kids learned that not every place they go is their playground and that's a good thing. It is teaching them the difference between places to play and places to respect.", "It isn't because it is low key. It is because there is nothing there for the kids. If they want to play she wants them to leave the room. she makes no effort to include foods they like, and there is a lot of inappropriate adult conversation going on. I'm not disallowing it, but she makes no effort and my kids find her boring", "How would you even know if she never gets Christmas?"]}