{"id": 31322, "submission_id": "17z9dxi", "title": "AITA for telling a waitress if she could stop switching from english to spanish when speaking to us", "selftext": "This morning i went to a restaurant that is super country lol. It rhymes with packer barrel, if you know you know. I get seated before my mother and brother because they’re parking and the waitress greets me in english and i order us some waters. My family arrives and get seated and when she brings back the water, she starts to speak spanish to my mom & only my mom. She then talks to me in english and then english to my brother and then switches back to spanish to my mom and it was honestly just annoying.\n\ni know her intentions were well but she just assumed my mother didn’t speak english because of how she looked. i was a bit blunt but i asked if she could just speak english as my mother knows english. i am not the best at my delivery at times and i admit that. i myself work as a server and never assume anyone speaks spanish unless they ask me if i speak it. i get where she’s coming from but she explained herself by saying we have a lot of guests that speak spanish and she looks like she does which she does but i just don’t appreciate the assumption. just wanted to get thoughts on this lol.", "created_utc": 1700434173, "permalink": "/r/AmItheAsshole/comments/17z9dxi/aita_for_telling_a_waitress_if_she_could_stop/", "score": 209, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) i asked the waitress to speak to us in english \n\n2) i think it could be interpreted badly because of how i phrased it. but i do think it’s more rude to assume someone speaks spanish based off how they look and the fact that we were all speaking in english when she walked up. i also kept speaking in english and she continued to speak in spanish until i told her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Only question I have is why you avoided saying ‘Cracker’ in Cracker Barrel..", "INFO : Was your mom annoyed too or was she happy to be served in spanish?", "YTA.\n\nIf your mom was offended or didn't want to speak in Spanish, she would have simply said so.  Far from being \"annoying\", having a bilingual waitress is a blessing.", "YTA. You can't write a question in English properly, yet you have the hide to carry on about somebody who's bilingual. SMH.", "YTA \n\nBased on your comments.  Your waitress was Hispanic.  Saw that your mother was also Hispanic and thought maybe she would be more comfortable conversing in Spanish….\n\nThe only offended person I see is you.", "YTA\n\nTbh, your post comes across as rather racist. I married an Asian woman and it was always like this when we went out to Chinese restaurants. I actually quite liked it because, even though my wife spoke flawless English, she’s definitely more relaxed speaking her native tongue. And she doesn’t get to speak it all that often so it’s a treat.\n\nThe waitress didn’t assume your mom didn’t speak English - she assumed your mother would prefer to converse in her native tongue. I’d bet your mother even appreciated the waitress doing that as a sign of respect.\n\nNobody was offended except you.", "Honestly YTA\n\n1. From your comments your mother wasn't upset about it, so why would you be?\n\n2. This happens to everyone. I'm from Portugal, when I'm visiting Spain people easily confuse me with a Spanish person and speak in Spanish, but if I go to a northern european country people look at me and speak English. It's perfectly normal.", "YTA\n\n>she just assumed my mother didn’t speak English\n\nThat’s *your* assumption.  Maybe she just wants to practice her Spanish, geez.  Maybe it’s easier for *her* to speak Spanish.", "YTA You sound exhausting!", "Bro, she was a waitress. A waitress. Aka working for tips. It’s pretty safe to assume she was trying to be nice, if your mother had just answered her in English, signalling a desire to communicate in English, she probably would have stopped immediately.\n\nSoft YTA for making something out of nothing.", "Yta your mom is an adult. If it bugged her, then *she* can address it.", "Info - how does your Mum feel about them speaking Spanish to her? \n\nBased on your post so far I'm more inclined to say YTA especially if your Mum is someone who communicates more easily in Spanish. A lot of customers would feel uncomfortable asking a waitress if they speak Spanish and this waitress is very clearly trying to be accommodating here. I can understand where your discomfort is coming from but I don't think it's necessary to say anything unless Mum prefers English\n\nEdit - realised you addressed this on other comments OP, sounds like Mum really wasn't phased so it's your problem and you chose to speak on Mums behalf even though she didn't have an issue so I'll stick with my (soft) YTA", "Imagine crying over something so innocuous and making some minimum wage workers job even shittier than it already is", "Oh yeah I know what you’re talking about, I went there before (but like a different one)\n\nAnyways YTA You sound kinda racist.", "YTA for what you did and then writing about it in a such a long, tedious, rambling rant.", "I feel like if your mother wasn’t offended by it then it shouldn’t have been considered offensive. I bet your younger and feel a sense of duty because the waitress may have seen what your mother looked like and assumed she spoke Spanish, and you wanted to speak up. It might have been inconvenient for the table but nothing to get mad abt.", "YTA", "do you know how lucky you are to be at a cracker barrel and they're speaking Spanish to you? you know the environment. your mother should have addressed that herself. if she didn't want to speak Spanish, she'd have switched to English. YTA.", "Yta", "YTA. Your mom encountered a fellow Hispanic person and they decided to converse in Spanish, potentially to make it easier on both of them. That’s all it was. If you thought your mom was bothered, you could’ve asked her when the waitress wasn’t around or you could’ve let your mom speak up if she wanted to.", "I dno why but this posts reads off as if you have some weird hatred for Spanish? Is it bad to know only Spanish? Why couldn’t you just ask her to speak in Spanish to everyone? I guess I don’t understand what’s insulting about the server speaking in Spanish with your mom instead of English.", "Why dont you just wear a sign on your forehead to avoid these things…\n\nComplaining about this is dumb af. Calm ur tits and tip your waitress", "Yup the AH for sure. You sound sad you never learned your native language", "Why even post this here? A whole lot of nothing.", "YTA", "YTA \n\nRegardless of race, I’ve been out with my parents and the server or host will speak in the same language. I’ve always felt it was a way for them to connect and build bridges, along with making them feel at home.", "YTA. If your mother didn’t want to speak Spanish, regardless of whether she speaks that language or not, then she should have responded in English. It’s not your job to tell everyone what language they should be conversing in.", "TEC (Tu Eres el Culero)... No seas mamón!", "YTA. Why did you feel like making a non issue into an issue? Did your mom even care?", "YTA", "What's the problem exactly? Does speaking Spanish have any negative connotations?", "YTA.  And also, YOUR English isn´t as good as you think it is either, compa.", "\"Omg. How dare assume my mom's ethnicity? Im offended that you were both conversing in your native language.\"\n- OP", "Folk like OP are the reason I never go to this chain anymore. It's like Cracker Barrel is the official restaurant of Next Door users.", "You suck.  YTA.", "Was your mom offended? If so, couldn't she have said something to the waitress?", "Your mother could have just responded in English.", "YTA you make this all about you. Don't you know your mom's language?\nDid you take a moment to ask her what are HER fealings about this? Don't you think she might be happy to talk in spanish? Of course they are assumptions on everything innlife it is human. If she couldnt talk in spanisg she could just say that she dont and things could go on. You are making a big deal with nothing.", "YTA. If your mother was bothered, she could have said something herself. You butting in and saying it for her is infantilising.", "YTA\n\nWhy do people that used to work as servers treat servers horribly? My MIL used to be a server and she treats every server like crap when we go out to eat.\n\nDid your mom ask you to tell her to speak to her in Spanish? Or was it just annoying for just you?", "YTA. Your mother speaks Spanish. Your server was being thoughtful. Get over yourself.", "YTA, you made it seem like an insult that she assumed that your mom is Spanish, plus your mom can speak up she's an adult.", "YTA\n\nSome of our population, no matter how little or how long they've lived here in the US can find it easier to talk with someone that shares the culture or the language. Call it a taste of home. Anyone of us, immigrant or native, can relate to that.", "YTA - you just sound annoyed cause you couldn’t understand her. She was being super nice to your mum.", "you’re a major AH", "Massive YTA  Why?   Because if your mom didn't want to speak Spanish she could have replied in English and if you wanted to speak Spanish all you had to do was start speaking it to the waitress.   Your mom isn't a toddler, and neither are you.", "YTA. If your mother was insulted she could have perfectly said so herself. In two languages.", "ESH, you were rude about it and the waiter should've asked first.", "INFO: Do you speak Spanish and could you tell what they were saying? Did your mom speak Spanish at *any point* before being greeted by the waitress or did she carry a heavier accent?", "Sounds like you wanted to find a reason to be offended, like an annoying gringo would.", "Wait the responses here are very surprising to me. The context is different I guess because the waitress is hispanic and Spanish-speaking, but I'm Asian and would never go up to random brown people and start speaking Spanish to them without asking first. I've even heard brown people fucking up with this, but again they usually start by asking. Like a lot of my desi friends have been asked if they're Latino before, but Latinos have never gone up to them just speaking Spanish/Portuguese. If y'all are scared of the \"racism\" label, I think assuming someone speaks a language is a rude thing to do regardless. It's definitely ok if you ask first though. The assumption is the weird part. Anyway, ESH because your mom can speak up for herself if it bothered her. But I disagree the people saying it's irrational to be bothered by this.", "Being thought of as Hispanic is offensive to you? The server did not assume anything negative for you to be offended about.", "Context? In which country do you live? What language do you speak ? Etc", "NTA. It's common practice and standard in many fields of hospitality to pick one language to communicate in. IE the dominant or national one. Unless the guest indicates they want to communicate otherwise, this should be the standard. Otherwise it risks making others in the party feel alienated and excluded. It isn't a race thing, it's just professionalism.", "[deleted]", "nta. it's understandable that the waitress was trying to accommodate the needs of her customers but assuming someone's language proficiency based on their appearance is uncalled for. communication should be respectful and inclusive regardless of language.", "Does your mother speak spanish?", "NTAH   I have worked in the hospitality industry for over 20 years. I was taught early on that in an English speaking country, you speak English to your guests, and don't assume to speak in any other language unless you are asked by the guest. If a guest asks if you can speak in French, Spanish, or German then it is totally fine to switch. You don't assume.", "NTA", "nta. it's understandable that you found it annoying and inappropriate for the waitress to assume your mother doesn't speak english based on her appearance. communication should be done in a way that is respectful and inclusive to everyone.", "nta. it's perfectly reasonable to ask the waitress to speak english if your mother already knows the language. assuming someone's language proficiency based on their appearance is unfair. good on you for standing up for your mom and promoting inclusivity.", "If she could stop, then WHAT?   Where is the rest of your question?", "nta. it's frustrating when people make assumptions based on appearances. communication should be based on mutual understanding and assuming someone's language proficiency based on looks is unfair.", "nta. it's important for waitstaff to be mindful of assumptions based on appearance. communication should be inclusive and respectful to all customers.", "NTA, fuck that multilingual country BS, a country NEEDS to a have an official language and everybody in that country NEEDS to be able to speak that official language.", "NTA.", "NTA.. It's kind of rude to assume someone speaks this language just because of how they look. I'm Jamaican, but It doesn't mean I speak the language. People saying how this Is racist need to stop. It's not racist at all... It's actually rather racist to assume someone speaks Spanish because of how they look.", "I'm impressed you found a waitress at the placard Darrel who spoke Spanish and tried to make your mother comfortable.  \n\nThe CB aesthetic seems more like they would refuse to serve you in any other language and maybe super slow and condescending English.", "Youre not an AH, but really, this is not a big deal at all and you are making it a big deal. If someone assumed i knew spanish (I dont) but Id find that really neat!", "I understand what you’re saying about making assumptions based on people’s appearances. I know that happens all the time and often in explicitly racist ways so I can see why you’d be sensitive to it. \n\nGiven everything you’ve described, I also understand why the waitress might have assumed your mom might prefer to speak Spanish with her, and it sounds like your mom in fact was happy to speak it with her. \n\nSo I guess I’d say NAH, just crossed wires.", "In the United States,  English is our first language.  I wouldn't go to Mexico and speak mandarin, and expect perfect interactions.", "nta. it's important for people in the service industry to be mindful of assumptions based on appearances. communication should be conducted in a language that all parties understand unless stated otherwise.", "nta. it's frustrating when assumptions are made based on appearances. the waitress should have treated everyone equally and not assumed your mother's language based on how she looks.", "nta. communication is important and assuming someone's language proficiency based on their appearance is not fair. it's good that you addressed the issue calmly and expressed your concerns.", "ESH. You were rude but it was also. Wry rude to just assume that your mother couldn’t speak English.", "INFO how did your mom feel about the waitress speaking in Spanish to her?", "YTA", "YTA\n\nMan,  people look for anything to be upset over! Take a chill pill. Not everything is that serious", "The post makes no mention of Mum’s opinion, which would be very relevant here, so I’m guessing she’s the one calling OP the AH. \n\nYTA.", "Nta. No one should assume what language you speak without asking properly", "If your mom didn't want to converse in Spanish, couldn't she simply have responded in English? This seems like a very small issue, unworthy of your emotional energy.", "YTA and come off as pretty racist tbh.", "YTA 💯.", "Yta. Internalized racism and inferiority complex.", "NTA. The server thought she should speak to your mother in Spanish because of \"the way she looked\"?  That's  racial profiling and no, it's  not okay.", "YTA \n\nThe world doesn’t revolve around you and what you want. You are not the main character. Grow up.", "Based on your first two sentences, without reading the rest, I’m gonna make a very safe bet that you are in fact an asshole.\n\n(Reading the rest confirmed my theory)\n\n((Based on your replies my theory is double confirmed))", "\"AITA for telling a waitress if she could stop\"\n\nAsking. You *asked* her if she could stop. It's either \"asking if she could stop\", or \"telling her to stop.\" Can't be both.", "You were able to crack the mysterious code!", "If you know you know.\n\nLol what a weird fucking way to phrase that.", "because i wasn’t sure i could name locations on here lol. is there anything else you’d like to be upset about?", "iF u nO U nO", "she was just responding back in spanish so you could say she was indifferent to it. it really was more so me being offended on her behalf honestly lol. but we have had a similar instance where a white waitress did the same thing and she was offended by it that time. for more context this waitress was hispanic this time.", "Quite.\nIt could be argued that OP's mother should,/could be offended that her child thinks she isn't capable of speaking for herself. But it seems the mother doesn't indulge in her child's hobby of being recreationally offended.\n\nGrow up, OP.", "OMG that made me lol.", "Also, she could have just been excited/more comfortable to talk in Spanish. It likely was more her assuming OP *didnt* speak Spanish and switching to English than assuming that OP’s mom *only* spoke Spanish.\n\nEdited to change English to Spanish", "Yep the same thing happens with my wife. I don't get offended, it's awkward for two people with the same first language to speak in their non native language to each other. Not only is it unnecessarily more difficult, but many cultures are competitive about their English skill.\n\nAnd yes, this is very common, and usually after they first started speaking English and realized they're both more familiar with the other language.", "What i don't understand, is if the mother had an issue with the server speaking in spanish, why wouldn't the mother say something?\n\nThis is another case of someone getting offended on behalf of someone else and it needs to stop.  It's just another way of saying, they are to stupid to know to be offended  so someone has to speak up for them.", "Yeah I was getting a bit uncomfortable with how the OP came across.  I grew up with my parents speaking Spanish to multiple people who would then speak to me in English simply because it was easier and faster to communicate and I did not see an issue with this.  \n\nOP was the only offended and did not even let his own mother decide what to do on her own.  That's...nah, that's not cool. YTA", "This just in, people from other countries that rarely get to speak their native language to other people get excited when they get to speak their native language to other people! \n\nIncredible that you had to spell this out. I can’t imagine getting annoyed by it, I love hearing other languages, even if I *am* sat there like an 8 year old waiting for everyone to stop talking about politics so I can tell them about my sick new Lego set", "FYI they speak Chinese to your wife because there's a secret Chinese only menu which has more authentic food for sale rather than the western stuff.\n\nBut some things are more easily understood using the native words rather than finding the English ones and then having to translate them back to what people know.", "Speaking in Spanish to someone based on their looks is racist. There’s nothing racist about the post.", "[deleted]", "Jeez - assessing someone's looks and skin colour and changing behaviours towards them, including speaking a different language while assuming that the two people who are obviously her adult children don't speak the language but still speaking Spanish, is now a sign of respect? \n\nIts actually not cool to jump languages between people exclusively based on how they look. If her sons were translating into spanish for her, sure, switch everyone over if they don't mind. But so many assumptions were made because of her looks. Everything about it is racist.\n\nIf there was a black person with them, and the waitress greeted them in swahili, that would be respectful too?", "i can see how you think that. and i will reflect on this but i do genuinely think it’s much more rude to just assume someone speaks a language because of how they look. but thanks.", "Agreed I’m really trying not to be offensive with this but. The waitress is as Hispanic.  The mom as Hispanic.  Why wouldn’t she try and converse with her in Spanish?\n\nWhere I live we have a high Hispanic population.  The younger generation does know how to speak English.  While the older adults speak limited to no English.  So I don’t really fault the waitress for attempting to speak what she assumed was a native language.\n\nEdit-Wording", "Honest question from a curious fellow-redditor: how close is Portuguese to Spanish that is spoken in Spain? Can you understand it easily? I unfortunately speak no languages (well) other than my native English, but the subject fascinates me.", "she didn’t assume that by speaking to only one member at the table in spanish and nobody else? and if it was the latter, customers are not there to improve your spanish skills or help you practice. she could’ve simply asked before just proceeding with spanish. it’s really not that hard of a thing to do.", "Indeed. Imagine having to live with this.", "Why do you assume it is a minimum wage job?  Many servers are actually paid more than minimum wage.", "“She just went with it, so you could say she was indifferent” - OP\n\nYou’re 100% right, if she didn’t want to speak Spanish, she wouldn’t have. OP got mad over something that the mother didn’t mind", "i actually did tip haha. i wouldn’t stiff anyone for that. i just think someone assuming someone speaks a language because of how they look is rude. but thanks for the feedback", "LMFAO no he escuchado esa frase pero es genial. ¿Si uso solo TEC, gente me entendera o no?", "HOW DARE YOU ASSUME MY MOTHER SPEAKS THAT LANGUAGE", "Interesting. I just quit going because it sucked", "i honestly do think i came off rude and i wish i could’ve rephrased it. but that’s for me to relive in my head for the next few days haha.", "It’s Cracker Barrel. Where do you think they live?", "yeah i honestly just wish she would’ve asked what language we would prefer to be spoken to instead of assuming my mom didn’t know english. that would have avoided the whole situation. i know she didn’t have bad intentions and we live and learn haha.", "Hispanic woman conversing in Spanish to another Hispanic woman.  The audacity.\n\nYTA op.\n\nIf your mom was offended she could have said so.  She doesn’t need you defending her.", "lol OP is strange", "I only typed one sentence, never said I was upset? I asked you a question, sorry if that was too much for you.", "On the Internet you can literally say any thing you like. This has positive and negative consequences.", "No one seems inappropriately upset here but you. If your mom was offended , she could speak for herself - in English and Spanish.", "Wow, you’re a dick.", "…like speaking Spanish to someone who speaks Spanish?", "i guess we could ask you the same question 💀", "… so you went to your mother’s defense without asking her for her preferences first? YTA.", "> me being offended on her behalf\n\nIt is not your place to be offended on behalf of anybody else.", "Do you seriously not see the difference in the situation when a white waitress spoke to her in Spanish versus a Hispanic waitress? Your sensitivity this time around is misplaced and if you can’t see that, ask your mom to explain it to you. Isn’t that easier to do than asking strangers on Reddit with various levels of cultural sensitivity?", "If your mom wasn’t offended, you can’t be “offended on her behalf”. 🤣", "Op didn’t speak Spanish you mean?", "The really surprising part is that it was her ~~his~~ own mother. You see this behavior quite often with people that have little exposure to other cultures or languages and feel everyone should speak the same language. (Almost always American English).\n\nEdit: Gender correction.", "I was with my mom and step dad at a Chinese restaurant one time. He's a \"foodie\" and likes to try new things. So while ordering we see a waitress taking an interesting looking dish to a table of Chinese people. My step dad says, \"Hey I'd like to try that dish\". The waitress looks over at it, then back at him and says, \"No, sir. You don't want that\", lol. He just said okay. I always thought the \"secret Chinese menu\" thing was a myth.", "I agree about using native words - especially over ethnic food. \n\nAs a side note, in our case, they don’t speak Chinese to her because of a secret menu - we never, ever eat at those kinds of places.", "Oh, c’mon. My wife is Taiwanese and MOST of the time I’d go to an authentic Chinese restaurant the waiters ask her if she speaks Chinese in Chinese. That’s not racist in any negative sort of way - it’s a sign of respect. \n\nIt also happened occasionally in Korean or Thai places - my wife would just say no, I’m Taiwanese and both sides laugh a bit. It has never been offensive to anyone in my party.\n\nSame thing with his mother and the waitress.", "A latina woman (the waitress) greeted another latina woman (the mom) in Spanish. I do not see how that’s racist. Latino people recognize me as latina (though I’m not fluent in Spanish); I understand why they’d greet me with it.", "Oh jeez - it’s stereotyping, not racism. \n\nA racist inherently believes in the inferiority (or superiority) of a different race. That’s bad.\n\nWhile stereotyping does over generalize  by race or appearance, there’s often no inherent judgement behind the stereotypes. And different races or nationalities stereotype and joke about their own characteristics all the time - and no one considers them racist. \n\nAs I said in my post, every single time we go to an authentic Chinese restaurant, the wait staff speaks to her - and only her - in Chinese. No one has ever considered that remotely racist. You’re being ridiculous.", "Sounds like the \"I don't see colour\" version of what is and isn't racist", "I’ve addressed more this more elaborately in other replies.\n\nYou’re confusing racism with stereotyping.\n\nRacism is inherently about thinking one race is inferior (or superior). That’s bad.\n\nStereotyping may over generalize racial, ethnic, or religious characteristics, but there’s not the inherent judgement of those characteristics. It’s also the backbone of many hilarious ethic comics. \n\nGo on a European tour and they’ll almost certainly make jokingly stereotype of all the nationalities. It’s hilarious as most people know there’s a grain of truth in them and they don’t take it so seriously.", "> assessing someone's looks and skin colour and changing behaviours towards them\n\nThank you. I was beginning to think I was in crazy town, here.\n\nThere is absolutely no reason to assume that (for example) someone with  dark hair and olive skin is a Spanish speaker. You should greet them in the dominant local language, and if they choose to engage you in another language, proceed.", "We don't know that the waitress thought the mom couldn't speak English. The waitress and mom may have just been more comfortable speaking Spanish. I'm sure the waitress *heard* the mom speaking Spanish, not that she assumed it based on her skin color. I mean, if it were based on skin color, if OP is her bio kid then I'm sure the waitress would've spoken Spanish to OP too. I speak Spanish and let me tell you, I've talked to many people who prefer speaking Spanish despite being fluent in English. When I worked at build a bear, I had guests who talked to their kids in English and talked to me in Spanish despite it being my second language (and despite my lower level of fluency). At the end I asked her why and she said she just likes getting the chance to speak it because her kids and husband don't. She spoke English better than I speak Spanish but we had no issues with understanding each other even if my Spanish was a bit clunky and yet she still preferred it. A Mexican restaurant I frequent has servers that speak a bit of English but not much and they speak to me in Spanish exclusively. They could serve me well enough in English but they prefer Spanish, you know? It's their native tongue, and in a country where you don't get to use it often, it's refreshing for them. I've literally heard that from so many people. I even just wrote an entire eight page essay about codeswitching for a final and this was a major point in it. That's why your Swahili example has literally no bearing on this situation. The vast majority of black people have origins going back hundreds of years here and they've only ever known English, but this *isn't* true for many Hispanic immigrants and their families and it's honestly rude to compare their experiences. If anything, you're the one being a bit racist by lumping them together as minorities when immigrant populations are completely different than well established minority groups.", "I don't see how it's offensive. I'm Malay Chinese and have had people speaking to me in Khmer, Japanese, Korean, Tagalog. Sounds like your mom was okay with it too. I don't know about their fluency but maybe the waitress or your mom were more comfortable or enjoyed speaking Spanish.", "I agree the waitress was profiling based on appearance. For me, that’s ok and I take it as an act of respect.\n\nThat occasionally happened to my wife if we ate at Korean or Thai places as they ask if you speak their native tongue. My wife would just say, laughingly, no, no I’m Taiwanese and both sides would laugh and just use English - it’s never been a negative interaction.", "It would’ve been offensive if your mother didn’t speak Spanish. Do you think by speaking in Spanish, the waitress was looking down upon your mother? Maybe you feel she didn’t think high enough of your mother to speak to her in English? That is if you think Spanish somehow reflects poorly on your mother? I get that. But it’s not right. Language is just that. A language. You were rude asking her to switch to English on your mother’s behalf.", "Do you think speaking spanish is negative or shameful? Why are you so offended that someone assumed your mother speaks spanish?", "And it's been pointed out by others here, it's more that someone's first language is more comfortable to speak in - it doesn't mean anyone assumes you don't speak English.", "How good is your Spanish?\nDo you know what she said to your mother?\nDo you know that she didn't ask, in Spanish?\n\nYTA", "She was talking to your mother and your mom replied. I dont see how its any of your business what they are talking about. Perhaps you are insecure because you never learned you mom's native tongue?", "Not at Packer Barrel.", "I have a friend whose parents immigrated to the US from Mexico in their early 20s. Friend was born in the states and does not speak any Spanish other than a few basic phrases. People will look at him, where he lives (5 minutes from the US-Mexico border) and begin speaking Spanish to him. They get majorly offended when he just looks at them unable to respond because he doesn’t understand what they said. (He studied Japanese as his secondary language in college and French or German in high school).", "It's crazy how the current gen takes offence to anything and everything \n\nIf someone look chinese I will speak to them in mandarin. If they don't understand they tell me hey I don't speak mandarin, I speak English. I apologise move on and continue the conversation in English. Same thing if they look Hispanic or Korean or whatever.\n\nThat's what languages are for! To converse.\n\nSince when did we start getting offended for using languages!?!?! Since when we gatekeep which language is allowed for public conversation. Since when English is the de facto compulsory language to converse in or else its super rude to do otherwise.\n\nIf u don't understand a language, tell the other person u don't and what u speak. There's nothing to take offence at\n\nIf someone doesn't understand your language, then the person should let u know, and yall can converse in whatever best you both understand. There's nothing to take offence at\n\nEverything can be done in 5 seconds. \n\nNot \"omg he thought I speak Spanish? How dare he, how rude!?\"\n\nDo humans not know how to human anymore? Yall just making arguments and non existing problems inside your own mind", "Haha, I question all my social interactions. If in doubt an apology goes a long way!\n\nI created a really awkward situation for myself a few weeks back.... I'm so used to being the boss of people. I was on a bus a couple of rows behind a lady and her kid, who was about 5yo and eating a lollipop. He threw the wrapper onto the guy sitting behind them without his mother seeing. Just impulsively I told him, \"hey mate you shouldn't throw rubbish onto the ground, save it for the bin.\" His mother turned to him and said the same thing. I felt so rude, and when I got off I apologised to her for overstepping and said it was just habit to speak up. Thankfully - so I can sleep at night - she appreciated I said something because she hadn't seen it herself and she wasn't offended. I still think about it.", "I have no bloody Idea what Cracker Barrel is...", "There wasn't a situation, except in your mind.", "oops i confused you with some dad who i was responding to earlier lol. i didn’t know we could name locations but now i do. thank you.", "Apparently you can't call people that on this sub... Even though it's a sub dedicated to deciding if someone is an asshole or not.", "Yeah, that irks me. OP's mother has a voice of her own, and autonomy to use it. It's not his job to white-knight on her behalf. Especially when even OP said she was indifferent (i.e. didn't care) about it. YTA", "OP is classic keyboard warrior, offended on other people's behalf.", "Yup! Lmao editing now 🤦🏼‍♀️", ">The really surprising part is that it was his own mother.  \n\n\n\\*her own mother. OP is a she.", "The secret Chinese menu is written in Chinese while the watered down version is in English in a restaurant just to make it easier. Sometimes they have a Chinese side and a English side too.", "A Chinese restaurant in Sydney went viral after it went public that their Mandarin menu was ~10% cheaper than their English menu. Secret menu win.", "They ask her.\n\nNothing about this post is racist", "I am European, and I disagree. \n\nFirstly, countries aren't ethnicities by default, so mocking people from Germany is 1000% not the same as commenting on \"ethnic Germans\" (however that is defined). \n\nSecondly, racism is broader than your definition. Making assumptions that people with different skin colours must have grown up in foreign countries is racist as it ties into the idea that your country is, by default, white. If you hear someone struggling with English, for example, and offer Spanish , obviously that is different.\n\nIts rude to assume something about someone just based on skin colour, as it removes all other aspects of them from the picture. Maybe their family has been in the US for 3 generations, and used to speak Portuguese but not since they emigrated. Suddenly every assumption is completely wrong and it could have been avoided by asking one question.", "This sounds like a cultural difference then - it is okay to assume people who look like they are from Spanish speaking countries speak Spanish if they are of a certain age. Maybe because there is no national language.\n\nIn the countries I've lived in, one should never assume someone in a country is not from that country unless you have a very good reason. I can list the ways you would be shouted at\n\n1. Assumed they are a migrant (and/or)\n2. Assumed they don't speak english\n3. Assumed the men don't speak spanish\n4. Treated her different from them because of her age\n5. Based all of the above on skin colour / looks.\n6. Assumed it was spanish, nor Portuguese or another South American language that they spoke.\n\nMaybe America is different, and maybe they are less likely to look for an argument or something to complain about (possibly the former).", "The difference here is that those [Asian] restaurants ASKED your wife.", "Just left a comment explaining my experience with that. Spanish is my second language and I'm not at a native fluency, but I've communicated with people in Spanish who had better English than my Spanish and they said it was because it was more comfortable for them. One woman told me it was because her kids and husband don't speak it so it was refreshing to get to communicate in her native tongue since I understood her well even if my responses weren't always fluent. I'll ask people which they prefer because of this. I'm never assuming they can't speak English but sometimes they prefer Spanish and who am I to exclude that as an option if they want it?", "It's a US chain.", "So you jumped to conclusions and got angry at someone - for not doing anything wrong, and trying to help - sort of sounds like the point of this post.   \n\n\nYTA", "So you like never stop and think and you always assume the worst? Charming", "got it lol", "Your dad commented???", "Thanks - fixed", "That’s irrelevant to the discussion and I actually have no idea if they literally ask my wife because they just start conversing in Chinese. Exactly like the waitress and OP’s mom.", "It definitely is a cultural issue. I don't think assuming is ever good, and it can definitely be looked at negatively here, but in places with a large immigrant population, it isn't considered as egregious. The issue is, there are places in the US that have just as many Spanish speakers as English speakers. I've been to places in Texas where most people didn't speak much English. Because so many people don't speak English, it's often not considered impolite to assume if we hear an accent, and Spanish accents are definitely different than Portuguese accents or other South American languages. Not only that, but most people who speak a language other than those two don't tend to migrate here. There are places in the US, especially in the north, where most Hispanic people speak English and often don't even speak Spanish, but then there's places like Texas where they only speak Spanish. Because the waitress was Hispanic herself, it could easily be assumed that she could tell the mom spoke English as opposed to another language, especially since I speak another language and can tell- I can even tell Spanish accents apart for a few countries and I'd bet she's even better at it than I am as a native speaker. Keep in mind how big the US is- every state is practically its own country, so what's acceptable in one state may not be acceptable in another, and this can even vary across states that are huge\n\nETA: the assumption is not usually made on skin color or age, just to be clear. It's based on accents, hearing them use the language, or being in an area that has a large Spanish speaking population. And it's only acceptable to assume if you're also Hispanic and Spanish speaking. I'm white and it's my second language, so it would be considered incredibly offensive for me to assume, but for other Hispanic people who often have the same struggles, it can be considered a way to connect. It's about sharing a culture and background different than that of other Americans. Plenty of racist people assume and speak in terrible Spanglish or they speak English like they're talking to a small child. Sometimes it's to belittle them, sometimes they think they're helping somehow but it's just because they're racist", "That’s not really a difference - they often just speak Chinese first. I don’t actually know what they’re saying.\n\nRacism is inherently bad as it assumes inferiority (or superiority) of one race over another.\n\nWhile stereotyping also over generalizes, it often doesn’t have any inherent judgement. In fact, it’s the bread and butter of many really funny comedians - and no one would say they’re racist. Very, very different than racism.", "Sure.\n\nBut if it is only acceptable for hispanic looking people to open a conversation with an ambiguous brown person in Spanish that is also racist. Assumes that white people cant be properly Mexican, which further cements the binary way of viewing race in the USA.\n\nAh, who cares, I've lost the argument!", "In college writing one time we read a short paper on something to do with racism. They used all of the white racist stuff like black people stealing watermelon and general stuff white racists say about the different ethnic groups. Then they got to what a racist would say about white people if the roles were reversed. I can’t remember what they were unfortunately but they were very accurate but also hilarious. I had a very hard time not laughing at what they would say about me while discussing it in class. I finally understood comedians.", "Ok, that's actually completely fine that your Asian wife isn't bothered by that. That doesn't mean every Asian (American) is fine with that. I'm Asian American, and I'm not a fan of people speaking without asking first. \n\nMost people at restaurants who do this sort of thing (speaking without asking first) are also immigrants, so that wouldn't bother me because they don't have the cultural context. But if a random American person on the street started speaking to me in Vietnamese, I'd definitely be like bro wtf 💀.\n\nI'm curious to know if your wife grew up in America because people's understanding of this behavior is likely going to change if they grew up experiencing racism or if they were part of the cultural hegemon.", "She grew up in Taiwan and didn’t come here until grad school, so definitely has different cultural expectations.\n\nAnd - I agree context is key. We only eat at ethic places where most of the staff are immigrants and they certainly mean no offense. I think most nonwhite people - even my wife - would be offended if someone came up to them and randomly started speaking a different language without at least asking."]}