{"id": 31370, "submission_id": "17zs63u", "title": "AITA for making my BIL cry even though he was being rude?", "selftext": "My 27F husband “Eli” 28M has 2 sisters, but the youngest being his brother “Ryan” 20M.\n\nRyan is a 6’4 but skinny little thing, gets treated like a baby, and is extremely quiet. Everyone starts conversations with him 100% of the time and he replies with one word answers without looking up, and they all constantly ask if he is okay. He speaks monotone and it gets agitating.\n\nI’m not sure he even knows what I look like even though he has seen \nme so much.\n\nWe visited Eli’s family for dinner yesterday evening, Ryan was sat in front of me. Eli asked him how he was and he just smiled and nodded his head.\n\nI had enough and thought it was pretty rude, but I didn’t lash out. I calmly asked Ryan if he was going to reply. He just stared at me. So I said “hello?”. The whole time Eli kept nudging and glaring at me then I said “I think it’s a bit rude that you don’t answer when spoken to” in a lighthearted tone. \n\nTo my surprise Ryan walked off crying and Eli told me to shut the f*** up. Luckily the rest of his family were in the kitchen. He’s never spoken to me like that before, and the rest of the dinner was a bit awkward. When we came home Eli told me not to speak to Ryan again and *I’m* the one who was being rude.", "created_utc": 1700497110, "permalink": "/r/AmItheAsshole/comments/17zs63u/aita_for_making_my_bil_cry_even_though_he_was/", "score": 17, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My BIL is very rude and gets treated like a baby. I had enough after my husband asked him how he was and he just smiled and nodded. I “interrogated” him (in my husband’s own words) and he walked off crying *still* without saying anything. Husband told me to shut the f*** up and the rest of the dinner was pretty awkward, when we came home he gave me a lecture as if he was my father and he has NEVER spoken to me like this.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA, and if I was there I'd tell you to shut the fuck up too. How can you be so socially oblivious that you don't see that this guy is dealing with social difficulties? At best he's extremely shy, and at worst he might be dealing with something like autism. In either case it's completely idiotic to criticize someone for struggling with something like that.", "YTA - yes, you were being incredibly rude.  His brother could be mildly autistic for all you know.  Not everybody has a diagnosis; or maybe he does and his family chooses to be private about it.  \n\nWhatever his issues with socializing are, it wasn’t your place to call him out, and you didn’t even do it in a caring, loving way.  You were condescending and mean.  You were absolutely 1000% rude in this situation.  Your husband was even warning you to back off and you just had to run your mouth.  Unbelievable.", "YTA\n\nRyan responded by smiling and nodding his head. That IS an acknowledgement that he heard and a response. Nobody is required to answer you back when you talk at them whether they are ND or NT.\n\nInsisting on verbal conversation when the other person has clearly indicated they are not interested in it is rude.", "YTA. What is especially sad is that you don’t even realize how unkind you were being when you made your jab at your BIL. Scolding someone who you have no right to scold is an attack, in my dictionary, anyway.", "YTA. He's not your child, you don't need to speak to him that way. Your husband told you to shut tf up, how do you not understand that you've done something wrong? Butt out, don't go fighting battles that you've invented on your husband's behalf.", "Holy moley YTA.  It is not your place to police your BIL.", "YTA.\n\nJust from this post alone, it's obvious the kid has some kind of socialization problem (anxiety, autism, speech problems, or whatever). If you really can't see that then that's on you. Hell, even your husband tried getting you to shut up before you went too far (*now* who isn't responding to social cues). \n\nYou aren't his parent, it's not your job to \"educate\" him. You were literally the only person who had a problem with this. Everyone else was fine. \n\nI don't even blame the kid really. With your attitude, I wouldn't want to talk to you either.", "YTA. Sounds like you were just looking to start shit", "YTA\n\nSounds like Eli is neurodivergent. Why does his behavior aggravate you so much that you had to be an asshole to him, in complete disregard to how his family treats him? He's quiet and reserved, not rude. You should unpack that with a professional. You'll be lucky if Ryan allows you around his family again, and if this doesn't lead to the end of your relationship.", "YTA what are you, the conversation police? The kid clearly wasn't comfortable, potentially is neurodivergent, and was not even talking to you. Your husband is right. You were dead rude.", "YTA. You straight up bullied your husband’s kid brother after your husband tried to get you to stop. You are the only one who was rude here.", "yta. this is clearly someone dealing with something. how he acts around his family is none of your business. confronting him on some shit that has nothing to do with you is fucked. and yes, interrupting a conversation between brothers to say “hello? i think you’re rude” is a rude thing to do. more compassion and less judgment from you from now on, please. just because someone is large physically doesn’t mean they’re not vulnerable.", "You were so concerned by his silence….you kept pressuring him until he broke down crying…..\n\nI dont think you know what that word means", "YTA. It sounds like Ryan may be on the spectrum.\n\n**How is it you had never discussed his unusual behavior with your husband before?**\n\nIf the whole family walks on eggshells around the guy, it's not up to you, an outsider, to come in and confront him. \n\nEspecially without (again) discussing the issue with your husband first!\n\n**EDIT:** Just went back and reread and...this part just breaks my heart:\n\n>Eli asked him how he was and he just smiled and nodded his head.\n\n**The kid SMILED. He was doing his best to be polite. He was (presumably) happy to see his big bro.** Don't know how you go from witnessing that to feeling the need to \"correct\" his behavior. ESPECIALLY given the fact that:\n\n>The whole time Eli kept nudging and glaring at me\n\nSo OP's husband was desperately trying to intervene before you put your foot in your mouth/upset his brother, but OP just had to get have her say. \n\nWay to make it all about you.", "YTA. And frankly the fact that you had to ask is disappointing. As others have said, the brother sounds neurodivergent from your description, and even if he isn't you don't need to be telling an adult what to do.", "YTA\n\nFrom your description it sounds like Ryan may have some underlying issues that you know nothing about.\n\nYou had no business confronting him like that. It was NOT your place.", "Yep. Yta.sounds like bil had some spectrum issues. He doesn't owe you a response.  You were rude and your behavior was uncalled for.", "YTA- it was very silly on your part to instigate something at the very start of the days rolling into Thanksgiving.\n\nPut your instrusive thoughts back in the box, and stir completely clear of Ryan until he stops stirring clear of you.", "YTA. People are not socially equal. Some people have difficulties in groups - AND that is ok! \n\nWhat you said, in essence, was not 100% rude. If it would have been the 1st time you met his brother it could have been understandable. But you were aware of his personality and you kept pushing because you clearly dont like how he is.\n\nWe use different kind of terminology and treatments and therapy for people who act differently from the standard. But who are we to decide for others what is normal?", "YTA. As has been previously stated maybe he is autistic and you don't know, maybe he is shy, maybe he just doesn't like inane conversation. He responds with a smile and a nod and maybe that is all the effort he can muster at the moment. I have debilitating depression and some days a nod or smile is something I just can't do. Leave this poor young man alone. But I have a feeling after what you did and how your husband reacted you won't have to worry about it much longer.", "Yta. He sounds extremely shy if not downright autistic, as I am. Why not accept people as they are rather than expect them to conform to your narrow view of what is normal.", "The only being rude here is you. Obviously,  your BIL is uncomfortable speaking un certain situations which is totally okay. I have a suspicion he has a anxiety or other issue that you're aware of but ignore because you don't think it's an excuse. YTA", "YTA. But I’d also follow up with your husband because it sounds like there’s something he’s not telling you. If he’s generally quiet, and everyone is often asking if he’s okay, there’s probably a reason why they’d think it possible he’s NOT okay. Him crying at your rudeness is also an indicator. He may be depressed, or otherwise neurodivergent. Or he may have something specific going on in his life right now causing him to be more reserved/them to be more concerned. \n\nHonestly that’s a dynamic you probably should have picked up on, and I’d kind of think YTA for scolding him (not your place) if none of this was true. But just something to think about. Husband doesn’t have to tell you Eli’s deeply personal issues but an overview probably would be helpful rather than just being pissed at you. It just seems to me like something deeper.", "I have some compassion I can lend you, clearly yours is in short supply.", "You're definitely the asshole. Having social anxiety/being autistic (even if not super obvious and not diognosed) is a very real thing and is very hard for those people, and it has nothing to do with \"rudeness\". Get over yourself, you're not entitled to nonverbal people becoming verbal just because you don't understand where they're coming from.", "YTA.  Sounds like you were the only rude person there. Sheesh!!", "YTA. At 6'4\" he is not \"a little thing\" unless all of you are above 6' 7.\" Ryan obviously doesn't like social interactions. He did respond to his brother's query just non-verbally. \n\nRyan's family accept him as he is. Why is his non response so agitating to you? You are the problem here. You need to apologize.", "YTA. Mind your own business.", "YTA. Other people are not obligated to perform for you. Leave them alone!", "YTA\n\nHe, in fact, was not being rude. He was just not responding in a way that you did not feel was appropriate. \n\nYou, instead, WERE rude. Alarmingly so. You should definitely shut the f up.", "YTA. \n\nRyan didn’t do anything to you??? \n\n‘I think it’s a bit rude that you don’t answer when spoken to’ ??? U actually said this??? Who do you think that you are ? Very very embarrassing", "YTA you were definitely the rude one in this scenario, you have no idea why he is the way he is. Should’ve just let him be", "Yta, my daughter has selective mutism and will only talk to people she feels comfortable around, when other people talk to her she will give one word answers and sometimes it's hard to hear what she says as she is quiet when she talks to them, she doesn't do eye contact with them either as it's not something she's comfortable with. \n\nWhen her speech and language therapist asked her what happens when she has to talk to certain people, she said she gets anxious and it feels like her throat is closing up.\n\nI haven't spoken to my dad for 4 years because he kept saying she needs to snap out of it.", "YTA\n\nYou owe Ryan a massive apology. Personally, if someone treated one of my siblings that way, I’d be re-thinking the entire relationship.", "YTA.  Leave him alone.  You are being rude and pushy.  Back off.", "For 27-year-old you sure do give off lead-poisoned boomer vibes. YTA", "Yta in general.", "Yes you are a rude and an AH is clear this kid have at the ver least some social anxiety and if I can recognize that by reading the post you can know it for years in the family. \n\nYTA.", "You're a little bit dense OP, people have a better understanding of this situation just by reading your post than you after years. If you don't like talking to him then why on earth don't you leave him alone ? Your husband didn't need you to police his conversations. He didn't seem bothered by it and even if he was there was better ways to approach this. YTA", "yta, just because he replies in one word sentences doesn’t mean he owes you more than that because you are beyond rude. Clearly, he has some social issues but i don’t think you have the empathy to make that better or understand it. like eli said “Shut the f*** up.”", "There is something in this guy, something troubles him, meybe trauma or like people say autism. But there is definitly something wrong with OP. YTA strong one.", "Quiet isn't the same as rude.  Ryan wasn't doing anything offensive and it's not your place to police the social interaction of other adults.  YTA.", "YTA. You are not Ryan's parent, so why did you take on the job of correcting his behavior? YOU are the one who is rude and socially oblivious.", "YTA. You don’t know what Ryan has been through in his life to cause him to be timid. It could be trauma based or neurodivergence or an ongoing speech issue. Even Maya Angelou went through a period of silence in her life, where she chose not to speak. He acknowledged your bf in a way that everyone else found acceptable. It is not your place to question another adult’s “manners”. You’re the one that’s rude.", "Ryan sounds autistic. YTA", "YTA-it isn’t your place to monitor his responses or call him out when you feel he hasn’t responded to your satisfaction. Ryan did respond to Eli’s question by nodding and smiling. Who do you think you are taking anyone to task when they don’t respond in the way you think they should. It was very poor behavior on your part.", "YTA. But I wanna start by saying to all the folks replying, it doesn’t matter if they have something “wrong” with them to make OP’s behaviour unacceptable. We shouldn’t give differential treatment for these sorts of things because they “could” be autistic or something. \n\nThey were quiet, they responded with a nod. Verbal responses aren’t NEEDED.", "YTA, you were incredibly rude. Maybe that is why he doesn't respond to you. I would never allow my spouse to be rude to one of my siblings.", "YTA He did respond. A smile and a nod is a response and the person who asked wasn't feeling insulted by it at all. Who are you to decide how he has to respond and why do you think you get to shame him for that in front of his family who all understand and don't mind his behavior? Your husband picked a really bad one.", "YTA - it was none of your business. \n\n1. If you husband's a grown ass man, if he didn't like how BIL responded he would have said something to his brother himself. \n2. Your husband gave you social cues to STFU, before he actually voiced it, and you still kept going with your narrative that no one wanted to hear.\n3. Ryan seems to have either some type of neurodivergence or extreme social anxiety, either way your an asshole to keep pushing him to talk when he doesn't want to.\n4. There's no way to say this in a \"lighthearted tone\". You were an rude for inserting your opinion in someone else's home about their family member, when it didn't involve you in anyway.\n\n>I think it’s a bit rude that you don’t answer when spoken to” in a lighthearted tone.", "YTA \n\nBack off. You have no idea what's going on and why he's acting this way. You're just assuming he's being rude, when really you're just projecting.", "You are so dumb and a huge asshole. You've got serious issues if listening to someone else's conversation gets you angry. It has nothing to do with you.", "According to most of the responses you’ll get, he has a condition and you’re ableist.  \n\nPshaw.\n\nRude is rude.  If his parents won’t teach him that, the village gotta speak up.\n\nNTA", "NTA, you could have been nicer about it but it's rude af to not speak when someone talks to you.  If he's neurodivergent someone should have told you that.", "NTA\n\nPerhaps your Husband should stop being an AH and tell you what is going on with Ryan. There must be something and it sounds like it is a family secret.\n\nAsk your Husband to tell you what is going on with Ryan.", "Soft YTA. You knew that Ryan has a problem of some sort. There was no need to try and provoke him like that. It seems obvious to me that Ryan has some disorder that must have been diagnosed at some point. Your husband and his family are AHs for not having told you what it is, or even for not having seen to it that Ryan could get diagnosed so that he could get some help.", "maybe the dude is the r word. and how tall are you that a 6ft4 dude gotta look up at you lmfao", "ESH, except for Ryan.\n\nAs other comments have mentioned, it seems like Ryan likely has his reasons for responding non verbally. Your husband definitely should have filled you in vaguely just so situations like these don’t happen. \n\nRegardless, you shouldn’t be policing someone’s behavior. He acknowledged you, and this is a pattern of behavior he seems to exhibit with everyone, so it’s not like he’s trying to show disdain through treating you differently. You definitely should have shown more tolerance in this situation.\n\nedit: by vaguely, I mean \"hey, he's often nonverbal, he means no harm\" not \"here is his diagnosis/trauma/whatever it may be\"", "It sounds like he's got some kind of mental condition.  Is there a story going on that you don't know about? Was he abused as a child or something?\n\nIt seems strange that they're so protective of him.\n\nIf things went the way you said they did then I'd say you're NTA but you there's some stuff going on behind the scenes I think that maybe you need to be clear on.", "ESH. If there is some sort of Neurological situation here, your husband should have filled you in a looooooong time ago. However, the way you speak about this person is dripping with contempt. \"Gets treated like a baby\", \"speaks monotone and it gets agitating\". Why is it agitating you?\n\nSeriously, I almost switch to y t a because of this, but your husband ABSOLUTELY should have told you something, even though it appears to be common sense for everyone else who meets Ryan.", "esh - while ryan's behavior can be frustrating it's not fair to publicly call him out like that. however eli's reaction was also uncalled for. communication is key try talking to eli and ryan calmly and privately to address the issue.", "At best, ESH.\n\nIF we accept your claim that Ryan is just being rude for the sake of being rude and there's no underlying issue causing his lack of social response, then you're admitting that he was rude to you and you were rude in return. That means you're both TAs.", "NTA although you’re not the asshole in the situation, I do wonder why he’s like this, because it sounds like that’s just how he is", "NTA\n\nYour husband knows something that he's not sharing.  It could be something like [selective mutism](https://www.nhs.uk/mental-health/conditions/selective-mutism/), but you have no way of knowing.", "nta. it's understandable that you were frustrated by ryan's lack of response. communication is important in any relationship and it seems like ryan's behavior was rude. it's not fair for eli to tell you not to speak to ryan again when you were only trying to engage in conversation.", "nta. it's understandable that you would feel frustrated with ryan's lack of response. communication is a two-way street and it's not unreasonable to expect a basic level of engagement during a conversation. however it's important to approach the situation with empathy and understanding as ryan's behavior could be due to social anxiety or other factors. it might be helpful to have a calm and open conversation with eli about the issue expressing your concerns and seeking a solution that works for everyone involved.", "ESH edging into Y T A territory. So what if he's monotone or only gives one word answers? He's not your child or dependent. His social skills are his business, and as long as he isn't being actively rude, it's precisely none of your concern.\n\nI'm still going with ESH, however, as there is clearly an issue here, and I can not believe it has gone this long without your husband letting you know about any issues his brother has. Not because you need detail. You don't. But because a quick \"bro struggles with crowds, so we need to give him some leeway,\" would save a lot of hassle and misunderstanding.", "NTA\n\nseems like he has something called “youngest child syndrome”", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy 27F husband “Eli” 28M has 2 sisters, but the youngest being his brother “Ryan” 20M.\n\nRyan is 6’4, gets treated like a baby, and is extremely quiet. Everyone starts conversations with him 100% of the time and he replies with one word answers without looking up, and they all constantly ask if he is okay. He speaks monotone and it gets agitating.\n\nI’m not sure he even knows what I look like even though he has seen \nme so much.\n\nWe visited Eli’s family for dinner yesterday evening, Ryan was sat in front of me. Eli asked him how he was and he just smiled and nodded his head.\n\nI had enough and thought it was pretty rude, but I didn’t lash out. I calmly asked Ryan if he was going to reply. He just stared at me. So I said “hello?”. The whole time Eli kept nudging and glaring at me then I said “I think it’s a bit rude that you don’t answer when spoken to” in a lighthearted tone. \n\nTo my surprise Ryan walked off crying and Eli told me to shut the f*** up. Luckily the rest of his family were in the kitchen. He’s never spoken to me like that before, and the rest of the dinner was a bit awkward. When we came home Eli told me not to speak to Ryan again and *I’m* the one who was being rude.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "There could be many reasons for Ryan's behavior and the fact that the family \"babies\" him--anything from mental illness to cognitive disability--and some families are reluctant to share this with others, even in-laws. He speaks in a monotone and doesn't make eye contact. Are you completely oblivious to these clues, don't know or don't care? He's your BIL, so it's not like you've just met. Have you ever asked your husband about this? It seems that a major part of the story is missing here.", "YTA.  You could have spoken to Eli and asked why Ryan only gives simple answers. Maybe he's overly shy? Maybe there is something else going on...and maybe you just keep your damn rude mouth shut and not bother a person.", "YTA. There are so many reasons why he might not talk a lot. That could include social anxiety, muscle tension dysphonia, maybe he feels insecure about the way his voice sounds— who knows. You need to leave him alone next time. He wasn’t trying to be rude.", "YTA. Massively. \n\nMaybe Ryan is neurodivergent. Maybe he’s painfully shy. Maybe he’s scared of saying the wrong thing. Maybe he doesn’t feel like talking. Or maybe he’s following the rule “if you have nothing nice to say, say nothing at all” and since he’s around you, he decided to be quiet. \n\nIt doesn’t matter. It’s not your job to correct him or instruct him in manners. \n\nWhich, is of course, hilarious that you feel like you’re in the position to call anyone rude. You were a guest in your in-law’s home, and you made their son cry. You rate the rude one.", "YTA, have you ever considered he has really bad social anxiety? Notice how the family acted like it was normal and you were the only one that had a problem? I’d call and apologize to his brother and explain that you’d love to hear him talk more, encourage him to break out of his shell, don’t try and demean him out of it cause the more closed it will become", "YTA did you ever even care enough about your husband's family to ask him what's up with his brother? No, you just went on silently judging a situation you know nothing about because you couldn't be assed to educate yourself. And then you spoke to a grown up like he was your 5 year old. Because he didn't use words? You weren't even the one asking him how he was, your husband asked him and he was content to get a smile and a nod in reply. Well, he obviously doesn't need you to fight his battles for him, from the way he put you in your place. The only way back from this is profuse apologies, starting with your husband. And if I were you I'd take my cues from him on how to proceed from there. You made an ass of yourself in front of your husband's whole family. This is going to be a tough recovery.", "You were being rude. Yes, YTA. Who are you talk to someone's family member this way?", "YTA- let your husband set the boundaries & expectations for his family. You can think in your head that Ryan is being rude, but it is not your place to shit stir with his family. Also, Ryan & your husbands reaction is pretty telling that there is a underlying cause for Ryan’s “social faux pas”- perhaps Ryan has a mental disorder of some form. I feel like you know this though & conveniently have left this part out to feed your narrative. End of the day, clearly Ryan struggles socially & his actions have no real baring on you so stop meddling.", "YTA. He wasn’t even talking to YOU for YOU to make the judgment call about what YOU found offensive. \n\nBut I understand now why he wouldn’t want to talk to you. I wouldn’t either.", "Lol well seems like you got your answer, do you justify yourself? Or apologize and do better?", "YTA. My granddaughter isn’t Austic, is 7 but at times, especially in the morning, won’t udder a single word. She started doing this to punish her parents for being deadbeat parents but I am now left to deal with nonverbal communication. It doesn’t matter the reason. Your boyfriend and his family accept this form of communication so you have no right to interfere with their form of communication. A smile I would take as meaning he’s just fine. Apparently your boyfriend did to. You sound like you have some sort of problem that you can’t take very obvious social cues to leave it the hell alone!", "YTA. And whatever it is that makes these social situations difficult for him, he is making an effort. Your rudeness probably caused a setback in his journey.", "As someone who works with autistic kids and is on the spectrum, I agree he sounds autistic.  I often have difficulty with eye contact, and it is something I have worked on all my life (64)", "As someone who is autistic, I ain’t rude like the BIL. Autism doesn’t stop you from being able to be a nice person, to family especially as there’s no reason to go nonverbal around them.", "Non-verbal responses are responses! I used to work in daycare, and parents would often express concerns that their child wasn't communicating. Most of the time they are communicating if you pay attention- they're just not speaking with their mouth.", "Be careful with that third sentence. Next post is going to be “AITA b/c I asked my BIL if he was autistic/ND since he acknowledges people with his body language and not words?” And then getting upset all over again when the answer is overwhelming “yes” \n\nYTA - OP you acknowledge that Ryan acknowledged the question, move along and bother someone else that might not want to deal with you either.", "Did you read what she actually wrote?", "Not at all, you can’t tell tone from text but I was concerned and genuinely found it offensive.", "How TF does anxietu make you MUTE", "> You have no idea what's going on\n\nThis is the part I'm stuck on, WHY does OP have no idea what's going on?\n\nThis isn't her new bf, it's her HUSBAND. How did her bro-in-law's odd behavior never come up? The first time I met this dude, you better believe there's going to be a conversation on the way home.\n\nIf OP cares enough to defend her husband against \"impoliteness\" then she should care enough to want to know the bare boned basics about his immediate family.", "Almost like peoples' medical information is something they can choose to keep private if they'd like to. What a concept!", "He may not have a diagnosis for whatever the issue is. I know my issues were from autism until I was almost 30, but that doesn't mean I wasn't obviously atypical.", ">Your husband and his family are AHs for not having told you what it is, or even for not having seen to it that Ryan could get diagnosed so that he could get some help.\n\nOP is not entitled to know any medical information about Ryan. \n\nYou have no idea if Ryan is diagnosed or not. OP simply didn't put it in the post. He could just as likely be getting help.", "Sounds like he's neurodivergent.", "Since she has no way of knowing, she should probably just choose to be kind. It wasn't even her battle to fight - Ryan and hubs were interacting. OP just butted in. \n\nHusband doesn't have to disclose shit. OP isn't entitled to know anyone's personal medical information just because she married into the family", "Telling someone they’re being rude because they didn’t like the way the initial question was responded to (smiling/nodding is a response) is not engaging. Engaging in conversation would be asking a follow up question.", "It’s almost like individual people exhibit different behaviors and symptoms in regards to autism\nLike a spectrum of some sort.", "Wow. It's almost like it's a spectrum or something....", "I can’t understand why people take it as being rude I have social anxiety and it’s hard for me to keep long conversations", "Yes.", "That's a you problem. He is not required to comply with your expectations for his behavior, particularly when no one else has a problem with how he usually does things. \n\n\nThis is you feeling disrespected and annoyed bc he's not behaving as you expect him to according to your definition of \"manners,\" but he isn't required to. He's not married to you and you aren't his parent.", "Okay, so why should anyone show you grace if they misunderstand you? You hounded your brother in law to tears. You made an issue out of not understanding why he is the way he is, tried to get him to explain something that might be very personal and private, and kept going even when people tried to get you to stop. Do you not see that?", "No, you're not concerned and you need to stop believing that you're owed whatever you think you're owed.", "Really-you were so concerned that you made him cry. How that doesn’t make you a bully, I’ll never know.", "BS you were. You were looking to start shit. Stop trying to cover it now with your \"concerned\" BS cover up.", "How is it that you've been around your BIL for so long, meeting him so many times, but you still cannot understand the type of person he is?\n\nHe doesn't like talking. He doesn't like making eye contact. He will answer you in his own way.\n\nWhy can't you just let him be?\n\n#Why did *\"YOU\"* find it offensive when he was not even talking to you?", "We don't need to tell tone. Your behavior was rude. Your words were rude. Rude is rude, no matter how 'light-hearted' you think your 'tone' is. And as I said in another comment, if you're so concerned then why don't you ask your husband, in PRIVATE, what's going on with his brother?", "that could actually a result of a fear response! when you have anxiety, your brain can produce loads of fear chemicals, usually chalking up to your typical fear responses, flight or fight. But there’s also the option of freeze and fawn. If he has an intense anxiety disorder, it’s COULD be possible that it causes him to freeze up and go mute in social situations! -a psychology student :)", "You've been all over this post saying things you don't know anything about", "The whole issue could have been avoided if her husband had explained the issue to her. She is not the AH her husband is.", "You are right in that observation.", "Bro said “mild” autism. Mild autism doesn’t do this.", "Yes, from my own personal experience, I was an extremely, extremely shy teenager. Some might call it social anxiety, but I don't know... that phrase really wasn't around when I(51f) was younger. I would simply freeze when asked a question. My brain would absolutely race, begging my mouth to talk, but I'd just sit still and silent until the attention went somewhere else. It was horribly frustrating, both for me and for anyone trying to communicate with me. \n\nThankfully, I was always met with people who were aware enough to see that socializing was difficult for me and had the grace to not make a scene.\n\nOP: YTA", "She is not entitled to Ryan's medical information. Period.", "I’m not a “bro,” thank you very much.  \n\nMy point is, there could be an underlying issue impacting the BIL’s communication.  The OP was rude to make an assumption that BIL was simply choosing to be rude rather than considering he might have challenges that OP doesn’t understand.  We’re all fighting our own battles, so it’s better to pick curiosity and kindness rather than being antagonist.", "Again it's almost like it's a spectrum of some sort. ...", "Yes, it can. I work with mildly autistic people - lots of them - and it absolutely does in some cases.", "who said anything about medical information, a simple broad brush explanation that he has some issues and to not take offence if he does not respond to you, would have done.\n\nOP is being made to feel bad and this could have been avoided.", "Bro is a figure of speech.", "Has she really never met BIL before? She didn't know he \"has some issues\" until now? Come on.", "OP butted into her husband's conversation with Ryan and instigated this entire conflict. She's being made to feel bad because she's an asshole.", "Lmao that's your takeaway?"]}