{"id": 3139, "submission_id": "z3mqhv", "title": "AITA for sending my daughter hunting with her dad", "selftext": "So back story, it’s thanksgiving and we (my husband 26m and I 26f) are hosting thanksgiving this year. I’ve prepped and cleaned basically all month so today I could just spot clean as needed and focus on cooking. We’ll my husband decided he wanted to go hunting today. I told him if he wanted to go that’s fine, but I need him to take our daughter with him (4F). He told me that I’m being an asshole but ended up taking her anyway. I didn’t think it would be a big deal, he’s taken our daughter hunting with him twice this season to give me a much needed break. AITA for making him take her?\nEdit to add: I’m not asking for your judgment about the right age for taking a child hunting or if hunting is good or bad. I’m asking if I’m the asshole for asking my husband to take our child (that he had previously agreed to watch so I can cook) out with him. \nEdit to add: their version of hunting together is them sitting in a truck and looking out the windows for any deer. The bow gets left in the bed of said truck in case one is found, where the four year old stays in the truck while dad shoots it. Then they drive said truck to get said deer and throw it in the back and take it to the shed. She’s literally just there sitting in a truck with him. It’s not a movie, we aren’t give a child a gun or having her watch anything die. She’s just there to chill with him.\n\nEdit to add again: this is what hunting looks like for them. They take the truck out into the field and wooden area on OUR PRIVATE property, where she stays strapped in her car seat the whole time. It’s basically them just driving around until they see something, then it’s my husband going and grabbing the bow from the bed of the truck and taking care of it. She isn’t near any weapons, she isn’t wandering the woods all Willy-nilly. And she’s always so excited when they bring home a “reindeer”.", "created_utc": 1669303562, "permalink": "/r/AmItheAsshole/comments/z3mqhv/aita_for_sending_my_daughter_hunting_with_her_dad/", "score": 60, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I made my husband take our daughter hunting with him so I can cook and get everything ready for both sides of our family to come have thanksgiving at our house.\n\n**[Check out our upcoming Reddit Talk with Iliza Shlesinger on Nov. 28th!](https://redd.it/z29rfu)** \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA if he's on duty so you can prepare it's a reasonable ask.", "NTA\n\nHe knew he was on dad duty today while you're busy, so it's only right he takes her hunting.  You've explained that she's perfectly safe out there with him. \n\nNo excuses dude, step up and parent.", "NTA people who are commenting otherwise appear to be more against hunting and judging only on that. \nPeople live different lives where I grew up and currently live hunting is just a way of life and the sooner children learn the better.", "I guess I'm one of the few that see no problem here. Then again I'm native and we start going hunting with family as soon as we hit the ground, the kids normally go hunting anyways so they can learn.\n\nI dont see why he would react that way. As a parent you're supposed to teach your children to track, habits of the animal, bedding, water sources and calls. And for me at least it's a joy to pass on the knowledge that they pass to theirs. \n\nI dont think you're an a$$hole at all I think he might be though. \n\nBut again I'm coming at this from a whole different perspective and am at odds with the comments it would seem", "NTA\n\nIf you're busy prepping for Thanksgiving dinner, your husband should be looking for a way to help out - not just heading out for the day.", "Nta, he said he would watch them before deciding to go hunting. To all the ones saying ah, due to hunting or being around a weapon at 4, they just have issues with either hunting or guns.", "NTA. The audacity to be surprised that he needs to parent.", "NTA. I'm kinda stuck on taking the entire month to clean though, are the relatives planning on looking for dust under all the furniture?", "NTA. Your husband is on dad duty today as you agreed. Him trying to get out of if last minute is not cool at all.\n\nThe way you described their hunting isn't gonna traumatize her. Especially since she doesn't see anything.", "Info: what kind of hunting are you doing ?\n\nWill anybody body be their to help watch her ?", "NTA he agreed to watch her.\n\nPlease ignore the people freaking out about the 4 year old going hunting with dad. I used to go with my parents at that age. It filled our freezer full of meat in a time when finances were very tight. I had toys and books in the back of the truck and my brother. \n\nHunting is fine. She can chill in the truck. She can see an animal killed with respect to feed your family. Farm kids see it too. It's part of life. Something people have lost sight of.  How do you think that chicken gets to the store for you to buy it?\n\nYou keep cooking and I wish you a happy thanksgiving.", "Nta. It's fine to ask your husband to take the kids when you need a break. Other people are upset your daughters out hunting so young but that's fine too. It can be good for bonding, you just aren't on a website that cares for hunting.", "Oh my gosh, let me get this straight. Your husband agreed to parent y’all’s child so you could/can cook the holiday meal, he decided he wanted to go do something he can and has parented while doing, and you expected him to still take the child and parent while doing this hobby???? Oh my!\n\nNTA of course. It’s fine. Y’all’s kid is fine, husbands’s fine, the deer probably have had better days but ya know… kinda the way of the world lol. It’s way easier for him to hunt (as you’ve explained) and parent, than it would be for you to cook and parent. Y’all are doin great. Not sure why your husband called you an asshole though, maybe have a little Q and A session later and see if he thought there was a better way to handle things or if he just wanted to be alone for a bit. If it’s the second one maybe agree to be the ‘active parent’ for a bit later so everyone’s happy.", "NTA. How are you supposed to make dinner with a 4 year old running around?", "~~ESH~~\n\nSounds to me like there's a lot of *\"hope he/she reads my mind, or else ...\"* going on.\n\n&#x200B;\n\n>*We’ll my husband decided he wanted to go hunting today.*\n\nI would assume that your husband would very well say the same about the situation, something like *\"well, my wife decided to go on a month long cleaning spree ...\"*\n\nTo be clear, doing that is fine. But i guess that you haven't talked about your plans for the upcoming days, or the need for some relaxing alone time. So that's on both of you.\n\nI see some people giving you flak for sending your daughter off with your husband to go hunting. Emotionally i would agree, for several reasons, but at the end of the day it's none of our business, and only a matter between you, your husband and your kid.\n\n**Edit:** The information that OP's husband agreed to take care of their daughter that day wasn't part of the [original post](https://www.reddit.com/r/AmItheAsshole/comments/z3mqhv/comment/ixmdkse/?utm_source=share&utm_medium=web2x&context=3). Since OP provided additional info, i'll change my opinion to **NTA**.", "This is a joke, right? You sent a four year old out to participate in gun sports? \n\nThe only way it wouldn’t be an ESH here is if he was hunting for your dinner.", "I am so conflicted. Hunting with a 4-year-old? ESH.", "**YTA** \n\nThere are a lot of appropriate father/daughter activities for a child this age.  \nThis is not one.  \n\nA hunter does not need to be tasked with watching a small child while hunting.   \nA small child should NOT be wandering the woods *double especially during hunting season.*   \nOne drunken hunter and your life is a tragedy.", "... I hope I am not the only one to figure out that a 4 yo shouldn't be around weapons. \n\nESH.", "ESH. How would you two think taking a 4 year old to watch an animal being murdered is a good idea is beyond me.", "ESH. I agree that a 4 year old shouldn't be hunting, but you aren't an AH for not being willing to do all the cleaning and childcare on a holiday.", "ESH. honestly im more surprised you want your hubby to bring a dead animal home and then spend time slaughtering for meat.\n\nor at least im hoping you guys only kill for food, to do it for shit and giggles is fucked up. and unless your husband is a good shot to kill an animal with one hit arrow, subjecting your very young child to witness an animal suffer before its finally put down for food *you dont even need* is needless cruelty", "ESH, \n\nWhy is a 4 yearold involved in hunting?\n\nA 4 yearold shouldn't be near weapons, the 4 yearold is gonna be traumatized for life if she sees her father gunning down an animal and your husband is gonna lose his hunting license if someone sees him and reports him.\n\nAltough I bet he doesn't even have one.", "ESH\n\nWhy…. Why would you take a child this age hunting….\n\nWhat kind of cousin marry their cousin community do you live in?", "NTA. As long as the weapons are safely handled, it will probably be a fun time for your daughter to remember with her father.", "YTA. This miscommunication/argument could have been avoided if you had asked or talked about it vs. telling him/not giving him a choice.", "ESH - I guess we're never too young to see someone shoot Bambi's mom or dad,  hang them from a tree, then slice open their belly to let the offal fall out during field dressing. And dad would never lose track of a patient, 4 yo who was quiet enough not to scare the deer off in the first place, while focusing on other things. It's not at all like she could wander off, get lost, and potentially get mistaken for a deer by any other nearby hunters...\n\nYou need to focus on cooking. Your husband is choosing a bad day to go hunting. \n\nEdited - changed to esh", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo back story, it’s thanksgiving and we (my husband 26m and I 26f) are hosting thanksgiving this year. I’ve prepped and cleaned basically all month so today I could just spot clean as needed and focus on cooking. We’ll my husband decided he wanted to go hunting today. I told him if he wanted to go that’s fine, but I need him to take our daughter with him (4F). He told me that I’m being an asshole but ended up taking her anyway. I didn’t think it would be a big deal, he’s taken our daughter hunting with him twice this season to give me a much needed break. AITA for making him take her?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  Not at all.", "NTA\n\nhe changed plains last minute.  he is TA", "NTA\nI oppose hunting for sport. That really pisses me off. If your family hunts on your own land and you use everything that can be used from the animal food for you. I don’t even have an issue with y’all taking your daughter hunting. If you have weapons in the home the kids need to learn about them safely. I think 4 is fine for starting to learn about hunting and bows so no criticism there. My only critique would be that your husband agreed to watch your daughter while you cooked and he was irritated that he still had to do so when he changed his plans. It’s not like you told him no to hunting. You did not mention anywhere in the post on what he is helping cook for the dinner y’all are hosting. Was his expectation for you to cook an entire meal for however many people and watch your kid too? \n\nI feel so very blessed and have more and more respect and love for my husband when I read some of the things on Reddit. I am super lucky!", "NTA", "NTA obv\n\nYou need space to get all the prep and cooking done. I think we all know four year olds aren't awesome at providing this.", "NTA", "NTA, dad needs to know that he's a parent too. I'm frustrated for you that he's just taking off when you're hosting a gathering, and worse that he's mad that you're not *also* doing childcare at the same time as prepping for the event?! Definitely have a conversation with him about this, and both of your expectations for future events like this when you can.", "NTA- explain to him how he can use that time to build memories as well as watching the young one- I still remember when I first went with my grandpa, I shot a .22 and it shook my arms like crazy but my heart! It was pounding! I practice with a bow occasionally and it’s also good arm workout", "NTA. He agreed to watch your daughter and then decided he wanted to go hunting alone instead? Totally unfair to you. If he wants to go hunting, he can bring his daughter and fulfill his obligation of taking care of his own kid while also doing something fun.", "NTA he agreed to watch her while you cook. To me he only changed the activity he was doing with her that day.", "NTA he agreed to take care of her and it's an activity he already takes her along with. You think he'd be happy to take her??", "Many (read men) don’t have a clue how work intensive and stressful pulling together a big holiday meal can be. Being able to do in peace and quiet is a gift.", "NTA- dad need to parent too, even when they have plans. It’s called parenting", "NTA he agreed to watch her so you can cook he can suck it up and watch her while you are slaving away in the kitchen  \n\nAlso hunting was one the primary source of food no one is too young to learn the truth about life and death and the natural order. Its purely parental choice on when a child learns it", "NTA. It sounds like you guys had a prior agreement that your husband watch your daughter, you are very busy preparing food, and why shouldn’t he spend time with his daughter? If he wants to go out hunting, he has to take her. If he doesn’t want to, he doesn’t get to go hunting. Honestly, I kind of find it sad that he seems upset by that arrangement. I know a lot of women who say that hunting with their dad are some of the best childhood memories they have.", "NTA.\n\n>that he had previously agreed to watch so I can cook\n\nHe already agreed to it.  Why is backing out and calling you an AH?\n\n>he’s taken our daughter hunting with him twice this season to give me a much needed break\n\nIt's obviously been done before though this time you are not getting a break- you are still doing something for him.  \n\nWhy is he being this way?", "NTA.  My kids spent their infant to adult years in a hunting blind.  Just practice safety with weapons and this can be an great bonding experience.", "NTA. His assistance was needed because you are cooking and cleaning. It's hard to do that with a 4 year old. He is perfectly capable of stepping up and helping out. It was not out of line to ask that he take her.", "NTA", "NTA\n\nHe agreed to watch her, you're asking him to do what he agreed to do.", "NTA\nJFC he agreed to this, and you are doing all the work and he wants to go fuck off and play and stick you with his small portion of work? \n\nHe can GTFO.", "City person here who grew up in a hunting family. I was hunting with family same as u describe ur kid. The only difference was the era and drinking was involved. If there no drinking. I don’t think its an unreasonable ask.", "No. Your husband is TA because he decided spur of the moment to go \"hunting\" (nobody I know would call what he does hunting) on one of the busiest, most stressful holidays of the year, for which you are hosting guests at your home. The real question is why is your husband not helping you? Why is the entire day your responsibility, and he has the gall to get mad that you ask him to care for your child? Entitled, selfish, unaware.", "YTA", "Yeah.. I’m started to realize there is a lot of city folk commenting and totally not seeing the point. I bet if I reposted and left the part where he’s taking her hunting out the replies would be so very different.", "I started when I was 6 and where we live now a couple of 8 year olds got 8 and 10 point bucks. There is even deer day where school is canceled for the first day of deer season. My husband never hunted so I was the one to teach my kids gun safety and take them hunting. It is what it is", "Literally what I thought as well", "I shot a gun for the first time when I was 5. We were taught gun safety very early because there were guns in the house. I think 4 is old enough to accompany dad. Plus, she gets her reindeer. I just love that part of the edit.", "My mom probably will. She’s a little bit of a clean freak and very judgmental since I have a small child that plays on the floor", "Bow hunting\nAlso yes. My daughter, him, and her grandpa and grandma.", "We live on a farm too. It’s not just “Bambi” that we kill around here. She’s seen a horse get put down, a few cows, chickens and hogs. She’s also seen the birth of calfs. Maybe since I grew up in the south and lived on a farm my whole life that I’m just blinded by what the big deal is. But it’s just the circle of life, I rather her not be naive to it.", "not necessary true.  I think hunting is fine with a 4 year old.  But \"hunting\" with a 4 year old is a different kind of experience.  Dad thought he was going hunting and now he is going \"hunting'\". I could see why he would be disappointed.", "Hunting is great when the kid is an adult and has a hunting license.\n\nA *4 yearold* shouldn't be involved in hunting.", "So I’m an asshole for expecting my husband to uphold his end of the agreement we made? We had previously agreed he’d watch OUR child today so I can cook.", "They are hunting for their food tho.", "The baby is hardly participating lmao. He's just brought her with him. Not like she'll be pulling the trigger, hitting that animal or helping drag it out", "… bow hunting. Should have clarified that, I guess.", "Are you worried about safety or something else?", "Do you have hunting experience or in a family/area where it's common? I grew up in a hunting family. 4 IS young but I know that it happens, so I am kind of struggling to separate that from OP's general question.", "In our house \"hunting\" with a 4 year old was sitting in a comfy blind, with snacks spotting birds and squirrels. Just spending time outdoors with a parent who was sharing something they loved to do.  Back to the house for hot chocolate and me listening with rapt attention while they told me about all the \"amminals\" they saw.", "OP states in the post that he was on\nDad duty that day, so he was bound to look after his daughter no matter what his plans for the day. He was using hunting to get out of his commitment.", "I don’t see how. I started hunting with my pa at 4 also.", "I honor your right to your opinion, but i think it's fair to say that hunting isn't the topic of OP's question.", "Because I love to hunt, I started at her age. If you are against hunting, just say that.", "Oh, give over. Traumatised for life 🙄 \n\nI'm from the UK, and my dad would hunt and bring home rabbit, pheasant, etc. From a young age, I would help skin, gut, and prep the animals. I'm not traumatised but I appreciate where meat comes from.", "It’s Arkansas.. you are allowed to take your children hunting with you. Two it’s private land, he doesn’t need a license but he has one for when he’s not hunting on our land. Also, it’s a bow. No “gunning down” going on here.", "Sadly no cousin marrying community, just the south where hunting is huge.", "He already agreed to watch her so I can cook today. He was the one to decide last minute he would rather spend his day out hunting instead.", "We hunt on private land, so no worries on that. Two he doesn’t field dress, he brings it home takes it to his shed and deals with it there. And you are making it sound so much worse than it actually is… you don’t have to hang it or gut it to get the meat off.", "In my experience, \"hunting\" with the guys on Thanksgiving means hanging out in a cabin in the woods and drinking while the wives prepare the meal. Maybe they'll get a buck of it happens to wander by, but it's about companionship and avoiding any meal prep and childcare obligations. If that's the case, it makes sense why they wouldn't want to entertain a 4 y/o", "Yeah that’s sad but true \nI knew as soon as I saw hunting in the title that you would be attacked just for that \nA lot people no longer understand (or even care to) what an ecosystem is or how to maintain it\nAlso kudos to you and your family for helping to keep a fading tradition going.", "NTA. I am a city person who has never hunted but I know people who do. They hunt to spend time with family, share their traditions and harvest the animals to feed their families. They follow the local laws. They don’t hunt for sport. I am more comfortable buying my food at stores but completely respect them and their choices.", "Yeah. If you said that he was taking her for a hike, the answers would be very different. There is nothing wrong with taking her hunting. As long as he keeps her safe, all is good.", "NTA, you guys have a prior agreement that he would watch your child. Now if there's a Boone and Crockett once in a lifetime buck he's been chasing for 10 years chilling at the bait right under his tree stand I'd say maybe you could suck it up LOL\n\nOnce we have meat in the freezer Hubby will take the kids out. 99/100 nothing is harvested but, It's great bonding time and it gives the kids an appreciation for nature and where their food comes from.  It teaches respect, responsibility, and self-control.", "I am just going to reply to you directly you are nta and i am sure even if your husband is upset he will get over it and your daughter making memories. Take time to cook and try to enjoy your day.", "I AM city folk but my dad has hunted his whole life so I get it. They are making core memories and you are focusing on your task at hand. NTA.", "Hey now, don't be throwing us city folks all under the bus! Some of us aren't morons! \n\nNTA I'm a city folk (also worked in child development, hate guns and seeing dead animals... but that's a me thing) and I don't see anything wrong with hunting with a 4yr old. I actually think it's good for them to learn at a young age where their food comes from and how to be responsible. Kids aren't as stupid as people think and it's good to teach them how to responsibly hunt. Plus your hubby made a promise to watch her, so he can watch her. \n\nAlso side story, just because I always get a kick outta it. My grandpa is old af and grew up in rural Canada hunting and fishing. He now lives alone, but still goes out hunting. Now he doesn't have a truck or SUV or anything decent for off roading and hunting in the winter. He has a $60,000 car.... and for some reason has come back in that car more that's that we can count  or when grandma was still alive, we'd hear her screaming at him about how stupid it was to drive and shoot at a deer at the same time.... then there's his story about shooting a moose in front of an RCMP office.... won't get into that one though... \n\nAs long as your hubby isn't my grandpa level of crazy when he's hunting with your daughter, you're all good!", "I grew up in the country.  People who are against hunting but still eat meat are ignorant, hypocrites or both.  That deer lived a much better life than a poor animal raised in a factory.", "Yeah, I don't even remember my first hunting trip because I was in my dad's backpack (people always think cradleboard when I say that, it was a back pack with like a seat on it) I couldn't walk yet.", "I'm sorry :/", "Then NTA. Bow hunting is safer to do around her age and the fact she has other adults around her that can make sure she dose not run away makes the trip safer for her.", "That sounds like an awesome experience for all of them. I'm still smiling about her reindeer.", "Heck yeah. I'm not southern. I grew up in rural Oregon. Hunting and gardening. We knew where our food came from.", "She's not shooting the game. She is mostly just chilling in the truck with dad. \"Kids\" can get hunter's licenses as young as 12 in some states. They have to have Hunter education to be able to.", "Yes. I can’t get past this part. There are just too many things that can happen. And having time for yourself is not a good enough reason to let the kid go hunting.", "He took her bow hunting. At 4 she will not be able to draw back the bow. Plus, OPs stated that he didn't keep it in the cab of the truck. There are other adults to help watch her if he is out of the truck shooting or loading a deer. Where I grew up in Montana, most kids knew gun safety before 4 and had shot a gun well before 10. Bows are a little different. Hunting bows have a higher pull so many kids can't pull them back. They do make kid's bows for practice though.", "I think the most important issue here is how the four year old feels. If she enjoys the hunting experience and she's safe, it's ok. Your husband doesn't get to hoist off all the work on you then go have fun, that's not fair. If the toddler is bored/having tantrums, then she's better off staying at home.", "I love hunting to but we don’t take toddler’s hunting. It’s to dangerous even if they are will behaved it only takes a second for something to happen . Exactly if he’s hunting alone with her. It would be different if someone went with him to watch her.", "An 11 year old boy was just accidentally killed while hunting just 3 days ago. Last year an 11 year old girl was also killed in Texas. Seems barbaric. Great parenting", "I am against hunting, but at least someone with a concept of right and wrong can make their own mind about it; I also know it’s bad for a child’s development at that age to witness their parents kill another living being for sport. Maybe because you started at a young age you don’t realize it.", ">It’s Arkansas.. you are allowed to take your children hunting with you.\n\nOnly in America lol. I don't know what to say about that.", "It seems like a bad idea to just drop her on him because you didn’t plan ahead.\n\nNot sure about age for a kid to hunt so I’ll defer to others. I get annoyed when my wife wants me to take the kid to the grocery store last minute. Let alone a trip that involves a lot of prep and planning.", "oh this should be in the OP\n\nI change vote to NTA", "It’s just him, our daughter, and his parents out there. It’s not really a “guys only” thing. If he was going out with his cousins that would have been different, I would have just said no. But he’s going out with his parents.", "It’s not like we do it for sport either (which I also see no problem with) we eat the meat, whatever we don’t eat we give to our hogs.", "She loves it! She is always asking him when they can go hunting again. And when they are successful, runs in talking a mile a minute about the “reindeer” they got.", "Your Grandpa sounds rad af", "They also sit in a truck, she’s strapped into her car seat the whole time. I really don’t think she’ll be running around anywhere.", ">She is mostly just chilling in the truck with dad.\n\nAnd watching him kill stuff.\n\n>\"Kids\"\n\n>Kids\" can get hunter's licenses as young as 12 in some states.\n\nLmao, God bless America I guess. Also, that argument is irrelevant since the kid is 4. \n\n>They have to have Hunter education to be able to.\n\nYeah, you usually get that once you're old enough for it.", "My daughter loves it. Every weekend she asks if they are going to go hunting. It’s really not how I’m thinking every one is seeing it as. They sit in a truck the whole time. She’s not wandering the woods all Willy-bully. She’s strapped in her car seat inside a warm vehicle.", "Sauce?", "But it’s not for sport, it’s for food.", "I went hunting with my cousin when i was 10 or 11 in ireland. It was birds or rabbits not big game. Id say younger go with there parents", "It had been previously agreed upon that he would watch her while I cook. Also it’s his own child, I’m not “dropping” her on him. He is also the parent. I shouldn’t have to ask him to babysit for me.", "What? It sound like hubby spontaneously decided to go hunting after they agreed he would watch her.", "In that case, it seems like it's no problem for him to help out by taking her, especially since he already said he'd watch her so you could cook. Good luck today", "OP, I'm not anti-hunting at all.  But lots of people don't hunt, even if they're not against it.  Just saying they're \"going hunting\" is extremely vague to a ton of people, it does not detail the level of risk, the amount of physical activity, or how much attention your husband is able to pay to your daughter.  I was gonna err on the cautious side and say, yeah that sounds like a bad idea.  \n\nNow, 3 edits later, NTA and it sounds entirely reasonable.  But the sheer lack of information in your original post is probably the reason for a lot of kickback you might be getting on this, and I'm gonna say that's on you.", "I love this. I'm glad he has gotten her into it. I wonder if some would think differently if she were a boy", "Okay add a edit to put that. I come from a hunting family and they would let us rid wild. My brother ran off and trip in a hole breaking his leg. But as long as your family is being extra careful with her being a little it’s fine.", "Let's face it. Nothing I actually say is going to change how you feel. And that's fine. Feel the way you feel. \n\nI am coming at it from the perspective that I lived this. Everyone has their own experience, though. I was fine seeing dead deer. It's not like it turned me into some gun toting murderer. It didn't scar me for life. I was taught gun safety young. I knew the dangers of weapons. I was never allowed to handle them alone without an adult helping me. That's just the way I (and many friends) grew up.", "Bruh this kid lives on a farm. With livestock. She’d have more trauma seeing her parents randomly kill an animal at an older age than she will just growing up with it being a normal thing.", "That's good. Also there is a lot of complaining about hunting here. Don't forget about overpopulation people! An increase in breeding can lead to a reduce in resources. You don't have to like it , but sometimes a little intervention can be necessary. \n\nAs cute as deer are, they can be assholes. They ruin your crops and the last thing we need is more deer to hop into the roads and cause accidents. \n\nHunting can be a good thing as long as there isn't sadism in it. I highly doubt your husband is a sadist.", "This is good parenting. Children should know meat was an animal.", "These people obviously weren't raised on farms. Kids can understand responsible harvesting of meat means you have to kill it to cook it and eat it.", "You agree to take her and that he could go out.\n\nIf you’re overwhelmed then tell him he can’t go out. Problem solved.", "Yeah. I didn’t anticipate the need for every detail of information. But I fixed that.", "Yeah.. I really hope these people against hunting are vegan. If you think hunting is bad they should go check out their local slaughterhouse and chicken plants. Then come back and tell me how shitty I am.", "HE AGREED TO TAKE HER. Homie… read the post. We had previously agreed that today he would be on daddy duty. He switched the game up last minute. Not me.", "Haha, I mean, I'm sure you'd agree there's a lot of hunting that gets done where you probably wouldn't want a 4 year old tagging along, and folks are gonna err on the side of child safety.  Nothing wrong with that.  Anyway, a lot of people just read the title and not the post, so you've got that too.", "I would take a family farm over the slaughterhouse anyway. Amen.", "Got it. Best of luck, homie."]}