{"id": 31405, "submission_id": "180fcsx", "title": "AITA for ignoring my coworker after she told our boss she knew my salary?", "selftext": "A couple of weeks ago my coworker (40s F) \"Rose\" asked me (22F) what my salary was, and we found out I was making more than her even before my raise. \n\nRose is the only one with a different title and responsibilities than the rest of our team, but she's been helping out with tasks that the rest of us perform so I encouraged her to ask for a raise.\n\nRose went to our boss and flipped out. She told our boss she knew how much I was making and demanded the same salary. Obviously our boss didn't take it well. I was pulled aside, told what went down, and told that management doesn't appreciate this kind of thing and they'll have no choice but to fire people who do this going forward.\n\nRose called me after work to rant about what happened. I basically told her it was her fault because instead of making her raise about her merits, she brought me and my salary into it. But Rose tried to deflect blame by saying it was our boss who was trying to divide us. \n\nThis whole thing left a bad taste in my mouth and I feel completely thrown under the bus. Since then I kept my head down and secretly planned my leave. \n\nLast Friday, I handed in my resignation and my boss let the whole team know. Most of the team looked visibly pissed off, including Rose. \n\nRose has been trying to reach out to me at work and spammed me with phone calls and texts after work, saying she has important things to discuss. I lied to her that I'm pretty busy so I can't meet at work and have just been ignoring her calls and texts.\n\nIn her last message, she says I can spare her a minute and it's not nice to ignore her. I'm wondering if I'm TA? ", "created_utc": 1700568021, "permalink": "/r/AmItheAsshole/comments/180fcsx/aita_for_ignoring_my_coworker_after_she_told_our/", "score": 48, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) ignoring my coworker who keeps trying to reach out to me\n2) I might be TA because my coworker says it's rude of me to ignore her and says our boss is trying to divide us\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA: but firing someone for disclosing their salary is illegal. You can discuss pay all you want and management can’t do shit about it. Not legally. Next time ask for things in writing for your lawyer.", "NTA. One surefire way of telling if a workplace is toxic is if they don't want you to disclose your salary. Rose didn't behave well either. All in all, you will probably be better off elsewhere.", "ESH. Its illegal to firepeople for discussing wages.  She approached the raise way wrong but was valid in her anger. Talk to rose, you are always an AH when you lie.", "First you shouldn't have disclosed your salary anyways.. threw an axe on your own foot. \n\nSecondly, she acted very immaturely and definitely threw you under the bus. I would've been very pissed too.\n\nNTA", "ESH, you have the right to discuss your salary with anyone you want. And your boss was the asshole for threatening retaliation for doing this.", "What your boss said to you is illegal.  You are allowed to.talk salary. It is protected by law", "INFO: Where you live, are you legally protected in discussing compensation with coworkers? In the US, non-supervisory employees cannot legally be treated this way and the right thing to do would be to leave, but also to make sure your employer knew they were at risk of a lawsuit. And you're right about what Rose should have done, but if she knew it was illegal to actually fire you, her choice to approach it this way would be understandable too.", "Nta avoid her", "Nta, well not illegal and companies that can threaten to fire for people telling salaries is illegal. It's always the best policy in my opinion can never tell other people what you make. In a lot of businesses you can negotiate your salary and some people negotiate better than others. Since you're both female there's no gender bias in salary. And you see the other person didn't ask for a raise but demanded that have the same pay as you.\n\nBut you really can't be too mad at her demanding your same salary because you were the one who told it to her. If you didn't say anything she could never have used it against the boss like that.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA couple of weeks ago my coworker (40s F) \"Rose\" asked me (22F) what my salary was, and we found out I was making more than her even before my raise. \n\nRose is the only one with a different title and responsibilities than the rest of our team, but she's been helping out with tasks that the rest of us perform so I encouraged her to ask for a raise.\n\nRose went to our boss and flipped out. She told our boss she knew how much I was making and demanded the same salary. Obviously our boss didn't take it well. I was pulled aside, told what went down, and told that management doesn't appreciate this kind of thing and they'll have no choice but to fire people who do this going forward.\n\nRose called me after work to rant about what happened. I basically told her it was her fault because instead of making her raise about her merits, she brought me and my salary into it. But Rose tried to deflect blame by saying it was our boss who was trying to divide us. \n\nThis whole thing left a bad taste in my mouth and I feel completely thrown under the bus. Since then I kept my head down and secretly planned my leave. \n\nLast Friday, I handed in my resignation and my boss let the whole team know. Most of the team looked visibly pissed off, including Rose. \n\nRose has been trying to reach out to me at work and spammed me with phone calls and texts after work, saying she has important things to discuss. I lied to her that I'm pretty busy so I can't meet at work and have just been ignoring her calls and texts.\n\nIn her last message, she says I can spare her a minute and it's not nice to ignore her. I'm wondering if I'm TA? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH\n\nThe only Asshole here is your boss\n\n\nYour boss chew you up because he was wrong and he was caught in the lie.\n\n\nThe stigma of sharing the salary is a tool to separate coworkers", "You should've stayed and let them fire you.  It's a massive lawsuit and you'd be rich!  NTA, you did nothing wrong.", "ESH. Never discuss salary. You should not have told her what you make. She handled it badly, but ignoring her after you caused all of this is childish.", "NAH.\n\n'But Rose tried to deflect blame by saying it was our boss who was trying to divide us.'\n\nI think she's right tbh. \n\nYou've done nothing wrong and fair play if you think it's time to move on. But I don't think Rose is an AH either; she didn't handle the situation in an ideal way, but I don't think it's her fault that your boss is an AH.", "nta, sounds like a toxic workplace and rose didn't handle the situation well. you're better off elsewhere.", "NTA, i don't think you did anything wrong. She can't pressure you like that, calling you all the time and stuff.\n\nBut I don't get why you quit. Your colleague was wrong for flipping out at your boss. You just told her your salary and that should be fine imo. If the company is afraid that their workers know someone's salary ,that's a sign the company doesn't pay fairly.", "Screw her. Too busy is too busy.\n\nYour management handled it badly.\n\nMove on. Chin up.You will be happier elsewhere.", "NTA, you have every right to discuss salary.  It is a legally protected right if you live in the US, if they had fired you, you would have been able to go after them for violating the law.  She is an AH because, she did go about it the wrong way.  \n\nIt may be considered bad manners to talk about salary, but that is how employers keep us from figuring out what they can offer so we accept less.", "You are NTA. She is slightly for wording everything how she did to your boss, she could have went about asking for a raise much better.\nThe real Y T A goes to this crappy job. Btw depending where you live it's illegal to fire someone for talking about their wage.", "ESH.\n\nBiggest AH is the company, where I live their \"warning\" is outright illegal.\n\nSecond is Rose for losing her shit.\n\nThird is you for blaming Rose for your companies BS policy.\n\n> But Rose tried to deflect blame by saying it was our boss who was trying to divide us.\n\nShe is 100% right, it's not a deflection the whole reason companies don't want people talking about wages is because then they start getting demands to make it fair.", "NTA - As you said she threw you under the bus. Depending where you are firing someone over mentioning how much you make is illegal. So I would look up your laws for that matter if you ever get into that situation. Second of all if you can't feel comfortable in your work place anymore it's their fault for turning it toxic. Maybe if the boss paid her fairly, and/or she respected the trust you had in her and kept it anonymous things would be dandy.\n\nI went head to head with my boss who tore me to shreds for telling the client how much I was making working for them. By law I am allowed to tell them, I felt it would be very disrespectful not to tell them. Turns out boss was throwing a fit because he was short changing me 5 dollars an hour. I felt horrible afterwards and it was the client that kept me from quitting, I can't imagine how you feel being tossed under that bus by a co-worker.", "ESH\n\nYou're being a bit of an asshole towards Rose.\n\n>Rose went to our boss and flipped out. She told our boss she knew how much I was making and demanded the same salary. \n\nSays who? Did you overhear this? Did Rose tell you that's what happened or did your boss tell you that's what happened?\n\n>But Rose tried to deflect blame by saying it was our boss who was trying to divide us.\n\nI can believe this because...\n\n>and told that management doesn't appreciate this kind of thing and they'll have no choice but to fire people who do this going forward.\n\n...if you're in the US then I believe this is very illegal. You should encourage all your colleagues to discuss their salaries.", "NTA\n\nRose acted in bad faith:\n\n* She took information you gave her in confidence and used it in ways you didn't agree with.\n\n* She used your name completely unnecessarily. The conversation could have happened without revealing her source.\n\n* She didn't take your feelings into account in the aftermath.\n\n* She's crossing professional boundaries by bothering you during non working hours.\n\nTell her you have nothing more to discuss and if it's work related she can contact you using work emails, not personal numbers.", "NTA. You have learned a life lesson. Do not speak about your income. That information is between you and your employer.      \n\nRose is a dick and she should not have involved you in her grievances because they are between her and her employer. While you are still with the company contact Human Resources and tell her to stop harassing you.", "It is gross misconduct at my place of work if you discuss your wages, which equals instant dismissal! You, however, are NTA", "NTA Rose sounds pretty immature for her age.\n\nI'd do her one last favor and let her know WHY you're going NC. If someone does you a favor by sharing \"confidential\" information for your benefit, you do NOT use that info to throw them under the bus. \n\nShe should never have revealed that she knew your salary. \n\nTell her to grow up and take responsibility for her actions going forward.", "\r  \nNTA, girl, she made her mess, and now she's trying to drag you into it", "The people saying never discuss your salary are just plain wrong. This is the problem and exactly what management wants. It’s why there is a huge difference in some people’s pay when they are doing the same job. We should be sharing this information so they stop ripping people off.", "ESH. You were obviously friendly enough with Rose that you encouraged her to ask for a raise and shared your salary. Now you’re basically ghosting her, which is childish.\nRose sucks because she “flipped out” instead of having an adult conversation, and brought your name into the fight when it easily could’ve been left out.", "Go to the same manager and show him the call log and the texts. Ask him to tell her to stop harassing you and trying to bully you.\n\nAt your age, you need to put your foot down and not let these older idiots tried to run  over you. Chin up.\n\nSmart girl", "Info - Is there a clause in your contract stating salary is confidential and did you breach it?", "YTA \n\nRose didn’t do anything wrong and it seems like you left on your own so I’m not really understanding the issue. If you don’t wanna talk to her just let her know but this being the reason makes YTA", "NTA - You gotta look out for yourself, and she crossed a line by dragging your salary into it", "YTA for not understanding that you should never say anything to anyone at work that can be used against you. Your coworkers are not your friends. Don't give them weapons that can be directly or indirectly used against you.", "ESH. You being extra harsh. Rose for the way she handled it. Most of all the boss for making an unfair situation and then threatening to fire you for daring to talk about something you're allowed to talk about.\n\nYour right to get out if you can and make it clear why when you leave.", "yta for ignoring her. just be honest and tell her you need space.", "NTA - she's being unreasonable.  More to the point. Your boss saying they fire people for discussing their wages....pretty sure that's illegal....in North America at least", "NTA, you didn't do anything wrong in talking to Rose about your salary.  People love to say that everyone should, and that's how to deal with companies, and in a sense, they are right.  This is also the real world, and their is real fallout that has to be dealt with as well.  \n\nRose behaved in a *very* stupid manner.  You will rarely get a raise by flipping out, you never throw your allies under the bus, and there was no need for specifics and directly including you.  I don't blame you at all for being pissed and ignoring Rose.", "Yes he should have disclosed. That's how employers keep pay inequality. It's illegal for employers to fire you for talking about salary.", "The reason they don’t want you disclosing salary is toxic and doing so is protected in the US.  You have grounds to sue if you are punished for doing so.\n\nNTA", ">It is protected by law\n\nDepends on where in the world you are.", "While that’s true the company can often fire you for whatever reason they like, especially in certain states with “at will” employment. Discussing salary is a huge problem for these companies and they legit discourage it despite its illegality", "Always discuss salary with co-workers, especially if you have the exact same job role. In the US you cannot be punished for discussing salary.", "That's anti union, which is why in the US it's a federally protected right to discuss wages.", "Actually coworkers should discuss salary. “Never discuss salary” is outdated advice that encourages employers to screw over employees by paying people less for the same work, especially women.", "Bad advice imo\n\nNot discussing salary only benefits the company", "I quit for a lot of reasons, this was just the catalyst. My boss told me that management will be keeping an eye on me because of this and I don't want to work with Rose anymore because I feel like she threw me under the bus and ruined our working relationship when I was just trying to help her by encouraging her to  ask for a raise.", "Rose told me what happened and my boss told me what happened. Both accounts added up - Rose says she flipped out and was still furious when she called me. My boss said the same.", "This is a awful advice.  \nSpeak about you income. With your colleges, friends, everyone you want. Make sure your employer cant fuck you over. The \"dont discuss your salary at workplace\" policy is only beneficial for the employer.  \nFor me its a clear ESH here. You for being angry at Rose, Rose for spamming you, and the most your employer for stupid rules.", ">NTA. You have learned a life lesson. Do not speak about your income. That information is between you and your employer.\n\nNo, just no, this is wrong on every level.", "Are you in the US because that would be illegal and you should definitely be discussing salaries with your co-workers.\n\nIf you're in the UK it's not illegal but would rarely be enforced as you could argue that you were discussing salaries to ensure that everyone was being treated fairly under the equality act 2010. Employers aren't going to mess with that as it's basically an instant lose for them at a tribunal.", "It's also a legally protected right to discuss wages with your coworkers in the US.", "I don’t get it why it would be illegal to talk about your wage", "And bosses are legally barred from firing people for discussing salary.", "If they are American those things are illegal.  Employers can put that in contact all they want it is federally protected \n\nI don't know where OP is from just saying if they are American they are covered", "The issue for me is I feel thrown under the bus. Rose told me in our call after what happened that she knew management wouldn't like it if we talked about our salary and we shouldn't discuss these things, but she was the one who first asked me how much I was making and then told my boss that I told her my salary.   \nI think Rose could have asked for salary without bringing me into it and this could have all been avoided.", "Lesson now learned", "I'm not saying they did wrong by disclosing their salary... \nI just think it's not smart to do something the management doesn't want you to do, not for their benefit but your own\n\nEven though the management can't fire you, it becomes toxic to the point you end up resigning, like OP. \n\nI just like to play safe that's all", "I'm not saying they did wrong by disclosing their salary... But see what it lead to. I wouldn't do something the management doesn't want me to do, not for their benefit but my own.", "Thats actually not completely true... they can fire you for nothing in at will states, but they can not fire you for protected reasons. Discussing wages is one of them protected reasons they can not fire someone over. The biggest issue then is proving it.", "Yes, but you are still stupid if you are highly paid and tell your coworkers.  We have no clue what industry they are in, it's very possible there are no union considerations.  There are plenty of legal things you can do which are still absolutely bone-headed moves for your career.  \n\nI consider myself very pro private-sector unions but there are good reasons some industries unionize and others don't.  Giving advice that is good for the general public while harming that individual's career is something that is easy to do online but would you really give that same advice to your spouse or siblings?", "And rose should have only used that information as motivation to ask for a raise, she shouldn’t have used it as leverage.", "Threatening to fire you is illegal if you re in the US, contact the DOL. So you can save anyone after you", "If you're in the US your boss is acting illegally. You need to report this to the DOL.", "Your work place was clearly toxic. Not being allowed to talk freely about salaries is not ok. Your work can’t tell you coworkers how much you make, but you all should be allowed, and should, discuss it as much as you want to. Allowing people to focus series is a good way to ensure people with the same job are getting commented equally. \nRose should NOT have made her raise about anything but her own merits. If she felt her compensation was lacking because of age and the difference in compensation was extreme accounting for the difference in work then it is a different story. But she should have then gone to HR where the complaint would have been taken seriously. NTA. Good decision to leave. You could always tell rose you felt like she didn’t listen when you told her what upset you and it makes it overwhelming to try and talk to her more.", "I'd still say you're being a bit unreasonably cold towards her. She shouldn't have demanded the same pay as you but you should really all be working together to make sure everyone is fairly paid for their work.", "Not sure where you live. But here in the US a company can't fire anyone for discussion of pay. They just say stuff like that to keep people quiet so they can pay others less for the same amount of work as another. As far as Rose goes, the way she approached the boss about a raise was way out of line. She could have handled it better with them. But acting like that is how a company will start looking for a way to get rid of her.", "I absolutely disagree. My salary is my business. Rose is making a fool of herself with her antics. She should stay in her own lane.", "I absolutely disagree. Discussing income and finances is low class and in poor taste. It’s a bunch of crabs in a bucket.      \n\nRose could have plead her case without putting OP’s name on the table. Rose is a dick. Full stop.", "It’s a boomer myth", "What could’ve been avoided? You quit in you own decision. Of course management doesn’t want people to talk about salaries because then they’d have to pay people fairly", "Rose is TA. She can ask for the raise not revealing about your salary. There are a thousand ways. You did nothing wrong. You even help her, encourage her.", "You weren’t thrown under the bus because neither you nor Rosie did anything wrong. Your boss is just an asshole who doesn’t understand the law or how to lead. You also don’t know how the conversation between Rosie and your boss went down.", ">but there are good reasons some industries unionize and others don't.\n\nThat reason is union busting. And attitudes like yours which says if you make more and benefit from unfairness and bad labour practices, don't rock the boat and go \"fuck you I got mine\".", "There don't have to be considerations, it's still a federally protected right. It is illegal to tell an employee they can't discuss wage. \n\nI have absolutely given that advice to people I know. Recently, in fact.", "Mate. What world do you live in? Rose doesn't even do the same job as OP.", "Then why let management know you're talking about salaries? If Rose knew management would try to shut that down, how does it make sense to let them know? She could have left me out of it and gotten a raise by talking about her accomplishments.", "Rosie got OP in trouble with management. Management is absolutely IN THE WRONG but that doesn't change the fact that Rosie knew her actions would create problems for OP and did them anyway. \n\nSo yes, OP was thrown under the bus, even though Rosie is in the right in her argument with management", "You think attorneys aren't unionized because someone went union busting?  Truly?  \n\nOk, I'll play along.  Which attorneys started trying to unionize and who came after them?  If you can't source that will you at least re-consider your position that the only reason is union busting?", "What advice did you give that harmed the individual's career?  We aren't talking about simply discussing wages, it has to be a situation where it has negative personal consequences.", "You are definitely young and idealistic.", "Just because they don’t want you talking about salaries doesnt mean you shouldn’t. That rule is for their benefit not the workers. If she’s doing the same work as you there’s no reason she shouldn’t have comparable pay. It’s probably something she could find online anyway.\n\nRose did nothing wrong but if it makes you uncomfortable now you know not to talk about wages", "It did not harm their career. That's my point.", "Don't be daft. Rose could have left it anonymous. She brought up OP specifically, knowing it would get her into shit", "I didn't say we shouldn't talk about salaries just because management said so. I'm saying, why did Rose have to say \"She told me how much she was making and I want that same salary\" instead of \"I think I deserve a raise because I have done this, this, and this and the market rate is this.\"", ">I think I deserve a raise because I have done this, this, and this and the market rate is this.\"\n\nWhy do you assume she hasn't done this to the point of death?", "I'm not assuming. I literally asked her this exact question and she admitted she never brought up what she has done or the market rate. Rose told me she said \"Rare-Switch8910 told me what her salary is. I know she's making more than me. I want the same amount\"."]}