{"id": 31430, "submission_id": "180lc5t", "title": "AITA for expecting my seven year old step son to clean his own room and do his own laundry before doing extra \"fun\" things during the week?", "selftext": "Our seven year old (technically my step son) has laundry day on Monday and is expected to clean his bedroom on Wednesdays. He gets out of school early on Wednesdays and we often encourage him to get his laundry started on Sundays (usually he would rather wait and get it started on Monday). The only rule we have when it comes to these chores is if they aren't done by the end of the day that they're supposed to be, the next day he has to stay in his room until the task is done. He still gets to go to sports practices, but other than that we don't do anything extra like watch a movie or go to the park until he gets these things done. For the record, when he actually puts effort in and buckles down and does it, neither of these things take him very long. The exception of course is when he is actively stalling. \n\nAnyway, his mom called and wanted to watch a movie with him tonight (she lives a few states away so this would be a virtual thing where they are basically both putting the same movie on at the same time.) We said they can watch a movie after dinner if he gets his laundry finished when he gets home from school (he spent all night last night actively avoiding getting it done.) She got upset because she has plans later tonight so the only time she can do it is right after school. We said she could call and talk to him while he works on his laundry, but he couldn't do a movie unless his chores were done. She asked if they could do it tomorrow instead and my husband said thats fine as long as he gets his room cleaned first. \n\nShe got upset and said that it's ridiculous that we are even expecting a seven year old to do his own laundry and clean his own room and that we should \"let him have fun and be a kid.\" She also said it's not fair that we are \"stopping them from spending time together.\" For the record, we have tried to set up regular times for them to do things like this together, but after a couple of weeks she will stop doing the scheduled calls. Sometimes she goes a few weeks without any contact at all. This is one of those instances when she hasn't been in contact for weeks and now all the sudden she wants to do something with him right now. They don't even talk during a movie, so really him talking to her in the phone while he does his chores would actually give them more bonding time.\n\nAre we wrong for expecting our seven year old to do his chores before doing extra \"fun\" activities during the week, even if they are with his mom?\n\nEdited to add (copied this from my response to a comment asking for more info):\n\nWe help him load the washer/dryer and all of that. Then it's his responsibility to take the clothes out of the dryer and put them away. He has to fold his pants and hang up the shirts (we have a low bar in his closet that he can easily reach). Every second or third time he puts his clothes away we will help him just to make sure things are staying organized and not getting out of control. \n\nPicking up his room is basically just putting his toys away and taking any empty water cups out. Every month or so we go through it together to help make sure things are staying organized.\n\nEdit 2: he only does his own laundry, not ours. ", "created_utc": 1700585093, "permalink": "/r/AmItheAsshole/comments/180lc5t/aita_for_expecting_my_seven_year_old_step_son_to/", "score": 33, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > We might be assholes because we are making our son finish his chores before watching a movie with his mom.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You make it sound all logical and good parenting 101 but you're missing something.... empathy maybe? I'm not sure what to call it. \n\nYou sound like you're being inflexible.   He's only 7 after all.  The expectation isn't necessarily wrong, but you know the old carrot and stick?  You're only using the stick.   So at the same time as providing no incentive you're also removing pretty normal activities that aren't treats as much as simple family time.   \n\nIt doesn't sit right, either, that you say laundry day is to the end of the day on Monday but you actually expect it done on Sunday.   \n\nSecondly, time with his bio mom is never a negotiating point.   Never.  Sure she's unreliable and not a good parent by the sounds,  but she's not putting the kid in danger or hurting him and you've no right to get in the way of their relationship.  How do you think that will work out in the future if you continue to insist bio mom is second or third or last?  Can you not see that you could well breed enough resentment that kiddo rejects you and turns to her?   \n\nSo YTA.  Kiddo needs flexibility.   He needs rewards for behaviour you wish to reinforce.   His family time, and bio mom time,  is a priority and not a punishment.", "INFO What does doing the laundry and cleaning his room entail? What do you expect him to do (for the washing: just sorting and folding or also actually washing and drying and for his room: just organizing his stuff or also sweeping, cleaning etc.)? Do you do the chores together or do you expect him to do them on his own?\n\nI agree with letting children do chores but they should be age appropriate and be made a joint learning activity.", "YTA\n\nIt's fine for him to do his chores and whatnot, but you shouldn't keep him away from his mother because of that. If it was a friend or something, then sure. But his mom? Come on, don't be obtuse; you know there's something kinda off about doing that.", "my parents had us do chores for computer time, online time, etc. too when we were young, so I can see where you're coming from, but I do think a 7 year old shouldn't have so much responsibility. Our parents didn't start making us really help around the house until we were 10.\n\n and I definitely wouldn't deny him spending time with his mom for something like that. I'd have to say YTA.", "YTA. I think it’s inappropriate to withhold time with his mom like that. That’s super messed up to tell a kid they can’t see their mom because they didn’t do their chores. What an unfair responsibility to carry as a 7 year old. \n\nYou say he still gets to go to sports practices and that’s the only exception. Is that not a “fun” thing? He can go have fun playing sports but not spend a couple hours with his mom? Sounds unnecessarily controlling.", "YTA - Tidying his room is one thing, but making a 7 year old do his own laundry is too much. You are being too strict and demanding too much from a small child. At most he should be helping with laundry, like doing some sorting or something.", "7?  He's 7?  \n\nOf course YTA!  He can *help* with laundry (taking his dirty clothes to the laundry area, putting his clean clothes away, etc).  But to DO it?  All by himself?  At 7?  \n\nYou're ridiculous.", "7? \n\nWow really trying for the evil stepmother stereotype there, eh. \n\nI bet you watched Cinderella and thought she was the bad guy in the house.  \n\nYTA\n\nI notice you also have a 9 month old baby. Will he start scrubbing the floors soon?  \n\nPoor kid doesn’t get to be a kid. I bet you’re going to start having him babysit soon too", "YTA. It’d be one thing if it were a friend. But his mom? Give me a fucking break. The seven year old doing their own laundry thing is also incredibly weird, but that’s another story.", "YTA.\n\nTeaching kids to do chores and behave responsibly is good, but part of being a responsible adult is knowing that you can occasionally be responsible later in order to do something time sensitive, and getting to hang out with his mom is definitely one of those situations.\n\nI don't find the laundry thing as weird as other people in terms of difficulty, but I do think it's kind of just busy-work; at least in my household, the limit on laundry is far more the physical dryer/washer time than any sort of folding so running a separate load just for his stuff seems silly when you could run combined and easily separate out his stuff.", "You're not wrong for expecting a child to do chores before fun time.  Is it wrong to expect him to do his chores on a specific schedule even when his mother, who lives far away, wants to spend time with him?  When he's 7?  Well yeah. \n\nI'm all for personal responsibility, but this rigid schedule seems unnecessarily strict for a small child.  Let him watch a movie with his mom ffs.\n\nYTA", "YTA. i had chores at the age of 7 too but mine was filling up few bottles of water and put it in the fridge. doing laundry is too much work for such young age.", "Laundry at 7?! That seems really young to me. I have an 8 year old and I wouldn’t expect him to wash his own clothes! \n\nIn the UK that would definitely be something I would give to a teenager. At 7-9 years old I would expect them to tidy up after themselves and that’s about it. \n\nMy 8 year old is pretty tidy in general so never had to enforce chores to be honest.", "YTA cleaning up his room is one thing his freaking laundry!! Are you serious? That is beyond ridiculous. He is 7!!", "YTA - He is 7 years old FFS! 🤦", "YTA. Expecting that level of responsibility from a 7 year old and enforcing the rules in a manner that would deprive him of time with his mom are both very unreasonable.", "Soft YTA\n\n1. It sounds like him not getting his stuff done is a fairly normal occurrence. If that's so, he may need more support in it than you're giving him. A lot of kids find \"clean your room\" or \"do your laundry\" overwhelming because of there being so many steps and not knowing where to start. Cleaning up is a learned skill but a lot of parents forget this. Just because he's done it successfully before doesn't mean it's not still overwhelming for him. You need to find out what is getting in his way and provide that additional support if you're going to expect him to do this. Set your kid up for success, not stress. This may come in the form of a check list (1. All clothes in the hamper, 2. Sports equipment in their storage spot, 3. ...) Or other way of breaking it into something more manageable and less stressful.\n\n2. You're having to navigate a relationship with a difficult coparent. That's challenging. While it's good to maintain consistency at home, a 7 year old won't understand anything except that you're keeping him from his mother. If you keep rules rigid he won't learn the desired lesson (good habits and responsibility) but will come to resent you and the rules.\n\nIn adulthood we also try to be responsible and have expectations on us. And sometimes we can't get out of them, but sometimes we can. Sometimes we can ask off of work to go do that special thing, sometimes we can set up jobs where they let us have odd hours while still completing our responsibilities. Teaching a kid to be responsible is important, but it's also important to teach kids that sometimes people have mercy, to advocate for themselves, and that sometimes their personal life *should* take priority - within a balance.", "Yes YTA in every way. I can see having a seven year old assist you with the laundry and wanting to have a set day for him to clean up his room but not allowing him to do anything ever until he does what you ask is too much. Pick one punishment. For example, if you don’t clean your room by bedtime on xyz day, you cannot play video games tonight or you cannot go to abc friends house tomorrow. Withholding quality time to spend with his mother seems like you’re being vindictive and manipulating a child into doing things you don’t want to do for him because he isn’t your biological child. I will reiterate….YT fucking A!!", "So basically this kid is already torn to pieces because his family fell apart and now his step mom treats the ability to contact his own mother like a privilege that he has to do chores for. Yeah YTA, in what word do you as a step mom think it's okay to prevent a child from talking to his actual mother? You're just trying to stir up drama.", "YDefinitelyTA\n\nIt would be different if he were older and if it were to go out with friends. But a movie with his mother that lives states away? Denying that for any reason is evil or at the very least incredibly cold hearted toward a child. 7 year olds shouldn’t be doing all of their own laundry. Maybe they could learn to fold clothes and put them away and pick up/put away toys, but Jesus. Sounds like a miserable roof to live under.", "Yta\nLet him be a kid", "My own kids did parts of the laundry at 7, so that part doesn't throw me as much. Here's where I think YTA, though. You are a step-parent actively preventing him from spending time with his mother. That should never, ever be linked to chores or anything else. It should never be used as a reward or a punishment. That is his mother. Messing with that is a sure-fire way to win evil stepmother awards. Don't do it.", "This is insane😭", "YTA for denying him time with a parent over laundry", "YTA. He's not your biological kid, so you shouldn't be punishing him by preventing him from seeing his own MOTHER! You give him entirely too many chores for his age. He's only SEVEN years old! That's way too young to be expected to do his own laundry and keep his bedroom clean. When my kids were that age, I did their laundry and helped them clean their bedrooms. They helped with other simple chores, like dusting the living room, unloading the dishwasher, and setting the table for dinner. Chores need to be age appropriate. You expect way too much from him and are far too rigid about it. Have fun when he rebels against all the strict control as a teen.", "YTA he is 7 years old not 17 pick up his toys and things yes do his own laundry no stop being a step b itch and either stay out of any and all parenting of him or accept that any decision his mother makes overrules any and all decision you make because YOU ARE NOT HIS PARENT and since YOU ARE NOT HIS PARENT you get zero say in any rules decisions or choices made for him.", "YTA\n\n>Sometimes she goes a few weeks without any contact at all\n\n>(she lives a few states away\n\nAre you serious. Let the poor kid have some contact with his mom!", "Totally TA. Are you serious ,you expect a 7 year old to do his own laundry. I hope you mean put it in the wash basket, and not load the machine ,put it on ,empty and dry it. If you do mean the 2nd then both you and your wife are TA's. 7 year olds should be enjoying life and learning. Not slaving to keep his clothes clean. Sounds a bit like child abuse to me.", "YTA.", "YTA I don’t have a problem with you teaching your step child to do laundry but making the kid do all of their own laundry is too much! Make exceptions so the kid can spend time with their mom!", "YATAH. 7 is too young to do the laundry. If his mother goes MIA and is not consistent you shouldn’t stop him from talking to her. He is still a little boy and you are punishing by taking away time with his mother. This is just bad parenting.", "YTA\n\nHe's seven. SEVEN. What seven year old is capable of doing laundry?? Laundry detergents are full of harmful chemicals, and I've definitely known 7yos who still put most things in their mouths! And you're punishing him by removing all stimulus and refusing him contact with his mother for not doing laundry? \n\nThat's abusive. It's cruel. I sincerely hope the mother calls CPS and goes for custody, because you two are monstrous for treating a child like that. And he is a child, a very young child. Teaching children the necessity of chores is important. Teaching them to safely do those chores at an appropriate age is important. Treating a 7yo like this? Nope, that's unacceptable.", "YTA. I'm 32 years old, married and a homeowner. Plenty of times I set a goal to get my laundry done and I don't meet it. I don't punish myself by not doing anything enjoyable, that's a shitty cycle to get into.", "YTA Evil stepmother. Did you learn anything from Disney?!", "YTA\n\nRegardless of anything else, chores are not to buy time with your parents. Punishments should not involve losing time with a parent.", "YTA-while I think it is appropriate for him to have some chores to do, I don’t agree with him having to do his own laundry.  Keeping his room neat and tidy is appropriate but I have questions about him doing his own laundry. What does that entail?  Do you expect him to have his dirty clothes in the hamper or perhaps taken to the laundry room?  Do you really expect him to wash and dry his own clothes. You are leaving some information out here.   Until you clear up these questions, the YTA stands. I think you are asking too much of a 7 year old.", "YTA 7 is really early imo. I don’t even think i could get clothes off the counter at that age lol let em be a child for a few more years", "YTA. It's fine for you to get him to do chores. But you prevented him from spending time with his bio mom and that's just petty. For better or worse it sounds like you don't like your stepson and are overly strict. Also the kid is 7. Cut him some slack. I'm in my 40s and I occasionally get lazy about laundry.", "YTA - Not for him having chores. I was doing laundry by the time I was 7 too, and I don't really think that's a big deal. Honestly, it was doing the dishes that young that I had a problem with. But where I think you went wrong is that this is his mother, not a friend. If it was something that happened every week, I would get your saying no or setting a specific day. But he hadn't seen his mother in a while, and while I get that this is her fault, it's not his fault and he should be able to see his mother the few chances that he gets.", "YTA - Having some tasks for a younger child to do is good to help them become responsible.\n\nBeing totally inflexible and rigid with them is an asshole move, especially if it impacts their relationship with a parent.", "I’m shocked at these responses. NTA all the way. My younger kid is 10 and has been putting away his laundry for years. Putting away laundry (really the hardest part of “doing” it since putting it in the washer or moving to the dryer can hardly count as a chore) and cleaning his room are not unreasonable chores for a 7 year old to do. He’s not scrubbing a bathroom or doing all the dishes", "You are a terrible step parent. He is going to resent you if he doesn’t already.", "YTA\n\nYou're too inflexible. This was special situation.\n\nKeep this up and don't be surprised if stepson chooses to live with his mom when he's older.", "YTA\n\nMy children are teenagers and don't have to do their laundry.\n\nThis is nothing an elementary school child should do.", "Yeah, that's too much expectation for a 7yo. I have a 12 year old and all he does is the dishwasher and takes out the recycling into the big bin for collection and both of those have only been for the past 2 years. Obviously keeping his own room tidy is up to him as well, but you've put too much responsibility on a 7 yo. He should bring his washing over, or put in the washing bin, as and when needed but to do his washing himself is too much.\nYTA", "YTA and so is your husband. \n\nFrom someone who had a lot of responsibilities at a young age like him, I easily got overwhelmed and became really resentful. Obviously he can't seem to get it all done, so there's a problem. Yes, he's a kid and should clean his room but he does need help. His laundry? Do it for him- have him sort out the colors and teach him how to put those clothes away once they are folded. And to hold his mother over his head until he is done with his chores is a whole different type of cruelty. You and your husband are so wicked.", "I am al for age appropriate chores, doing is laundry at 7 isn't something I would do.  I am going to say NTA, you have a schedule, for a reason.  It sounds like his mother is the one who cannot keep to any sort of schedule with your step son.  Watching a movie and not talking is not an engaging activity.  Good grief!!   I would consider setting up scheduled remote visitations, this way you can still plan life around Mom.  If she can't adhere to it, that is on her, she has absolutely no right to expect that she can phone in at any time for whatever she wants.", "NTA- All of the Y-TA comments must be from teenagers. It’s completely age appropriate to have a seven year old clean their own room and do their laundry. My two year old helps clean her room and helps with laundry. If she is two, a seven year old can easily do these tasks themselves. People forget that children used to work full time jobs 150 years ago. It’s not robbing them of a childhood to expect them to take care of their rooms and belongings. Being consistent with the expectations is better for his development than making a bunch of exceptions. Also, you aren’t denying them time together. Bio-Mom wants to bank up good mom points by watching a movie together without actually having to interact with son. Talking while he does his chores IS better quality time than sitting in silence watching a movie. Keep up the consistent expectations. You are raising a responsible young man!", "Nta.  Disney Mom doesn't care about raising her own kid, his schedule, or his responsibilities, but she wants to watch movies whenever she likes?  Nope.\n\nAlso, it is WILD how many people here are shitting themselves over the idea of having to do laundry.  Pick up cloth.  Throw cloth in washing bucket.  Turn a dial and push a button.  Add soap.  Wait.  Take cloth from washing bucket, put in dryer bucket, turn dial and push button.\n\nA monkey could do it.", "My now teenager started doing laundry at 7 along with being responsible for her room. She now is a-lot more capable of managing her self and her things that most of her friends. \n\nIt is totally fine and you are setting him up for success in the future in an age appropriate way. Given the way his mom is in and out and here and then gone, I dont see that as a problem at all. You offered to let them chat while he does his laundry, so you didnt just tell her to go away. \n\nNTA", "NAH.\n\nYou have the right to run your household the way you see fit. A \"chore guideline\" would suggest your stepson should be helping or folding laundry at this age, and \"doing laundry\" as a tween.  But other commenters saying he is too young to do his own laundry are missing the fact that he is already doing it every week.  And as you say, it's not a matter of him being able to do it, it's a matter of procrastination.\n\nHis mother should be encouraged to help him be responsible, rather than trying to help him get out of chores.  Of course you should also be allowing/encouraging them to spend time together, but she seems to only be interested in her own schedule and having fun.", "NTA - If you all think these chores are inappropriate, you're severely underestimating kids. If a kid can operate an iPad, he can operate a washer and dryer. They are his clothes, and it's his room 0- it's completely appropriate and good parenting to have these expectations.\n\nCheck this list of age appropriate chores - pitching in and helping to clean and maintain the home is something that builds confidence, teaches responsibility, and prevents the entitled behavior so many people complain about in children: https://childdevelopmentinfo.com/chores/the-ultimate-list-of-age-appropriate-chores/", "NTA. I grew up in a household where my older sister started doing her laundry at 5. Lots or parentification, not saying it was amazing, but for some families it works just fine.  My siblings and I have benefitted from this type of raising of children. Millennial and older don't have a problem with this, it's the younger generations that throw fits doing any chore, like my kids.", "YTA it notnunfair to make him help or enforce consequences for not doing them, but using not being able to see his mom as punishment is lessed up big time.", "NTA. I like watching social media content about horses and their behaviors. there is one horse whisperer guy who doesn't believe in using a whip and encourages smiling when firming up so anger stays at bay. another horse trainer with many awards will use a whip and it's affective. someone posted in the comments that he should be like the other guy that doesn't use the whip and this pissed the whip trainer off. Maybe your stepson's dad needs to be the firmer motivater. Like the whip guys say, \"I ask, I requested, now I'm telling.\" the lazy horse does what is ask. People have different parenting styles and if one thing doesn't work, try another. Maybe the birth mom can be supportive. the child is old enough to do chores and learn that there are consequences.", "YTA. Could a 7 year old do his own laundry? Sure. Should he? Not unless he is in a military boarding school.", "You’re NTA!\n\nYou’re not preventing her from doing it.  If it was so important to her, she could cancel her plans later in the day so she can watch with him after he finished his chores\n\nYou also said that alternatively, he could the following day if his chores are finished.\n\nThe simple solution is for him to just finish his chores of course but if it’s so important that she’s being so dramatic about her son being kept from her - she cancel her own plans!\n\nThe world doesn’t revolve around her and you’re teaching your son valuable life lessons and skills that responsibilities matter.\n\nGiven her on again off again inability to honor her own commitments, I really no surprise that she’s not respecting yours.  Doesn’t mean she’s not TA - she is.", "NTA. A lot of people forget that while yes they are kids, the end goal is they will be adults. As long as there is time for fun and play, upholding responsibility is a good thing. Kids aren’t taught the things they need to be taught before adulthood now and everyone complains when they’re 18-26 year olds take advantage of them and are lazy. My mom has the mindset, “oh they’re kids, they should just do kid things.” And it seriously stunted me and caused me to struggle hard as a adult.", "Currently your step son is failing weekly. He is experiencing \n\nDo you think he is stalling constantly with the cleaning because he chooses to do so? Even when constantly loosing normal things like having time with his mother or family time.  Are you sure the tasks are not overwhelming for him and his avoiding doing them because they are stressful in his mind. Maybe adjusting it to smaller simple tasks could help him easily complete the tidying of the room. \n\nI was asked to clean my room as a kid. It was my biggest problem in life that I could not keep my room clean and I could not get it clean. Sounds that I had easy life right? I was 13 when I first time tried to end my life, 14 when I ended up to in patient care after second attempt. I was so convinced that I am worthless and a burden because all my life I felt guilty about not being able to clean my room. It did not matter that I had the best grades of my class, I cooked and did laundry. I could not clean my room and it meant I was stupid and lazy and just a complete failure as a human. I just got so overwhelmed I could not do it. It took years for my mom to realize that all of my childhood she demanded me to do something I could not do giving me life time of failures to meet expectations and it scarred me figuratively and literally for life.  \n\nCurrently your step son is failing weekly. He is experiencing failure every time he does not get the laundry done or room cleaned and then you punish him from being a failure.", "NTA. It’s better to start expectations for how to take care of yourself in small manageable age appropriate ways. Which is what it sounds like you’re doing. Kids are hard, you want to give them fun times and love, but you also need to help them establish successful behaviors early in life so it’s a habit. \nTo all the people saying YTA, clearly you’ve never had a sig other who never learned to clean up after themselves. It starts young.  Maybe talk to bio mom about that. Ask her what she considers age appropriate for learning to clean up after himself?\n\nAs far as bio mom time, compromise. Structure is important, and son deserves to know he will regularly see his mom. Doesn’t mean that her last minute requests can always work, but if it’s the exception, then let bio mom know that. It helps if you and her were on the same page, so that everyone knows it’s an exception. But it doesn’t sound like that feasible yet.", "NTA but damn y’all need to work something out better so the mom can be involved. She needs to be called out on her shit.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOur seven year old (technically my step son) has laundry day on Monday and is expected to clean his bedroom on Wednesdays. He gets out of school early on Wednesdays and we often encourage him to get his laundry started on Sundays (usually he would rather wait and get it started on Monday). The only rule we have when it comes to these chores is if they aren't done by the end of the day that they're supposed to be, the next day he has to stay in his room until the task is done. He still gets to go to sports practices, but other than that we don't do anything extra like watch a movie or go to the park until he gets these things done. For the record, when he actually puts effort in and buckles down and does it, neither of these things take him very long. The exception of course is when he is actively stalling. \n\nAnyway, his mom called and wanted to watch a movie with him tonight (she lives a few states away so this would be a virtual thing where they are basically both putting the same movie on at the same time.) We said they can watch a movie after dinner if he gets his laundry finished when he gets home from school (he spent all night last night actively avoiding getting it done.) She got upset because she has plans later tonight so the only time she can do it is right after school. We said she could call and talk to him while he works on his laundry, but he couldn't do a movie unless his chores were done. She asked if they could do it tomorrow instead and my husband said thats fine as long as he gets his room cleaned first. \n\nShe got upset and said that it's ridiculous that we are even expecting a seven year old to do his own laundry and clean his own room and that we should \"let him have fun and be a kid.\" She also said it's not fair that we are \"stopping them from spending time together.\" For the record, we have tried to set up regular times for them to do things like this together, but after a couple of weeks she will stop doing the scheduled calls. Sometimes she goes a few weeks without any contact at all. This is one of those instances when she hasn't been in contact for weeks and now all the sudden she wants to do something with him right now. They don't even talk during a movie, so really him talking to her in the phone while he does his chores would actually give them more bonding time.\n\nAre we wrong for expecting our seven year old to do his chores before doing extra \"fun\" activities during the week, even if they are with his mom?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "He's 7? You expect him to do laundry?", "YTA.YTA.YTA. 7 is too young to do their own laundry.  \nWho does yours??! If you and your husband do each their own, I guess it’s less bad, but I’m guessing that the parents are just doing theirs together… I’m not sure y’all are ok", "YTA. I have never heard of a 7 year old doing their own laundry and withholding contact with the other parent because of this unrealistic expectation is cruel to both of them.", "YTA. He’s 7. You need to be more flexible and age appropriate. Having him tidy his room is totally fine, but doing all of his laundry himself seems like too much. Do you help? Can’t you do the laundry together? My 7yo puts his dirty clothes in the laundry, likes to help load and push the buttons, then puts away his clean clothes. Teaching him personal responsibility and independence is great and of course important, but he’s still a little kid. A little kid who clearly misses his mother, who moved away. Give this kid some empathy and help.", "YTA. \n\nYou don’t use time spent with family or his mom as a reward for doing his chores - and you also don’t use not having that family time as punishment. \n\nYou reduce screen time or something else,  but I beg of you - do not limit family time.    Right now he is 7.   One day you will have a resentful teenager. \n\nI fully appreciate you wanting to teach him about life and chores - but he is also only 7.      They are easily distracted and they also don’t understand why laundry is important.  \n\nI understand the bedroom cleaning,  but for him to do his own laundry is a bit much I think.    I would get him to help with laundry instead.", "Teaching a kid (and especially a boy) household tasks is good. So is flexibility. And especially with children so young that executive functioning is way down the developmental path. Punishment and rigid enforcement shouldn't be part of it. YTA if you overdo the consequences and rigid rules thing.", "Kids can and absolutely should do chores, BUT chores should be an expected part of daily routine, as opposed to with the threat of punishment hanging over their heads if they don't do it or get it done on time. Furthermore it's not okay to not allow him to see/speak to/spend time with his mum just because he doesn't complete or do his chores on time. He has every right to spend time with his parent.", "Haven’t read it all but you do not get to deny him time with HIS mother. Friends? Yes. His mother? Absolutely not you’re the asshole.", "[removed]", "My older son is 12. My younger son is 7. \n\nMy older son is responsible for his laundry and cleaning his room. \n\nMy seven year old needs guidance. I ask him to tidy his room and give him chores when he asks to help out. \n\nMy seven year old never does his laundry. He will however help put his clothes away if he can reach it. (He can’t hang his clothes but he can put clothes away in his dresser. \n\nIn short, you’re the asshole for having inappropriate and high expectations for his age.", "YTA. Sounds like this post is making a bunch of seemingly practical justifications for withholding access to the child’s parent. And they do seem somewhat practical, but at the end of the day you’re still doing the crappy thing, and it doesn’t really matter why. I can’t explain why but this post and the responses also reek of exerting control just for the sake of it and spite the other parent and step-child. The part where we are pretending it’s about what’s best for the child just seems like pretense. Especially after the one commenter pointed out that it’s not even laundry day by your own admission, and why it suddenly needs to be done today wasn’t addressed.", "What did you do when you were 7 around the house? Honest question.", "Yes.", "YTA. \n\nI don't see issue with small chores, but please don't restrict time with his mom. He can't help that she's a flake & inconsistent. So when she does step up, please let him do the same. \n\nBased on what you're saying, it may be another few weeks before they speak. Poor guy!", "NTA\n\nI don't get all the Y T A responses. First of all, if she were coparenting in person and didn't uphold the custody schedule, the majority advice would be to tell her to kick rocks. So how is it any different just because it's virtual? She doesn't make time, doesn't care to parent the rest of the time - so instead, she disrupts the kiddo's life whenever she feels like it and it's just supposed to be okay because she doesn't spend time with him otherwise? Nah, no thank you. It's not on everyone else to make sure she has a relationship with her kid.\n\nIf it were a one off and she ONLY had that time available because of something important going on, then sure, help make sure she can spend time with her kiddo. But it sounds like it's a chronic problem and that problem isn't going to get any better if they don't hold her accountable.\n\nI'm also laughing at all of those saying a 7 yr old shouldn't be doing laundry or cleaning his room. Do you want to know what I was doing at 7? Every morning before school I had to go out and feed the calves, pigs, sheep, and chickens/turkeys. Then I had to feed the cats / dog. Every morning after school I had to go out and feed again. I also had to help with laundry, dishes, garbage, and keep my room cleaned. It wasn't abuse - it was the nature of living on a farm and having two very hard-working parents who wanted us to be able to become functional adults. My step-daughter had chores too - pick up her room, pick up her random crap that always ended up in the living room / kitchen / bathroom, help unload the dishwasher, make sure her clothes were in the dirty clothes hamper, and help put clothes away after laundry was done.", "YTA. who punishes a 7 year old year old for not doing their laundry? He's 7!", "YTA.  I haaaate folding and putting away clothes.  Often they just sit in my basket until I need to wear them. My folding is also pretty minimal - we also don’t make our kids (9 & 7) fold their clothes.  They just put them in the correct drawers.  They’re responsible for bringing their laundry to the washer, helping sort dry clothes if necessary and then putting their clothes away. Some things just aren’t worth fighting over.  I find both my kids really respond well when I help them with their chores so I might help sort into piles or hang a couple of things up but they do most of it (I just help slowly on purpose lol).  \n\nAfter discovering I have ADHD at 41 I read the book How to Keep House While Drowning by KC Davis. It gave me a lot of great ideas.  Maybe he could just have a clean bin and dirty bin and not put his clothes away.  Do you want to fight about this weekly? I don’t like clothes on the floor but don’t care too much how well they’re folded. Ask yourself what your priorities are and gently ask him what he struggles with most in doing this chore (other than just not wanting to do it).  For cleaning his room maybe he just needs some bins to make everything easy to sort or pick up.  I still help both kids clean their rooms though my 7 year old needs more help than my 9 year old.\n\nOur daughter would never put her dirty clothes in the hamper which is literally 3 feet from where she’d leave them on the floor.  One day I was so exasperated and I asked her why it was so difficult to throw them in the hamper instead of leaving on the floor - she told me Dad had said she needs to turn her clothes back the right way (they’re often inside out when she pulls them off) and at the moment she was changing she just didn’t feel like it.  We came to a compromise that she’d separate the tangled underwear from pants and the shirts from sweaters but she didn’t have to turn them the right way and it’s helped.  I loosely drew from the concepts that Ross Greene uses (The Explosive Child) by meeting her where she was at and working on a compromise together.", "YTA\n\nWhat you’re asking of your stepson is reasonable but how it is enforced is not. Do you and your husband keep such strict guidelines for yourselves in regards to chores? Or do you offer some exceptions when things pop up? Let’s say your day to do dishes is on Mondays, but your friend or family member calls with an emergency or tickets to an event that night. Do you tell them “sorry I have to do dishes and can’t do anything else until they are done”? Or do you set aside time to come back to the task later and tend to your friend or family member? Things need to be done, stuff should be scheduled, but flexibility is also important. You could’ve easily said “Stepson, your mom called and wants to watch a movie. Do you want to finish laundry before the movie or finish up tomorrow if there’s no time after?” That teaches responsibility, accountability, and  follow through on expectations. Talking to his mother is not a reward to be given and taken away. You have no right to limit their interaction and you are not in control of when they do speak to each other. You are creating room for resentment with your stepson because he must follow your strict instruction for no reason other “because you say so.” The chores aren’t the issue, it’s the inflexibility and unreasonable expectation of a child.", "YTA. My sons just turned 8 and I dont make them do the laundry. They clean their rooms, clean their bathroom and make sure their dishes are rinsed. Everything else is on me. Taking time away from his momma cause of your rules or way of thinking can be detrimental to the relationship with the child.", "Expecting a 7 yo to do his own laundry is not something I've ever heard of in my 44 years on this planet. \n\nSo yes... YTBIGA here in that regard. Crazy.", "Her: “the carrot is me allowing him to do things every other 7 year old is already allowed to do, of course”🙄", "I really appreciate the way you put this. Rather than having the threat of taking things away, it's better to earn a reward for getting it done. Is that what you're saying? I think it makes a lot of sense and you're right, it's probably a better way to approach it. \n\nWe definitely don't want to get in the way of his relationship with his mom. We just thought having them talk on the phone was a reasonable compromise to watching a movie (where they don't talk). \n\nBut I do see that we probably have become too rigid in the name of consistency. I guess I am not sure how to walk that line but you've definitely given me/us some good points to reflect on. Thank you!", "Very well put!", "We help him load the washer/dryer and all of that. Then it's his responsibility to take the clothes out of the dryer and put them away. He has to fold his pants and hang up the shirts (we have a low bar in his closet that he can easily reach). Every second or third time he puts his clothes away we will help him just to make sure things are staying organized and not getting out of control. \n\nPicking up his room is basically just putting his toys away and taking any empty water cups out. Every month or so we go through it together to help make sure things are staying organized.", "I hadn't thought of this but I really like that approach (having getting it done be a way to earn screen time). This seems like a good way of lessening some of the rigidity around it. We both grew up in super strict households (at seven I was doing everyone's laundry) so it's hard for us because we know that our parents were overly strict with high expectations but we don't really know how/where to set the bar. Thank you!", "If she comes into town last minute we always let him go with her, even if it means cancelling plans. This isn't that. This is her wanting to put a movie on from two states away so they can both watch it at the same time. They don't even talk during it.", "My children had age appropriate chores. Tidying his room is reasonable. Expecting a seven year old to their laundry is not. At that age, we  expected the children to put their dirty clothes in the hamper and put them away when clean. OP and her husband are going to wake up one morning and wonder why their children are no contact. OP is definitely YTA.", "Honestly, with people really not needing to sort laundry anymore, and Tide Pods being less difficult to handle than a heavy box or bottle of detergent, getting the laundry started is pretty easy. Kids can do that.  Though folding should perhaps be done by adults.", "How much to you want to bet OP doesn't even do his own laundry ?", "NTA  The 7 year old is not down by the river beating his clothes against rocks.  He's putting his tiny clothes in machines and pushing a button.", "What day of the week is he expected to sweep the cinders from the hearth I wonder?", "Yes!! Exactly what I was going to say.  I’m all for children doing chores, and “helping” out, but this is NOT that. \n\nMy 24 year old daughter still lives at home and I do her washing, she ensures it’s ready to be washed, and puts it out to dry. But I do the actual washing.", "Right? Can a 7yrld even reach the buttons on the washing machine? YTA", "No, the 9 month old is HERS!! So poor “Cinderella” will be doing it all.", "Laundry is an extremely simple and easy task. That isn't the problem here. The problem is she didn't allow the child to spend time with his real mother.", "Thank you for taking the time to write out such a thoughtful response. This is a really helpful way of looking at it.", "This was my husband's call. I did not make the final choice but I supported his decision. (I let my husband call all the shots when it comes to decisions about bio Mom but we do obviously talk about it.) \n\nMom took off for two years just after his first birthday so he does not ever remember having an \"intact\" family with her.  I am posting on Reddit because it's a hard situation to navigate and I am looking for outside opinions, not \"stirring up drama.\"", "This 💯", "We help him load the washer/dryer and all of that. Then it's his responsibility to take the clothes out of the dryer and put them away. He has to fold his pants and hang up the shirts (we have a low bar in his closet that he can easily reach). Every second or third time he puts his clothes away we will help him just to make sure things are staying organized.", "But if they didn’t do those chores would you keep your child from their other parent? Especially if they haven’t had consistent communication for 6 months? So who knows when they’ll decide when it’s worth talking to their kid? It could be up to a month before they talk to them again. Would you choose to take away that moment for your child to have with their bio parent knowing it may be weeks and weeks before that parent decides to talk to them again?", "Teens are 100% capable of doing their own laundry lol . If your teens aren't doing their laundry you're setting them up for failure when they move out and don't know how to do the most basic of tasks", "We have tried getting them on a two day a week call schedule loads of times and when we have it set up that way we treat it like sports (he gets to do it no matter what) but it's been about six months since she's actually contacted him with any kind of regularity. It usually happens regularly for two or three weeks and then she starts skipping calls again. We stopped trying to encourage it because of how often shed cancel at the last minute. It was really disappointing to him. So now we kind of just try and go with the flow.", "He’s… Seven…", "Please never have children", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "At 7 I was responsible for everyone's laundry getting washed/folded/put away. By eight, it was my job to clean the house on the weekends while my dad/brother did the yard work.", "The most my 7yo nephew does as far as it comes to laundry is putting his clothes in the basket. As if a 7yo would have enough clothes to fill a machine after 1 week. I'm 31, and I do 2 machines every 2/3 weeks because that's the time I need to have enough white and colour clothes as I wash them separately. But my clothes are bigger and takes more place, even with day clothes and sport clothes", "The fact that some other kids that age don’t have chores and do get a constant stream of treats doesn’t make it good. \n\nThese chores are age-appropriate and he does need to learn time management skills and to take what responsibility for himself he can. The only problem is that his mother is only willing to spend time with him if it’s a fun treat.", "omg based an aita parent taking advice and becoming better??? i saw an op response and was fully expecting you to push back (since that happens so often on this sub) and im so glad to see you didn’t!!", "You keep emphasizing how they don’t talk during watching the movie but I love watching a movie with mom as a bonding time. We are silenced but there, together and I love that feeling. Ofc we discuss it later but when I was young I would make my mom watch cartoons with me too so I don’t understand why you’re obsessed over talking during a movie.\n\nI also think that a lot of work for a 7 year old from the sound of it. \n\nAlso, you say she’s not in contact regularly so why steal these little moments with his mom? He already doesn’t have her in his life much. \n\nSo YTA", "It also sounds like you’re being inconsistent with the timing. It’s Tuesday, which is why you’re saying he has to finish his laundry (Monday’s task) first. But then Wednesday (tomorrow) is suggested and your husband says he’d have to clean his room first on Wednesday, not by end of day. That sounds obstructive, or at minimum not clear and consistent.", "Gonna be nosey here, but why are you the one asking here?  This sounds like the kind of thing his father should be deciding, with your input maybe behind the scenes.  And with the mom if that's possible (I know it's not always the case)\n\nIt does sound like you're a loving step-parent who truly wants what's best for the boy; I'm glad he has so many people in his life who care for him.", "Wait talk on the phone is a reasonable compromise? A biological parent should be able to talk to their child any time they damn well please.", "I am glad you're taking this well thought-out response seriously and using it to reflect a little.", "I completely agree some flexibility — time with his mom — was offered, but also agree any time with Mom is one place you should bend rules. I’m going to say NTA, though. It’s so hard to be consistent and flexible. These goals are in direct opposition! You sound like a good parent.", "Dude, no matter how old I would be, I'd tell to eff off. You want your laundry done, do it yourself. That's not on the kid to do your laundry.", "That seems reasonable for a kid, especially since it's one load of laundry a week.", "I can definitely see where you're coming from, I'm just not too sold on saying no to his mom for avoiding his chores. Maybe if he was older?", "aw you seem like a good parent. keep up the good work 🫡", "Doesn’t matter it’s quality time with a parent he doesn’t live with and you are denying it YTA it’s fucking laundry and he’s 7 y’all need to chill out a little bit", "We all know there's more to laundry than that. Helping with the laundry is great, being responsible for doing it alone and not allowed out of their room until done is not.", "My kids help with their laundry. It’s a great life skill, and it’s plenty age appropriate. What can possibly be wrong with hanging and folding clothes? Putting detergent in and pressing buttons? Throwing some dryer sheets and cleaning a lint trap? It’s unreal that anyone thinks this is wrong. That and tidying his room is great. He’s doing chores that directly relate to his impact in the household.", "Probably every day.  It's the poor kid's last duty of the day before trudging up 5 flights of steps to the cold, wet attic to sleep for a couple hours under a thin blanket on the floor.", "Just from the hearth? I’m surprised he’s not up the chimney", "Serious wicked step-mother/father vibes here. With something like laundry Kids that young should be helping the grownups rather than the other way around.\n\nAlso, parents attributing him not doing his chores to “stalling” is unfair for a kid that age. If you set a task for a kid and they’re not doing it you should figure out why and help them so they can succeed rather than punish them until they do it. Sometimes kids need help getting started on things. Maybe you should break down “clean your room” into smaller jobs and use a chart with stickers or something.", ">My 24 year old daughter still lives at home and I do her washing\n\nThis is absurd from the other direction", "Also it doesn't take much scrolling on your posts to instantly see your holdings a resentment for this kid. Every post about your baby is all \":() oh muh goodness the most precious angel of all time has been born to me\" and then every post about you step son is an am I the asshole about a different way your trying to punish him. Punished for holding the baby, punished for being up before 7:30, do your laundry or I'll punish you and keep you from your mother. Let's get real here girl.", "Your trying to stir up drama and resentments by using his time with his mother as some privilege to be taken away. I guess technically you are not \"trying\" since theother has already called you hurt and upset about the way you are treating her son so the dramas already created at this point. You can try to backtrack and say it's all the husbands idea now but it's pretty clear that isn't the case otherwise you would need to even make this post in the first place. You \"supported his decision\" did you? I bet you did support his decision to alienate his ex wife and son and make you the main  priority I'm sure it sat real pretty with ya.", "I get what you're saying here and it makes sense. He is leaving Thursday afternoon to see her for the holiday weekend so part of our thought was that we wanted him to finish his chores before he goes away for a few days (and we are having people over Thursday so we do want his stuff done before people get here.) I'm not sure if that changes anything but just some extra info.", "Sadly that is the reality you see happening more and more. People showing up to college and not knowing the most basic of things - can't do a load of laundry, don't understand how to clean different areas (and not to mix chemicals!), can't figure out how to boil some pasta, and so on. \n\nMy parents made sure I had those skills and when I moved out I was far better prepared than my peers. I was never afraid to cook, I managed to keep things fairly clean, and I sure as hell knew how to do laundry (though I am stubborn and didn't buy a dresser so I hang most things which means less pesky folding).", "Oh, they can do, I showed them, but since I'm a SAHM I do most of the housework.\n\nWe wash our laundry together and sometimes I ask if they could put stuff in the washer or dryer, but they don't do it on a regular basis.", "So you know that time with his bio mom is not a guarantee and that any communication with bio mom is precious to him, but you take away a moment from him that is important bonding time (for HIM I could give a rats ass about bio mom in this situation) with his bio mom because what? A chore? I can understand wanting to teach him to appreciate chores as a given part of life, but this was not the moment to choose to reinforce this lesson. All this taught him is that if he doesn’t do whatever you want you’ll take away things that are essential for him. In his mind this may have given him the impression that “maybe mom didn’t actually flake on me maybe I was bad and they told my mom not to call” which may seem illogical to you as an adult but he’s seven, a seven year old who misses his bio mom.  When you miss someone so sorely the mind can jump to extremes so easily, especially for a child. This may have not seem like a delicate moment for a life lesson to you but it was for him. And he may have learned the wrong one… YTA", "Thanks.  I read that.  We don't know exactly what OP means by \"doing laundry\" or cleaning his room, but the details of the chores are not important.  These are things that he is already capable of doing and has done before. \n\nThe question is whether it is OK to insist that the child do his chores before doing \"fun things.\" And that is absolutely good parenting.", "I have no plans to but that was extreme to say", "Damn so because your parents treated you like that your going to treat your kids the same way", "That’s a reasonable workload for someone in 1st grade lol", "Thank you! My husband doesn't have Reddit. He knows I sometimes come on here to ask for people's opinions when we aren't sure if we are on the right track. We appreciate getting a wide range of opinions because we both come from very strict families and we know we don't want to be like our parents, but we also know that with us both coming from similar backgrounds we have a hard time knowing where to set the bar. On the other hand, his ex came from a super relaxed family (when they got together when she was 19 she didn't know how to do her own laundry and had never been grocery shopping on her own.) So we're just...trying to find the balance? \n\nHe does the communicating with bio Mom but obviously we talk about it. I've been in his life since step son was 3, so we have definitely been raising him together at this point. But Dad does always get the final say.", "Where did you see that we have him do all the laundry? He doesn't do our laundry. Just his own.", "I definitely get what you're saying. We thought talking on the phone with her was a good compromise. When they watch a movie they don't really talk. She just has the same movie on her screen as we do on ours, so in our reasoning we thought we were prioritizing them having a conversation over screen time. But you're right. If she's not willing to talk on the phone it's better for him to get some interaction than none.", "Watching a movie while someone in a different location is also watching the movie, and not even speaking during the movie, is not quality time.", "How is a child unable to place light items into a box and push a button, then move them to a different box and push a different button, then put them on hangers or in drawers? None of this is difficult in the slightest. There is no reason to believe he’s struggling with the actual work. He’s just procrastinating and acting like a child, which is fine, not a sign he’s overworked.", "Right?  Within this specific time period or you can't watch a movie with your mother.  If this kid doesn't hate her already it won't be long.", "How is it? Her clothes get washed with mine and my husbands. You think I should make her do all of our washing?", "Thank you for this comment. I don't resent him, but you're definitely right that there's a divide in my posts and having that reflected back is really helpful. Honestly, since I have had the baby, I have been questioning our parenting tactics a lot more than I did before. I have always been more of an intellectual/analytical thinker than an emotional one and the baby HAS really opened up that emotional side of me. Seeing it spelled out the way you did is really eye opening. So thank you.", "Listen I don’t think you’re a bad person or even a bad parent/ step parent I just think you’re a parent who got it wrong this time. That’s normal, we all do from time to time this seems like a complicated situation to navigate as a parent but it helps to try and remember that no matter how hard it is for you and your partner it’s 2x-3x as hard for the child in the situation especially since there are other children in the mix. The other child in the home get a lot of thing that he never will again, things like two bio parent that are readily accessible to him, a single household with a single set of rules, etc. Personally I think that not only are your chores but the rule around them are perfectly reasonable and if this had been about barring time with a friend IMO there would be nothing to disagree with. But this is about his mom who from what it sounds like puts this kid through a lot of disappointment, but he’s 7 and he loves his bio mom. Coming between that as a step parent (no matter how much of a “actual parent” you are in Comparison to bio mom are to him) it’s only going to hurt your relationship with him in the end.", "Agreed! We literally just had a young university student move into our building and they destroyed one of the washing machines because they didn't know it worked... I was definitely doing my own laundry and was in charge of cleaning up my own room in high school (amongst other chores). It's mind boggling to me that some parents think their teens are incapable of doing the bare minimum. They're coddling and doing them a disservice.", "Sorry if this sounds harsh but you are doing them zero favours by not instilling responsibility and routine when it comes to doing their own chores. They will be at a disadvantage if they move out and haven't gotten used to doing those basic tasks. You showing them how to do it one time and then continuing to physically do it for them means they won't have that innate instinct of \"O I need to do my laundry\". All they have right now is \"mommy does my laundry.\" Which will never help them when they leave your home...", "The details and extent of the chores *are* 150% important. Children are capable of working in coal mines or even serving tables at a restaurant. But there’s a reason we don’t allow *either* anymore. A child should be a child - not a laborer. Having a 7yo fold their own laundry or put away their toys is totally fine, but this rigidity is absurd.", "Thank god", "Seriously? I asked his mom, she said she washes all family clothes together so she doesn't know the exact proportion, but the 7yo clothes after being folded doesn't take that much place so she is not sure.", "Would it be such a big deal to let him spend time with his mother? This seems very petty to keep him from spending time with his mother. The chores will be there and spending time with his mother is more important. This seems time sensitive.", "He is 7 no laundry is more important than time with his parents", "He's fucking 7 !?! Are you going to ask him to make himself dinner next ? \n\nCleaning his room is age appropriate chores, but he's still a kid. Why do you want him to grow up so fast and act like a fucking adult ?", "I don't think he's too young to do his own laundry, but as the designated laundry-doer in my house, I have to ask... Is this efficient? I feel like if we implemented this in our house, the laundry would just take longer to get done over washing everyone's stuff together.", "NTA when you're a parent you have to learn how to be a parent it's not perfect all the time but as long as you try your best and ask for help or advice you're still a good parent\n\nGood luck and don't fuck it up", "It is when you’re 7 and it’s your Mom.", "Unfortunately though, it’s all she’s willing to provide. They can’t make his mom actually parent.", "If everyone's clothes are washed together, I'd expect her to help with laundry or do her share of other household chores. Maybe she does? But you didn't mention it.", "She could do her own clothes. Or do the whole family’s, who cares? Laundry is not hard.", "For all we know, that is all OP is requiring.  Whatever it is, \"doesn't take long\" two days a week.  So I'm guessing less than 4 hours, maybe less than 2 hours a week.\n\nThe general guidelines would be for a 12yo to be able to \"do laundry\" in the sense of doing it for the whole household and ruining clothes.  Just guessing, but I'd say if the kid is doing \"his laundry\" then it's all his and nothing can really get ruined.  Putting it in the washer takes 2 minutes.  2 minutes to move it into the dryer.  So that's an extra 4 minutes of work compared to what is \"acceptable\" at 6-10, which is \"folding and putting away their own laundry.\" \n\nPerhaps the problem here is my age.  I'm 60 and I was doing chores when I was 6, and yes I labored on a farm, if doing a few hours of weeding the garden a week counts as being a laborer.  Still had plenty of time to be a kid, just like this one.", "No I mean I’m on your side! Folding/putting away his own clothes is no biggie imo", "Then he can talk with his mom while he does laundry, and still get time with her. Even better in fact, since they'd actually be talking instead of silently watching a movie. The kid is not being denied time with his mother.", "If you bothered to read what I typed you’d see that she actually does the hardest/longest part.", "To level with you, I’m in my 20s and raised livestock in my adolescence. I had my share of chores too. However, I wasn’t under an extremely rigid schedule to do these things and wasn’t scrutinized for not doing it exactly when my step-mother told me to do so. I especially wasn’t *kept from my own mother* when not having fulfilled my obligations. I guess it’s not necessarily about the labor but rather being forced to do the labor under a step-mother’s “whenever I say so” basis. It’s unnecessarily controlling behavior that will only bite the stepmom in the ass in her old age when the child grows to resent her.", "Or he can do his laundry after he talks to his mom he’s 7 years old he should not be expected to multitask like that", "Livestock and pets definitely need to be fed and cared for on a schedule.  You don't just feed the chickens twice on Tuesday because you didn't feel like doing it on Monday.\n\nI don't think it's fair to say the child is being kept from their mother.  OP agreed to let mom talk to the child, but that wasn't good enough for the mom.  What she didn't agree to was allowing the child to watch a movie before the chores were done. \n\nI agree OP is more strict than average--and maybe too strict.  And I agree with your prognosis.   But I don't think it falls into AH category.  The amount of chores is not excessive, and every kid is different when it comes to procrastination vs. motivation."]}