{"id": 31472, "submission_id": "18113hi", "title": "AITA for refusing to change my wedding rules for my cousin", "selftext": "I (23 M) and my fiancé (24 M) will be getting married in February. Our wedding will be child free for many reasons, but the biggest is liability. I don’t want any children getting into anything or getting hurt at all. No execptions.\n\nWe have provided paid for Childcare options for those attending who have children, a few different options varying on comfort. Almost everyone agreed to it except my cousin, (Anna, 21F) who has a 3 year old daughter. She said she will not be comfortable having her daughter be watched by strangers and would like for us to allow her in the wedding instead. I told her no, and that if she prefers she can have her daughter watched by someone she trusts but she will not be in our wedding. No children will be. She got angry at me and called me an AH for not making an exception for her, my cousin. My family is torn, half think i’m an AH and others do not think i am an AH. So reddit, AITA?", "created_utc": 1700628479, "permalink": "/r/AmItheAsshole/comments/18113hi/aita_for_refusing_to_change_my_wedding_rules_for/", "score": 26, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > the action i took was not allowing my cousins child in my wedding and not allowing her in my wedding is what may make me the AH\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "This is a major major NTA moment. You told--explicitly--that you will not be making exceptions and firmly stated the rule and the alternatives.", "NTA\n\nThe other option is for both your cousin and her daughter to stay home.", "NTA\n You were gracious enough to arrange a babysitting service for the kids, and it is unreasonable for your cousin to expect a special treatment because of her fears. If she is not happy about it she can simply decline the invitation", "NTA\nNot sure why your cousin, or anyone, would ask for an exception... Especially when you went extra and paid for child care. You're amazing for being so considerate and paying for child care. Your cousin's expectations are trash. Congrats & good luck!", "Absolutely NTA. It’s your day and you should have everything you want. And kids freakin suck sometimes.", "Easy NTA\n\nIt is not your cousin's wedding. Her options are to accept the invitation, or to decline. That's it. \n\nOnce it's put out as a CF event, I have no sympathy for anyone asking for exceptions. Invitations are a yes or no response.", "NTA. Your wedding, your rules. The cousin always has the choice of not attending. She really sounds entitled.", "NTA. The only kids that should be at a childfree wedding are the children of the people getting married. It’s not even your sister asking but your cousin? AND you were gracious enough to arrange childcare? AND she got had the audacity to pushback when you politely said no? C’mon.", "A hard NTA!\n\nYour entire wedding guest list likely includes nothing but family and friends, so what relevance is it that she is your cousin?\n\nIf she is so adamant not to trust others to look after her child, then she can be the devoted parent and not attend your wedding!\n\nTo those who think you an AH, ask them what to do when everyone else with a child makes the same demand!\n\nYour wedding, your rules.\n\nPeople either respect you or they don\"t!", "NTA -- The child is 3 years old, not 3 weeks.   If your cousin doesn't want to be separated from her, she can stay home.", "Nta", "NTA!", "NTA - and if you bend the rules for your cousin it will piss off every other parent", "Nta", "Nta your wedding your rules of she doesn't like it she's free to not attend", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (23 M) and my fiancé (24 M) will be getting married in February. Our wedding will be child free for many reasons, but the biggest is liability. I don’t want any children getting into anything or getting hurt at all. No execptions.\n\nWe have provided paid for Childcare options for those attending who have children, a few different options varying on comfort. Almost everyone agreed to it except my cousin, (Anna, 21F) who has a 3 year old daughter. She said she will not be comfortable having her daughter be watched by strangers and would like for us to allow her in the wedding instead. I told her no, and that if she prefers she can have her daughter watched by someone she trusts but she will not be in our wedding. No children will be. She got angry at me and called me an AH for not making an exception for her, my cousin. My family is torn, half think i’m an AH and others do not think i am an AH. So reddit, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Mum of four here - you offered a very kind and generous solution to the no kids rule for your wedding which is more than I’d expect if I was invited somewhere child free - in Australia if you’re invited to a kid free wedding usually it’s on you to find alternate care for your kids. The solution is simple - either your cousin sucks it up and enjoys a kid free night or she misses your wedding but in no way does that make you the AH. Your wedding your rules!", "INFO: is your cousin a single mom?", "NTA", "NTA. They should stay home if the options you presented aren't suitable.", "NTA. If your cousin is uncomfortable with the childcare options you are providing, she is free to make other arrangements.", "Honestly what is it with all the child free wedding drama. In my culture the parents are overjoyed to get a day away from the kids. Generally the only children at the wedding are the page boys/flower girls and they are gone by 9pm", "NTA.\n\nNo kids is no kids, no exception.  If she's that concerned then she can not come to the wedding.  End of story.", ">gracious enough to arrange a babysitting\n\nThat part alone is pretty amazing. Not everyone would offer that.", "This…"]}