{"id": 3148, "submission_id": "z3tfrh", "title": "AITA for feeling entitled to food I did not technically pay for?", "selftext": "I (34M) recently went to a get-together with some friends of mine. I get along with most everyone within the group outside of one person, we will call him Mike. Mike is someone who I feel is selfish and can be a bully, and I feel it has gotten worse recently. However, we have all been friends since high school so I put up with it.   \n\nWell Mike decides he wants to have everyone over to play some Settlers of Catan. We used to get together a lot more to play board games or smash bros or what not, but as we all have gotten older that has obviously happened less and less. Fortunately everyone's schedules lined up and we were able to plan this.   \n\nNow it is important for me to insert here that recently I had been off work for a month. It was of no fault of my own, and fortunately I am back to work now. Bc of that though, money is really tight for me right now. My friends all knew this.  \n\nWe all go to Mike's to hang out and it was a great night. We end up staying longer than expected and people get hungry. Some people decide they want to order pizza. They ask if I want to throw in some money for pizza and I say \"no, gotta watch what I spend for a bit.\" Obviously I wanted some and could probably afford it but I was trying to be responsible. Another friend of mine (we'll call him jake) offered to put in for me but I tell him no, I will be ok. Maybe this is where I messed up.  \n\nAnyways, right as they are about to order, I remember that I have a coupon for the place they are ordering from. It had been my birthday a week prior and received it as a gift or something. I let them know I have it and that they can use it. It added on a medium 1 topping for free. They are excited for it and accept it. I guess its important to note that I just offered it willingly, not as a trade or bargain.  \n\nThe pizza arrives and everyone digs in. I ask everyone if its cool if I have some of the medium pizza. At first Jake and a couple others say yes but then Mike says \"You didnt put any money in. Why are you asking for pizza?\" I explained that this pizza wouldnt even be here if not for me but he says that it also wouldnt be here without him bc everyone else paid for the other pizza. Jake offered to throw in a few bucks for me again but Mike said its bullshit that I tried to pull this. It really put a damper on the night. I ended up leaving without having any.  \nMike sent messages in the group chat about how I tried to pull a fast one on everyone. Most everyone is trying to stay out of it outside of Jake who is still sticking by me. I understand that I didnt put money in, but I cant help but feel like he is making way to big a deal about this.  \n\nSo, I come to you all, AITA?\n\nEdit: added some spaces\n\nEdit 2: There appears to be some misunderstanding, but the coupon was spend $20, get a 1 topping pizza for free. Not that I just add on 1 topping to an existing pizza. An entirely new pizza was added", "created_utc": 1669320672, "permalink": "/r/AmItheAsshole/comments/z3tfrh/aita_for_feeling_entitled_to_food_i_did_not/", "score": 400, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I tried to eat pizza that I did not actually put money in for. Some might see that as me trying to mooch off of other people\n\n**[Check out our upcoming Reddit Talk with Iliza Shlesinger on Nov. 28th!](https://redd.it/z29rfu)** \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nThe rest of your friends were fine w it, Mike decided that his opinion was more important than every else's AND more important than feeding you. Def AH.\n\nThe coupon made there be a free pizza, more than there would have been. You now no longer have said coupon you could have conceivably used with other, less AH people.\n\nHonestly Mike sounds like a shitty friend period. Especially with him making into a larger thing by texting about it later. I'd write him off and make plans without him.\n\nTbh, he seems like the kind of guy to expect sex if he bought a woman a drink. Who goes through life thinking their friends are trying to \"pull a fast one\" to get a few slices of 'za? Dude seems exhausting af", "Info:\n\nOP please edit your post to clarify if your coupon helped the group to get a 2nd one topping pizza, medium sized. \n\nOr if it was one topping for the medium sized pizza, the others ordered!", "Mike is a complete AH.", "NTA. You DID contribute. Your coupon got them an entire extra pizza.", "NTA\n\nYour coupon added on a pizza which you were entitled to. Mike sounds like a bully who was trying to kick you knowing you were vulnerable.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (34M) recently went to a get-together with some friends of mine. I get along with most everyone within the group outside of one person, we will call him Mike. Mike is someone who I feel is selfish and can be a bully, and I feel it has gotten worse recently. However, we have all been friends since high school so I put up with it.   \nWell Mike decides he wants to have everyone over to play some Settlers of Catan. We used to get together a lot more to play board games or smash bros or what not, but as we all have gotten older that has obviously happened less and less. Fortunately everyone's schedules lined up and we were able to plan this.   \nNow it is important for me to insert here that recently I had been off work for a month. It was of no fault of my own, and fortunately I am back to work now. Bc of that though, money is really tight for me right now. My friends all knew this.  \nWe all go to Mike's to hang out and it was a great night. We end up staying longer than expected and people get hungry. Some people decide they want to order pizza. They ask if I want to throw in some money for pizza and I say \"no, gotta watch what I spend for a bit.\" Obviously I wanted some and could probably afford it but I was trying to be responsible. Another friend of mine (we'll call him jake) offered to put in for me but I tell him no, I will be ok. Maybe this is where I messed up.  \nAnyways, right as they are about to order, I remember that I have a coupon for the place they are ordering from. It had been my birthday a week prior and received it as a gift or something. I let them know I have it and that they can use it. It added on a medium 1 topping for free. They are excited for it and accept it. I guess its important to note that I just offered it willingly, not as a trade or bargain.  \nThe pizza arrives and everyone digs in. I ask everyone if its cool if I have some of the medium pizza. At first Jake and a couple others say yes but then Mike says \"You didnt put any money in. Why are you asking for pizza?\" I explained that this pizza wouldnt even be here if not for me but he says that it also wouldnt be here without him bc everyone else paid for the other pizza. Jake offered to throw in a few bucks for me again but Mike said its bullshit that I tried to pull this. It really put a damper on the night. I ended up leaving without having any.  \nMike sent messages in the group chat about how I tried to pull a fast one on everyone. Most everyone is trying to stay out of it outside of Jake who is still sticking by me. I understand that I didnt put money in, but I cant help but feel like he making way to big a deal about this.  \nSo, I come to you all, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA because the coupon you contributed added a whole pizza. Even if you hadn’t contributed it would have been a dick move to let my friend who couldn’t afford to contribute to a communal pizza go hungry. It’s hard to accept help when offered, I understand. But the free pizza should have canceled out any qualms from Mike who is obviously a jerk.", "NTA you didn’t assume and take pizza, you asked for a slice of the pizza your coupon provided. My friend group would have looked at you like an alien and go “duh we aren’t just going to eat in front of you” so long as this wasn’t a *constant* thing. Mike doesn’t sound like a great friend.", "NTA These are your friends and Mike is a dick. People who don’t share or will call YTA are tight fisted, mean spirited people who have obvious issues sharing. Pizza amongst friends should always be free if someone can’t pay.", "NTA. Mike doesn't like you though. I have ordered extra food for my friends when they were struggling and they did the same for me. That's what friends are for.", "NTA \nBut the resentment you two carry for each other must be freezing the air every time you two end up in the same room.", "I, personally, have never in my life seen a coupon for a free topping. It just sounds ridiculous. \n\nI have, however, seen coupons for a free medium one topping pizza with purchase/on orders of $XX or more. I think people need to work on critical thinking skills, because to me it's obvious that you meant \"free medium one topping PIZZA\" and not a free topping.\n\nNTA. Regardless of if you put money in or not, what kind of shitty friends don't share food with someone? Jake is a great friend. Fuck Mike, what a AH.", "NTA\n\nThey got a whole pizza for free. Mike is def being an A about this.\n\nYou prob should have cleared up - hey if you use this coupon, can that be my share? But .... that's overly technical for who are supposed to be good friends. \n\nAnyhow Mike sucks.", "NTA", "Gonna pile on Mike here. He's a huge AH. NTA.", "NTA, and I would have just taken the slice. Fuck mike.", "NTA - you essentially paid your way in with the coupon that provided everyone with an extra pizza to share. Mike is an AH.", "NTA", "NTA. Mike is simply 100% AH. better not to associate yourself with this kind of toxic peer. not worth it.", "ESH. Except Jake. \n\nIt's true that without your coupon, the extra pizza wouldn't exist. But it's also true that without their $20 your coupon was worthless. \n\nIn my experience general social etiquette is that when someone has a coupon for the benefit of the group (that was free), then it's for the group and one person doesn't just take advantage of it. \n\nI think you should have had some pizza. But I think you were also super cheap.", "NTA but you said you 'obviously wanted some' so I feel compared to add: If you had some without paying you'd be TA but Coupon was your payment in this case.", "NTA.\n\nThey are your friends, or supposed to be, why are they so selfish and cruel? You contributed, in fact, even if they think otherwise.\n\nAlso, I think a friend should also be given some pizza if he hadn‘t paid, at least I would still share it.", "Mike can take his portion and shove it up his ass to save for the next game night if he’s gonna be so stingy NTA", "[deleted]", "NTA. Mike is though.", "NTA obviously. You provided a whole additional pizza, money or no. If I was in your friend group, I would have considered that the same as chipping in cash for the whole order.\n\nAlso, how are so many commenters confused about the coupon? Has there ever been a coupon for “1 free topping” added to a pizza? Like, come on.", "NTA\n\nThat coupon does have a value in the form of extra pizza. It should have bought you a couple of pieces of the pizza.Yes, you wouldn't have that 1 topping medium pizza without their contribution. However, they also wouldn't have a 1 topping medium pizza without your coupon and now you no longer have that coupon on your possession. Anybody with a half a brain would recognize that you offering a coupon for an entire extra medium pizza was your contribution and payment for a couple slices of pizza. Mike is a massive cheap asshole and your friends should be reconsidering whether they want to hang out with him. You made it clear that you didn't have any money in the budget to chip in and it's a pizza FFS. Normally, when I host a party at my house, I ask what kind of pizzas everyone likes and just order it. I dont expect or ask anyone to chip in because I'm the one hosting it.", "Seriously, a group of 30-something dudes is arguing over pizza?\nStart hanging out with people you actually like, not just the ones you know for a long time.\n\nESH", "Esh. If your coupon was for a free pizza then you should have been able to have a slice if it, but this entire argument seems stupid. It's a pizza  and a couple of bucks. Not a private island", "YTA- youre proud because they got an extra topping but they still paid for the pizza", "~~YTA.~~\n\n~~Offering a coupon that add one extra topping isn’t the same as paying for your share. It doesn’t cover the delivery fee, tip and tax.~~\n\n~~You refused to pay and refused someone’s offer to pay for you and yet expected a piece of pizza once it got there~~\n\nEdit: we’re gonna need clarification on whether this is a free topping or a free pizza coupon.\n\nEdit:\n\nFree pizza coupon. NTA.", "NTA but OP you need to update and clarify the coupon. People are way too confused over if it's 1 extra topping or a 1 topping pizza and to most of these people that's going to be the decision maker. I'm assuming it's the latter cause I'm American and know how we talk 😆", "NTA even if you didn't provide a coupon, honestly. What kind of friend sees another friend struggling and puts them down about it? Also, you paid for that medium pizza with a coupon, it was your contribution.", "NTA. Technically you paid for the free medium by offering the coupon that you could have saved and earned it for yourself. Mike is the AH here, and you had every right to grab a few slices. You don't ice someone out the one time they can't pay for a meal. You cover then and next time you get covered. You don't have a good set of fiends at all. Mine would have shut that shit down and given you an equal potion from all the food ordered.", "NTA. They had an entire free pizza because of you and your friend was willing to add in more money on your behalf if that really was the issue. There should've been no issue and Mike was just being an AH.", "Pizza, it brings out the best and worst in all of us... it's everywhere!", "NTA - you added a pizza to the deal with your coupon. Mike is an asshole trouble starter. Stay clear of him. Some people.", "Bloody hell it was a slice of coupon pizza! How petty are some people smh. NTA", "NTA. You contributed a whole Pizza. You should have just eaten it like everyone else.", "Wow, NTA your coupon 'bought' that pizza; you contributed. But the guy has issues, who tries to deny a friend food and humiliate them? Absolute dick.", "YTA, you didn't pay any money, and your pride made you refuse jake's offer. You don't get any pizza.", "YTA, good on the other dude for calling you out for being a mooch.", "NTA. You chipped in the coupon and that should've been enough. Mike is a jerk, so try not to let his comments get under your skin.", "Esh. \"Obviously I could afford it and wanted some...\"\n\nThen why didn't you pay up and avoid this whole thing? You were being \"responsible?\" Mike's an AH too, but I'd say this was written by Alan Harper.", "NTA.  It was a free pizza!", "YTA. You tried a fast one and it blew up. Yeah you wanted pizza but didn't want to put in for it. Social etiquette should have told the group you get a slice and that's the end of it. But you were given an out several times and rejected it each time.", "INFO: Did the coupon add a medium 1 topping pizza or did it add one topping to a pizza being purchased?", "NTA but I've never seen grown ass men fighting over a slice of pizza.", "INFO: do you regularly not pay for food and then once they get the food ask for some of it?", "NTA you contributed in the form of a coupon and so deserved some pizza", "NTA,  that medium pizza was yours.", "NTA, technically there was a whole pizza that was only there because of your coupon: your coupon for a free pizza, your pizza. By Mike’s logic, no one should’ve eaten that pizza except you. If he’s a bully though, maybe try calling out his bad behaviour when it’s not directed to you. Someone else might need the back up you needed in this situation.", "INFO:  \n\n> I explained that this pizza wouldnt even be here if not for me\n\nI don't understand.  I thought the coupon was for one extra free toping.", "So he took your coupon for a free pizza, didn't let you have sny pizza, then messaged everybody some abuse about you.  Mike is very clearly the AH.  Not you.  NTA.", "YTA. Come on man, you know the answer. What are you even asking?", "It was for a free medium one-topping pizza when you ordered.", ">I, personally, have never in my life seen a coupon for a free topping. It just sounds ridiculous. \n\nThank you, it was driving me crazy. Why are people so confused? Who has seen this kind of a coupon? And why would that be a good marketing technique by any establishment?\n\n\nI mean i got confused by OP originally as well, but in my mind i knew it couldn't be just one extra topping...", "Just say 1 free pizza. Why mention the topping at all, it just makes it confusing.", "It was a coupon for a feee one topping medium pizza. How are this many people confused 💀", "Pizza topping, not a pizza.", "I do understand it's petty. It was mostly a culmination of the animosity between Mike and I", "It was petty on Mike's part, he went out of his way to embarass OP. Anyone would be offended if they were in OP's shoes.", "Dude they got a whole extra pizza. Reread.", "Actually I think they got a free medium one topping with the coupon? Not just an extra topping. In which case then nta..", "They didn’t get an extra topping they got a whole free pizza. It would’ve been one pizza without the coupon, instead there was two. He should very well be able to have a slice.", "I also read it like this until I came to the bottom. Op wasn't very carefull about his words writing this", "I think the coupon was for a free medium 1 topping pizza with their order, not a free topping.", "Considering there has never been a coupon in the history of the earth that added “1 free topping” I’m gonna say, no, we do not need clarification on that", "It’s an extra pizza not one extra topping. It’s poorly explained, but mike and op are arguing about a slice from the second pizza that wouldn’t exist if OP had the coupon, but also wouldn’t exist if the others didn’t order one to begin with.", "A free \"medium 1 topping\" as in a free medium 1 topping pizza. Not 1 free medium topping. It was a whole pizza", "It was for a free medium one-topping pizza. They don't generally offer coupons for a free topping.", "This. The phrasing is odd for people who dont speak English as a first language or aren't accustomed to the phrasing Americans use at times. Like pizza being interchangeable with plural or singular.  It is an important detail that will sway people's verdict.", " Mike is the AH here, and you had every right to grab a few slices. You don't ice someone out the one time they can't pay for a meal. You cover then and next time you get covered. You don't have a good set of fiends at all.", "Think you misread what the coupon added, my dude...", "And: Your friends should be ashamed. Why so much greed about food? You are friends, you should share.", "The coupon got them a free topping and not a free pizza?\n\nEdit: It’s a free pizza. My bad.", "Coupon added 1 topping. Didn't add 1 pizza.", "Then why do they get to eat the free pizza he provided?", "So they’re allowed to eat the free pizza he got for them?", "Found “Mike”", "[deleted]", "What do you think the definition of free is?", "If you only get pizza you paid for, then he is within his rights to take the entire free pizza he got with his coupon", "He contributed a coupon for an entire medium pizza that wouldn’t have otherwise been there.", "It added a free one topping pizza to a purchase over $20", "No it was for a whole one topping medium pizza", "Because of OP, they got an entire \"extra\" pizza. He must be shared some", "No, for a second pizza with one topping in a medium size. Mike argues the **other** pizza wouldn’t exist, if they didn’t order a pizza in the first place. Therefore Mike thinks OP doesn’t deserve a slice of the coupon pizza.", "Its actually a whole pizza, as OP clarified", "Mike made it petty, you did not. You're good bro.", "There seems to be some disagreement in that regard but I gather there was an extra pizza with one topping due to the coupon.", "A medium pizza with one topping", "Nope that was you bud", "I don't know why this is so confusing to people but OP has clarified it added a free medium pizza. That medium pizza could only have 1 topping.", "It was a free one topping pizza. Domino's hands out a few medium pizza for every six you purchase. It's about the same thing", "OP stated in a comment that it added a one topping pizza to the existing order (over $20). So basically he bought a whole medium pizza with the coupon.\n\nNTA", "No, he asked for some of the medium pizza, as it wouldn't be there without the coupon. Mike said no, because the *other* pizza (and thus the order) wouldn't have been there if it weren't for the ones who paid.", "Please Re-read. There are two pizzas. \n\n\nI ask everyone if its cool if I have some of the medium pizza. At first Jake and a couple others say yes but then Mike says \"You didnt put any money in. Why are you asking for pizza?\" I explained that this pizza wouldnt even be here if not for me but he says that it also wouldnt be here without him bc everyone else paid for the other pizza.\n\n“Everyone else paid for **the other** pizza. \n\nThere are two pizzas!", "No, Coupon added a one-topic, medium-sized pizza. A whole new pizza", "He didn't provide any pizza, just an extra topping on a pizza already bought by someone else.", "Offering a coupon instead of paying your share is being a mooch, plain and simple.  It's a dirt bag move.", "I understood it as medium \"one topping\" pizza, so there was an extra pizza because of the coupon there if I'm not mistaken.", ">It added on a medium 1 topping for free.\n\nNo, it gave them a free medium pizza with one topping on it. So yes, it was a whole pizza on addition to what they ordered.", "No, it gave them a free medium pizza with one topping", "It states that it was an extra pizza with one topping, not an extra topping. \nMike says the extra pizza wouldn’t be there, if everyone else hadn’t bought the other pizza. So there are two pizzas for the prize of one.", "Very salty response.", "Would you add this same logic people who add a buy 1 get 1 coupon and then make the other person pay since they provided the coupon? It's honestly the same in my eyes. Op wouldn't have got this deal had the others not spent a minimum of 20 dollars.", "This man is complaining about you eating a slice of a whole free pizza??\n\nNTA", "That's what I thought. Thanks for clarifying.  NTA. You contributed a whole pizza.", "You were correct", "The coupon added 1 topping to a medium pizza. It did not add a medium pizza for free.", "But Op wrote “the pizza arrived and everyone digs in”.\n\nMultiple pizzas are never mentioned. I figured he wrote medium to show the pizza wasn’t too small to be shared.", "I think you misunderstood what he said, he received a free pizza with 1 topping on it. The coupon did add an entire medium pizza to the complete order, not JUST a topping.", "OP even clarified it was an entire pizza in response to an info reply...", "He contributed a pizza.", "You are incorrect about that. It added a medium 1 topping pizza. There has never, in the history of the earth been a coupon for 1 additional topping. Get real", "Confidently wrong.", "How is that mooching, but them eating a free pizza, that they didn't contribute to not mooching?", "HIS COUPON PAID FOR AN ENTIRE PIZZA", "Contributing a pizza should entitle him to a share even if it was via coupon", "So u never spotted a friend a slice of pizza when down on luck financially.  The group wouldnt have even gotten a 2nd pizza without the coupon. Mike is totally an AH cuz it sounds like OP normally contributes. Hes not mooching on a 1 off instance.", "Coupon gave them a free medium pizza onto the order.", "No. I used to get these all the time as a kid. It's a one topping medium pizza that was added to the order.", "Incorrect. It added a one-topping medium pizza.", "Pizza is often used as a plural.", "It states about the friends having paid for the *other* pizza.", "Yes, they are mentioned. Please read it again before spamming misinformation.", "Because he's trying to offer a free coupon instead of paying his fair share with everyone else.  Dirty freeloader move.", "No it didn't, could he have used the coupon by itself to get a pizza? No.  It relied on the purchase of other food that he refused to participate in.", "You’re right. That’s my bad.", "You do know some of us just don’t speak English as a first language and get confused right?\n\nAsking questions and spamming misinformation is not the same.", "They ended up with an entire pizza that they wouldn't have without him - and! He didnt ask for a piece of pizza from the pizza they bought but from the one his coupon got, so if anything they benefited from him..... Did any of them provide the money for an entire pizza?", "You seem like a really kind human.", "But his coupon added a whole extra pizza. OP added value and wasn't saying he wanted the whole damn pizza, he asked if it was cool if he snagged a couple of slices from the medium pizza he paid for with his coupon", "It was still an additional pizza beyond the one being purchased that they wouldn't have had otherwise.", "No worries :)", "Repeatedly commenting the same question on multiple threads is spammy. And if you're confused, why would you be bothered by my suggestion to read it again for clarification?", "Who cares?  The issue is he doesn't want to be a team player and he got called out for it.", "I asked the topping question once and then replied to someone answering me about it? How is that spamming? I’m asking for a clarification from someone. \n\nI replied because your comment seemed needlessly agressive since I asked that question once.", "Just like not everyone in a football match has to score a goal and someone has to defend their own goal, OP did the same. Yes he didn't contribute in the \"main\" pizza but if it wasn't for him they would not have a \"side\" pizza", "How is his contribution for the extra pizza less valuable than having pitched in cash? The few bucks any individual pitched in wouldn't have on its own enabled them to get pizza so his coupon being dependent on a purchase is moot. If he only partakes of the free pizza he's not denying anyone what they are entitled to for pitching in money.", "He doesn't want to be a team player for wanting a slice of pizza that was gotten from the coupon he gave? He didn't even want the whole thing....\n\nI sure hope your username is just that, and you don't actually manage people...", "Ok, well, that's your interpretation, but there was no hostility behind my initial comment. And multiple people, OP included, have clarified.", "They clarified after I posted that question? So again was I not allowed to ask about it once before it got clarified without you interpreting that as spamming misinformation?", "NTA, if Mike didn't view your coupon as a contribution, he shouldn't have taken your fucking coupon and bought the pizza. He was saying that that was good enough cuz he didn't say at that moment that it wasn't.\n\nIt sounds like Mike is no longer a friend. Y'all have grown apart", "NTA\n\nAs others have said you contributed an entire pizza- they wouldn't have gotten it w/out that coupon.  \n\nBut also - even if you didn't have the coupon - what friend group knows you have been out of work and denies you pizza?  When I taught freshman in college, they knew that.  I had an end of the year thing for them, some brought food, some couldn't contribute - I said no problem, I had some funding- but then others walked a plate right up to people not eating saying no one goes without food in this class if they wanted it.    At 18 they understood you don't keep food from people.", "Nta but honestly get some new friend besides jake bc the fact that y’all make eachother pay for food or they don’t eat is messed up. My friend group we just take turns buying. It’s even more messed up since they know you’re in a tough situation. You did pay for that pizza with your coupon cause with out it there would be no extra pizza.", "NTA for you and Jake, but Mike and the friends staying out of it are. Sure you didn’t contribute financially, but because of you there was a medium free pizza they otherwise wouldn’t have had. He called you out to make you feel embarrassed enough to not question it, and your other friends took his side with their silence. Even if you hadn’t given them the coupon, it would have been shitty if they hadn’t offered you a slice knowing your financial situation. Do not feel bad for this, you did nothing wrong outside of maybe not communicating properly with the group, but it also should’ve been obvious without saying it that you were entitled to some pizza with your coupon.", "NTA its a free pizza that yall got because of *your* coupon.  A piece should've been offered to you just because. Mike is definitely the AH, it's not that serious, its a slice of pizza. Was he gonna eat it all?", "Remind them that since it was your coupon that got them another free one topic pizza Mike now owes you a pizza for using your coupon that you didn't get to enjoy otherwise they would have been stuck with whatever quantity they ordered. So Mike didn't pay for that new pizza you did, you earned that coupon on your dime.", "I can’t believe friends would not let you have a slice of pizza - coupon or no coupon. They knew you had had a rough patch financially, why would they turn you away. OP - you need better friends. They are the AHs.", "How does a group of “friends” eat pizza in front of one person who can’t? Even if you didn’t add the coupon they should share. NTA", "NTA at all. I astounds me that Mike made that big of a deal about a few slices of pizza. He sounds like a total wang.", "NTA\n\nYou did contribute!\n\nBut ask yourself if these are friend worth keeping. How can you know your buddy is short on funds and not just let him eat the food? \n\nThere's a different kind of friend that would order extra so you can get some leftovers to carry home!", "Only friend you got is Jake.", "This is the most low class shit I've read in a while. It's food. who gives a shit if someone has a slice. People are so damn tacky.  NTA", "NTA op, you need to understand what's is really happening: Mike is bullying you. \nYou asked if it's okay to grab some of the pizza which is totally okay even if you didn't have a claim on it.\nMost people decided that yes, they are fine with \"paying\" a little do you could have some. \nBut Mike decided that not only it's not okay for you to grab some, it wasn't even ok for you to even ask. And then berrate you for even asking. \nHe is doing that because he doesn't like you, trying to paint as a bad person (to attempt to kick you out of the group?). \nDon't tell for it, he have no more right then you or any other friend in the group.", "NTA. You contributed a whole pizza. It doesn’t matter that your contribution was a coupon rather than cash. Not sure what Mike’s deal was, but that’s ridiculous.", "NTA - Mick is a dick, in hindsight it might have been better to say \"Cash is tight right now but I have a coupon for a whole free pizza, so is everyone cool with that being my contribution?\" Just to make it clear that you intended to have some of it.", "NTA mike sucks", "NTA Mike is FORSURE though", "NTA", "NTA. The coupon was for an entire free pizza that you gave them yes? Mike needs to stop being an ah, or pay for both pizzas. Plus someone offered to chip in a couple bucks anyway for a FREE pizza. Btw, glad you are back at work OP. Don't sweat the small stuff.", "NTA Your coupon enabled the group to get a free pizza with the money they pooled together for their pizzas. Therefore, you are entitled to an equal share of the free pizza that couldn't have been achieved without your coupon. Why should you have given them your coupon without the share of benefitting from the coupon? If you didn't deserve a share, then you could have kept the coupon for another time yourself. No other logic makes sense here. Mike is in the wrong, his logic does not make sense because why give up your coupon to them otherwise?", "NTA. \n\nThis is the time you call out and cut out the AH Mike. Let Mike know he’s an AH, and that you won’t have anything to do with him in the future.", "NTA. Even if you had not contributed to obtaining an entire medium pizza to the stack, you are still a hungry person, let alone friend. Sometimes people are down on their luck, so help out with a slice or 3. Further you were not even asking for the full of the pizza you helped obtain with the coupon, just a couple slices.\n\nAnd then I looked at the post again. You guys were at mikes place? He the HOST squabbles about a GUEST getting food?! \n\nI am not allowed to express my opinion of mike, least my comment gets removed.", "Your friends are incredibly cheap assholes for not defending you. Obviously you’re entitled to some of that pizza. Even if you hadn’t contributed the coupon I’d let you get a slice. Wtf is wrong with your friends. NTA", "NTA\nWho cares who is going to eat free pizza?\nIf you ate the whole by yourselves I wouldn't care. \nI would avoid this guy. And the whole company if they can't support you. They silence is basically supporting the predator.", "Wow Mike is not a friend at all. Forget about the coupon, I couldn't imagine eating in front of a hungry friend, especially knowing he's tight with money, and not giving him some. \n\nNTA.", "bruh even if you didn’t add the coupon Mike would have been the asshole.", "So, your voucher bought a margarita pizza but you ate the meat supreme with 586 meat toppings?? \n\nMy first year at uni I invited people out for pizza to celebrate my birthday.  I had multiple vouchers, so we swapped orders to get the best value . That's what you do🤷‍♀️", "NTA. Mike is a jerk for refusing to share and is making a big deal out of pizza. Plus, it was your coupon that you could have used on yourself to get a separate pizza for free. Mike doesn’t seem to be worth the effort to be friends with.", "NTA, you got them a whole pizza. Mike sounds like he sucks", "NTA. I don’t see how someone can deny food to another person. Is so inhumane", "NTA. Your coupon provided an additional pizza. You were entitled to eat that pizza, and you even were polite enough to ask. I would reply to the friend group stating exactly that - you asked for the pizza that wouldnt have been there without your coupon. \n\nNot to mention, why are your friends allowing Mike to act like this (minus Jake, he seems like a true friend)?", "Mike’s the ass. Besides, what kind of friend holds back a slice or two pizza? That medium pizza wouldn’t have been there without your coupon. NTA", "Nta, even if you didn’t have the coupon what “friend” denies another a slice of pizza knowing money is tight? It’s pizza, not steak. Mike is an AH for that alone", "NTA. If this were my friend group you would have eaten as much as everyone else even without the free pizza your coupon provided. The only one who stood up for you is your only friend. There shouldn’t have been sides taken.", "NTA- honestly even if you hadn’t paid, one or two pieces of pizza for a friend in a hard spot isn’t anything to cause an issue about. \n\nAll relationships are give and take but if you’re trying to calculate that literally down to the dime, you’re a bad friend.", "NTA. Your coupon got them a free pizza that they didn’t have to pay for, so why wouldn’t you be able to have some of that free pizza? Maybe it’s cause of how I was raised but I would never let someone at my house go hungry, even if you didn’t have the second pizza I would still offer you a slice of the original pizza. . Considering that Jake offered a few times to throw in for you it seems like Mike is the only one with a problem. And let’s be real, it’s pizza. It’s not like you went to a fancy restaurant and said oh I have no money to pay and ordered a 50$ plate that you expected other people to pay for. Mike is not a good host, and he needs to get over it lol", "NTA-  You pitched in, all good.  \nBut I also would be leaning towards nta either way. IMO thats what friends are for, being there and helping you out through tough times. I've both taken and given in situations like this.... Idk how expensive pizza is by you, but I would never ever ever throw a fit about someone who can't pitch in having some. I would just be mad if you didn't plan to eat and then started eating because then you'd be fucking up how much pizza there is for everyone. But if you told me, hey I'm hungry I dont have money, NP friend.   \nI can't believe that \"friend\" is taking this to a whole 'nother level. Like I said, in my world, you take and give. They spot you this time, down the future, you spot them, thats how I've always seen it :)", "NTA you got them a whole extra pizza for free. Your wording may have been confusing for some people but in essence you paid for a whole medium pizza. This “friend” is a complete AH", "Whether or not you’re “entitled” you’re NTA.  Mike (and anyone who parrots him) is a terrible friend.  At 30+ years old, he’s going to be petty over a couple slices of pizza with a “friend”?   Please, my 20something’s kids are kinder and more supportive to each other on their game nights.", "NTA, OP, but Mike sure is. By rights you bought an extra pie. Just because you did it with a coupon instead of cash is completely irrelevant. You weren't even trying to claim the whole pie, which you legitimately could, but just wanted to have a share. I dunno what Mike's problem is, but he needs to be a less awful person.", "NTA. I couldn't imagine sitting eating dinner in front of my friend who was struggling financially and not ordering anything for them. It's a couple slices of pizza it's not a gourmet meal. Your \"friend\" sounds like a right AH though", "NTA - your coupon added a pizza. Yes, your friends had already spent the minimum amount required to get the free pizza but you should at least have free to eat some of it.", "NTA. Mike is a dick.", "NTA , Mike is, it's just pizza for God's sake", "You should say pizzas as it implies more than one even though one was free, NTA but Mike is one cause you got them an extra pizza", "What the fuck? Totally NTA- you contributed an entire medium pizza!!", "I don't know if it has to do with my latin upbringing but you don't deny ANYONE food. NTA", "NTA - but I would cut Mike out of anything you organize.", "NTA! If one of my friends didn’t have money but had the coupon that added a whole other pizza it would expect them to eat some of it. Sounds like mike doesn’t like you and it petty AF.", "NTA, Mike is a dick", "NTA in my friend group you wouldn’t even have to ask. Help out the next time we order. Rotate the bill or help someone when they are down", "NTA you \"paid\" for a pizza via the coupon", "NTA. What the hell kind of friends are these btw? They ate in front of you and didn't let you eat? How old are y'all?", "You bought the pizza! The medium was 100% yours. WTF.\n\nNTA", "NTA. Your friends are creepy assholes. I can’t imagine denying any friend food. It’s bizarre, greedy, mean spirited behavior. Cultivate some real friends.", "Mike sounds like a major pile of garbage. We go to a friend's that hosts dinner party's and expects nothing in return. We either bring drinks or just chill with them. Friends don't humiliate you like that.", "NTA\n\nYou contributed an extra pizza, there would have been no need for your friend to pitch in on your behalf anyway. I have often “bought lunch for a friend” because they had a BOGO coupon and I had the money for the first item. I genuinely don’t understand Mike’s problem, other than just want to be an AH.", "Jake seems nice", "NTA. First off, your coupon was your contribution for more food, which they wouldn’t have had without you. But secondly, what kind of friend is stingy about sharing a pizza! They technically had More food with your coupon than they would have had if you just chipped in and they got the single pizza. Lol \nMike is a selfish prick and he clearly doesn’t respect you. Jake is a solid individual.", "Nta. You actually provided a free pizza and also if a friend needs some free pizza every once in a while, you just provide it. I can't believe some people think twice about it.", "NTA, you didn’t put “any money” in but you literally got them a 2nd pizza for free. You earned your share. I’m sorry you had to deal with that.", "NTA and Jake sounds like an awesome friend! Mike however...he needs jesus or something 😹😹😹", "So not the AH your coupon afforded the group that pizza.  Take all the reddit responses and show them to Mike.  Mike is the AH", "Mike is friggin rude. NTA", "Def NTA. I was confused about one free topping but saw it's a whole damn pizza. Mike is one hell of an AH", "Nta", "Ok before the edit I thought that you contributed 1 topping on the existing pizza. But after edit NTA", "NTA and Mike is very unreasonable. That pizza literally wouldn’t be there without the coupon. Mike needs to get over himself.", "NTA Your contribution was an entire pizza. They should have given you more than 1 slice.\n\nMike is TA because he should be providing food as the host. If everyone was consistently and regularly (like once a month) going to Mike’s house because his house was in the best location or because there is nobody there to bother everyone or because his house is the best etc… then it would be fine to expect everyone else to contribute. \n\nHowever if Mike is holding a random games night and other people hold them too… then Mike should have provided food. It’s actually laughable that he would hold a social event with no food. To be clear, MIKE should have paid for ALL of the pizza.", "NTA, but the question you need to consider is this: why are so many in your friend group okay with Mike being a total asshole?", "[removed]", "NTA", "NTA. Your coupon provided a second pizza. Mikes out of line.", "NTA, they were going to spend the money for the coupon to qualify anyway. If I were you, I would have taken *my* free medium pizza that I got with my coupon and left.", "NTA that medium pizza literally should’ve been yours. You used the coupon to get a free pizza, that guy is just an asshole and honestly sounds like you need better friends because they all should’ve immediately got on him about his behavior", "NTA. Mike can go eat 27 dicks. Who denies a friend food? This is no friend.", "So I just want to understand - as friends in your 30s since high school, why have none of you checked Mike on his selfish attitude?\n\nNTA, the extra medium wouldn't have been there at all if it wasn't for you, and what self-respecting 30+ year old tells a friend they can't eat anything because they didn't pay? I get if people were having individual meals, but why does Mike need 5 slices of pizza? Is 4 not enough? Does Jeff only get 2/3 of a slice because he couldn't contribute much? Who's calculating the dollar/pizza slice ratio, Moe or Doug?\n\nYour \"friends\" outside of Jake are just as guilty because they sat around and let Mike single you out.\n\nJust asinine - Mike doesn't sound like a friend and as adults, it's time you check him on shit like this.", "NTA. Get new friends. What kind of person would begrudge their friend a piece of goddamned pizza like that, even if you hadn’t given them the coupon? These sound like terrible people.", "Dude, your \"friends\" ain't your friends.  Don't matter who bought what.... everyone there should be eating.  Fuck 'em...time for new friends.", "Wait. You essentially bought a whole pizza and they said you couldn't eat any because you didn't use money to buy it? Wtf is that bullshit?", "NTA. Distance yourself away from Mike", "NTA\n\nThat entire extra pizza belonged to you, the others only paid for a share of the original pizza. If anything they should be grateful for whatever you're willing to share of your pizza with them. All of your friends (excluding Jake) that think otherwise are irrational and selfish, and quite frankly are not your friends. What happened here was complete BS.", "Ehh NTA- but only bc of how aggressively and A mike was. \n\nYou really shoulda accepted jakes offer if you though u might want smn. Its generally accepted that if people are all pitching in for something,  the people who pitch in are the ones who get it. Saying \"no i gotta watch my spending\" means that youll do without the pizza. Not that you just dont wanna pitch in. \n\nWith the coupon i do think that counts as pitching in but, like you alluded to, you shoulda said smn to make it clear that was instead of cash. Not just  gift.\n\nTho honestly i wouldnt assume it was a gift, esp if it gave a whole extra pizza... yeah mikes the A here. But you stumbled a bit too.", "Dude.  You got them a free medium pizza.  Does Mike want to pay you back for that?  Unbelievable.  Mike is totally TA here.  Did he read the first chapter of A Christmas Carol and see a life path?", "Jesus Christ even if the guy hadn't had a fucking coupon, if he were at my house he'd be eating. OP's \"friends\" piss me the fuck off. It is FOOD. Ugh!! OP, you are NTA by any stretch of the imagination. You need better friends.", "I'm surprised OP even asked if he could have a piece. He essentially bought the pizza.", "Agreed. This whole thing is strange. Someone is having a tough time. Friends help out. If this is how Mike treads a friend imagine how he treats strangers?\n\nOP - NTA.", "I didn’t realise OP meant the coupon was for a free pizza until their edit. I personally don’t like pizza so the only times i buy pizzas is for a gathering of some sort, so i don’t use nor have coupons for it. I genuinely thought that OP meant that the coupon was for a add-on topping.\n\nBut yeah Mike was just being petty for absolutely no reason, unless OP has a really bad history with mooching off the group, it’s unthinkable to treat a friend that way.", "Without the OP's clarification I'd have thought they got a free topping. Like extra bacon, cheese, chicken, whatever. Because english is not my first language and I don't live in the US/UK and never seen coupons like these", "This, hell I have even sent my friends money when they have been struggling to even get food on the table due to financial stress, and I know they would do the same for me. \n\nOP needs better friends, except for Jake, he’s cool.", "Wtf would a pizzeria offer a 1 topping coupon? That doesn’t even make sense, toppings are like 2$, if you’re already buying a pizza that’s practically worthless. You don’t need to understand English to get that, you just need basic inference skills", "Yeah these people really aren't OPs friends except Jake. I couldn't imagine sitting eating food, when my friend who is skint can't afford their own, I'd be sharing no questions asked! Because friends care and will share food and resources.", "I missed the age at first and thought they must have been teenagers. Lol if I had a friend out of work for a month of course we'd offer him some pizza while hanging out. Even if he didn't have the coupon.", "They like everyone else, just not Mike who will literally start shit over a piece of pizza.", "This needs to be a top comment. I don't get the logic of Mike but I know of people like him, jealousy is usually the cause.", "I dont know how expecting a slice of pizza when you used a coupon is an AH move.\n\nI also dont know how being upset that some one shits on you for wanting the above is an AH move.", "Breaking news. Person without a lot of money is cheap. Weather at 11.\n\nAlso. The dude just asked to have SOME of the medium pizza, not the whole thing. Where does that fall in your social etiquette?", "It's pizza. If a friend in the group can't chip in due to a month without paychecks, the social etiquette would be to order enough pizza anyway so they can still have some should they choose to. It barely costs a couple dollars extra per person. It may be different if it's a recurring issue or the person is taking advantage but in this story the assholery was entirely on Mike.", "OP contributed a coupon that added an entire extra pizza…if they have a 2-3 slices, there are still 5-6 left over for others, which is essentially a contribution. OP is NTA", "No it was for a whole free pizza", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "So they use a coupon to help the group get a pizza, and they ask to have SOME of said pizza, and they are the asshole?", "Mike is that you?", "In hindsight I wish I had put in money just to avoid this. But bc I had been off work for a month money was tight for me, and had to borrow a bit of money to get through. I would have felt guilty spending money on pizza so I didn't. I also didn't accept Jake's offer bc I just didn't want to have to feel indebted to someone else, even though I know Jake would have thought nothing of it.\n\nI think this is extremely stupid and not worth worrying about but was curious if people thought I was in the wrong at all", "He did pay up! He basically „paid“ for the whole medium topping extra pizza! I had to read back to what the coupon exactly did and if I understand it right, OP got that for his birthday, they could have just used a coupon a different time on themselves, so imo that counts as paid", "WHO THE FUCK GIVES A SHIT ABOUT THE COUPON?!?!?! I can’t imagine ever, in any circumstance, ever telling a friend no if they asked me for food that I was perfectly capable of giving them, because they didn’t pay for it. Especially a piece of fucking pizza or two. Today, I’m thankful for having friends who care about each other and wouldn’t do this.", "Even if it was just a topping, why would anyone object to a friend having some? Justify it in your head that the topping costs the same as a slice or two and move on. That's a petty 'friend' OP has.", "[removed]", "It’s beyond petty to give an attitude for something less than $20.  NTA.", "u/OutcomeDownt is a comment stealing bot. Original by u/depressivedarling", "> Mike is the AH here, and you had every right to grab a few slices. You don't ice someone out the one time they can't pay for a meal. You cover then and next time you get covered. You don't have a good set of fiends at all.\n\nBot.", "It wasn't all the friends, just Mike.", "Yeah and what would a medium topping even be? Obviously OP meant a whole pizza. Some people are just dumb lol", "Because some coupons say \"free medium 1 topping\" or \"free medium 3 topping\" and OP is stating what the coupon was for.", "Not sure where you are from, but in most of the United States, saying “a 1 topping” or “a 2 topping” or “a medium pepperoni” means a pizza.", "Hell yeah! Why have friends if they can't pull you through tough times.", "Sadly many people are quite lacking", "I mean I'll say I'm an American who speaks English as my first language, and it still doesn't make sense to me that he didn't just say a free pizza", "I know that, but wanted OP to clarify. Mainly because there were quite some people (some with uncalled for sass) who’d run to every NTA to “clarify” that his coupon only added a topping to the ordered pizza.", "Exactly! Keep Jake OP drop the others", "I mean… I can’t… I don’t even know where to start.\n\nMaybe someone will call me out on not recognizing my privilege or something but jesus… we’re talking about a slice of pizza. When I’m out with my friends we forgo counting who owes what. I paid for drinks, you’ll get dinner. You drove us, I’m buying. \n\nSlice of pizza.", "Actually I wanted to say that if I were Jack I’ll be a bit sad when hearing OP said no I’m fine. Like the previous comment said this is a slice of $20 pizza!  (But only when the group members are familiar with each other and finance is fine). \n\nI suddenly want to eat pizza badly when seeing all the discussions.", "And Jake offered. OP declined. You can't decline someone's generosity and then get mad", ">It's pizza. If a friend in the group can't chip in due to a month without paychecks, the social etiquette would be to order enough pizza anyway\n\nSeriously. OP is their friend. Let your friend have pizza when he's been having a hard time financially. Isn't that what friends do?!", "If this is a regular occurrence where OP refused to chip in and then asks for food he’s the AH in general.", "You are definitely not in the wrong. You contributed a whole pizza. And even if you hadn't...I dunno, I think Mike could have just recognized that money had been tight for you and been the bigger person and NOT made you feel uncomfortable. That's what a good friend does!", "Real question is why your friend group is connected with someone who feels its okay to publicly shame you to your friend group like that.\nI would keep a real close eye on him and make sure you never share anything beyond surface lol info with them.", "\n>>NTA: They had an entire free pizza because of you and your friend was willing to add in more??", "Ya I was thinking this is a point card system. \n\nBut even if it wasn’t a slice is at least needed as a delivery fee. I feel like that should be common knowledge", "> Mike is the AH here,\n\nThis is a bot.  In fact it seems to have copied from a different bot, and each of them cut the message shorter, so this one just has a scrap of a message.  Sad.", ">A whole new pizza\n\nUnrelated but this sounds like part of a pizza-themed Aladdin, and I am here for it.", "But except for the one, they’re all staying out of it.", "Some people aren't native English speakers and get confused by unclear wordings. Just be kind", "Also, just for context, not every country groups pizzas by topping numbers. \n\nI assume a one topping is a cheese pizza with like a choice of pepperoni or ham or whatever. But I suppose it could also be just a cheese. \n\nRegardless, here is Australia we speak English and order pizzas by name.. not topping numbers. I got what OP meant, but it took me a second because that’s not something we say here.", "Have you read thru the comments? Lots of people confused. Because it doesn't make sense. Just say a free pizza, adding that it's a free \"topping\" adds nothing to the story.", "Yep, a \"medium pepperoni\" makes perfect sense. Saying you're getting a free \"topping\" doesn't. I'm from Australia, no one would ever say they're getting a free topping. They would just say free pizza. Because that's what it is.", "Valid. I guess to me the fact that he specified medium made it obvious to me. If they got a large were they adding the 1 topping to a portion of the pizza or was the coupon so restrictive that it only got you something if you ordered a midum pizza. I've never heard of that type of coupon before and most people would never use it. Whereas a free 1 topping medium pizza would get used.", "Like I would feel ridiculous eating while our hungry friend sits there watching us.  I agree these aren't friends just people he's known a long time.", "That was before OP realized he had a coupon and offered it to the group. If they're not sharing the extra pizza with him, they're eating a pizza that he effectively added to the order. Maybe think of it like this -- if OP had brought his own meal, or procured an extra pizza for free from elsewhere that he brought with him, would he also not be allowed to eat that because he didn't chip in cash for the group order?", "Considering that OP specifically states that money has only been tight for the past month, it doesn’t sound like OP has a history of it.", "but he did chip in, yeah he didnt put in money, but he offered his coupon which got them an entire medium pizza for free", "That would be the case if it was 2 people, but in a group that big? Yeah, if someone contributed a coupon for a free pizza, they could have a few slices (OP didn’t ask for the entire pizza)", "I would share some of the free food with them??", "He couldn’t afford it. You’re a bad friend if you let your friend go hungry bc they can’t afford food. His coupon got them a whole other pizza and op is entitled to at the very least a slice of it.", "Pizza can be both a countable and uncountable noun.", "Botception.", "Hahah honestly me too", "Again, if you read my comment, you'd see where I said he should have had pizza. But he's still cheap.", "Well, I wanted that information before I made my judgement, hence the question. You can make any assumptions you want to but i will wait for OP to give me the information.", "The thing here is that OP isn’t cheap."]}