{"id": 31519, "submission_id": "181e31b", "title": "AITA for asking about my son's boyfriend?", "selftext": "My ( 45M) son \"Jacob\" (15M) is a wrestler  and in the last few months he became really good friends with this boy \"Trevor\" (16M) he met at a meet from another school. Now Jacob isnt someone youd assume is gay i guess hed be straight passing if thats still the term? Hes not out to me or anything but hes never really showed much interest in girls even though they show interest in him. And this new \"friendship\" of his seems way more close then any of his other friends.  They share clothes , sleep over all the time even more than he does with his bestfriend. I swear I see them playing footsie and hugging/cuddling sometimes. I've also found some ummm \"Wrapping parcels\" in his trash.\n\nI'm a single dad and I try my best with my boys and  yesterday morning before his brothers got up I off handily asked how his boyfriend was doing. I was trying to open some dialog show him it was ok. Im kinda new to this myself. He turned beat red and asked me what  I meant and i told him i was asking about Trevor. He just looked at me all bewildered and was just like \"very funny dad\". I just told him that I wasn't blind and that it was ok and that I loved him. He got mad and yelled at me to just drop it. \n\nWe haven't talked much since then and i talk to my parents and  they think I  went about it fine. My sister think I overstepped and shouldve waited for him to say something. That i probably freaked him out. AITA here?", "created_utc": 1700672747, "permalink": "/r/AmItheAsshole/comments/181e31b/aita_for_asking_about_my_sons_boyfriend/", "score": 136, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Saying anything about Trevor. Confronting Jacob about Trevor.? Not waiting on Jacob to tell me\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Your sister has it right.  I can't imagine the stress of coming out to your parents, even if they are loving and accepting.    \n\n\nI don't think you're an AH.  Just jumped the gun a bit.  Let him come to you.  I'll say NAH.", "NAH\n\nI can’t claim to understand the highly nuanced statuses of teenaged relationships these days, but sometimes kids engage in the type of stuff you mentioned but aren’t “official”. So it may have been as simple as they don’t use those labels with each other even though they’re a lot closer than platonic friends. \n\nI think you’re a good dad and a decent dude who was trying to find a way to let him know that you’re ok with who he is, and that he doesn’t have to hide anything around you. To be honest, it doesn’t seem like he was trying that hard to hide it anyway? \n\nI’d let it sit for a bit and see if he comes back to you, and otherwise treat him and Trevor like you always do. You made it clear you’re an ally and now the rest is up to him.", "NAH\n\nYou tried, it was the wrong take, but you did your best. As the answers here demonstrate, there's no unified right way to handle it.", "It could be more embarrassment that his dad is asking about his partner than the fact that his partner is another boy.\n\nNAH", "NAH It's heartwarming to see dads that care about their kids and accept them for who you are. I think you didn't handle it in the best way, because you came across as a bit too direct. Maybe Jacob wasn't ready yet to talk about it. But I don't think you're an AH, you meant well and I'm sure you'll find a way to let your son open up when he's ready.", "NTA\n\nLol that is a normal reaction sometimes even with straight kids who are trying to keep their relationship hidden/ on the down low from their parents btw", "NAH You definitely handled things a bit clumsy, but once the embarrassment wears off hopefully he'll be more willing to have a conversation. BUT! Let him open it, don't force the topic again or that would verge into being a bit of an ass. \n\nAs others have said, maybe he's not even sure yet himself. Sexuality isn't some set in stone thing as many think it is either. Just let him explore who he is and once he figures it out I'm sure you'll be let in. \n\nSpeaking as both a queer human and a parent. Just wait.", "NAH\n\nI think you did fine. But, y'know', teenagers are teenagers, they're going to freak out sometimes, especially about such sensitive (or, as teenagers will think, 'embarassing') subjects.\n\nI don't really think there's a perfect way to bring these things up with a 15-year-old, so for a first try especially, this was pretty decent.", "NAH. While I think you could've started this conversation a lot better than you did, you did make it clear you love him and accept him. But also, he isn't an asshole for freaking out: he wasn't ready to talk about it and you brought up a topic that is already awkward enough for a teenager to discuss with their parent even when they aren't being outed, and he was, so of course he freaked out. Give him some time to cool down and reassure him you love him and you're happy for him.", "NAH, it’s likely that your son was just embarrassed. and even if they are more than friends, maybe they’re not quite boyfriends. as someone who’s LGBTQ+ with homophobic parents, i appreciate you for making it clear to your son that you’re an ally though. :)", "NTA - you're showing interest in your teen's life. Give him a little time, teens are super moody and reactive. Gay or straight he'd be uncomfortable talking about his relationships.", "NTA. Your question comes from a place of love and even though it probably felt very uncomfortable for your son I think you more or less did what you could to show love, interest and openness. It's hard to call you an AH for that", "NAH he's probably a little freaked out about you knowing and might not want to talk about it any time soon. BUT when he's ready that part of him that worries what you might think about him will be much quieter. Speaking as some one who had a very similar experience to your son once upon a time when I still thought I was straight", "NTA", "NAH. You’re a good dad.", "NTA I was in my first serious same sex relationship around this age and was pretty evasive about it with my family even though they are not homophobic and very loving. I’m glad he knows you support him and he can be whoever he is with you. The only thing that might be time sensitive is if he is sexually active having a private conversation with his doctor about whether PrEP is something that might be appropriate for him at this time. It’s the same as getting a daughter on birth control as a second form of prophylaxis. Better to get set up with options before you need them! \n\nYou’re going to blink and he’s going to be in college and I know I’d sleep better at night knowing my child had the resources and education to keep them and their partners healthy.", "I wouldn’t say anyone’s an asshole here. What I would do is just make it clear in more casual ways that you are okay with your son, or just anyone in general, being gay. Tell him if it ever comes up and he wants to talk about it to feel comfortable. That way you aren’t pushing it, but he also knows you aren’t gonna disown him or beat his ass over it either. Nothing is worse than that, because then the child and parent are no longer apart or each other’s lives or discussions. So, I think you’ve already done a good job at opening the door and he just wasn’t ready. That’s okay. This may be something he’s still not sure about either. This kind of thing still isn’t as normalized as it should be unfortunately and can be hard for some to talk about. He’ll let you know if he knows he’s safe to. ❤️", "NAH, but teens, especially possible closeted queer teens, can be very cagey about telling their parents they have a partner. i was 16 closeted and incredibly bad at hiding my relationship with my boyfriend myself, despite the fact my parents asked multiple times if i liked him or if we were dating. even if they knew i didn’t want to confirm it cause i was more embarrassed about telling them and scared about my extended family knowing. not to mention my boyfriend’s unaccepting family finding out.\n\nyou’re well intentioned but i think giving him space, apologizing for prying, and letting him know regardless of anything you want him to be comfortable to tell you these things is a good start. as he gets older though teens start to develop their own lives. there could be a lot of factors as to why he may not want to come out. if that really is his boyfriend maybe he’s still closeted and your son doesn’t want to potentially out him. you don’t have to know every detail of his life, but let him know you want to be a part of it, are there to support him if he needs it, and that you’re able to keep secrets if he entrusts you with them.\n\nhope things go well!", "On a personal level I think NTA. My son didn't come out to me until he was 17 and it was awkward for him. He also doesn't come across as gay and I had to ask him if he was trying to tell me something when he asked if a friend could stay.", "NTA You're trying man and hats off for that. You might have made a mistake but your hearts in the right place. IF you are correct its my guess that although the tension is high now you have opened a door in the future that may have made this a lot easier in the long run. For now, let it rest.", "NTA. You were just trying to show your son that you support and accept him, and that you're there for him. It's not wrong to do that as a parent, and it's not your fault that your son got embarrassed and freaked out a little. That's on him, not on you. What you did was kind and compassionate, and I'd say you're in the right here.", "NTA. You're trying. And he's mad now, but later in life he'll be thankful to have a father so interested in his life and so open. No matter his sexuality.\n\nAnd you know what? Any good parent is going to \"overstep\" from time to time. It's okay. Don't let it bother you. As far as \"oversteps\" go, this is a pretty okay one.\n\nIn short, brother, as a father of a queer daughter who absolutely lovingly oversteps all the time himself, you're doing great.", "NAH.\n\nYou were a bit clumsy for sure, but your heart was in the right place, and it's great that you made sure to let him know you loved him and were okay with his sexuality, whatever it might be. You sound like a good father trying your best.\n\nYour son is likely dealing with a lot right now: as I'm sure you can recall, being a teenager is a difficult and confusing time even when you're not \"different.\" Both boys are at the age when they're figuring themselves out. They may not be labelling their relationship as \"boyfriends,\" one or both of them may not be ready to call himself gay/bi/pan/queer at all. \n\nPerhaps you could wait a little bit, then tell him you're sorry for putting him on the spot like that and once again convey that you love him and you'll be there for him to talk to about anything when he's ready, but from now on you'll wait for him to approach you with any such conversations. Don't make it some long talk unless your son chooses to turn it into one, just say these couple of sentences as casually and you can and move on to whatever. He'll talk to you when he's ready.", "Sound like a good dad to me. That said, as a gay man I can tell you that coming out is terrifying and until you’re really ready every instinct will tell you to deny and lie, even to people you love and trust, so don’t take offense. Coming out in high school is bad enough but even worse if he’s a wrestler because he’s probably afraid of what the other guys will say, especially in a sport that is all about physical contact.\n\n\nI’m sure it’s tricky to navigate as a parent but probably best not to force the issue. Just continue to be supportive and find subtle ways to remind him he has a dad that loves him no matter what. 🖖🏽", "NAH. Former gay teen here and I think you did great. I probably would have reacted similarly to your son, but that's because I would have built coming out to you into this huge thing in my head and would have felt winded that it turned out to be nbd. \n\nTreat your kid normally and don't push it any further and give him the chance to get his footing again. If he continues to say it's nothing, accept and don't challenge it. But overall, good work, I think you guys will be fine.", "Believe me. He'll tell you when he's ready. Just stay open, and assure him of your acceptance. Took me till 18 to come out as a lesbian, and then till 23 to come out as trans. Sometimes people need to accept things themselves before letting anyone else do it.", "Your sister is right. Whether he’s gay, bi, pan etc doesn’t really matter but it DOES matter that He feels safe and ready to come out. He may not be ready. The most you should do is apologize for putting him on the spot tell him you may have misread the situation and that you love him no matter what.\n\nEdited to add judgement. I don’t think you’re the ah but I think you maybe put him on the spot before he was ready.", "Clearly, everything you did, you did from a place of love. You tried your best and it didn’t go over as well as you would have preferred, but that doesn’t change your positive motivations. NTA", "NTA at all.\n\nAll you've done is demonstrate that what your son is going through is normal and that he will belong in a loving home with a dad that is interested in his life. Might take him a bit longer to clarify, as it can be an awkward subject.\n\nIt really make me cringe any soft YTA judgements in these and similar posts.  Personally I'd have much rathered a response like this when I came out or before to know its a safe environment to do so and nothing would change (hasn't in the long term, did in the short).", "Would have gone about it a bit differently man, telling him ya support him and that his buddy can sleep over and that your cool with it and if he ever needs someone to talk to about anything at all that you just want him to be happy would have been a better play. \n\nAsking how his boyfriend is doing forces a thing, you just want to let him know you support him and that your cool to talk when ever.", "Ooof. Yea, a very gentle YTA. I'm glad you're accepting of him, but definitely should have let him come out to you in his own way. You've kind of forced the issue. I'm not against hints that show you're supportive, but to outright call him his boyfriend. That definitely should have waited til he came out, IF he even needs to come out. He is only young, he may not have figured it out fully himself yet!", "NAH, it definitely sounds like there's something going on, but coming out can be really really scary as a teen, even when you know the person you're coming out to will be supportive. You tried to open the dialog and he wasn't ready and freaked out, so nows the time to back off on talking about it, just keep treating both of them the same as you always have and let your son settle into the idea that you're on his side. \n\nAnd honestly, part of his reaction could be that he hasn't fully explored his own thoughts and feelings about his sexuality. If he's still struggling himself, or hasn't let himself think about it and the two of them are trying to \"just bros helping each other out\" themselves, you could have sparked an internal conflict for him because now he's having to face it. I'd encourage you to find ways to casually express your love and acceptance of him as a whole person (not bringing up sexuality or relationships or anything) in ways that he doesn't necessarily have to respond to and just keep it moving, make sure he knows you're there and you love him, and let him come to you in his own time", "NTA at all. He was probably just really startled. You made the first move, let him go from there. Now just love him. Show him with actions that this is not a big deal and you love him. He’ll come to you soon.", "(soft) YTA. \n\nIF he is gay and dating Trevor, then wait for him to tell you about it. You (with the best intentions) may have tried to force him into a convo he wasn't ready to have yet.", "YTA. \n\nYou made a mistake, so not really asshole but in the context of this post. I think it's best not to assume what's up with your kid. Make it clear that you are open minded. Ask questions. But **don't assume**.\n\nHere's the thing. Even supposing they are having sex, it's a big jump from there to \"boyfriend\". I know people who have had plenty of sex partners but only consider that a handful of them ever reached \"boyfriend\" status. So **it's a big leap from sex to boyfriend**, and you aren't even 100% positive about sex. (Maybe your son got some condoms and is experimenting himself. I did that.)\n\nAnyway, I know **your heart is in the right place!** You could even apologize as a way of opening the conversation. \"Hey Jacob, I'm really sorry about that assumption I made. I messed up. I just want you to know that I'm here for you if you want to talk. I love you.\" Or whatever.", "NTA - if he isnt ready to come out of the closet he should do the bare minimum and expect you to play blind and stupid", "I don't think YTA but that's a really tough bridge for your son to cross.  Go back to him and tell him you're sorry for assuming and that you will love him regardless.  If he ever wants to talk, you will be there to listen to him.  Then let him come to you.  Your heart was totally in the right place and as a parent it's tough.  Give him a little space and when he's ready, he'll open up.  Don't force it.", "YTA\n\nLess for the comment to your son then for talking to his other relatives about this situation. If he is gay or bisexual he obviously isn't comfortable being out yet. So you went and talked with multiple relatives. Seriously? Get a therapist. Hash out your thoughts about these intensely personal things with the therapist and let your kids talk about their own stuff with relatives when they are ready.", "You definitely overstepped, but to be honest it sounds like he was gonna come out soon anyway, yo didn't mean any harm and you're accepting of your son's sexuality so it was an honest mistake. NTA", "I understand you're trying to be a good and accepting Dad, but here's a few things I picked out from your post.\n\nWhy are you snooping in his trash? Also the way you made sure to describe his reddened face to add 'proof' to your claims, to me, makes it seems like you had far too much invested in this sort of 'gotcha' moment, and you thought that would lead to him opening up instead of shutting you out for your overt noseyness?", "YTA softly because you’re doing a lot of assuming here. If he is gay and not out to you, there’s probably a reason and I can’t imagine what you did made him feel comfortable. If he’s not gay and you’re looking too deep into this, you look like quite the jackass in the long run. \n\nI don’t think you’re a bad person for wanting your child to know you’re safe to come out to, but I do think you need to let him do it in his own way and time. \n\nI’ll also add here, you also assume that your child is gay, and has established labels with the guy. But you don’t have to be gay to know that not every relationship has hit that yet. You could be sexually active with someone and still not have labels yet. Someone calling them your “girlfriend” might induce a bit of awkwardness where you have to explain you’re not dating. Im sure if and when he feels comfortable defining what they are, and defining what he is, you’ll know.", "NAH because it’s a topic that should be breeched somewhat soon. Your son is 15 and is having sleepovers with his BF. They may be gay and the sex may be protected, however it is still not appropriate at that age to be dealing with such big things (BF over constantly). It is a mature relationship and as a parent some boundaries should be set imo. If it were a boy and a girl I feel the situation would be handled differently.", "Yeah YTA. You tried from a good place but that’s not ok even if your son was straight and you just assumed he was dating someone. Kids will come to you when they are ready. Do not push or you will push them farther away. \n\nPLUS you have now outted him to your entire family (which THAT was a HUGE asshole move)", "YTA, but not intentionally so maybe NAH?\n\nQ: When is a good time to ask someone if they're gay?\nA: Never.\n\nDoesn't matter who it is. Doesn't matter how close you are. Doesn't matter if you're accepting. Doesn't matter if you just want them to know you're supportive and love them no matter what. It's not your path or your story. If/when they want you to know, they'll tell you. Their own road to personal acceptance, figuring out who they are and how they identify, and who they want to know is THEIR journey and theirs alone. You took that from your son, and put him in a situation that he was not yet ready to define. \n\nYou don't even know if this other person is more than a friend to your son. There are other possible reasons why you found condoms in the trash. I know a lot of teens just try them out to make sure they know how to use them. As for the affection, that still doesn't mean they're dating. I've had lots of affectionate friends who hugged and kissed their friends of all genders.\n\nAs for how to begin to heal this, I wouldn't approach him in person. He's angry at you, and has every right to be. Give him space, but don't avoid him. I recommend writing him an apology letter. Explain that you are communicating in this way so he can have whatever time he needs to process it all, and if/when he's ready to talk, you'll be there.\n\nGood luck.", "YTA. It sounds like your heart is in the right place and that Jacob will be safe and accepted at home when he chooses to come out. But that’s not your issue to force and doing so can be distressing to someone who isn’t ready to share this information with a parent.\n\nBy all means make it generally or implicitly clear that your house is a safe and welcoming place for him and that you are an ally. \n\nAs far as how to proceed here, I think it’s one of two options based on your read of your son: either just drop it and be generally supportive as described above. Or *briefly* say something like “the other day I asked you an overly intrusive question.  I’m sorry for doing that and am always here if you need anything.”", "soft YTA. I can understand and sympathize that this could be a difficult situation to navigate, but when in doubt, use google my friend and you'll find plenty of info on what to do as a parent if you think your child is questioning their sexuality. The best you can do is just create a welcoming and accepting environment, whether your son is gay/bi/questioning or not, but you have to let him do things on his own terms. At that age, they probably don't even have a grasp on what is going on, much less to be able to talk about it to a parent.\n\nWith all of that said, you son will realize sooner or later that you had good intentions and can hopefully find comfort in having a dad who is open and accepting, even if you still have some things to learn. Good luck!", "YTA for outing your son to your family.   \n\nWtf.    😳 \n\nHow insecure are you with your decisions that you are soliciting opinions and looking for praise all over the place.  🤦", "Gentle YTA. You approached it horribly. He will come out to you when he is ready. To force him out is incredibly traumatic. Even though you did reassure him you loved him. Kids need to open up and come out in their own time.", "NAH, just absolutely tactless, bordering on an unintentional AH. You’ve definitely fucked-up.\n\n\nFirstly, you’ve completely assumed your son’s relationship with his mate is romantic/sexual rather than just a very close platonic bond. Even if your son is interested in blokes, you’ve also assumed that he has a partner - there’s a good chance it could be a unrequited crush, or they may both have had feelings and never expressed them to each other.\n\n\nYour son may, or may not, be coming to terms with his sexuality. As a bisexual who had similarly tactless questions from parents growing up, you’ve likely thrown him completely off, particularly if he’s still questioning his sexuality. Sudden questions like this make teens panic at the best of times, never mind when it’s about such a sensitive topic.\n\n\nIt would be the best if you apologise to your son for being presumptuous, letting him know that you love him know you’d love him no matter who he fancies, and confirming that if he does want to discuss his romantic relationships in the future, you’ll let him lead the conversation.", "Soft YTA. Best to let him tell you himself, if he is even gay.\n\nAs someone whose parent did this too, it can fuck you up a lil.", "Fuck your a nice guy. I wouldn’t let my son sleep with girls under my roof let alone another dude. 🤣\n\nAnd I’m not anti gay at all I just don’t encourage teenage sex in my house.", "A bunch of homophobes tell a guy he's in the clear for outing someone when they aren't ready? Sound like it Tuesday on reddit.\n\nOP you freaked him out and pushed him further back into the closet. It'll be a while  before he trusts you and he'll be taking extra care to hide any and all relationships from you. You really do not get how dangerous being gay is or why people remain in the closet, and you're not trustworthy for gay people to confide in.", "YTA.", "It’s crazy that these YTA comments are getting downvoted to oblivion. Clearly a lot of people not understanding how this sub works. It is not our job to determine if OP is a nice guy or a bad guy, we are determining if OP acted wrong in the situation. \n\nOP, you seem like you have good values and are a good dad. But what you did unintentionally is basically started nudging your son out of the closet before he’s ready. I don’t think you’re an asshole at all, but in this situation YTA", "YTA (unintentionally?). Please address this subject with great care. https://www.today.com/today/amp/tdna164428", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy ( 45M) son \"Jacob\" (15M) is a wrestler  and in the last few months he became really good friends with this boy \"Trevor\" (16M) he met at a meet from another school. Now Jacob isnt someone youd assume is gay i guess hed be straight passing if thats still the term? Hes not out to me or anything but hes never really showed much interest in girls even though they show interest in him. And this new \"friendship\" of his seems way more close then any of his other friends.  They share clothes , sleep over all the time even more than he does with his bestfriend. I swear I see them playing footsie and hugging/cuddling sometimes. I've also found some ummm \"Wrapping parcels\" in his trash.\n\nI'm a single dad and I try my best with my boys and  yesterday morning before his brothers got up I off handily asked how his boyfriend was doing. I was trying to open some dialog show him it was ok. Im kinda new to this myself. He turned beat red and asked me what  I meant and i told him i was asking about Trevor. He just looked at me all bewildered and was just like \"very funny dad\". I just told him that I wasn't blind and that it was ok and that I loved him. He got mad and yelled at me to just drop it. \n\nWe haven't talked much since then and i talk to my parents and  they think I  went about it fine. My sister think I overstepped and shouldve waited for him to say something. That i probably freaked him out. AITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH", "NTA, it IS time to talk to him to let him know in some way that you are aware that hes having sex in the house and that its ok, yes theres fun sneaking around in your teens but its also nice to know the world wont end if you get caught.\n\nIm sensing its just defensiveness and not wanting to paint himself into a corner should he be still feeling things out, and if hes not, well its good for him to know that you are ok enough with people to not be a bigot, also important to know when you are in your teens", " Tbh Nta, my mom would also randomly ask me stuff like this and I would always get flushed about it, I’m not gay but I’d still get embarrassed when asked about my relationships. I understand that you’re coming from a good place.", "NTA - you were being nice and he totally freaked on you. Kids do that.", "When I was in the process of figuring out my sexuality and starting a relationship with another woman for the first time, it was so new to me. The two of us cuddled, had sleepovers, were so close, but neither of us named what it was for a few months. It was this weird limbo stage where I could feel that this was more than friendship but I also hadn’t fully given myself permission for it to be. Often times queer relationships can take longer to form because there is always a question of “Am I? Is this other person? Will it change the friendship? What will people think? Am I certain? Do I then have to come out?” There are a lot of big questions for one’s self. \n\nSo I fully hear how you were trying to be open and relaxed, but it likely wasn’t the time. He could still be figuring out his sexuality, he could be still figuring out if it’s a friendship or relationship and where those lines are, and he could still be figuring out if this is something he wants to commit to being open about. Having someone bypass this important reflection period and just put them can feel incredibly violating.", "NTA. Clumsily well-intentioned, but NTA.", "NTA. If it was a straight relationship, this dialog wouldn't be an issue at all. It's cool.", "Yeah, regardless of your investigative rigor, you should leave that ball in the kids court.", "I'd agree with your daughter... he's freaked out. Wevl thought at 15, that our (m60f61) son(30) was perhaps gay. He had no interest in girls, cars bikes etc... he surprised us at 17 with a lovely lass who we eventually married.  These days he's a diesel mechanic,  doing very manly things...", "NTA BUT \n\nYou could ask him in a very sensitive way. It sounds more that you are already made your mind but saying he's gay. \nMaybe they are just very close friends which loves company together without being gay. Don't be judgemental in your conversation. \n\n\nI know you are trying to be an involved dad and that's lovely. \n\nYou opened the door without knocking first. \nSometimes it's better to wait and not to storm in.\nHe will open to you when he's ready (when he is really gay)\n\nUntil this day. Keep being an awesome dad and support him in every way no matter what. \n\n\nCheery ✌️", "NTA but I think the way you brought it up caught him offguard, this story reminds me of me and my first gf and my mom said essentially the same thing lmao you're doin great Dad it's just tough but as long as he knows youre supportive is what counts", "NTA. I would have done the same", "NAH You meant well but coming out is really really hard since you not only need to accept yourself, but feel ready for others to know. Especially since you cant control what they say or do with the info, how they will treat you after knowing.\n\nIt took me years to figure out myself and a year and a half of silence before I came out as asexual to my mother whom I trusted 100%. And she told her fiance about my sexuality without my knowledge or consent since she trusted him. I didn't. I didn't even like him at the time. He barely understands Gay, he doesnt understand or respect asexuality and I am glad his previous brain operation made his memory bad so he doesn't remember what she told him. Lukcily my mother understands the \"rules\" of knowing my sexuality now.\n\nIts **always** supposed to be the person its about, who comes out, not others chucking them out of the closet. Well meant or not. Drop the topic. Dont bring up LGBTQ stuff. If there is an LGBTQ topic somewhere don't try to \"prove\" support after this incident, just be normal. Act as if they are just friends. Let him come to you.", "I second this.", "I might feel the same IF the kid wasn't leaving used condoms in the trash for all to see.", "....and stop talking to other family members about his sexuality, until he gives you permission to do so.  If he is uncomfortable with his parent knowing, imagine his horror at knowing gran, pa and aunty are all discussing it too.", "Forcing someone out of the closet sucks really really bad, it just causes awkwardness", "This exactly!", "This...💯", "I disagree. Teenagers don't like talking about their crushes or partners with their parents period, so I think his son was just embarrassed because his dad brought up his crush and called him his boyfriend, not because he's scared to come out", "Agree but I wouldn’t call OP TA for this. I’m assuming OP is straight, and wasn’t aware of the nuances of a first gay relationship/being in the closet, so he didn’t see it any different than asking “how’d your gf” if his son was straight.", "Also, if they thought they were being discreet, you just burst that bubble.  So now they're probably worried about how you figured it out and whether or not other, less safe people have too.", "not calling you homophobic, but why would it be different for your son to be with another guy rather than with a girl? maybe i just read the wording wrong, idk, but..", "I can't believe you're the only person in the comments to say anything about that. I'm from the 1900s so I guess things have changed a lot, but I can't imagine leaving used condom wrappers in my room as a 15 year old.", ">But what you did unintentionally is basically started nudging your son out of the closet before he’s ready. I don’t think you’re an asshole at all, but in this situation YTA\n\n\n\nOr what he did was be a parent. \n\nIf the son was straight and this was with a girl, you will say- it wouldn't be a 'big deal'. To Op, it isn't a big deal and it isn't. Op is the parent not a big bad wolf trying to get his son", "I agree here.  I even find it cringe worthy when parents force the issue on what the status of their kid’s friends are for heterosexual couples.  Like your teen daughter can’t have a friend that’s a boy?  You have to say is this your “boyfriend”?  \n\nLet them define their own feelings before you pressure them for a label.", "why", " I know things are different from how they were even 15 years ago but coming out is still a big deal (especially a 15 yo boy coming out to his dad).  IF he IS gay, he's maybe not come to grips with it himself and trying to figure things out.  He needs that space to do that on his own and get comfortable before sharing that with dad.  Love that dad was only being supportive but he did overstep by not allowing his son to come to him in his own time.  NAH.", "hes leaving condon wrappers around so not that discreet", "If my son came out to me as gay I wouldn’t disown him but I can’t lie and say I wouldn’t be a little bit disappointed. \n\nIf that’s homophobic than I guess all my gay friends should start disowning me. \n\nI believe in furthering the family line. I want grandkids. Blood grandkids.", "I dealt with that a lot growing up as 2/3 of my friend group consisted of guys, and I'm a girl. Back then, I just clicked with guys easier than girls cuz I was a heavy tomboy (I'm still a tomboy to this day but have since gotten in touch with my feminine side).", "Because your out. \nIf you and your same sex friend leave used condoms in a room then the secrets out.\nAnd your also putting your parents in a bad spot where they may feel the NEED to talk to you about it since your having sex at 15 under their roof.", "Based on the fact that he's sharing clothes and sleeping over with this boy, I'd say he's pretty confident in his sexuality, even if he doesn't show it outwardly. He might just not feel ready yet to tell his dad, which he should respect, but it's clear that the dad does love his son and encourages him. Overall, I think it's a slight misunderstanding with no ill intent on either side", "Yeah, but that doesn't mean they don't \\*think\\* they were being discreet.  Teenage boys are a special kind of dumb.", "..wtf? why would you be disappointed? and yes that is homophobic. and what’s all this “furthering the blood line” this is not the 1700s 😭 and you can still have grandkids if your grandson is gay, adoption is a thing", "What if your kid is infertile? Or what if they just don’t want kids? Would you be disappointed in them for that too?\n\nAlso, you 100% can still carry on your family genes as a gay person. A gay man can use his sperm to impregnate a surrogate, a gay woman can get a sperm donor. \n\nAnd the fact that you think having gay friends means you’re not homophobic is pretty telling. Plenty of people like you that are fine with anyone being gay until it’s a family member.", "Nope, that does not mean they are out.  Just not great at hiding the evidence.  You can talk to your kid about sex without outing them."]}