{"id": 31570, "submission_id": "1820lic", "title": "AITA for being annoyed at my neighbour for having sex?", "selftext": "We live in an apartment building and share a bedroom wall. She recently got a new boyfriend and he is LOUD. He moans with every thrust and I wake up to him in the middle of the night and my walls and window are vibrating, objects falling onto the floor. It’s getting really frustrating and I want to write her a letter to ask if she can tone it down.\n\nI put in headphones and can still hear them, I have to wait until they stop to get back to sleep which can keep me up for hours. My dog hates them because they wake him up too so almost every night I have to calm him down after being abruptly woken up.\n\nWould I be an asshole for writing a kind letter asking them to tone it down? I want her to live her best life but just a little quieter? I’ve written this on another reddit forum and was told to grow up and let them live so I deleted it. I would love some more prospectives", "created_utc": 1700744113, "permalink": "/r/AmItheAsshole/comments/1820lic/aita_for_being_annoyed_at_my_neighbour_for_having/", "score": 56, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Was annoyed and want to write a note 2. I don’t know if I need to get over it and move on\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Make a meme letter.\n\n\"Dear neighbor. \n\nEverytime you rock your girlfriends world, there's an earthquake in mine.\n \nYou hit my wall so hard that I worry for her (or your) spine. \n\nMy dog and I, we would like to get a bit of sleep, and no, I'm not saying that you cannot make a peep, it's just *VERY* very strange trying to count counting moaning sheep\"\n\nA poem by: sleepless neighbor (and dog)", "assert dominance by getting a louder boyfriend", "NTA. A polite letter or conversation is a good way. Maybe she will move the bed or find another time, who knows)\r  \nIs it possible that she doesn't know how bad the soundproofing is in the house?", "Get some speakers you can place against the wall and play the \"Barney and Friends\" theme song when they start going at it.", "I would be upset with whoever built / designed the building you're living on.  \nDo they wake you up in the middle of the night and is it every night? or just random occurrences and at a \"normal\" time?  \n\nYou can be annoyed, but if the problem is in your insulation, install some sound proofing and move on.  \nYou could jokingly approach her as well.", "NTA. If this happens consistently and it is interrupting your sleep on a regular basis I would definitely ask if they could keep it down. It’s rude and it’s unnecessary. They can have sex without making so much damn noise.", "Shout “don’t stop, I’m almost there!” through the wall at them.", "Get speakers and blast that song “IF I DONT GET NO SLEEP CUZ OF YOUUU, THEN YOU AINT GONNA SLEEP CUZ OF MEEE” and then maybe they’ll realize how NOT soundproofed the building is 😅", "NTA\n\nA friendly/funny letter is fine. Happened to me once - we werent being super loud but our bed and the neighbour’s bed were both against the shared wall, and the bed movement was causing noise/thumping. They banged on the wall, lol. The next day we moved our bed to the opposite wall and generally tried to be a bit more careful.", "Avoid telling them that they could go fuck themselves because they obviously already did.", "Do it in person. Just try to figure out the best hours.", "Provided OP doesnt take action - NAH - they're enjoying themselves in their own space. It's annoying, but it happens, and they have every right to do it.\n\nNow if it was to happen regularly in the middle of the night and disturbs your sleep; bang on the wall - simple", "no", "YWBTA if you write a passive aggressive letter. Just knock on the door and ask them to please keep it down. Chances are they’ll be mortified they’ve been so loud", "Ask if you can join", "Invest in a white noise machine. Living in close quarters with other people brings on…some unsettling situations…\nBut you also need to make compromises in your situation.\nYou shouldn’t need to embarrass someone else because of what you hear, yes it does suck but make it work. Some people react badly when called out.", "TAH. Sex is a beautiful thing. Let them enjoy it. PS. There’s no standard for how much noise someone should or shoudnt make. \n\nEmbrace the chaos.", "Start blaring very loud gay porn. Find one where they're talking a bunch saying homo shit. \n\nNo way he'll keep his boner", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWe live in an apartment building and share a bedroom wall. She recently got a new boyfriend and he is LOUD. He moans with every thrust and I wake up to him in the middle of the night and my walls and window are vibrating, objects falling onto the floor. It’s getting really frustrating and I want to write her a letter to ask if she can tone it down.\n\nI put in headphones and can still hear them, I have to wait until they stop to get back to sleep which can keep me up for hours. My dog hates them because they wake him up too so almost every night I have to calm him down after being abruptly woken up.\n\nWould I be an asshole for writing a kind letter asking them to tone it down? I want her to live her best life but just a little quieter? I’ve written this on another reddit forum and was told to grow up and let them live so I deleted it. I would love some more prospectives\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "No you are not.\n\nIf they knew it was causing you trouble they would be more careful.\n\nYou can ask them to either control their movements and be less loud during sex.\n\nI understand that can be difficult since emotions are running high when a couple is naked in bed together.\n\nThe other option can be that they either have sex somewhere else on those nights or inform you in advance so u can sleep somewhere else or make certain arrangements that don't disturb ur routine.\n\nNeither party is the asshole here. They simply don't know their moments of love cause u trouble. Just let them know and see where it goes from there", "A few options here. \nWrite the letter. \nNext time you’re woken up go downstairs and bang on the door And let them know they are being loud. \nIf it continues make a noise complaint to your leasing office", "NTA. But I’m picturing the McGruber is fucking Vicky in the other apartment", "Bring your own partner to your room and return the favor?", "Make it a contest and have louder sex than the neighbor", "Me and my husband have loud ass sex. I picked a building with concrete and steel construction because I don’t want people to hear that😂. NTA it’s waking you up I’d start moaning at them to fuck with them or something lol.", "NTA\n\nWhile the petty part of me wants to say you should do something like play annoying music while they have sex and all just because it would be funny, I have to think that they likely don't know how thin the walls are or that their bed is right by the shared wall.\n\nI'd just either leave a note as planned or talk to them in person. I'm sure this can be resolved easily. And do it soon, you don't want to grow resentful of them and lose patience with them because of lack of sleep without even talking to them about it once.", "Tell her next time you hear them.you are going to join in.  I bet it stops.  Or, you'll have some fun while you're awake :-)", "I would say something to your neighbor. You shouldn't listen to stuff you shouldn't hear and they should do something about it. I'd say that you could just mention that you can't sleep in the night because you're being woken up by certain noises from her flat and you'd appreciate if they could just keep it low. \nIts not nice to be woken up and not being able to sleep for hours because someone has sex. \nNTA", "Start moaning back through the walls, they'll either shut up or he'll get excited and finish quicker", "Crazy Train played at highest volume might help.  Maybe not.", "HE makes loads of noise 😂", "If you can’t beat ‘em, join ‘em?", "NTA. THey may not realize you can hear them. Let them know and they may move the bed or something. I lived for two years in a semidetached house that shared a wall with neighbours. Never heard a sound from them ever, and assumed the wall was thick and blocking sound. Then after about two years, one day one of them said something. Could hear it clear as a bell.", "Record it form your apartment and play it for your landlord, talk to your neighbours and see how they feel and all go deal with it together. Chances are you’re not the only one feeling this way. Unfortunately though it’s her home and she has a right to be as obnoxious as she wants in this situation. I had to move because of dogs barking. \n\n\nIt maybe a no win situation sadly. Writing a note to someone that loud in the first place, and unaware of other people, will just get her mad at you.", "NTA you need to tell this guy in a nice way to keep it down and if he doesn't listen then complain to the landlord social shaming goes a long way!", "NTA.   i also have a noisy sex neighbour.  right above me.  on top of the moans they also have a bed that sounds as if it is a mouse on methamphetamine with a megaphone. squeak, squeak, squeak.  \n\n\none really hard flat hand slap on the wall the other day seemed to make a huge difference.  \n\n\ntry it.", "Don't write a letter just go there in person ain't nobody gonna take a letter serious", "“Hello, \nYour boyfriend is cheating on you. I’m the other woman. I’m not mad at you, we’re both victims in this” \n\nThen just let it work itself out", "Ya gotta match their noise level with something", "NTA. They don't get to disrupt your life to live their best.", "I would get 20 cheap speakers and put them all at full volume and just blast cBat", "NTA, but then it all depends on what you write.", "YTA - neighbors have sex", "Move the bed?", "NTA\n\nLeave an anonymous note that says how much you're enjoying the show and wondering if they'd be comfortable with leaving the door unlocked for spectators or a 3rd person to join in. \n\nThey will be too paranoid to make another sound.", "YTA for not asking to join", "Had a roommate in uni tell me to tone it down and I had no idea he could even hear it. Odds are she doesn’t know the sound is travelling beyond her room, if she’s a half decent person and you bring up kindly I’m sure there won’t be a problem", "Start with a letter but your landlord is next. There's potentially even noise bylaw routes you can take.", "I was once your neighbor. I shared a wall with my neighbor and didn’t realize how loud it was in their apartment, despite us actively trying to keep it down. The walls were just so thin and the old hardwood floorboards didn’t help . My neighbor approached me politely and was like “Hey, I’m happy you’re getting yours but is there anything that can be done about the noise?” We rearranged the bedroom and put soundproof foam on the shared wall.\n\nNTA for asking especially if you’re polite.", "NTA. Dear neighbour. Every time your boyfriend rearranges your guts, he rearranges my apartment. Please stop going buck wild", "YTA", "Absolutely you virgin bore", "Just moan louder. So they can realise everyone can hear them.", "NTA\n\nYou have every right to enjoy your home in peace. Noise is noise.\n\nIts appropriate to not have to endure the racket.\n\nYou would be the a hole if you got huge speakers and blasted Five Finger Death Punch at 3 am to make the point. (I've done it, it only makes things worse).\n\nI'm sure you aren't the only one who's tired of the noise.  Maybe an anonymous note posted in a common area vaguely mentioning a recent uptick in noise (non-specificaly worded) might do the trick, or speak to landlord? \n\nMaybe some specifics,  asking why the other woman that the guy brings over while she's at work is quieter.\n\n\nIn my case, based on my horribly out of shape body, it'd appear I was more jealous of someone getting it on vs. my non-existant love life.", "HAHAHA this is so good 💀", "While the other answers are also helpful, I like this one the most.", "Best reply ever", "Is this an application?", "Thanks for your feedback! Yeah very possible she doesn’t know which is why I’d like to politely let her know. It’s a very quite building and I doubt she’s heard me before because before this I hadn’t heard a single sound from either neighbour beside me. But yes I agree, I don’t think there’s any hope of the bettering the situation if I don’t kindly communicate. I want the best for her, she always seems so friendly and sweet. I’d hate to embarrass her by bringing it up but not much else I can do!", "This, and its not asking them not to go at it like its the end of the world.you just want to sleep (they also then know you hear them do it, which could be a bit uncomfortable for either of them)", "CBAT", "Baby Shark", "I always think of Ride of the Valkyries as the right song for disruption.", "Can You Feel The Love tonight from the Lion King soundtrack", "\"Rock the Casbah\" by The Clash at full volume with the speakers facing their wall each and every time they go to town should get the point across", "It's an oldie but it could prove be very effective...\n\n>Having my baby\nWhat a lovely way of saying\nHow much you love me.\nHaving my baby\nWhat a lovely way of saying\nWhat you're thinking of me.\nI can see it your face is glowing....\n\n~ Paul Anka\n\nhttps://youtu.be/umrzGr_etQw?si=tVilGnVvwwWtccEs", "Thanks for your feedback. Yeah it’s odd, it’s a new building in a wealthy suburb. Definitely a mix of poor design and unnecessary loud sex. It happens multiple times a week at the hours of 11pm-4am. I am almost always woken up and my sleep is messed up. I can’t even think clearly which is why I’m asking people for their opinions on here. It’s hard, she deserves a life without a Karen intervening but I don’t know what else to do! We’re both renting so installing things to make it sound proof is tricky!", "She lives in an apartment. Is there soundproofing you can pick up and take with you? I’m honestly asking the question.", "LOL \n\nThen they invite her to a threesome and say: the dog can stay", "Oh my goodness I’d never write the letter in a passive aggressive way. I think I’d have to disagree, a polite letter would be less embarrassing than having it said to her face and at her door. And the last thing I want to do is possibly embarrass her. But thank you for your suggestion!", "How do I block you", "If it’s loud enough that OP and their dog cannot sleep, even if OP wears headphones, that’s absolutely unreasonable. OP has every right to at least speak to his neighbour to let her know she has an audience.  NTA OP", "Thanks for your feedback. As I said I want her to live her best life. Id love to embrace the chaos but I don’t know I can do that loosing so much sleep. I’d have to disagree on the noise though, there’s definitely a standard when you’re having crazy loud sex at 3am on a Tuesday. It’s a tough situation!", "Second on the funny letter. Write it and send pics.", "Get noise canceling headphones?", "\rIf it can be heard so well, then there is a high probability that someone else will put her in an awkward position.", "This.  \n\n\nWith a major pro : if they get the reference, OP will now there is a good chance one of them is a Redditor.", "OH MY GOD 💀💀", "Yes, just google soundproofing panels", "Thank you for validating my feelings here. My sleep deprived brain is emotional right now. Yes, I think a politely written letter would be the best route, especially because I really believe she isn’t aware that I can hear her", "Why should they have to though? They can be expensive and the neighbour should keep it down.", "Noise cancelling headphones don't cancel wall shaking.", "True, however I’m thinking it’s probably only me as our bedrooms are sharing a wall but who knows!", "Like the backseat of a Volkswagen?", "Eh, idk, cbat reached twitter", "Or for Christmas order sound proof panels and put it on their doorstep and say it’s a Christmas present for them", "You might want to include sound dampening or sound absorbing in your search as very few will actually block all sound.", "I also think NTA but also I suggest getting a white noise machine (or app) or something like that, it might help both you and your dog :)", "That’s what happens when you live close to another person.", "Thanks for the suggestion! I’ll definitely be trying this out 😊", "Not necessarily. I live in a block of flats and have never had a problem with my neighbours."]}