{"id": 31574, "submission_id": "1823dza", "title": "AITA for refusing to pay my parents' bills and mortgage?", "selftext": "I (17F) is currently studying computer science so I can go to college and get a degree in Software Engineering. My parents however, made the demand that I should be a nurse. They've convinced the rest of the family that I wanted to be a nurse when really, I just wanted to work with technology. \n\nIt's not unsurprising or unusual when people try to live their lives through me, especially my parents because all they ever talk about is when I become a nurse that I'll be paying their bills and their mortgage and or flying them out on a trip to a hotel somewhere. Growing up, my parents have always been my bullies. Talking crap about me behind my back, comparing me to other kids, etc.\n\nI've grown to no longer considering them as my mom and dad, and more just of people I just live with who I'm related to. I plan to move out after high school because all my parents plan for me to do is take care of their children while they freeload on their spare time. As much as I love my brothers, I can't afford more years of me being their 2nd mother while their actual mother is doing who knows what.\n\nWhen my mom and dad talked about me paying all their bills and mortgage for the house as I start my new job, I told them no because this is a new job I'm working at and that I need the money so I can save it for the later future. (My parents make 125k per year by the way.)\n\nThey then called me selfish and naive because they think I actually plan on splurging my paychecks and not actually saving it. Even if I do splurge it, it's MY money. Not yours.\n\nMy dad said that him and my mom have taken care of me my whole life and for that, I owe them everything I have. Which is funny because all I can remember is being his and my mom's punching bag whenever they're angry and babysitter when they don't want to be parents to their sons. \n\nThey still insist I pay the bills and the mortgage of the house because I don't and can't live here for free, even though I'm only 17 so I technically have NO choice but to live here.", "created_utc": 1700752674, "permalink": "/r/AmItheAsshole/comments/1823dza/aita_for_refusing_to_pay_my_parents_bills_and/", "score": 28, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I might be the asshole here because I refused to help them out with the bills. Even if I was mistreated my whole life, I still feel like I owe them something.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYou don't \"owe\" them shit.\n\nTHEY chose to have a child, and with that comes the responsibility of providing a loving, supported upbringing.  Which it appears they've failed miserably at.\n\nGet out when you can.  Save your money, open a bank account they cannot touch and get out of that abusive house at the first possible moment.\n\nGood luck in your chosen career path!", "NTA...You don't owe your parents anything for raising you. It doesn't appear they did a stellar job anyway, even though you appear to have a good head on your shoulders.  Plan your own future, and do what you have to do to achieve the goals you have.  Your parents will have to figure their own future out. Stay strong!", "Where on Earth does a nurse earn more than a software engineer?", "NTA- Let them say what they want. Go away to college and never return. Are your parents paying for college? Are they making you stay and pay rent while in college? \n\nYou don’t have to do anything for your parents when you have your own job. You might have to make your life more difficult, but it’s better than being under their thumb.", "NTA. Go to college and never look back! Emancipation is an option but it will be hard to go to high school still and maintain enough work hours to pay for an apartment and utilities. I would save as much as you can and then get out and become the person you want to be. Your parents have a lot of nerve but if I was you I’d play it cool till you go to college. Then go NC with them. They don’t deserve your time or your money.", "They can't lawfully take a minor child's money. The day you turn 18, they can charge you whatever rent/bills they want.\n\nMove out as soon as you turn 18. In the meantime, don't argue with them about it. Just stay as silent as possible and make a plan to go.\n\nAfter you move out, try to maintain a relationship with your brothers, even if it's behind your parents' backs. You'll all probably want that relationship when you're grown, don't let your parents destroy it.\n\nPursue the career path that you want. Pursue the life that you want. Your parents can fend for themselves.\n\nNTA", "NTA\n\nOpen an account they cannot access and have all your money go there. \n\nIt’s parents’ responsibility to provide for their children. Children don’t owe their parents. That’s such a gross idea. \n\nYour brothers may need help, but you’ll be in a better position once you’re in a stable and independent situation.", "NTA ur parents are entitled as shit and need a wake up call to realise you owe them nothing. So what they raised you? they chose to have a kid that’s like the whole point of having children raising them it’s the bare minimum.", "NTA - but I'm exceedingly curious what job you're doing at 17, in school, and living at home that earns enough for a mortgage and bills. Child film star?  Crypto currency genius?\n\nThis is not popular, but being asked to contribute to the household you live in (be that by babysitting or finances) isn't unreasonable.  Contribute - not cover.", "NTA\n\nLeave when you can. (Are there any friends' families that might take you in for the time being?)\n\n&#x200B;\n\n>They still insist I pay the bills and the mortgage of the house because I don't and can't live here for free, even though I'm only 17 so I technically have NO choice but to live here.\n\nYou could see what you could do to emancipate yourself. But if you don't do that and they don't provide for you - a minor - call child protective services.", "NTA If you are in the US, you can request emancipation and be on your own. \n\nPaying rent when you hit a certain age is fair, it teaches kids about bills. When my kids got jobs, I had them pay 10% of their net pay or take home pay, unless they were also in school, so summer months and after graduation. This usually amounted to a very small amount like 17.00 every two weeks. I would then take the money and put it away and use it to buy something they said they wanted; new shoes, sweater, etc. \n\nBut I would never expect them to pay my mortgage. Even if they began to see you as a roommate and not a child, that would mean you were only responsible for a portion of it, not all of it. \n\nYour parents are treating you as a slave, not a child.", "NTA. What on earth? No way op, this is abuse. Tour parents are supposed to support you, indeed are legally obliged to support you. This is not a loan, and does not create any financial obligation on you. And you've been a punchbag (abuse) and a babysitter (parentification) so they have destroyed even the usual hope that you will love them. You owe them nothing OP, nothing. Get out, get away. And be free.", "NTA.\n\nAt 17, your parents are legally responsible for providing you with food and shelter. You, OTOG, have no legal obligation to provide them with anything. A small room and board would be reasonable, paying their bills and mortgage is not.", "NTA.\n\nWhen someone chooses to have a child, they accept responsibility for caring for and paying for that child until he/she is an adult.  The responsibility is a DIRECT consequence of their decision.  You did not choose to be conceived or birthed; you are not required to pay for their decisions.  \n\nUntil you are legally an adult. they CANNOT make you pay the mortgage or the basic utilities.  You can report them to your local child protective services agency if they try to take your earnings and use them for the bills, though if you are close to 18 and getting out, it might not be worth it.  But the day you are 18, you can open your own bank account, without their involvement, and have your pay directly deposited to that account.\n\nRight now, I would focus on having a plan in place to get out as soon as possible.  If you have a place to move or store your stuff they can't access, I would probably start slowly and quietly moving as much of your critical stuff out as possible, so that if things go badly, they can't prevent you from taking your own things with you.", "NTA.  They’re being manipulative and awful.  Also- They chose to have a kid and the responsibilities of raising that kid fall on them.  The whole “ you owe us” thing from parents is insane IMO.", "NTA - take it from a mum of 3, you don't owe them your money. Respect if they respected you, sure. That's about it. Start planning your escape the day you graduate high school (birth certificate, opening new bank account and closing the old ones...). If you could find a trusting adult around you to live with it would be great too.\n\nGood luck! Anyways they won't be able to keep you stuck your entire life. So go and enjoy your freedom when the time comes.", "As a father to three kids, I could never imagine them paying my bills or requesting they pay rent for living with me.\n\nNTA", "OP here. I've seen that you guys have suggested getting CPS involved, I wish I could but the last time CPS had gotten involved with my family was when my brother's teacher suspected abuse going on in the house because he would always cry that my parents would beat him if he acted out of line. My dad threw a fit and yelled at the teacher for getting CPS on him and even thinking that he would hit his child.\n\nI'll say it honestly here, he has beaten my brother physically from time to time, and I'd overhear him telling my brother to stop crying like a, and I quote, \"stupid little girl.\" Keep in mind he is only 11 years old. \n\nBut CPS just ignored the case and went about their day, so it's no use.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (17F) is currently studying computer science so I can go to college and get a degree in Software Engineering. My parents however, made the demand that I should be a nurse. They've convinced the rest of the family that I wanted to be a nurse when really, I just wanted to work with technology. \n\nIt's not unsurprising or unusual when people try to live their lives through me, especially my parents because all they ever talk about is when I become a nurse that I'll be paying their bills and their mortgage and or flying them out on a trip to a hotel somewhere. Growing up, my parents have always been my bullies. Talking crap about me behind my back, comparing me to other kids, etc.\n\nI've grown to no longer considering them as my mom and dad, and more just of people I just live with who I'm related to. I plan to move out after high school because all my parents plan for me to do is take care of their children while they freeload on their spare time. As much as I love my brothers, I can't afford more years of me being their 2nd mother while their actual mother is doing who knows what.\n\nWhen my mom and dad talked about me paying all their bills and mortgage for the house as I start my new job, I told them no because this is a new job I'm working at and that I need the money so I can save it for the later future. (My parents make 125k per year by the way.)\n\nThey then called me selfish and naive because they think I actually plan on splurging my paychecks and not actually saving it. Even if I do splurge it, it's MY money. Not yours.\n\nMy dad said that him and my mom have taken care of me my whole life and for that, I owe them everything I have. Which is funny because all I can remember is being his and my mom's punching bag whenever they're angry and babysitter when they don't want to be parents to their sons. \n\nThey still insist I pay the bills and the mortgage of the house because I don't and can't live here for free, even though I'm only 17 so I technically have NO choice but to live here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I think that although they chose to have a child. Children are big financial burdens. Maybe if you offer to cover some of the mortgage and a month or two of rent that might be enough to get them back on their feet. NTA though", "Yeah, you’re an asshole, but only because I don’t care for the story line.", "In the US the average registered nurse makes almost the same as the average software engineer. A traveling nurse makes a base salary that is equal to or greater than a software engineer, but also can often get a relocation fee and free housing as perk."]}