{"id": 3158, "submission_id": "z3tmw6", "title": "AITA for leaving my already made sandwiches when the shop owner wouldn’t honour the promotion?", "selftext": "Yesterday my partner and I went to a popular global sandwich chain for dinner.  In our country this chain is running a promotion where if you buy a $25 gift card you get a voucher for a free sandwich. Earlier in the week I purchased two $25 gift cards and received two free sandwich vouchers. \n\nWhen my partner and I arrived we told the sandwich artist we had the vouchers and would like our two sandwiches but that we would also be ordering another sandwich, chips and drinks and another gift card that we would pay for above the vouchers. He prepared all our food and we went to check out. During check out he scanned the vouchers and said one was not activated properly. I offered to show him my receipt from earlier in the week where I had purchased to gift cards but he said no and that he had to call his boss, the franchise owner. \n\nThe franchise owner asked to speak with me over the phone and I explained to him that the voucher must not have been properly activated at the time of purchase but I had my receipt and everything. He told me that it wasn’t his problem and that he would be charging me for the sub. I told him if he was running a promotion he should really honour it if his staff makes an error and again he said it was out of his control and he wouldn’t do anything to help us. \n\nHere is where I might have been an AH, I told the owner we only came because of the promotion and if he would not honour it we weren’t going to proceed with our order and we would go somewhere else. He told me I was an AH and would waste food and cost him money. I told him we would pay for our order if he would just honour the voucher. He refused so I left the sandwiches that were already made and walked out and went somewhere else for dinner. \n\nAITA?", "created_utc": 1669321212, "permalink": "/r/AmItheAsshole/comments/z3tmw6/aita_for_leaving_my_already_made_sandwiches_when/", "score": 332, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the AH because I wasted good food to prove a point and restaurants are already struggling because of the pandemic.\n\n**[Check out our upcoming Reddit Talk with Iliza Shlesinger on Nov. 28th!](https://redd.it/z29rfu)** \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">I offered to show him my receipt from earlier in the week where I had purchased to gift cards but he said no and that he had to call his boss, the franchise owner.  \nThe franchise owner ... told me that it wasn’t his problem and that he would be charging me for the sub.\n\nWell, now it's his problem that you didn't pay for any of it. Good work, franchise owner. \n\n**NTA**", "NTA.  There's customer service and then there's the ability to think critically.  This person has neither.", "NTA.  You were entitled to that free sandwich due to the voucher.  It's not your fault the voucher was not activated it's their fault and they should have rectified the problem.\n\nI hope you took the free sandwich at least though.", "NTA. Complaining about waste at a sub shop is insanity. If it’s the one I’m thinking of — James Johnathan’s, where they make their minimum wage employees call themselves sandwich artists — the actual cost of a sandwich is nearly nothing. \n\nThe real bummer is that those artists will be required to trash the sandwiches because eating wasted food will get you fired. So will taking a tomato slice off the line.", "Nah, you're NTA. Any business owner that is rude to a customer over a technicality is not going to be a business owner for long, they either go out of business or end up in jail.", "NTA. The owner didn't help you with something that would have helped him.  Good business practice dude ... that's going to work for you in the long term.", "I'd leave. Don't let him guilt trip you.  No food was wasted. An employee could eat it or give it to the needy.", "NTA", "NTA. That’s business and that’s why some sub shops get payment first before preparing the food. I hope you’re not planning to go back to that store in the future for subs, though. Perhaps you can go to another franchisee.", "You should also dispute the charge for the gift cards with your credit card company.  You bought one thing (gift card + free sandwich voucher) and didn't receive all of what you paid for (only got the gift card).", "Nta. What he did is illegal", "NTA, but if this is a holiday promotion, go look at those vouchers.  For most of the holiday promotions (buy a gift card, get a voucher for something), the voucher isn't actually valid until **January**.", "NTA. Customer service was crap. However, having had restaurants and worked customer service for others one of the most disrespectful and infuriating things to hear is “I only came here for the promotion/coupon”. I am far less likely to accommodate you when you’ve just told me you have no intention of becoming my client, nor did you in the first place. When people like that follow up with an “You just lost my business!” I laugh because I don’t really want that kind of customer- one who costs me money. Waste of food…well at my restaurants the rule was “you eat your mistakes” so no food would be wasted. Don’t know what this chain would do 🤷🏻‍♀️Anyways, still absolutely NTA here.", "I hate badly implemented chain store promotions. \n\nNAH If the coupon was not activated properly and he honors it, he loses money.  His way, he loses more and you dont benefit. Your way, he loses less and you benifit. Either way he was going to lose. \n\n\nHe did not display good customer service but it is the holidays and my heart, sympathy, and judgements will rest with retail workers for the next few months.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nYesterday my partner and I went to a popular global sandwich chain for dinner.  In our country this chain is running a promotion where if you buy a $25 gift card you get a voucher for a free sandwich. Earlier in the week I purchased two $25 gift cards and received two free sandwich vouchers. \n\nWhen my partner and I arrived we told the sandwich artist we had the vouchers and would like our two sandwiches but that we would also be ordering another sandwich, chips and drinks and another gift card that we would pay for above the vouchers. He prepared all our food and we went to check out. During check out he scanned the vouchers and said one was not activated properly. I offered to show him my receipt from earlier in the week where I had purchased to gift cards but he said no and that he had to call his boss, the franchise owner. \n\nThe franchise owner asked to speak with me over the phone and I explained to him that the voucher must not have been properly activated at the time of purchase but I had my receipt and everything. He told me that it wasn’t his problem and that he would be charging me for the sub. I told him if he was running a promotion he should really honour it if his staff makes an error and again he said it was out of his control and he wouldn’t do anything to help us. \n\nHere is where I might have been an AH, I told the owner we only came because of the promotion and if he would not honour it we weren’t going to proceed with our order and we would go somewhere else. He told me I was an AH and would waste food and cost him money. I told him we would pay for our order if he would just honour the voucher. He refused so I left the sandwiches that were already made and walked out and went somewhere else for dinner. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA If you have a promotion going you need to honor it regardless if the coupon scans or not. I’m sure there was a manager override or something to make things right.", "NTA and don't overthink it.  In that kind of shop there will always be a few sandwiches which get made but don't get purchased.  In this particular franchise their obstinance probably causes it to happen quite often.", "NTA.  You went to the shop with good intention and you brought the voucher.  The shop owner didn't honor the voucher - so leave!  You didn't touch or bite into the sandwiches, so why can't the sandwiches at least be given to the employees?", "NTA and you should probably post a review letting people know that he’s trying this scam.", "NTA. He FAFO.", "NTA but you realize you were spending $25 on gift cards to get a free sandwich which was probably only $6-$12, right?", "Stealing your fit", "They can't it's considered theft. At least that's how it is here", "Considering they had to buy gift cards for the promotion anyway, they'll have to come back eventually or give the gift cards out as gifts to other people.", "👍", "As a business owner, you have to accept that you're gonna lose out every once in a while. Had he honored it, OP would likely come back no problem, but now I doubt they'll return. Maybe even give the gift cards away or go to a different franchised shop.", "> Either way he was going to lose. \n\nYeah when you become a franchise owner, that's the shit you sign up for. Retail workers obviously deserve the grace you're extending but a franchise owner is not a retail customer service worker. He probably has never made a sandwich in that shop, ever. It was his employee's fault in the first place the voucher wasn't activated correctly, therefore he is the one who has to eat that loss. Also, the employee who made the sandwiches probably got to eat them/take them home.", "the gift card isn’t for me it’s part of my dad’s Christmas gift because he for some reason loves this chain. I was going to get them regardless but the promotion was just a bonus", "If you eat there anyway you're going to spend the money there anyway. I often load up on gift cards around Christmas. Or local bread store offers free loaves per $x spent so I have a half a dozen free loaves coming and then a healthy gift card balance that will let me go some time before I have to \"pay\" for bread again!", "theft?!", "Did you buy the gift cards at that store ? If it’s a country wide promotion then that’s something corporate is running. He may actually not literally have the power to do anything, he doesn’t have a choice about the promotions at all and actually loses money on them because corporate usually does not reimburse those and they may not even get full value on gift cards (depending on when the franchise agreement went into effect and what country this is). \n\nThere’s nothing wrong with you wanting what you paid for and were promised but you should just send a complaint to corporate", "THIS exactly. Our local owner of this franchise chain had to put up a sign that they cannot honor ANY coupons at this time. Costs have gone WAY up and some of these coupons were printed without taking the concept of actual cost in mind: Theres no margin.", "But one voucher was honored and the other, acquired at the same time, was not. So can't be vouchers good only after holiday, or only at store purchased at, or any other quibble. Only store error. NTA", "NTA. I would have huffed out before the phone call. Fuck franchises that don't honor promotions.", "NTA", "NTA, if you have a voucher they should honor it", "NTA.", "NTA\n\nAnd doubly his problem, because they can still use the vouchers. But not return for any further actual business.", "If it's a subway he'll be in business until the apocalypse. No matter how bad, no matter how dead, I have NEVER seen a subway go out of business. It's so weird", "The whole point of promotions is encouraging people who would not otherwise make a purchase, it's not 'disrespectful' to make a decision to go somewhere based on a promotion. I might only visit a store the first time due to a coupon, but it doesn't mean I won't become a repeat customer if I have a good experience.", "NTA.  I guess he lost good customers.  Honestly, if ya had a receipt I don’t get his reaction.  Honoring everything would have made you come back in spades.  He shot himself in the foot big time", "Sandwich artist lol", "NTA.\n\n> He told me that it wasn’t his problem and that he would be charging me for the sub. I told him if he was running a promotion he should really honour it if his staff makes an error and again he said it was out of his control and he wouldn’t do anything to help us.\n\n>Here is where I might have been an AH, I told the owner we only came because of the promotion and if he would not honour it we weren’t going to proceed with our order and we would go somewhere else. He told me I was an AH and would waste food and cost him money.\n\nMaybe I'm just being petty here, but I would have loved if you had thrown the \"Not my problem\" thing back in his face, like in the first Sam Raimi Spider-Man movie.", "Depends on the franchise, where I worked we were encouraged to eat anything that would otherwise go to waste. The number of not picked up orders and leftover cookies I fed my friends with ridiculous.", "> Any business owner that is rude to a customer over a technicality is not going to be a business owner for long,\n\nReminds me of one of the last times I went to Pizza Inn. They have a thing (or did, if not anymore) with their app where if you scan so many receipts, you get a free buffet or large pizza. Did that and redeemed my eight \"punches\" for the free buffet code. Tell the cashier who then called the manager over as apparently she didn't know what to do with it (which was my \"*sighs* Ah, crap\" moment). \n\nThe manager promptly refuses to honor the redemption, just saying I had to get the eight punches first. I tried explaining to her several times that yes, you get the code once the eight punches are redeemed. That that's *literally how you get the code on their app for the offer*. \n\nShe kept denying it and I just gave up and said forget it. Had I not been with people who were my ride, there would have been a good chance I'd have just left.\n\nLater, just out of curiosity, I looked up reviews for the place. Unsurprisingly, of every complaining review I saw of the place, literally the *sole* complaint was about the management. \n\nThat particular location shut down within a few weeks or so after that experience.", "The one losing money was the franchise owner not a retail worker tbh", "Actually, many Subaway locations have gone out of business in the last years, just this year they've lost more than 5,000 stores according to Google", "Weird we had 2 subways in my small city go out of business in the past few years", "They fired my late mom for \"being disrespectful and not following instructions\" because she refused to serve rancid food. She worked two shifts. Their was also an under current of \"firing you because you're disabled\".\n\n\nThey took over a month to pay her.", "You should watch the Jon Oliver show about subway. Horrible business practices", "Where I live when I worked at sandwich places. The place would consider the employee eating the sandwich as theft or giving it away same thing. And it's a firable offense.", "Most food places do that so their EMPLOYEES won't screw them iver by having fake orders called in that don't get picked up.", "seems like they could solve this by....feeding their employees"]}