{"id": 31658, "submission_id": "18340f6", "title": "AITA for \"not treating nieces and nephews equally\"?", "selftext": "I'm 30F grew in a fairly traditional (& misogynistic) extended family in SE Asia. My cousin Jay is the extended family's golden child. Even my own mom would hurt me if he tells her lies about me. I wouldn't even be given a chance to explain, it's straight to punishment & being forced to apologize to him.\n\nJay found out I paid for Ace's (another cousin) wife's hospital bills. Baby boy got stuck during birth, had to be revived, Ace almost lost his wife too. So Ace's expected bill ballooned & he didn't have money to pay the private hospital to discharge them. I covered the difference bc  they'll be billed more per day if they were held. Ace has been nice to me since we're kids so I didn't hesitate to help.\n\nJay said a family isn't complete w/o a son so they kept conceiving. 5 girls, 1 boy. They're $ struggling.\n\nHe's now claiming I have favorism towards Ace's son. He wants me to give same amount of money for each of his kids to make it up to his family.\n\nI told him he's out of his mind.\n\nHe's now getting elders in the family to scold me for being a hypocrite bc I complain about misogyny while spending on Ace's son but not his 5girls+1boy.", "created_utc": 1700864960, "permalink": "/r/AmItheAsshole/comments/18340f6/aita_for_not_treating_nieces_and_nephews_equally/", "score": 140, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I gave one cousin a considerable amount of money out of my savings while refusing to give another cousin money even tho he has more children depending on him.\n\nI might be the AH because Jay says he needs my savings to support his children. I refuse since I think it's different scenarios. Jay chose to have 6 kids but refused to find a steady job while Ace does his best but was just unlucky to be hit with huge hospital bill.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Tell Jay that you only help out when it is a life and death situation as it was for Ace. \n\nWhen the family elders get involved, tell them the same - Jay's financial issues are a result of his own choices. Ace's family was in a life and death situation that caused catastrophic bills through no fault of their own and Jay's family, blessedly.\n\nFrame it as \"clearly Jay is mistaken - this was never about the children and only about helping with the medical bills for Ace. I thought family helps family - didn't you chip in? The bills were MASSIVE given the baby and his wife almost died.\"\n\nTurn it fully into guilting them for not helping Ace during a near tragedy. When they swing back around about Jay fliip it into \"silly Jay! He must have misunderstood. Thank the LORD he never found himself almost losing his children the way Ace almost lost his child.\"\n\nFocus solely on the medical nature of it. The near tragic nature. The medical bills related to the emergency.", "NTA - Tell the elders if they are so damn worried about Jay and his family that they are more than welcome to pay for his family themselves. However, you helped out your cousin in a life and death situation that would have dug them into a huge hole financially for something that was no one's fault. But that Jay on the other had dug his financial hole completely on his and his wife's back (literally and figuratively).", "Well when it comes to gender equality SE Asian culture(like many others) is trash.\n\nYou have to decide how much you are willing to continue to be a part of it. You already know you're NTA, and that that's not really what your post is about.", "NTA - Your money, your choices. Whoever anyone thinks about your money is irrelevant.", "You didn't spend money on Ace's son. You spent money on an act of God (as in, an unforseeable disaster). Jay acted voluntarily. And I agree with you. NTA.", "NTA, Ace family was in need of money because of medical issues, Jay's problem is totally unrelated to any medical problems .", "NTA - you don’t owe him or his family anything.", "NTA you need to just go no contact with anyone that is as appalling as him.", "NTA and I wouldn't give him a dime. I get it's how your family operates, but I'd have to check myself out of that mess.", "Lovely how your elders are volunteering to donate money to Jay's struggling family! You'll tell Jay their offer right away, surely he'd be so glad to hear they're willing to help him out financially in these tough times!   \nWhat? Protest? They only wanted to be generous with *your* money, not their own? *GASP!* The *hypocrisy!* and when you just dipped into your own savings to help pay the hospital bills that *saved the lives of Ace's wife and son!* How utterly greedy of them, these relatives who won't dip into their own savings to help family in need! You are so offended you don't want to hear from them again until they either support Jay themselves, or apologize!!!!  \nNTA, in case you were wondering.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm 30F grew in a fairly traditional (& misogynistic) extended family in SE Asia. My cousin Jay is the extended family's golden child. Even my own mom would hurt me if he tells her lies about me. I wouldn't even be given a chance to explain, it's straight to punishment & being forced to apologize to him.\n\nJay found out I paid for Ace's (another cousin) wife's hospital bills. Baby boy got stuck during birth, had to be revived, Ace almost lost his wife too. So Ace's expected bill ballooned & he didn't have money to pay the private hospital to discharge them. I covered the difference bc  they'll be billed more per day if they were held. Ace has been nice to me since we're kids so I didn't hesitate to help.\n\nJay said a family isn't complete w/o a son so they kept conceiving. 5 girls, 1 boy. They're $ struggling.\n\nHe's now claiming I have favorism towards Ace's son. He wants me to give same amount of money for each of his kids to make it up to his family.\n\nI told him he's out of his mind.\n\nHe's now getting elders in the family to scold me for being a hypocrite bc I complain about misogyny while spending on Ace's son but not his 5girls+1boy.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "I'm very conflicted bc I want his kids to be taken care of and for them to succeed, but Jay is like a dead weight to them.\n\nI know that even if I and the rest of the family pour money for them, Jay would find a way to squander it and not take an ounce of blame. And as usual he'll blame me and his younger bro for all his failures.\n\nI'm stressed bc he sent me a video where he's shouting at the girls to ask me why I hate them so much that I don't want them to eat decent meals and go to school. He's making them believe that I can support them all financially (I can't, that's a family of 8, 6 kids in school) and it's my selfishness that's stopping them from eating well and being able to attend school regularly.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Honestly you need to cut him out of your life. Stop opening up his messages and get out of this toxic relationship. NTA but put your mental health first", "Holy shit that's so abusive!", "You can't change Jay. The moment you give him a dime you will be opening yourself up to YEARS of abuse from him and the elders in your family. He is going to try everything he can to tap into your savings and once he does he will drain you dry.\n\nSave some money so in the future, if you WISH to, you can help out his daughters quietly (they'll fully know what an AH their father is by then).", "WTF is wrong with Jay?! How is this weirdo the ‘golden child’?! Whats so golden about him? Or the fact that ge was fawned over made him an entitled delusional narcissist?! His poor kids (& wife Im assuming)!", "This. OP, you don't deserve Jay's abuse. And you know the money won't go to his children, who are the ones in need. Block him and let anyone who harasses you know that you'll do the same to them if they press you.", "My guess would be he's the oldest grandson. That happens in families in a lot of places (including the US--I'm looking at you, Gramma).", "NTA\n\nYour money, your choice on how you spent it.  You helped the cousin who is kind to you.   \nMeanwhile, Jay is an AH.  Stand your ground and tell them all that you helped Ace because Ace had an emergency.  Jay is just being a selfish AH and you aren’t going to give him your hard earned cash because he thinks he deserves it.  He has no claim on your hard earned money.", "NTA I think it's time to block jay and spend time with people who are nice to you. And to anyone who mentions money say oh how nice of you to offer to help them I'll be sure to tell them", "NTA.\n\nJay or his children aren't entitled to your money because of your relationship. It's your money: spend it as you wish. Good on you for telling him he's out of his mind. (Points to Jay, though, for accusing YOU of misogyny while saying \"a family isn't complete w/o a son\"--lolz.)\n\nIf the elders scold you, tell them they're welcome to spend on Jay and his children.", "NTA", "NTA; you helped pay the cost of *saving the lives of baby and mother*. It wasn’t just a gift of money. Your family is f*cked up.", "NTA/YTA, although it would be an extraordinarily good deed. The fact is you’d probably be an AH to yourself for choosing to hold onto resentment rather than supporting your niblings.", "NTA. You helped a person who has always been kind to you out during an emergency situation. That doesn't mean you are paying every cousin for every kid they produce.", "NTA - I married into a SE Asian family. This sounds very cultural. And some cultural things are unhealthy. It's ok for you to set limits, choose what you want to do with your own money, and tell people \"no\" when they try to dictate what you do with your life and resources. \n\nYou gave money in extenuating circumstances. Even if you had just given money because of a close relationship, you're \\*not\\* I repeated \\*not\\* obligated to distribute more money to other family members evenly. Go to therapy, heal the parts of you that feel you need to cave to familial manipulation and pressure, and practice boundaries. \n\nI hope you can stand strong in the decisions you've made for your life. They are yours to make.", "NTA, don’t give any money and just carry on as usual.", "THIS 👏🏻 NTA", "They don't regularly help him as far as I know. Pandemic has been hard and we lost a few family members who financially supports others. There's also another family drama that split people up recently (bc of a crime committed against me by another male relative).\n\nI've distanced myself recently but since it's Jay appealing to them, they're putting effort in contacting me.\n\nA common theme on these convos is since I have a job and I'm single with no children, it's my responsibility to help him. Emphasis on me being female while being single and no kids. They don't want the single male cousins to spend on Jay bc \"they need to save for future\" or married cousins \"bc they have to prioritize their own kids\". They said I don't need savings and should give Jay money monthly since I (my care/maintenance) would be my future husband's responsibility.", "For full disclosure, I spent about USD2,000 on Ace's wife. For a SE Asian country, that's a lot. It's also a big chunk of my savings. The usual take home pay in our city is $350/month. It's going to take me forever to save even just for a payment for 1 kid.\n\nJay is demanding 2k/kid from me and he has 6 kids. I don't have that kind of money. We also have a huge family. 1st cousins alone are 30+, and out of those cousins, they have a combined 26(?) children. What will I do if the rest ask for their children's \"fair share\" too?\n\nWith the youngest being a toddler, I can't provide from them with monthly allowance and handle their education. I'd be in my 50s before they all finish. I don't think it's fair for me to finance that mamy children when I chose not to have my own bc I know it's expensive to raise kids.", "LOL at you should give Jay money monthly. The fuck 🤦🏻‍♀️ cut them out or go very little contact. They’re nuts.", "Actually as a single woman with no kids it’s very important for you to build up your own savings. If you happen to never get married, you’ll need to support yourself and won’t have a man or kids to take care of you in old age.", "Since he is the husband in the family, isn’t it his job to provide? I also grew up in such a family and they sure don’t like it when I say that a male member is a loser who can’t even do the one job (providing for his family) correctly. I’ve also told them that I will cut anyone off who keeps contacting me about supporting anyone again. Honestly at this point, IDGAF. Enjoy you earnings and set yourself up.", "If it’s possible, set up education funds for the kids that can ONLY be used for tuition for each specific child. You can help the kids without giving a cent directly to Jay. Alternatively, block the lot of them.", "You know this is not your fault.  This is entirely Jay’s fault.  If you give Jay money, he will squander it on himself.\n\nMeanwhile, if you can afford to set any money aside into savings to help those girls on a few years when they get free of Jay, please do.  Help them overcome the decades of programming from their AH father when they are ready.  \n\nBlock him, and if anyone else starts in on you, then block them as well.", "AND you need to send this video to the rest of the family with the title of How Jay Abuses His Children.", "I sincerely apologise, for speaking without knowledge. Don’t pay any mind to what they say. Help your family when they’re in need and you’re able to. Final judgement NTA.", "His kids are between 4 and 17. The 17 and 14 yr olds used to be close to me. As they get older I think they've started realizing the tension between us and how whenever they're allowed to visit me they're required to nag me about how they need XYZ items and $X amount. They have stopped with the \"things that should be mentioned when I am on hearing distance\" but the middle kids are now starting to do that for Jay instead. They'll randomly message me in social media, then say they haven't gotten school supplies/shoes/clothes yet and they miss me. When will I visit and take them shopping for school? Those kind of things.\n\nI've been pretty successful at avoiding him in person by not attending family functions that I know he'll attend. I blocked him but he uses the kids' social media to reach me.\n\nKid's don't normally leave the house at 18 here. Usually when it's their married or havea job in a different city. Would be a few more years since the 17 yr. old hasn't started college yet.", "His wife is nice and very hardworking. But since they're on traditional mindset, she'll stick with him whatever happens.\n\nIMO, he's a pro at reading people and what appeals to them. Guilt in my case. Pity for my mom and other elders.", "Family knows. I've been sternly told a few times that it's none of my business, he's the father of the house and it's up to him to make decisions about his children.", "No issue. I just thought this context is important bc what he's asking from me is a lot while he barely works.", "Funny enough, he's not the oldest grandson. The oldest grandson is a jokester that everyone likes. \n\nIn my view, it's grandma and my mom that fueled Jay to be like this. Jay's dad is oldest son, he's like Jay in personality. Whenever that uncle need something he can guilt trip grandma to give them what they want.\n\nMom got a better paying job than uncle, grandma insisted that family helps family so mom supported uncle's family of 5 bc grandma made her believe that mom is \"lucky to land a job that pays better, so it's her duty to make her brother's life better\".\n\nIt's the same mantra my mom drilled to me when I got a better paying job that Jay. She wanted me to give Jay a monthly allowance to help with the kids. In my early 20s mom was able to guilt trip me to pay for Jay's family for a couple of years. It was a whole drama bc I thought I'm just giving a reasonable amount to cover their water and electricity. Turned out my mom sends them everything leftover after we pay our bills and we have groceries. I was working 10 to 12  hours shifts almost with no rest days only to find out later that there's $2 in our savings account. Jay on the other hand was able to get the latest TV and other applicants and motorcycle bc we subsidized (?) his family.", "Well, there's your answer to the whole 'give him money' thing. He can't have it both ways: either he's the father of the house and makes decisions, including getting a job and supporting his family, *or*, he's a loser/bum.\n\nIf it's not your business what happens in his house, then *it's not your business what happens in his house* - including acting the financial part of being the parent. Keep throwing it back at them.\n\nAlthough he's also lying about you and spreading slander (and you have the video as proof). Is there a cultural or religious tradition about that which you could use in your defence?\n\nYou know it's not you, it's him. He's trying to worm his way into twisting it around. He will try to use kindnesses against you. It's a pity he doesn't spend that type of energy on working!\n\nYou are definitely NTA.\n\nETA: is there any way other relatives and you could make like a trust fund kind of thing and pay directly to a school for their education? If he can't get his hands on the money, he can't squander it.\n\nThat way, he would also have to stop harassing you (make it part of the agreement - specify his good behaviour).", "Context is always important! I’m really grateful you were able to help Ace out, MashaAllah! You’re a great family member, I’m sorry your family can’t currently see that.", "Yes, subsidizing him is exactly what you were doing, and it's deeply unfair. I'm so sorry your family has put you in such a difficult situation, and I hope you'll have the courage to break free of them. You deserve better.", "There should be some protections against cyber bullying/ cyber libel but if he goes to jail (it's up to 6 yrs iirc) I'm gonna be harassed to hell. \n\nI've been avoiding in person family functions and have been successful so far, I'd rather be distant than cause a new issue.\n\nAbout trust fund, I'm not rich or even well off. I saved that money for years, I just acted quickly bc it's an emergency and if they stayed in the hospital it's gonna be extra $100/day that they're held in the hospital. Usual take home per in my city is about 350usd/month. We had to get them out as soon as doctor gave approval for hospital discharge. Their bill at that time was around $2800? $3000? depending on exchange rate. I covered around 2k out of the total bill.\n\nAce has said he'll pay me back, I agreed to his plan (to let him save face) but realistically I know he would have a hard time to make installments for that since we're having pretty high inflation and baby products have been getting very expensive. I've just accepted that I'm not gonna get that money back. If he does better in his career and pays me then that's great. If he ends up not being able to pay me back. It's alright, glad to have his wife and kid still around.", "You're an awesome cousin. That's the way families are supposed to act - being there when it's needed. I'm sorry that the result of you being an awesome cousin is you getting harassed.\n\nI'm sure Ace will find some way to pay you back, some time. It may not be in money :)\n\nAvoiding is sometimes the best thing to do.\n\nBut if you *do* get Jay up in your face, you could use that to shut the argument down, maybe?\n- It was just a loan, not a gift - Ace has an agreement to pay me back. - If I loan you money, are *you* going to pay me back? I will want a contract.\n\nAgain, congratulations on being good family."]}