{"id": 31682, "submission_id": "183dsse", "title": "AITA For hospitalizing my friends son.", "selftext": "I 25M had recently ordered a new scent from my favorite mens soap company. I thought nothing of it and a week had past and it had arrived the morning of Thanksgiving. I was super excited because now I could use one of their new scents to smell good on Thanksgiving day. I hopped in the shower and used it and I smelled really good. 3 hours later most of my family started to arrived and soon so did my friend and his son Nathan. Before they all arrived I had used one of the deodorants that came with it and left it out in the open, A fatal mistake. I started to chat with my friend and Nathan had ran off and I thought nothing of it. \n\nLater I had to use the restroom so I excused myself. When I returned to the table, Nathan was lying next to the stick holding his stomach on the floor. Nathan had started to cry and I looked at the stick and it had a bite mark into it. Everyone was around Nathan so I pushed through the crowd of people and asked Nathan if he had eaten some of it and he nodded it approval. Nathan then started to seize and 911 was called. They arrived and his friend explained that his son had eaten a part of the deodorant and felt horrible and started to seize. My friend and his son had went to the hospital.\n\nToday they updated me on that Nathan was fatally allergic to an ingredient in the deodorant and is currently in a coma which it is unknown when he will wake up. My friend has blocked me on all platforms and is refusing to speak to me and is blasting me on facebook saying that I caused all this and we reckless and irresponsible for leaving the deodorant out knowing that his son is fatally allergic to, I had no idea that his son was allergic to anything. Now everyone thinks that i'm a cruel monster so i'm wondering AITA?", "created_utc": 1700894982, "permalink": "/r/AmItheAsshole/comments/183dsse/aita_for_hospitalizing_my_friends_son/", "score": 135, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Leaving the deodorant stick out in reach of my friends son.\nBecause I should have put it away\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, you didn't know he was allergic and you absolutely couldn't predict he'd try to eat your deodorant\n\nI think your friends know it's not your fault but need someone to blame because it's such a wild and horrible situation... But them putting you on blast is not okay", "NTA. This is heartbreaking, but you had no idea that:\n\n1.This child was allergic to anything in your deodorant\n2. This child would enter your personal space\n3. This child would eat your deodorant \n\nIt's unreasonable to assume this would happen with a child old enough to be allowed to run around unsupervised.", "Since you had no idea Nathaniel has any allergies, NTA.\n\nIt's actually not easy to child-proof a home; even if you hadn't forgotten to put away the deodorant, the poor child could've probably gotten into something else dangerous because he was unsupervised and not (yet?) taught not to eat unknown things.\n\nYour friend's reaction is understandable, though. While not fair to you, it's easier to air that you were careless around his son than to admit that he himself was negligent. His mind may clear up later on, but at the moment he's probably in a state of suspended panic.", "As a parent, I say NTA. I have a child who is allergic to peanuts and I scan the room once I get anywhere for exposure. Even when I’m at a friend’s house that knows about the allergy. Your friend is angry and needs someone to blame. I would do the same….because it’s easy and means I don’t have to look inward.", "Hang on, what?! How old is this kid? NTA, I have never really considered hiding my deodorant to be at all a normal part of basic child proofing for guests. I’ve worked with children for 13 years and I’ve truly never seen a child eat deodorant. I’ve seen them try to eat plenty of other non-food items, but deodorant?! This is not your fault and your friend will hopefully come to terms with it being the insane freak accident that it was soon.", "If you had no idea, you are NTA. I’m also curious to how old this son is, because biting a stick of deodorant is something the parents should teach their son not to do.", "NTA, but you have to understand that you are now dead to that friend. It’s not your fault that it happened, but that friend will never be able to think about you without thinking about his son in coma. Sucks dude, nothing you can do", "Nta but I would definitely call a lawyer because they're going to sue you. They wouldn't block you otherwise. Consult a lawyer and get as much info as you can as well as witness statements.", "NTA\n\nHe shouldn't be eating deodorant sticks", "Nta if his kid was stupid enough to try eating deodorant how is that YOUR fault", "Your friend is not thinking straight for obvious reasons, but it is absolutely not your fault that a kid bit a piece off a deodorant stick... Especially when you had no idea the kid was allergic to an ingredient.\n\nYour friend is definitely TA for taking his biased version of the incident to social media and turning people against you.\n\nI hope the child recovers from this.", "NTA  but wtf how old is this kid?? If they are young enough to EAT deodorant then they are too young to run off without direct supervision. Your friend should’ve been watching his child. I have never heard of hiding deodorant as a way of baby proofing. Cleaning chemicals, tiny beads, thc gummies, etc sure, but deodorant??? Do you also need to hide the TV remotes so he doesn’t pluck the batteries out for a snack? Plastic wrap your pillows so he doesn’t go to town on the stuffing?? Do you need to hide the hand soap? Seriously, does your friend think you should’ve just hosted everybody in an empty room, like what an insane response. Try watching your own kid for a change. and who doesn’t INFORM the person hosting them if their child has a FATAL allergy? \n\nNo, he’s upset that his own negligence might take his child away from him and he’s blaming you because he mentally cannot handle the stress, the grief, AND the guilt at the same time. You did nothing wrong.", "YTA for this bullshit story.\n\nOP has been asked several times how old Nathan is. He’s refused to answer that question. Why?", "NTA you’re not the parent, you’re not responsible for the child being left unattended to be able to eat something they shouldn’t have eaten. \n\nYou cannot be responsible for not removing an allergen when you weren’t aware it was an allergen, again this is down to the parent to enforce until the kid is old enough to learn.\n\nEither Nathan is old enough that he should know what makes him react, I’ve had 3yo rattle off all their allergies perfectly due to having it drilled in by parents from day 1. Or Nathan is still very young, in which case the parent should have been watching them. Their kid, their responsibility! \n\nSeems like the friend is just trying to scapegoat you for their parental negligence", "NTA Doesnt even matter if you knew he had allergies to it this isn't something you would predict happening, you didn't expect him to touch it very much less try to eat it it sounds like it was in your own space \n\nassuming the kid is young or has pica the worst you are is careless leaving it out, but even that doesnt make it your fault", "I'm sorry but who on earth anticipates a kid *eating* your deodorant stick? \n\nNTA", "NTA\n1. Why did he eat the deodorant?! Like what allergy makes you do that???\n2. EVERY time I make something for friends I ask for a list of allergies/dietary restrictions so I make sure I avoid EVERYTHING to avoid these types of situations…\n3. Why wasn’t your friend looking for him if it was longer than normal of the kid disappearing???\n4. Cut your friend out… even if the kid comes out of it that relationship will never be the same and without tension… I’m so sorry for everyone involved and I hope everyone finds peace", "NTA\n\nThe kid ate your deodorant stick. How the fuck should you have known he goes around eating stuff that is not for eating? If the kid has allergies OR a tendency to eat stuff that is inedible (which can always cause harm!) the parents absolutely need to inform you about it so you can prepare accordingly.\n\nI feel for the kid, because this is a disorder that needs to be treated and I really hope he recovers. But this is not on you. It's on the parents. And they know it. They are just afraid and lashing out. Give them some time.", "Umm WTF? Idiot child eats your deodorant, and you are somehow to blame rather than the idiot parents who were obviously not watching their child. Wow OP, NTA!", "Hi. This is absolutely b.s 100% made-up, did not happen b.s. ridiculous waste of time.", "NTA. He should have been watching his kid and taught his kid not to touch other people’s belongings.", "IDK man, Maybe your friend should teach his son, not to eat deodorant. \n\nNTA", "NTA, your friend didn't tell you that his kid was allergic to it and so you had no reason to think you needed to treat it as a dangerous object and put it somewhere his kid couldn't interact with it. I would strongly advise setting that record straight to the public instead of letting him use you as a scapegoat for his own failure to inform people of his son having a fatal allergy to something.  Don't let him turn you into his whipping boy just because you feel bad for him that his incompetence has gotten his kid put in a coma.", "Nta- how old was this kid?", "NTA. I have serious allergies. I have NEVER considered that a deodorant might contain something that would trigger an allergy. Even if I was told that a child had an allergy, I would not be looking at deodorants as a thing to remove. If I was the parent of a child with a life threatening allergy, I would mention it EVERY TIME I took the child anywhere. And, if I was the parent of a child who put random things in his mouth (like most under threes) I would bloody well supervise them.", "Sounds like bad parents. NTA", "Everyone is allergic to eating deodorant \n\nObvious NTA if this is a real story", "NTA, but give them time to process their shock, fear, and grief. Grief especially can make us act irrationally as we try to navigate it.\n\nEven if my best friend had been in your shoes I'd need a break from him as I tried to readjust to my young son being comatose and possibly never turning 5. \n\nLosing a child can end a good marriage; it could certainly end a friendship.\n\nYou're not at fault but this is a really shitty situation.", "INFO: did you know his son had any allergies", "INFO: How old is Nathaniel? (Old enough to know not to eat deodorant?) Did you leave the deodorant somewhere it could have reasonably been mistaken for food? Had his parents told you of his allergy?\n\nWhatever the answers, please know that this is NOT your fault. But his parents need someone to blame right now, and it’s you. And it will continue to be you. Sorry, your friendship is over.", "NTA", "NTA", "Need more info…how old is Nathan?   Who leaves deodorant out in the open?  What? You set it around like a decoration? Why wasn’t it in your bathroom or bedroom?  Or do you only have one bathroom in your home that it might have been on the counter?", "NTA but why would you think nothing of a kid running off with your deodorant?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 25M had recently ordered a new scent from my favorite mens soap company. I thought nothing of it and a week had past and it had arrived the morning of Thanksgiving. I was super excited because now I could use one of their new scents to smell good on Thanksgiving day. I hopped in the shower and used it and I smelled really good. 3 hours later most of my family started to arrived and soon so did my friend and his son Nathan. Before they all arrived I had used one of the deodorants that came with it and left it out in the open, A fatal mistake. I started to chat with my friend and Nathan had ran off and I thought nothing of it. \n\nLater I had to use the restroom so I excused myself. When I returned to the table, Nathan was lying next to the stick holding his stomach on the floor. Nathan had started to cry and I looked at the stick and it had a bite mark into it. Everyone was around Nathan so I pushed through the crowd of people and asked Nathan if he had eaten some of it and he nodded it approval. Nathan then started to seize and 911 was called. They arrived and his friend explained that his son had eaten a part of the deodorant and felt horrible and started to seize. My friend and his son had went to the hospital.\n\nToday they updated me on that Nathan was fatally allergic to an ingredient in the deodorant and is currently in a coma which it is unknown when he will wake up. My friend has blocked me on all platforms and is refusing to speak to me and is blasting me on facebook saying that I caused all this and we reckless and irresponsible for leaving the deodorant out knowing that his son is fatally allergic to, I had no idea that his son was allergic to anything. Now everyone thinks that i'm a cruel monster so i'm wondering AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, sorry about you're friend blasting you on Social Media (and blocking you)...they're just stressed and blasting out (not an excuse). They will calm down and realise it wasn't ure your fault. They need to be ultimately responsible.", "NTA. It's sad for the kid but it's not your fault. I would ask why the parents hadn't taught him not to bite random things in other people's houses but that seems churlish. \n\nA year,  not your fault and not the arsehole.", "NTA - From the post you had no way of knowing what would happen. Leaving a deodorant in the open in your own house does not make you TA.", "NTA, considering modern companies put “DO NOT EAT THIS OR DRINK THIS” on most things designed to not be eaten, well, Nathan found out the hard way, that yes, you shouldn’t bite deodorant…..", "NTA obviously. \nTo think about it, I never bothered to childproof my house for guests unless they would specifically ask me (that happened never). I have no children, i don't need to childproof anything.\nAnd why on earth would you know about someones allergies if they never told you?\nI don't think you are responsible in any way, and there's no need to put blame in any direction. But still, I do understand the parents for their reaction. This is shock and trauma, they might never recover from this. People avoid other people and places for far less, and this is huge.", "NTA. How the hell did that parent let that kid run off to eat deodorant? This was in no way your fault.", "NTA!\n\nIt’s the parent’s responsibility. What the actual f*, what’s wrong with your friend?", "And then parents are appalled when everyone is saying every event is child free now. who eats deodorant? Nta", "NTA. I blame your friend solely on this for not disclosing his son's allergies and also for not teaching his son not to eat everything he can see. I've been allergic to anything citrus since I was a baby. So everything orange, lemon, lime etc was kept out of our house. Whenever I would have a sleep out, my mom always ensured that the friend I'm going to, that their parents are aware of my allergies. I'm 33 now, I am extra cautious of my surrounding. I've been in hospital a few times (and endless comas) due to my allergies of food stores not listing ingredients correctly. I always check ingredients and if I'm not sure, I ask my partner to taste it first. He's got a sensitive palate, and when he says I can't have that, I don't eat it. It's a struggle, but you do get used to it eventually.", "Sorry but who eats a deodorant stick. Ew\nAlso if you're child is fatally allergic to anything why would you allow them out of your site long enough to not notice the the ingestion of something, its just plain obliviousness. Not a great trait for early parent hood. \n\nNot to judge the parent but you aren't the AH here.", "The friend is whipping up a frenzy in blaming you to deflect from the fact that he fucked up as a parent.\n\nHe lets the kid roam a non-kid friendly house (and OP is not to blame here, because he has got no kids) In this case you have your kid play where you can still keep an eye on him. he failed to do so and the kid is in hospital because of his dad.", "NTA. How could you have been expected to know about their son's allergy? They should have let everyone they knew know about it as soon as they found out about it so that they could take all necessary precautions. I hope Nathan will be ok.  It is not  your fault.", "I’m gonna suggest you jump the gun here and talk to an attorney and be prepared for the next attack by this former friend.", "NTA parents are responsible for their children. If they're little pricks with no sense, keep them on a short leash. There are all sorts of dangers in every house, at my mums I asked her to move the knife rack higher so my daughters wouldn't reach it. I'm the parent, I have to look out for these things. \n\nYou left a single f**king deodorant out and that stupid little shit ate it. If you had left a gun out, sure, you'd be liable.", "This is all your friend’s fault. he should’ve been watching his kid if he blocks you, so be it. If he’s going to blame anyone, he should blame himself. You didn’t put that child in the hospital. Don’t do that to yourself. This isn’t your fault.", "NTA. even if you knew the kid had an allergy *why would you/anyone think he would EAT DEODORANT.* ALSO, yes it sucks for the dad & this is tragic, but if your kid is prone to eating non-food items, WHY WOULD YOU LET HIM BE UNATTENDED IN A FOREIGN ENVIRONMENT????? that seems like lazy/neglectful parenting if he 1) knew(??) his kid eats non food items and 2) didn’t keep a closer eye on his kid\n\ni get the panic but in no way is it your fault.", "NTA. Your friend didn’t supervise his child properly. Anything could have happened and the fact that he just so happened to find the exact thing that could kill him is tragic but ultimately an accident. He could have gone through someone’s purse and drank hand sanitizer or found a bottle of cleaner in the bathroom. Putting away the deodorant might have prevented him from getting hurt but there was no why you could have known what was going to happen.", "If a kid is so young it eats deodorant it should not be going to go to the bathroom unsupervised", "NTA. Nathan's condition is tragic but 1) you didn't know about his allergy, and even if you did 2) how is it your fault the kid decided to chow down on a stick of deodorant? Deodorant is very obviously not food! Most children outgrow the stick-everything-in-their-mouth phase by the time they're in school.   \nIn short, you could not have anticipated this, and if Nathan was known to eat things he shouldn't his parent should have warned you ahead of time so you could Nathan-proof the house or kept a better eye on their own kid.", "NTA. How the hell would you have known? And how old is he that he would eat deodorant?", "I have 4 kids, and numerous nieces and nephews not once did they eat the deodorant, and non of them ate the fancy and fun looking soaps we had. They never ate the good smelling lipgloss/lip-balm.  The worse thing they ever did was get a tube. Of icy-hot mixed up with a tube of hand lotion. (The child was about 4, and went into my mom’s bathroom and saw both tubes side by side ). \n\nThey should have also been watching their child.", "You're definitely NTA\n\nIt's your personal space, and you weren't aware about his allergies, I'm sure your friend may not have known about it either. This was really a freak accident.\n\nAlso, I know one of the things people are saying is \"the kid should have been supervised\" but honestly, kids can do the craziest things, really not blaming your friend either, even a parent who supervises their kids well can have something happen to their kids,  it really doesn't take much. I'm not a parent but I know there's a lot of responsibilities for taking care of kids.\n\nHopefully the child has a speedy recovery.", "NTA. \n\nI have to ask how old was this kid? Unless he had PICA or something why would he eat deodorant? I mean what scent was it that it was THAT appealing?", "NTA obviously. Nathan’s parent is freaking out and stressed, and looking for anything to blame, mostly because they blame themselves.", "NTA, parents are guilty and trying to shift blame onto you for their own conscious sake", "NTA. Besides the allergy, your friends kid shouldn’t be picking up random, non edible objects and eating them. Your post doesn’t mention how old the kid is, but it’s still the parents responsibility to teach their kid what is and isn’t food.", "NTA, if the kid was stupid enough to eat random shit ,then he's taking out the stupid genes himself. It is not your fault.", "NTA. This situation is really sad for everyone involved. Here's the thing, it's not your  kid and so many kids DO NOT eat deodorant.\n\nHonestly, a parent is responsible for their child's safety. I agree with the earlier commenter about the parent not being ready to accept responsibility for the role they did (not) play in this tragedy.\n\nIt would not have mattered if you rolled in asparagus or turkey juice. I am glad you found scent(s) you enjoy.", "NTA\n\nIf a child is young enough to eat something like a deodorant, then that child is young enough to need eyes on him at all times, especially in someone else’s home.", "How old is Nathan? I'm assuming that you had the lid on the deodorant. Wouldn't that be difficult to take off? You would think he would know at that age not to eat deodorant.", "No A-hole here.  \nWe don't know how old Nathan is. OP should have considered the risk. He did, after all, hospitalize a kid. The parent is just worried they get a pass for overreaction. Hell I would murder the one who did this to my child. JK", "If this is legit, NTA but be prepared in case your friend tries to sue.", "NTA\n\nI understand your friend's stress but you did not know about his son's allergy and you did not leave the deodorant out for the child to eat. \n\nIt's a horrible event but it doesn't make you an asshole.", "NTA if the child is so \"young\" they would eat a deodorant they shouldn't be left unsupervised at all. And even then how would you know about some random undisclosed allergy? \nId be angry at the parent for not telling you.", "If this is real - and I'm having a hard time believing it is - NTA.\n\nEven my under age 5 nibling knows not to eat deodorant. Knowing or not that someone is allergic to an ingredient in the deodorant is irrelevant because ... I mean ... don't eat deodorant.\n\nThe fault is not yours, it lies on the parents for failing to supervise their child. So many parents suddenly think they're off duty when they go to other people's houses, don't keep an eye on them, then go all whateves when something happens.\n\nHope the kid will be okay. (Assuming the kid actually exists.)", "Exactly. The only way to be 100% sure a kid doesn’t get into something they’re not supposed to in your house is to not let children into your house. Little kids are basically suicidal.", "I read Neanderthal", "You're probably right, but I hope the friend realizes this and apologizes. \n\nYou look around for possible allergens everywhere you go because you're your child's parent and *you* take responsibility for your child. \n\nI mean, it's one thing not to leave glasses of poison sitting around or knives on the coffee table, but leaving your deodorant on your bathroom counter? That's not negligent! The kid's dad didn't even *tell* OP that his son is allergic to it; if he had, OP would have put it away and nothing would have happened. Instead, the dad just let his young son wander OP's house.", "No epipen either?!", "Does your kid eat non food items like deodorant", "I think it’s fictional.", "Yeah this feels.... not real", "My son took a bite of deodorant when he was 1. I think I was cooking dinner, and he wasn’t allowed in the kitchen when I’m cooking. I realised I hadn’t seen him in a minute and went to check on him and found him freshly chewing it. I cried, kicked myself, called poison control, and then called my mom. Now the deodorant stays locked up 🤣. But he’s NEVER gotten into anything at someone ELSES house because 1. He’s a baby and should be supervised 24/7 still and 2. I assume that their house isn’t baby-proofed. I’m very curious to know how old this “child” is to be able to roam someone’s house freely without supervision, but also eat deodorant.", "Yeah, I’m so confused. Even if the kid thought it was food, he shouldn’t have been eating random stuff at someone’s house without permission. The only kids I know who would do that are 2 and under or have pica, in which case, again, the parent must make everyone aware and also be supervising their kid very closely.", "I've had a discussion with a neighbour couple of mine. We had a lot of stray cats in the area I grew up in. There was a program in place that would spay/neuter a litter when found, then bring them back (shelters are full). So my dad and I kept a bowl of kibble under the roof of the shed *in our garden*. Behind a *closed* gate.   \nThe neighbour couple demanded we stop feeding the strays because their 2-year-old might open the gate - which she could hardly reach - go into our garden, and eat the kibble. I wish I had a photo of the face I made when they told me this. I wasn't even being sarcastic, I was honestly confused when I asked them why they don't just teach their daughter to **not** go into our garden and **not** eat random stuff. It was like they had never even thought of that option.", "I mean, kids were eating tide pods at one point and that was years ago. Now it might have evolved.", "I’m like 99% confident that even my 3yo wouldn’t eat deodorant, but I also watch her like a hawk in other people’s homes cos I don’t know what they’re got lying around.", "I was thinking calling a lawyer but to sue them. They’re defaming his character and in their grieving/panicked state of mind won’t stop or feel compelled to retract and apologise without legal repercussions.", "I mean, they let the child unsupervised in a bathroom that wasn’t his.", "It does seem unnatural somehow. Or the writer is either AI or autistic?", "I’m wondering how old as well. The kid would have to be old enough to be able to reach the counter and have the dexterity to remove the cap from the deodorant yet not old enough to know not to eat deodorant.  I’m trying to imagine what age that could be unless there’s a developmental issue at play. \n\nOne time I accidentally put a tiny piece of deodorant in my mouth thinking it was glaze from a pastry I was eating. It was immediately obvious it was something I shouldn’t have in my mouth and I spit it out. I can’t believe this kid would have swallowed deodorant once he bit into it. And if his allergy is so severe that just having the deodorant in his mouth for a second can cause a coma the friend should have an epipen, should be closely supervising his child in unfamiliar places, should alert others in advance to the allergy when he is going places, and should be teaching his child not to put random things in their mouth.", "I mean if it’s a deodorant ingredient maybe they didn’t know beforehand he was allergic but still. If the kids young enough or has delays or a condition of some sort that makes him prone to eating non food things, then he shouldn’t be left without parent supervision or the explicit agreed upon supervision of another trusted adult. \n\nAnd either way, NTA but info: how old is this child?", "No I had no idea that he had any allergies.", "Can confirm I used to eat everything I could get my hands on my mom knew all the ladies at poison control", "100% fictional. It’s just all to ridiculous to be true.", "HAHA that is such a “funny in hindsight, traumatic at the time” kind of story! I have a friend who ate one of those silica packets from a shoebox when she was around 3 and her family never let her live it down. They wouldn’t let her open another new shoebox til she was a teen! 😂\n\nI can definitely see this being real, although I truly hope it’s not because it sounds like an awful situation. Distracted parent + danger child is always a recipe for disaster. I imagine the dad just feels crazy guilty for not watching him closer & it’s easier to deflect right now.", "Also, who eats anything in the bathroom?  I’m assuming that is where the deodorant was. \n\nIf the kid is that little that he knows no better than to eat random things in another person’s bathroom, he should be much more closely supervised. \n\nNTA", "I mean...they weren't. It was an online joke the news took seriously and ran with it. Nobody was actually eating tide pods.", "Ugh don’t remind me lol I feel sick thinking about THAT", "Seriously? This has to be the biggest over reaction I have ever seen. Imagine being you.", "Liz is losing her touch, man.", "How old is the kid ? If he has the habit of randomly biting things in other people’s bathrooms , then his parent should have supervised him at all times. Even if they had told you that he was allergic to something , you wouldn’t know that that ingredient was in your deodorant and that the kid would Eat it ! You would only try to keep it out of the foods you prepare and the living spaces.", "NTA\n\nIf the parents knew their child had a deadly allergy they should have informed you\n\nEspecially *before a meal*\n\nIm really assuming the ingredient is also a food product (like coconut or something), something a child who would eat deodorant would really have exposure to since kids don’t wear deodorant\n\nEd: want to be clear because like. This is a horrible situation and a child is involved that I really just think this is a tragedy and I don’t think I should be the one to point the finger at anyone. I think in the future you now know maybe don’t leave deodorant around because kids might eat it, but I wouldn’t have thought of that either to be honest. I just don’t think this should eat you alive really, do your best to support the child", "I did the same!! I had some really odd cravings too. My parents were baffled when they walked into my room, and at the age of six I had eaten an entire corner of our wall, from the floor until as high as I could reach.", "Yes, I can laugh about it now but it definitely traumatized me 😂 I feel like I have too many stories like that as a first time mom, but then I have to remember that I’ve had my baby every day, 24/7 for almost 3 years, and doing it alone for most of that so things are bound to happen. If this story is real, dad definitely does not want to take accountability. I know the feeling, having the urge to take your guilt out on someone else for “failing” as a parent. It’s hard to look at your mistakes and own up to them. It’s way easier to say, “Well you shouldn’t have left that out knowing a kid was coming!” Than to say, “Well, I shouldn’t have left my kid alone knowing I’m in someone else’s space.”", "They’re saying his negligence caused their son to end up in a coma. They’re saying it to people that previously liked and respected him, that’s what defamation laws are for.", "And your first thought, instead of, 'Oh wow, I hope the little boy is alright, what must they be going through', it's 'Get my lawyer, panic stricken parents of baby in coma aren't thinking straight and said some mean things about me.'", "accusing someone of intentionally harming a child, as the parents are doing, is not just someone being mean. they actually are defaming him (or is it libel?), and he absolutely needs a lawyer asap because they’re obviously going to sue him. he has every right to immediately try to protect himself. \n\ni think it is possible that you misinterpreted the point the other commenter was trying to make. everything online pretty much lasts forever, they’re maliciously attempting to ruin op’s reputation with anyone who googles his name as well as with their shared community of friends and acquaintances and accusing them of some pretty bad stuff. \n\nat the very least, a cease and desist letter from a lawyer or something similar (i am not a lawyer so i don’t know the possible courses of action here), is absolutely appropriate. grief doesn’t give someone carte blanche to lash out.", "Defamation is making false statements to 3rd parties that can hurt one's character, which includes libel (putting the statement in writing, like social media) and slander (making the statements orally)."]}