{"id": 31688, "submission_id": "183gtmd", "title": "AITA for not spending enough on an engagement ring?", "selftext": "My girlfriend (30F) and I (27M) have been together for around 3 years. We live in a VHCL area. I make good money (around $150k per year + c. $50k in bonuses) and have a good amount of savings. She makes less than me (around $60k) and has virtually no savings. Neither of us has any debt. I am from a relatively poor family so I’m feeling a bit of pressure from the big expenses likely to be coming up (i.e. wedding, purchasing a house) which I will be doing without parental help.\n\n\r  \nMy girlfriend and I talked a lot about our future together and we are both on the same page about getting married in the near future. We recently spent a good amount of time thinking about her engagement ring. The style, type of cut, 4 Cs, lab vs mined etc. We were both quite unknowledgeable about diamonds so had to do a lot of research.\n\n\r  \nShe was aware that lab diamonds were much cheaper than mined diamonds and expressed that she was happy to go for that as it would mean she could get a much higher quality ring than otherwise. We also went out to a few places to try different options on her finger, after which she decided on her dream ring. I never gave her a particular budget for the ring because I had done research on lab diamonds and knew that I could likely afford whatever she wanted. She has a habit of not really looking at the prices of things so I am quite certain at this stage she didn’t fully understand just how much cheaper lab diamonds were vs mined diamonds.\n\n\r  \nSince she had now decided on the ring she wanted, I went out separately and bought a lab diamond ring for c. $6.5k that matches exactly what she decided on.\n\n\r  \nOver the last few weeks, my girlfriend has probably been researching on her own a bit more and also speaking with friends about the prices of lab diamonds and has come to the conclusion that the ring I’m getting for her will be too cheap. She is now quoting the 3 month salary rule (i.e. for me that means I need to be spending c. $37.5k on a ring). I spoke with her on multiple occasions about how spending less on a ring means that we will have more money for the wedding itself / honeymoon and a house when we get around to purchasing one. However as soon as she spends time with her friends the topic comes up again and we end up arguing.\n\n\r  \nWhat frustrates me about the situation is that she seems hell-bent on spending more money for the sake of spending money. The ring will be exactly like what she picked out and she was incredibly happy before she knew what the price was likely to be. This has been going on for a few weeks now and honestly I am starting to have doubts creep into my mind about whether I want to go ahead with the proposal if she is materialistic enough to place more importance on a ring than the strength of our relationship.\n\n\r  \nTLDR: I am getting my girlfriend a ring that meets all the specifications she selected, but after finding out the price is likely to be less than she expected and is now upset. AITA?\r  \n", "created_utc": 1700907593, "permalink": "/r/AmItheAsshole/comments/183gtmd/aita_for_not_spending_enough_on_an_engagement_ring/", "score": 16, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I purchased an engagement ring for $6.5k that meets the specifications my girlfriend initially picked out from a store, however she now thinks that something around this price range is too cheap and that I should be spending more.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "The three month salary rule was promulgated by jewelers.\n\nThe fact that the only thing your fiancee doesn't like about the ring is that you aren't spending enough on it, and that makes it unacceptable, gives you a really good insight into her values, her level of materialism, and the extent to which she's influenced by/shares the superficial values of her friends.\n\nWelcome to your future.  You might want to rethink this.\n\nNTA", "i learned this on the internet about this exact shenanigan:\n\nif your partner ever says *\"the ring is too cheap\"* and wants you to buy a (way) more expensive one,  you should cancel the wedding.\n\nwhy?\n\nthis won't be the last thing that \"is too cheap\" in your future life together, and no one would be happy about that.", "NTA - It's a shame that the resell value of the ring is not going to be good, but it's cheaper than a divorce later on.\n\nThe fact that your gf choose the ring she liked, and does not like it now, because of the price is insane and the proof that she lets her friends influence her.", "Dude.. do you love her? Does she love you? If the answer is yes, then you should be able to give her a Cracker Jack ring and you would both be happy. I wish you both nothing but the best! But YNTA.", "NTA\n\nNo one...NO ONE needs to go into debt to pay for a ring that is supposed to symbolize the love and commitment of a partnership and not how much you can tell your friends it cost.  (Even if you wouldn't go into debt for it that's a ridiculous price tag expectation)\n\nThat \"three month salary\" thing needs to die.", "Nta\n\nShe wants you to spend 1/5 your yearly salary, or over half her own, on a ring? There's already the expectation that you are paying for whole house and whole wedding etc?\n\nShe got to pick out her own excessively ring, then figured she could have demanded something even more excessive. \n\nShe sounds materialistic as hell. \n\nI'd take a little bit to ask yourself if she's even the type of person you want to spend your life with. What happens if you can't afford her anymore?", "Red flags everywhere! NTA 37.5k is absolutely absurd at your income.", "The three month rule was created by advertisers. It is not a rule. It is a campaign slogan designed to make you spend more money.\n\nThe size of the ring offers no guarantees of the quality of your future together. Working out where your values lie around the issue of money and spending will certainly help.", "NTA.\n\nThis is not a promising sign. Her having a habit of not really looking at the prices of things might be an annoyance now but could turn into a serious issue when your finances are legally joined.\n\nI’m not telling you that you should call things off or anything like that. But I AM telling you that I’m giving your fiancée some serious side eye for thinking you’re not “spending enough” on a ring. I mean, if she wants to walk around wearing something that is the cost of a new Camry on the daily but could slip down a drain, I guess that’s her call… I’m also just not impressed by people being so easily swayed by DeBeer’s marketing tactics.", "NTA. It's really a shame that the two of you found a ring that she loved.... until she talked to her friends and they said that the ring should have cost more. I don't know if you can still reach her underneath the weight of the wedding industrial complex she's getting buried under to get her back to her original standpoint. Perhaps ask her calmly if she'd rather have a $37.5k ring, or not be engaged (or in a relationship) to you anymore. Because that's what it's coming down to.", "NTA \nUgh....money always bring out people's true nature... From what I've seen of other women as a woman myself, she will definitely use your money like her own... \nSpend time with her and explain to her how important life is when you two are together than the price of the ring.", "Nta and I wouldn’t bother with the ring. Just my move though", "NTA\nNo savings can't make up her mind on prices of things clearly listens to what ever crap comes out of her friends mouths instead of being an adult and deciding for her self all signs of a difficult future of arguments you are correct to question the marriage.", "NTA, please take your time and really think about this. Marriage isn’t about a ring, it’s about the lifelong commitment to each other.. She should be happy with whatever is given to her.  Being more focused on the ring and price it’s a big red flag", "Ask for a prenup that stipulates she gives the ring back if you split up- see how she reacts NTA", "She is showing you who she is. She may have 30 years on this earth, but she acts like she is 15.\nNTA.", "You and your fiancee need to talk, communicate about finances.\n\nThe idea that a man spends 3 x his monthly salary on a ring was promoted by those who sell diamonds, engagement rings.  \"Isn't your fiancé worth it?\"  \n\nYou are absolutely correct the almost $40K on a ring is a heck of lot of money.  Ther sale value of the ring will not be what you paid for it.\n\nIf you and fiancee can't come to an agreement about the ring, you and she need to rethink your long term relationship.\n\nNTA", "NTA - there are way more important things to be discussing before a wedding than the cost of a ring. If this is her concern, this is a major red flag. What else won’t be good enough? \n\nSounds like she more concerned about what others think than about what that money could be used for in your future together. Tells you a lot.", "NTA and you should definitely rethink this relationship", "NTA. I think it's really odd how fixated on cost she is. As others have said, the three month rule is nonsense. If she's decided she'd prefer a natural stone, that's something you can discuss and workout a budget for, but 37k just sounds insane to me.", "DeBeers made up the 3-month rule for advertising as a way to sell their diamonds.  It’s not a real “thing”.  If she forces you to spend that much money on a ring, RUN.", "I think the fact a formula even exists regarding how much a man should spend on a ring is efing stupid. Wedding culture is stupid. If she is offended by whatever ring you take the time to buy,  you might end up dodging a bullet bigtime by not marrying at all. If you do go forward with this bird, get a pre nup please. If she expects this sort of ring, I can only imagine the following expectations of \"destination wedding,\" the type of house in a big pretty bow, and the SUV she will want hauling your kids to Montessori before her yoga and basket weaving/scrap booking classes.\n\nMy opinion only. Nta", "Nta let her go if that is the case.  Is she also following the rule bride's parents pays for the wedding?", "NTA. She is showing you that she unashamedly perceives any interaction no matter what it is, as primarily financial in nature. Sentiment doesn't matter, time and effort don't matter, even her own specifications are secondary to how much you spent to achieve them. I certainly wouldn't want to marry anyone who reacted that way to getting their stated desire.", "NTA. I told DH not to spend anything when we were getting married. He still got a $100 ring for me. Figured we could get nice rings on our 10 year anniversary.", "NTA - that’s a ridiculous ask from her. You two are misaligned when it comes to finances and that doesn’t bode well for a happy marriage. She regularly doesn’t look at price tags… 🚩🚩", "NTA but both you and your girlfriend need to take a hard look at the people around her. How can she be happy with the ring until her friends tell her otherwise. Are they really friends or secretly enemies? Not everyone around us is happy for our blessings and she is a fool to pay them any mind. \nYou also need to decide if you want to allow her so called friends to dictate things in your relationship. If this is a common pattern, believe it will continue into the wedding planning and your future. Don’t make any rash decisions but take time to reflect and then decide on how you can talk to explain your views. Communicate but also you may want to hold off the engagement until you are in the same page about outside influences.", "NTA. Put all wedding plans on hold until you are on the same page about finances, and/or so you can decide whether you want to spend your life with a woman who will decide that exactly what she wanted isn't good enough because it doesn't have an arbitrarily inflated price tag.", "37k on a ring is insanity.", "NTA.\n\nLove is not measured by money.\n\nYour girlfriend needs better friends.\n\nDo not go forward with this relationship unless you are on the same page with finances. It is a huge defining factor on whether a marriage will survive.", "NTA, end the relationship or get a prenup. I am a female who unfortunately had many gold digger friends. I know her type and it gets worse. If you lost your job tomorrow then she would be gone. You need a partner that would be there for you not one who demands expensive things to be happy and show her status.", "So sick of hearing that so called rule. You are NTA.", "How about her ring is based on her salary. She sounds like a gold digger to me.", "NTA- Originally it used to be  marketed as 2 months salary…. \n\nYou might get a ‘bargain’ on a mined diamond 💎 with the 4 Cs she wants at an antique auction. So she gets the size stone she wants  at a price you want to pay. If she doesn’t compromise, then the marriage is in trouble.", "NTA nearly $40k on a ring is insane, unless you are a multi billionaire. Seriously think if you want to marry this girl, she sounds really affected by what other people think (her friends) if she is this shallow over the ring, the wedding planning is going to be a nightmare", "Do you really want to spend your life with someone that mercenary?  NTA", "NTA This my friend is what we call 🚩🚩🚩!", "Thats completely mad. 37k when you make 200? Thats basically a small car.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy girlfriend (30F) and I (27M) have been together for around 3 years. We live in a VHCL area. I make good money (around $150k per year + c. $50k in bonuses) and have a good amount of savings. She makes less than me (around $60k) and has virtually no savings. Neither of us has any debt. I am from a relatively poor family so I’m feeling a bit of pressure from the big expenses likely to be coming up (i.e. wedding, purchasing a house) which I will be doing without parental help.\n\n\r  \nMy girlfriend and I talked a lot about our future together and we are both on the same page about getting married in the near future. We recently spent a good amount of time thinking about her engagement ring. The style, type of cut, 4 Cs, lab vs mined etc. We were both quite unknowledgeable about diamonds so had to do a lot of research.\n\n\r  \nShe was aware that lab diamonds were much cheaper than mined diamonds and expressed that she was happy to go for that as it would mean she could get a much higher quality ring than otherwise. We also went out to a few places to try different options on her finger, after which she decided on her dream ring. I never gave her a particular budget for the ring because I had done research on lab diamonds and knew that I could likely afford whatever she wanted. She has a habit of not really looking at the prices of things so I am quite certain at this stage she didn’t fully understand just how much cheaper lab diamonds were vs mined diamonds.\n\n\r  \nSince she had now decided on the ring she wanted, I went out separately and bought a lab diamond ring for c. $6.5k that matches exactly what she decided on.\n\n\r  \nOver the last few weeks, my girlfriend has probably been researching on her own a bit more and also speaking with friends about the prices of lab diamonds and has come to the conclusion that the ring I’m getting for her will be too cheap. She is now quoting the 3 month salary rule (i.e. for me that means I need to be spending c. $37.5k on a ring). I spoke with her on multiple occasions about how spending less on a ring means that we will have more money for the wedding itself / honeymoon and a house when we get around to purchasing one. However as soon as she spends time with her friends the topic comes up again and we end up arguing.\n\n\r  \nWhat frustrates me about the situation is that she seems hell-bent on spending more money for the sake of spending money. The ring will be exactly like what she picked out and she was incredibly happy before she knew what the price was likely to be. This has been going on for a few weeks now and honestly I am starting to have doubts creep into my mind about whether I want to go ahead with the proposal if she is materialistic enough to place more importance on a ring than the strength of our relationship.\n\n\r  \nTLDR: I am getting my girlfriend a ring that meets all the specifications she selected, but after finding out the price is likely to be less than she expected and is now upset. AITA?\r  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. This gets worse with more important real life adult decisions. This has disaster written all over it. You can pretend you are the exception like everyone else in this situation thinks, and you can learn the hard way, or you can see the glaringly obvious red flags.", "NTA-The three month rule is BS.  Her friends are not good people if they are pushing you to spend more.  This cycle is not going to end if you don’t put your foot down now.  Now is the time to sit down and even do it with a counselor and say this money management issue is not working right now.  Also ask her if she plans on keeping her job after you get married.", "NTA. Take her ring shopping to find your wedding band that she will buy you - obviously you need one that’s $15K because that’s three months of her salary. See how she reacts.", "This three month rule is absolute nonsense. You are spending a good amount of money on this ring but what matters is you have chosen a style she likes. I would have serious doubts about anyone wanting to pay tens of thousands on a ring. And harassing you to spend even more.\n\nEdit - NTA", "Yeah imagine what it will be like when they’re looking at houses", "🏅🏅🏅🏅🏅🏅🏅🏅🏅", "I have to disagree on this one, I always had high expectations on an engagement ring (mostly from my queen of a mum) and my then boyfriend (now amazing husband) totally got on board with it, if anything he went even more OTT than I imagined. It’s a big thing. She’ll be wearing it forever. Don’t cheap out.", "Exactly", "Mine cost £70 and have been together over 30 years now", "To be fair, I've seen 15 year olds be more happy about a gumball machine ring than this woman is about a 6k ring. \nSo some spoiled 15 year olds perhaps yes.", "I don't think we need to think that far ahead. \nJust imagine the wedding itself if she's listening more to \"this is the engagement rule!\" From her friends, than being happy with a ring that looks exactly like she wants it.\nJust wait until the same friends pull out. \"This is your big princess day!\" Rulebooks. \n\nConverting the 6k price to local currency. I dropped my jaw. \nAt least here that would NOT be a low price on a ring. \nWhen you aren't the one paying. Demanding a ring that costs almost 40k $ is absolutely insane.", "Imagine carrying $38,000 on your finger 😳", "You can get the look you want for cheaper with lab diamonds or even moissanite. And then use the money for something more important. It only matters if you like how it looks not how much it cost.", "She'd be an idiot if she walked around with a useless ornament that expensive.\n\nAt best it's asking to be stolen.\n\nAt worst its a future $150 ring at a pawn shop because no one actually values it", "If my husband spent that much money on a ring I’d bring him to the psych ward for an eval. And I love jewelry. \n\nNTA"]}