{"id": 31746, "submission_id": "183ym0q", "title": "AITA because I canceled the road trip after a friend didn't listen?", "selftext": "Roommates second account, so its not on my main. On phone. \n\nTwo friends, Grace and Alice, and I would go on a week-long road trip. We took my car and the plan was to mostly camp (first and last night in a hotel). Grace and I would alternate driving, so the other could rest or nap when necessary. Alice doesn't have a license so she navigated and would therefore stay in the front seat.\n\n\nThat's where the problem arose, Alice suddenly put her legs on the dashboard, I asked if she could please sit down normally. She didn't understand that because \"this won't bother you, will it?\" I tried to explain what happens when you have an accident sitting like that and that I didn't want to be responsible for that. Alice thought I was joking so started laughing. I stopped at a gas station to continue talking. After a while she angrily said that she would sit normally again but she still didn't understand the problem. Grace and Alice then went to the gas station to get something. I stayed at the car.\n\n\nAt the toilet a little later I overheard Grace say \"I think it's nonsense too, but you know how she can be, when she's sleeping you can just sit like that\". When they came back I said that I wanted Alice only in the back of the car. This turned into an argument again. I did not say that I heard their conversation, I didn't feel like that. \n\n\nBecause Alice kept refusing to sit in the back, I called the hotel to cancel. This made them both very angry and they took all their stuff and called an Uber. I drove myself back home. At home I noticed a lot of messages and missed calls from mutual friends and family saying some unkind things. Alice had made a post on social media about what a terrible friend I am. I saw that they went camping before they blocked me.\n\n\n\nI thought this would be for the best, I did not want her to be folded up like a pretzel in an accident and lose her legs. It's my car so my rules and my responsibility if something goes wrong. But many friends and family think I exaggerated and perhaps I shouldn't have reacted that way. Maybe I shouldn't have canceled the hotel and gone home.\nAm I the asshole for cancelling and going home? And am I a bad friend?", "created_utc": 1700960577, "permalink": "/r/AmItheAsshole/comments/183ym0q/aita_because_i_canceled_the_road_trip_after_a/", "score": 59, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I canceled the hotel and went home. At first I thought this was a good thing to do, but many friends and family think I exaggerated. Perhaps I shouldn't have canceled the hotel and gone home. I am starting to doubt if what I did was okay.\nAm I the asshole for cancelling and going home? And am I a bad friend?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA that’s a really weird hill for your friend to die on. Oh no you don’t want for her to get extremely injured in case of emergency. What’s so wrong about sitting in a normal fashion.", "NTA. Regardless of the danger, get your filthy feet off my dashboard.", "NTA.  Your car, your rules. Putting your feet up on the dash IS dangerous.  It's also rude. And the fact these two brain-trusts not only disregarded the danger and the rudeness,  but made fun of you behind your back and planned to continue this habit was plenty reason to cut the trip short. \n\nI especially liked you making them get their own ride home. I bet they didn't put their feet up on the Uber's upholstery.", "Your car, your licence, your passengers, so your rules. \n\nIf the hotel was in your name, under your cc or whatever, and you were not going to be there, then you were within your rights to cancel.\n\nIf not, then I wonder why you chose to cancel and not leave the hotel issue to them. \n\nNTA.", "NTA you’re liable for anyone in your cars safety. If you felt you didn’t want to continue the trip after the argument then of course cancel the trip.", "car owner makes the rules….nta.", "NTA your car, your rules. Plus sitting like that is extremely dangerous", "ESH\n\nYou have every right to enforce safety rules in your vehicle, in fact, it's a very responsible thing to do.\n\nBut canceling the trip was a nuclear option. The post makes it seem like you did it without any warning. It would have been better to let them know that you were feeling strongly enough to cancel if they didn't want to do as you asked. Maybe they would have complied, or maybe you would have all decided together not to go. \n\nAnd your friend complaining about it on social media about it is an AH move.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nRoommates second account, so its not on my main. On phone. \n\nTwo friends, Grace and Alice, and I would go on a week-long road trip. We took my car and the plan was to mostly camp (first and last night in a hotel). Grace and I would alternate driving, so the other could rest or nap when necessary. Alice doesn't have a license so she navigated and would therefore stay in the front seat.\n\n\nThat's where the problem arose, Alice suddenly put her legs on the dashboard, I asked if she could please sit down normally. She didn't understand that because \"this won't bother you, will it?\" I tried to explain what happens when you have an accident sitting like that and that I didn't want to be responsible for that. Alice thought I was joking so started laughing. I stopped at a gas station to continue talking. After a while she angrily said that she would sit normally again but she still didn't understand the problem. Grace and Alice then went to the gas station to get something. I stayed at the car.\n\n\nAt the toilet a little later I overheard Grace say \"I think it's nonsense too, but you know how she can be, when she's sleeping you can just sit like that\". When they came back I said that I wanted Alice only in the back of the car. This turned into an argument again. I did not say that I heard their conversation, I didn't feel like that. \n\n\nBecause Alice kept refusing to sit in the back, I called the hotel to cancel. This made them both very angry and they took all their stuff and called an Uber. I drove myself back home. At home I noticed a lot of messages and missed calls from mutual friends and family saying some unkind things. Alice had made a post on social media about what a terrible friend I am. I saw that they went camping before they blocked me.\n\n\n\nI thought this would be for the best, I did not want her to be folded up like a pretzel in an accident and lose her legs. It's my car so my rules and my responsibility if something goes wrong. But many friends and family think I exaggerated and perhaps I shouldn't have reacted that way. Maybe I shouldn't have canceled the hotel and gone home.\nAm I the asshole for cancelling and going home? And am I a bad friend?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA and a very weird hill to die on. I wonder if your friends will insist on putting their feet up (gross) in the Uber.", "NTA. Google the X-ray of the Welsh girl whose hip joints ended up in different zip codes and send it to everyone who calls you an AH."]}