{"id": 3180, "submission_id": "z442pz", "title": "AITA for not \"babysitting\" my cousin on my day off?", "selftext": "Throwaway.\n\nSome background info: My (17f) aunt (41f) has a non-verbal, autistic son \"Jack\" (8m). He has trouble expressing how he feels and throws physical tantrums (hitting, spitting, grabbing people, etc.) whenever he doesn't get his way. He hates being ignored for over 10 minutes, so taking care of him is a handful. \n\nI'm a senior in high school and have this whole week off (conferences and Thanksgiving break). I missed two weeks of school because of personal reasons and have been working my ass off all week trying to catch up.\n\nNo one in my family celebrates Thanksgiving, so my aunt volunteered at the last minute to work today. Because of this, she couldn't find anyone willing to babysit Jack for 9 hours, so she made a sudden appearance at our house at 7am and explained the situation to me, then asked if I could take care of Jack for 8 hours. I refused and told her she should have either not volunteered to work, or volunteered earlier in the week. I told her I had to continue working on schoolwork, but she told me I could work while keeping an eye on Jack. I reminded her of Jack's neediness and said no work would be completed with him around. She then yelled at me and said that Jack was more important than my school work, but walked off with Jack anyways.\n\nShe sent me a text saying I was a \"selfish child that would get nowhere in life\" if I continued being \"immature\". She had apparently text my mother, too, because half an hour later, I got a call from my mother, who was pissed. She scolded me for forcing my aunt to miss work.\n\nI'm currently grounded for a month, I can't hang out with friends, and I have to do chores on the weekdays and weekends until Christmas Eve. I tried calling my aunt to apologize, but she hung up on me, so I sent a text, but it was left on read.\n\nI'm currently regretting my decision and want to know if I'm an asshole for not babysitting my cousin.", "created_utc": 1669351245, "permalink": "/r/AmItheAsshole/comments/z442pz/aita_for_not_babysitting_my_cousin_on_my_day_off/", "score": 505, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I refused to babysit my autistic cousin. 2) My aunt was supposed to work, but instead had to stay home.\n\n**[Check out our upcoming Reddit Talk with Iliza Shlesinger on Nov. 28th!](https://redd.it/z29rfu)** \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA \n\nThis is too much to unpack in one comment. But Jack isn't your kid and your school work shouldn't be impacted bc she failed to plan ahead. Please don't let them make you feel bad for this.", "NTA. Your aunt is an asshole here, but your mother might be the true asshole of the story. She has no business punishing you for this - poor parenting.", "So you were supposed to neglect your education because your aunt showed up with zero notice expecting you to care for her special needs child? This would be inexcusable unless it were a true emergency (e.g. someone needs to go to the hospital, house burned down, or something like that). Her failure to plan ahead is not your emergency. NTA.", "NTA. That's a lot of pressure to put on a 17 year old and very unfair to you.", "Obviously you are NTA, however your aunt and mother are both assholes. You are not obligated to take care of somebody else's child especially not one who's such high maintenance. Your aunt should have arranged for childcare. If your mother is so high and mighty on babysitting she should volunteer herself. Your aunt at least should have offered you some sort of compensation as opposed to trying to force it on you.", "Your main focus right now is your studies, not your cousin.  Seems overkill to ground you for saying no to someone that doesn’t give your the courtesy of a call and just shows up expecting you to drop everything and take care of a high needs child for free.\n\nNTA", "NTA\n\nYour Aunt was being selfish, and immature.   Your Mother was also completely in the wrong.", "NTA. You had school work to catch up on, and your aunt is an AH for assuming she could just show up and dump your cousin on you. Your mom is also an AH for grounding you.", "NTA.  No one should be forced to be free childcare for a special needs child.  They demanded then you said no, it doesn't matter if you had plans or not.  Then OP was insulted, shamed and bullied by 2 older females who fn should know better.  The punishment would make me never want to ever extend another courtesy for the Aunt because OP is being punished for not being a willing servant.", "NTA! She just showed up without even asking first?! This is a child that requires specialized care. Your aunt can’t expect you to drop everything to care for her child that requires more support and supervision than an average kid (note that this not the kid’s fault, it’s the aunt). \n\nAnd your parents are being major A-holes for grounding you like this. What kind of lesson are they teaching you here? That you should always put your self last and that your schooling doesn’t matter?! What jerks. \n\nDefinitely NTA, op.", "NTA, you really can't force kids on people like that!\n\nI'm mostly concerned about the boy though, he probably needs a lot of stability and care. Just throwing him around won't do much good I'm afraid.", "NTA. You aunt's poor planning and poor decision making caused her to miss work. He's not your child, you're a minor, and you had schoolwork. Your mom seems pretty vile for not only not caring enough about your education, but grounding you for this. I do feel maybe your aunt fed your mom lies to make herself seem better in this, but still doesn't excuse either of them.", " NTA-Your aunt forced your aunt to miss work. Her lack of planning is not yours to fix .", "NTA - Your aunt obviously showed up thinking you would agree and took it out on you when you didn’t listen to her. That’s on her. You are not obliged to care for your cousin and good for you for saying no. Your mom is a huge asshole for getting influenced by her sister and grounding you. I have kids too and would not put my sister’s needs before theirs. I’m sorry you’re going through this!", "He is known to be routinely physically violent. His mom knows this. Your mom knows this. Why are they OK with you being assaulted by your cousin? Why were you even considered an option? Age 8 may be young, but children can still do some damage at that age. Even if you had said yes and attempted to cater to his whims for all 9 hours, it sounds like there is still a solid chance of a physical interaction (hitting, spitting, grabbing).\n\nHARD NTA", "NTA - your aunt tried to force a situation on you last minute. That by itself is already unfair, you had no heads up, so no time to mentally prepare for it, so ofcourse, feeling cornered, you'd say no.", "There was nothing wrong with your reasoning, to not watch jack. You are also in no position of mandatory responsibility for him. You are simply regretting your mother’s harsh response. Keep your nose in your books, to better quality for scholarships and grants. Then get the hell out of Dodge.", "NTA. It’s not your job to care for your aunt’s child. Did she even plan to compensate you? Also she gave you NO warning. Your aunt is the AH, so are your parents for punishing you for it.", "NTA. It is not your responsibility to care for your nephew.  Your Aunt should have checked that a carer/sitter was available for her son before volunteering to work.  Your school work is important and should be your priority.", "NTA— People who aren’t students never seem to understand that studying is important.  And people with children too often assume that their relatives should drop everything to take care of their kids.\n\nI am sorry that your aunt put you in this position and that your mother is endorsing this attitude.  You should not have to apologize for having boundaries.\n\nYour mom is probably mad because your aunt was mad at her for not raising a more compliant daughter.  I think when everyone cools off a bit, you might try talking to her about how you felt your aunt was not being fair to you.   If she is going to volunteer to work, she needs to make sure you are free. And school is a student’s “job.”", "NTA\n\nWTF is up with your mom de-prioritizing her son's education? There's no excuse for that.", "NTA. You are not responsible for her kid and your parents are huge assholes", "NTA, I am so sorry this is happening to you.  You deserve so much better.  Your aunt is sickeningly entitled, & if your mom is enabling her.  Reading this as a mom makes me absolutely livid for you.", "NTA, and what the hell are they grounding you for? This is super ridiculous, I’m sorry for you. \n\nFirst of all, why didn’t your aunt call before she brought your cousin? I don’t understand these people who are just bringing their kid and drop them off somewhere. What if you were not there or had plans to go somewhere? Anyways you already had plans, you had schoolwork to finish, which is important for your future. And they can’t expect you to do your schoolwork while watching a child. \n\nIt is not YOUR problem that your aunt didn’t plan ahead. She screwed up and you are the one being punished for it, which is unfair. Sadly there is not much you can do against it, so I’m afraid you have to just get through next month.", "NTA, I wonder if your aunt gave your mom a different version of events.", "ah, NO  NTA -\n\nYour Aunt is an AH and your Mom is doing a great imitation of one as well.\n\nYour Aunt was responsible for missing work - you did not FORCE her to miss work, her being unprepared and volunteering to work prior to having a sitter secured is the reason she missed work.  She was incredibly rude and entitled in just expecting you to babysit just because you are off school - even if you didn't have homework to catch up on she should NOT have assumed that you would babysit. It is NOT your job - it is HER child. A child that requires a lot more time and effort to keep an eye on. You were under NO obligation -  YOU are a child, not even HER child - you are not a built in babysitting service. She didn't ask ahead of time she just expected you to do it.  WHY didn't your Mom babysit her nephew?  Was she working too?\n\nYou need to try to sit down with your Mom and ask her if you are expected to always do whatever someone else wants you to do? Are you not allowed to say NO or have any boundaries for yourself?  Ask Mom how upset she would have been and how much trouble you'd be in if you did not get all of your work done to catch up for school?  If that doesn't work you may consider showing your Mom this post and everyone who says you AREN'T the ah. Maybe that will wake her up and show her this was just so wrong on so many levels. \n\nYour Mom is being unreasonable and your Aunt is being an AH in calling your Mom, and not accepting your apology (that I really don't think you needed to give as you did nothing wrong so she isn't entitled to one anyway.)\n\nHang in there - you did nothing wrong hon. You ARE entitled to say NO, especially when the request was last minute and inconvenient.", "You did absolutely nothing wrong as this is not your child, not your choice and not your responsibility in any way shape or form. Shane on your mother and your auntie for trying to make you feel responsible for this child. That’s not how things work. NTA. If this continues to be a problem with these two I strongly urge you to see your school counselor. This is NOT OK!", "No, you didn't birth that child he is not your responsibility. She should pay for a carer for him while she works...", "YOU ARE NOT QUALIFIED TO TAKE CARE OF JACK! No one should be asking you to babysit. He needs a professional. At the very least a knowledgeable adult. \nNTA", "NTA\n\nIf she wanted you to babysit. She should have asked you before volunteering to work. Not just shown up at your house expecting to dump her kid on you.\n\nYour school work IS the most important thing in your life. Your cousin is not your responsibility. Your school work is your responsibility.\n\nYour parents are huge A Hs for grounding you over this.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway.\n\nSome background info: My (17f) aunt (41f) has a non-verbal, autistic son \"Jack\" (8m). He has trouble expressing how he feels and throws physical tantrums (hitting, spitting, grabbing people, etc.) whenever he doesn't get his way. He hates being ignored for over 10 minutes, so taking care of him is a handful. \n\nI'm a senior in high school and have this whole week off (conferences and Thanksgiving break). I missed two weeks of school because of personal reasons and have been working my ass off all week trying to catch up.\n\nNo one in my family celebrates Thanksgiving, so my aunt volunteered at the last minute to work today. Because of this, she couldn't find anyone willing to babysit Jack for 9 hours, so she made a sudden appearance at our house at 7am and explained the situation to me, then asked if I could take care of Jack for 8 hours. I refused and told her she should have either not volunteered to work, or volunteered earlier in the week. I told her I had to continue working on schoolwork, but she told me I could work while keeping an eye on Jack. I reminded her of Jack's neediness and said no work would be completed with him around. She then yelled at me and said that Jack was more important than my school work, but walked off with Jack anyways.\n\nShe sent me a text saying I was a \"selfish child that would get nowhere in life\" if I continued being \"immature\". She had apparently text my mother, too, because half an hour later, I got a call from my mother, who was pissed. She scolded me for forcing my aunt to miss work.\n\nI'm currently grounded for a month, I can't hang out with friends, and I have to do chores on the weekdays and weekends until Christmas Eve. I tried calling my aunt to apologize, but she hung up on me, so I sent a text, but it was left on read.\n\nI'm currently regretting my decision and want to know if I'm an asshole for not babysitting my cousin.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA \n\nI’m so sorry you are grounded for a whole month. That is terrible! Who shows up at 7am with a 10 yr old child with special needs and says here, take him for the day? She couldn’t send  a simple txt double checking and asking you so you can let her know? \n\nYou were focusing on your schoolwork. Can you explain to your mother that You had plans for your schoolwork and your aunt didn’t make plans with you prior?", "I think NTA but all actions have consequences. Apparently saying no had a bigger consequence then you realized. You never have to say yes to babysitting, but until you move out you might want to because this is what your reality is.", "NTA. Your aunt was completely unreasonable. She volunteered to work on a day when she had no childcare available for her son, and assumed that you would get her out of the hole she'd placed herself in.\n\nYou had schoolwork to do. Your education is absolutely more important than watching your cousin.\n\nDon't apologize. You did nothing wrong.", "NTA. There is a lot going on here but you do not need to be regretting your decision, whats so ever", "NTA - you are not responsible for her lack of planning. It was not an emergency, she volunteered and did not have childcare. Your mother is out of line.", "NTA - You are a student not a free babysitter, you focus on your school work kiddo.", "Nta. Wheres the cousin’s dad in all of this? Should he be the one caring for his kid too? O_o and your mom and aunt are one of the worst people. Grounding you coz you prioritize schoolwork. Thats not even your kid", "NTA and she should have some backup plans. Your school work IS important. Just as her working likely is, too.", "NTA, if your mum was so insistent that her sisters work was more important, then she should have looked after jack.", "NTA.     Why on earth would anyone expect a 17 year old to deal with an autistic child with serious n behavioral issues.  Plus, why would your mother be willing to have you jeopardize your schooling.  Your aunt is extremely entitled to do this.  I can’t fathom your mother grounding you for a month or at all for this.  Your aunt is extremely irresponsible.  Do you have a father to appeal to?", "INFO how is it that in a family that doesn’t celebrate thanksgiving, no one else could watch him? Everyone else should have the day off. Your mother could have done it", "NTA if your mom was so upset, why didn’t she babysit him? She’s the AH. You don’t have anything to apologize for. Good for you putting value on your education and your time.", "NTA and it's a shame your cousin is stuck with her for a mom. As someone who used to work in special education, kids like that are *hard* to handle but they don't need to be, so long as the people around them know what to do. \n\n\nYour mom is an AH too. You shouldn't be grounded for not wanting to babysit for 8 hours without notice. Was she gonna pay you??", "NTA. I may have missed it but where is Jack's dad? Why couldn't he watch him for the day? Your aunt knows if he's that needy that you weren't going to get anything done that day. And if you did watch him I highly doubt she would have paid you because \"family\" helps each other. \n\nYou did the right thing in refusing to babysit him. Your mom and aunt suck and should do better.", "NTA", "NTA\n\nShe tried to make her problem your problem.  Tell your mom next time she can watch your cousin.", "Why couldn't your mum look after the kid, or any of your other family members.\n\nYour school work is a priority and should come first.\n\n\nYour is a massive AHOLE.\n\n\nKeep working hard in school and have an amazing life, when your old enough move out and support yourself and life your life to the fullest.", "Soft AH. People with special needs children need lots of support from the community. They can't do it by themselves. Also, this is her job we're talking about, her source of income. The boy may be a handful, bit at this age he's not walking around breaking things and would probably take naps sometimes. You lost an opportunity to be kind to someone in need.\n\n As for the homework, you're mom could have written a note to teacher that due to an unexpected occurance it wouldn't be delivered on to e.", "What so because OP is a child she can just her son on the same morning - with no consent, not asking ahead of time to check what he is doing????\n\nShe didnt have to work Thanksgiving, she volunteered. Before doing so she needed to sort out care for her child. It wasnt an emergency and she had zero respect for OP but assuming.\n\nHis mothers punishment is a disgrace - but the teachable lesson should be to the aunt", "They indeed need a lot of support, but dropping at door without warning is a little too much isn't it?\n\nShe could have arranged it the days before, including some communication to the school. Then they could have planned for it...\n\nThe son is a 8. they surely go around breaking things....", "Lots of support, sure. Bent over hard enough to break, no. Aunt voluntered for work with no childcare planned. Poor planning on her part is not an emergency for OP. \n\nRegarding the homework and the rest, if it had been an emergency, or even her planned childcare had backed out - I might could see your point. But it wasn't, and there is no way that the blame for lack of childcare is the OP's fault as it is not OPs responsibiliry to ensure care for the child. Again, that would be the aunt's.", "Parents with special needs children need support, but that does not entitle them to demand that other people drop everything to support them because they've made a decision on short notice that keeps THEM from fulfilling THEIR responsibilities to THEIR child. \"I can't do it myself\" is not \"therefore you are now drafted to do it for me, and I don't care what else you were doing or what else you had plans to do, you will do my job for me for nine hours straight and you will do it with no notice and no pay.\"\n\nI would not bet he's not \"walking around breaking things\" - it is very possible that if he doesn't get 100% of his caretaker's attention he might have a meltdown and break things, or physically attack her. Not unknown behavior in autistic kids, not even in kids a lot less severely so than hers is. (I speak from experience.)\n\nAuntie lost an opportunity to behave like a responsible adult, plan her working life ahead, and seek out a willing caretaker, instead of throwing a tantrum because her niece did not drop her schoolwork - her primary job - to be her Personal Nanny and Servant on demand. For nine full hours - more than a standard workday. And Mom joined in as a flying monkey to punish her own child for daring to have other priorities than kissing Auntie's feet and begging to be permitted to dump every plan she had in favor of catering to Auntie's failure to plan.\n\nBeing kind is one thing. Being a pushover and giving up what should be your most important priority for yourself in order to cater to someone else's unreasonable demands is quite another.", "If the aunt can’t do it alone maybe she needs to find reliable childcare that isn’t from OP, who is still a child.", "People with special needs children need support from their community, yes, but I don’t know that that extends to expecting a 17 year old to babysit on the spur of the moment, especially when they already have responsibilities.  And the child is 8 years old, I believe, not 8 months (m standing for “male”), so he likely would not be napping, and would be walking around (hopefully not breaking things).", "I agree, it's the aunt's responsibility, but a favor and a little kindness goes a long long way. You never know when you'll be someone in need.", "We definitely have different ideas of how family members should help each other out.", "Getting a nanny for an autistic child could be so expensive that would negate the earnings for the day.\n\nIf the au t volunteered for an extra day is because she needs the money and fighting for it. Kudos for her.", "Have you ever babysat a child like the OP described? It really isn't something a teenager should be expected to do. My eldest has high functioning ASD and when we needed a babysitter, we paid a 20 something adult who had work experience with special needs.  It was better for everyone involved. \n\nNTA, OP. Your aunt and your mom are ridiculously entitled.", "Sending a note to school about late homework is one thing but its not just homework.... she missed 2 whole weeks of classes. That's enough time for entire topics to be taught that she needs to self teach herself so when she goes back to school she isn't behind and so it doesn't snowball. \nSchool is the equivalent of a job to OP. Her aunt should have given more notice so she would know to look else where for care. The baby is her responsibility. And helping out others is good but not when it disadvantages yourself like that.", "We've discussed this before on this subreddit: babysitting someone with autism when you are not prepared and ready for it is not only inconvenient, it can be dangerous. You won't give the right attention, or make him confused. he may not understand why you aren't happy to see him, or why you are at the PC working all day, you may not have the food he likes...\n\nThe kid will only get more and more frustrated making the chance of a meltdown bigger. Making it a bad experience for both of them.", "Good for you for standing up for yourself and taking care of your schoolwork. I'm 44 and in therapy because I can't stand up for myself and I allow myself to be bullied. \nI'm sorry you were grounded. Don't let it stop you from standing up for yourself in the future.", "NTA, but your aunt & mom certainly qualify.\n\nAnd, show this to your mom.", "NTA but kiddo I think you should look into staying with some youth social services near you and/or reaching out for help.", "Def NTA. You are the kids your schoolwork is important, and you are not a parent. It’s your aunts responsibility. Your aunt and mom are the AH for trying to push this on you, and for punishing you \nin retaliation. That is messed up.", "All of this is unfair to you. NTA - I don't care if you were just going to sit around and stare into space. Nobody should feel entitled to nine hours of free babysitting with zero notice--especially if they have an sometimes violent child who needs a lot of supervision. You train people how to treat you. You did the right thing. I get people are mad at you, but they are WRONG. You are RIGHT. Normally, I'm pro helping family and think kids should default to helping BUT NINE HOURS with NO NOTICE. No way.", ">I'm currently regretting my decision \n\n**Don't. Regret that you are being punished, but don't regret making that decision. It was the right choice.** NTA\n\nUse the enforced alone time to catch up on that study, then do some more study. If you have any time left over, you are 17 - old enough to start researching how to get a bank account without your parents, how to get loans for college, how to write a resume, how to best apply for housing, etc. If they want you to take on adult responsibilities, do it on your own terms.", "NTA. Just love when selfish immature people call everyone else selfish and immature when they don’t cater to their whims.", "NTA, they will keep forcing you to do this no matter your age and responsibilities.", "NTA.  Refuse the chores.  Refuse the grounding.  Tell your mom.  You will never watch Jack again.  She has lost your trust.  And your respect.  That if they keep up this \"punishment\".  Because you refused a surprise babysitting job.  When you had things to do.  You know how to make life miserable for all.   \n    \nBut.  When they tell you to do something.  Say \"NO\".  And don't do it.  Personally.  I would refuse even normal chores.  As long as they stick to their demands.  Hell.  They would regret the \"punishment\".", "NTA but your mother and aunt are.", "NTA YOUR aunt should have called ahead and your mother is wrong to have grounded you for this. You have nothing to apologize for. Your school work is your first priority.", "NTA and I would now permanently refuse to babysit for her. Tell her to not even consider you as an option.", "There are a  couple of students (8yr-11yr olds) at my daughter's school who have similar diagnoses and their teachers frequently have to lock them into special hallway vestibules that have zero items/decorations/movable objects to keep them safe. In their tantrums, they physically go after teachers & other students. One of them threw a chair at another kid in front of the entire 5th grade (my daughter's class). One of the younger kids walks out of his classroom and tries to escape the building FREQUENTLY, his oldest sister(she's in college) was telling me about him while we were waiting  for after school pick-up.\n  So OP is definitely NOT THE AH here. The younger cousin needs someone with more training to watch him when his mother can't.  The aunt could also ask the Para's or the schools special needs head teacher if they know of any program that would be better situated to provide childcare at a reasonable rate(or free for lower income) for her child. Some of the TA's /interns at my daughters school offer babysitting specifically to the special needs families within our school...", "You needed the time to catch up with schoolwork but even if you didn't you are not obliged to babysit. You did not force your aunt to miss work. She thought she was entitled to your time and just turned up. Your mother should be ashamed of herself grounding you. She shoule be speaking to her sister instead. Is your mother generally an abusive parent or just in this instance? NTA", "NTA - why didn’t your mom watch him? It’s incredibly rude to show up at someone’s house and make demands. She should have called to see if someone could watch her kid before taking on the extra work. This is 100% on your sister. I’m sorry you are being punished, that’s very unfair. You are not free child care.", " NTA. The entitlement of your aunt is ridiculous. She just expects you to drop all of your plans when she says so? And you’re being responsible- you’re behind on your schoolwork and you’re trying to catch up, which is the mature thing to do and will stand you on good stead for the future. \n\nNext- your punishment is way out of proportion. For a punishment that severe, I’d have expected you to have created some sort of chaotic debacle where several things were on fire, the police were called and you terrorised at least one little old lady. Instead, you had explained that you weren’t free to babysit because you had schoolwork. \n\nYour parents are in on this. You are being pressurised into what I presume is free babysitting because it’s difficult to find a babysitter for Jack. That’s not Jack’s fault and it’s difficult for your aunt, but that’s not your responsibility. \n\nPotential solution- lean into this. Make a fuss about how worried you are about your future so you’re prioritising your schoolwork over everything else. Oh, and your parents have said you have chores to do, so you have to do them. Oh wait. It looks like you don’t have any time at all to babysit. Ever again. Under any circumstances. Isn’t that a shame?\n\nCompletely refuse to babysit again unless an agreement is drawn up and signed that guarantees you a minimum notice period, right to refuse, and reasonable payment at the going rate for a local babysitter. Don’t let them take advantage of you just because you’re ‘family’.", "No your not, you where using the time to catch up on school work  you are not obliged to babysit, especially if your at risk while doing so", "NTA. Not your kid, not your problem. And If your mom was that upset no one would watch Jack why did she not volunteer?", "NTA. This makes me so sad. Assuming this insane punishment is a normal reaction from your mother, you should prepare yourself to get as far away as possible from her for college or whatever comes next in life without her financial assistance. I definitely envision her trying to trap you at home to continue assisting your aunt or with whatever else they might need. Your aunt and mom are going to be shocked when they realize you don't want a relationship with them in the future because of how they treat you like free labor now. Your nephew also isn't likely getting the support he needs if they are forcing him on you, so your aunt and mom are 100% the assholes.", "NTA but your aunt and mom are. Never babysit Jack again, even if they keep grounding you for it.", "NTA  As others have said your Aunt should have called ahead of time and asked. Your Mom should have respected your decision to work on your schoolwork. I also agree with trying to discuss it with your mother after a day or two. You may even consider writing your mother a note, text or email in which you lay out your view on the issue. In a written communication you can read-rewrite what you want to say. It also gives your mom a chance to read and then reread what you have to say. Try to be logical and not emotional. Do not be accusing but feel free to ask her what wrong you truly committed to earn a moth of restriction. \n\nSo (of course use your own word. This are just some suggestions)\n1) I was behind in my school work and had to use my time to catch up\n2) Aunt volunteered to work without asking me and she said no one else was willing to babysit.\n\t\tIf she had called me ahead of time she would not have waisted time showing up at the house.\n \t\tIt is a shame Aunt had to miss work but it is not my responsibility. I did not cause Aunt to miss work.\n\t\tI had not agreed ahead of time to sit for her.\n3) Cousin requires 100% of a sitters attention and can become violent; I could not do any of my schoolwork while watching him.\n\n4) Why are you mad at me? Please explain exactly what I did wrong. I’m sorry Aunt called you and realize she probably yelled at you like she yelled at me. I realize you probably lashed out at me because you were responding to her anger. I was hurt that she would call me a “shellfish child that would get nowhere in life”. If she would say that to me I can only image what she would say to you. Do you feel like Aunt does that her son is more important than my schoolwork? I know he is her son and should be her first priority. But I feel my schooling should be my first priority. I feel that Aunt owes me an apology for yelling at me, texting a nasty text and trying to get me in trouble for doing what she wanted. \n\n\nIf I were you I would let both your mom and Aunt know that you don’t want sit your cousin in the future. \n\nI have a good friend who has an autistic son. My son has Asperger’s. So, my daughter who is 8 years older than her brother knows how to deal with some of the behaviors that are quite common and some that are not so common. My daughter used to sit my friends son, But when my friends son started hitting and getting aggressive with my daughter I put a stop to her sitting. I told my friend she could not sit her son any more because he was lashing out. I got upset because my friend was aware he was getting aggressive. He was hitting her. \n\nGood luck", "NTA at all. Your aunt is a disgusting person who’s behavior is likely going to end up leading to you resenting Jack. Your mother is horrible for punishing you for this (if your aunt told her the truth about the matter.) I’d honestly go no contact with people like that as soon as I turned 18.", "I hope you plan on moving very soon?  Get that degree and bail.  Mom was wrong for yelling at you, auntie was wrong for ASSUMING her emergency was YOUR'S to handle.  IT never will be YOUR emergency, SHE had her son, SHE can manage her life without IMPOSING on you.  Take the punishment and stand your ground.  I bet auntie will learn to PLAN better for HER child.", "NTA but both your mom and aunt are", "NTA. The adults around you need to do better.", "OP NTA Her lack of planning is not your problem, she should have prepared for this with anticipation and your Aunt us not entitled to your time.\n\nThis was not an emergency where something unexpected happened, do not try to apologize anymore and be clear that you need an apology from her side after saying all those things to you and you won't take care of your cousin anymore if she doesn't apologize for the texts and be clear that you do it as a favor and not as an obligation and always can say no if you already have other responsibilities.", "NTA. \n\nWow. A month is a seriously long time to be grounded for anything, let alone wanting to complete schoolwork.\n\nYour aunt, knowing she has a kid, should’ve made arrangements for his care before volunteering to work. The audacity she has assuming she can require you to set aside your needs to accommodate hers. Your mom doesn’t seem to be any better.", "NTA\n\n> She sent me a text saying I was a \"selfish child that would get nowhere in life\"\n\nAs opposed to a mother who is so inept that her plan for childcare is an unwilling teen? Lol", "Nta. \n\nTroll her a little.  \n\nI suggest you look up a residential facility that accepts violently mentally ill children and send her a link.\n\nAnother possibility is that you find out what private care costs for children like her son, send her the salary info and tell her your rate is something like $300 a day with notice and $500 for holidays and last minute babysitting.  Send her a link showing its legitimately what people in this field are earning.  \n\nIf mom calls again, tell her next time, you'll accept the kid and dump him in her care.  She can spend the day trying to protect her belongings and avoid injury.", "NTA You should show this post to both your mom and aunt and have them read the comments.", "NTA and does your mother knows what predictions does your aunt have about your future", "WTF?!\n\nAs the parent of a teenager who's also behind on homework and passing in projects, good on you for having the work ethic and discipline to get caught up on all of your work, without needing to be prompted!\n\nYour aunt's assessment of you is __way off__, you'll actually go __very far__ in life due to these skills.\n\nIt seems that she was projecting how she feels about herself and her child on you, which isn't accurate at all.\n\nAs a parent, it's __extremely__ irresponsible for her to sign up for work or commit to __anything__ without having childcare lined up, regardless of the mental, emotional and physical needs of her child.\n\n__You__ didn't make her miss work, __she__ did. \n\nIf she and your parents can't see how mature and responsible you are, I hope you have other close family members and friends who do.\n\nAlso, just because you don't have classes, it doesn't mean that you 'have a day off'. Even if you had no plans other than to spend the day relaxing, you have a responsibility and commitment to take care of yourself and your needs.\n\nNot only did you do __nothing wrong__, you did __everything right__.\n\nAs an adult, a phrase I've learned to decline a request on my time is, \"sorry, I have another commitment.\" or \"sorry, I have another commitment, thank you for thinking of me.\" Sometimes I'll expand it with, \"thank you for thinking of me. That sounds like a lot of fun/a great opportunity/something you really need help with etc., however I unfortunately have another commitment and am not able to attend.\" __No one__ needs to know what your other commitment is.\n\n__Clearly__, you did __everything right__ and you're __NTA__.\n\nWhat ever the punishment is, like spending time with your friends, do as much of that during school as you can.\n\nHopefully, especially with Christmas coming up, the month will go by quickly for you.", "NTA Their reaction is a bit disturbing, they are grooming you to avoid saying no to them. Your aunt's lack of planning wasn't your problem.", "Nta. I do love children but even i would have said no.\nBesides his tendency for violence, imagine something happens to him?", "You'll get nowhere in life if you let other people's wants to override your schoolwork.\n\nNTA and you have nothing to apologise for.", "If your aunt doesn't want the responsibility of being a parent then she should've learnt to close her legs. It's not your job to look after someone else's kid because they've volunteered you. Nta", "And the aunt is a major AH for saying you’ll never be anything. Prove her wrong and do better. And don’t feel bad, your mom and aunt are just poor parents.", "I'm wondering whether aunt told mom the truth? If yes, then mom is crazy. \n\nIf aunt said, yes, I asked her weeks before and she said yes and then refused this morning....\n\nOP, ask your mom, please. Something fishy is going on...", "She's a 17 year old school kid who needs to focus on her studies. The boy is not her responsibility as a minor herself.\n\nHer mother is equally as awful, but her aunt takes the cake. And you're not much better.", "Her mother was is an even bigger AH for grounding her.", "NTA\nIt’s not like your aunt forgot she has a child who would need childcare while she’s at work. She just assumed that she could impose her lack of planning on family and make it your emergency. Totally not fair to put the care of her high needs child in the hands of someone not far removed from childhood themselves. Good for you for standing your ground!", "Yeah.... NTA. If aunt's work was so important, mom could have taken off. If Aunt just wanted Holiday Pay, she should have arranged child care earlier. \n\nSounds like Aunt is being immature and impossible to think someone had to drop everything to take care of Nephew.\n\nThe way your mom is reacting makes me think she told her to bring him over because \"she's not doing anything the last few days anyway\".", "So HER kid is more important than your education, but he's not more important than HER job?\n\nYeah absolutely NTA", "NTA, even if you didn't have work to do. She should've spoken to you about it first, and then accepted your answer. And your mom definitely shouldn't be punishing you over this.", ">She then yelled at me and said that Jack was more important than my school work\n\nIt's not Jack vs your school work. It's Aunt's work vs your school work. She thinks you should prioritize *her* work over your studies!\n\nYou do not owe her any apology, OP. She's self centered and thinks she's entitled to your time at the expense of your future. NTA. Your Aunt is TA.", "NTA that is frankly horrific. Your schoolwork is significantly more important than babysitting, even if your future somehow hinged on you looking after a child that was dumped on you without warning for no pay *yelling at you still would be incredibly inappropriate behaviour*. That is not how an adult should react to being told \"no\" to another adult, let alone a teenager they have interrupted the work of. \n\nYou should not be punished for an adult being unable to control their emotions or plan childcare.", "[removed]", "NTA. You have to understand that you are not responsible for this. And your parents are terrible people for punishing you for standing up for yourself. \n\nEvery aspect of this was wrong. From her “volunteering” to you being landed on this at the last minute. You really should send this thread to your parents so that they can see just how many people find their behaviour abhorrent.", "NTA the aunt is responsible for her childcare. She was fine to ask but taking her reaction so far clearly made her the immature party. The mother is problematic because your daughter should not be burdened as a high schooler to take care of your sister's child. And special needs children can be difficult to manage if someone doesn't feel comfortable or says no because of their own needs, that is understandable. It would be logical and normal to confirm childcare before last minute work changes. Then for the aunt to pout and be resistant to communication after the aunt caused all sorts of issues for no good reason. It would all make sense if the no was somehow rude but it's normal and good that the OP was advocating for themselves and their education. The mother should be ashamed because it is her job to support and advocate for her own child not her sister's kid.", "NTA- your mother is a neglectful asshole if she wants you to get behind on school work this close to the end of high school because her grown-ass adult sister doesn't know you need to arrange childcare BEFORE you make plans that require it. Your mother is 100% wrong and a bully for grounding you, and you will be more than within your rights to treat her like the bad parent she was once you're an adult and she can't control your life the way she does now. Don't apologize to your aunt unless it's under duress, and make sure you protect yourself from these selfish, thoughtless people once you are out of the house.", "Nta-but will not win this argument. But I have a suggestion, it will get you into trouble the end result might stop this in the future.  When asked to baby sit tell them I do not wish to if forced do as little as possible,  keep the children from hurting thier selfs and fed but damage and not doing naught things are not stopped and sugar not woth held she will not ask", "NTA. And I'm so sorry you're being treated this way by your aunt and your mother.", "Your aunt poorly planned this and expects you to pick up the slack? Hell nah. Why is her job more important than your education? NTA. What entitlement", "NTA and I would never ever babysit for her again. This is not justifiable grounding reasons", "[removed]", "NTA and this is an extremely excessive punishment for something that wasn’t even wrong. Your family is fucked up.", "NTA if you don't get your school work done this will impact your grades and further has she told everyone else who couldn't sit for him that they are also selfish? Or just you? Babysitting is a choice the only person responsible for that child is his mum you can't just show up at 7am without asking beforehand and expect someone to drop their own lives because you want to work overtime with no prior warning", "NTA\n\nBut I hope you're making plans to get away and be independent. Because it sounds like your mom and aunt view you as your cousins other caretaker, possibly his future caretaker when they are too old to care for him anymore.\n\nYou sound like you try hard to please them, because they actively make your life hard if you don't comply. Please look into counselling or any resources your school has for becoming independent after high school.", "NTA. You don't show up with your kid before the sun is even fully up and DEMAND someone watch them. If you have friends or other family you can stay with until you are 18 that's what I would do. I hope you have a job, college plans and some savings so you can get your own place the minute you are a legal adult.", "NTA. Dont apollogice with your aunt. She is the one Who is selfish, and childish. She need to wroup Up. \nYou are non abligation to take care of HER SON. And she dont ask you with time, dont give the option to said No. \nHer son as special needs, and she and your mother have to understand that the scool its important to you, and you have your own obligation and needs, and be a free babysiter in the last minut for a completa day somethimes its not gonna be posible.", "Yeah NTA\n\nYou didn’t force your aunt to miss work, her failure to plan is not your emergancy.", "Jack is more important than your schoolwork TO HER not you because he is not your child. Its probably for the best you didnt watch him because your aunt probably wouldve gotten into the habit of always depending on you when the work issue re occurs.", ">She then yelled at me and said that Jack was more important than my school work,\n\nNo it fucking isnt. School work is your way out this abusive hell hole youre in \n\nYour mother is an asshole here.\n\nYour aunt is an asshole here.\n\nYou're fine.\n\nIs your dad in the picture? Is he likely to agree elwith you.\n\nYoure 17, I'd ignore your mothers punishment. Can't even imagine my parents trying to pull that on me at 17.", "NTA! Your aunt is an A H for doing this, never babysit for her. Your mother is an A H for punishing you for your aunt’s parenting failure, never respect her opinion or trust her. I’m sorry you’re surrounded by such unfair, cruel people.", "NTA. Your school work is more important than being your aunt’s default babysitter. Your desire not to babysit this kid is also more important- he’s not yours, this wasn’t a true emergency, and your aunt has no right to your time. Your mother was an even bigger jerk for grounding you. You don’t have any power over what your mother does, but I think you should continue to refuse to babysit this very high needs kid. They’ll keep pushing you and punishing you in this, but it’s the only way to ever get them to give up.", "NTA \n\nThis wasn’t a work emergency. And you were prioritizing school. Their answer is to load you with more work?!", "As the father of a currently non-verbal 2 year old with an actual ASD diagnosis (that cost me about $2K), I don’t think any doctor would diagnose a kid at 8m.  Almost all kids are non-verbal at 8m.", "Aunt is also an AH for dumping her child who has clearly got high level needs on anyone not qualified to care for him and for not introducing a communication system for Jack so that he can express his needs. The frustration he feels is coming out as anger and he must be miserable. No flash cards, no iPad with apps for him to use which can assist with communication, is she even teaching him sign language? No wonder he lashes out.\n\n\nBottom line, she shouldn’t have volunteered to work without having childcare in place. As I understand it, most Americans are busy on Thanksgiving with some sort of celebration or gathering so rocking up on the day and expecting 8 hours of free childcare is ridiculous and sue knew full well that no work would be done with poor Jack desperate for attention and unable to explain what he wanted and OP too tired to safely look after him. \n\n\nBottom line, she’s the type of mum whose child gets neglected because she isn’t willing to do the work which is needed to make sure they have safe reliable care with a communication system in place. Poor OP and poor Jack.", "Ops  mom  and aunt are the  huge ah here.  \n\nYou shouldn't be  punished at all op.\n\nWtf you are NOT responsible  for your aunt s child.  She shouldn't have  confirmed a work shift  without  first securing a babysitter.  \n\nAnd as this is YOUR TIME and you were working  for  school  your mom is a huge AH as well. YOUR PRIORITY  IS SCHOOL  not a child  your aunt birthed.\n\n As far as I am concerned  even if you weren't  catching up on school  stuff  and just wanted to relax you  wouldn't be the ah as you have absolutely  no obligation  to babysit your cousin. \n\nNta", "Exactly, what mature adult volunteers to work without proper childcare. If it was sooo important why did OP’s mom go home and watch the kid?\n\nOP, you did the right thing. We all know if your grades suffered because you babysit you’d be grounded for that too. NTA", "Also I like the logic here:\n\n- she chooses studying over babysitting for free ->> she won’t amount to anything \n\n- she chooses babysitting for free instead of catching up with school ->> somehow that’ll maker successful??", "For REAL. I would not have answered the door at that time of day amyway.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "What eight year old is napping during the day to any extent that it would give OP time to complete her studies?", "Funny how people resort to comments like that when they don’t get their own way. If you’ll never amount to anything, why is she demanding you look after her child? NTA. I wouldn’t try apologizing again and go LC as soon as possible.", "Exactly should she fail at school because her aunt didn't think to plan child care?", "When OP packs up and leaves leaving no contact info she will figure it out."]}