{"id": 3184, "submission_id": "z45qtu", "title": "AITA for going home because of my sisters dog being at Thanksgiving", "selftext": " Throwaway. I'll (F33) preface this with I don't like dogs. My sister (F29) has a dog that she says her world revolves around. Which is fine, she can do her thing. I just have an issue when it affects me. It is a breed that sheds a lot. Like she regularly has dog hair on her clothes. I don't eat food at/from my sisters house. I've found dog hair in her cooking before so I gently pass on her dishes. Privately I have told my mom that I don't like her dog around food and I won't eat my sisters dishes.\n\nWe were supposed to have thanksgiving at my parents house, Neither my sister or I live at our parents anymore. I arrive a little early to offer to help and see my sister was already their. Well I walk in and see my sisters dog is at my moms house. I've never been at my moms house when my sisters dog is their. Well I also found out my sister had been their all day helping my mom cook. Apparently she had offered a few days earlier and my mom accepted. I didn't know this was happening. Next thing I know the dog is trotting through the kitchen. This whole situation was too much and I told them I wouldn't be eating this food. They ask why, I tell them why. My sister says i'm blowing things out of proportion. Mentions lots of people eat food prepared where dogs are nearby. I tell her i'm not one of those people.\n\nI just decide to go home. I leave the pies I made and ended up ordering chinese. When dinner was supposed to happen my phone was blowing up and I was told I should have just dealt with it by multiple family members. So AITA?", "created_utc": 1669356512, "permalink": "/r/AmItheAsshole/comments/z45qtu/aita_for_going_home_because_of_my_sisters_dog/", "score": 135, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The actions I took was going home for thanksgiving before it started because my sisters dog was in the kitchen. This might make me the asshole because its important to my family, especially mom, that we all gather on thanksgiving, but I didn't want to eat the prepared food.\n\n**[Check out our upcoming Reddit Talk with Iliza Shlesinger on Nov. 28th!](https://redd.it/z29rfu)** \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Gonna go with YTA. I don't think those Thanksgiving dishes were covered in dog hair after a few hours of the dog being there.", "NTA it’s not like you rubbed their noses in it it made them pick out the dog hairs. They know the dog makes you uncomfortable, and you left. If you were being dramatic or controlling, you would’ve stayed to argue.", "NTA. I’d say NAH, but then blowing up your phone is really offensive. It’s okay if you don’t want to share a space with the dog, that’s your choice and tbh I would’ve done the same. I don’t think it’s okay for them to harass you so that you can submit to their will.", "NTA and dog hair is gross. If your sister is covered in dog hair, it’s in her clothes and definitely on her sleeves, which end up in the food. If the dog is permitted in the kitchen, you know she was alternating between petting the dog, feeding the dog scraps, which is unhygienic.\n\nI guess she doesn’t regularly brush the dog, which would tamp down on the amount of flying puffs of fur, which means she’s become blind to the amount of dog hair in her life.\n\nI’m with you, I wouldn’t eat her food either, and wouldn’t have stayed to eat a dinner she had helped prepare. \n\nSo sorry you are dealing with this.", "YTA", "NTA. I love my dogs, but I also know not everyone does. Your Mother and sister knew this and decided to accommodate the furry member of the family over you. There is a time and a place.", "YTA but only for your failure to communicate. \n\n1) You're approaching the this as if your stance is common  and therefore your family was being unreasonable. There are 69 million dog owners and 45 million cat owners in the US, most all of whom eat food prepared around pets. Most people would refuse to eat food in a home where pets were licking off the dishes but most people would not refuse to eat food in a home where a dog was present\n\n2) You absolutely have the right to have an atypical stance on eating around dogs but because it's atypical, you'll need to take the lead on communicating it. \n\n3) To avoid being an asshole you need to explain the extent of your aversion and ask for their support. I would use terms like phobia, as what you are describing falls into that level of severity. \n\n4) Your family relationships will do better if you own up to having an unusual and very strong phobia against eating around pets. Ask your mom and sister if they are open to accommodating you, rather than suggesting that they're unhygienic beasts and you'll be more likely to preserve your family relationships.", "Nope. Thanksgiving r for family not dog.", "NTA - I'm probably the equivalent of your sister with a dog that not everybody likes. If we aren't away for too long, we always leave our dog at home (can her dog be left? Does it have separation anxiety?). The dog clearly makes you feel uncomfortable and should be put away. Particularly if you're worried about hygeine. If we are away for longer we would bring a pen and put the dog locked in a room.\n\nIs this from a fear? Or more of a hygeine point of view? It's unrealistic to feel you will never have to see this dog as your sister is part of your life, but there are definitely ways to minimize interaction if you can. Perhaps if it's not fear based you could agree to be in the same room as it in small amounts to start provided the dog is on a lead and doesn't approach you?", "NTA - your mom at least knew full well how you felt about the dog and could have easily asked your sister to keep him out of the kitchen while the food was being prepared. She didn't, and of course once you said something, YOU'RE the one out of line. I hate to tell your sister that while there are a lot of people who eat food prepared with dogs around, there are just as many who won't, and shedding is a big reason why.. some people don't seem to understand that loose fur can fly off VERY easily, and it floats through the air until it lands - be it in food, a nearby surface, etc. Not to mention the fact that it's just plain unhygienic.\n\nMy sister moved in with us a few months ago and she has a cat who, while I love him - he's actually my icon lol - he sheds ALL the time. You can't pet him without getting loose fur on your fingers. I have to grit my teeth and bear it while he's on the couches and in the bathroom and stuff, but I draw the line at the kitchen. I refuse to eat food with fur in it, and while she did protest a little, she understands now that he needs to stay out. I would be SO mad if she pulled what your sister did.. your sister needs to learn that just because her life revolves around this dog doesn't mean everyone else's has to, and honestly, kudos to you for refusing to tolerate it. Let that be a lesson to them in the future.", "Yta. I am absolutely not a dog fan but unless they were wiping their utensils on his Butt, I think you're being pretty dramatic", "NAH. You would prefer to not share space w/ a dog. Now you can clearly communicate that to anyone who might be affected by your boundary. You have to be clear on your needs and express them if you want people to create a comfortable space for you.", "NTA. I have dogs. I love dogs. They are generally not allowed in the kitchen, particularly when I'm making food. Lots of people may eat food prepared where dogs are nearby, but that doesn't mean the dogs were running around in the kitchen shedding everywhere including the food. They don't eat food with HAIR (of any animal) it. Keep in mind that is something that could easily and swiftly get any place where food is made shut down, temporarily or permanently depending on the number of times such complaints get filed. You dealt with it by choosing to go home. Your family are AHs for telling you that. Your mom is an AH for not telling you your sister was going to be helping with the dog running around when she KNOWS your problem. Your sister is an AH for acting like it doesn't matter and everyone should just eat her dog's sheddings and not taking into account SAFE food prep habits. Tell your family this (politely) and that at least you left the pies you SAFELY made, as you could have just taken them home with you.", "Umm you could have ordered Chinese and ate it with your family if you weren't comfortable eating the food they prepared. YTA.", "NTA.\n\nDogs inside the house are disgusting, especially in the kitchen.", "NTA.", "Nta!! All these people saying you are would surely be the one demanding a manager if any type of hair was found in their food! I have 5 cats and 2 dogs. Anytime I cook, cats get locked up in a super large kennel, dogs are trained to stay out of the kitchen/eating area. Counters get wiped down, my hair goes up, hands get washed. Then cook. If you worked fast food or any food industry where you ever had to serve food and didnt keep these habits from it, that's gross. Hair of any kind in food is unsanitary.", "You definitely could have handled yourself better. Remember whose house you're standing in before you rise up in righteous indignation.", "NTA\n\nyou don't like dogs. your whole family knows you don't like dogs.\n\nwhy do so many people try to force something a person doesn't like on them? i don't like green beans, but when i go visit with family they all used to try to serve me dishes with green beans in them. like jesus fucking christ, people find out you don't like something and it's like they get some psychological condition triggered in their brains that tells them they MUST force the thing you hate onto you at every opportunity. it took my family years to realize that no, i just don't like green beans and i ain't never gonna like green beans. but i'm 40 now and a damn good cook and i just don't eat a dish with green beans in it(except for that green bean casserole made with cream of mushroom soup, but everybody likes that. gotta be the MSG or something)\n\nyou aren't the asshole. you don't like dogs, simple as. you removed yourself from the situation. you have that right, and they can stfu.", "NTA. Dogs don’t belong in kitchens. At all. Food handling certificate course says so", "YTA - that is really extreme to not eat food because a dog was nearby when it was made? Maybe you have some personal aspects that have created this level of issue, but your family clearly didn't know that. If you'd just arrived and asked the dog to be put outside you'd  be N T A but the food thing is dramatic as.", "NTA sounds like your sister has a messy house and the dog is not properly groomed either. I totally get it and you shouldn’t have to put up with the dog mess.", "\nA few dogs hairs won't kill you. But if previous dishes made around the dog have been absolutely covered in hair then i see the issue. Animals aren't allowed in restaurants for a reason. So if your grossed out by the smallest piece of hair then yes i would say youre being pretty dramatic. Especially since you didn't even bother to see the food or at least try it or check it out. Your sisters living space may be possibly smaller thus dog hair is more compact and floats around everywhere easier. Thus, this could be the opposite if your mom lives in a wider space or home. However, if this is just a load of hair everywhere, then i would say that you are being pretty reasonable. However, dog hair builds up over time before it gets out of control or covers the house so spending one day when the dog is in a clean house for 1 day is not gonna kill you. So although i am leaning towards everyone elses side, i dont know the actual amount of dog hair that disgusts you and that is being dealt with so i would say ESH.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n Throwaway. I'll (F33) preface this with I don't like dogs. My sister (F29) has a dog that she says her world revolves around. Which is fine, she can do her thing. I just have an issue when it affects me. It is a breed that sheds a lot. Like she regularly has dog hair on her clothes. I don't eat food at/from my sisters house. I've found dog hair in her cooking before so I gently pass on her dishes. Privately I have told my mom that I don't like her dog around food and I won't eat my sisters dishes.\n\nWe were supposed to have thanksgiving at my parents house, Neither my sister or I live at our parents anymore. I arrive a little early to offer to help and see my sister was already their. Well I walk in and see my sisters dog is at my moms house. I've never been at my moms house when my sisters dog is their. Well I also found out my sister had been their all day helping my mom cook. Apparently she had offered a few days earlier and my mom accepted. I didn't know this was happening. Next thing I know the dog is trotting through the kitchen. This whole situation was too much and I told them I wouldn't be eating this food. They ask why, I tell them why. My sister says i'm blowing things out of proportion. Mentions lots of people eat food prepared where dogs are nearby. I tell her i'm not one of those people.\n\nI just decide to go home. I leave the pies I made and ended up ordering chinese. When dinner was supposed to happen my phone was blowing up and I was told I should have just dealt with it by multiple family members. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Either NAH or E S H\n\nI get your POV and hers. Its your moms house, so your mom gets to invite who she pleases. She deigned to invite the dog, which isnt an asshole move when she knows how important the dog is to your sister.\n\n\nAt the same time, you get to decide what food you are ok eating. If you dont eat food prepared with a dog in the same house, then thats your choice and it sounds like it was a clear boundary you had before this event went down.\n\n\n\nHolidays where 2 people have literal opposite preferences are hard to navigate and someone will always lose. This time it was you. All in all sounds like it was just a family argument with no clear winning outcome. That means either everyone sucks or no one does.", "Eh kinda. You sound kinda entitled.", "YTA. I go everywhere with my dog and do not go places she is not welcome. If I was your sister I would chose never to see you again...", "YTA, you ruined thanksgiving over pet hair", "NTA", "YTA", "I don’t think previously finding dog hair in food cooked by her sister makes her dramatic in this situation.", "Where do you think dogs live? Weird response.", "If you would go NC with someone over them not liking something you are clearly over attached to, I think you need to be reevaluating somethings.", "NTA you’re allowed to remove yourself from a situation you’re not comfortable with. And I for one would not want to eat the food either", "Sorry, there* \n\nNTA", "YTA", "Dog hair... IN the food... That is literally so nasty. NTA", "As someone with many animals this whole post is hilarious. You ruined your own holiday bc you once found a dog hair in your food?? I mean you’re not an AH bc you didn’t do anything to anyone else here but come on OP, was that not a bit dramatic??", "NTA. Yeah, lots of people eat food prepared with pets nearby, but I can guarantee you that doesn’t mean they would be okay pet hair in their food. \n\nShe’s clearly okay with an unhygienic kitchen and food, but that doesn’t mean other people have to be. \n\nMy dog sheds A LOT, but I would want to crawl into a hole from embarrassment if I served guests food with hair in it.", "NTA she needs to groom the dog more and keep it away from food if it sheds so badly its ending up in food and I love dogs still don't want to eat their hair though", "NTA. I have a dog, and my dog is my world. But dog hair in food is a no go zone for me. \n\nIt’s disgusting, and no one should be made to feel uncomfortable like that.", "NTA. I love dogs. I have three of my own. I just fostered a litter of six puppies.\n\nDOGS DO NOT NEED TO GO EVERYWHERE. DOGS DO NOT BELONG IN THE KITCHEN. IF YOU ARE GETTING DOG HAIR IN YOUR FOOD, YOU ARE NOT CLEANING ENOUGH.", "NTA", "NTA, who lets animals in the kitchen while they’re cooking? 💀 imagine if you or anyone else was allergic", "nta, it is your prerogative to not like dogs or eat food made with dogs around, especially after the hair incident", "You did deal with it. You left without involving the extended family. NTA", "YTA, you can refuse to eat for sure, you can order take out for yourself for sure, but why leave and not stay with your family for the party?", "YTA. But sounds like you’ll be spending other holidays alone so good for you", "NTA, but I think indeed you blew it out of proportions. You have the right to not like dogs or wanting to be close to them, but in a family meeting that is not happening at your place, that falls out of your control. You either let everybody in your life know that in order for you to be with them there can't be dogs around, with the repercussions that may yield, OR you find a middle ground where you can actually live your life without it revolving around dogs not being nearby...I think it's a very weird hill to die on.", "D r a m a t I c", "YTA", "Yes YTA", "If you think a dog in the kitchen is a problem, wait until you find out how the kitchens actually function in most restaurants.\n\nYTA. Hating dogs or cats is always a red flag for me.", "Parties are about the people, not the food. \n\nHonestly it might have been better for you to have excused yourself for a quick fast food run so you didn’t starve while waiting for desert. You could have told your sister afterward about your sensitivity to her dog to avoid the issue next year. Totally get the provocation—situation seems disgusting to me, too. But not the best way to deal with it. Mild YTA. \n\nYour mom should have remembered and warned you so you could have eaten before you came or made an excuse, so she’s an AH, too for not listening to you and/or discounting your needs. Sounds like a large group was there, though.  Other guests had nothing to do with this, so I’m not giving an “everyone sucks” without knowing what they said in their texts.", "YTA", "YTA for causing all kinds of drama", "*There", "NTA. As pet owner I would Never have pets in the kitchen. \n\nAnd there are huge differences in how much dogs she’d an how their owners handle it.\n\nTwo of my aunts have the same dog breed. King Charles, which isn’t even that bad at shedding. \n\nOne allowed her dog in her kitchen one doesn’t. \n\nGuess where nobody likes to eat?", " YTA", "NTA I have two cats that aren’t allowed on the counters. When we cook for ourselves, we aren’t as cautious, but if I’m cooking for other people, I clean my kitchen, take a shower, and put on clean clothes first because I would be mortified if anyone found cat hair, and or on the food I made for them.", "NTA \n\nI love dogs however I do not like dogs in the kitchen. Dog hair gets everywhere! Even if your sister washed her hands it doesn’t matter if it’s on her clothes it’s definitely in the food. Gross!", "Yta. Grow up and be an adult.", "You’re mad because a dog was…..near you? Yes, YTA.\n\nI get not being an animal person, I get not wanting to eat at your sister’s, but you took it even further to trying to control the narrative of Thanksgiving based off the assumption that everyone other than you has poor hygiene. What if your parents actively enjoy the dog being around?", "Honestly, what about it is gross? Is it just the idea\nThat it isn’t an ingredient? Has an unpalatable texture? Cos it doesn’t carry bacteria, which is the most common argument. I just find it fascinating that people freak out about hair but not about a fibrous piece of bean/cabbage/sprout when they are actually pretty much the same thing", "Uh oh, because both my dog and cat come in my kitchen!", "Lol, it’s a home, not a restaurant.", "I don't think many people would like eating food with dog hair in it...", "i went to a relative's house - a casual visit and was informed beforehand. they had a dog too (which roamed around the house) and when i was drinking some juice, i caught some dog hair in it. (Even now I get a gross feeling when I think about it) I tried my best not to puke and to this day, I have never had any food/drink from their place again. My mom was disgusted too when I told her about it.\n\nTo some people, it maybe be dramatic but I totally, totally get what OP's saying and this will be a hill to die on for me as well.", "[deleted]", "Why do I feel like she’s lying about the dog hair in food as well? Sounds like she just hates dogs", "depending on where they are and the kind of dog, it also might be too cold to put it outside, especially when not in their home environment.\n\nOP YTA. If it bothers you this unreasonably deeply, and *you know your sister brings her dogs everywhere*, you should have known to ask/communicate about this beforehand.", "While I believe OP's NTA here, that's not true. Pets are family for plenty of people.", ">Remember whose house you're standing in before you rise up in righteous indignation.\n\nI think he remembered and that's why he shifted himself to the place he owns so that he could be righteously indignant there. The mom and sis are just pissed that he didn't stay at their place which he was uncomfortable with. He had an appropriate reaction.", "Good for you. OP didn't force sister to take away her dog, he just took himself out of an uncomfortable situation. Simple.", "same here. If my dog isn’t welcomed then I won’t be there. The thing is the dog was welcomed and OP thinks the world revolves around her.", "Because people don't want to eat dog hair? Seems a pretty standard thing xD", "It really does not matter.\n\nWhat matters is that something made her miserable. Much better she left rather than share it. I never stay anywhere that makes me miserable. That's not good for anyone.", ">Honestly, what about it is gross?\n\nHonestly? It's gross and disgusting. For me, that's enough explanation. It's the same as horror movies, ik a ghost isn't gonna haunt me but I get scared nevertheless.", "im sorry. sous chef cat is actually allowed in the kitchen.\n\ni can't imagine de-feathering fowl without her. that's her job.\n\nshe also bakes the deserts.", "I would personally love it if a dog isn't walking around the kitchen where food is made, kitchen or home", "I love dogs. And I would not care much about an odd dog hair in my food. Really. I am not at all squeamish.\n\nHowever, if someone is unhappy or uncomfortable by anything at all. They are fully entitled to leave the situation. \n\nI don't think anyone should stay and share their misery. That's not good for anyone.", "I honestly can’t decide between YTA and NTA.   I guess I can see both sides, more or less", "I love dogs but i wont eat something which can potentially contain dog hairs", "I have dogs and i love them. But i also have a friend, who doesn't like them. She tolerate my dogs, which is great, but not everyone likes animal. And that's fine, as long as they don't mistreat them. Op didn't mistreat the dog, they just doesn't like dogs. Does that still mean that they have to be uncomfortable?", "Lol and I always felt it was an instant red flag 🚩if someone said that liking or not liking specific things is a red flag. Not every one is the same. Not every upbringing is the same. Not every situation is.", "As someone who has found dog hair in my drink before (relative's place), I don't think she's lying. It's plausible.", "Well if someone's clothes are covered in dog hair it can easily get in the food (speaking as someone with cats it gets everywhere if your not careful)", "I 100 percent think she's lying because she knows she's overreacting. Certainly, she didn't have any evidence there was dog hair in this food.", "Nope. She is my closest family and if someone is going to go all passive-aggressive so that I can't bring them I would rather not deal with them anymore.", "Yes I get that, but why? Logically why? Like I’m not saying sprinkle hair on like Parmesan, but everything you eat has hair and skin in it? Eyelashes, eyebrows, skin dander- that’s just reality. It’s just you didn’t see those bits before you ate them. Would you also freak out of there was a fiber from a tea towel? That’s far more gross", "If you do it, don’t resent it. If you resent it, don’t do it", "Ok so it’s not based on a concrete concern? Just a feeling of grossness? Not having a go- i just don’t get it? I’m not bothered by non fact based scary movies either - all seems a bit over reactive to me", "No one should have to eat food that makes them uncomfortable. Idk that’s just the hill I’m willing to die on, I guess.", "[deleted]", "It’s plausible but the very person disdain this person has for dogs and her sisters dog in particular also make it plausible she’s just lying to justify her hatred.", "yeah, not denying that. It just seems a little to obsessive, many of the details just seem like a justification to her hate for the dog if that makes sense?", "right? don’t believe it not one bit", "So, your dog, is closer than your sister. Someone you can actually hold a conversation with and have grown up with all your life, and you'd cut them out over not liking something the same as you? People have differences, hell your dog has it's differences, but she isn't asking for you to put them down, just to be, well your own person every once in a while? At the very least to the point that it doesn't cause any harm, intentional or otherwise. My cousins dog is very lovable and the whole family adores him, but he likes to jump up on people. For that, we don't take him to formal events where he can ruin clothes. If your dog shed to where it could easily end up in food, you need to be the one staying at home, since you can't seem to spend a single minute without your dog which can actively ruin an event for people. As much as you love them, they can live without you for a single evening. And if you REALLY think your whole day will be ruined because you couldn't hang out with them for a couple of hours, you really need to find the root of your attachment issues.", "Because I don't want to eat non food things? Because I'm allergic to pet hair? You are honestly just being pedantic here no one wants hair in their food absolutely no one", "That's a good motto.\n\nHowever, sometimes we get pressured into doing something and find it hard not to be miserable. At least that's me. So I really try not to get bullied into doing something I hate because I hate sharing my misery.", "Can't speak for everyone but for me personally, it's just disgusting if I find something in my food that's not supposed to go in the food. I don't have issues with bean/cabbage/sprout but hair is a hard limit, be it dog, cat or even human hair. There's a reason why we don't comb our hair in the kitchen.", "Same. OP removed themselves from a situation where they wouldn't feel comfortable eating, I see nothing wrong here.", "We have to agree to disagree then. I have met of plenty of pet lovers who are assholes, not just to people around them, but to the pets themselves. \n\n>dogs are pets and people love them as much as they would a family member\n\nI agree. It's just that not all are those people.\n\n>then there’s those that don’t like pets which are the worst kind of people.\n\nYeah that's where you lost me. I am not into generalizing people like that. But you have your opinion, you do you :)", "She didn't say she found dog hair in the food this time. She saw the dog run around the kitchen and got uncomfortable (remembering the last instance i guess) so I am not sure what she lied about", "Could be who knows I love dogs cats etc but yeah not in the kitchen as they get their hair everywhere haha", "Well no one wants non digestible material in their food full stop. But most people aren’t so precious to ruin a whole day over a past experience.\nI’m not being pedantic- because I’m actually generalizing it to non food intrusions! It’s actually pedantic to have a melt down over a supposed pet hair as opposed to any other non hazardous inclusion. What about a piece of eggshell? That came clear out of a birds bottom!", "Absolutely - it can be bloody rough. that’s why I use that little ditty, helps me remember that doing shit that costs me more than I’m willing to sacrifice, is of no benefit to anyone :). This is why the cat sleeps on my bed but various relatives aren’t allowed to sleep in my house ha  ha ha", "It’s a funny one hey- I wonder if it is related to how we grew up? I grew up on a farm and there were regular incidences of unpredictable/ unexpected items in food ha ha. But if they were unlikely to cause harm, you just politely extracted them (from mouth or meal!) and set them aside- for example the odd feather or fish bone was to be expected. And I distinctly remember the batch of butter where the darn pat splintered", "She could have ordered Chinese to her mum's house. Then she still could have been sociable.", "People are allowed to be grossed out by different things....its that simple", "🤣", "Ok this made me chuckle, I grew up in a farm too! And I found out plenty of unlikely items in my food as well. I think growing up, I had the opposite reaction though. I didn't want that to happen anymore. I am very particular about my food being clean and devoid of anything unclean. I am allergic to few stuff too so that too may have shaped up my opinion.", "That would’ve been a huge AH move.", "Yeah but floating dog hair in the air could of made it into their Chinese!! No thank you 🤢🤢", "Absolutely- personally I am terrified of stick insects yet I’m perfectly accepting of my niece having a “pet” one.\nBut one should not expect one’s own irrational discomfort to dictate the enjoyment of experience of anyone else.", "Oh yes indeed! I can sniff out my allergies from afar! Tend to just give it a wide berth and aim to make sure it doesn’t go anywhere near my face ha ha", "And there is dog hair there", "Not if her mom OK'ed it. My mum would 100% rather have me there and eating alternative food than avoid an important fanily event because of dog hair. I think most non AH moms would."]}