{"id": 31852, "submission_id": "1855k0f", "title": "WIBTA if I kept my parents from flying to my SIL who is unexpectedly giving birth pre-term?", "selftext": "UPDATE: thanks for all of your input, I didn’t say anything to my parents, but they decided that unless something goes wrong they are only switching their flight back by one day. I saw a lot of comments that my SIL is 6 weeks early, she’s not. She’s 36 weeks (37 weeks is considered full term), the doctors are optimistic that the baby will be totally healthy (it was a normal pregnancy), just will need NICU to be sure of things like sugar levels and oxygen levels before being released. \n\nIf something is very wrong my parents will get on the next flight available, and of course there is no question about that - I didn’t make it clear in my original post that nobody was calling this a horrible emergency scenario from the get go. It’s scary, but 36 weeks isn’t a horrible scenario medically and the doctors were reassuring from the beginning that they believe the baby will be totally healthy, the NICU is a precaution. If there is some problem down the line my parents will get on the next plane. If all goes okay with the induction they will leave a day earlier than planned (5 days from now). \n\nI appreciate all the feedback, I am obviously hormonal and emotional at the moment and I posted here to get other perspectives so thanks for sharing all of yours, I appreciate all the honesty. \n\n—————————————-\n\nI live across the world from the rest of my family, about a 12 hour flight. I see my parents 2-3 times per year. \n\nI gave birth 2 weeks ago and my parents flew to help me with my 3 year old and newborn postpartum. It’s been really helpful and they’re supposed to stay one more week and then fly home. My son is obsessed with them and he has the time of his life when my parents come visit (twice a year). It’s been great and so helpful. \n\nMy SIL is due in a month with her first. She has a strained relationship with her mom and is very close with my mom. My mom promised her she’d be there for the birth, figuring with 6 weeks between our due dates it would work out. \n\nWe got the call today that my SIL water broke and my mom immediately said “I need to change my flight, I promised her I’d be there.” I love my SIL, we are very close and I don’t want to deprive her of the support she was relying on, especially with this sort of scary situation. But at the same time, I can’t help it, I want my parents to stay until the end of their trip. \n\nMy son is expecting them to be here for another week, and I’m only 2 weeks postpartum, I’m still healing, and also my mother’s helper is only set to start working for me next week. My husband works very long hours and I am nervous to take on my toddlers bedtime plus a newborn without any help at this point. \n\nMy parents live fairly close to my brother and SIL and will be able to be much more involved and helpful than they are with me since I live so far away. I really cherish when they’re here and I don’t want them to cut their visit short. My SIL will have their help whenever she needs in general. I only get it for this short time. \n\nBut also this is my SIL first baby and I truly want her to have the support she needs, I don’t want to be selfish about this. My parents didn’t even ask me my thoughts on it, so I don’t know if it even makes sense for me to ask them not to change their flight, but WIBTA if I did ask? I think if I was honest with them they would stay, which would leave my SIL without their help for her first week postpartum.\n\nETA : the doctors told my SIL that the baby will need to stay in the NICU for a bit after birth, which my mom feels means that my SIL needs her even more. Would love to hear from parents who’ve had baby’s in the NICU, is it especially cruel if I deprive my SIL of my parents support while her baby is in the NICU? ", "created_utc": 1701098947, "permalink": "/r/AmItheAsshole/comments/1855k0f/wibta_if_i_kept_my_parents_from_flying_to_my_sil/", "score": 1055, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) asking my parents not to change their flight, effectively leaving my SIL without the support she was counting on postpartum \n\n2) leaving my SIL without the support she was relying on postpartum after giving birth preterm\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO:\n\nCan your father stay with you and continue to help out for another week while your mom goes to SIL? Then your dad can fly back a week later and join your mom. Might be a good compromise option.\n\nLeaning N A H. The other commenters say you're being selfish, and you kind of are....but you're 2 weeks post-partum with a toddler and a newborn. It's understandable you're feeling this way. But I think your SIL could really use the support, and ultimately it's up to your mom.", "NAH. Your mum wants to support your SIL, but you also want the support you thought you were getting. \n\nIs it possible to talk to your parents, rearrange your mum's flight so she is there for SIL but maybe have your dad stay for the next week?", "NAH. She potentially won’t even make it back for the birth depending on flights and how long labor lasts. If the baby is in the NICU for a while, your mom can be there for them emotionally and to support SIL with extra care but can’t do much else until baby goes back home. I feel like the compromise would be that dad stays with you and mom goes home. Then maybe she can plan another trip to come visit soon as well. If this happened to me, I would be upset that mom wants to leave me when she said she’d be there to help me x amount of time.", "NAH\n\nYour mother sounds like she's set on this so regardless of how you ultimately feel about it, it'd be a good idea to see if that helper can start a week earlier. That or your husband burn some vacation days.", "Nicu parent here.\n\n\n\nOnly me and dad could visit baby and one at a time.  You have to remember there are multiple babies on nicu floor and the protocols are strict. This was precovid. No idea what it is like now. \n\n\n\nYour parents need to quarantine when they get back. Especially after an international flight before they go in, because other people's babies matter just as much as theirs. That is if they are even allowed in to the nicu. They should find out the protocols and requirements.\n\n\n\nNAH", "My son had a bit of a different NICU experience because he was admitted a month after birth having been home with me for that time but I can’t imagine not having had the support from my parents and in-laws I had while he was there. It’s terrifying having your child in the NICU. Our family/friends brought me and my husband food because we’d forget to eat or only survive on UberEats if they didn’t, they sat with him so we could go home and sleep or shower, they helped us figure out what the medical diagnosis his doctors were telling us about meant for his future, they listened and held me while I cried, they took on the burden of updating our close friends/family who we were giving Daily updates to so we didn’t have that mental load, my siblings sent little gifts just to help cheer us up, when we needed something they made sure we had it. As awful as it will be for you to have your mom leave early, from the sounds of it your SIL may need her more. That doesn’t mean you can’t still use your mom’s help or that you’re wrong for wishing she could stay, it just means that the situation sucks and there is no one good answer just one slightly less bad answer. Yes, you could definitely use help, recovery is hard as is caring for toddlers; but, what is also hard is giving birth early (so before you’re prepared) and then while you are recovering also having your child in the NICU while you wonder if they’re going to survive or if they’ll ever be a normal healthy baby. A month early isn’t as dangerous as it could be but baby still hasn’t finished developing, your SIL is giving birth knowing her child will only survive if machines keep them alive and even then they may have lifelong health problems caused by being born early. \n\nI’m so sorry your family is going through this, it’s hard and unfair for all of you. I hope you’re all able to get through this struggle safely and without any lasting hurt feelings. Would it be possible to sit down with your mom and explain how you’re feeling without asking her to change her flight? Or maybe she could talk to your SIL and see what she thinks? She isn’t the one who said your mom needed to change her flight, your mom is. What does your mom think?\n\nETA: NAH", "NAH no one is the asshole here, it’s a really tough situation where there will be no winners, it’s just something you will all have to get through.", "Your parents will not or should not be entering the NICU after flying. They could bring an illness in that could kill all the babies there. They can't help with baby. I don't see why your brother can't look after his wife for a week. But over all, this is simply something that your parents should not be unilaterally deciding. They need to ask your SIL what she needs. And they need to ask you what you need. They made promises to you both and they need to reach a new compromise. Your parents promise to SIL is equal to the promise they made you. I know I always felt like I was hit by a bus for 3 weeks after giving birth. Your SIL doesn't have another child to look after.\n\nI think new solutions are needed. Maybe your partner takes another week off. Maybe your dad stays with you for a week and you mom goes. \n\nJust a crappy situation. NAH.", "NTA. And I’m really sorry for the mean comments on here. People can be ruthless and unfeeling. Of course you want your mother with you. You’re postpartum and It’s your mom, so you have every right to feel how you feel. Whether or not you ask her to stay is really a function of how you want your mother to feel. She made a promise and wants to keep it. She’s probably very worried and will feel better if she’s with your SIL as soon as possible.\n\nRespect your own feelings and tell your mother you really wish she could stay. Respect your mother’s feelings and tell her to travel safely and to return soon.", "NAH. But this is one of those times where there are no good options. Either your parents go to your SIL OR they stay with you. I say that as I saw the comment your father didn't think staying without your mom was important, but you could also ask him to stay to see his older grandchild.  \n\nYour SIL is going through what you did, but with added worry and concern as her baby will be in the NICU when she gets released. And this is all up in the air, labor can go many different ways. \n\nLet your parents go, and be mad at the situation, not any person.", "NAH You have had your mom and dad for two weeks, seems like SIL on has your brother you and your parents for support. This is a scary time for BOTH of you but Thank God your child is healthy and home with the parents you. Anything can happen let your parents go and stay in touch by FaceTime and let your SIL snd sibling know you support them too. That’s what Families do especially in an Emergency. Best of wishes to all.", "NAH this is a rough time for your family and there are no good answers. FWIW our twins were six weeks early and spent 9 days in the NICU. It’s a tough time and while I was glad my mom was with us, there was honestly not much to do while they were in the hospital. The doctors and nurses had everything under control so the time we really needed help was when the boys came home. There’s no way your mom will make it home in time but can you compromise by having your dad stay until the mother’s helper starts?", "Info why can't dad stay and help and mom leave early?  They're a couple, but they aren't atrached at the hip.", "Nobody has asked why is the husband at work in these circumstances? Maybe he does live in a heartless capitalist system with no paternal time off, but why isn't the question being asked? Where's the husband?", "I needed the least amount of help when my kids were in the NICU. I needed more help when they got home. I'd ask your mom to hold off, but that's me and I didn't want anyone else with me during delivery.", "I have no judgement for you. You asked to hear from parents who had a NICU baby. I had a NICU baby. Let me preface this by saying that everyone’s NICU journey is going to be unique. \n\nMine came three and a half months early. I was a hot mess. My hormones were all over the place. My thoughts were all over the place just trying to get life done and NICU life done. It was extremely terrifying. Things change rapidly in the NICU and doctors honestly cannot always predict how a journey is going to go. For my son’s journey it was one small step forward, two giant leaps backwards. My parents were there to support me right after my son came. They stayed for a week. But then every weekend they came to visit me and my son in the NICU until he was released. \n\nIt is terrifying leaving the hospital without your baby. I had a meltdown shortly after leaving the hospital and realizing my son was still in there…even though I knew he needed to be there. It was hard. I would hate for anyone to be alone when that realization hits. \n\nI am so sorry you are stuck in the middle. Your feelings are valid.", "Why can't your husband take time off work? \n\nYou can't place your mother in this position. She promised your SIL", "NTA. Seems like a lot of the respondents haven’t had a NICU baby. Ours was born at 29 weeks, had some developmental abnormalities, and spent over three months in the NICU. An otherwise healthy baby, she just required monitoring to watch her ABCs and that she was eating. \n\nIt was multiple daily trips to the hospital for both parents, and no other family was permitted in (pre-Covid). In our time in the NICU,  most babies spent a day or two then went home, and only 2 babies that stayed there longer than ours with some significant birth defects. \n\nThere isn’t much your mom could do to help your SIL, and it seems like she has a  support system already in place where she is giving birth, whereas you do not. \n\nI’d just be honest with you mom on how you feel.", "NAH. I feel like you both need your parents at the moment. If both parents are at your house, let your mother fly home and dad can help you the next week.", "[deleted]", "NAH. It’s perfectly fine to what your parent to stay longer especially since you don’t see them often but it sounds like your SIL and brother need your mom now. \n\nAs for my experience, my twins were born at 26 weeks and spent time in the NICU. One stayed locally in the unit for two months, the other had to be moved to a larger one 3 hrs away due to a medical emergency for 3 months. I also had a 1 year old, a 5 year old, and 7 year old at home. My husband also works long hours and had to change his schedule around so he was home in the evenings more and not work overtime on the weekends so we could visit our newborn that was 3 hrs away. I also couldn’t drive for a short period of time because c section and had to wait in the evenings for my husband to drop me off to visit with the twin who was local. My family was helpful; my father and sister would take me up to the out of town twin or watch the kids while my husband and I went. I didn’t have much help in the day to day activities. \n\nMy point being is that your sister in law may not need much physical help (depends on your brothers work schedule, so she may need that too) but more emotional help than anything. Having your child in the NICU fighting for their life is one of the hardest thing for a parent and my mind went into some pretty dark places not knowing if they were going to be coming home. It’s also incredibly depressing having to be healing in the hospital with no baby while everyone else around you is coming to visit their new bundles of joy. I had to walk up and down the hallway to heal from my surgery and pass the nurses bringing babies to their mothers room and family bringing balloons and gifts, crying the whole time.", "YTA- in a soft way. Don’t put your mom in the middle like that. It’s her choice. She wants to be a good mom to you both but you have safely come through the birth of your second child and now she needs to support her son and his wife on the stressful events of their first birth.\n\nYou are assuming the outcome will be fine. If it isn’t, your mom will never forgive herself for not being there supporting them.", "I think it depends on the baby’s condition. Our first was born 5 weeks early and had apnea, so he would periodically just not breathe. Other than that he was perfectly healthy. This was 20 years ago,  and at the time parents were allowed in the NICU from 7am - 7pm. Our baby was in there a couple of weeks. \n\nBetween the doctors, nurses, and machines monitoring him, we weren’t particularly worried. We took advantage of the time to recover from a stressful pregnancy, catch up on sleep, and even went on a couple of dates.  We figured we should take advantage of having the best babysitters in the world since we weren’t allowed to be there at night. We were only a phone call away and made sure that one of us was in the NICU the entire time we were allowed. \n\nIf the baby has serious health complications, SIL will need a lot more support. Is she’s able to visit around the clock, she’s going to want someone to sit with the baby so she can eat and sleep. And maybe would want someone to take care of dishes and laundry at home. \n\nI think the most important part for her isn’t necessarily the time in the NICU though. She’s never had a baby and she’s going to feel worried and alone. Sometimes additional stress during the birth can affect the outcome. \n\nI totally understand why you want your mom, but it sounds like you are in a better situation than SIL. Maybe you have a friend or neighborhood kid that can help out during the week before the mother’s helper arrives?\n\nNAH", "There are two daughters who need help with two births of two grandkids.\n\nFortunately, there are two parents.\n\nYour father stays and helps with cooking and cleaning and playing with grandkids.  Your mother goes to the sister-in-law's.\n\nCompromise so everyone gets the support they need, and NAH", "Come on your rationale is selfish. I get it, but emergencies happen and this is one of them. You, at least have experience, as you have had one child already and you have a helper coming. Your parents won’t only be supporting your SIL they will also be supporting their son, your BROTHER. You made the choice to move away. You can’t hold that against them as further rationalization. \n\nYTA", "YTA\n\nI get that you're upset, but why is this a question? SIL didn't plan to have the baby early. Plans have to adapt to circumstances.", "NTA. If you have 2 parents, dad NEEDS to stay.\n\nYou’re 2 weeks postpartum. 2 weeks. Your mom can’t even do anything for the SIL since the kid will be in NICU. Plus in all likelihood she’ll miss the birth. If she wants to go, fine, but you need to MANDATE that your dad stays.", "YTA.  Under any other circumstances, I would rule otherwise, but this is an exceptional situation for SIL.  Her baby is coming 3 weeks early and will probably have several serious health challenges right of the bat.  Don’t be selfish.\n\nEdit: to correct baby coming 3 weeks early", "YTA\n\n6 weeks pre-term?   She needs the help more.\n\n&#x200B;\n\nedit: my daughter was born with a hole in her heart.  Closed by itself, but those extra days in the hospital were extremely draining.", "NTA\n\n\nThey live close by and she will spend plenty of time with them when they are home out of NICU. You are only 2 weeks post partum so them leaving now is a bit cruel. I would definitely talk to them before they change the flights because if you don't you will feel very resentful which will damage your relationship with your parents.", "Neonatal NP here (I take care of babies in the NICU and have had two preterm babies myself). \n\nPlease don't ask them to stay. Your SIL is going to need support right now, and it sounds like your mom is a good support for her. It was terrible having my daughter in the NICU, and the month I had at home without her was heartbreaking. The feeling of carrying a child, delivering early, and then having to leave the baby in the hospital is absolutely terrible. I had horrible postpartum anxiety and depression. My son was born early (35 weeks), but thankfully, he didn't need to go to the NICU. It was night and day difference for me postpartum. \n\nIt may be challenging being at home with your baby and toddler while your husband is at work, but maybe you can ask a local friend for help or even to just come visit? Maybe reach out to the helper you hired to see if they can start early?", "YTA.", "YTA.  Your mom is an adult that gets to choose where she goes and helps as she sees fit.", "Yes, YWBTA I you try to keep them from flying home for this. They came and supported you in your time of need, and now your brother and SIL need support.", "NTA. If we were talking about months, I’d feel differently, but you’re just asking them to stay for another two weeks before they head home to spend the entire rest of the year near your SIL. Especially since your SIL does have your brother and her own sister, and does not have another child who will need care. I think the people saying YTA aren’t fully understanding the distances and circumstances involved, or that your SIL does have her sister with whom she’s close (in addition to your brother, her husband).", "1. Can your dad not stay?\n\n2. Where is your husband, you know the primary person who should be supporting you and taking care of his children as well?\n\n3. The 3 year old has no concept of time, it’s not expecting its grandparents to stay for another week. \n\n4. This is an emergency situation and your SIL doesn’t have any family by her side, this is your second child and your parents have already been with you for 2 weeks, at some point you’re going to have to do everything on your own if your husband can’t be there to do his job. \n\n5. This is not only about your parents supporting your SIL, this is about your parents supporting your brother. Why do you get support for 3 weeks & your brother can’t get the same? She went into pre term labor and the baby is in a tough position,I’m sure you would want support if that was you right? Emotional support is just as important as physical support. \n\n\n\n6. I get wanting your mom , I gave birth almost 8 weeks ago and both my mom and MIL had to fly in. The both stayed for 2 weeks and if something happened to my sister back home or to my BIL or FIL back in their home , I wouldn’t say “ you can’t go because I need you here “ because other people need them and they’ve already been part of my support system for 2 weeks. Even my neighbors were part of my support system, my friends as well.", "YTA. You get to *want* to be selfish, but to act on it absolutely would be horrendouslt cruel and would have massive consequences on the family relations.\n\nWave them goodbye, wish them a good and safe trip back and wish your SIL and the baby well, and don't you dare breathe a word of your discontentment right now, they don't need the guilt.\n\nSidenote, don't know why you felt the need to point our your son expects them around for another week - we got it, he loves them, but that shouldn't even be a factor.", "YWBTA if you say anything (but NAH for feeling disappointed about them leaving early). Your mom made and promise and intends to keep it. Please don’t make her feel guilty or put her in the middle. \n\nMany women juggle newborns and kids without the help of their mothers or professionals. I know it sounds daunting, but you can do it for 1 week. Or you could look into getting help for this week, too. If you don’t think you can manage it on your own.", "YTA. They have been with you in your time of need, when they really didn't have to be. I assume your birth progressed without complications and you have your support network close by. Your SIL is in a pre-term labor, in a scary time, and you want to prevent your mother to go to her because you selfishly want to have an easier time. Sorry, but you are the asshole in this instance if you say more that \"I wish things weren't like this and you could stay more time\". If you really need the help, try to talk to them to see if your father can stay. But you will be totally the asshole if you manipulate your parents into staying when your SIL is in this horrifying predicament with the person she trust to be at her side with you (and no, wanting childcare for your life to be easier while depriving your SIL of your mother's presence, when she really is in an emergency situation, is an asshole move. To her and to your mom, who will feel awfully guilty and that she has already stayed at your side).", "Yta loads of mothers have to manage after the birth with other kids and your getting hired help ? Like seriously", "YWBTA. Your SIL and sibling really need her right now; they're terrified. I get you wanting them with you, but they need help and support - in times like this, need trumps want.\nMaybe you mom can go now, and your dad can stay a few more days if you truly need the help.", "NTA", "Your being selfish, but it’s understandable. \nYou sister needs your mom in this moment more than you.", "Light YTA - It's understandable you want more time with your parents and their help and support, but you're demanding that time at the expense of your SIL/Brother/their new baby. You're asking your parents to break their promise. They have an emergent situation.\n\nYou got to spend time with your parents. Not as much as you might have wanted, but some. Enjoy the time you have rather than stealing it from someone else", "YTA. You're extremely selfish and seem to think your healthy babies are more important than your SIL's. You chose to be a mother and you're saying you can't take care of your kids without a helper. This is her first child and you're being a controlling brat. Suck it up and take care of your kids.", "Look, you're NTA for wanting the help and support; that's 100% understandable. But yea, very gentle YWBTA a bit, if you stopped your SIL from having the same support.\n\nMaybe see if your dad can stay on to help you out, while your mom heads to help SIL?", "YTA. This is incredibly selfish of you. You’ve had them for weeks and want to deny her the support of having them at the actual birth of her first child, especially given the seriousness of preterm labor and the baby being in NICU? I would hate you if you tried to do this to me.", "NAH I can understand you wanting your mom like was the plan but as someone whose first child spent 2 weeks in the NICU due to being a premie and having breathing issues it is excruciating. \n\nThe first couple nights before he stabilized I remember lieing in the hospital room with his mom praying to God that could take one of my lungs if my son could breathe and survive, followed by the reality of them having to give medicine to basically glue holes in his lungs closed. That medicine has high likelihood of causing brain defects after three doses. They had to give him 3 and basically said he is going to breathe or he isn't. Thankfully he stabilized but then to see his mom sit beside his incubator for the 2 weeks when she should be resting and healing was heartbreaking. \n\nNICU absolutely can be monumentally hard.", "YTA. SIL's baby is significantly premature. This might be the only chance your parents have to meet him or her. Your brother and SIL need your parents more.", "Everything Sucks\nI remember when my twins were born (36 weeks) they both spent time in the NICU. 1 spent a few days, the other @ a month. Had serious medical issues that were discovered after birth. What was WAY MORE HELPFUL was someone at home when 1 them the other came home. When they were in hospital, you visit, go home, sleep and start over the next day. With 2 (1 at home) you have to divide time so the one at home is taken care of and also see the one in the hospital, not to mention if one parent is working, the one who gets “left behind” is the one in the hospital", "Compromise and ask her to stay one more week.", "YWBTA they gave you support and now they need they need to be there or your brother and sil.", "A 3 yr old has no concept of how long a week is. Your SIL is scared & needs the support of a motherly figure, which is your mom as she doesn't have her own mother to rely on. You're being incredibly selfish.\n\nYTA", "YWBTA if you act anything other than gracious and understanding that your parents leave after only two weeks.", "YTA you already had help for 2 weeks. Your SIL also needs help now, she also needs her body to heal, she will need your mother’s emotional support. You are one of the most selfish ppl I have ever come across.", "YWBTA for your selfishness.", "YTA.   Hopefully your parents have enough of a backbone to tell you where to stick it and go to your SIL.  If they allow you to 'deprive' sil of their support, then they're spineless.", "YTA\n\nYou sound selfish and jealous of your SIL.  How dare she take attention away from you!\n\nYour mother made a promise, and she should keep it.\n\nIf you father wants to stay behind, he can do that, but he certainly should not feel he has to.", "NTA. If your mom wants to pick someone else's daughter over you, she's allowed to make that choice. And you're allowed to never forget it.", "Question, if the roles were reversed, what would you want your SIL to do?\n\nSomething tells me you’d expect your mom to fly back to you early.\n\nYTA.", "You are going to have to let your Mother leave sometime and you will be nervous about it whenever it is.  Let her leave now when her leaving helps other people you all care about and ask your father to stay the full original length of time", "You’re are NTA for wanting your parents there. However, your SIL needs support especially with her baby in the NICU. As a previous NICU mom during COVID with zero visitors allowed besides parents. Support is what your SIL needs. You had them for 2 weeks, you could attempt bedtime with your son while your parents are there, you’re going to have to at some point.", "Your vanity project is not more important that someone else's. If your mom is committed to helping with her vanity project that is her decision.", "What sister in law is this, is this your husbands sister or a siblings wife?", "If the hospital is more modern, the NICU has private rooms, so mom (and dad) can stay with her baby, see everything the doctors and nurses are doing, and get lots of teaching so she is confident in taking the baby home. She can breastfeed, if the baby is up to it, and be in the room gazing at her baby while she is pumping which helps with supply. She may not go home at all until the baby does. Hershey medical center and UPMC Harrisburg in pennsylvania have both built new NICUs of this type.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI live across the world from the rest of my family, about a 12 hour flight. I see my parents 2-3 times per year. \n\nI gave birth 2 weeks ago and my parents flew to help me with my 3 year old and newborn postpartum. It’s been really helpful and they’re supposed to stay one more week and then fly home. My son is obsessed with them and he has the time of his life when my parents come visit (twice a year). It’s been great and so helpful. \n\nMy SIL is due in a month with her first. She has a strained relationship with her mom and is very close with my mom. My mom promised her she’d be there for the birth, figuring with 6 weeks between our due dates it would work out. \n\nWe got the call today that my SIL water broke and my mom immediately said “I need to change my flight, I promised her I’d be there.” I love my SIL, we are very close and I don’t want to deprive her of the support she was relying on, especially with this sort of scary situation. But at the same time, I can’t help it, I want my parents to stay until the end of their trip. \n\nMy son is expecting them to be here for another week, and I’m only 2 weeks postpartum, I’m still healing, and also my mother’s helper is only set to start working for me next week. My husband works very long hours and I am nervous to take on my toddlers bedtime plus a newborn without any help at this point. \n\nMy parents live fairly close to my brother and SIL and will be able to be much more involved and helpful than they are with me since I live so far away. I really cherish when they’re here and I don’t want them to cut their visit short. My SIL will have their help whenever she needs in general. I only get it for this short time. \n\nBut also this is my SIL first baby and I truly want her to have the support she needs, I don’t want to be selfish about this. My parents didn’t even ask me my thoughts on it, so I don’t know if it even makes sense for me to ask them not to change their flight, but WIBTA if I did ask? I think if I was honest with them they would stay, which would leave my SIL without their help for her first week postpartum.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH", "Where is SIL's baby-daddy during all of this?  (I'm assuming it's OP's brother or BIL).  The post makes it sound like SIL is all alone during this.  Did I miss something?", "First off with the update, 37 weeks is NOT full term. 40 weeks is the human gestation period. \n\nFor a 37 week old premie with low oxygen and sugar levels, that’s a stressful and serious situation for your SIL. She would definitely require a lot of support to manage through this emotionally and psychologically. Premies can deteriorate rapidly, even if they are just 3 weeks premature, and your SIL is going through the process of having a baby in NICU, her first baby, and is going to need people with her that she’s close to, like your mum. \n\nDespite that, NTA. A newborn is stressful at the best of times, and you’re managing that with a toddler and a partner who unfortunately isn’t able to pull as much of the baby raiding weight as you. Having your parents there sounds incredibly helpful and positive in your life at the moment and it’s completely justified feeling upset that they may be needing to go suddenly. In saying that, your SIL also needs them, and your mum made a promise. I agree with the decision that your parents will stay unless there’s a call, I think that’s the only way to maturely handle the decision without causing drama and conflict from everyone involved. \n\nUnfortunately it just sounds like this is not great timing for babies but hey that happens. All the best to you and your family", "Yeah. Came here to say this. Your dad should stay and help while your mom goes to help your sister in law. NAH but let her go", "Yeah I’m hoping my father will stay. When my mom suggested this my dad was kind of like “there’s no reason for me to stay if you’re going” so I don’t know if he’ll be willing to stay without my mom but I do think this would be a good compromise. \n\nThanks for the compassion I’m definitely still very hormonal and emotional and all the other postpartum things. My SIL is amazing and we have a great relationship, I do want her to have my moms support.", "I scrolled down hoping someone would say this. If OP has two parents with her at the moment then suggest her Mum fly back and her Dad stay as planned. It might not be quite as comfortable for OP, I'm sure she doesn't want to discuss stitches and postpartum bleeding with her Dad, but it's a workable compromise.", "I also thought this was a good idea, and my mom suggested it, but my dad doesn’t seem to want to stay without my mom. \n\nIn the end they decided to move their flight back by one day, unless there is some further issue (the doctors are reassuring that they believe the baby will be healthy).", "This was my first through too.", "Thanks for sharing your perspective, I agree it’s a sucky situation all around. Thanks for showing compassion. I didn’t end up speaking to my parents about it but they decided they’d move their flight back by one day, and if something goes wrong they’ll get on the next plane (the doctors are reassuring they think everything will be fine and the baby will be healthy)", "Wouldn’t SIL have her husband there? \n\nShe wouldn’t have no one close.  She wouldn’t have her own mother at the birth, but as long as the husband is there & the MIL arrives after birth for support it’s not as though SIL is being left alone.", "She is 36 weeks, not 34 - her baby will need to be in the NICU on a technicality (to check sugar levels and oxygen levels and that kind of thing) but the doctors predict the baby will be completely healthy.", "She’s not 6 weeks preterm she is 4 weeks preterm. She is 36 weeks. The doctors say the baby should be totally healthy, the NICU stay is to check sugar levels/ oxygen levels, that kind of thing just to be sure.", "My thoughts exactly.  Tons of moms do it every day with no help!", "So the info is missing I guess but it definitely wasn’t a complication free pregnancy and delivery for me, and my support system is across the world, my whole family and my husbands family both live a 12 hour flight away. My SIL older sister lives right by her and they are very close. I’m not trying to be manipulative, and I appreciate your bluntness and honesty, will take this into consideration.", "Loads of mothers have to deal with NICU stays without their MIL flying 12 hours to come and help out.", "The strained relationship is between SIL and *her* mother, not OP’s.\n\nIs it not relevant that SIL will have her MIL’s support for 40+ weeks of the year vs. OP having her parents for a few weeks? Not arguing, really asking.", "They’re her actual parents. So yeah they should be there for her?", "It might be worth adding that my older son was also preterm in an emergency situation and my parents couldn’t make it for the birth, my mom came a little over a week after my son was born. We were in the hospital for most of that time (though not the NICU), and it really was okay. I needed her help much more once we were home from the hospital. Everyone is different and needs different kinds of support, but it kind of feels like I was in this exact scenario 3 years ago and it really was fine that my mom wasn’t there while we were in the hospital that first week. So my own experience is swaying my judgment but I appreciate your input.", "The baby is only a week under full term (SIL is 36 weeks and 37 is considered full term) not significantly premature. The doctors are reassuring that they believe the baby will be totally healthy. The NICU is a precaution to monitor sugar levels/ oxygen levels, that kind of thing.", "Newborns are vanity projects now? Wrong post, my dude.", ">Your vanity project is not more important that someone else's. If your mom is committed to helping with her vanity project that is her decision.\n\n&#x200B;\n\nYou seem to have posted in the wrong AITA", "Dude, they're helping with a newborn, not a loft conversion", "Ha!", "Tell your father that you are a reason to stay. That his grandson who loves him is a reason to stay. Most of all, *talk* to your parents. Tell them your disappointed that this happened and worried for your SIL. Tell them you don’t want them to leave early but understand why your SIL needs the support. Share your feelings with them. Don’t try to guilt them or ask your mom to stay, just tell them you feel. It sounds like you have a good and loving family and sharing your feelings with them should help.", "hey there! had a baby preterm who was in the hospital for 2 weeks (she was home after that but still needed a lot of help feeding and monitoring). \n\nyou are all in a really tough situation and i feel for you, but yes, i 100% needed my mom with me after my baby was born and put in the NICU. i had to move around a lot more than is typically a good idea after birth because i had to walk to the nicu a bunch of time a day, sit in a chair by her incubator, adapt to the nurses' care schedule, be there for drs rounds, etc. it was extremely stressful.\n\nonce i was discharged and sent home, instead of relaxing in bed with my baby, i was getting dropped off at the hospital to hang out with her in the NICU, do feedings, and then having to go down to the caf to eat, find a washroom, all while fully dressed, then getting picked up and having to leave her behind.\n\nmy parents came right after she was born. i needed moral support and logistical support. my mom came and helped set up the nursery (we hadn't finished yet) and cooked for us and helped me get to the hospital and took a couple shifts of watching her while i stayed home and napped.\n\nask your dad to stay. very specifically, ask him to stay and be on toddler duty. i find that grandpas want to be involved, but might need a bit more emphatic requests. your mom having given birth already knows how you're feeling and can help more automatically with postpartum stuff, but grandpa can really be helpful with the older kid and around the house.", ">When my mom suggested this my dad was kind of like “there’s no reason for me to stay if you’re going”\n\nWhy does your dad not see supporting his child as his job and see himself as just your mothers accompanier?  He needs a slap back to reality. That is horrible", "I can tell you are a good person by the compassion and grace you show you SIL.  You are not selfish for wanting this for yourself.", "I’m glad it seems to have worked out as well as it can. I hope you’re able yo enjoy your time with them, recover well, and I hope your SIL/her baby are healthy! We moms have to lift each other up :) you also might check out r/beyondthebump for more support, it’s a pretty supportive page!", "But she doesn't have the support of a motherly figure. There's a difference.", "[deleted]", "You're just a fountain of empathy. Your Brother is scared too but I guess he doesn't count. And it's their first baby.", "Those predictions aren’t always accurate. My first was born at 38 weeks and some change and still wound up in the NICU with some breathing issues (fortunately, very minor). I had also just been through emergency surgery to repair a torn cervix that caused a bad hemorrhage. This was after a “textbook” unmedicated vaginal delivery. Your SIL is scared and needs support. Yes, the timing sucks, but it is what it is. YTA.", "She’s still preterm which carries risks, don’t begrudge her receiving support just like you have", "I missread.  4 weeks is still a big deal", "I’d express this to your parents. They should be prioritizing their daughter in my opinion, especially if your SIL has a support system available nearby.\n\nNTA.", "Your SIL having a sister close by changes things, in my opinion. She has a support system that is more than just your brother. I don’t think you’re the AH for wanting your parents to stay an extra week. NAH but ultimately it’s your mom’s decision.", "Very true too x me being one of them", "Misread that part. Comment edited, judgement unchanged. OP is still asking the parents to break their promise to be there, especially now that it's an emergency/high-risk birth. Given that SIL's parents may not be in the picture, it's important/valuable for them to be there, plus they're still supporting one of their children and grandchildren. OP is asking to be prioritized higher and while understandable, it's an unfair ask. Moving far away from home can have benefits, but it also has costs", "And? They’re very close with their DIL. Would you say the same if it were their adopted daughter instead of DIL?\n\nThey have already been there for her during labor for weeks after. Asking them to stay longer at the extreme expense of the mother of their other grandchild and the wife of their son, who only has her MIL as a family support, is obscenely selfish. DIL in preterm labor and is a first time mother. It’s an unfortunate situation, but OP should not ask them to stay with her longer over going to their DIL for her labor. She has a night nurse starting in a week, she should see if the nurse can start earlier instead of fucking over her SIL. Did you miss the part where their other grandchild is going to have to be in the fucking NICU?", "Your experience doesn’t have anything to do with your sister in law’s situation. You’re lucky to have already had this help and to have a helper starting next week. Be thankful for that, so many people give birth everyday with fewer resources, and they survive, you will be fine. Don’t be jealous of your SIL getting the support she needs,", "So it was fine back then, and you will be fine again now. Suck it up", "[removed]", "You show so much compassion, please ignore statslady.", "Having a child is a vanity project. People acting like their kid is the most important thing in the world and that everyone should cater to them because they had a kid. But having a kid is only important to you. Vanity project.", "Nope.", "And that means her mother can't make decisions for herself?", "I see a difference because OP has an older child and an infant, and has a caregiver scheduled to start in one additional week.\n\nThe actual birth isn’t a spectator sport anyhow, and they have no other children.  SIL and OP’s brother can get through the birth.  SIL also has a sister she is close with per another comment from OP.\n\nMom should split the difference and stay with OP one additional week.  She rarely gets to see the 3 year old grandchild anyhow.\n\nThen she can return to SIL.  She lives close by SIL and will have far more opportunities to assist with SIL’s new baby.", "She only sees her parents twice a year. Brother and SIL can live without them for one more week.", "Not necessarily. At my nyc hospital, they told me that 36 weeks isn't even an automatic nicu stay if everything checks out with the baby. Obviously there can be issues, but 36 weeks is late pre-term and often not a big deal at all", "SIL can also suck it up. They’re not her parents.", "My kid is the most important thing because I forced life upon her.\n\nIf she has to live in this hellhole its my duty to make it the nicest hellhole possible.\n\n&#x200B;\n\nIDK if that counts as vanity, I see it more as guilt", "...huh. That's an interesting take. I see where you're coming from.", "Of course not, but it's not unreasonable to want support from her parents. Yes, they might be needed more elsewhere, hence the post here, but don't underplay it like she just wants them around for some personal business that doesn't matter", "Yes, that is my point. It is a personal thing for you. The rest of us didn't get a choice. That is why your kid is not the most important thing to everyone else. But a lot of people act like it should be. That is what makes it a vanity project. You are totally allowed to do the best for your kids, just don't expect the world to bend itself around your kids.", "It is certainly not unreasonable. But both her and her SIL have their own vanity projects and her mother is allowed to choose for herself which one she wants to help with. OP's vanity project is not more important than her SIL's vanity project. They are the same.", "But if it is an individualised thing.  Then can we assume it to be true of OP?", "Again, they are needing help with a young, completely dependent human while they are medically weakened. When you say \"vanity project\", it sounds a lot more trivial, like it's a custom car.", "It is true of OP and their partner. But that doesn't make it true for anyone else. That is where the vanity comes in.", "So why don't you go help then if someone helping this tiny human is so important in the grand scheme of things.", "I'm not seeing the vanity from OPs post, but I trust that you do.\n\n&#x200B;\n\nHave a good day.", "Well for many reasons, to start with, she hasn't asked me.", "Self awareness is not always people's strong suits. Just because you don't want to call your kid your vanity project doesn't make it any less true.", "I am glad you have come around to my point.", "You just said \"that doesn't make it true for anyone else.\"\n\n&#x200B;\n\nNow you say it is true?\n\n&#x200B;\n\nI think you are just trying to argue for the sake of arguing.\n\n&#x200B;\n\ngood day", "Man, you obviously can’t control what your mother does but honestly in that postpartum haze, no matter how much I love my SIL and empathize, I’d still feel pretty damn hurt if my mother prioritized my sister in law over me, her actual child, especially when it’s a matter of a week and SIL is getting more extended support. Is that selfish? Sure. Is it also human? You bet. \n\nI’m glad to hear your mom is only pushing it back by one day absent something major happening!", "Where I work, 36 weekers are fine to stay with mom in her room barring any complications. We still do a car seat tolerance test and check a few blood sugars, but they only go to NICU if they are in any form of distress. At face value, I’m not especially alarmed for SIL or her baby. However, every laboring mom needs support—-so do postpartum moms. It’s up to you if you want to ask, but you would be N T A. I’m going NAH as my final judgment. No one is being unreasonable, although your brother should be able to step up and support his wife.", "NAH. She’s your mom, I’d be a little selfish with my own mama too especially so soon after birth. The circumstances are also different because of how far you live apart from each other. Your SIL will not need help in the same way if the baby is going to have a NICU stay anyway. It will be more emotional than physical help.", "Your dad is an ah. He doesn't want to stay and help his daughter with her toddler for a week without his wife because his wife probably does all the work.", "NAH. Of course you want your parents to stay, especially because your husband sounds too busy to be very helpful. But they also promised support to your SIL, who doesn’t have her own parents to help her. This is really just an unfortunate situation that isn’t anyone’s fault. Your parents want to be there for two new mothers who live on opposite sides of the world; because of your SIL going into labor early, this means they need to be in two places at once, and it sucks that they can’t.", "NAH.  Get yourself a baby wrap if you don’t have one already.  It was *invaluable* to me after my 2nd was born, because it left my hands free to deal with my 2yo.  I know it’s not ideal, but you can do it!  My husband worked long hours too, so I understand how you must feel.  I didn’t have any help, either.  It will be hard, but you are super mom!", "I had a baby at 33 weeks, spent two days in the hospital and sent us both home. A 36 week baby might not even need the NICU.", "NAH. Tough position for all. I had a SCN baby, so a bit healthier than NICU. We weren’t allowed to have more than 2 people in the nursery at a time, so babies parents only. This was pre-covid. Would you parents even be allowed in the NICU? Worth checking before they change flights and upset you.\n\nI personally didn’t want my parents or in-laws around the hospital or for the few days after we go home. I desperately needed to bond with my baby as we’d been sent home without him and I was struggling to feel like he was mine. I needed him all to myself to connect. I needed their help further down the track.", "NAH. I would be very disappointed if I were you. I feel for your SIL too- and I’m sure your mom is stuck between a rock and a hard place. I hope everything goes smoothly for you ❤️", "Man I loved my first baby’s time in the NICU. He was 37+1 technically but I think they counted wrong (whole other story) he def wasn’t done cooking and was skinny, had jaundice and low blood sugar. Compared to every other baby there he was in great shape. \n\nHad to spend a day or two in NICU. I was so happy to have all those nurses around so I could get my sh*t together. I was there with him every 3 hrs and honestly I’ve never been so happy to walk into a room and be ignored because that meant me and my son were doing fine.  I was in worse shape than he was (preeclampsia). Having the nurses showing us how to care for the baby over a week really helped me feel confident as a mom.   My Mom died the year before he was born and my MIL was fairly hands off.\n\nI suppose it made a bit of a difference that I was ready for this to happen. I was a month early myself and my family has a history of early births.", "Tough situation.  Be honest with your mom then let her make her own decision.  Be ready for whichever way she decides but let her know so she has all the information possible.  You do need and want her with you.  SIL has her husband to help plus with baby in the NICU your mom will be unable to help with the baby until discharge date.", "If the baby's in the NICU, the mom will do a lot of sitting around, and probably need psychological support. At the moment, you need more physical backup in terms of help with care for your baby. I think they should stay with you as long as they originally planned.", "NTA you’re being very generous I’d be furious if my parents left early under the circumstances", "Nicu mom - NTA. The nicu made my husband and I our own little cult, we were a team but honestly I didn’t even want to see the nurses in the nicu. Nevermind that the nicu often only lets two people in including mom and dad, so one parent would need to leave to let your mom or dad in and frankly they’re your parents.\n\nWe didn’t invite one person to the nicu to meet our son, we didn’t see one person besides each other and his care team either. When your baby is in nicu and it’s your first, your world revolves around the nicu. \n\nI didn’t even like texting people when I was in with my son, that time was all about him. Honestly I don’t think it’s selfish to ask your parents to stay with you.", "My first child was born 6 weeks early and was perfectly fine. Her only problem was that she had jaundice and had to go under a lamp. So hopefully your SIL and her baby will have no problems at all.", "NAH. The situation is all just bad timing - but babies come when they want and that isn't anyone's fault. I don't blame you for wanting help. And if your SIL is lacking in emotional support I understand why she wants your mom there for her. \n\nI have 3 kids - the only help we ever got was someone watching the other kids while I was delivering. My last baby was a NICU baby (34 weeker), it wouldn't have made any difference to have someone stay with us while he was still at the hospital.", "NAH. Just 5 months ago, I gave birth to my baby in week 36, as my water broke just like your SIL. I live away from my parents,  who were supposed to be here for the birth. My parents ended up not changing their flights and, sure  I missed then being there, but I also understood that flying halfway across the world requires some preparation. I think if your parents ask you, you should be honest about your feelings, and I hope your SIL would understand,  being a new mum as well.\n\nFor the record, my 36 week baby was perfectly healthy and there was no need for NICU or anything else, we just went home as normal.\n\nAll the best to all babies and mums involved!", "No one is TA. You both need help. It’s really unfortunate timing. I hope it works out ok for you both", "While I understand completely what you’re feeling and your feelings are valid, you need to let your mom be there for her. As someone who gave birth a week ago to a 34 weeker and she’s staying in the nicu, I would spiral if I didn’t have the support that I have. It’s the hardest thing i’ve ever had to do.", "When you say your mum primised to be there for the birth was your SIL expecting your mother to be there for the actually giving birth part? Because giving birth is a big deal especially as a first time mum and even more so when things don't go as expected.\n\nIf mother promised to be there while SIL gives birth and its possible with the flight time for your mum to get there in time then it is a bit AH-ish to insist she stays with you and your SIL not to have the support person who promised to he there.\n\nIf the promise was more just being there to help out with the first few days/ weeks of having a newborn then the situation I'd a bit different and it's more of a compromise of how long your mum stays and how soon she goes and helps your SIL.\n\n\nIt's an all around sucky situation. You aren't wrong for wanting your mum with you at this time. Neither is your SIL. I hope you work out a solution that works for everyone.", "Your brother and sister in law deserves the same support you’ve had. If it was the other way round…… wouldn’t you want her to change plans and come to you? There’s nah but you both deserve support, xx", "NTA\n\nI've had a NICU baby in my family and mom will have plenty of support from NICU nurses while she's there. She will need help when she's home, but not that much when baby is in the NICU. \n\nBest of luck to everyone!!", " NTA\n\nI saw your edit, so I’m answering with the benefit of that as well. \n\n36 weeks is pretty reasonable and while it’s a sad situation for your sister-in-law, you only get to see your parents twice a year. \n\nThis is your time and I think the one day early is a very nice compromise. Wishing you and your sister-in-law the best with both of your new babies. Safe and happy travels to all.", "NTA. I've had two babies (neither were NICU babies, although one was an urgent 37-week delivery) and in practical terms, you really don't need much help or support until the baby comes home from the hospital. The nursing staff handles basically everything for you while you're there, and visiting hours are often limited, so if a grandparent has a certain amount of time they can stay, it makes the most sense for it to start after everyone's home. \n\nAlso, in my experience, grandparent support is absolutely the most valuable with the older sibling. Dealing with a single newborn is a cakewalk compared to newborn + toddler.", "I had my twins at 30 weeks. They spent more than two months in the NICU.\nI wanted no one but my husband around. I have a completely peaceful relationship with my mother, there are many a times in my life when I wanted her by my side.\nThis was not one of those times. I know that so many women want their mother to be with them, but for me, at that time, I couldn’t handle anyone else and their expectations or needs. Literally no one else mattered to me in those moments but those babies and their father.\n\nThis is just to tell you that every person, every situation, every birth is different. \n\nNTA", "NAH/NTA. I have been in your shoes. My mom left while I was still in the recovery room after having my second baby so she could be with my sister, who was having her first baby. That first night home with a toddler and a newborn was *so hard* without help. (I was exhausted from labor and delivery, but both my husband and I had to each be up with a fussy child, as we had no other help.) Meanwhile, my sister was still in the hospital so had both nursing care for her newborn, her local in-laws, and her spouse (as this was their first baby, and they didn’t have any other children to care for). \n\nI’m still a little salty, but I’ve never said anything, because of course my mom wanted to be there for my sister’s first baby. I don’t blame her, but it was sure a bummer for me—we could have used the help, and any other time, she would have happily been there for us. Years and years later, it’s great having same-age cousins, though!", "NTA", "The clear solution is your mom goes to SIL and you dad stays here. I presume he is a capable adult, right?", "Yta.\n\nMy first pregnancy ended up with me being induced at 36 weeks due to extremely low fluids despite there not being a leak of any size, and the baby measuring small suddenly and decreased movement. This happened suddenly, two weeks prior everything was fine.\n\nBut because I was not anywhere close to being ready for labor, the induction took 3 days, and I was monitored the entire time because I was begging to avoid a section.\n\nMy baby was born weighing 5lbs and was 15\". By some miracle, we avoided NICU, but I was petrified about it. I have no family in the area and my inlaws worked.", "YTA. Its your moms descision and I dont see why you cant ask. But accept her answer with grace.\n\nMy father grew up in a home with 10 kids. My gma would be laughing at you \"needing\" help.", "Yta!  You have had your help and this is life!!!!  Things change and evolve!", "lmao YTA\n\nYour parents came to be with you to help and have been there for two weeks. Now someone else in your family needs their help and you’re being selfish.\n\nYour son will see them again. They’ve helped enough. You chose to have a baby knowing full well you have a toddler too and that means taking care of both. If you can’t do it, your husband needs to help or you need to hire help sooner.", "[removed]", "NAH", "Her pregnancy is not full term. The American College of Obstetricians and Gynecologists (also called ACOG) and the Society for Maternal-Fetal Medicine (also called SMFM) define a full-term pregnancy as a pregnancy that lasts between 39 weeks, 0 days and 40 weeks 6 days.", "NICU mom here, slightly different scenario, I had a micro preemie at 24 weeks, but I can tell you for sure that I wouldn't have been able to manage without my mom there.\n\nFrom the other side... my husbands parents didn't come, he only had my parents and siblings for support. It's been over a year since our son was born and my husband is still hurt over this. I get that a new baby is tough and you want your mom there, but not only will your SIL need the support, your brother will too. His wife will be super emotional, and his child will be in the NICU, he needs his mom too.", "In my opinion both new moms would be \"selfish\" to deprive the other of the mother's support. It's not really relevant.", "It was only two visitors at a time and one parent had to be a visitor so we didn’t have anyone really  come see our NICU baby n this was just a few months ago. So i don’t really see the reason the parents should rush home. They can’t see the parents or the baby without quarantining themselves for at least about a week. Rather safe than sorry.", "Agreed. My preemie was born (pre-COVID, but during cold/flu season) at 31 weeks and was in the NICU for 31 days. I actually don’t even remember seeing my parents at all during that period. If I wasn’t at the NICU, I was home pumping or sleeping. It was only after my son was discharged that my parents visited. Even then, they didn’t visit more than a few times because this was what NICU doctors recommended: to limit exposure to household members only until he reached six months of age. Promise or not, much of what happens when a baby enters the NICU is determined by hospital policy; and then, after discharge, advice from doctors. OP’s parents should definitely look into this and discuss with their son and DIL before rushing home.\n\nNevertheless, NAH.", "Why is this not higher. In many hospitals you cannot enter the NICU if you’ve been traveling. They also usually only allow one other person beside the mother which is normally the father. Why can your brother support his wife during this time? I had a NICU baby and there was nothing anyone could do to help me but maybe clean or grocery shop while I sat in the NICU. I’m going NAH. But your family needs to be realistic on what they can do while the baby is hospitalized and focus on what to do when they’re all home.", "Yeah this would honestly break my heart if my mom did this. I'd feel like she replaced me with my SIL. Rational? No, probably not, but SIL is going to have OP's mom's support for years to come, whereas OP gets her twice a year. \n\nI don't want kids so I may be overestimating the pain and horror of the postpartum period but I feel like I'd be so upset.", "Except it's not just SIL but SIL's husband too. You know OP's mom's son. Doesn't he also deserve his mom in this scary time where he's having to see his wife and baby at risk?", "Thanks for this! My girls were both born on their own terms at 36.5 weeks and both were totally fine normal healthy newborns. No feeding issues, no excessive jaundice, no breathing issues, etc. Second baby passed her car seat test and we actually went home when she was 24 hours old (my request.) I totally understand there are risks to late preterm babies but it’s not in any way the same level of risk as a 32 weeker or something!", "I think this comment is exactly on point. My mom is wonderful and I don’t want to put her in a position where no matter which choice she makes she feels like she’s letting down someone she loves. \n\nI think I was sort of nervous also that it might be a situation where my mom jumps into action and then it ends up being that she’s not even allowed in the NICU after flying from a different country or something and she ends up not even being able to help until next week when she would’ve been back anyway. \n\nAnd we’re not set to see my parents again for 9 more months, the next time they’ll see my daughter she’ll be 9 months old and the next time they see my son he’ll be 4 years old. We get so excited for their visits and I guess also my feelings were kind of hurt how they discussed the flights. \n\nMy mom suggested maybe my dad stay while my mom flies back and my dad was kind of like “there’s no reason for me to stay if you’re leaving”, neither of them made any sort of comment about my recovery, or how I would handle them getting on the next flight. I’m sure they were just focused on my SIL and weren’t thinking about it, but I couldn’t help feeling kind of hurt, like I’m still pretty freshly postpartum and I so rarely get to be taken care of by my parents, and sometimes people just want their mom and dad during vulnerable times and this is just one of those times for me. \n\nYour comment makes it really clear though that of course I don’t want my mom to feel like she’s in an impossible situation, I really appreciate your comment. \n\nIn the end, I didn’t speak to my parents but they decided to shift their flight back by only one day unless something goes wrong, in which case they’ll get on the next available flight.", "Then why NTA and not NAH? Who is the AH?", "only op is their daughter, the other woman giving birth is her sister-in-law, therefore definitely not op’s mom’s daughter. i don’t think anyone is an asshole here, but i don’t see why mom wouldn’t prioritize her daughter. where is sil’s mom in all this? why can’t she be there to help?", "This is honestly what I don’t understand, my dad pulls a vast majority of the weight with taking care of my toddler, which is the biggest challenge for me at the moment. I think he more just wants to be there for my mom, who recently beat cancer and has the habit of neglecting her own needs while she’s taking care of others. I think he is nervous if they split up for the week my mom won’t have someone making sure she’s feeling okay, eating, and giving herself a break (my mom is still on medication with some unpleasant side effects).", "Depending on the job, coverage can be hard. My husband has no one else to cover him at his small business  - if we have a second child he would have to go right back.", "Agree, NTA. With my NICU babe it was only parents allowed in and I was so busy that I could barely speak to my parents (who I’m close enough to to only live a few doors away from) with all the back and forth and pumping every 2 hours and my own recovery. After was when I needed the help - and it sounds like SIL & bro will get a lot of that when the grandparents are home from this short trip.", "I\nEveryone keeps saying mom promised SIL, but didn’t she also promise OP?", "Seems like Brother will be there but because SIL has a bad relationship with her own mom she’s in need of maternal support.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I recently encountered the “welp you got it” from someone who came to help after surgery and had to stop the asshat as they were trying to exit a few hours later - I was in tears going “I’m losing it! I can’t do it all and I am falling apart! I just need someone here to help! Yes I’m still trying to do everything- because you haven’t read the care list!”", "I’m going with NAH. You don’t see your parents often so of course you’d want them with you as much and as long as possible. As far as the NICU, my son was in the NICU for 3 days (which was how long I was in there too… we left together) and it’s not much others can do. My god daughter spent a few weeks in the NICU and I would visit her with her mom as well. Your SIL, depending on how she is, may need/want more mental support. Make sure you express your feelings to your parents instead of hoping they’ll choose to split up. Hopefully it’ll work out . Good luck!", "Sorry, but 37 weeks is not considered full term. In fact that's the week the baby's lungs are finally fully developed, so it's considered early term. \n\nACOG and SMFM use these definitions to describe term pregnancies: Early term: Your baby is born between 37 weeks, 0 days and 38 weeks, 6 days. Full term: Your baby is born between 39 weeks, 0 days and 40 weeks, 6 days. Late term: Your baby is born between 41 weeks, 0 days and 41 weeks, 6 days. Source: March of Dimes", "While I do understand your predicament, it is a little selfish. NICU complications can be many and even at 36 weeks, particularly if it's a boy, lungs may not be developed. \n\nIt's a terrible situation for all of you and I really don't fault you for it. Could your husband temporarily fill in and maybe cut hrs for a month? Is there any other way? I'm saying this because I'm assuming your baby is healthy. My baby was in the NICU for a week and I still have nightmares about it. He's almost 2. \n\nBut I definitely see both sides. I'm sorry you're having a hard time.", "NAH", "I saw the update but what left me baffled is how a 3yr old toddler has any expectations or the ability to grasp how long a week is.", "But OP isn’t talking about her mom being there for emotional support for OP’s brother, she’s pretty clear that this is about the SIL and that close relationship there. But if it WAS about the brother, of course OP’s brother deserves support too! I would never dream of saying otherwise. But IMO the hierarchy in this delicate period should absolutely prioritize the newly postpartum daughter who won’t get to see her mom again for 9 months over the son who lives nearby and will have that emotional support in the days to come, especially because there is little OP’s mom can physically do for them until a later date anyways and OP needs the *physical* support. Nobody is an asshole here at all, I’m just saying that I too would be extremely hurt and I don’t think that’s actually an irrational response. \n\nGood thing it’s a moot point since mom is only leaving a day early and hopefully everything goes smoothly and everyone involved gets their needs met.", "I’m glad the comment helped and I’m glad the situation is working out. I’m sending you and your family the very best.", "Except it's not just SIL but her husband who last I checked was also OP's mom's other child. You don't think he'd also appreciate having *his mom* there for support as his wife and baby are potentially at risk?", "And she's done most of it with the op. Why can't the husband step up?", "I had C sections and my mom was here for a week.  That's it.  No other family that lived local and no such thing as paternity leave for my spouse.", "i think the difference here though is this is op’s sister *in-law.* her mother is not her sil’s mother. why can’t sil’s mother be there? why does she need to take someone else’s mom away from her when she’s only 2 weeks post partum? i don’t think sil is at all an asshole for wanting who she wants there, but i really do think the mother’s priority should be her own daughter.", "https://www.nhs.uk/pregnancy/week-by-week/28-to-40-plus/37-weeks/\n\n“At 37 weeks, your pregnancy is considered full-term.”\n\nMy first was born between 37-38 weeks and was considered totally full term.", "I had my daughter at 36 was due to her needing surgery. They drew fluid to check if her lungs were mature before inducing me. She spent 4wks and 2 days in the NICU before she came home. I had to go to bigger city 45min away. They have 2 major hospitals there. One didn’t deliver babies and the other didn’t do surgery on babies. \n\nI had her and then they transferred her to the other hospital. Next day they gave me a day pass to go see her and then I had to go back and stay another day cause they thought I would over do it if not.\n\nDaughter is now 30, but it was a terrifying time.", "While time like past and present and 5 minutes are usually murky at best and usually pretty poorly understood by the average 3 year old at this age and a little older they can graps routines and weekdays. So they may know all the words for the weekdays and form some kind of image of that in their head. For example weekdays I go to daycare and weekend I am with parents.\n\nSo i know this from child developement class bc thats what I studied but I personally barely work with todlers.\n\nI imagine this may mean they could expect grandpartents to stay till the weekend?", "He doesn’t know how long a week is but my parents have plans with him this coming weekend that he is excited for. This past weekend they went to a hotel and my son missed them a lot, so we hyped him up with this quality time they will be having together next weekend and he is looking forward to it.", "Yeah, that caught my eye too.   You could put a 3 year old to bed saying \"we'll go to the park in a week\" and wake them up saying \"let's go to the park\" and they'd never say \"I thought that was in 6 days\" lol.\n\nConversely if you told a 3 year old you'd go to the park in a week, my guess is that would ask you over and over when you're going to the park.", "i’m not saying he doesn’t i’m just saying op also deserves to have *her mom* there for her", "Did you miss the part where SIL's sister lives nearby as well and MIL is not her only family support?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Two things:\n1) The OP said she has a strained relationship with her own mother. Lots of people have difficult relationships with their own parents and it is a gift that this SIL is so close with her MIL.\n2) People are so focused on the SIL relationship but a preterm birth and NICU stay is also hard on fathers, and that’s their own son! Doesn’t he deserve to have his mom there too?", "Pretty much. My 5 year old still calls anything from yesterday to 5 years ago “yesterday” and everything from tomorrow to the infinite future is “tomorrow.” Also only morning and night exist in her typical vocabulary. Yes, she knows the words “afternoon”, “last week”, “next week”, but the concept of it is hard for her to grasp, even though everyone around her uses the correct wording all the time. Let’s not even talk about how “tomorrow” is her birthday all the time despite us saying it’s X months away and first Cousin aw has a birthday, then Next Person, followed by… until it gets to hers.", "And she was now it's her son's turn since his baby is coming and early"]}