{"id": 31859, "submission_id": "1854ass", "title": "AITA for being upset at my friend who doesn’t have kids..??", "selftext": "I 29F have been friends with a girl, let’s just call her Kay. I have been friends with Kay 29F for 14 years, recently me and Kay have been hanging out more often as over the years we lost contact but then regained it. When we were in high school she had made it clear that she did not want to have children, which I was 100% supportive of because not everyone wants to be a parent. Everyone has a reason why they make those types of decisions. However, I was always just the opposite I always wanted children and a family but I never pushed that on her. Fast forward 13 years down the line, when we reconnected for the first time since 2012 last year. I am a delivery driver for doordash and my husband works nights and I don’t like to deliver alone at night. She rides with me so I’m not alone and we talk and goof off and jam out to Taylor swift and other favorite artists while I’m delivering and we have fun. She has a wild streak in her where she wants to live life to the fullest and I support her and try to be apart of her dreams as much as possible, but there are times where I have to say no because i don’t have someone to watch my children. I don’t just push them onto someone they are my responsibility I chose to have them. She will often make snide comments like “this is why I never had kids” or “kids take all your money and I’m glad I never had them.” She often proceeds to get angry with me when I choose to take care of my babies instead of go on crazy adventures with her that are spur of the moment. Another issue that I have is she doesn’t drive and she has no one else to take her on crazy adventures but me or my husband. One day she was really hyped about a concert she wanted to go to and I told her I couldn’t go because my husband had to work and it was in a big city. I have severe anxiety and I cannot drive in big cities she is aware of this she proceeded to tell me to have my husband play hooky from his job so we could go and she would pay for everything. I got upset with her and said no we have bills to pay and our children to take care of he can’t. She got upset with me and started in on the snide comments about kids as to make me feel bad for choosing to be a mom. I blew up at her and told her it was rude and inconsiderate for her to say those things to me. As I have never made rude comments to her about her not having kids or told her that “she just needed to have kids”, Am I The asshole?\nEDIT: just a little more info on the concert no tickets were bought nothing was paid for it was just a spur of the moment last minute situation, and she expected me to go along with what she wanted by having my husband “call in sick” to his job.\nCLARIFICATION DETAILS: I have delivered alone in the past and at any point I can do it alone again like I stated I always give her choice she can say no to me and I won’t get upset. I have also gone on adventures with her already I just cannot go on all all of them because I do have responsibilities. She has told me no In the past several times, she has asked me before if she could come with me more often then I ask her. So maybe the entire post should be read before making comments.", "created_utc": 1701095561, "permalink": "/r/AmItheAsshole/comments/1854ass/aita_for_being_upset_at_my_friend_who_doesnt_have/", "score": 28, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I blew up at my friend and told her she was inconsiderate for those comments she made about kids and telling me to have my husband play hooky from work Am I the asshole for blowing up and getting angry with her?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You and your friend don't sound compatible.  She's at a different life stage and probably always will be. Eventually running off on a whim for adventures with this person is going to cause problems in your marriage", "NTA. The reason you are back in her life is because everyone else got tired of dealing with her.", "NTA anybody who makes snide comments like that should know that it’s rude and uncalled for. Even if you’re thinking it, you don’t need to say it \n\nIt also sounds to me like you’re friend is using you because you have a car and she doesn’t", "NTA\n\nI understand your friend being disappointed that you can’t be as spontaneous and wild with her as you might have been in your younger days, and some of the “haha that’s why I don’t want kids” comments can be chalked off as light-hearted fun, but she definitely takes it too far.  \n\nGetting upset with you and your husband for just living your lives and going to work, rather than dropping everything to chill with her, shows a lack of maturity at best.  It’s fine that she doesn’t want to have kids but even if she doesn’t understand why you feel differently, she should at least understand that the kids themselves are, y’know, living human beings that you can’t just ditch at a moment’s notice.  Accepting that your friends have responsibilities (whether that’s work, childcare, supporting elderly family members or whatever) is a part of growing up that your friend should have grasped by the age of 29 - hopefully she gets there soon.", "Info - im curious. This *specific* incident for the concert. \n\nDid you buy tickets ahead of time and have plans to go already? Or was this a last minute thing?", "NTA, but you need to get yourself checked out if you get panic attacks from driving in a big city.", "NTA", ">So maybe the entire post should be read before making comments.\n\nWould be easier to do with paragraphs....", "So she accompanies you when you drive at night as a favor. What would you say if she didn't want to join you on your drives and made you lose that stream of income? Who watches your kids when your husband is at work and you're driving? Does she get a percentage of the delivery income for accompanying you? \n\nIt sounds like she constantly does you the favor of deliveries and you use your kids as a reason not do join her on her favors/adventures. \n\nYTA", "NTA\n\nYOU are her only FRIEND???\n\n\nI WONDER WHY 🤔", "NTA. \n\nListen, my best friend from age 3 (so we’ve been buddies for 32 years) is child free. She’s single. Her life and my life are nothing alike. But she has single friends to go on a wild hair with and she gets that my life includes having to account for my children and thus hanging with me takes more planning. And we do plan stuff- we go to Mexico together once a year, we do spa weekends, she’s come with me to take my oldest to his out of town swim meet and ended up being everyone’s “favourite parent.” She comes over and my husband makes us a fire out back and we smoke up and sleep under the stars. We have fun! But she gets that right now I can’t take off to Amsterdam with her at the drop of a hat (which she did last week.) She gets that I cannot and will not be able to just take off to a concert, or a cabin, or stay out for 48 hours straight during festivals. She does those things with different friends! \n\nWhen my husband retires from the military and my kids are off at university (which will only be in 10 years!) She knows I will absolutely tour the world with her and we’ll have a blast. But now is not that time. \n\nI had another friend I knew since HS and she decided to be child free and then got on my back when I had a newborn that I wasn’t “putting enough effort” into our friendship. I explained that our friendship was not my priority right now, my children were. So she could either come hang out with me and my kids, see me infrequently, or our friendship was over. She chose over. Which sucks, I liked her. We had good times together and got along well. But she was insecure about her lifestyle and didn’t want to be in my kids’ life so our time had run its course. \n\nShe needed a reality check. Friendships operate within boundaries. But c’est la vie.", "NTA. You needed to push back on this. You are respectful of her choices and she needs to be respectful of yours, otherwise it's not much of a friendship.", "NTA\n\nYour \"friend\" is a bully. It's fine that she doesn't want to have kids, but she has no say on how you should live your life. It sounds to me that she's very childish and doesn't understand that your children come first.\nShe doesn't respect you, and it's not your responsibility to take her wherever she needs to go. If she wants to do something, she can find a way. It's not your job to keep her happy.", "NTA.  Your friend needs to learn to take \"No\" for an answer.  She also needs to learn to figure out how to live her life without being dependent on you.  It's fine if she doesn't want kids.  But she should understand that other people do not regret having kids at all.", "NTA\n\nI get that she's disappointed you can't just drop everything on a whim  like she can.  However, as a responsible parent, you can't just drop everything on a whim like she can.  This is her problem to solve.  Further, you aren't her personal taxi.  She can take a bus, a train, a cab, an uber, a bike, or walk to the \"Big CIty\" like any  other functioning adult.", "NTA.\n\nShes sour because you don’t have as much time for her because of the kids.  She needs to get over it and realize that she’s not front and center in your life the way it used to be because your life has entered a different phase and you have responsibilities that you didn’t used to have.", "NTA \n\nWhat I would say though, also a parent. I feel for most of us, there are instances where we genuinely want or need to be home (with family, kids or even on our own). Then there are times when something we’re really interested in doing, and we make the necessary arrangements. \n\nFor me it’s the in-between. Someone asks to do something, your kinda in and kinda out. We convince ourselves that we should be home with the family, or use that as a reason. \n\nYears ago I stopped saying “my kids”. I’d just say sorry, I have other commitments that day, and more and more often I’ve been saying that isn’t something I’m interested in doing. I’d I were, I’d probably figure out a way to make the time", "NTA - she started badmouthing parents, etc, so that makes her an AH and you responded in kind. Ok so she doesn't want kids, etc, but that doesn't give her any right to talk trash about those who did have kids. Not to mention expecting you and your husband to bow down to her requests.....people have lives and can't just up and change it to suit you, but apparently she fails to realize that. Sounds like it's time for you to kick her to the curb. May have been great friends when you were younger, but she hates that you put responsibility before her.....I mean if you agreed with her and had your husband play hooky, then what happens when something can't happen because he didn't make the money that needed to be made....I bet she wouldn't be receptive to paying you back for that missed time off work that your family needs the money from. Yeah she's bad news......and she's doing nothing but mooching off you and your husband. She's reached the limit and she's the only one to blame when you kick her to the curb. It's not an easy thing to do but you and your husband must do what is right for your family....she's old enough she needs to take care of her own shit", "NTA Sounds like your friend doesn't really want to grow up and wants her partner in crime whatever the cost. Probably finds the child and husband to be an unneeded distraction. Not sure if the relationship will be compatible. You have been together for a long time. Hope you can patch it up, and keep enjoying each other. Does she have anyone else in her life?", "Definitely NTA. You are choosing to honor the commitments you have already made and to take your responsibilities seriously. That's a choice you made a while back and you're sticking with it. She is asking you to throw those responsibilities off, but doesn't seem to appreciate that doing so will adversely affect your finances and that it would go against your own values to do what she suggests. \n\nMaybe you should have a conversation in which you lay out that while you value her friendship, you are on different paths in life and you won't be changing yours to be more like hers. Some people find satisfaction in having the freedom to do whatever they want at any moment. Others find satisfaction in taking on responsibilities and goals and achieving them. Lots of people are somewhere in between.  This doesn't mean you can't be friends, but it does mean that you won't be joining her on her adventures. You can lay all that out and see what happens from there.", "NTA- sounds like she is using you- as soon as you're not available to her she turns into a bully. \nI'm not sure she's that good a friend.", "Nta", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 29F have been friends with a girl, let’s just call her Kay. I have been friends with Kay 29F for 14 years, recently me and Kay have been hanging out more often as over the years we lost contact but then regained it. When we were in high school she had made it clear that she did not want to have children, which I was 100% supportive of because not everyone wants to be a parent. Everyone has a reason why they make those types of decisions. However, I was always just the opposite I always wanted children and a family but I never pushed that on her. Fast forward 13 years down the line, when we reconnected for the first time since 2012 last year. I am a delivery driver for doordash and my husband works nights and I don’t like to deliver alone at night. She rides with me so I’m not alone and we talk and goof off and jam out to Taylor swift and other favorite artists while I’m delivering and we have fun. She has a wild streak in her where she wants to live life to the fullest and I support her and try to be apart of her dreams as much as possible, but there are times where I have to say no because i don’t have someone to watch my children. I don’t just push them onto someone they are my responsibility I chose to have them. She will often make snide comments like “this is why I never had kids” or “kids take all your money and I’m glad I never had them.” She often proceeds to get angry with me when I choose to take care of my babies instead of go on crazy adventures with her that are spur of the moment. Another issue that I have is she doesn’t drive and she has no one else to take her on crazy adventures but me or my husband. One day she was really hyped about a concert she wanted to go to and I told her I couldn’t go because my husband had to work and it was in a big city. I have severe anxiety and I cannot drive in big cities she is aware of this she proceeded to tell me to have my husband play hooky from his job so we could go and she would pay for everything. I got upset with her and said no we have bills to pay and our children to take care of he can’t. She got upset with me and started in on the snide comments about kids as to make me feel bad for choosing to be a mom. I blew up at her and told her it was rude and inconsiderate for her to say those things to me. As I have never made rude comments to her about her not having kids or told her that “she just needed to have kids”, Am I The asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  So your friend is footloose and child free but depends on others for transportation?", "NTA. She knows who you are and what your priorities are. It's selfish of her to attack you for being who you obviously are. You have made room in your life for her, and for the friendship to be equal, she needs to do the same. She also needs to respect your limitations like not liking to drive in the city. It sounds like she's using you a bit and trying to guilt/intimidate you into doing things you're not comfortable with. That's not very friendly.", "No ticket were bought or paid for it was last minute spur of the moment", "I have been checked out I am on medication for my anxiety, but I still try to avoid anything that triggers it which is why I do not attempt to drive in huge cities like for example, Houston, Dallas, Little Rock big metropolis cites like that.", "Nah, that shit's legitimately anxiety-provoking if you're not used to it.", "That's bs. I get anxiety driving in cities too. It's not a fatal flaw", "I will work on that thank you for you input", "Yeah, the other comments all seem to be glossing over this. The friend might have been slightly AHish about the concert situation, but it sounds like she's been doing constant favors for the OP and hand-holding her through her job for free because of OP's uncontrolled anxiety... so she probably figured she was owed something in return.", "First and foremost if she did not accompany me I would still have the stream of income I wouldn’t lose it I always give her the choice if she wants to come or not she is perfectly fine to say no and I would still deliver at night it is always her choice not mine. She can say no and she has plenty of times. I do not use my children as an excuse not to go with her, the person that watches my children typically only watches them so I can work which is a necessity for income. I have gone on some adventures with her when I was able to so it’s not that I haven’t done things with her because I have I just don’t have the space to include every single thing that we have done together. The fact still remains I am not going to have my husband risk his job for something like that we do not just call in sick over her we work. She was well informed that if it doesn’t line up with the schedule we have then we cannot just drop everything because childcare is not easy to get on a short notice. She agreed in the beginning.", "But there's a clear difference in the kind of favours OP is asking vs her friend, plus a clear difference in their individual availability.\n\nIt sounds like OP's friend comes with her as a regular and predictable time comittmment. Even if it isn't predictable, it makes sense that a single person without kids can do these things at a whim in the way OP can't. OP is NTA for not always being able to be spontaneous- if her friend wants reciprocal favours, she needs to ask for ones that are actually feasible.\n\nI'm sure OP would do favours for her friend if the friend actually allowed her to schedule them. It sounds like her and her husband already do a lot of driving the friend around. I'm all for balance in friendships, but obviously when OP has two kids depending on her and a husband who works long hours, she is not going to be able to be spontaneous and it's completely unrealistic to expect that she just drops everything.", "NTA then at all", "It's a fatal flaw when you get a panic attack and can't control your vehicle anymore. If you kill someone by crashing in to them due to a panic attack, I don't think you'd argue the same.", "Let me be clear I cannot drive in big metropolitan cities the city we live in is small, my anxiety is controlled I am in n medication for it and like I said down below she is always given a choice and there are times when she asks me if she can ride with me but again Reddit doesn’t give enough space to put every little detail into a story", "She's still helping you when she can because she cares about you and values your friendship. It's important for friendships to have a certain level of balance. Even if you have other priorities, you should make time for your friend and care for her in return.\n\nYou should also try paragraph breaks and punctuation so your writing is easier to read, but that's a separate issue.", "Considering she doesn’t do it, and avoids driving in big cities your point is completely irrelevant.", "You clearly said that she goes with you because you don't want to deliver alone at night. That's anxiety. It's not her responsibility to do your job for free alongside you because you're scared to be alone. If your job feels that dangerous to you, it's not the right job.", "Thank you for your input!", "I also clarified in the comments that she has said no plenty of times and it would not bother me to deliver alone as I have done it in the past the only anxiety that I have is in big metropolitan cities that’s is the only thing that I stated I have anxiety just because I don’t like to deliver alone at night does not mean I have anxiety over it at any point she can say no I do not make her go", "\"The only anxiety I have is the one I will acknowledge, this other thing that is very clearly based in anxiety to any outside observer doesn't count because I don't want it to\" \n\nYeah... good luck with all this.", "You have a valid point and I can kinda understand that but again, I have done it alone in the past and at any point I can do it alone again like I stated I always give her choice she can say no to me and I won’t get upset would I prefer to have someone with me yes but do I have to have someone with me absolutely not and that has been made clear to her and I have also gone on adventures with her already I just cannot go on all all of them because I do have responsibilities"]}