{"id": 3191, "submission_id": "z45rqd", "title": "AITA for telling my mother she does not get to be part of fundraising/financials of my cancer diagnosis?", "selftext": "I'm a 22y/o F with cancer. I won't go into specifics to stay anonymous, but this is the 2nd time I've been diagnosed with a Bone Cancer. Before I was treated outpatient and this time I'm inpatient in the hospital for a full week with 24-hour chemo. It's debilitating to say the least. My family doesn't come from wealth and we barely have been above the surface even before I was diagnosed. The first treatment, we set up a gofundme and fundraisers to help pay for my treatments and surgery.\n\nMy mother said at the beginning of all this that I would never have to worry about finances. I was grateful, but knew deep down I would worry anyway. And sure enough, I did. But not about the Financials, but about her.\n\n Following my surgery, my mother finally (about 6 months into diagnosis) formed a gofundme, asking for an outrageous amount (I think $100,000) My surgery was well over $250,000, but was thankfully covered by insurance. However, we did have bills still that we had paid through other fundraising.\n\nI asked my mom how much we owed from surgery(prior to calling billing and asking for the itemized statement). My mother said that we still owed over $50,000 and she had to take money from her retirement to cover it. I actually felt guilty for getting cancer and surviving such a lengthy surgery. My mother said the gofundme would be used for my medical bills but also to pay her back for the retirement money. I later found out that insurance did cover everything and that we didn't owe/pay anything from my 15-hr limb salvage surgery. I was furious.\n\nAfter finishing chemo in April, I went back to work to pay off my medical bills and hopefully return to normal life. My mother didn't help with the financial part at all, most of my bills were close to collections and I ended up having to go into credit card debt to save my credit score from medical collections.\n\nUnfortunately, only after 6 months of remission, the cancer came back. I would be going back to chemo and amputating my leg that the cancer was in.\n\nI've been honest, telling my mother I wanted her to have no part in the financial aspect.\n\nShe's threatened to sue and remove me from her insurance. I've even tried compromising with her saying we could both be on the charitable account, gofundme, and any other sites used, of course with my direct supervison and joint ownership. But she's still upset and won't budge.\n\nI'm tempted to take my recovery time between chemo to create an account at a financial institution myself, start a gofundme without her, and start a venmo as well. I know that will make her very upset though and I don't have the capabilities to handle her that way. Thoughts???", "created_utc": 1669356594, "permalink": "/r/AmItheAsshole/comments/z45rqd/aita_for_telling_my_mother_she_does_not_get_to_be/", "score": 363, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I explicitly told my mother that she was no longer part of this journey financially and it could be considered rude to do that since she has taken me to most appointments and been there to support\n\n**[Check out our upcoming Reddit Talk with Iliza Shlesinger on Nov. 28th!](https://redd.it/z29rfu)** \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. She should be supporting you, not using your cancer as an opportunity to capitalize. What is she going to sue you for? Given the sketchiness of her actions, I doubt she would really want to go down that road. \n\nYou have every right to set that boundary and take the steps you are taking to enforce it. Your peace is most important right now. If she gets upset, it’s because she is losing control and the ability to capitalize on your health. That’s it. Keep doing what you need to do for yourself.", "NTA but i need clarification\n\ndid she set up a gofundme and NOT use the money for what she claimed she was going to use it for on the gofundme page? that's a fucking lawsuit and a half right there. if she raised money on your behalf and didn't pay your bills with it or give the money to you, that's fraud. she defrauded EVERYONE who donated money to YOU, and you need to hire a lawyer and press charges.", "NTA. First off I’m so sorry about your diagnosis and that on top of it all you have to deal with worrying about raising money, I’m pretty sure your mom committed fraud :/. Sending you a lot of love and wishing you a speedy recovery", "NTA. Sue you? What for? Take matters into your own hands. She sounds super shifty.", "NTA. I'm not sure if I read this right, but she started a GoFundMe, when most of the part she was talking about was already covered? Then you had to sort out financially the rest of the bits. Now she is threatening to sue her own daughter with a cancer diagnosis and take them off medical insurance (wwhhaaaat) if she can't be involved again. I'm so sorry that is insane.... I'm sorry what you're going through and wishing you the best for your treatment. It's obviously been tough news for your mother too but literally blackmailing you with something that's life / death is just cruel. Sorry, but your mum's is the AH here. Hopefully she will calm down and see sense soon when she can think more logically. \n\nI'm so sorry that you have a healthcare system where you have finances to worry about on top of all the stresses of having a life changing condition. Hopefully you get a GoFundMe sorted soon in whatever format to help ease that burden. All the best xx", "I wish you all the best in your recovery from both your diagnosis and your mom’s toxicity.  You are just trying to get well and do the right thing; NTA.", "NTA talk to a social worker at the hospital about the issue. It may not be legal for your mom to remove you as a dependant with such pending medical proceedures. \n\nDon't make waves with your mom until after the surgery. \n\nThen get in touch with a lawyer and demand every cent your mom has raised in your name and if she wants to deduct out of pocket expenses fir medical bills, she needs to give you an itemized bill of the same. \n\nIf that doesn't pan out, then talk to Gofundme and report your mom for the fraud. \n\nWhile I would normally tell you that it's perfectly logical and above the board  to use any excess charitable donated moneys for cost of living expenses after a series of proceedures related to cancer. This includes putting it in savings in case there are further complications.  However it sounds like your mom has no intention to give you a cent of the money.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm a 22y/o F with cancer. I won't go into specifics to stay anonymous, but this is the 2nd time I've been diagnosed with a Bone Cancer. Before I was treated outpatient and this time I'm inpatient in the hospital for a full week with 24-hour chemo. It's debilitating to say the least. My family doesn't come from wealth and we barely have been above the surface even before I was diagnosed. The first treatment, we set up a gofundme and fundraisers to help pay for my treatments and surgery.\n\nMy mother said at the beginning of all this that I would never have to worry about finances. I was grateful, but knew deep down I would worry anyway. And sure enough, I did. But not about the Financials, but about her.\n\n Following my surgery, my mother finally (about 6 months into diagnosis) formed a gofundme, asking for an outrageous amount (I think $100,000) My surgery was well over $250,000, but was thankfully covered by insurance. However, we did have bills still that we had paid through other fundraising.\n\nI asked my mom how much we owed from surgery(prior to calling billing and asking for the itemized statement). My mother said that we still owed over $50,000 and she had to take money from her retirement to cover it. I actually felt guilty for getting cancer and surviving such a lengthy surgery. My mother said the gofundme would be used for my medical bills but also to pay her back for the retirement money. I later found out that insurance did cover everything and that we didn't owe/pay anything from my 15-hr limb salvage surgery. I was furious.\n\nAfter finishing chemo in April, I went back to work to pay off my medical bills and hopefully return to normal life. My mother didn't help with the financial part at all, most of my bills were close to collections and I ended up having to go into credit card debt to save my credit score from medical collections.\n\nUnfortunately, only after 6 months of remission, the cancer came back. I would be going back to chemo and amputating my leg that the cancer was in.\n\nI've been honest, telling my mother I wanted her to have no part in the financial aspect.\n\nShe's threatened to sue and remove me from her insurance. I've even tried compromising with her saying we could both be on the charitable account, gofundme, and any other sites used, of course with my direct supervison and joint ownership. But she's still upset and won't budge.\n\nI'm tempted to take my recovery time between chemo to create an account at a financial institution myself, start a gofundme without her, and start a venmo as well. I know that will make her very upset though and I don't have the capabilities to handle her that way. Thoughts???\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. That’s why I don’t give money because I have no way of knowing what is really being used for", "NTA is there a third party who can oversee the fund raising? Perhaps get together a steering group so she has to share all the info. She has to be accountable to someone and it shouldn't be you. Sorry to hear about your diagnosis and I hope it goes as well as can be.", "NTA, do report her to the gofundme people asking them to keep a close eye on any financial dealings as it appears that she might be lining her pockets under the pretext which is illegal and unfair to those who contribute.", "NTA she used a gofundme to defraud people last time you had cancer and let you suffer. Do not let her anywhere near your finances. \n\nIf she’s threatening to take you off your insurance when you have cancer, she sounds like a monster.", "Even if she tries to sue, the fraud she committed (or tried to commit?) before will come out and she’ll end up in jail.", "We used a venmo that was largely part of the fundraising. From what I'm aware of, that was used for a good chunk of medical bills. The gofundme never went towards my bills from what I know (we raised about $1000ish) and she did admit to me that she used it for a gas bill, but then \"refunded it back to the charitable acct\". The hardest part is that she has shut me out of everything. I can see my own medical bills but nothing about the money, so I don't know what we've earned has gone towards her own bills. Hopefully that makes sense sense!", "Really, you need to get the money your mother stole from the go fund me.", "if i were donating to her gofundme, i would have no problem with OP using the money for living expenses. i would be PISSED if her mother skimmed the pot in any fashion, and it looks like her mother didn't even use it on her daughter and OP still had to pay medical bills. \n\nif i had donated to that gofundme i would be filing a lawsuit YESTERDAY", "you need to contact gofundme. your mother needs to provide receipts for EVERY SINGLE PENNY that she spent of that money. the people donating were donating to YOU and YOUR NEEDS. if it didn't go to you, then your mother is using YOUR tragedy to prey on the sympathy and generosity of people to make a profit for herself.\n\nevery single person who donated has a case against her for fraud.", "Holy shit that insane. I’m so sorry you’re going through this", "Ok.  You need to go to the go fund me. People and claim you don’t know where the money went. Whether or not it was used for the intended use because when you got out of hospital, your other bills had not been paid and you are afraid fraud may have been involved.  They will investigated", "Info: I'm a little confused about the medical bills. You say that insurance covered all of them, but also that you had to go into credit card debt just to pay for them. Also that your mother spent money from her retirement account to pay the bills, but that it was covered by insurance. \n\nI don't really understand the medical system in America, but is there a chance that she had to pay for things that then got refunded by her insurance, rather than just outright lying to you about having to pay it? It sounds, from the post, as if she is just blatantly stealing from you. But I always try to see the other side, as (often) the only way to a resolution is trying to understand it, rather than escalating it.", "Info\n\nI'm confused about how much was actually raised", "Nta. Report her GoFundMe if you see it.", "Yta.  All of those people donated money in good faith to your care and you let her steal it without repercussions.\n\nYour mother committed a serious financial crime.  People go to jail for this.\n\nIt's not enough to try to make sure she doesn't get to do this again.  \n\nShe should be held accountable for all of the people she stole from.", "Oh yeah. Saw a news article about an awful couple that did this to a homeless man. Got thousands donated, gave him a few hundred, and then the couple used the money to go on vacation and buy new cars.  \n\nThe homeless man sued them and they are currently paying him back. I don't remember the sentence but I'm sure it was at least a misdemeanor.", "Exactly", "So your mother threatened to murder you via withholding your insurance if you didn't let her pocket all the money people were trying to use to keep you alive.  I would blow her shit up- tell everyone, have them go to the police to hold her accountable for the fraud.  Make sure her friends, family and employer know she stole from her cancer ridden daughter, and was willing to kill her is she didn't let her do it again.", "NTA and you need therapy to help you stand up to your mother.\n\n- This woman used your cancer to commit fraud against you and countless others\n\n- Now she's \"upset\" because you won't allow her to use your cancer to commit even MORE fraud\n\n- And you're so worried about upsetting her that you've offered to let her be part of more fundraising and potentially steal again?? \n\nThis is horrible because youre at your most vulnerable and she is using your need for support and your fear of her emotions against you, just because she wants to scam people.\n\nI hope you are able to get support from other people.", "Absolutely NTA but your mom definitely is. I’m so sorry you are dealing with this while battling cancer again. The fact she is so mad that she can’t be involved in the fundraising is more proof that her intentions this time around are not good. Best of luck with fundraising and your mother.", "What could OP do about it when she herself was suffering from cancer. But she is not allowing the same thing to happen again.", "How much did she collect from the first Gofundme? If she used that money for anything other than your treatment or care that's fraud. \n\nShe can't sue you for anything, she's being ridiculous.  Please look into getting insurance through your state and apply for disability. In my state it's granted for cancer. \n\nI'm sorry for everything you are going through.", "NTA. Your bills not paid. But she reimbursed herself 50 thousand. For something the insurance paid in full. She threatens to take you off her insurance and sue. She needs think about fraud the way this is wrote. Keep her away from any go fund me type accounts. Hope this is your last surgery, and you go into remission and stay there.", "NTA.  Do you have another family member who can help you?  Your dad or grandparent?  Someone with leverage over your mom?\n\nYou don’t need to be dealing with this on top of what is going on with your health. I am so sorry you have to deal with this.  If there’s no family member who can sort this out I’d go to a lawyer, not to sue but to understand your options and to put the fear of god into your mother.  \n\nAlso look into Medicare and Medicaid. In your situation you should be eligible for these and that might be a better option. Especially if you can keep your own go fund me money.", "NTA so she's using your cancer to get money for herself when people donating think it's to help you is this not fraud?", "We have the same mother? Sorry but I get it, boy do I get it.  Keep texts, emails, phone conversations with mom. Sorry but they don’t change.  Put your health and safety first.", "I would threaten to post publicly every receipt of every bill and demand an accounting of every supposed payment she made from the funds raised. Absolutely put her ass on blast. And get ahead of her ass with a gofundme before she does something.", "Cancel insurance on your own kid who has cancer? Wtf? Yeah it's tell her if she tries that I'll get a lawyer to prevent that from happening and procedure to get her investigated", "So to summarise your mother is financially abusing her seriously ill child and has defrauded people on GoFundMe? You are definitely NTA. At this stage I think you need to prioritise your treatment and whatever you need ensure that’s covered but once you’re through that, you probably have excellent grounds for a lawsuit against your mother to recover the funds that were meant for you. GoFundMe/ the people she defrauded definitely have grounds as what she did is an offence.", "NTA. I’m usually a lurker but osteosarcoma is a topic very close to my heart - especially when you add in a mother who seems to want to cause more pain than literally the most painful cancer already does. \n\nYour mother sounds like she is using your suffering for her own gain in some form or another - money, sympathy, what have you. Normally I try to see things from both sides, but this kind of manipulative crap is where I draw the line. You are a damn warrior and you have every right to tell your mother she’s wrong. Honestly, I wish I could tell her myself. She should be cherishing you and supporting you in any way you need. \n\nPlease know that you are 100000% NTA, you are strong and capable even when you don’t believe that you are, and that you have people who don’t even know you cheering you on and thinking of you.\n\n(If you want to peep my post history, you can see why this is such a passionate topic for me. Additionally, if you ever need to talk to someone who won’t EVER hit you with meaningless platitudes [I have literally lectured oncology nurses when they’ve said crap like, “everything happens for a reason!”] I am here and my inbox is open.)\n\nI wish you every good thing I can think of and I urge you to pay your mother no mind, as your job right now is to beat that cancer into submission. I also encourage you to not fret over the costs right now, because nearly every hospital, and especially one that is capable of treating rare cancers like sarcomas, has options for payment plans / grants / waived fees, etc., and in the worst case, you kick cancer’s butt, work with a bankruptcy lawyer, and go from there. YOU and YOUR HEALTH, mental and physical, are so much more important than debt, I promise you. Medical debt is carried by most everyone (assuming USA based) who have been touched by illness, and it is so unimportant compared to what you’re dealing with.", "NTA. Your mom committed fraud with the GoFundMe. Tell her all you want it to stay on the insurance and for her to not have ANYTHING to do with the finances. She has EVERYTHING to lose if you expose her. Make sure she knows that.", "NTA. And I am so very sorry this has happened to you. Love and healing to you. Set up a go fund me and maybe get a trustee at your bank to oversee it in the event you are not well enough to manage it.", "NTA If she threatens to sue you then tell her you are going to have a lawyer look through all her financials for fraud.", "I’m curious, how did she -let- her mother do this? She had cancer, she shouldn’t have to be babysitting her mother against committing fraud while she’s trying to heal.", "She can get the financial records together and go to the police station today.  \n\nStories like hers are why I hesitate to donate to anything but a fully vetted charity.  I don't want my money going to pay for the cancer patients' mother's tummy tuck or Coach bag.", "The time to do this was when she had the strength to review the records and realized her mother had lied and stolen from her.\n\nWhen you handle someone else's money, you have a legal obligation to act in their interest.  This woman not only violated her fiduciary obligation, she stole donations.  Those are two major felonies.  \n\nDozens or hundreds of people donated money to help a specific person.  The money should go to that person.  Now, because of mom, instead of having a nest egg, she is soliciting more money.  \n\nOp is becoming part of the fraud by covering it up.", "Nta your mom is manipulating you and probably thinks she is a victim, too. She’s not. She’s perfectly healthy. Do all the steps your intuition is telling you and go low or no contact while you heal.", "NTA sounds like you need to tell your mother that you'll expose her for fraud if she tries to fuck with you.", "As a parent I can honestly tell you I have never even have envisioned the possibility of losing a child to illness let alone profiting from it. Your mother is exceptional. And that’s not a compliment. Cut her off.", "Mom threatening to take you off her insurance?  Now that's really F\"d up.  NTA", "It's even worse than that. The homeless man was in on the scam, and they got over $400,000 from people.\n\nhttps://www.independent.co.uk/news/world/americas/gofundme-refund-donations-couple-scam-fundraiser-homeless-man-a8699781.html", "This right here, the fraud on the part of the mother is the only issue here", "Where the hell is OP covering it up? She’s trying to determine next steps here upon discovering this information. She never once said she’s not going to contact gofundme about this. \n\nThis is 200% on mom and it’s astounding how you’re trying to fault OP for this.", "How long has OP known her mother stole this money and done nothing???\n\nNow she wants to know if she is TA for preventing her mother from stealing again.  \n\nThat's so wrong.  She should have reported this week's or months ago.  Police present to a prosecutor who can subpoena any documents Op doesn't have.  She doesn't need to spend a hundred hours investigating this.", "You’re forgetting that OP is in a vulnerable position here. Cancer has come back, mom is threatening legal and financial repercussions in order to maintain control in this situation. I’m not sure of the legalities of removing your adult child with cancer off of your health insurance, but I can understand the fear from this even remotely being a possibility. It’s not that OP is covering up what mom has done. OP is trying to determine next steps here given the complexity of this situation. \n\nAs I said in my previous comment, this is entirely on mom. Hiding the medical bills and financial information, ensuring OP everything was taken care of, committing fraud while OP was trying to fight cancer, then threatening OP when OP finds out and starts to make steps to create financial independence. This is abuse at it’s finest. \n\nAbsolutely OP should be contacting gofundme upon finding out this information. But they are absolutely not the asshole in this situation, mom is.", "NTA. I think u need legal advice. This is next level controlling behavior on Mom’s part and could seriously impact ur future.", "NTA as the spouse of a stage 4 patient this post made me see red. You should be in contact with a social worker at your medical institution.", "Get away from her if you can. Start a gofundme before she does so you can then report hers as a scam. If you can, move to a first world country and ask for help", "NTA. I’m so sorry you are dealing with this & you shoul be in charge of your own go fund me account. You ma also want to get a separate mailing address from your mom (like a PO BOX) if you think she would go thru or hide your mail.  I dont know if it would help but I was off work due to an injury & had no medical insurance (I live in the US), I had an obstructed gallbladder and had to have emergency surgery. I owed the hospital roughly $30 grand but I was able to apply for financial assistance thru the business office (I had no property or other means of paying it back at that time) and it was wiped out. The surgeon (his bill was separate) knocked over 1/2 off and told me as long as I paid monthly (even $5), it would not go into collections (I was able to pay him when I returned to work). So if you have any extra cost, check if you have the option to set up a monthly payment plan and as long as you pay monthly, it will not go into collections.  Also sometimes when a debt  goes into collections, you maybe able to negotiate a settlement offer (like 2/3 of the original debt) and once paid, it will be taken off your credit report.  My thoughts and prayers are with you during this difficult time🙏!", "NTA. It saddens me that she is focused on that aspect of it rather than her child getting better. Good luck to you, I hope you beat it!", ">My mother said the gofundme would be used for my medical bills but also to pay her back for the retirement money. I later found out that insurance did cover everything and that we didn't owe/pay anything from my 15-hr limb salvage surgery. I was furious.\n\nSo to be clear, your Mother committed a major financial crime and embezzled charity funds. You need an audit of that GoFundMe right now, this isn't small potatoes.\n\nAlso NTA for what it's worth.", "I'm so sorry that your illness has returned.\n\nPerhaps you could speak with the social worker at the hospital, and that person could direct you to resources that would tell you how to disentangle your finances from your mother.  \n\nIf your mother spitefully takes you off of the insurance you may qualify for medicaid.\n\nIt sounds like your mother is either not understanding the finances, or deliberately misusing them.  You need someone that you can trust to help you, OP.", "They were all looking at some hard time too."]}