{"id": 31965, "submission_id": "186hh26", "title": "AITA Uncle said not to tip at the restaurant", "selftext": "I am an Australian currently visiting the US for a vacation with my uncle and his family, (also Australian) everyday my uncle asks me to take my cousins to a local restaurant for dinner and gave me some money and he always tells me not to tip the waitress, he says he doesn't believe in tipping people for doing their jobs and he reminded me that it was his money.\n\n&#x200B;\n\nEvery time we don't tip people ask us why no tip and I shrug and said that my uncle said not to tip", "created_utc": 1701234170, "permalink": "/r/AmItheAsshole/comments/186hh26/aita_uncle_said_not_to_tip_at_the_restaurant/", "score": 19, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I didn't tip, when it was expected of me\n(2) One of the servers said she is is relying on tips as part of her wage.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "As an Aussie, I find that an appalling attitude in a country like the USA, where servers use tips as their wages. I don’t like tipping myself, but when you’re in a foreign land, you have to adapt to local cultures. Your uncle is a huge AH.", "As another Australian YTA\n\nYou know that tipping is important in the US and hiding behind your uncle being a jerk as a reason does not change that. If your uncle says no to tipping why not pay it yourself? \n\nYour age isn’t listed but you must at least be a teenager so old enough to do the right thing instead of being an AH and pretending it’s out of your hands", "YTA and so is your uncle. You're acting like you don't have a mind of your own but you do; you're either a coward or as selfish as your uncle. It's one thing not to tip if the service is bad but that isn't the case. If you all don't want to tip, don't stuff your faces at restaurants. Stay in and cook instead.", "YTA", "Many of us Americans believe that the restaurant industry is the ultimate AH for lowballing pay and benefits for their employees and relying on customers to make up the difference via tips.  That point aside, being a non-tipper in the US is absolutely YTA behavior.  Tips are used by many to supplement their horrible below minimum wage in this country.  They are not luxurious add-ons.  When you don't tip at a sit-down restaurant, it's assumed that you were either deeply dissatisfied with your meal and service or you're a cheapskate who doesn't care about underpaid workers.", "You don’t say what state your in, which impacts how much of an A your uncle is (he is TA regardless, we’re just talking levels). US waitstaff are typically paid less per hour than other workers on the theory that tips will bring them up to at least minimum wage. \n\nMinimum wage varies by state so I’ll stick with the federal minimum wage to explain the math here. The federal minimum wage is the absolute lowest someone can be paid legally, but states can pass laws for higher minimum wages.\n\nThe federal minimum wage overall is $7.25/hour. The minimum wage for tipped employees is just $2.13/hour, and the tips are supposed to bring them up to $7.25/hour. If waitstaff are not making enough tips to get to $7.25/hour, the restaurant is supposed to make up the difference but if they don’t, waitstaff rarely have the resources to sue for what they are owed. \n\nYes it’s a stupid system but you and your uncle are taking it out on the wrong people. If your uncle feels so strongly about it, he should exclusively eat at restaurants where tips are already included in service fees, also known as tipless restaurants. Why would you go to a place knowing you’re one of the worst customers they’ll have that night and then just blame it on your uncle like you have a free pass for being Australian? If Americans come to Australia and break well-known social customs, do you give them a break if they say an Australian relative told them they could?", "YTA. Tipping is the custom here. Stiffing someone doing a service for you does not do anything or send any message to anybody but a \"fuck you\" to the server. Tip.", "YTA", "Can I come to your country and stick with all my customs, or should I follow Australian customs?\n\nYTA\n\nTipping is BS, and needs to go away. However, it;s how people make a living. DO it or don;t go out. You and your uncle are assholes here.", "YTA — you’re in US, you tip. If you’re not tipping then there should be a service-based reason for it. Even then, the degree of the service issue is reflected on the percentage given. \n\nIt’s a real Asshole move to go to the same restaurant and do it repeatedly. \n\nThey definitely know who you are and you can bet the cooks know who you are too…", "The servers get something like 2.15 (like 3.25ish aus$) an hour and rely on tips. Any american that doesnt tip in u.s. is a cheapskate ah.\n\nSoft YTA since yer aussie and didnt know", "YTA. We all know the tipping/wage system in the US is terrible and unfair, but that’s the system we have and we have to use it. You can’t just choose not to pay the servers because you think their bosses should pay them, even though you know that’s how it works. \n\nWhen I go to other countries, I don’t order food in a restaurant, then decide the food is overpriced and pay less than I owe. If you don’t want to spend so much total money then go to a restaurant where the food is 20% cheaper and leave a tip.", "Tips is how waitstaff in the US get most of their pay. Minimum wage for food service is vastly lower than for anything else, because the government believes the owners, that good staff make enough tips. I would say, according to the waitstaff, YTA, but if you're merely ignorant and believing your uncle, your uncle ITA and you are his tool.", "YTA. Well, not you necessarily but your uncle definitely is. Most people in the service industry live and die by their tips. It’s is literally factored into their wages.", "YTA if you keep going along with this. If he wants to pull this kind of thing, then your uncle should be the one paying the bill himself in person.", "If your Uncle said to jump off a cliff.......\n\nYTA OP--- you will never meet a wealthy waitress in the USA.", "Aussie here. Your uncle is an asshole. Not ‘believing’ in tipping in a place where tipping is an inherent part of the wage system, is 100% asshole. \nIf you follow his lead or listen to his advice, then you are an asshole too. \n\nYou asked here because you know better. Be better.", "YTA.  you are not wrong about being mindless.  you don’t have a backbone and just do what you uncle told you to do.", "YTA. You're a visitor to the U.S. and your uncle is willfully ignorant about tipping because it serves his purposes by saving him money.\n\nThe people serving you don't get paid a living wage and rely on tips to survive. Just because your uncle is an AH doesn't mean you need to be one.", "Your uncle is a huge AH, and by association YTA too.\n\nPeople working tipped wage jobs in the US do not earn even minimum wage (not a viable living wage either). Here's a table from the department of labor of tipped wages by state: [https://www.dol.gov/agencies/whd/state/minimum-wage/tipped](https://www.dol.gov/agencies/whd/state/minimum-wage/tipped). $2.13 an hour is deplorable.\n\nPlease tip your wait staff and vote for ballot initiatives that include increasing minimum wage.", "YTA- you can afford a vacation in the US from AUS. Use your uncle’s money to pay for the dinner and pony up for a damned tip you cheap ass. It doesn’t even have to be a big one.", "The part that will come back to bite you and your uncle is the waitstaff will learn you don't tip and your service will reflect that.", "I mean I guess NTA but your uncle is a huge asshole\n\nI’ve worked service jobs in the US - tipping is the expected custom. You cannot visit a foreign country and apply your own customs to it.", "Wait, did I read this correctly? You are going to THE SAME restaurant every night and stiffing the server!?!?  Dude, you are a brave person!", "YTA \n\nAnd also, if your uncle can't deal with tipping, he should have opted for a different vacation destination.", "NAH - the real ah are the restaurants for not paying their employees a livable wage and your Uncle for not tipping since it's his money. Though you could tip and just tell him you didn't unless he asks for receipts", "Time to stop taking your cousins to restaurants for a few of reasons. You are their cousin and not their parent and he is passing off his responsibilities on you. He's TA for that alone. Then, he's using his money to control you. He's a TA for that. Finally, he's insisting that you violate the customs in the country you are visiting and this can affect how the people there view & treat you. He's an AH for setting you up to fail socially. Your parents need to know these things, especially if you are a minor (you didn't specify so I don't know). \n\nIs he otherwise abusive? \n\nI hate for you to miss out on the benefits of this trip but should he continue his BS behavior it might be best to cut the trip short, if possible.", "YTA\n\nDon’t be a c#nt. Tip a minimum of 15% for decent service.", "ESH. We tip at a sit-down restaurant (with wait service) in the US. Anyone can look up where to tip or not tip .. and how much $/%. If your uncle was smarter, then he'd perhaps try to understand *why* we tip in this scenario. The wait staff is not paid a normal wage for this job. For example, in Texas, normal wait staff will earn $2.13/hr plus tips. The minimum wage (for a normal job) is set at $7.25. And most places like fast food restaurants and retail are paying $15/hr +/-. So that's why you're supposed to tip.", "Don't tip if you don't want to not because your uncle says not to", "NTA on your end, but your uncle is a massive AH. You can't be expected to go against his wishes with his money. It's illegal to spend his money without his authorization.\n\nWhat you ought to do is refuse to take them out. Tell him if he's going to make you behave like an AH. He can do it himself.", "Only one asshole here to be honest, he's right.  It's his money so he has the right to decide how it's spent.  And tipping should be for people who do an excellent job.  The only asshole is the business that's so shitty it can't operate without slave labor.  A tippers wage needs to die and tipping needs to go back to a BONUS for a job well done.", "NTA. He is though. Tell him to go home. If you can, see if you can get your own money to tip since he obviously isn't brave enough or too lazy to go himself.", "NTA. People act like tips replace the wage but they only supplement. Servers will make minimum wage without tips. And by sitting here and getting mad at consumers for not tipping, you just let the companies win as usual. Classic infighting when you should be taking those dollars and doing something productive with em.", "Nta, tipping is voluntary and if your uncle doesn't have enough money to tip, it is what it is\n\n\nEdit: if you are always at the same restaurant without tipping, I'd consider changing it up a bit", "I always like people who say \"I like to save money so I don't tip\". Well, why don't you stay the hell home and save even more money not eating out?", "NTA\n\nTipping is for extra work.\n\nThe normal service you are expecting in a restaurant is allready covered in the menu prices .", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am an Australian currently visiting the US for a vacation with my uncle and his family, (also Australian) everyday my uncle asks me to take my cousins to a local restaurant for dinner and gave me some money and he always tells me not to tip the waitress, he says he doesn't believe in tipping people for doing their jobs and he reminded me that it was his money.\n\n&#x200B;\n\nEvery time we don't tip people ask us why no tip and I shrug and said that my uncle said not to tip\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. Servers are taxed a minimum amount based on their sales. Most of the time, their tips will cover this minimum, but if enough people don't tip or fuck up what they write on the slip (e.g. they meant to tip $13 and tipped $3), they might pay taxes on more money than they actually made. If you don't tip, you might be forcing someone to pay to serve you.", "YTA and so is your uncle 📢📢📢📢📢", "Dude the food in US is sooooo much cheaper than here in Australia. Give some of the difference to the wait staff", "There is a different in adapt a local culture and support employers to mess around with the workers.", "Yep another Australian here. Follow the courtesy rules of the Country you are in.", "Yep. TBH tipping is really a part of that US holiday experience.", "You are not an asshole if you don't tip. I don't care who says so.", "If you take care about underpaid workers, you would not go to a restaurant where you know the employees are underpaid.", "And how can it go away if you support that?", "Australian here, customs such as what? \n\nDo you have other customs that involve taking complete advantage of your countrymen, treating them almost like slaves, expecting customers to supplement their wages and be completely fine with it?\n\nPlease enlighten me.", "Having worked years in the food service industry in the US, I would be scared to do this lest something happen to my food.", "As an Aussie I agree with this. If OPs Uncle didn't want to tip he should have booked a cruise or something where gratuities are included in the cost of the trip. \n\nOPs Uncle is also the AH for going to the US when the Aussie dollar is so freaking low! No wonder he doesn't want to tip. 1USD is around 1.50AUD. When I travelled to the US it was close to even. I found things quite cheap in the US as well. 🤷‍♀️ tipping was part of the US experience.", "If I would expect that the cook do something with my food, thats a good reason to not tip.\n\nAnd I would of course never go to such a restaurant.", "Nah, the assholes are the restaurants that charge $20 for a burger and act like they can't afford to pay their staff", "You dont HAVE to use it, its the system you WANT to use.\n\nOtherwise you would change it.", "Why you dont vote for an other government?", ">Most people in the service industry live and die by their tips.\n\nIn the US. But not in Australia, where OP and his uncle are from. Tipping is not a part of the Australian culture.", "If a servant doesn't make minum wage with tips, the owner has to pay the difference as wage. Why should the kid be forced to subsidize the greedy owner of the restaurant?\n\nNTA!", "That second part isn't ops fault", "2,13$ an hour as a minimum wage by law and americas are still struggling why everyone make fun of them and their system.\n\nIm so glad i dont need to live in a country where this is legal", "If the service reflect if i gift them money or not, it was right to not tipp", "Why?", "yeah, cause the servers will hate them. for not tipping.", "Or just eating out and pay for the food.", "Lol no. Clearly you’ve never worked in food service. Any job that requires/expects/normally receives tipping has a lower minimum wage. They literally count tips as part of your wage.", "So never go out again. Got it. In a similar vein, never buy any food, clothing, or electronics again. Got it.", "How does stiffing a random server during your vacation to the US challenge anything? It doesn't. You're not sending a message to the man if you don't tip - you're being cheap.", "Unions are needed. Waitstaff need to unionise, restaurants and such need to increase their prices a little to be able to give their staff adequate wages.", "dude I’ve worked for tips in the US, it’s really not close to slavery. You aren’t being taken advantage of any more than any other job. If you told me I could trade tipped + low wage for a flat wage I would not have cared because it would probably have come out the same. There are minor annoyances but it does not matter that much\n\nYou absolutely must tip in the US because this is a social covenant and yes the system breaks down when it’s not followed but the dumbest way to protest this is to be the one breaking it\n\nEdit: I forgot that sometimes I did “gig work” (private parties usually) and we did just get a slightly higher flat rate because there were no expectations for tips and it was typically a little less than what you get with tips but still doesn’t really matter that much", "Exactly — the cooks have the servers back.", "This is a good argument for not tipping.", "American here. There are some restaurants where I live that post on their menus that the check will include a 20% gratuity (or 18%, or whatever). If the service was good, but not great, I won't tip further. But, if the service was stellar, I will definitely add to that total. I would never dream of not tipping unless the service was horrific.", "To be honest I don’t go out to eat anymore since the pandemic and quite frankly I trust very few people handling my food. \n\nIf I were to go out, I wouldn’t risk being remembered as “the guy who never tips.”", "How could you possibly know which ones are safe?", "Then don't go out to eat, simple.", "That barely covers groceries, overhead, and back of house, and you're already complaining.", "Oh sure, now that you mention it I’ll just single-handedly change an entire industry in all 50 states in millions of restaurants. Great advice, thanks", "Yes, in this story about an American waitress in America working at American restaurants, we are talking about America.", "This story is happening in the USA. When in Rome....", "$2.13 an hour is minimum \\*tipped\\* wage.\\*\n\nMinimum wage is higher. Neither are sustainable, livable wages.\n\n\\*ETA: minimum tipped wage is the amount the employer is required to pay. The department of labor expects tipped employees will make up the difference between that  pittance and federal minimum wage in tips. It's distressing when people don't tip. They're willfully punishing vulnerable workers.", "That’s how they get paid.", "Thats something between the employees and employers.\n\nAs a customer I expect that the prices covers the service.", "Maybe thats what is necessary in your country to change something.\n\nbtw. how much do you tipp if you buy cloth or electronics?", "Do you live in the USA and tipp everytime?", "Ok say its not almost like slavery, but everyone is fine with it right? Everyone expects the customers to make up for the owners greed and be ok with it right? Yet if you don't tip or tip below 20% you're the arsehole?\nWhat if you get ordinary service, not great not awful but what you expect as a bare minimum of someone doing that job, does that warrant a tip?\nWhy?\nIs tipping to reward great service or is it to make up shitty wages?\nIf it's the second then why should I pay more if the owners not prepared to?", "Do cooks really commit crimes just because someone doesn't tip?", "What if the service is shit? I'd absolutely tip in America if I visited for standard service, and more for great service, but if it's shit like order wrong, rude etc I def wouldn't.", "I dont know.\n\nBut you are right, maybe you should not visit a restaurant in the USA if its common to do something like that.", "thats how democracy works.\n\nIf you dont wait for the next election.\n\nIf everyone stop tipping, the restaurants needs to decide to pay higher wage or close the restaurant.", "Sure, but OP and their uncle are not from the US, they're from Australia, where the culture is very much anti tipping. It's an explanation as to why the uncle has such a strong attitude against tipping. I'm not saying that it's right to not tip while visiting the US, just that it's a big cultural difference.", "Sure. I was simply explaining why the uncle has an aversion to tipping.", "Then i would change the people in charge in this department of labor.\n\nIn every civilized country the employer pays the wage.\n\nI dont see a reason why the customer should to it.", "Why do the employer dont pay them?\n\nWhat happens to the money i spend on the food?", "So you're fine with people getting ~2.15 an hour? Ok...", "The issue is that when you don't tip, it's not the owners who set the wages who suffer for it. It's the workers.\n\nYou really want the owners to feel it? Don't patronise those establishments at all until they provide a livable wage. If you go anyway and don't tip those owners are still getting your money, they don't have the incentive to change, you are just choosing to give the benefit of those low wages to yourself by paying the cheaper price. That isn't going to make you the hero of the people.", "Waiters are paid below minimum wage.", "Every country really.", "Yes, I live in the US and have been tipped every server that I have ever had. Even when one spilled a beer on me, I tipped her, because **I live in America and that is what you do.**\n\nIt is the custom here. I also have been a server, and once had some old man tell me that he would not be tipping me because he does not believe in it and it it was no reflection on how good I was at my job - he was still an asshole for saying \"I know you did a great job, and I appreciate you - just not enough to actually ensure you get compensated.\"\n\nIt's rude, and you are a shitty patron if you do not tip in the US. Don't wanna tip? Don't go out.", "Dude restaurant profit margins are like single percentage points, typically 4 ish. Sometimes 0-1. The money typically doesn’t exist. If you got rid of tipping you’d just see prices raised accordingly. You’re not subsidizing greed, you’re just paying for service in a different way and yes it’s kind of dumb and silly but it’s the way it is and you just kind of do it because it’s the system that evolved. Instead of paying for that in the sticker price you pay it separately at the end, and while it seems like it’s up to you it’s governed heavily by unwritten cultural norms which is stupid and dumb but nowhere near abuse.\n\nYou’re trying to logically figure out a cultural custom when cultural customs often rarely have logic behind them. There are times you just have to accept some cultures will always be foreign and alien and when you have to interact within them you should just follow the norms (or you will be TA)\n\n15% is the minimum tip, I usually do 20%. The most I can say is this is how the culture is and it’s expected, and while it’s silly and stupid it’s not a life or death situation. But most importantly, it’s not the restaurant owners who are the abusers, *it’s the people who don’t tip*", "Not defending someone messing with someone's food, but it isn't really a \"just because\" situation. Not tipping, in the USA, when it is a well-established custom is an asshole move because you are knowingly stiffing someone who just provided a service for you.", "If you haven’t seen it, watch the movie Waiting from the early 2000s.  It’s about the staff at a chain restaurant.  Not saying all restaurants and all service industry people will mess with your food.  I’ve seen it done (my management, no less).  Not everyone in all jobs have a conscience.", "I definitely don’t think it’s common except, perhaps, in rare cases. And repeatedly mistreating the staff would probably qualify.", "Imagine no tips. The owner then raises prices by 20% to pay the servers. \n\nNow, imagine that doesn’t happen, but you add 20% onto your bill to pay the servers. But this way the server gets the entire 20%.", "Employees HAVE to pay the difference for them to get minumum wages if tips are not enough.\n\nBut it's easier for servers to shame customers into getting the money and the owner makes more\n\nWin/win/loss\n\nSo fuck tipping in my opinion, let the owner pay the difference and leave the costumers out of it", "But if he dont find employees who work for that wage he has to raise it or close the restaurant.\n\nHow many money do you get by tipp in a month?", "No.\nThe only country i know where it is so extreme are the USA.\n\nAnd you forgot to tell me how much you tipp if you buy clothes", "You are asking me what it would change if i do it as a tourist. fine.\n\nBut why do you think it also would not change if the natives of a country dont tipp anymore and are only visiting restaurants where the employees get paid good?", "Ah the razor thin margins argument.......explain to me how other first world countries can pay their servers a minimum wage that they can live on (eg $23.23 an hour in Australia) and still stay open? Prices are not that different to the US, big macs are basically the same price after conversion is done.\n\nAs a foreigner being called an arsehole for not participating in a cultural norm such as this is stupid. I think calling non tippers abusive is a huge stretch, why are they victimised and yet the people who are paying  the wages are good? \n\nTo anyone who is not American the whole tipping culture there is seen as ridiculous.\n\nAs an aside I appreciate you discussing this without resorting to personal insults as so often happens when it comes to tipping discussions on reddit.", "Thats how it works.\n\nHow many tipp do you get a month?", "Where what is so extreme? You are naive if you think that any country is free from exploitative practices down the chain. \n\nHard to respond to something that you edited in after my reply. But the answer is that I don’t , but the tipping isn’t what I responded to. It was your comment saying don’t go to places where you know they underpay workers. This world was/is built on underpaid labor.", "Where the wage is so low that the employees need the tipp to survive.\n\nI only know the USA that are so fucked up that the society accept that", "In the restaurant industry sure but my point is that you’d be hard pressed to find anything that you have that does pay the workers a “living wage”. I’m being a little extreme because it will also depend on how you think about the supply chain.", "Thats why governments pays the gap between the income and the minimum you need to live."]}