{"id": 3199, "submission_id": "z4bhca", "title": "AITA for telling my family that our children were drinking and smoking on thanksgiving", "selftext": "Yesterday during thanksgiving dinner i caught my son (13m) with alcohol in his cup. When I asked him where he got it from, he lied and said he secretly poured some when no one was looking. Which was a lie because none of the adults brought that specific brand. When I asked him again he said he got it from his cousins (all aged 13-18) and they were all upstairs drinking and smoking. Of course I told their parents, but that led to everyone arguing. Parents yelling at their children, parents yelling at each other over who’s child is the bad influence, and who’s child brought the alcohol and marijuana. Ultimately causing a lot of people to leave. Now my parents are saying it’s all my fault and I ruined thanksgiving, and I should’ve waited until after to tell them. I thought I was doing the right thing but now I’m not so sure. AITA?", "created_utc": 1669376922, "permalink": "/r/AmItheAsshole/comments/z4bhca/aita_for_telling_my_family_that_our_children_were/", "score": 486, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my family that our children were drinking and smoking. Which led to people arguing, causing people to leave. I thought I was doing the right thing, but my parents said it’s all my fault and I ruined thanksgiving.\n\n**[Check out our upcoming Reddit Talk with Iliza Shlesinger on Nov. 28th!](https://redd.it/z29rfu)** \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Yeah what the heck buzzkill, you should have waited until AFTER all the minors were shitfaced before busting them. Lmaoo the logic is immaculate", "NTA, you were just giving an honest reaction, and you’re the parent who found out. How they deal with their kids isn’t your problem.", "NTA if it was in my home I’d want to know so it could be dealt with immediately. Waiting would only resulted in drunk and high minors.", "NTA.  Sounds like they are all shooting the messenger here.  The kids lied and snuck in shit they weren’t supposed to….and that’s your fault for calling attention to it?", "NTA - Let me get this straight, you find extremely under age minors drinking alcohol and smoking and tell your family members, and it's your fault Thanksgiving was ruined? Back the F up. The 18yr olds are highly likely the ones who caused this mess, and it just shows how stupid and immature they are, thinking it's a good idea to let the younger ones join in on their secret. They ruined their own fun, if only they had kept it to 18+ only. \n(I'm not saying they did no wrong, but everyone knows that at that age you do things like this with friends so it's to be expected at 18+.)\n\nYou were the messenger and are not at fault for stopping them, if anything you hopefully stopped 13yr olds from getting seriously sick from whatever they were drinking. And whomever the parents involved were, they will hopefully deal with their kids like they should and maybe work things out with the other family members once everyone is cooled down. \n\nThanksgiving got ruined due to dumb teens doing dumb teen things while thier own parents were around. LOL", "Nta\n\nThe people in your family are trying to blame you for the truth that they were trying to ignore...", "NTA. Underage kids' drinking and smoking should absolutely be highlighted to their parents. You didn't ruin thanksgiving. The kids did by doing something they knew was wrong and then trying to hide it. You don't need to give them a pass because it's Thanksgiving. It's not like they were sneaking an extra slice of pie or feeding the dog turkey under the table. This is something that will damage their health.", "NTA. They value keeping up false appearances, even if it means letting something that can harm their grandkids continue. The younger kids aren't going to know limits and are more likely to drink and smoke themselves sick. Stopping it sooner was needed.\n\nDon't feel guilted because they'd rather bury their heads in the sand.", "It's unfortunate that this incident ruined your thanksgiving, however it's not your fault that the children decided to do what they did. Hard to say for sure because it depends on many aspects of how the situation unfolded but I lean towards NTA.", "NTA. You didn't ruin anything, other than your parents' illusions.", "NTA  did your parents think it was ok for underage drinking to be going on upstairs?? Were you supposed to let them continue and if you had what would the parents reaction have been then? I doubt they would have been grateful for you letting it continue.Your parents are wrong - the kids ruined Thanksgiving, not you.", "Smoking and drinking at a young age is extremely dangerous. And I'm not just talking about the long-term consequences. You don't want to know how many young children are hospitalized with alcohol poisoning each year. Good that you intervened right away. Too bad the adults present were not able to behave like adults and calmly try to find out who brought what.\r  \n\r  \nNTA.", "NTA - the kids drinking and smoking weed illegally ruined  thanksgiving. Do your parents not realize that if anything happened to those kids b/c they’d been doing things they shouldn’t have been doing, the home owner may be held legally/criminally responsible because there was underage drinking going on in their home?", "NTA. In all seriousness would the teens not have been obvious anyhow once they came downstairs? The head in the sand thing is ridiculous as well as blaming you as the messenger.", "Nta.  They are though", "Absolutely NTA. It is not legal for children to drink and is a  major safety issue. I mean just the part about them drinking/drinking upstairs is terrifying because they would have to walk down those stairs eventually. The other parents’ response was not your responsibility. What did your parents want instead? Thanksgiving go on as expected and a kid end up with alcohol poisoning and/or injured?\n\nI also want to add your parents are AHs for prioritizing their own wants over the safety of several children in their home.", "NTA\n\nWhen alcohol and ‘drugs’ (I don’t consider marijuana a drug-it’s medicine when correctly prescribed) are being consumed the parents must be informed. If OP would have waited and something unfortunate happened, OP could go to jail/prison. Also, if OP waiting they would have consumed more and some serious issues could have occurred- again, jail/prison. \n\nYou did the right think regardless of thanksgiving being ruined. \n\nParenting>party", "NTA", "NTA", "NTA. The person who brought the items and passed them out to kids is the asshole.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nYesterday during thanksgiving dinner i caught my son (13m) with alcohol in his cup. When I asked him where he got it from, he lied and said he secretly poured some when no one was looking. Which was a lie because non of the adults bought that specific brand. When I asked him again he said he got it from his cousins (all aged 13-18) and they were all upstairs drinking and smoking. Of course I told their parents, but that led to everyone arguing. Parents yelling at their children, parents yelling at each other over who’s child is the bad influence, and who’s child bought the alcohol and marijuana. Ultimately causing a lot of people to leave. Now my parents are saying it’s all my fault and I ruined thanksgiving, and I should’ve waited until after to tell them. I thought I was doing the right thing but now I’m not so sure. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.\n\nYou did the right thing. It‘s important not to let this slide AND they‘re adults, so they should’ve been able to handle the situation in a more mature way.", ">Now my parents are saying it’s all my fault and I ruined thanksgiving, and I should’ve waited until after to tell them. I thought I was doing the right thing but now I’m not so sure.\n\nBullshit you were doing the right thing.  When kids that old drink, that is how accidents, holiday hospital trips and disorder happen.  You were right to bring to everyones attn.  Your parents only have one thing on their minds and that is a peaceful holiday at a table which unfortunately wasnt possible.  Wishful thinking at best  You did nothing wrong  NTA", "NTA.", "NTA.\n\nSince there's no way 13-year-olds are walking into dispensaries and buying weed, that 18-year-old cousin is lookin sus.", "NTA. The parents could equally have waited till after the party to yell at their kids, if that's what's being seen as the problem. \nIf it was my kids, I'd want to know at the time, not hours later or the next day. Plus, if you tell the parents the next day the kids will probably deny it anyway.", "NTA. Those parents made the stupid decision of letting it carry out. you made the right decision of telling them.", "NTA. Also , medicine is still a drug. Ibuprofen is a drug and needs no prescription.", "Ah, getting together with the extended families for the holidays. Always so fun, making memories & stories to tell in the future. \n\nNTA", "Yeah, I'm sure the parents would have been so appreciative that you continued to let their extremely underage kids keep drinking and doing drugs so you wouldn't cause a scene at the turkey's birthday party.\n\n18 isn't a big deal to me since it's legal where I'm from, and in Europe it's not uncommon for teens to have drinks, like a small glass of wine with dinner or something, but it's all done under parental supervision and it's not massive amounts. Who knows what would have happened if you hadn't said anything. NTA, your parents should be more concerned over the drugs being given out like sweets right under their nose", "NTA.", "Nta.  They think that you should have let the teams continued drinking and smoking weed in their house? That's a no for me dog.  This is completely illogical. So if someone's stealing your mother's car you should wait until after dinner to tell her because it might upset her and therefore ruin dinner?", "Damn kids nowadays are brave AF. When I was young the most I did on family gatherings EVER was smoke a regular cigarette with my aunt that smokes so much I can blame it on her. NTA, it is a health hazard and mixing weed and alcohol is such a bad idea especially at their age,so it wasn’t even an unlikely event. Better say something now before everyone is wondering if the teenager puking in the bathroom has food poisoning or a virus.", "NTA how is it your fault? If one of the kids is 18 as u say they are an adult and should have known better", "NTA. They would have been even more pissed to find their minor kids drunk/ high especially if you were aware of it. \nYou did what you needed to do, not your fault the parents decided to blame you for “ruining” anything. Sounds like they’re the assholes here.", "How the rest of your family reacted to their precious little angels partying has nothing at all to do with you. NTA. Are you all getting together for Christmas by chance? If so I'd love to hear how that goes!", "You know what they say about snitches right? Jk, NTA, if only the 18 years old were drinking and smoking maybe a little ah but 13 is a bit to much to let it slide", "I’m calling your bluff on being able to tell the brand of alcohol by looking at it in an unlabeled cup.", "NTA. Of course you did the right thing! These adults would have been happier for their 13-18 year old CHILDREN to get drunk and stoned instead. I’m sure they would have been livid if that happened and you said you knew it was happening but didn’t want to ruin their day. They sounds like ridiculous, selfish, and irresponsible parents.", "I find it a little hard to believe that someone needs to come to reddit to seek approval for telling people their kids are upstairs getting high", "NTA, for bringing it up, but then as parents you should have all shown a united front.\n\nWhichever parent started the blame game is the one at fault here.", "How did the cousins get the alcohol? Thought you had to be 21 in the US.", "NTA, but personally, I don’t see the problem with a 13 years old drinking light alcohol (beer, wine, cider) but maybe it’s because I’m french", "Honestly speaking, is it great that Kids are drinking? No. But it is better for them to do it in an environment where parents are nearby. Kids are going to test their boundaries no matter what; your son telling you Shows a great Level of trust that should not be discredited because of “snitching”.", "YTA for being a snitch... even your parents think so.", "This.  NTA", "Yeah, exactly. Any anger towards OP ruining Thanksgiving needs to be redirected towards the kids who actually ruined thanksgiving", "Opiods are medicine when correctly prescribed and help a lot of people. But when abused it gets you high and can ruin lives. Same for Marijuana. And yes, mj can ruin lives including causing car accidents because it majorly slows down reaction times. Also, it messes with developing adolescent brains and there has been plenty of research to prove that.", "If OP had waited until after, they would still be getting shit.", "INFO: if this was all in the same house, how they hell did no one else notice the smell? Cigarette smell is bad, pot stench? That’s unmistakable and worse.", "They were smoking weed and no-one smelt it? That stuff gets everywhere. Were all the adults locked in the sex dungeon or something?", "I think this would be a great time to consider why all of the children in your family decided to use substances to get through a family event and why your family blew up at this revelation. N T A for bringing it up, but ESH sucks since clearly there’s more going on in your family that y’all need to deal with.", "Nta. What if one of the kids got alcohol poisoning? Then you would be blamed for not saying something as soon as you found out. You did right!", "I suggest you avoid all future gatherings with these people.", "NTA so if they're this mad at you, a responsible adult who sounded the alarm when you found the fire, then how mad would they of been if you did wait till the end to be like \"oh btw, all the kids were smoking weed and drinking 2 hours ago y'all\"", "NTA you are doing what a responsible parent does. It blows my mind your parents would think minors getting shit housed is just kinda cool to blow off for the sake of a dinner party. SMH they need to get their priorities straight. Other parents if they were screaming acting like jack asses, blaming one or few other particular children and their parents thats asshole behavior too.. It's reasonable to be upset about something like that but to blow up and point fingers like that wtf kind if example does that set for how problems are solved.", "NTA of course not!! What did your parents want you to do - not say anything and continue letting them get drunk and high in the meantime!? Nuts.", "NTA\n\nYour family sounds unhinged.  The correct response to finding out that a bunch of children are drinking and smoking while their parents are present is to tell their parents. \n\nThe completely bonkers reaction that people apparently had to that perfectly reasonable action does not make what you did wrong. These people need to grow up.", "Your parents don’t think a gaggle of drunk/high underage descendants would have “ruined Thanksgiving”?\n\nSounds like the fight just cleared everyone out before the vomit started.\n\nNTA", "NTA", "Absolutely NTA. My half sister, who I loathe with a passion, was allowed to drink at 17 at a cousin's graduation party. It was her first time drinking and every family member there (my stepfamily, no relation to me) all thought it was HILARIOUS and perfectly fine for her to have her first taste of alcohol since she was with faaaaaaamily. What they didn't realize was that she was guzzling it down like it was water and she was dying in the Sahara. So when she got home, her father passed out drunk, our mum was working, and I was the one who had to call the paramedics because she was screaming on the floor of her bedroom while shitting and puking herself, because she had alcohol poisoning. Couple this with the fact she had anorexia at the time and... yeah. It was terrifying. The worst part is; *I* got yelled at by everyone for calling the paramedics because it 'looks bad' to have an ambulance come to our house. So yeah, no, absolutely NTA and you might have saved someone kid from a real bad time. Any time your parents want to blame you, send them links to websites about the dangers of alcohol poisoning and how alcohol effects kids and stuff.", "NTA I'm just trying to work out the logic of saying nothing at the time for all the underage drinking and pot smoking.", "NTA. 13 is way too young to be drinking/smoking. 18+ I could see letting it slide with the drinking. They should definitely not be smoking or doing drugs.", "NTA. You acted like any responsible, worried parent would. You didn’t ruin Thanksgiving, the kid(s) who smuggled in alcohol + drugs and gave it to their underage cousins did.", "Nta. I plan on being one of \" the cool moms\"🙄 But no other child will be consuming anything illicit in my house without their parents consent. And if I find out they are with my child, I will tell their parents and deal with my child accordingly. \n\nEach of those kids made the choice (I know peer pressure is a thing, but it's still a choice. And adults were there) and now have to deal with the consequences.", "+", "NTA. \n\nYours was the only logical and mature reaction.", "NTA", "NTA. You were the proverbial messenger who got shot. People are just angry because it’s ruined everyone’s day.", "NTA - What a dilemma  . . continue with the holiday or let the kids continue drinking until one of them gets alcohol poisoning or burns the house down . ..  NO you were not to blame as you stopped the impending disaster with the kids, just in time. The issue may have got out of hand with the FAMILY arguing and such. . . . and then your parents insisting that the holiday was more important than the health and wellbeing of the children.", "NTA. Dealing with a drunk adult sucks. I cannot imagine dealing with a drunk teenager, much less a drunk and high one", "NTA wait till the milk spills over 😂 what's up in some minds during holidays 😂", "NTA.\n\nI genuinely wouldn't care if they were older teens, but having 13-14 year olds drinking is absolutely not okay.", "NTA. So typical Thanksgiving! Glad the cousins all got to bond!", "NTA.", "Narc. YTA\n\nKids will, do dumb stuff, better they do it around family than trying stuff when there's no adults around💁‍♀️", "Did they expect you to let the teens have their own illegal celebration? What the hell is wrong with your parents that they actually prioritize their own celebration with their grandchildren/grandnephews/grandnieces's health? \n\nNTA, you did the right thing.", "NTA---They are MINORS, of course you did the right thing!", "You are NTA but to your cousins YTA because you snitched.", "Really OP was damned if you do, damned if you don’t here. On the one hand they brought it to everyone’s attention and their family’s poor reactions ruined Thanksgiving and that’s “OP’s fault”. But on the other hand if at the end of the night the parents notice that little Timmy and Sally can’t walk a straight line to the car and it comes out that OP knew, then there would be the same probably worse reaction, Thanksgiving is still ruined, and OP would have some culpability. At least this way OP can be secure in the knowledge that their parent’s claims are ridiculous.", "If it was my home, I'd be pissed off. How dare they bring weed into MY home ....and not share with the host? Downright disrespectful. Sorry. Recovering Mormon here and I'm still in the acting out phase.", "And then they would have been mad OP didn’t tell them.", "I once smuggled a couple of bottles of booze home from Mexico at 16.  Picked them up at the airport and put them in my bag.  Managed to get them in my room and enjoy a stiff drink from time to time.\n\nOn Thanksgiving one year my “cool” cousin who is my age comes over and I show him my secret stash to try and impress him.  He proceeds to down a small drinking glass worth of Rum and was hammered for the rest of the night.\n\nFucker got me busted and my dad thought I was some kind of booze hound since I had my own private liquor stash.", "Then if a kid had bad reaction to pot or is someone got drunk beyond their limit, OP would just explain “I didn’t wanna ruin the holiday”", "Or at least until one of them puked all over the turkey.", "Yeah I would probably rule E S H if all the cousins/minors involved here were college aged students, because obviously they’re exposed to that at that age. But providing your 13 year old cousin with liquor is different", "Lol I remember my cousins and I using mini bottles of liquor when we were in college but underaged. I don’t care that much about the older kids, but they shouldn’t be exposing 13 year olds", ">ESH sucks since clearly there’s more going on in your family that y’all need to deal with.\n\nWasn't the question", "Idk, Malibu has a very distinctive smell as does peppermint schnapps.", "It would be ok for 17-18 years old kids but not for a freaking 13 YEARS OLD ONES.\n\nWTF?", "I can't and I will never understand people who believe in \"no sniching\" rule. As it wouldn't be the end of the world to let 17-18 yo ones to drink some alcohol here were 13 yo kids! Any responsible parent would not let them to drink or get stoned! OP reacted like every normal parent should. NTA", "OP’s didn’t “snitch,” she’s the parent. \n\nShe *is* one of the authority figures, not some 6 y-o watching from the pop up play tent.\n\nBy the time she found up the jig was up.", "I can't and I will never understand people who believe in \"no sniching\" rule. As it wouldn't be the end of the world to let 17-18 yo ones to drink some alcohol here were 13 yo kids! Any responsible parent would not let them to drink or get stoned! OP reacted like every normal parent should. NTA", "Honestly I wouldn't even ask, just check my stash.", "NTA. Those parents made the stupid decision of letting it carry out.", "Yep NTA", "TBF it’s pretty low quality research. I’m not saying kids using psychoactive substances is good. It’s unequivocally not. But thanks to the way we’ve run the drug war, research on marijuana’s effects is basically all correlation analysis on self-reported marijuana use.  People under 25 still shouldn’t be fucking around with their still-developing brains. It’d be nice if federal funds could be used for neutral studies on MJ’s effects. Heretofore it’s been hard to get the necessary approvals to study pot unless you were specifically looking for negative effects (in which case Nancy Reagan and friends got you!).", "More shit since they would have accused OP of contributing to the delinquency of their precious angels.", "I agree. The OP was in a lose/lose position. No matter what the other parents were going to be mad."]}