{"id": 32044, "submission_id": "187bli1", "title": "WIBTA for not telling my group mates to do our final and essentially getting all the credit.", "selftext": "On monday my english teacher announced that our end of semester final will be early and it will be a group project. (we didn’t pick our groups) I got put in a group with this girl I new kinda (K) , some edgar (A) , and this girl who went to my middle school who was trying to start her music career (J). J has been sick all week and K and A have been fucking around all week i’ve told them multiple times “oh let’s start the project” they ignore me. I already knew by tuesday they wouldn’t do anything so I asked to switch groups and the teacher said she no but she can see who does the most work and if they do nothing they won’t get points but I will. The project is due  tomorrow and I just finished but should I tell them they’re about to not get any points, and they should add more to the project  so they can get their points too.", "created_utc": 1701324561, "permalink": "/r/AmItheAsshole/comments/187bli1/wibta_for_not_telling_my_group_mates_to_do_our/", "score": 29, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I didn’t tell my group mates to do the project worth 50 points so they’re all getting 0s. (2) Because im friends with two of them and I probably should of told them to do the project.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I think the greatest favour in life you can do them is... do nothing. Hand it in and let them swim in their pool of consequences. I have no idea if this is high school or uni or whatever, but if all of you are aged 15+, and that's what it sounds like, school of any sort is to prep you for the real world... and the real world has consequences. You've already asked them multiple times. Worry about you; hand in your project. Bask in your success. And don't worry about them because, hopefully, you'll also learn something here -- these are the sorts of people you won't voluntarily work with in the future.\n\nAnd, trust me, the teacher understands all of this very well. They've seen it a thousand times. They see it multiple times, every time they assign group projects.", "NTA. Turn it in. Let natural consequences run their course.", "NTA. They know when stuff is due, they aren’t engaging. Do your thing.", "Eh.... Not exactly the asshole. Tell them, then fuck em. Get what you need to done, don't be a snitch, and just let the reality unfold. \n\nThis happened to me for a senior thesis in college. Two of us tried everything to get the third party to participate, and by the time everything needed to be buttoned up, we gave him the easiest part - an anatomy discussion. Like wikipedia shit, but before wikipedia (there was this place called a library with all these paper bricks with facts and shit in it). Anyway, guy did nothing, and we just sort of let it happen during the thesis defense, jumping in to demonstrate we knew what was up, but not enough to cover.\n\nWas that right? Who cares. We tried really hard for inclusion and the *bare minimum* of performance expectations, and were not interested in failing ourselves.", "Ethically speaking, it's always good to give people a chance to correct their course. However, you've already attempted to engage them multiple times with no success. So, it's not like you haven't tried. If you decide to tell them, it could be a wake up call for them to contribute, even if it's last minute. If you choose not to, consider it a tough love lesson in responsibility and consequences. Either way, you're NTA. You did the work, and sometimes that's just how group projects go.", "The only one I would give a heads up is the sick girl", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOn monday my english teacher announced that our end of semester final will be early and it will be a group project. (we didn’t pick our groups) I got put in a group with this girl I new kinda (K) , some edgar (A) , and this girl who went to my middle school who was trying to start her music career (J). J has been sick all week and K and A have been fucking around all week i’ve told them multiple times “oh let’s start the project” they ignore me. I already knew by tuesday they wouldn’t do anything so I asked to switch groups and the teacher said she no but she can see who does the most work and if they do nothing they won’t get points but I will. The project is due  tomorrow and I just finished but should I tell them they’re about to not get any points, and they should add more to the project  so they can get their points too.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I mean, kinda? You already set the stage for them to get graded negatively and while it would feel like a small bit of justice you don’t know what everyone has going on in their lives. \n\nI guess ask yourself if feeling like you were right and you’re vindicated is worth a classmate not graduating on time and accruing more debt? If that sits right with you, go for it.", "Why are you making it seem like them not graduating is the op’s issue or fault? They know what they need to do to graduate it’s on them if they don’t want to participate.", "That would set them up for failure later on im life."]}