{"id": 32073, "submission_id": "187mlmm", "title": "AITA for telling my husband that he shouldn’t take the day off?", "selftext": "Hello, this is my very first post here ever, I’m kinda nervous so bare with me please!\n\nMy(f26) husband(m26) has been working from home as an interpreter for a year now, its a work-from-home situation which makes it very comfortable for him since currently we’re living between his and my parents house and we’ve just became parents not so long ago (our baby boy it’s 1 month old).\n\nIt’s very difficult to find a job like his in my home country, specially one with employee benefits like this one. Still, he doesn’t earn much, specially not for us to fend totally for ourselves yet, this being one of the reasons we are still living and moving around from his to my parent’s house. I’m a freelance artist and I did my best to work until the end of my pregnancy and currently working on whatever project I can get my hands on since I recovered from my c-section.\n\nToday he decided to take the day off to spend time with us as family. I do appreciate the feeling a lot and it fills my hearts when he spends time with our son, but lately it feels like he’s looked for every opportunity he gets to not going back to work (most have been non-emergency medical appointments, but he takes the full day off), he usually brags on how good he is at his job and how lucky he is but at the same time complains about it and usually makes the “i don’t really wanna work today” comments and covers it as a joke when I call him out.\n\nI told him how it made me feel that suddenly today he wants to have a family day, been so close to the weekend and the end of the month and him already been loosing work hours with the power black-outs we’ve been dealing with in our city.   He got very mad, saying I don’t appreciate what he does and made me feel very guilty, I tried taking it back but he just log onto work and stayed resentful.\n\nI feel so sad and very conflicted, the situation makes me feel like an ungrateful partner but at the same time I don’t get to ask for free time since I must watch and take care of my little one, but he still has plenty (he even gets to watch videos and play around with his MTG decks while working)  and that feels so unfair to me, makes me feel like he’s not interested in putting on extra effort with me, for us…\n\nAITA?", "created_utc": 1701361754, "permalink": "/r/AmItheAsshole/comments/187mlmm/aita_for_telling_my_husband_that_he_shouldnt_take/", "score": 254, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my husband he shouldn’t take the day off work today when he told me he wants to have a family day with me and our baby. He got mad because he thinks I don’t appreciate his work and what he does for our family which it’s not at all what I meant, I just feel he’s looking for excuses not to make more effort for the three of us. I think I’m the asshole because I made him feel unappreciated..\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Both of you need better paying jobs. He should not be taking days off without pay until you are living on your own and have a comfortable nest egg. This is a terrible situation in which to bring up a child. Whatever you do, get on birth control until you are more financially stable.", "ESH\n\nYou have precarious employment, he has a not well paying job, you don't have a home, and you both refused to take responsible steps to prevent pregnancy. \n\nHim taking a day off, while incredibly irresponsible and stupid, is not your only problem.", "You’re mad at him for taking a day off while you’re a “freelance artist”? We all have passions, sadly not a lot of them can pay the bills, time to grow up for both of you.", "ESH\n\nHe is lazy, making no money to provide for a child that you both were stupid enough to have in this situation where neither of you have your own place. \n\nYou don’t have a job, call yourself a freelance artist all you want, you aren’t making any money and neither of you have the financial means, or maturity to be raising the child. \n\nThe only one who doesn’t suck here is the parents and the baby, and I feel bad for both to be stuck with you two", "Can someone actually explain why you had a baby whilst not having enough money to live on your own??", "cool so you maintained a sexual relationship with someone who refuses to wear a condom while also knowing that you would refuse to terminate any potential pregnancy AND knowing you can’t support a baby? yeah YTA and your husband too. hope your kid ends up okay and hope you wait til you’re actually READY before having any more", "The financial uncertainty would drive my anxiety wild. You guys need to sit down together and do some proper financial planning covering expectations and goals.", "ESH, poor baby", "ESH. If he won't wear protection and you want do anything about it either then don't have sex. It's very basic. He's not wanting to support the family now, because he's lazy.then you have an artist freelance job that I'm going to assume isn't stable or all that lucrative. \n\nThe real world sucks and having a kid is expensive. Get a that pays you enough.  If he needs to change jobs make him do it too.\n\nReally you both are just not adult enough for any of this.", "I was going to side with him but knowing it is unpaid leave changes things given the financial situation you seem to be in. \n\nESH, I think. You both need to have a conversation with each other about financial planning because this situation seems unsustainable for everyone involved including the baby.", "I always love the “these baby was unplanned “  and then they reveal that no type of birth control was being used… like yes it was planned because it wasn’t prevented. Especially when you don’t have the financial means to support a child . It’s a human being not an accessory and you chose to have a child knowing your current living situation and now you’re mad and anxious because you’re realizing the severity of it. \n\n\nYall had all the characteristics to not have children but you chose to have them so now yall have to make decisions about what’s happening next, moving out, getting a more reliable job, he also needs to make sacrifices now but considering he can’t even wear a condom I doubt he will make much sacrifices. \n\nBoth of you are assholes just for the circumstances at hand.", "ESH \n\nNeither of you was prepared to have a child, and yet you had one because neither of you took appropriate precautions. \n\nNeither of you seems willing to \"put in the elbow grease\" and work a job that pays enough to support your family.  When you become parents, sometimes you have to do things you don't want to do in order to take care of your children.  \n\nYou both need to reevaluate your priorities.", "ESH\n\nHe is a lazy moocher loser who doesn't have any interest in supporting his family. And you're a short-sighted moron for deciding to have a baby with him when you not only can't support it, much let's have somewhere to live. Mooching off your parents is embarrassing. \n\nChildren are not cute little accessories they are human beings. You should never have made one if you couldn't support it.", "So…let him spend the “family time” with your baby and do something else. Then you get your free time and he gets to take care of your child. \n\nIt’s GREAT for a new father to want to spend time interacting with his kid. Some countries even have parental leave that can only be taken by fathers. If you want him to work more or different hours, say that specifically. \n\nSoft YTA", "YTA for choosing to have a baby with this man.", "YTA\n\n>I don’t get to ask for free time since I must watch and take care of my little one\n\nWhen he takes time off work to spend time with family and help parent, it's \"free time?\" But when you do it its your job. That's pretty sexist. I was 100% with you until you said that. If you had started talking about job security and helping him improve his work habits, I would've been completely on board. But the fact is you resent not having his schedule re: work and the baby, and you took it out on him for some payback.", "NAH - It sounds like you're resentful about his job and the freedom it gives him (ie watch videos and play cards) but you're also resentful when he isn't working, which fair enough because the situation doesn't really afford it. Have you actually told your husband that you want time to yourself? You say in the post that you \"don’t get to ask for free time since I must watch and take care of my little one\" but why is that? Why can't you say \"if you aren't going to work today than I'm going to do my own thing\". Why can't he watch baby if he's not working?", "YTA for having a baby when you can’t even afford your own place and are living with your parents. you can’t afford a baby.", "NAH.  I don't blame you being worried about money with a new baby and an insecure job yourself...  but so many men get grief for thinking their only responsibility is bringing home a paycheck and not being present for their family like your husband wants to be.  You should have a conversation with your husband in a open minded way to figure out how to be more financially secure without depriving your husband of his time to connect with his wife and young son.", "it takes at least 8 weeks to recover from a c-section. if your baby is only a month old, surely you aren’t physically healed. how is no one talking about this?", "Info: is it paid time off?", "NTA. I can relate to how vulnerable it makes you feel when the chief breadwinner starts acting burned out. My first husband once got laid off and just didn't look for work for 8 months. In your case you need to talk with your husband about your financial goals and how you two are going to meet them. But you have to also acknowledge to him that you understand that he may be feeling burn out because of the baby, your recuperation, or he may just be feeling the mental burden of working full time while your main job is being the caregiver. You need to emphasize that you are on his side, and you are a team. And you need to agree that you are going to step up, too. It is hard when the children are young and you are still recovering from the birth. But set some goals for yourself such as \"I will research online part-time work opportunities to start within six months.\" Or perhaps, \"I will explore creating art products and selling them online with a goal of having an initial product line in place within six months.\" You must be so tired, I know, but you can come up with a way to speak productively with your husband, and you can help him by letting him know you are planning on helping with the financial burden. Good luck!", "ESH. Someone needs to step up and adult up to take care of this kid. Two 26 year olds with a kid bouncing between both parents house is not the responsible adult thing to do. Whatever you do, hold off on having any more until you get that straightened out.", "YTA for having a child when you can't comfortably provide for them.", "Correction you should have written \"our baby\" and not \"my baby\". Imagine you had very little time off of work and a newborn at home you love deeply and want to bond with. Now imagine everytime you tried to take advantage of free space in your work schedule that your stay-at-home spouse tells you they don't want you at home but working. Ouch! \nYes you are in bad financial straights but you both got in there together - it is not his sole responsibility to salvage your finances. If your freelancing artwork isn't enough then find steady work you can do for after your maternity leave/recovery time. Start working on your resume, search jobs that pay better and more consistently and make a plan for childcare.\n\nEdited to add: ESH", "Info: is it payed or unpayed leave?", "YTA burn out happens, if it's just one day off then that's understandable but every week that's a different story.", "YTA he took the day off of work to spend with you and the baby and your complaining seriously. You should have been grateful and let him watch the baby and you could have had time to yourself. 🙄", "YTA\n\nGet a job and put the kid in daycare or ask his family or yours to watch the kid.\n\nThe bigger question is why did you have a kid when you cannot even afford to live independently?\n\nNote:  You will have fun reading all the male bashing names your husband will be called by the Reddit brigade.  It will make you feel so empowered and warm and fuzzy.", "INFO: was this a planned pregnancy? If so, why have a child if you cannot afford somewhere to live? And if your finances are tenuous enough that you’re worried about his job, that’s another red flag as new parents. \n\nUnless his work says something to him about his attendance, I would trust your husbands judgement.", "Depends. \n\nGuess how many people on their deathbed say, \"I really wish I'd worked a bit more instead of spending time with my family.\" None! However, if you can't feed or clothe the family because of these random days off - or if, like you say, he's the only one that ever gets breaks, that's another story. \n\nIf you can still pay the bills and if you can share the burden equally, I say be grateful for a man who prioritizes being with you. Many don't. You won't look back and regret time spent with family, as long as your basic needs are met.", "NTA. You don't have much money and he doesn't want to work? He can't wait till the end of his work day to play around, or give you a break, which doesn't sound like he would do. I would be trying for more hours, not less. You are raising a family, and it's time to buckle down and start bringing in some cash. He can work first, play later.", "NTA.. When do you get a day off from your family?", "Don’t let him use his pouting to manipulate you. He needs to work and risking his job is not okay. So stay on him. Let him throw a fit as long as he doesn’t skip work.", "YTA. Maybe get a job yourself instead of living as freelance? Don't get me wrong, I'm one myself, but if you can't afford your kid, it's time to get a Stabler job", "You feel that way because he isn't interested in putting in extra effort for you or your baby. He's lazy and is just skating by doing the bare minimum. You don't even have a place to call your own, both sets of parents are supporting all three of you, and neither really seem that motivated to do better for yourself. Yes, you're 'grabbing' freelance work when you can but that doesn't consisently pay the bills or support a family. Tell him it's just really had to appreciate the bare minimum but sure hope he gets his MTG cards sorted real nice. NTA, good luck.", "NTA.  Your husband is a gaslighting narcissist!  I'm so sorry you have to put up with that!  C-sections are HARD (I had 3 myself)...Husband needs to stay dedicated to working - otherwise he might find himself quickly UN-employed and then what are you gonna do?!?  It sound like he doesn't take this job seriously at all.", "YTA. He's trying to bond with his child and be a good father and husband - and gets nothing but complaint and criticism from you.\n\nHe must be wondering why he bothers.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHello, this is my very first post here ever, I’m kinda nervous so bare with me please!\n\nMy(f26) husband(m26) has been working from home as an interpreter for a year now, its a work-from-home situation which makes it very comfortable for him since currently we’re living between his and my parents house and we’ve just became parents not so long ago (our baby boy it’s 1 month old).\n\nIt’s very difficult to find a job like his in my home country, specially one with employee benefits like this one. Still, he doesn’t earn much, specially not for us to fend totally for ourselves yet, this being one of the reasons we are still living and moving around from his to my parent’s house. I’m a freelance artist and I did my best to work until the end of my pregnancy and currently working on whatever project I can get my hands on since I recovered from my c-section.\n\nToday he decided to take the day off to spend time with us as family. I do appreciate the feeling a lot and it fills my hearts when he spends time with our son, but lately it feels like he’s looked for every opportunity he gets to not going back to work (most have been non-emergency medical appointments, but he takes the full day off), he usually brags on how good he is at his job and how lucky he is but at the same time complains about it and usually makes the “i don’t really wanna work today” comments and covers it as a joke when I call him out.\n\nI told him how it made me feel that suddenly today he wants to have a family day, been so close to the weekend and the end of the month and him already been loosing work hours with the power black-outs we’ve been dealing with in our city.   He got very mad, saying I don’t appreciate what he does and made me feel very guilty, I tried taking it back but he just log onto work and stayed resentful.\n\nI feel so sad and very conflicted, the situation makes me feel like an ungrateful partner but at the same time I don’t get to ask for free time since I must watch and take care of my little one, but he still has plenty (he even gets to watch videos and play around with his MTG decks while working)  and that feels so unfair to me, makes me feel like he’s not interested in putting on extra effort with me, for us…\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "Ya should've let him take the day off so he can care for the baby while you got much needed rest. Talk to him when he's not upset anymore and next time let him take on some of the responsibility too.", "There absolutely is a right time to have a baby and this isn't it! Having your own place to live is a great start!", "Unfortunately I would say you’re both the AH in your own ways…is it fair the reaction he got to you addressing your feelings? Maybe not. But at the same time, I’m sure he has his opinions on the $ you contribute with the freelance artist position you hold. I would have to side with the majority and say you both should be job hunting for better paying jobs, and move towards finding a work life balance where you can both bring in steady income and enjoy your hobbies and passions, and save for your own apartment or house if you have the ability to use staying with your parents to save up for a down payment on a house. As unfortunate as it may feel, it’s hard to get ahead in this economy without sacrificing the comfort of what you two are doing now. Hopefully you both can find fields that can utilize what your already good at! Best of luck.", "Yes, you’re an asshole. So is he.", "ESH. You both chose to have a baby while not financially stable enough to care for it and you're surprised this situation arose?", "INFO: what does he do on the \"family days\" that he takes? Is he taking the baby, doing chores, or going on outing with you or is it \"me time\" for him?", "Congratulations, he has successfully baby-trapped you.  You better find a steady job and do it quickly, because he is not interested in supporting you and the baby.  I would be very surprised if he's working at all six months from now, and he likely won't be taking care of the baby, either.  He'll continue to manipulate and gaslight and guilt-trip you all along the way to convince you that every problem is your fault, and he'll insist that everything would be great if only you weren't so awful to him.  Good luck.\n\nESH", "This is good advice for the OP. Especially the birth control suggestion. Cervical caps are cheap and effective.", "Why is birth control just on her though? Husband also needs to wear a condom.", "Can't believe I had to scroll this far for this. There is a long list of more serious problems here than him taking a day off", "something something something \"having babies isn't just for the rich\" \"there's never a right time\". In seriousness, perhaps they were in a better financial position before her pregnancy. The gift that keeps on giving is that pregnancy can absolutely wreck a healthy body and OP had a c section which is an unforeseen circumstance a lot of the time.", "It makes me laugh when I try to be gentle with my answers here, and then when I look at the top comment, it’s someone saying the same thing, but I way more effectively lmao. DONT HAVE KIDS YOU CANT AFFORD", "It's a little late for that to matter isn't it?", "this is so elitist", "Get off your high horse.", "Tbh we weren’t planning for this baby, but one of my conditions in our relationship is that I wouldn’t get a termination if I ended up pregnant cuz I would never had the heart to do so (he doesn’t like wearing protection, one day we messed up and got pregnant)\n\nWe both wanted this child from the beginning, each of our families are happy and willing to keep helping us, made promises to work harder and set expectations for each other.\n\nBut this is the kind of instance in our relationship that makes me wonder if i am the only one putting the elbow grease into our new family", "Unpayed leave, taking the day off would mean they cut from his pay if he doesn’t recover the lost hours", "If they can't afford to live and are moving back and forth between their parent's houses, neither one of them should be taking time off right now.", "Baby is a month old and she's still recovering from a C section \"get a job\" isn't the most pragmatic option for OP right now.", "That's a tough situation. It sounds like you're trying to balance his wants and needs with what is best for him. Ultimately, it's his choice and you both have to respect it. His mental and physical health is more important in the long run, so try to make sure he makes an informed decision.", "Christ on a motorbike, he's neither gaslighting or a narcissist. Is he (AND OP) both immature? Absolutely. But stop using terms incorrectly - it just demeans it when they actually do apply to a situation.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Because she is the one writing in. I can't give him advice. I can tell her that when it's your body or your wallet, trusting someone else to protect you isn't always the smartest decision. A person who doesn't want to have children needs to take steps to prevent it independent from their sexual partner.", "But he doesn't liiiiiiike them. /s", "also get some birth control doesn’t necessarily mean her. it can be “go get condoms” or “help your husband get a vasectomy” or other options", "They BOTH need to be using protection (him condoms, her BC) but just because he’s an irresponsible *insert choice words* doesn’t mean she needs to be one too", "Do you really want him to pollute the gene pool again?", "Yes he should have taken steps to prevent pregnancy.  So should she. There's many birth control options - even use cycle tracking and avoiding sex at fertile times and pull out otherwise is preferable to what it sounds like they did - which was nothing.", "Seeing OP’s comments, they were not. Husband doesn’t like condoms and baby was an “accident” (accident in quotations because I don’t think you get to be surprised when you’re not using protection and you get pregnant).\n\nThere’s never a right time but there’s *certainly* a wrong time.\n\nThat said, my son was an emergency c-section birth and I had a fuckton of complications so, can confirm that part is not fun for anyone.", "The “there’s never a right time” people really piss me off because they completely dodge the point. I agree with the high level notion of “there’s never a right time”, but you bet your ass there’s absolutely _wrong_ times. And having a baby during a wrong time is selfish", "As someone who got pregnant when mine and my husbands combined income was 6 figures \n\nFucking this! \n\nI hate seeing the question wHy dID YoU hAVe KiDs if YOurE brOKe\n\nMaybe because life isn’t all sunshine and rainbows and the best plans can’t control for outside factors. It’s 100% the welfare queen stereotype influencing people’s perception of low income families and I wish it would unalive", "A c-section being unforeseen just indicates a lack of foresight.", "This. Why kick someone when they're struggling if they can't change it? People all over the world live together with their families. It's only bad for the kid if it's a hostile, negative environment. Most of us would probably be better off if we were raised by our parents AND grandparents and made more of an effort to be a community and love each other.", "they weren't suggesting they try and put the baby back", "the question is completely fair. there's nothing 'high horse' like about wanting to know why two people had a kid they are not in any way prepared to care for.", "Not a high horse they’re married with a kid and can’t even afford a single rent payment? And her husband is missing work already for “blackouts” and is taking off more time", "So you're surprised that the man who can't be bothered to put on a condom, won't put in minimal effort for your family? Funny that.", ">he doesn’t like wearing protection,\n\nthen you shouldn't have been having sex. what you both did was completely irresponsible, and unfair to your parents and your child. accidents can happen, but its hardly an accident when you take zero precautions.", ">makes me wonder if i am the only one putting the elbow grease into our new family\n\nI mean your employment history wasn't exactly solid before getting pregnant either so you can't really judge him for wanting a day off. You only know what you think you know about his job.\n\nInstead of being upset he's taking a day off, perhaps try to actually get him to parent your child when he's not at work.", "If you weren't on birth control and he wasn't using condoms this baby WAS planned.", "I can’t even begin to express how irresponsible you both are. Unless you are in a country that birth control methods are severely limited and hard to obtain, y’all did this to yourselves. I’m sure both of your parents just love having their household disrupted as you go back and forth.\nI would say Everyone Sucks Here (except your parents)  but your husband is the one who decided not to use a condom (and you went along with it) so you’re both stuck now. He has to step it up with work and you need to figure out steady work even if it is something tedious and also remote work. The dream of choosing to be a freelance artist went away when y’all got pregnant. You are both the A-holes btw.", "Your husband refuses to wear a condom? So what have you done to help rectify the birth control situation! What birth control are you on to help not get pregnant?\n\nSorry, but if your situation is so bad financially, you need to get a job. Not freelancing art, but an actual salaried job. Find a way to make it work. Both of you are clearly a bit useless, but you have a choice to fix that and improve your lives.", "It doesn't sound like either one of you is \"putting the elbow grease\" into it. You're shuttling between parent's houses, with a child you were not prepared for and are ill-equipped to take care of right now.\n\nYou're clearly bothered that he goofs around while working, he clearly doesn't want to be in the job he is in. Sure it sounds like you're more aware of the finances, but you also said your job is \"freelance artist\" which I can't imagine provides much in the way of income, job security, or necessary things for your new child like healthcare.\n\nYou say the family is supportive, but you \"have to watch your little one\" so you can't work.\n\nIf he works from home, and you're not working, then you're all together all of the time anyways. If he's at home, with the baby, you can't pick up odd jobs to bring money home?\n\nThis whole situation just seems like a couple of irresponsible kids who made a baby out of sheer stupidity, and neither has the wherewithal to do right by the child.", "Do you realize how dumb you are?", "How long have you been with your husband?", "I'm pro-choice but termination should not be a pre-sex birth control method.", "if OP is so worried about finances she can get a job, not waiting to find a project, get a job that has a stable income", "Depending where you live, paid time off exists", "Neither is letting a guy creampie you while you don't have a stable situation.", "Why is his mental and physical health more important in the long run? Than hers?", "this is always an amusing stance.", "The phrasing “get on birth control” is putting it only on OP though \n\nBoth the parties in the relationship have a responsibility here", "Absolutely that’s what I’m saying these people are both needing to be responsible", "I don’t want either of these people having children right now, they both need to use birth control and take responsibility", "Nothing bothers me more when a woman gets pregnant because the guy, “doesn’t like condoms”. Yeah dude, no one “likes” condoms, but if you want to have sex with me, you will be using one. So what’s it gonna be? Your hand, or a condom? NTA\n\nNever ever let a guy talk you into not using a condom for his own pleasure. It’s so incredibly selfish. It’s okay to say no. If he ends things as a result, you’re better off, trust me.", "I saw a meme once that was like \"how is a bad a surprise. Maybe if your fkin without a condom and a pizza comes out that's a surprise \" was the punchline. But yeah never mind. Far as I'm concerned no accidents here. I honestly bet that if she was making enough to support them, albeit with a just barely margin, this man would not be working.  \n\nLike this is not to say he's using her. That's not the default opinion and idk their relationship and how good or bad it is but it genuinely feels like he either baby trapped her but loves the baby or he's one of those who thinks they can't be fired", "To be fair and play a bit of devil's advocate,  no one can predict a c section and she, being an artist, technically could work through her pregnancy otherwise. Maybe not so much in recovery and being s parent. Maybe having a nest egg saved up or else opting to not be bouncing between houses would be a solution though. .", "I am 100% never having kids. Dont much care for em. But I mean, I acknowledge that accidents happen. Condoms break, vasectomies aren't 100%.  Expenses and surprises happen. \n\nBut I do also have the same mindset when its someone who knows they're not ready. They dont have a permanent home and are couch surfing, they can't keep a job, they can barely feed themselves. Those are the ones im confused by. \n\nOP and hubs were both employed and married. If they were in a good place maybe a kid was the next best thing. Yea it hasn't turned out too well now but maybe circumstances were different prebaby.", "My passive income is six figures and I still don’t think I have enough fuck you money to have kids. \n\nAnd honestly until I had fuck you money to be reckless with I won’t be responsible for a child", "I mean. My godson was all set to come out like normal and the little fucker decided he didn't want to leave and went horizontal almost last second. No one could have predicted it because it had been smooth sailing the whole pregnancy.  She ended up with a c section.", "I'm not sure why you put blackouts in quotes, its actually very common for power to be cycled in some very large metropolitan cities. Op doesn't seem to be from the US, and I know from personal experience that it's unfortunately common in places like Manila or some of the bigger cities in India for rolling blackouts to occur as part of power management.", "Or at least birth control! Spermicide?? Anal sex!!? Omg", "Why is it her job to make him step up as a parent?", "Her little one is just 1 month old, obviously she has to care for him? Plus she had a c section, so needs recovery time too! Let's not have a dig at her for not being back working full time yet.", "Your statement doesn't make any sense. You cannot terminate a pregnancy before conception. \n\nDo you mean a plan? You don't get to claim you are pro-choice and then put restrictions or your particular form of morality on other people for the choices they make. Stay out of other people's reproductive choices. If you are pro-choice, then what other people choose do is not up to you.", "OP is 4 weeks out from a c-section. She has probably not been cleared to work at this time. Otherwise, I agree with you that OP, and her partner frankly, both need to be looking at more stable jobs with actual schedules and hours. Interpreter jobs can make very good money if you're actually putting in the time. Freelance art is a side gig, not a primary job-at least not until you build up your client base.", "And spend a big chunk of earnings on childcare.", "Sure, but the OP already said thats not their situation. He loses money for any time he misses.", "How does him taking the day off compromise her health?? If anything, it could give her time to rest while he watches the baby", "\"Don't worry, I'll pull out.\" One of the oldest lies ever told. Adam probably whispered that into Eve's ear.", "I asked my brother (a dedicated condom user before his marriage, at least) about this once, and he said, “It feels so good when I’m using it, why would I care about how good it might feel when I’m not using it?” He was very strongly motivated not to accidentally father a child btw.\n\nSo I don’t know if it makes less of a difference in terms of sensation to some guys, or if some guys are just really childish and petulant, despite being old enough to have an active sex life.", "This happened to me too, but my daughter decided to be ass-first, and I also had a uterine septum that nobody knew about so she wouldn't have been able to turn anyway. I 100% wanted a natural, unmedicated birth and there was no indication that anything would prevent that until I was in the hospital 8 cm dilated with a midwife's hand all the way up in my business! A lot of c-sections are planned ahead of time for various reasons which bumps up the total number by a LOT.", "1/5 births across the globe are by c-section and its rapidly approaching 1/3. It should always be foreseen as a potential outcome when considering having a baby.", "They’re doing them in Joburg right now, and Texas may have them this winter. It’s just how things are in some places where the grid can’t hack the demand.", "Uhh because that's her major issue with him and if she doesn't even attempt to communicate it then it won't change.", "First off, she wasn't working full time. She was working occassionally as a freelance artist, her words.\n\nSecondly, a one month old can be cared for by people other than the mom.\n\nThird, I know what a c-section entails and that it requires recovery. I didn't say full time work, what I said was that if the dad is at home all day, in the grandparents homes, there is likely enough support that a one month old (who is going to be sleeping the majority of the day at this point) can be managed well enough that something else can be done.\n\nThe fact is she flatly admitted that they got pregnant out of willful stupidity because \"but we didn't like using protection\" and then came here to whine that the same personality which led to this situation isn't miraculously different.\n\nIf you're immature and self-serving to the degree that you won't use protection during sex because \"I don't like it\", you're also immature and self-serving enough to keep blowing off work while mooching off a support system.", "Being pro choice doesn't mean you're not allowed to think what you want about how individual people handle their pregnancies. It means you don't think the government should be the one to make that decision. Nice virtue signaling though", "OR- hear me out- she could *also* get a wfh job. Even something part time would be more of a stable income than “freelance artist looking for projects”", "Even with pullout there is precum with viable sperm or accidents.\n\nPullout method has a failure rate of something like 12% and generally you end up with a pregnancy within a year.", "Speaking as a gay man, I've never had unpleasurable sex *because of a condom*. I will certainly say that sans protection DOES feel better, but protected sex is not unbearable, and the risks of unprotected sex far outweigh the heightened pleasure imo.", "I think that's the one instance where the phrase \"poor planning on your part does not constitute an emergency on mine\" doesn't apply. That's kind of funny.\n\nBut dang. Birth facts were admittedly not something we looked up during her pregnancy the. But yeah I'd be prepping myself if I was so unfortunate and planning contingencies.", "Are those medical emergency c-sections? Because a HUGE number of total c-sections are because of doctor convenience, outdated medical practice &/or inaccurate medical advice."]}