{"id": 32117, "submission_id": "188hqc2", "title": "AITA for telling my stepmom she's pathetic and doesn't get to boss my mom around?", "selftext": "My parents divorced when I (15m) was 5 and my sister was 3. For a while during and post-divorce my dad was trying really hard to win my mom back. I remember he would use my sister's and my upset about the divorce. For me it was hard to go from our family being together to two separate homes and families. For my sister, the upheaval was hard for her. She really couldn't get used to bouncing from home to home. Throughout all of that mom did her best to shield us and even though she must have hated my dad's guts for all the stunts he pulled, she kept some photos of him and our family from before up in the house. My sister and I felt reassured seeing them. Even though she didn't remember those times I think it made her feel a little more okay with how confusing it was, and dad only made it worse.\n\nDad gave up on them getting back together eventually and he insisted that everything we had at his house be from him and not mom and we could not have photos of mom in the home. I was 8 when he met my stepmom. I'm not sure how soon she found out that mom still had photos up of before but it became a huge deal for her and she told my mom she was not allowed photos of \"her man\" in mom's house.\n\nMy mom remarried when I was 10. We have a few photos of my stepdad's ex-wife at home and some from when he was married to her and my stepsiblings were young. This is especially important to them because their mom is terminally ill with a condition that made her unable to take care of them (I think it's something to do with her brain). There are still photos of dad at mom's too. I'm less into it now that I feel worse about what dad did. But my sister still feels comforted by them and mom always says he is still our dad/our family and she wants it to be as much our home as it is everyone else's who lives there.\n\nThe wall where these photos are is where mom takes a lot of our back to school photos. My stepmom found out they were still up and went nuts on my mom a few months ago. She told mom she had to do what she says, etc. It was insane. My mom told her to mind her business and if she stays out of her home she doesn't have to see or worry about them.\n\nMy stepmom went on a rant about mom a few days ago and she was like how dare your mom not do what I tell her and take the photos of my husband down. I told my stepmom she's pathetic for being so bothered that mom was a good enough mom to accept photos of dad for our sake and that she doesn't get to boss my mom around. I also told her to leave my mom alone because none of this had anything to do with her. She told me I did not get to speak to her that way. I told her if she thinks she's earning my respect with her shit then she's even more pathetic than I thought. It's been a rough few days. My dad and stepmom both say I was beyond disrespectful. AITA?", "created_utc": 1701452493, "permalink": "/r/AmItheAsshole/comments/188hqc2/aita_for_telling_my_stepmom_shes_pathetic_and/", "score": 2394, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my stepmom she's pathetic (twice) and she doesn't get to boss my mom around or tell her what to do. I also talked about her not having my respect... I was pretty angry and I didn't really talk to her the way I would my mom or sorta my dad (lost a lot of respect for him as I got older). Maybe I was being a bratty teen ass when I talked to her because it wasn't like I said anything respectfully...\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA respect is earned, and your stepmum bad mouthing your mum in front of you is showing you the height of disrespect.", "Nta\n\nAlso you can make it clear\r  \nThe photos of my dad are MINE and MY SISTER'S.\r  \nWe are their daughters and we have the right to have the photos we want in our house.\r  \n\r  \nAnd really talk to your mom and make sure that woman doesn't set foot in your house again.", "Wow, your stepmother is a real asshole, huh?\n\nNTA\n\nYou don't have to stand there and hear another person talk all that smack about your mother.  Good for you for defending her.", "She’s insecure. My stepmom I guess you could call her knew my dad would leave her in a heartbeat for my mom, even after she gave him two kids. He proved it time and time again throughout my life until he died.\nEveryone knew it, his family still acted like my mom was part of the family and I hear they even told my dad he was stupid for cheating and my mom was to good for him.\n\n\nSometimes it’s not fun being second fiddle but still, your mom is NTA", " nta", "There is one man at your father's house and it isn't your Dad.  NTA\n\nYou are lucky to have such a great Mom who is raising a wonderful man.", "Based on what I have read here, I think your mom would be a really good person to ask this question. \n\nPretty sure you'll get good advice from her.", "NTA. You were disrespectful. But your stepmom richly deserved it with her immature and entitled behavior. Respect--even between parental type adults and their children is something that has to be earned. And frankly your stepmom clearly did not earn it.", "NTA-your mom is showing you how respectful adults act. Yes, your parents are no longer married, but they will be your parents forever. Your mom understands that. Your stepmom just sounds psycho...maybe because she knows that the only reason your mom and dad aren't together is because your mom doesn't want it. Insecurity will wreak havoc on people. \n\nGood luck. You sound like a good son and brother.", "NTA.\n\nWere you disrespectful? Probably. Definitely, if you used the language with her that you used in your post.\n\nSome people would say respect has to be earned, but I won't go that far. I *will* say that there are valid reasons that respect can be lost, and you've got valid reasons.\n\nDoes your stepmom have any control over your life, other than being able to give you a hard time when you're at your dad's? Do you get a say on how often you're at your dad's? I can imagine that at 15, you'd get to make that choice, but perhaps your sister can't.", "NTA - your mom is my hero!!!!", "NTA, what they mean by “disrespectful” is that instead of passively obeying them, you stood il for what you know is right. Good for you. Might consider having a one on one conversation with your dad about this and let him know if he hopes to maintain a relationship with you after you turn 18, he needs to get step mom off your back.", "NTA. Make sure you set your boundaries with her and, if needed, stay away. My grandma on my dad's side always wanted to set us up against our mom after the divorce, she once locked all the doors after one of our fights because she was convinced I was gonna 'escape' to my mom's (I was around 14...). All those attempts at manipulation really ate at me more than I admitted, never be afraid to talk about it with a trusted teacher or counsellor at school. That's the kind of help you best ask for when you can use it, don't wait until you need it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy parents divorced when I (15m) was 5 and my sister was 3. For a while during and post-divorce my dad was trying really hard to win my mom back. I remember he would use my sister's and my upset about the divorce. For me it was hard to go from our family being together to two separate homes and families. For my sister, the upheaval was hard for her. She really couldn't get used to bouncing from home to home. Throughout all of that mom did her best to shield us and even though she must have hated my dad's guts for all the stunts he pulled, she kept some photos of him and our family from before up in the house. My sister and I felt reassured seeing them. Even though she didn't remember those times I think it made her feel a little more okay with how confusing it was, and dad only made it worse.\n\nDad gave up on them getting back together eventually and he insisted that everything we had at his house be from him and not mom and we could not have photos of mom in the home. I was 8 when he met my stepmom. I'm not sure how soon she found out that mom still had photos up of before but it became a huge deal for her and she told my mom she was not allowed photos of \"her man\" in mom's house.\n\nMy mom remarried when I was 10. We have a few photos of my stepdad's ex-wife at home and some from when he was married to her and my stepsiblings were young. This is especially important to them because their mom is terminally ill with a condition that made her unable to take care of them (I think it's something to do with her brain). There are still photos of dad at mom's too. I'm less into it now that I feel worse about what dad did. But my sister still feels comforted by them and mom always says he is still our dad/our family and she wants it to be as much our home as it is everyone else's who lives there.\n\nThe wall where these photos are is where mom takes a lot of our back to school photos. My stepmom found out they were still up and went nuts on my mom a few months ago. She told mom she had to do what she says, etc. It was insane. My mom told her to mind her business and if she stays out of her home she doesn't have to see or worry about them.\n\nMy stepmom went on a rant about mom a few days ago and she was like how dare your mom not do what I tell her and take the photos of my husband down. I told my stepmom she's pathetic for being so bothered that mom was a good enough mom to accept photos of dad for our sake and that she doesn't get to boss my mom around. I also told her to leave my mom alone because none of this had anything to do with her. She told me I did not get to speak to her that way. I told her if she thinks she's earning my respect with her shit then she's even more pathetic than I thought. It's been a rough few days. My dad and stepmom both say I was beyond disrespectful. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. respect is earned. This goes for all age groups. But your dad and stepmother. . . I can't stand parents who involve the kids in their drama. They sound like horrible people.", "NTA. Your stepmother (and your dad) are \"beyond disrespectful\".", "Why not ask SM  why it bothers her so much?  After all, she married a man who obviously had sex before, and OP and sister ate proof of that.  Is she worried Mom is going to take his cheating rear end back?   If that's the case, why doesn't she just pee on his leg to mark her territory?  No one would want him then.  Problem solved!\n\nNTA - and OP is being far nicer than I could be!", "NTA Your dad's wife needs to remember that she is his SECOND wife. You just told her the truth. Nothing wrong with that.", ">she told my mom she was not allowed photos of \"her man\" in mom's house.\n\nIs your stepmother deranged? Why is she talking like a teenager trying to sound tough in 2008?\n\nIf your dad accuses you of being disrespectful you should let him know there was never any respect to start with.\n\n\nNTA", "NTA but your stepmom is a huge one.", "NTA, your stepmom sounds like an AH. It’s really none of her business what your mom does in her house and clearly both parties have moved on so it shouldn’t be such a big deal.", "You are not wrong in your thinking.  You are old enough to voice your opinion and they are old enough to learn that you have an opinion.  Your delivery might be the problem.  I would say NOT THE AH in this situation. Your step mom has no right to say anything about what pictures hang in your mother’s house.  Good luck with her!", "*mom did her best to shield us and even though she must have hated my dad's guts for all the stunts he pulled*\n\nSounds like your father received his just desserts, married to such a nasty, unhinged person - a good example of FAFO.\n\nNTA", "NTA- how old is your stepmom? 16?  She is acting like an immature AH and needs to get a grip.  You did nothing wrong and don't need to apologize for anything.", "NTA. Your dad is and your stepmom is a total psycho. Respect is earned.", "You were truthful, pragmatic and thoughtful. Your stepmonster needs to grow up, and your dad needs to remember that he still has a legal and moral obligation to care for, and care about his children.\n\nYour mom is a stand-up gal, a real hero!\n\nAnd you're NTA.", "Definitely NTA\nYou should take all the photos you both have with your father to his house and tore them in half. Then give him only that portion of the picture which has his face on it. If he dared to ask you why you're doing this, tell him this is exactly what his wife is trying to do all this time.", "NTA. Normally I think stepparents get the short end of a stick that is then used to beat them down. But in this case I am 100% on your side. Your stepmom is a pathetic powertripper. I’m so glad it sounds like your stepdad is a good stepparent.", "NTA. Bad behavior doesn't deserve respect.", "Something tells me your dad is...not the nicest person in the world, based on your post. Your mom clearly isn't interested in winning him back and just wanted to give you and your sisters some comfort when you were younger. Just like having photos of your mom's husband's ex-wife makes your stepsiblings feel better, especially given that their mom is terminal. Your mom sounds like a very secure and kind person who just wants the best for her bio and step kids. Your stepmother on the other hand...NTA.", "NTA You told your Stepmom the truth. I’d tell your Dad that it was disrespectful of your Stepmom to talk badly about your Mom. I would also tell your Mom. If your Dad is going to punish you for this, when you did nothing wrong, I wouldn’t stay there anymore. I would tell your Dad if she doesn’t stop, you won’t come anymore.", "NTA.  You stated the reality of the situation and she didn't like it.  Oh well.", "I didn't think about that but if she knows how hard dad tried to stay with/get back with mom... yeah...", "He's not. He doesn't really seem to care about my sister or me either. Like he used my being upset about the divorce and encouraged me to tell mom repeatedly when I was younger and he'd encourage me to beg her to get back together with him. He'd discuss this stuff during their swap times and looking back he was a huge dick. He'd also lie and say my sister ate way less than she did because she was so upset. My sister would eat way less for a couple of days after a swap but he was acting like she was starved.\n\nI can see now how shitty he acted.", "Sure would be a shame if she found out...\n\nNTA, sorry your dad and stepmom suck....", "In some jurisdictions, older kids of around your age have the option of deciding for themselves with which parent they live.\n\nIs that an option for you, bc it sounds like life would be better if you got to live with your mom full or most of the time?", "NTA. Imagine stepmonster thinking she has any right to tell your mother what she may or may not have up in your mother’s own home!", "NTA your mom is showing you how to handle disrespectful people by setting boundaries. She left your father for mistreating her, showing you that’s not ok behavior that should be tolerated.  She told stepmom to stay out of her house, another important boundary. You don’t need to waste your energy convincing someone to treat you with respect. You remove yourself from situation. Calling stepmom pathetic, you’re right, but being right isn’t going to fix anything and just make her angry and get your dad thinking you’re the problem, not her.  Tell dad you won’t tolerate disrespect, when she starts talking bad about your mom you will walk away. If it continues, tell him he’ll lose custody of you both for parental alienation and his child support will increase.  Many states child support continues while kids in college.", "NTA. Good for you on recognizing and not tolerating that behavior. On another note, how awesome and mature is your mom!", "NTA you’re stepmother seems really immature and insecure. She also seems threatened by your mother, and for “beyond disrespectful” they probably do not want any retaliation because they know that she is in the wrong.", "NTA and I think your mom is the shit.  She understands how important it is to the children to connect with the parents who are no longer with their partners.  That takes an amazing person to be able to do that and not just be angry and want to smash all the things.\n\nShe’s a kind soul.   While what you said was disrespectful it was correct and a million percent the right thing to say; and to defend your mom.\n\nYour mom is raising you well given the circumstances she faced.\n\nI wish you luck.", "NTA. Stepmom is definitely an AH, and father is heading in that direction. The only reason the stepmom wants pictures down is pure insecurity, yet your mother is remarried. There’s zero reason for that insecurity, and no one should have to entertain it. \n\n> Mom always says he is still our dad and she wants it to be as much our home as it is everyone else’s who lives there. \n\nYour mother sounds like a very good person. You are wholly correct to defend her. Your father is likely being influenced by his wife to take her side, because I truly can’t imagine a normal human getting mad at their pictures being at their children’s house. He’s probably arguing the “pathetic” comment is extreme, but only because you’re young. I’ve always considered age to be just a number, and respect is given where respect is due.", "NTA. Adults who don't behave like adults have no place to tell others how to behave.\n\nSM could have simply let it go, but she made a conscious decision to engage a child with adult conversations. Bad mouthing a parent is a no-no in stepparenting, if she didn't understand that, she is out of touch. \n\nAddressing a child about adult conversations and situations is an invitation to a response from said child. Just because they didn't like the response is their fault. Never engage anyone, let alone a child, with a discussion that you don't know how they will respond. She received what she was asking for, a disrespectful response to a disrespectful conversation regarding the child's mother.\n\nGood for you.", "NTA.  Skimmed through the comments - I like the idea of saying the photos belong to you and your sister.  Also think you should look into whether you are required to be at your father's home or not.\n\nA few pieces of advice:\n\n1)  Try to find ways to push back without judgments on her.  That way you are not adding other escalation issues.  Not because doing so is AH behavior, but because you don't want to add fuel to a fire when you are at a disadvantage (being in her house without options).  One thing to call her pathetic (though true) and another to say you don't see why your mom has to do what she says with her own house.  See if you can learn how to confront her by asking questions - let her dig her own hole.\n\n2)  ***If you can and do decide that you don't have to be at his house, please make sure that you don't let your sister go over by herself.***  It does not sound like she would emotionally be able to handle your step mother.\n\n3)  Ask your mom to assist you in finding an attorney to represent you.  This shouldn't cost much since you don't have a pending case - all you really need is a name, contact info, and an introductory meeting to establish the \"on retainer\" relationship.  This situation could escalate quickly, especially considering your step mother is exhibiting some narcissistic behaviors.  If it does, you will want someone you can call immediately rather than delay while you find someone.  Do not mention it to you dad or step mother.  Keep that in your back pocket for when shit hits the fan.", "I'm an old lady ... And I send, to you, my very warmest hugs of support and encouragement, if you'll accept them.\n\nI've been around a while, and have known many morons. Your step-mother is one that I haven't met, yet, and really don't wish to meet. Same for your Dad. \n\nDEMANDING respect never works out well.  EARNING it usually does.  Your Mom has earned mine.  She put her own needs aside for the sake of children, in a way that made a difficult situation easier for children.  There's never shame in this, and it is, in fact, admirable.\n\nYour step-mother is being insecure and territorial.  My guess is that she knows, damned well, about your father trying to reconcile with your Mom.  Even if she hasn't been told the story, she will instinctively hear it in your Dad's voice, if he talks of her, and I'm sure he does because of his kids. She knows. She hates it. And she's doing what she can to stake her turf and defend it, no matter how ridiculous it is.  It's childish.\n\nNTA ... Whether or not you stick to your guns, or apologize to get them off your ass ... YOU know the truth of what has happened here.  Do what you need to do for peace in your own life. You'll soon be old enough that you aren't dependent upon them, as you are an adult, and if you follow your Mother's teachings, you'll be a good person.", "NTA. Your dad is right that what you said isn’t respectful, but he’s confused about how respect works generally. Just because someone is older and a parent, doesn’t mean they get to just act how they want and demand that people pretend to respect them.\n\nYour step mom is insecure, which is fine, but she’s trying to front her insecurity as weird aggression. You’re emotionally intelligent enough by now to realize that that is pathetic, and you’re right.\n\nThe only thing you may want to consider is, what are you getting out of this relationship and what do you lose by being honest/are there other boundaries you could set that would preserve things. Your dad sounds like an asshole, but if he’s got a college fund for you or something, it might be nice to apologize and demand that your stepmom and dad not discuss your mother around you.\n\nIf he has nothing to offer and is this much of an asshole, maybe it’s best to call a spade a spade and allow yourself to become alienated. If you want your custody agreement altered, you’re old enough that your wishes around where you’d like to live will generally be taken into account by a judge, especially if you are clear about it being a matter of not wanting to hear one parent bash another.", "Your mother is doing what a parent should do. She is prioritising your needs. She is also doing what is best for her stepchildren. You cannot erase someone's past by removing photos.\n\nYou have far more maturity than both your father and his wife. The audacity of thinking you can dictate what someone else does in their home.\n\nRest assured that you got the sensible gene off your mother.  \n\nNTA", "NTA, your step mom has some major issues!! I went through it with my step mom, not allowing my father to be in my life or my sisters life. She hated the fact, my dad has other kids, besides their daughter together. Your mom sounds like she's amazing!! \nYour step mom is a huge AH!!!!", "Your stepmother is a stark raving lunatic, and your dad is enabling her bullshit. Your mom sounds nice, though. NTA.", "Fun fact disrespectful ≠ AH. She is pathetic and you are NTA", "NTA; they both suck", "NTA \n\nAs a stepmom myself, if my stepson ever expressed wanting to have photos of him with his mom in my home, I'd for sure find a way to get some hung up around the house. (We have a very different dynamic - my husband and his sons mom split up before they even found out she was pregnant so my stepson has always known 2 different houses). I also wouldn't care if she had photos of her and my husband from when they were together hung up in her house (though I'm also sure she likely doesn't). \n\nMy husband had a life before I came along and I couldn't fathom trying to police who had photos of him up in their home or not and demanding that any of his exes take them down. Wtf. \n\nYour stepmom is incredibly insecure and it doesn't sound like your dad is that nice of a person either.", "I think your mom has raised you well. Keep on being strong, principled and awesome. Your stepmother is an entitled idiot. And your fathers the booby prize she won", "Btw, you're old enough to be able to request to stay with your mom full time and a custody judge will take your desire seriously.", "NTA. When your stepmom married your father she knew that he had children from a previous relationship and that was part of the package. The photos of him in your mother's house is not for her sake it is for yours and your sister's sake... because they will always be part of each other's lives because they have children together. If the Stepmom doesn't like it she shouldn't have married someone with children from a previous relationship.  She is being petty and insecure. \nHaving said all this, you going off on her about it wasn't doing yourself any favors.  If you are being pressured to apologize to her, for the sake of keeping peace between you and your dad maybe go ahead and apologize but follow it with asking her to not complain or say anything negative about your mother in front of you or your sister because that puts you in a position where you will always feel you need to defend her. And then leave it at that. She is the adult and she should know better.", "As a parent myself and also being from a blended family I have to say yes you were disrespectful but it was more than deserved in this situation. Your stepmom has absolutely no damn say what happens at your mother's house and if she is that insecure about pictures there is another underlying issue somewhere. NTA", "I think it's weird if they were up in the living room or somewhere more communal. I would have only put them up in the kids rooms as it's for them. Those pictures are not your family dynamic anymore. I would be offended if i were the new partner too unless a widow/widower situation", "Y-T-A for how you speak to her. That type of treatment isn't acceptable, period.  You should come up with a more mature way of expressing yourself.  \n\nStep-mom is T-A also for speaking about your mom like she did. Dad is a giant A-H for letting her act that way.\n\nThis one is clearly ESH!!!", "You were a bit disrespectful (you could get the same point across without calling her \"pathetic\"), but it's understandable given the situation. And even if your delivery wasn't perfect, the point you are making is completely right.\n\nNTA", "YTA. It's not your place to comment on adult relationships to adults. You over stepped and we're out of line.  I agree your stepmom is pathetic and need to grow up with her insecure behavior. But at 15, it's not your place to comment or call her pathetic. You absolutely have the right to have your opinion.  You absolutely can express your frustration to your mom and dad, but the way you handled it was wrong. If I was your dad I would pull you aside and we would have a talk. I can't have you disrespect wife. I would also talk to her about how she is handling the situation and she needs to be respectful of our blended family. I would not have that conversation in front of you as that is a conversation between me and my wife.\n\nI will tell you this there is far more going on than you know. Your parents won't tell you nor should they. From an adult perspective we have feelings too and many times we don't know how to handle them in the best way. Just love your parents and realize they are doing the best they can. As long as they love you, you are good. Just forgive them for making mistakes and not being perfect.", "NTA who the hell does that wack job think she is! and even worse is your spineless pathetic dad", "NTA.  You have a great mom.  Stepmom....no so much.", "NTA - your step mom is definitely awful, but your father is also a rat fuck for letting it happen.", "NTA. You’re lucky to have a mom who models how a mature adult should handle difficult things and prioritize the kids. Sorry your dad and stepmom are turds.", "Your mom sounds like a really sweet person that truly has your very best interests at heart. You are NTA. You have a right to have boundaries. Clearly here, the boundary is that step-mom does not have the right to bad mouth your mom at you. Blending families is hard, I've been there as mom and stepmother. I didn't always make the right choices. But I NEVER said awful stuff about their Mom. Your dad needs to hear this and defend it. His wife talking crap about your mother to you is straight up ABUSE!", "NTA. First it's not her business who your mom wants to keep on her wall in her home, and second she's stepmothering very poorly by putting her stupid jealousy over your sister's needs. It wasn't your job to do so, it was your father's, so you're 3 times not the AH", "If you were disrespectful, what was your stepmother being? NTA!", "Coming from a blended family, you’re NTA. In my experience, your dad and stepmom are probably not going to appreciate or respond well, regardless of the merit your positions may have when you disagree with your stepmom. That will probably continue for a long time. That being said, my stepmom would never have had this position, similar to your situation, but a little different, my siblings dad passed away a few months before my mom passed away so there are no ex’s playing mind games on kids. My parents home has always had pictures of all of us kids growing up with all of our parents, separate or as families. Your stepmom has some insecurities she needs to get over, your dad has a backbone he needs to put a little TLC into. Your mom I think has the right frame of mind because her home should be your home And your step siblings home and your stepdad’s home and her home.Period.  This is anecdotal, and I do not have references to give you, however in college one of my psych professors shared that studies were showing (20 yrs ago) the ability for a mother, versus the ability of the father, after a separation, or if they’re the surviving parent, to be more resolutely objective at situationally prioritizing the needs of their kids, stepkids and new spouses according to their needs at the time.  Whereas the fathers/widowers were more likely to adopt the priorities and perspectives of their new spouse, even taking on their new spouses circle of friends, over and above their own kids.  I’ve seen this happen in that my stepmom is much more objective, and has shown my brother and I the support and attention we may have needed during life events, even having to chastise my father when he would fail to do what was right and instead opt for a “let me check with my wife first” response — understandably upsetting my step mom because it reflected poorly on her.  At the end of the day, all four adults in this situation are the adults, they need to act like the adults and the parents. Otherwise they run the risk of those pictures being the only thing your sister is comforted by the caveat being, and I was the mouthy 15-year-old, it can be a hard thing to learn at your age, but it will pay dividends in the end, learning how to diplomatically hold the mirror up, instead of throwing it at someone’s head.", "NTA you dad bought himself a remote control with this one-she runs everything everyone else does.", "Nta. Good job", "Really, to hell with being respectful. Your stepmom is being a psycho hose beast and needs to be told off. I just hope you don't get into much trouble. NTA.", "Nta. I really hated having to try and play fake nice to my step mom and sister just because that's what society expects. Fuck that.", "Nta your stepmom is unhinged", "Good for you. Definitely NTA.", "nta", "NTA. You are doing great navigating complex familial situations… might be time to move in with your mom full time!\n\nGood luck!", "NTA and your mom is a saint! I can tell by your words that she puts her children and stepchildren first no matter what. Your dad and stepmother need to understand that they have no right to dictate to your mom about her home. I’m sorry you’re going through this.", "NTA. SM sounds petty, jealous, and insecure. Almost sounds like she has some kind of personality disorder, but I'm no psychiatrist. The father doesn't sound much better.", "Definitely NTA. Sounds like she's getting that downgrade from stepmom to your dad's wife. Usually happens when a parent's next spouse overestimates what if any leverage they have with the kids.", "NTA - Standing up for your mom is ok.  You may have crossed the line into disrespectful - but it sounds like your stepmother did first.    Try to stay calm and cordial when dealing with anyone - there isn’t a need to drop to their level - stay more on the level your mom is modeling.   \n\nBy the way, your mom sounds great.  You are wise for your age, seeing all that you do and understanding the sacrifices your mom is making.   \n\nI hope your dad wakes up before you and your sister decide you don’t want to see less of him.", "NTA! your stepmom needs to stay in her lane. shame on her and your dad and good for your speaking up and having your mom’s back", "NTA\n\nStepmonster is a bitter and jealous woman who thinks the world evolved around her\n\nSo what? Mom have some dad photos bc well... He is the father of her two kids your know? And they want to see their father... Whats next? Get rid of you and your sis bc you remember SM about your mom?", "NTA.  Telling the truth is only disrespectful if you are trying to maintain an illusion of what your life is.  I'm sorry you have to go through this.", "NTA -maybe it is time for you to divorce your Dad.", "NTA people who are this controlling are usually deeply insecure and afraid", "You are NTA. Your father and his wife are.", "NTA but your stepmother is a huge one.\nShe has nothing to say about the photos that are at your moms house just for the sake of you and your sister. She has a husband, your stepmoms insecurities aren't your moms problem.", "To be honest, I'd tell them you can't wait until your 18,", "NTA", "[removed]", "NTA, tell your stepmother you're gonna take up for your mother any time she disrespects your mother. Even if that means disrespecting her ass back.", "NTA\n\nYou sound like you have a good mom and thankfully you have one parent that puts your best interest first. your dad sounds crappy", "NTA.\n\nThey have to give respect to get it. She's been disrespectful from the girlfriend stage. She's got a lot of work to do. She should start with counseling because the only reason your dad has her around is because your mother wouldn't take him back. She's dealing with feelings of inadequacy that are your dad's fault.", "Your mum is 🤩", "I'm sorry you're going through this. Family isn't always what it's cracked up to be, and I know age makes it even more difficult. \n\n\nIf your mom ever finds out about this, I'm sure she'll feel a lot of pride knowing she's raising a young human with so much love and kindness to stand up to do the correct thing.", "NTA. Goodness gracious, how much prime organic guano of bat has this woman ingested? I hope there was at least a moment where everyone looked sideways at her and tried to decide if she was ill or just twisted, before you put her firmly back in her box. Well done.\n\nI hope your stepdad is a great guy and that your mom is happy. Sounds like your dad got the partner he deserved second time around.", "Even at 15 YNTA! Your father was the one that should’ve stepped in and told his wife about herself and talking to his kids like that about their mother in that manner. I still have pictures of my ex and our kids up because at one point that was our life they deserve to see that. Shoot sometimes we still take photos together with them so they can have those memories. Your step mom is desperate and as you put it pathetic tell your father you’d rather not visit anymore now that you know how she truly feels about your mother and how she must speak about her when no one is around.", "NTA  But you are interjecting yourself into an argument between the adults - never a good thing in my mind.  Does you stepmom treat you and your sister decently?  This should be your focus.  The piece that deals with you.  You are 15, so you should be learning how to work on relationships, so you create an environment where you can prosper and be happy.  \n\nYou seem to be carrying your mother's purported feelings into your relationship with your father.  You characterize him in a negative way because of his failed relationship with your mother.  Has he treated you badly?  Walking through this life with a bag of negativity on your shoulders will not create the life that you want to enjoy.  Forgive and move on is my advice to you.", "Be careful what you call her unless you’re prepared to be booted out of the house the day you turn 18.", "NTA - good for you for standing up for yourself and your mom.  Your step mom does not get to dictate anything about your mom's house.  \n\nI wonder if you are able to work it out with the courts to not stay with your dad and step mom anymore?  It sounds like that might be best, if possible.", "NTA - you are a very well-spoken young man, btw. Smart and mature and able to express yourself very well. I just wanted to say that. Back to what's going on with your step mom... you are 100% right. Maybe don't swear at her, because that doesn't solve anything but as far as you being disrespectful... not one bit. She has no right to demand your mom do anything inside her own home, especially when she is doing it to help her own children. SHE is the one who is disrespectful. Clearly incredibly entitled as well. I'm sorry you are going thru this... Divorce, step-parents, and ..fighting and manipulation, ect, are all incredibly stressful. The only person I see doing anything to help with all of that is your mom. She deserves a huge standing ovation. So do you. All of this will not last forever. I promise. I wish you and your mom and sister nothing but the very best.", "NTA. They are not pictures  of your mom’s ex husband they are pictures of YOUR father, and your mom has the good sense and critical thinking skills  to understand the difference. Your stepmother on the other hand….", "NTA\n\nYou're not wrong. That woman is fiercely insecure and doesn't deserve any respect to begin with.", "I don't think that you're the AH because of this. I know where you're coming from because my parents are divorced and are on somewhat amicable terms just for my brother (19) and me (15) and mainly talk about things about us and general things.\n\nTo me, it seems that stepmom is trying to replace biological mom and cause drama. Stepdad understands why to have photos pre-divorce for the kids, but Stepmom doesn't. Your parents got divorced for a reason, but having something as simple as a picture up for the kids shouldn't be ticking her off that much. Plus, stepmom can't tell other people what to do and should mind her business.", "I don't think so honestly bit some parts yes", "NTA.\n\nShe's the one being disrespectful, thinking she has any control of what someone else does in the own home.  Your mom is only doing it for you and your sister, I'm sure she isn't the happiest looking at them, but wants to be a good parent.\n\nYou know, most places will let a 15yo & 13yo choose which house they want to live at.  If you are just done with your dad and stepmother, maybe talk to your mom at living with her full-time.  Then you can see your dad if and when you want.", "NTA and can I just say well done for standing up for what's right in a clearly toxic environment. Your dad and stepmom are wayyyyyyy out of line. You're a truth teller and they don't like that.\n\nAlso, three cheers for your mom. What a superstar.", "NTA\nSimple\nYour mom sounds amazing and clearly the internet is sorry you have to deal with sub par excuses of adults.\nGood for you and good luck.", "NTA. Your dad's wife has earned your disrespect. Respect is earned, and she earned the opposite.\n\nYou are old enough to let your dad know that they can't keep acting like that, and still get invited to events. Like graduation, weddings, or any other one time event. Your mom will be there, but they won't be if they can't be respectful of your mom.\n\nThose pictures are there for you and your sister. Not your mom. He is still your dad. That is your home.\n\nYes, people who are divorced and have children, even if they remarry, can be civil to each other. They can even all be friends. \n\nI am old enough to be your father's mother. Stand your ground. Hugs from grandma.", "You’re a pretty dope son for sticking up for your mom like that. The step mom can stop stalking your mom’s photos if it bothers her so much. I think she’s threatened cuz she knows he would’ve gotten back with ur mom in a heartbeat and if it weren’t for her rejection to try again, she wouldn’t even be with him..NTA and don’t you apologize. She’s being disrespectful for talking about your mom like that to you so if she can’t take it, don’t dish it out.", "NTA. Your stepmom seems a little volatile and probably your dad too. From a diplomatic perspective, ad hominem doesn't help much, though. \n\nAlso, you should have the right to put up pictures  and have things that make you feel like you're at home. \n\nShe has no agency in your mom's house and no right to tell your mom what should or shouldn't be in your house. If it won't make your situation worse, maybe family therapy on your dad's side? Or both if it makes it a better proposition. He's got some unresolved stuff.", "It was disrespectful, but from the sound of it, your SM needed to hear it. She probably won't because of how it was said but the truth hurts.", "NTA. I’m sorry your dad and step-mom are the way that they are. Their abhorrent behavior is not a reflection of you, your mom, or your sister whatsoever.", "Slay!!!!!!!   \nShe deserves the truth and needed to hear that the pics were for you and your sis.  That wall must be a great story telling of your life and people in it.  Amazing to see, understand and know how your identity is defined!", "Oh OP this was hard to read and I wish I could give you a hug. You are absolutely NTA. Good for you on speaking up to your step Mom. You did not say anything disrespectful, if anything it is EXTREMELY disrespectful, immature, and inappropriate for a step mother to bad mouth a child’s mother to their face. You did nothing wrong but she absolutely did and every child therapist on the planet would agree. I am sorry you have been saddled with a wicked step mother. Hang in there. None of this is on you.", "NTA, but your dad and stepmother are. I bet she didn't like it when a 15 year old told her essentially to grow up. Your stepmother isn't in charge of your mom or your mom's home. She must be extremely insecure to behave in such a manner. I don't believe you were wrong or owe them an apology. Your dad should man up and not allow that kind of hate towards your mother. He should love you more than he hates your mom. She is still your mom and he needs to man up and be a good father and think about what's best for his kids. Good for you for being mature enough to see the situation as an adult. It's too bad your dad and stepmother can't be the mature adults in this situation. And it's awesome your mom acted in your best interest,  too bad your father couldn't.", "NTA. I’m sorry your father and his wife act more like children that you do. Some people really never mature, even for their kids sakes. Depending on where you live you are old enough to say where you want to live, and if you do not want to deal with your father and his wife anymore than you have the right to state you want to live with your mother permanently. Then you can decide how much you want to visit your dad. Your sister may not be old enough yet but she’s close. The age where I live is 14. Talk to your mother if this is something you want to consider and get all the facts down before moving forward with it. It’s a large possibility you’ll have to go to family court to change the custody paperwork, but it could be worth it in the end for your emotional and mental health. If you want to wait until your sister is old enough so it can be done at the same time, is also a good idea that way she has you to back her up. Sometimes it takes this sort of thing to make a person see the consequences of their actions. And if he cares at all about losing you two this will hurt him and maybe change some things. But since it’s been like this the whole time, I’d say nothing will. Good luck and stay strong for mom, sister and yourself. Never let them beat you down and bully you. A good parent wouldn’t act that way.", "NTA.  Parents should not be putting you in the middle of their arguments.  Your SM and dad need to stop that immediately.  If they don't, any attitude you give them is justified.  If they want to grouse about your mom, they shouldn't be doing it to you or in front of you.  And your SM sounds like an insecure jerk.  She needs to apologize to you for her actions.", "NTA. Stepmom is possessive and insecure, and your dad only cares about happy wife, happy life. If seeing photos of your dad at your mom's house gives either you or your sister some peace of mind, then no harm, no foul.   \n\n\nYour mother has clearly moved on, and is secure in her relationship with your stepdad. Your mom is a better person and parent than both of them. They're both just mad that they can't control her.", "NTA- she says you can't boss her around 🤣  tell her your mom says the same.", "NTA \nBig up to your mom for protecting you from the conflict she had with your dad even though he unfortunately ruined everything by using you to get back to her.\nAnd big up to you for defending your mom as you should ! Never let your dad and his wife make you feel bad about this , she was the one being disrespectful by trying to order around people and badmouthing them about something that both your parents got over 🙄\nIs it possible for you and your sister to choose which parent you want to permanently live with ?", "Well you clearly took after your mom didn’t you. You’re a level headed and kind person and you were right to stand up for your mom. It’s not like she wants any reminders of that man in her house it’s solely just for you and your sister although at this point I think more your sister. Your stepmom is clearly jealous. Nta.", "NTA kid, but your father and stepmother will treat you as though you are. This sounds like an authoritarian parenting style household where it's not child centered. It's all about them, their wants and needs, and yours are secondary at best. So, while you need to remember deep down that you are absolutely NOT the AH here... you're 15 and stuck living with them part-time. You may end up having to grit your teeth and apologize. I know it's awful and shitty and this should not be the case, but they sound like the type to really hold it over your head and pull a power trip to pry one out of you. I would love to be able to tell you that this is a great hill to die on, stand your ground, and stand up to her, but you're in a really vulnerable spot where they have so much power over you that it may come to be in your own best interest to just fake an apology and get it over with. \n\nHowever, this is the kind of behavior you won't soon forget. When you're an adult and able to choose, you know who is going to get the bulk of your time... the ones  who consider you and your feelings and values. I'm sorry you're stuck in this spot. It sucks...but you are free and clear in the AH department...and my immature 33 year old self would have definitely been cackling if I'd have been a fly on the wall hearing you put that crappy person in her damn place. Props to you 👏", "Nta\nYou are very mature and understanding for your age! You should be proud. I bet your mom is.", "NTA at the end of it all because she was being disrespectful to you. Stepmom should not be venting or talking about any issues that she has with your mother anywhere within earshot of you or your sister. Your mother is focused on you kids before her feelings which is exactly what any parent SHOULD do no matter if you’re biological or step-parent.", ">She told me I did not get to speak to her that way.\n\ntell her when she stops acting like a child is when you will start treating her like an adult. and you are not being disrespectful. you are defending your mom and as a son you have EVERY right to....i wont just sit there and let anyone let along a STEPmother speak like that about my mother.\n\n(MAYBE correct me if I'm wrong)its obviously she needs to mind her own business since she doesn't know what its like to have kids (young at the time) and trying your best to protect them from the hurt of two parents not being together.", "NTA I love when young people get their voice with adults who demand respect even when they arr representing poor behaviour themselves.  Disrespectful what a joke.  Once step mum can model the behaviour she is wanting from you consistently for 15 years then, & only then you might want to think about it.  She is jealous & I think she knows your dad tried to get her back after divorce & she might think he might leave her for your mum even though she is married.  Twisted people & their bs games.  You did a great job adulting her!!  She will learn alot from your humble views ✨️", "NTA\n\nkudos to you young man. you did nothing wrong. too bad your stepmom cant be more mature", "can i have your permission to read your story on tiktok? if not i totally understand, just dont want to get caught up in copyright issues 🙂", "Heck no! You sound like a very mature, caring and understanding young man with a wonderful mom. Your step mom sounds like a booby prize. To many men don't like to be alone and will marry the first woman they meet after divorce just to have someone. It usually doesn't work out in the end. After reading one of your responses, it sounds like your dad deserves his wife.", "NTA\n\nIf stepmom desires respect, she is welcome to earn it through respectable behavior. She has failed. She is learning that she gets what she gives.", "I like you!\n\nYour mom sounds healthy and you sound like you're able to see through your step mother's shit.\n\nNTA", "Your mom sounds like an amazing human. And good for you for seeing what your dad really is. And good for standing up for your mom too. I can’t stand it when adults think they can be shitty to kids or teenagers and think the kids just have to take it. That’s disgusting. “How dare you disrespect me.” Give me a break. Respect goes both ways. NTA", "NTA but....Idk I'm sure your step mom didn't appreciate your tone, and calling her pathetic. Although....yeah she is. Just like it's not appropriate for her to be telling your mother how to decorate her home. It's not appropriate to name call and disrespect your step mom ...no matter how crazy pants she may be. I'd just stay out of it. When she starts off on one her rants politely excuse yourself or simply say hey I'm a kid and I don't feel comfortable and/or have no control over adult decisions. You're not wrong but I think you could have handled it a bit better. Hang in there!", "NTA. Your stepmom is the one being disrespectful. She's being disrespectful to your Mom the way she talks to her, though I highly doubt she cares. She's also disrespectful to you by bringing you into this asinine issue she's trying to create.", "NTA, no way jose. She can't control people.", "NTA\n\nYou spoke your truth and imo you were actually being far more mature than your stepmother was. \n\nShe has insecurities. Big ones. But that’s on her and your dad. She knows she was the “runner up”. And they both seem way too comfortable using you and your sister as ammunition in a never ending campaign against your mother. \n\nYour mother and stepfather sound awesome!! They are what every divorcee children hope for. A functional co parent relationship makes all the difference. It’s just a shame that your father and step mother aren’t on the same page.", "NTA it's a wonder these days that ppl keep thinking respect can be demanded. No you need to earn that shit...", "NTA.  you're actually the one reasonable one in this whole conversation.  well, you and your mom.  what goes on in your mom's house is literally none of your stepmom's business.  she should not be badmouthing your own mom in front of you or worse, to you.  you aren't her friend, you're her pseudo son.  and she's talking badly about someone you love and respect, how well does she think that's going to go over?\n\nsome adults sometimes misconstrue what kids say because of how they're acting and their choice of words.  what they view as disrespectful is just you sticking up for your mom and yourself, and you're calling your stepmom out.  if they can get past your choice of words, they'll see there's a chance to have a really good conversation here, and there's also a learning moment.  but i doubt they will.\n\nyour mom sounds amazing, and like she handled the split gracefully and with you and your sister's wellbeing always at the forefront.", "Very mature post and point on.  You are wise beyond your years. (And others)", "NTA. I am a single mom of a 2 yr old and his dad sounds very much like your dad. I'm so sorry you grew up in that position, and I'm really proud of your mom for taking the high road. And thanks for sharing your story because it's hard to always take the high road! It's good to know that you see it at such a young age. I'm sorry you got bounced around. \n\nIf your mom's story is anything like mine she went to insane lengths to try to protect you from the situation. Give her a big hug. You seem like a great kid.", "[removed]", "NtA.. they showed you their disrespectful attitude.. you were just mirroring it back... they were disrespectful of your mother.. did she expect you to agree with her? She's a delusional stepmom", "NTA. Stepmom has no say at all about what is in your mother's house. She was beyond the pale when she ranted at you against your own mom and she had no right to speak to you that way.", "NTA, your stepmom is delusional and extremely insecure. It was previously mentioned, but you might be able to go to the court and ask to live with your mom full time. Or start refusing to go to your dad's. You're old enough to have a say in where you spend your time.", "NTA", "Well done Sir for standing up to an evil bully, your bio mother sounds awesome, save yourself a lot of stress and just go NC with your dad and step mother, you are old enough to speak up for yourself in court if need be to have no contact", "NTA, but it isn't too early to start making plans to bail, and it isn't too late to get your custody changed so you're full time with your mom.", "NTA. You are NTA mainly because your stepmom, a so-called adult, is involving you in her adult and relationship problems. She shouldn’t even be talking to you about this!! Or any other parental conflicts that don’t directly affect you. \n\nSo she involved you in this petty squabble that is mainly in her head and then didn’t like what you had to say when you defended your own mother (which, IMO, it’s your right to defend your mother), \n\nShe is pathetic for whining to you about this, trying to have you fight her battle or something, and being so insecure. And she is pathetic that she can’t stand the fact that her husband has an actual history in his life that resulted in two children!!  It’s not like your mom couldn’t have gone back to your dad. Or that she’s is after him, since she is married herself. Your stepmom’s obsession over the pictures only show how insecure she is. \n\nAnd if she doesn’t want to hear your opinions about her squabbles with your mom and stepdad, then she shouldn’t involve you in conversations about them.", "NTA\n\nA person who thinks they can order another adult to modify their home is not worthy of respect IMO. \n\nTBH I am petty enough to make up some t-shirts with your mom and dad in the same photo and wear they exclusively when I am near that AH step mother.  \n\nDo not do this till you're ready to tell them to both bugger off though. If dad is paying for college, suck it up for a few more years and tell his wife to take a flying leap when you have diploma in hand.", "NTA.\n\nShe brought your tirade on herself and she completely deserved it. Who the hell does she think she is, ordering your mother around?", "NTA. Your stepmom needs to zip it and she is a piece of work! Your Dad on the other hand is a jerk!", "[removed]", "Your mum's home has nothing to do with her. He maybe her husband now but he is your dad and you are her kids and once they were together and you were a family. You have every right to defend your mum and express your feelings. She is expressing her thoughts and airing her feelings so why are you the ah. You would not say anything if she had not begun some strange ownership over your mum's home.", "NTA....sounds like your dad and stepmother are both awful people.", "NTA if your dad keeps acting like this it might be time to ask your mom to revise the custody agreement. It varies from place to place big I know here in the USA they often let 16 year olds choose. They will also take into account younger children’s wishes. \n\nI’m sorry your stepmom and dad suck at parenting.", "NTA.", "OP FOR THE WIN!! That was epic. Nta.", "Nta", "NTA. I love love love that you stick up for your mom! She is an amazing woman and your step mom needs to shut her nasty mouth. Your dad needs to watch himself or one day his children will not want anything to do with him.", "NTA. What did your stepmother think was going to happen when she started venting to you (or rather, bashing YOUR mother to you) of all people? That was inappropriate on her part. Your reaction is not only what anyone with a brain would expect, but also makes sense given the context. Her insecurities are not your mother's problem, and they are even less your problem. They are hers alone and she needs to deal with them appropriately. You sound like you have incredible insight, especially for your age. You seem more mature than either your Dad or your stepmother. I hope things get better for you soon. Just remember: you only have to put up with this non-sense for three more years. When you turn 18, you'll be able to decide how much time you choose to spend with your Dad abd stepmother. If they're not careful, you may choose to spend very little time with them indeed. Good luck and I hope this blows over soon.", "NTA- and you were nicer than I know I would have been if she had mouthed off to my momma.", "NTA. Your stepmom is a controlling freak with poor boundaries. Your dad clearly has issues. Your mom is the only normal-seeming one and it seems that you have inherited her good sense.", "Well, you were disrespectful, but you were also right.\n\nYour stepmom has no right to police your Mom, your Mom's house, your Mom's parenting, or your Mom's decorating choices.\n\nNTA", "I do not understand the warped behavior of split families sometimes. Your mom is awesome! My ex and I had a very ugly period for a couple years after our split, but when it came to our daughter, we never involved her. I would not allow any member of my family to talk disrespectfully of her dad. We eventually developed a friendship and when I met my current husband, I let him know that  any jealousy or strife over that relationship would not be tolerated because my daughter came first, he would be a part of our life it was her father. This kind of backfired because they became good friends. Fast forward 24 years, the whole family calls them the husband's because when we are grandkids parties, events they are always side by side chatting away. My eldest grandson got the thing one and thing two shirts one time! They tell people they bonded by comiserating over being married to me! (Funny guys)  It is possible to be an adult and put your kids first. I'm sorry your dad couldn't do that for you. NTA.", "NTA. Sorry you have to be the more emotionally intelligent person I'm the conversation with your step mother.", "Nta", "Your response is actually pretty reasonable, especially given the emotions you are obviously feeling. \n\nHere’s the thing about respect. Everyone starts with a full measure. How they behave determines whether you retain that full measure of respect for them or whether they lessen it through their words and actions.", "Nta", "No, you are not the AH but your father is for allowing his wife to behave this way to the mother of his children. I hope that you are old enough to choose not to go be around these hateful people.", "NTA: Stepmom should be wondering about AITA and she seems to be. She is a grown-ass adult and should know better than to be such a jerk to a step-child. Dad is a jerk by enabling it...A teen's well-being comes first over an asshole stepmother. Calling someone pathetic, doesn't win you any prizes though.", "NTA Your mom is a very respectful person who is looking out for her children's best interest. He is (in name only) still your dad. Your stepmother on the other hand is loony tunes.", "Well you certainly weren’t respectful. NTA though, what a wild thing for your stepmom to believe she has any control over. It probably isn’t even worth getting into it with her if she’s so wrapped up her own version of the world where she’s within her rights to tell another person what they can have as home decor.", "NTA. That is really petty that you can't have pictures of your parents in the house. That sounds very childish. No matter what happened between the two of your parents the fact of the matter is at one point they were together and they made you and at the time the photographs were taken they didn't hate each other and that as a part of their life I understand not wanting to see your ex, but that is still a part of life that occurred and there was captured in photographs. The two parents or three I guess need to grow up and they need to understand that you guys are children and those pictures hold memories. So they need to get over whatever issues they have and they need to see a therapist. If the two of your parents wanted to be together still they would be together it is absolutely childish that these adults are acting like children and that you children are acting more like adults.\n\n*(DISCLAIMER: This OPINION is based on the information OP provided and is not to be taken as advice nor intended to replace the opinions of a professional)*", "> \"how dare your mom not do what I tell her and take the photos of my husband down\"\n\nThese are photos from before he was her husband, taken while he was **your** dad.\n\nThe lady is unhinged.\n\nNTA", ">My stepmom went on a rant about mom a few days ago and she was like how dare your mom not do what I tell her and take the photos of my husband down.\n\nOr what? She going to break into your house? I would just be laughing at her. NTA.", "NTA: Stepmom needs to respect your Mom’s choices in HER HOME. Now if it was in Stepmom’s home I could understand the upset. But it’s at your Mom’s home. Dad and Stepmom need therapy", "Sounds to me like you are the family member with the strongest spine. Good for you!!   \nYou were rude but it's kind of ridiculous for your Dad and Stepmother to call you out for disrespect. Exactly what do they call the way she is trying to bully your mother??", "NTA, your mom sounds like a wonderful person, and I would even love to know her. Your dad and step mom are complete assholes and need to grow up. You did right for sticking up for your mom. All things aside I hope you treasure your time with your new extended family with your mom. Those memories will be worth cherishing.", "NTA\n\nIf I were you I wouldn't even go over to dads house. I'd just stay at moms and limit my contact with him. The stepmom opened up your ability to comment by openly trashing your mom to you. Are you just suppose to sit there and nod or say nothing? I would say refrain from cursing though and to be honest I can tell you she doesn't care about your respect nor want it and being 15 most adults really aren't looking to do that either. \n\nI don't really see myself trying to earn my daughters respect. I treat her well so she feels safe and secure with me.. because it's my job as her mother to give her a safe environment.", "Oooh d finitely NTA. I love the fact that you stood up to her and told her the truth. Who does she think she is. You have a wonderful mother and should always cherish her. She's an amazing adult with common sense. Love it.", "NTA. Her man was your father before anything else. It’s okay to want pics up of your dad for your sister. \nShe doesn’t get a say in anything that happens in your mom’s household. What a control freak.", "NTA. Sorry your SM is such a freakout. She's lucky your mother does not cut her off entirely. Most would. What you said was fine but she clearly has her own agenda. Sorry you have to put up with her.", "NTA- its disrespectful to speak that way about your mom to you or around you. It makes her look unhinged and possessive. Sounds like your bio father was a bit possessive as well. Sending you strength and good energy. If she cant take it she shouldn't dish it.", "NTA\n\nYou‘re disrespectful how?! Your stepmom was the one who went on a rant about what your mother is allowed to do or not do in her own home. That’s disrespectful to you, your sister, your father because she’s talking about the mother of his children and to your mother. I’d say this is emotional harassment of some sort", "NTA - You stepmother sounds like a nut! Also an idiot .. . . also a mean curmudgeon  . . . also a little dangerous . .  also not respectful to her stepkids . . .  \n\nYOU on the otherhand sound like a sweet understanding son . . . and your mom is wonderful when she was the one that honored your dad as your bio dad for the sake of your childhood . . . . she's a saint. . .  also kind . . . also respectful and worth protecting.", "WOW JUST WOW, NTA BIG TIME!!! It never ceases to amaze me that people come along in a child's life and try and dictate what should and shouldn't happen because of their presences. Your stepmom thinks because she can control your dad that she has the same powers over your mom she needs to stay in her lane. What is she going to do if that picture stays there FOREVER, if she had any sense she would want to be more like your mother. Your mom has more class in her little finger than that woman has in her whole body your mom has a picture on her wall of her step kids' mother out of respect of the children and the woman herself. You were not disrespectful you were just sticking up for your mother, and little miss insecure can't handle being called out, and your dad is tripping as well, he can't control his house so how is he going to have a say at you mom's house. Stepmom better step back before she gets something she's not expecting.", "NTA. The truth is not disrespectful.", "Your dad is the biggest AH here.  Stepmom sounds like a real peach too.", "NTA for all the reasons people have spelled out, but are we all just going to breeze by this statement?\n\n>We have a few photos of my stepdad's ex-wife at home and some from when he was married to her and my stepsiblings were young. This is especially important to them because their mom is terminally ill with a condition that made her unable to take care of them (I think it's something to do with her brain).\n\nI think that stepsiblings may make a posting of their own in the future...\n\nOf course, there are innocent explanations where the stepdad is not TA, but there are too many cases of a husband abandoning their terminally wife.", "NTA. Good for you OP. Most 15 year olds don’t have the emotional intelligence, discernment, bravery, and respect for their mothers that you showed here. I teach at a high school, and I’ll say we could use a lot more kids like you. Your mom raised you right.", "How dare the stepmom tell your mom what to do with photos of the FATHER OF HER CHILDREN \n\nI would be super mean if I were your mom and say ‘he could divorce you anytime but he will always be the father of my kids’", "Disrespectful? Sure. Some people think respect is due based upon your position in life. Others think it is something that has to be earned, and maintained. Your stepmom has not earned your respect, and your Dad has worked hard to lose it. So NTA, and disrespectful is not the dirty word your father seems to think it is.", "OP. This.  I am a child of divorce in my 50s. My folks split when I was 3. Manipulative parents do not change when you are no longer a minor. I suggest counseling too.  Your mom sounds like a good mom. I'm glad you have her.", "The father and stepmother sound like the deserve each other, and god forbid they breed another one like them.", "OP is male.", "My exes wife told me I wasn’t allowed to talk to “her husband”. I said I don’t give a flying fidget about “her husband” I’m talking to the “father of my kids”.", "I disagree both the StepMonster and the father are horrific people that don't deserve the respect that children give to parents. And like pretty much everyone else that commented Respect is earned. The is NTA. THE STEPMONSTER AND FATHER ARE THE A**HOLES!!!!", "The step mother started it with her comments. If she doesn't want OP to make any comments then maybe she needs to not talk shit about OP's mom to OP. Is OP just supposed to sit there silent while stepmom rants about his mother to his face? It doesn't sound like the father is about to stop the stepmother, so OP laid it out.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I doubt dad cares whether or not his wife is happy. He’s just reacting to OP’s challenge to authority. The defiance is what bothers him, not his wife’s emotional state.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You are a smart decent kid. Keep being awesome like your mom. \n\nYou were disrespectful, but she is beyond disrespectful to your mother and to you.  How dare she try to control your mother? Mind her own business. If you give respect you get respect. Disrespect is going to get disrespect. I am glad you stood up for your mom.  And you were not wrong, she is extremely pathetic.\n\nNTA", "Your dad should have NEVER used you and your sister as pawns in HIS failed relationship. Your stepmother is WAAAAAY out of line for demanding your mom take pics of your father down in your mom's house. She is doing what a good parent should. He's still your dad and just because they divorced, you didn't divorce him. Also, if you are of a certain age, you may be old enough to choose if you want to see them at all.", "I gotta say that you have an amazing mom! From what you’ve said she tried her best to make the split as easy as possible for you girls! So it’s no wonder you’re so protective of her. In a perfect world you shouldn’t talk to your stepmom like that, but this isn’t a perfect world and your stepmom is doing double duty to make it even less perfect. \nYour NTA for having loyalty for your mom!", "> He's not. He doesn't really seem to care about my sister or me either.\n\nIf you were a fully grown adult, I would say that it's probably time to stop caring about what he thinks is or isn't \"disrespectful\", and that you should just go live your life and not pay him any mind.\n\nAt 15 and not yet being in control of your living situation, it's a little tougher to do that. If you have the option to have a say in your custody arrangement and choose to stay with your mom full-time, I would explore that option.\n\nIf you're stuck with the status quo, I would just disengage with dad and stepmom as much as possible. You've called stepmom on her shit already, now just refuse to engage, and have as little to do with her as possible.", "OP you are definitely not the AH and I love the way you have stood up for your mum and sister.  Unfortunately your dad and his wife sound like despicable human beings.", "I wonder if it's at all possible for your mother to petition for sole custody. What your father and stepmother are doing is sounding like emotional manipulation and abuse.", "It was also “beyond disrespectful” for your stepmother to speak badly to you about your mother. That’s a line I would never have allowed my partner to cross. Ever.", "Maybe it's time to refer to her as your dad's wife. To be a decent stepmother you have to put the kids first, that name is a privilege.", "With your father's history I wouldn't be surprised if he told his wife that your Mom was the one trying desperately to win him back...", "it won't let me edit", "\"Take it up with the court, oh wait, step moms don't have standing.\"", "I never said that they weren't a-holes. Not sure what you disagree with? The fact remains though that the OP has to comply with whatever rules the father and step mom create while staying in their home so they would be better off trying to keep the peace as much as possible.", "Yes they are supposed to keep their mouth shut. But hey I was raised a certain way. They are not equals. \n\nI agree the step mom was 100% wrong, but there is a right way to address it. \n\nYou are making an assumption. It's not the child's business. The dad doesn't needs his childs approval or oversight when addressing it. What would I look like addressing an issue about something my wife did in front of a child. That's a private convo between adults.  My wife and I never embarrass each other in front of our kids. If one of us are wrong we address it in private with each other and not in front of the kids. If warrented, we make apologies to the kids later taking responsibility. Sometimes it's needed sometimes not.\n\nAn expectation of parents always doing the right thing is dumb. We are all just winging it as we go. There is no definitive hand book addressing every situation. Human behavior is just too complex.", "Deciding who you live with depends on the state first me it was 16 when it became my choice. Some states it’s 14 or 15. I hope you can drop theses jerks.", "🤣", "My daughter's father tried that same mess with me when we broke up. He tried to push the narrative that I was actively pursuing him when it was the other way around. I never spoke badly about him around  her, but knew that in time if I did my job as a mother and not worry about what lies he was telling her, she would see the truth. Sure enough, she did, and cut him off for a long list of grievances when she was old enough. That dummy was as transparent as wet toilet paper, lol", "You’re ignoring the fact that the stepmother MADE IT OP’S BUSINESS by ranting to OP. So it absolutely was OPs business that they had every right to comment on. \n\nI’m truly sorry that someone raised you to believe that you have to sit silently while any adult insults your mother, and to believe that children are not “equal”. That’s so gross and toxic and it can’t have been a healthy or pleasant way for you to grow up.", "also certain times judges won’t agree with you. that’s what i struggled with for 2 years after the divorce. i was 15, told them i didn’t want to see my dad, he said every other weekend and weeks in the summer. not bad tbh, but after a few months of being his new punching bag i was ready to get out.\n\nlike this man tried to have me arrested for being an “unruly minor” for telling him i didn’t want to be around him, he showed up early and i was well within my rights to finish WHAT I WAS DOING, berated me in a walmart, then finally drove me to the county jail. ofc nothing happened. but it still took until i was 4-5 months from 18 the judge actually LISTENED (super small town in tennessee, i now live further away in a more city area)", "I am sorry you were raised without structured family enviroment. You will find it hard to achieve things in life without that structure. There are right ways and wrong ways to handle situations. If you popped off to your supervisor like that you will get fired period. It's not about right and wrong it's and HOW you address something. Emotional responses are usually poor ways to handle issues.\n\nChildren are not equal and to think anything other is quite frankly crazy. How is someone with limited life experience and few responsibilities my equal? They are not. It's about our responsibility to our family not our own personal feelings. I told you exactly how it should be handled on the adult side. \n\nThere is nothing gross or toxic about my upbringing. It was structured and healthy and based in ownership of my actions and responsibility to my family. I had a great childhood. To the day my grandparents passed I respected them and their position in our family. I respect my mother and her position in my family. I'm 48 and my mother still deserves my respect even if she does something I disagree with and is wrong. Even at 48 I would never cally mom pathetic even if it was deserved. \n\nLooking over your comment it's emotional. Actually read and understand without the emotion what I said and you will see it's a more positive way to handle the situation. The step mom was 100% wrong. The dad needs to handle the situation. Period. If he doesn't he's wrong. The adults need to behave like it and take ownership of the situation. The son needs to approach the dad and explain how the step mom's comments made him feel. The dad needs to LISTEN to him and take action as appropriate. But the dad does not need his sons approval. That being said the dad could have addressed it and the step mom didn't care. That leads to a bigger issue though.", "[removed]", "Sounds like you are the only adult in your dad’s house. Definitely NTA!!!", "NTA OP.  Kudos for you for putting that pathetically insecure stepmother in her place. 🏆🏅\n\nThe stepmother wants to be ranting & raving then she needs to be told that she looks the monster & ugly soul. She's not getting to see or hear what she wants to see/hear.\n\nKeep shoving the truth that she needs to hear in her face.", "NTA - honestly your step mom and dad suck.  There is nothing more tacky and gross and yes, pathetic, than bitching about someone's parents to them if you are the stepmom.  What was she even trying to accomplish.  Does she really think that you are going to like her or respect her more if she bitches about your mom?  Especially about something so pathetically petty.  I mean how insecure do you have to be to have a problem with your ex's wife keeping up pictures of her children's dad?", "It sounds like your dad and step-mom are like 2 peas in a pod and deserve each other. Poisonous people attract poisonous people. It's a big attraction because it feels familiar and feels right to emotionally unbalanced people.\n\nThat stepmom is unhinged. If it keeps up, your mom should get a restraining order on her. It would become your step-mom's police record. Hopefully, if this has to happen, she will back off.\n\nIf your mom decides to take this action, it needs to be kept on the down-low. If the step-mom catches wind of it, out of spite, she may take one out on your mom by making things up even though she's done nothing wrong.\n\nTHIS IS VERY IMPORTANT: Tell your mom to record any conversation of your step-mom calling her. Tell her to start a journal and enter each date, time of day, and what was said each time that step-mom calls. \n\nBy keeping a meticulous record, it will correspond to the phone records between the two and who called who. It doesn't matter if it is weeks and months between contacts, this may very well prove invaluable in a court of law should things escalate.\n\nGood luck to your family.", "NTA: Your father and step-mom seem very insecure of themselves and their relationship.", "NTA. Your dad and his wife are ridiculous, petty people. They should both be blocked from all social media. Let them be mad and stay with your mom as often as possible. Wear a shirt with her face on it when you do have to go over there. Their childish, spiteful pitiful behavior is just ensuring you will go NC when you can. When they respect your mother, maybe they'll earn your respect.", "NTA, OP. Not at all. Your dad and stepmom are morons and need to stop trying to put themselves in a place of authority over your mom. They don't and will never have a say about the pictures at your mom's house. I think your stepmom knows your dad still wants your mom back, so she's jealous and resentful. Don't pay much mind to what they say about this. It's truly NONE of their business.", "NTA and you are old enough to say you don’t want to see your dad.", "NTA - your stepmom is super insecure about your mom. You stood up for your mother and there is absolutely nothing wrong w that. \n\nYes maybe it was disrespectful in some ways but why the heck do you need to be respectful to someone who is belittling your mother? Tell your dad that And let him know you will stop being disrespectful when she stops talking crap and stops trying to control your mom. She can say whatever she wants to him and only him - not around you nor your sister. Because you will ALWAYS have your moms back.", "NTA I mean they’re right you were “beyond disrespectful” but in this case she wasn’t worthy of your respect so fair play", "NTA but try to be civil. I know it's hard but you need to lead by example. I hope everyone starts behaving like adults but sadly that doesn't always happen. Stay focused on your own mental health and know that soon enough you'll be free to live your own life .", "NTA, your dad is clearly still upset your mom didnt take him back, he and your stepmom have no right to tell your mother what to do in HER house, they have some entitlement issues they definitely need to work on, you are not the asshole for standing up for your mom", "NTA - unfortunately we don’t get to choose who our parents are.\n\nYou sound like you hit the jackpot with your mum OP. She tried to keep her personal feelings toward your dad out of it and not influence you or your sister with them. She recognised how difficult the split and divorce were on you both and wanted you to have your dad in your life - even if he wasn’t the ‘dad of the year’ that every kid deserves. Pictures of him would have made things easier for you. She sacrificed for you both. \n\nYour step mum sounds insecure to be having a reaction of that kind by trying to insist that the photos of her husband, IN A HOME NOT HERS, be taken down. \n\nSorry you’re in this position OP. I hope they can curb their crazy or you minimise contact to keep up your mental health.", "Your step-thing is absolutely the bratty teen ass here. You, not so much...NTA", "NTA Pathetic is the exact word to describe her behavior.", "NTA. Your stepmom is seriously immature and emotionally repressed. At 15, you seem to have a better grasp of your mom’s own personal sacrifices in handling things as amicably as she has than your stepmom, who, conveniently, has forgotten that before he was “her man”, he was not only your father, but your mom’s husband. Duh. People with the emotional intelligence of a pool cue shouldn’t be allowed to marry people with children from previous relationships. They’re psychological wrecking balls. Kids deserve better.", "NTA.", "NTA.  While I generally don’t think a 15 year old should be openly disrespectful of adults in his/her life, I’m going to make an exception in your case and say - Bravo, OP!  👏👏👏. Stepmother deserved every word you said.  Next time they tell you you are disrespectful, say “ Respect is earned - and you haven’t earned mine”.", "NTA. She sounds super insecure and dramatic.", "Maybe it's time to go back to court and have your visitation time reduced. You are old enough to decide where you want to be. You SM is jealous and it's kind of insane because your mom doesn't want your dad back. It was so sweet of her to leave up some family photos that included him, esp while you were young children. NTA Good luck.", "NTA. Your dad sounds like an ass as does your stepmom. You are absolutely right-she has no right dictating what your mom does and she needs to butt out. I’m sorry you’re having to go through this but you stuck up for your mom which I applaud.", "NTA! FDB!!", "NTA, never be ashamed to stand up for your mom. Proud of ya kid.", "[removed]", "NTA based on what you're telling us. Having those photos up has absolutely no effect on your step mom's life. Your dad had a relationship, an entire family before stepmom came in to the picture and it sounds like your she can't accept that. Her reaction is rooted in insecurity. She needs to get over it. Your mom is literally minding her own business living her own life and is doing nothing wrong.", "[removed]", "NTA\n\nYou were definitely disrespectful. But why on Earth should she be treated with respect for throwing tantrums and trying to bully your awesome mom? You would be enduring less of stepmom's hypocritical drama in the aftermath, though, if you had left out the insult (\"pathetic\"). \n\n\n Your stepmom is a fantastic example of what NOT to do.  Make that your life goal: Never act like her.\n\nHowever, when step-mom is acting like a spoiled toddler, you will find the experience far less stressful if you keep the narrative focused on HER behavior instead of yours. To accomplish that, try to make yourself the one who is calm, logical, and not throwing out insults.  Use a calm tone of voice without being rude or yelling.   It will make her look foolish in comparison.  \n\nAnd honestly, it can be hilarious sometimes to stay perfectly calm while the other person is being irrational and over dramatic. Narcissists Want you to argue back — to join in the fight like it's a favorite family activity.  If you stay calm (and maybe even record the conversation privately), you'll be able to defend yourself better against her accusations. (In every U.S. state I've lived in, it is legal to record a conversation so long as at least 1 participant [you] knows it's being recorded),\n\nAnd if you want to shut everyone up about this fight, just say, \"I'm sorry for the way I expressed myself. I should have been more polite.  I'm not sorry for the point I was making: you need to leave my mom alone.\"", "Disrespect is exactly what she should get. You did nothing wrong, neither did your mom. NTA", "[removed]", "You are not in the wrong here at all you stood up for yourself and your mother who honestly sounds very nice and I hope the situation gets better soon and your mother kept those pictures around for you and your sister and if your stepdad could accept them then it is perfectly fine to keep them up your mother and you did nothing wrong and I am sure she is or would be proud of you (I say this because I'm not sure if you told her you said this) so good day or night to you and i wish you the best (also sorry about the run on sentence and bad grammar if there was any)", "NTA. Way to go defending your mom. That’s epic that you are more mature than either your father or stepmother!", "NTA\n\nYou were disrespectful, but she earned that disrespect. I can understand her being unhappy about the pictures being up (to be clear, I think it's stupid that she's upset, but I can understand her insecurity about it), but she should be mature enough to know that you don't get to control other people's houses. And as a stepparent you should never belittle the other parent to the kids.", "I imagine it's very hard to have much respect for her.  She needs to understand that she simply doesn't deserve any until she grows up and learns that she is not the main character of your mother's life. Your dad... doesn't sound much better.\n\nNTA", "NTA, stepmother is overstepping her bounds BIG time!", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "if you wanted to be super petty and hit your step mom where it really hurts, tell her all about how your dad worked tirelessly encouraging you and sister to get her to get back together with him, and that she will only ever be second best to your mom. I jest of course, this would cause unnecessary strain on the situation.\n\nSeems to me you are at an age and your sister is close to the age where you get to decide if/when you go for visits. Sounds like your dad probably wouldn't care too much", "Then why do you care about what he or his wife say ?", "My guess is that OP's dad still pines for his mom. Step mom is well aware of it. And she is taking it out on OP's mom instead of dealing with the disappointment (No offence to OP) she married. Her reasoning being OP's mom must still want him too, why would she have his pictures at home?\n(Edited because comprehension is a skill lost on some people)", "There is one man at his father's house and it isn't his Dad. NTA\n\nHe is lucky to have such a great Mom who is raising a wonderful man.", "If they want to live with mom full time maybe just tell dad and mom straight up. I also have issues with my step-mom and something therapists suggested was forcing a relationship outside of their house such as meeting on the weekends for a movie, dinner whatever. Limited contact might actually improve the relationship.\n\nOp could tell dad they aren't at the house where step mom keeps bashing their mom and could tell mom the same thing though leave out how step mom is smacktalking her.", "Maybe that's what step-mom wants.  No kids; just \"her man\".", "I so would do that, but I am 19m with 24 years experience...and a petty streak that gets tickled in such a special way by stuff like this.  OP is NTA", "Op literally explained why the mom had pictures in her house. Reading is a skill...", "And that would be perfectly fine if OP and his sister could go live with their mom and step dad permanently.  Their father doesn't seem like the best to be around and step mother certainly isn't.  I can't believe her nerve, smh.", "So is comprehension. I was explaining step-mom's reasoning behind attacking OP's mom."]}