{"id": 32198, "submission_id": "1895ic8", "title": "WIBTA for taking my exhusband to small claims court immediately after the Christmas holidays?", "selftext": "Keeping it short and sweet. Before my ex-husband and I got divorced, we bought a new air-conditioning system for our house that we had. When we got divorced, the courts decided that it was a joint debt despite it being only on my credit. So the court ordered him to pay me 150$ a month to go towards the payment of the monthly bill until the unit is paid off. We currently have about 12ish months left of payments to make. I make the payment at the first of every month and he reimburses me within 10 business days of receipt of payment. That was our agreement. \n\nWell last month, he decided to inform me that he would make his half of the daycare payment and his half of our child's therapy payment, but he is actively choosing not to pay for his half of the ac unit due to him \"financing a new car and student loans going back into repayment\". This was said in text. At that point I made a decision, either he pays me all that is owed by December 31, 2023 or I will be taking him to small claims court/family court (depending on what court it falls under since its a family court order) and requesting to have his wages garnished since he is unable to be trustworthy with making his court ordered payments.\n\nI've decided this because I sold my house (i was able to prove the house was legally mine in the divorce because he never made a single payment towards it in the entirety of our marriage) a few months ago andbh attempted to sabotage the sale of my house by talking to the buyers realtor, the inspector, and quite honestly anyone who would listen about the \"problems with the house\". When that didn't work, he attempted to put a lein on my house because of \"an active debt attached to the house\". After the sale of the house, he begged me to use the proceeds from the sale to clear the debt and I told him no and that he would continue to pay me for his half and I wasn't going to let him wiggle his way out of it. Now we are here.\n\nSomeone did make it clear that I didn't state the moral delimma so here it is. My ex-husband has a track record of calling me a bitch or an asshole or my personal favourite \"heartless bitch\" for trying to get what is rightfully mine from him because it always manages to correlate when he's going through a rough patch. \n\nSo WIBTA?", "created_utc": 1701529255, "permalink": "/r/AmItheAsshole/comments/1895ic8/wibta_for_taking_my_exhusband_to_small_claims/", "score": 31, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be the asshole because at this time I'm showing clear disregard for his life and how it's affected by this debt. I could take the high road and eat the cost, but I'm flat out refusing at this point.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I don’t see any moral dilemma here, you seem to be here just seeking support. So yeah, all my support.", "NTA\nHe owes it and is refusing to pay. He is also a jerk who tried to punish you when you sold the house.\n\nHis financial problems are his own. Sue him or take him back to court, whatever it takes. If you go back to court, you might consider having his half of child expenses added to child support, he will try to default on those as well.", "NTA - I think you should consider sending him an official letter, reminding that it was the court decision to ask him to pay this amount, and you will go back to court if he stops the payment. If you do, you will also ask for interests for the months it took him to pay you back\n\nFor the lazies, here is the Tiktok for this post : [https://www.tiktok.com/@iata\\_updates/video/7308016052976241953?is\\_from\\_webapp=1&sender\\_device=pc&web\\_id=7301491606745007649](https://www.tiktok.com/@iata_updates/video/7308016052976241953?is_from_webapp=1&sender_device=pc&web_id=7301491606745007649)", "NTA - get your money and good luck", "Absolutely NTA\n\nThis is a joint debt, and you shouldn't be suddenly required to foot the entire bill simply because you made some good financial decisions and he, well, did not. But more importantly, **this is a court order**. Save the text(s) and any other evidence he might so conveniently provide to you, and head back to court. (And if you're in the US, you'll go back to the court that made the order in the first place.) He can complain all he wants/\"needs\" to about his financial woes to the judge. One of the magical things about divorce is that you're not required to give an airborne rodent's derriere about his sob stories anymore.\n\nEta: I didn't even address him trying to dip on paying for his children's needs. Holy shitballs. File for court now. You won't get in front of a judge before Christmas anyway.\n\nEdited again because apparently I'm semi-illiterate (or just tired). Get him on garnishment if possible for the kid stuff, because he sounds like the type who would absolutely skip those pmts so that his new ride can be paid for.\n\nI personally don't care if you can comfortably enough afford to eat this debt on your own. He's on the line for half, and he needs to pay up. His student loans can be on a \"poor man's\" payment plan anyway, the amounts for which will come *after* child-related garnishments are figured.", "NTA.  A mother seeking care for her child cannot be an asshole, even if she pursues what is rightfully due her child on Christmas day.", "Have you told him you're doing it? I'd do that first to try and have things go as smoothly as possible.\n\nOther than that if it's court ordered NTA\n\nBtw, if this was for the house you sold I don't know who's going to win in court, but there's nothing wrong with solving it there.", "NTA, but I wonder why you need a \"small claims court\" for this? Shouldn't you just notify the judge that he is disobeying the court decision and let them fix this for you?", "He tried to sabotage the sale of YOUR house and at the same time place a lien on it to secure a payout to cover his debts?!\n\nHe thought his free ride would go on in perpetuity - like his student loan payments - which clearly were a very bad investment 🤣\nCongratulations on your divorce! Put a lien on his car!\nYWNBTA", "NTA,  he clearly isn’t good with money and if you don’t take him to court you’ll never see his payments again", "NTA no need for guilt and it’s pretty obnoxious of him to ask you to use money he tried to prevent you from getting every step of the way. He’s ignoring a court order, get your money.", "NTA.\n\nHe doesn't seem to be acting like a decent and rational person towards you so you don't need to act like a considerate and understanding person towards him.\n\nJerks don't get to expect good treatment from the people they act like jerks to.", "NTA to the court you go.", "NTA, he owes you the money for the repair and the monthly payments in full for support, take him to court, and get what you and your kids need.", "Pretty straightforward NTA. \n\nHe owes the money and isn’t paying it as agreed.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nKeeping it short and sweet. Before my ex-husband and I got divorced, we bought a new air-conditioning system for our house that we had. When we got divorced, the courts decided that it was a joint debt despite it being only on my credit. So the court ordered him to pay me 150$ a month to go towards the payment of the monthly bill until the unit is paid off. We currently have about 12ish months left of payments to make. I make the payment at the first of every month and he reimburses me within 10 business days of receipt of payment. That was our agreement. \n\nWell last month, he decided to inform me that he would make his half of the daycare payment and his half of our child's therapy payment, but he is actively choosing not to pay for his half of the ac unit due to him \"financing a new car and student loans going back into repayment\". This was said in text. At that point I made a decision, either he pays me all that is owed by December 31, 2023 or I will be taking him to small claims court/family court (depending on what court it falls under since its a family court order) and requesting to have his wages garnished since he is unable to be trustworthy with making his court ordered payments.\n\nI've decided this because I sold my house (i was able to prove the house was legally mine in the divorce because he never made a single payment towards it in the entirety of our marriage) a few months ago andbh attempted to sabotage the sale of my house by talking to the buyers realtor, the inspector, and quite honestly anyone who would listen about the \"problems with the house\". When that didn't work, he attempted to put a lein on my house because of \"an active debt attached to the house\". After the sale of the house, he begged me to use the proceeds from the sale to clear the debt and I told him no and that he would continue to pay me for his half and I wasn't going to let him wiggle his way out of it. Now we are here.\n\nSo WIBTA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta", "NTA.  He is the one refusing to pay you money you are owed by a court order.  Use any and all legal means to address this issue.  He made this mess, not you.", "NTA\n\nYou’re just getting what’s rightfully yours when he has been trying to screw you over at every opportunity. You would be an AH to yourself if you let him get away with it. You could roll over today and let him do what he wants and he would still think those nasty things about you. \n\nIt will be one less things that you have to deal with him on once it gets resolved. \n\nHis financial issues (such as a car payment he can’t afford) is not your problem. He signed the agreement despite knowing his obligations.", "Nope. This is a classic situation of FAAFO. He’s going to find out.", "Haul his sorry ass back to court. NTA OP.", "NTA, court that waste of space asap.", "NTA", "NTA", "So you sold the AC he is supposed to make payments on, reaped all the benefit of selling it, and still require him to make payments on it?\n\nESH. You for this one shady transaction, him for otherwise being a rude, deadbeat ass.\n\nI don’t think court is going to be quite as easy as you think it will be on this.", "So you sold the house and collected all of the profits which were increased because it had a new HVAC system and now you want your dickbag husband to supplement your profits. I agree your ex-husband sounds like an asshole but you seem to have no problems double dipping.\n\nEdit: solution: make him pay the $150 per month you were in the house and forgive the rest.", "Also I edited the post to state the moral delimma. My apologies for not placing it there first.", "The moral delimma is that he has a record of calling me a bitch and ab asshole for coming after him for money that is rightfully owed to me whenever he's \"having a tough time\". It happened last year during tax time when he screwed his taxes up, it happened earlier this year when we needed to change schools for our daughter and the school we moved to was more expensive but better for her....it's a constant battle", "Holy shit you work fast on getting a video for this", "I mean... you have a child to both take care of. The goal here is for you two to deal with things smartly, without going to court but if you cannot get him to think straight, then court will help him on this matter ;)", ">A mother seeking care for her child cannot be an asshole\n\nThis sounds a little bit sexist to me. Anybody can be T.A., regardless the gender and family status :). Not the OP is the one, however.", "I haven't mentioned it yet because it's only one payment so Im honestly just giving him the chance to do the right thing and pay what he owes this month. I'm giving him a total of three months before taking it to court  because I know if he goes three months without paying I won't be getting all my money. \n\nAs for the house that I sold, it has nothing to do with the matter. There's nothing in our divorce that demands that I pay the debt with any windfall that I may receive. I'm following the letter of the court order that says we both pay 150$ every month until the debt is satisfied.", "I honestly didn't know which court that's why I said small claims/family court depending on which one I have to go to.", "That's not a moral dilemma though....\n\nHe is just an asshole. Him calling you names does not make it a dilemma somehow.", "He's sounding more and more like a massive AH. Locking this shit down in front of a judge, *asap,* is the safest move in my experience.", "I did my best so that you'll have different feebacks ✨", "If you agree that this mother is not an asshole, what are you disagreeing with.  It isn't clear if you have an original thought to share about OP's question or you just want to argue with me to make yourself feel more important.", "I agree that the OP is not an asshole. I just disagree with your generalization \"*A mother seeking care for her child cannot be an asshole*\"  but I do not plan to argue about this either. \n\n> to make yourself feel more important\n\nI feel important enough.  Thank you for the analysis of my motives, however.", "Not an analysis.  Analysis means having arrived at a conclusion.  It is a question. Maybe you could take a look at the rules.  Everyone is welcome.  Even people who don't read or follow the rules.  Just don't expect to ..."]}