{"id": 32212, "submission_id": "189gl9c", "title": "AITA for telling my “boyfriends” kid I don’t intend on being her mom?", "selftext": "TLDR: I helped my casual BF out by watching his kid while he went to a job interview. She didn’t want to abide by my house rules because “I’m not her mom and never will be” and I told her “I’m not trying to be your mom. I have my own kids.” \n**writing on mobile**\n\nContext: \nI’ve (34F) have been in a casual long distance relationship for 2 years with “Matt” (40M). I set boundaries at the start of our relationship. We will never live together, he will not be involved with my kids or family, I won’t be involved in his. My kids have a dad that’s very active in their lives and we coparent amazingly. The relationship I have with Matt is just that, with *him*.  Matt agreed to these terms. Everything has been great. We never argue because we have nothing to argue about. We have our separate lives and when we’re together it’s like a break from the real world. \n\nMatt is relocating closer to me because he’s grown tired of the city and wants to live in a more rural place like I currently live in. He will still be roughly over an hour away so it’s within comfort. His daughter “Ava” is 12 and he was unable to leave her home as his mom had a slip and fall and wasn’t comfortable watching Ava while she was on heavy medication, she just wants to rest. He wasn’t comfortable leaving her at the hotel alone so he asked me to watch her. I agreed and we both understood it’s a one time thing. \n\nHe tells Ava I’m an old friend but I’m guessing she’s heard my name before (it’s not a traditional American name) because of what follows.\n\n She was being hateful to my daughter “Rose” (11), making fun of the blemishes my daughter has on her chin. I asked Ava if she wanted to go to the basement to play any of the games down there, she said no so I told Rose to go to the basement. She did.\n\nI then catch Ava slowly opening the basement door and I ask her to go to the living room. She refuses and opens the basement door all the way. I tell her she is not allowed down there right now but she’s welcomed to the Wii in the living room or she can pick a movie to stream. We go back and forth, then I walk to the basement door and shut it. She starts screaming at me that I’m not her mom so don’t try to act like it. That’s when I told her “Baby, it never crossed my mind because I have my own kids to parent. I have no intention of trying to be anything to you, I’m just helping your dad.” \nShe went to the living room and occupied herself with her phone. I made lunch, served it, she didn’t touch it (it was sopita and cheese quesadillas). Her dad picked her up later and when he got back to the hotel he called me about what I said. He said he understands why I said what I said and it is true, but it was out of pocket to say it TO her.\n\nAita?", "created_utc": 1701561357, "permalink": "/r/AmItheAsshole/comments/189gl9c/aita_for_telling_my_boyfriends_kid_i_dont_intend/", "score": 49, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole because of the way I phrased it, or because of what I said considering she’s 12.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but you should probably end this soon. That’s not a very healthy environment to live in.", "YTA\n\nYou don't want to be her mom, fair, but you do have to adult with her and it doesn't sound like you did based on the way you explain things here.  Yes, kid was pushing you, she's 12. You're 34. She was acting her age and...you didn't exactly rise to the occasion. Also, its hard for me anyway not to see this as projecting frustration with Mark that you're being asked to watch her.\n\nIf he's moving closer to you, you might not have to parent this kid, but you have to have some manner of working relationship with her.  The idea that you won't be involved with his family at all just isn't realistic IMO, as this situation shows clearly.", "Nope, you’re NTA.  The girl was trying to abuse your daughter, so you set boundaries.  She played the baby whining game when you enforced it and called her bluff.", "She’s 12 and worried you’re going to be her stepmom if she made that statement. Add to that you have a daughter her age who would be her stepsister. Of course she’s going to say that and act out! \n\nThat’s great you have a relationship that works for you and Matt, but why are you not recognizing she would assume that you two will be marrying someday? You realize she already has picked up on two having a relationship. \n\nYou were kind to watch her but boy this relationship with him is going to be one heckuva confusing thing for the two tweens. Seems like neither of you are actually understanding that. \n\nYTA but not deliberately one.", "NTA it's not like you said anything wrong. You literally agreed with her. She sounds like a spoiled brat.", "Gonna go with NTA. Your bf should have told her the lay of the land beforehand. I don't think it would be a good idea to do this again. Puberty + new partner of parent is a bomb waiting to go off, and you're justified in not wanting to deal with that.", "NTA. I feel like that’s something any babysitter would say if babysitting children in their own home. Whenever a parent drops a kid off at someone’s house, I feel like the send off is “okay, be good and listen to So-and-So, it’s their house and they’re in charge.” At least that’s the send off I always got lol.", "NTA, she doesn't know how to behave in someone else's home and was using the \"you're not my mom\" as an excuse for her crappy behavior. She needed to be set straight.", "Nta you were just straightforward", "NTA it your house your rules. Even if you just her father friend who help with babysitting she shouldn't be rude to you in your own house. She 12 when she still children she can't keep act like toddlers.", "ESH, a 12yo said a childish thing and received a childish response. Reality is different homes have different rules, period.", "YTA\n\nYou should not have said that to her. I get it—when a kid is being disrespectful, it’s really hard not to be disrespectful back, and every parent/adult slips up and says things out of their amygdala at least occasionally.\n\nBut it’s a 12-year-old. Who’s being babysat by her dad’s fuck buddy who admittedly wants nothing to do with her. I can understand why she’d be on edge—a lot of kids would have acted out in this situation.\n\nAs the adult, your job is to know how to enforce boundaries gently and without getting into a power struggle with a child.", "NTA, you said what you needed to Ava when she was behaving badly.", "ESH.\n\nI'm going to agree with your partner- I understand why you said that given the context of your relationship, but that WAS out of pocket. A 12y/o is not going to understand your relationship her dad in the way you do, and while that's not yout fault, your response to his daughter is unhelpful at the very minimum. I think it actually undermines viewing you as an authority figure (because parent or not she should be listening to you, the responsible adult), and only sets her up for more confusion and feeling unloved down the road (should your relationship become more casual, or should your relationship break off and someone enter the picture with Matt who actually wants to be a family unit). She likely went on her phone and didn't touch her lunch because she was upset and was disengaging from her feelings, not because she was truly listening to you.\n\nAre you wrong for thinking / feeling the way you do? No. Are kids assholes and say / do asshole things? Yes. But we have got to treat them better than they treat us.", "Very soft YTA - simply because it's good to have tact with kids. She was being a puke, obviously, but it's also clear she's going through some stuff (the idea of moving from her home in the city to a rural area, for a start, probably has her freaking out). 12yo kids can indeed control themselves, but they still feel pretty big feels. It sounds like she needs a lot more parenting than she's getting.\n\nPreferable words would've been something like \"I'm not your mom, but your dad asked me to be in charge of you until he picks you up.\"", "Yta he’s right, your comment to a 12 year old was inappropriate.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nTLDR: I helped my casual BF out by watching his kid while he went to a job interview. She didn’t want to abide by my house rules because “I’m not her mom and never will be” and I told her “I’m not trying to be your mom. I have my own kids.” \n**writing on mobile**\n\nContext: \nI’ve (34F) have been in a casual long distance relationship for 2 years with “Matt” (40M). I set boundaries at the start of our relationship. We will never live together, he will not be involved with my kids or family, I won’t be involved in his. My kids have a dad that’s very active in their lives and we coparent amazingly. The relationship I have with Matt is just that, with *him*.  Matt agreed to these terms. Everything has been great. We never argue because we have nothing to argue about. We have our separate lives and when we’re together it’s like a break from the real world. \n\nMatt is relocating closer to me because he’s grown tired of the city and wants to live in a more rural place like I currently live in. He will still be roughly over an hour away so it’s within comfort. His daughter “Ava” is 12 and he was unable to leave her home as his mom had a slip and fall and wasn’t comfortable watching Ava while she was on heavy medication, she just wants to rest. He wasn’t comfortable leaving her at the hotel alone so he asked me to watch her. I agreed and we both understood it’s a one time thing. \n\nHe tells Ava I’m an old friend but I’m guessing she’s heard my name before (it’s not a traditional American name) because of what follows.\n\n She was being hateful to my daughter “Rose” (11), making fun of the blemishes my daughter has on her chin. I asked Ava if she wanted to go to the basement to play any of the games down there, she said no so I told Rose to go to the basement. She did.\n\nI then catch Ava slowly opening the basement door and I ask her to go to the living room. She refuses and opens the basement door all the way. I tell her she is not allowed down there right now but she’s welcomed to the Wii in the living room or she can pick a movie to stream. We go back and forth, then I walk to the basement door and shut it. She starts screaming at me that I’m not her mom so don’t try to act like it. That’s when I told her “Baby, it never crossed my mind because I have my own kids to parent. I have no intention of trying to be anything to you, I’m just helping your dad.” \nShe went to the living room and occupied herself with her phone. I made lunch, served it, she didn’t touch it (it was sopita and cheese quesadillas). Her dad picked her up later and when he got back to the hotel he called me about what I said. He said he understands why I said what I said and it is true, but it was out of pocket to say it TO her.\n\nAita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.\n\nI thought that what you said was perfect. She was blaming her disobedience on you not being her Mom, and you were like: \"I don't want to be your mom, but I still get to set the rules in my own house.\" Good on you.", "Im so sick of these posts. In any situation where you are seriously dating a single parent of a minor, with any intent for it to be long term and mutually important, you have to accept that this comes with a level of responsibility to their children after a time. If you completely cannot have a relationship with their kids, or allow them one with yours…don’t date! Just don’t date until your children are grown! This is so ridiculous, and so avoidable. \n\nIf you don’t want new children…don’t date someone with children. YTA.", "NTA - your boyfriend should have explained the situation to her that you were just the babysitter for the day. This is on him.", "NTA \n\nI think you handled the situation as best as you could. IMO what you said wasn’t bad at all.", "NTA Nothing you said to your boyfriend's daughter was was untrue or cruel. You were helping her father out and you do not intend or want to be a parental figure in his daughter's life.", "NTA. It’s also out of pocket for your boyfriend’s child to mock another child’s appearance but I’m not seeing anything about that 🤷‍♀️She said you aren’t her mom, you confirmed that you aren’t her mom. Nothing but facts that the kid already said, there shouldn’t be a problem with you saying those facts back", "Nta", "NTA, it seems like this doesn't really matter in the grand scheme. It's a bit weird to say that to a 12 year old, especially the way you phrased it, it comes off as either really catty or just straight up mean but of course I wouldn't presume to understand how you said it from this. Overall, it's just inconsequential if the terms are exactly how you've stated it.", "We did have that discussion where this was a one time thing. We’ve been fine for a little over 2 years and this was a random incident where his mom suddenly got injured. She’s 12 so it’s not as if she’s in need of frequent babysitting, but her dad is relocating states for a higher quality of life for them both, that’s why he wasn’t comfortable leaving her.", "I completely agree. At this point I’m sure she’s put it together that when she has her weekend at grandmas, he’s not sitting at home, so this will only get worse haha", "Yeah, I have to admit I find Matt's comment rather mind-boggling.  \n\nHis child comes home from no more than a handful of hours in a stranger's house and tells him:  \n- I bullied the girl who lives there  \n- I refused to eat what my host made me   \n- I talked back to the adult you put in charge of me, in her own home.  \n\nAnd Matt decides the right response is to tell OP her message was too harsh??", "I think that’s what caught me off guard. I didn’t expect that type of reaction from a 12 y.o. I have a 13 y.o son and my daughter who’s 11, and I haven’t gotten explosive reactions like that in a long time. So I was kinda trying to throw my hands up like “whoa I’m not the bad guy I’m just doing a favor. Whatever you think I’m trying to do, I’m not. No need for the hostility” haha", "“EnFoRcEd ThE bOuNdRiEs” SHE DID!", "Girl, boy 😂 whoever you are, shut up! You thought that she was suppose to be okay with someone disrespecting her & her kids in HER house!?! She had every right to say what she said to her! Ava FAFO now she upset 😂 FOH", ">when a kid is being disrespectful, it’s really hard not to be disrespectful back, and every parent/adult slips up and says things out of their amygdala at least occasionally.\n\nOP didn't say anything disrespectful. What exactly should she have said to a kid that accuses her of trying to be her mom? OP's response was perfect, it shut the brat's attitude down and removed any kind of illusion that she means anything to her so there won't be any confusion in the future, should her dad need another favor from OP.", "This is why his daughter is terrible.", "I’m sorry, I just feel for this kid who’s being put in this very weird spot.", "What’s weird about being babysat by an adult who, as far as she knows, is a friend of her dad? Would it be different if she said that to a male friend? A teacher? No. She’s in someone’s house who was kind enough to watch her, and was being a brat by picking on Rose. She got told to respect the rules and threw a hissy fit.", "We’re going to pretend like the kid doesn’t know this is his dad’s fb? The OP says she suspects the kid knows.\n\nA kid doesn’t say, “You’re not my mom/dad” to a regular babysitter. She knows."]}