{"id": 32227, "submission_id": "189hl9u", "title": "AITA for not crossing the street with my dog?", "selftext": "I (35F) was walking my dog and pushing my 4 month old son in his stroller just to get some air. My husband Mike (39M) was with our other three kids holding down the fort. My dog is a mutt and weighs around 90 pounds. His vet thinks he is a lab mix of some kind. He’s the sweetest dog on the planet and so patient with my kids who are all under 7 while he’s around 11 years old.\n\nWhile heading back toward my house there was a couple walking their smaller dog, a terrier of some kind I think, on the same side of the street as I am. The couple was maybe 2 to 3 houses from me at the time when they yelled “Cross!” at me over and over. My house was between me and the couple at the time. I stopped for a second and figured they were yelling to let me know they were crossing the street so I kept with my dog and stroller towards home. I had no intention of crossing the street since I was on the same side of the street as my house and had my infant son with me.\n\nThe man became kind of aggressive with me while I kept trying to get to my house and kept yelling Cross over and over. I tried to explain that he was standing in front of my house and I wanted to get my baby home. He told me he didn’t care and it wasn’t his problem. About this point my husband had come outside (that’s how loud this guy was) and told him to leave me alone. This guy turned to my husband and started screaming in his face. Honestly I was scared of this man. He kept going on and on about I had no manners and that since I had the bigger dog it was my responsibility to cross when coming up on others with a smaller dog. \n\nMy dog has never been aggressive with anyone or any other dogs. Like I said we have four kids under 7 and we have 2 cats. He’s a sweet boy. During the entire ordeal my dog just sat down next to me and the baby. He was leashed (unlike their dog) and super calm while their little dog was running all around barking constantly. Mike told them to get off our property as the man had gotten in his face and was in our front yard to allow me, my dog and our baby to come back home. At this point my next door neighbor (who’s house I had stopped in front of during the confrontation) came out as well. He basically escorted the three of us up my drive way so I could get my baby inside who had started crying with all the noise. \n\nBefore the man and his wife finally left he called me an asshole for not following “common courtesy” in crossing the street. I don’t feel like I should have been expected to since I was going home and only a few houses down from my house when this all first started.", "created_utc": 1701564494, "permalink": "/r/AmItheAsshole/comments/189hl9u/aita_for_not_crossing_the_street_with_my_dog/", "score": 940, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I maybe the AH for not crossing the street with my dog for a couple walking their dog on the same side of the street.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - I've never heard of a rule that someone with a bigger dog has to cross the street when they see someone with a smaller dog.  Even if it was a rule, it would obviously be trumped by a mom pushing an infant in a stroller.  How utterly ridiculous.  And their dog was off leash too, OFC.", "10000% NTA.\n1) your dog was on a leash & theirs wasn’t.\n2) your dog has no issues with other dogs.\n3) you had an infant in a stroller.\n\nThe proximity to your house has NOTHING to do with it.\n\nIf their dog is the dog with problems THEY need to move, for THEIR dogs safety. \n***IF their dog went after your dog, whether they won or loss, they would be at fault. \n\nNext time you need to call the police and say there is someone with an off leash dog screaming at you and blocking you from getting to your home.", "Next time call the cops that you are afraid of the man preventing you from going into your house and that you have a baby. NTA", "NTA. \n\nYour dog was leashed and his dog wasn’t. That’s really all there is to say- he’s the irresponsible one and he’s the one who should’ve crossed if he was so concerned about his (unleashed) dog getting into trouble. The audacity.", "NTA. The person who is uncomfortable passing by another dog is the one who should cross. You had a dog and an infant, you should not have had to cross the street by default due to safety. They are not only entitled by expecting you to cross, but also by walking with their dog off leash.", "NTA, and also wrong. \n\n\"Common courtesy\" is that if YOU don't want to walk near someone? YOU cross the damn street. Plain and simple.", "NTA. If this happens again, scream \"LEASH!!\" until the dumbass gets the hint.", "NTA.  He didn't even have his dog on a leash and \"the people with the bigger dog cross the street\" isn't a thing anyway.", "It doesn't even matter if your house was close or not. If they have a conflictive dog, or a problem with bigger dogs, they are the ones that need to cross the street. Plus you had a stroller and they had what? Their big egos? The nerve of some people...\n\nNTA.", "NTA\nThat guy was an angry idiot. I'm glad you made it home safe", "Absolutely NTA! 2 adults with 1 small dog vs single woman with larger dog AND a 4 month old baby in a stroller? A 3 year old could figure out that the couple should cross! No other info is even necessary. That man was a major AH who still didn't even back down when he realized he was blocking you from your own home, or when your husband, and even the neighbor came out? Honestly, you should report him. He's unhinged and a menace to society. If he does that in public, wtf does he do behind closed doors???", "NTA\n\nFirst, your dog was leashed.  They were in the wrong for not leashing their dog.    \nNext, you don’t always need to keep dogs away from one another.  My dog loves to meet new dogs and sniff butts.  If we get fairly close to another dog while walking, I always ask if their dog is dog friendly or if we need to detour.  Frequently, the dogs sniff one another, and then we move on.\n\nThird, he was blocking your home.  He was the one who wanted to avoid you, so it was HIs responsibility to cross to avoid you.    \nSorry you met an AH there.", "Let me get this straight. Your dog was leashed? Theirs was not? If so, NTA. Your kid, your house, none of that have anything to do with it.", "NTA. Is there even a question about it?", "NTA - this is ludicrous. This is not some known cultural expectation. You know what is? Leashing your damn dog. Not yelling at and threatening perfect strangers and their newborn baby. These folks are the worst, and I’m glad your partner and neighbor were there to back you up.", "Nta. He made that crap up.", "NTA\n\nThere's no common courtesy involving this. If they or their dog are afraid of other dogs or people, that's their problem and not anyone else's. They can cross, because it's their problem. For people with well adjusted dogs this just isn't a concern.", "I'd of left him unconscious if he pulled that shit with me.  What an asshole.\n\nNTA", "“ He kept going on and on about I had no manners and that since I had the bigger dog it was my responsibility to cross when coming up on others with a smaller dog.”\n\nYou should have told him the one without the baby carriage has the responsibility to cross!", "NTA. Everyone knows strollers, wheelchairs and walkers take precedence on the sidewalk.  Remind him of that “common courtesy”", "Geezus what AH, if that were my wife, that guy would have received a punch right in the face", "They also had the dog off leash. They can fuck off. Smol dog owners always feel entitled and take the victim stance", "NTA.  I have never heard of that rule before.  After having nine perfectly wonderful and friendly dogs in the past, I now have a Chihuahua who thinks that he can eat police dogs for breakfast.  (And the 6'2\" policeman with the gun on his hip for dessert.  Oy vey.)  When I see another dog, I pick Fred up fast and, if necessary, *I cross the street.*", "How exactly is screaming going to calm his unleashed  dog down? NTA.    If you cross paths again like this I would file a police report.", "NTA.  they sound like real entitled dinks.  and if they are the ones with issues about being around larger dogs........ they can dang well cross the street.   you do not need to cater to their insecurities and insensibilities.   especially right in front of your house, and doubly especially with your dog behaving perfectly.  \n\n\nit also isn't a 'common courtesy' that i have ever heard of to cross the street with a larger dog.  and if anything, they should be the ones making extra effort to have their obviously neurotic dog in control on a leash and crossing the street themselves to keep their neurotic dog from affecting other dogs.", "NTA. If their dog is the reactive one, that’s their problem to solve. Nothing was stopping them from crossing yet they chose to escalate the situation. They were completely out of line.", "NTA.  Anybody have cameras that caught this confrontation?", "NTA. It seems their dog takes after the owner. Yap yappity yap thinking they’re king shit. Or maybe vice versa. In either case, you had no obligation to cross the street when your house was literally right there. If dumdum has an issue, then dumdum does the crossing.", "How many posts here are real? Even if this happened there is no way anyone would question who TA was in this situation.", "NTA. In would take up permanent residence at that spot, laughing at him the whole time.", "NTA. My real thoughts about that man would get my comment removed, but suffice to say he is 1000% in the wrong and a rude narcissist to boot. Sidewalks are for everyone, if they’re uncomfortable with that then they need to stay home. My (small) dog is very friendly, but I always keep him leashed and near me and won’t let him approach other people/dogs unless they’re okay with it. It’s that simple. If I’m ever uncomfortable bringing him past someone/another dog, it would be my responsibility as a dog owner to remove both of us from the situation. The audacity of that man is astounding. I admire your family’s self control because I would have reacted in a much louder and angrier manner.", "I have never heard of this \"common courtesy\" of leaving your side of the street because you have a bigger animal. WTF is that?", "100% nta. Theyre welcome to cross the street if they feel uncomfortable with their unleashed, untrained dog. It’s just so rude that they expected you to get a stroller down and up another curb with a large dog to allow them to cross. Common courtesy is just moving over on the sidewalk so there’s room for everyone", "NTA. This is not a common practice at all! I have a large lab mix who is 90lbs and if a man was yelling at me to “cross” the street while he was standing in front of my house I would have told him to F off and probably call the police.", "NTA haha what? if they do not want to be near your dog, they should move. There's no \"bigger dog\" rule. I'm sorry he screamed at you, his behavior from the start was aggressive and arrogant. \n\nMy dog does not always react well to other dogs because we have had to many run-ins with owners who do not control them. She has been jumped on and growled at by dogs passing on the sidewalk, and she's 70lb of mush. She won't hurt anyone but she will posture if she thnks they are getting too close now.  So it's MY job to remove her. If there's another dog coming our way, we pull over and sit until they pass. If there's an unleashed dog that comes up to us, I will defend us both and have no qualms about it. It's the owner's problem for not following laws and having common sense.", "Nta common courtesy is to leash your dog, which they didn't do, which you had done. Maybe and this comes down to training I don't cross the street with my dogs, they are both trained to 'sit' when I want people to pass us or 'ignore' if I need to pass people. Sounds like they have a poorly trained dog and expect everyone to accommodate them.  Because personally I would have told the guy 'my dogs are sitting you figure your own dog out'", "Nope. My dad has an extremely dog reactive 90lb pitbull. Guess who has been trained to SIT AND STAY on a short lead while the other dog goes the other direction. This works because he's in a small apartment complex, knows the neighbors with dogs, and asks nicely if it's someone who doesn't know Bubba.", "NTA—A calm, well-mannered on-leash dog being walked by a person with a baby in a stroller is not obligated to cross the street.  I had a small dog who would not hurt a fly and was always on a leash, but I would pick him up and cross the street to avoid encounters with larger dogs or even other small, but clearly overly excited dogs.  Applause for your neighbor who stepped up to help you, btw.  And if anything like this happens again, call the cops and start recording the miscreants with your phone to have a record to show the police.  Unfortunately, the idiots know where you live, so you may want to invest in a security camera system and watch your dog when he’s in your yard, in case the idiots try to poison him.", "NTA \n\nI’d crosspost this to r/EntitledBitch, tbh", "I would have yelled back at them \"leash, leash, leash!\"", "NTA that man is deranged and a menace. They should be fined for not having their dog on a leash and it would be their fault if it got hurt. Common courtesy would be to let a woman with a stroller (or anyone) WALK TO THEIR HOUSE. If they didn’t want to cross the street they could have…. STOOD STILL. Good lord.", "The RULE is have your dog on a leash.  That's not only \"common courtesy\" but it's usually the LAW.\n\nNTA of course", "NTAH.  If he shows up again, remind this wanker that there are leash laws as well.", "NTA if they're afraid of your dog, *they* can cross the street.\n\nThat being said, is your dog a pit bull mix? If so then I'm switching to ESH.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (35F) was walking my dog and pushing my 4 month old son in his stroller just to get some air. My husband Mike (39M) was with our other three kids holding down the fort. My dog is a mutt and weighs around 90 pounds. His vet thinks he is a lab mix of some kind. He’s the sweetest dog on the planet and so patient with my kids who are all under 7 while he’s around 11 years old.\n\nWhile heading back toward my house there was a couple walking their smaller dog, a terrier of some kind I think, on the same side of the street as I am. The couple was maybe 2 to 3 houses from me at the time when they yelled “Cross!” at me over and over. My house was between me and the couple at the time. I stopped for a second and figured they were yelling to let me know they were crossing the street so I kept with my dog and stroller towards home. I had no intention of crossing the street since I was on the same side of the street as my house and had my infant son with me.\n\nThe man became kind of aggressive with me while I kept trying to get to my house and kept yelling Cross over and over. I tried to explain that he was standing in front of my house and I wanted to get my baby home. He told me he didn’t care and it wasn’t his problem. About this point my husband had come outside (that’s how loud this guy was) and told him to leave me alone. This guy turned to my husband and started screaming in his face. Honestly I was scared of this man. He kept going on and on about I had no manners and that since I had the bigger dog it was my responsibility to cross when coming up on others with a smaller dog. \n\nMy dog has never been aggressive with anyone or any other dogs. Like I said we have four kids under 7 and we have 2 cats. He’s a sweet boy. During the entire ordeal my dog just sat down next to me and the baby. He was leashed (unlike their dog) and super calm while their little dog was running all around barking constantly. Mike told them to get off our property as the man had gotten in his face and was in our front yard to allow me, my dog and our baby to come back home. At this point my next door neighbor (who’s house I had stopped in front of during the confrontation) came out as well. He basically escorted the three of us up my drive way so I could get my baby inside who had started crying with all the noise. \n\nBefore the man and his wife finally left he called me an asshole for not following “common courtesy” in crossing the street. I don’t feel like I should have been expected to since I was going home and only a few houses down from my house when this all first started.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA I have never heard if this your don't was on a leash if there didn't like a big dog being close to their small dog they cross not you \nWant is common courtesy is having you dog on a leash especially if you are worried of other dogs they suck", "NTA\n\n&#x200B;\n\nThere was NO need for you to cross the street. \n\n&#x200B;\n\nIf THEIR dog needs more distance, THEY have to cross the strret.", "NTA. If they had unfounded concerns about your dog, or if their dog doesn’t like other dogs, it is on them to cross the street. My dog is somewhat reactive to other dogs while she is leashed and I always take it upon myself to cross the street, move over, etc if another dog is approaching.", "NTA - what a load of shit, fuck those people", "PULEASE! If that man was sooo concerned for his little dog, HE should have crossed the street. No one in their right mind yells at someone to cross the street if they are afraid of some else’s dog!. You did nothing wrong- this guy was just hopped up on self righteousness and control.  If legal in your area, carry something to protect yourself, since this AH knows where you live- bear spray or taser. Even dogs tend to get out of your way when you just show either of those to them! NTA,", "NTA, guy sounds like a lunatic. Absolutely not a thing", "NTA. The person who has the problem is the one who should cross. If your dog isn’t good around other dogs or people, it’s your responsibility to know that and adjust.", "OMG.. seriously, not a thing at all!! And his dog was off leash, I’m speechless, what an asshole I hope he stays off your street.", "So someone accosts you and your husband but you were worried that you were the asshole? What?", "NTA. I had a smaller, aggressive dog and I was always the one to cross the street. It’s wild they thought you needed to accommodate their dog on a public street, let alone in front of your own house.", "NTA. You should have said something to him about not having his dog on a leash. Either way, that guy is delusional and you had no obligation to cross the street.", "NTA", "NTA what the hell kind of entitled crap is that? If it mattered so much they can cross.\n\nThe only slightly similar rule us with bearded men and the smaller beard gives way. If that rule applies to dogs too then I could understand it somewhat.", "NTA. The obligation to cross is on the asshole with the issue.  I have oneof these chuds in my neighborhood. It sucks", "NTA. There is not such \"rule\". If your dog can't be around other dogs or you are scared of another dog for whatever reason, you cross. Simple. \n\nThe only way it would be your responsibility is if you knew your dog was a reactive dog and would get agressive at whatever was coming, and this is clearly not the case.\n\nThis person honestly sounds deranged. If you ever see them outsidee your house again and they are agressive I would concider filing a complaint against them.", "NTA The unwritten rule is that the person with the reactive dog crosses the street. Also his dog should be on leash to avoid any potential issues.", "Nta,  the dog with the issue crosses the street no matter the size", "NTA.  That guy just sounds like a dick.", "NTA\n\nMy first response when he said \"not my problem\" would have been \"well whatever you have going on isn't my problem\", and when he was busy screaming in people's faces it would have been \"get off my property or I'll call the cops\". Maybe bluffing, maybe not, who knows.\n\nDude's a straight dumbass to think that standing there with a small dog dictates that you can't go home because \"common courtesy\".\n\n*If* you had an aggressive dog (I take your word you don't) it would be your place to cross *except away from your own home* I mean lolwtfbbq, dude. In any other case it's on the other person to cross if they want to stay away from your dog, because it's their problem with dogs, not yours.", "NTA. And F that guy. I hope he gets bitten by a rogue donkey with sharp teeth.", "NTA\n\nHe sounds bananas. Bonkers. Batshit crazy.   \nIgnore him, and just go home.   \n\n\nIf he is so worried about his dog he should protect it… by crossing himself.", "Nta\n\nIf they are worried about their dog they can cross.\n\nA smaller dog is easier to  handle(physically) than a big dog.", "NTA he was a bully. And doubled down with nonsense when your husband approached. Dude is a jerk.", "No, NTA at all. There is no \"common courtesy\" about dog walking. If he is worried about his dog then he can cross the street with him. I have 2 dogs - 60 pound and 100 pounds. Typically my husband and I walk them together, but when he is out of town for work I have to walk them myself. Combined they weigh more than I do. So if they want something they can take me for a ride! 🥴 Our dogs are well behaved, but they are dogs at the end of the day and will at times act up (excited, protective, whatever). I wish when people see us they would give us more space, but would never demand it. It is my job to keep my animals under control.", "This guy is an idiot. Can we make dunce caps a thing again? NTA obviously, this sounds like a dumb situation from I Think You Should Leave or something", "NTA.  That bigger dog rule is a new one to me.  Common sense says if you don’t want your dog to pass another you move your dog out of the way.  Not to mention you also had a child in stroller.  Absurd!", "NTA\nWhere did they get the idea they could direct other dog walkers to cross the street? If they were scared or if their dog is reactive THEY are the ones who should have crossed the street.", "They definitely should have crossed. NTA in any way.", "Had the dog had a leash it would have been one with an arsehole at each end.   \nYou however, NTA.", "NTA. That couple was really rude, and I bet their dog wasn't even slightly trained.", "NTA the nerve of him. Small dog owner here and **I** always cross when another dog is coming because my little ass dog is crazy and has napoleon complex. Big dogs are always calm as my dog is going tf off, they pay him no mind.", "He is entitled and made up this rule. He can carrying his own ass across the street\n\nNTA", "NTA\n\nThat's wild. That's not how real life works. You don't bark orders at strangers and expect them to obey.", "NTA, that man is unhinged. There are no “rules” about who has to cross the street so two dogs don’t pass. If he doesn’t want to get near other dogs then he should cross to get away from them. I would put this out of your mind (except keep an eye out for him….maybe get a doorbell camera….this guy might come back and cause trouble).", "NTA. Sounds to me as if you ran into someone who has narcissistic personality disorder.", "NTA the person who has the dog that doesn't like other dogs is supposed to cross.", "NTA - literally none of their logic makes sense. How and in what world would it make more sense to navigate a stroller AND a large dog to make way for a small dog. The fact that you were that close ti your house makes it even more stupid", "everytime I take my dog for a walk, almost everyone I encounter walking theirs cross or go out of their way to avoid my dog and I, even my own neighbors on my street! this has been happening even before all the dog sickness going around. Probably because my mutt looks mean but she wouldn’t hurt a fly. I will never go out of my way for someone else since I know my dog will never be an issue approaching others. She usually army crawls and just wants to meet new friends. It’s hilarious cause most everyone else dogs will go crazy, I just tell my sweet dog how good of a girl she is for behaving making sure they hear me. I also like when people will stop to the side to let us pass, I make sure to exaggerate it and give them plenty of space by going off sidewalk lol", "NTA. He was being incredibly rude. There is no such rule that the one with the bigger dog has to cross the street especially when the owner is just trying to get into their own property/go home. If he didn’t want his unleashed dog around another dog that badly he should’ve been the one to move.", "NTA\nThat man is an idiot, the common sense answer is if your dog has an issue with something (people, animals, or anything)  it us YOUR responsibility to avoid the problem. You don't get to demand a stranger move to make your life easier", "NTA so many times over. If you have a concern for your dog (which is fine some dogs don't deal with other dogs well) Then. It. Is. On. You. To. Cross. The. Street. The level of entitlement to expect a parent pushing a baby stroller to cross a street is frankly mind blowing.", "NTA. So two people with a unleashed (illegal), aggressive, small dog — seeing you alone with large dog, a child, and a stroller — couldn’t be bothered to cross the street themselves to avoid you all? And then yell at you about it? Man, what entitled arses.", "NTA I’m sorry you had to meet this idiot, you were by yourself and pushing a stroller.. common courtesy and common sense would have had the two adults without kids , just their dog, to cross the street. The fact you were practically at your house as well…", "NTA. Sounds like someone who doesn’t have his dog under control and has had conflicts before because of it. Illegal in most places to be off leash too. I’d report him if you know where he lives. Maybe you’ll get a juicy bonus of him breaking other animal laws and will have to learn to be less of an ass", "NTA That guy was a complete d*ck! I have a very protective dog when she is off leash but very different on leash. She is weird. Lol!  She is a very big dog and can look intimidating. So, I am very aware when we are in public. No one has ever yelled or tried to force me to cross the street.", "NTA, the rule is to have your dog on a leash and be in control of your dog out in public. You were not the rule breaker.", "NTA.  An aggressive man demands a lone woman to cross the street.  I'm sure he is used to throwing temper tantrums and getting his way, especially with women.  Was his companion trying to talk him into being reasonable, or was she so used to his fits that she has accepted his behavior as normal? I'm glad your husband and neighbor were around to help.  There is nothing you could have or should have done differently.   I do hope you took this AH picture and that you share it all over your neighborhood.  He deserves to be publicly shamed for being a huge AH.", "I’ve had dogs and never heard of the ‘rule’ to cross the street if you had a bigger dog. None of the training books we read talked about it.\n\nNow, the few times we walked our dogs by the road we did cross because one was fear aggressive towards strange humans and the other cowered if he saw another dog for everyone’s safety \n\nNTA", "NTA and that is a EXTREMELY unspoken rule as I have never head even a hint of it-is bullshit tbh", "NTA - Babies > kids > dogs > old, entitled idiots making up rules.\n\nSeriously, entitled fool got so used to people avoiding him and his wife with their unleashed, deranged punt poodle, that they decided it was a mark of respect.", "I think people need their own page for being dog owners because when I owned a dog, we merely kept walk and if someone else felt insecure, they crossed the street!!!", "NTA. The man didn't want to be on the same side of the street with you and your dog. That is a HIM Prolem. Therefor it is HIS responsibility to move HIMSELF - not demand that your change your trajectory!!", "NTA! Dog walker & dog mom to 3 rescues here. Whomever doesn’t want to walk by the other dog is the one who crosses. Personally I always cross because I don’t trust owners saying they’re dogs are friendly & I’m not setting any of my dogs (personal or client pups) up to fail by walking by an unknown pup.", "Honestly, he just doesn’t sound right in the head. I’m sorry he accosted you like that.", "He seems fun.  LOL\n\nCompletely NTA.  Dude’s beyond out of line with his behavior.", "NTA. I was a dog walker for years. This isn’t a rule. Entitled dog owners with unleashed dogs are TA, though.", "In my opinion it's the responsibility of the reactive dogs owner to control the situation, if you know your dog isn't good with other dogs then you should cross over. If they are afraid of bikes or small children then you do what you need to, to keep your pet content. You did nothing wrong. NTA", "There is no rule about bigger dogs crossing.  I bet there is a “rule” about leashing your dog.", "Mental illness or top class arsehole. They can suck eggs.", "Or just pick the little dog up and walk by?", "I’ve never heard that rule. You cross if you want to avoid the other dog. You don’t assume the other dog is going to cross. Regardless of size.", "NTA. I own a greyhound who is not dog friendly due to an incident with an off lead dog whilst he was on lead. He now wears a muzzle to keep himself and other dogs safe. I give everyone a wide berth because I don’t want HIM near their dog who 9/10 times wants to be his friend. It is my responsibility to remove my dog from a possible situation. \nWhat drives me bonkers though is if people leave their dogs leash slack or don’t bother with a leash when their dog doesn’t return on command. Stresses my dog out, stresses me out and sometimes my dog ends up barking and snarling and frothing like Cujo. He can walk past wallabies, cats, humans with out batting an eye but no dogs.", "NTA. That’s not even a thing. He’s obviously over entitled. If his unleashed dog has issues passing other dogs then he needs to cross the street. He doesn’t even sound like he should be owning a dog.", "Great Dane owner here. I’ve always got the bigger dog. I’ve never heard of anything like this. And even if I did, suck a dick. NTA", "NTA.\n\nI'd be damned. Especially as you had the dog leshed and were walking a stroller.", "NTA.", "NTA. It's common courtesy, even law (in some places) to leash your dog. Hell. My city requires both cats and dogs to be on leashes. Because the city understands the risk an unleashed pet can be.\n\nI don't have a dog and never have. But I have never heard of that courtesy. If they have an issue with walking by you and your dog, then THEY should cross. \n\nOh, but they don't have a leash and it wouldn't be wise to cross without one? That seems like their fault for not having a basic necessity for a dog. Doesn't matter if it's a small dog - it needs a leash. \n\nIf you have a pet that YOU think is in an unsafe situation for that animal, it is YOUR JOB to remove your pet from the situation. YOU are the one that knows them best. It is not the job of someone else - they don't know your pet like you do. If they thought your dog was dangerous, they should've been the one to move. \n\nNTA. If they come back, stand your ground.", "NTA, that's not a rule I've ever heard of, and it's a stupid \"rule\" to boot. If they are uncomfortable passing your leashed dog, *they* need to remove themselves by crossing the road, not you. Their dog should have also been leashed and they may have been violating council codes by having their dog off leash outside of designated areas.\n\nMost hellion dogs I have ever come across have been small dogs", "NTA. He's either pulling rules out of his ass or assuming that some courtesy he heard somewhere is a universal practice. Screaming at a woman with a kid loud enough to get so many people's attention makes me thing he's super unhinged.", "NtA— it was easier for them to pick the dog and cross— dumb ass—es—-these people.", "NTA, first of all most states have leash laws, even if your state doesn’t this dude has a dog with problems of other dogs it needs to be leashed. Call the cops next time, my dog was attacked because some asshat had its food by the door to go outside. Didn’t know the food was there and went to take my dog out potty and he got bit in the eye. I still am pissed about that. Also they should cross if their dog has issues not you. Also it’s your property call the cops next time, he is preventing you from getting to your own home. Also you have a stroller and a dog, I’ve pushed my niece and that was tough on its own, adding a huge dog makes it way more challenging. Check local laws to see if you can carry pepper spray in case the loose dog does try attacking your dog. I started bringing it with me because a girl had to go home and get her pistol to shoot a dog attacking her dog in my neighborhood and unfortunately her dog didn’t make it.", "NTA. I used to have a very reactive dog and it was my responsibility to cross the street or whatever to avoid other dogs. I never in a million years would tell someone to cross the street. If I don’t want to be on the same side of the street as your dog, that’s my problem and I need to cross.", "NTA why didn’t they just cross when they realized you weren’t and that you were going to your house. He’s the AH", "NTA. I have encountered this attitude recently from dog owners, and I don't get it. The people who are most uptight about it are crappy owners and their dogs are out of control (usually small dogs). Fight back against this nonsense!", "> He kept going on and on about I had no manners and that since I had the bigger dog it was my responsibility to cross when coming up on others with a smaller dog. \n\nHuh? I hate when people make up their own rules and expect other people to know and follow them.\n\nNTA", "nta", "I’d be making a police report, simply because these people are clearly psychotic neighbours who know where you live.", "NTA. - I have a dog and have never heard of this “cross” rule in my life, and if anything you have a stroller so I’d give you priority if I didn’t want our dogs near each other since that’s a heck of a lot more difficult to take across a road.", "Info: Which of you was walking against the traffic? I was always taught “Bike with traffic, walk against traffic.” One of you was on the wrong side of the road.", "NTA and I am sorry that this happened to you, but I think you knew you weren’t the asshole when you posed this question", "It's situations like these that make me wonder if percussive therapy (a righteous ass kicking) might improve some people's attitudes.", "NTA - lifelong dog owner, & never heard of the fabricated “bigger dogs must yield” idea.", "NTA. There’s no reason why they couldn’t cross the street if they felt more comfortable doing so. There’s no rule that bigger dogs have to cross (that’s ridiculous). Your dog was on a leash. And you had a baby in a stroller. All signs point to them being the AH honestly.", "You are NTA. he sounds as ill mannered as his grouchy little dog which is completely untrained. If some AH wants dogs not to  meet, it's their problem. You obviously weren't very mobile. When I walk a reactive dog, I cross. He has the reactive dog. Not only that, if you're walking a dog for exercise, crossing the street is excercise.", "NTA. My dog gets super excited meeting other dogs and so I cross the street if i see one coming because we’re out for a walk or run, not to greet other dogs.\n\nHis dog should’ve been leashed and under control and if they were uncomfortable passing another dog they should’ve crossed \n\nIf you know your dog is aggressive then yes it’s ok you to cross… but your dog isn’t aggressive. You did nothing wrong, I hope you are okay", "NTA", "NTA. \n\nIs this a rule this guy made up in his head?\n\nI can see trying to stand off to the side and keeping one of the dogs in place to allow the other to cross, but if either dog is that untrained then you probably shouldn’t be walking them in close proximity public places.", "In what world does the person with a dog and stroller have to cross the street and not the two people with a tiny dog? They can carry their dog in one hand, but they think you should cross and run the risk of you or the stroller being hit. \n\nNTA", "Yea that’s not a thing… NTA", "NTA\n\nNever, Ever heard of such an etiquette rule.", "If anything this would be handled as a nautical procedure and the larger ship would have precedence\n\nYou had the right of way", "Common courtesy would be them leashing their dog.\n\nNTA.", "NTA. I hope you don't live in an HOA.", "I have a dog that can be a little crazy (heeler mix) so when I walk him and another dog is approaching or otherwise distracting him from my commands WE cross the street or leave the vicinity. To me, if your dog is not 100% friendly then you are responsible for keeping it away and warning others. If your dog is friendly and loves people and other dogs, then you can be wherever you like! I always thought this was the \"rule\".", "An unleashed yappy dog would be a snack for my boys.", "NTA, you seriously can't make up rules on the fly and expect others to bend to your iron will.", "NTA i have reactive dogs and if I'm by my house I'm not crossing, if I'm already on the block I'm not crossing, if someone tells me to move I'm not moving. I show courtesy when I can but at the same time I walk a pack of biggies. So you can take your lint ball and go about your business", "NTA\n\nCommon courtesy for dog owners includes scooting over on the sidewalk to share or crossing if you know your dog is reactive. \n\nExample: my 150 lb Saint Bernard loves to approach everyone but his size is intimidating. If someone is walking toward us, I move over as far as I can and shorten my hold on his leash. Only in cases where I’m concerned about safety of all parties do I even consider crossing.\n\nTheir dog was off leash and rambunctious whereas yours displayed no signs of aggression. OP, they are ignorant people that think the world revolves around them. They were looking for a fight. Responsible owners know their dogs and know how to react to others on the sidewalk. There is no weight based rule on how to share a public space. You did nothing wrong and I seriously hope these people were just visiting the area and will never be heard of again.", "NTA! What the Hell?? No, it is NOT common courtesy to expect someone else to cross the road just because you yelled it out to them like you're calling \"shutgun!\" when heading out to the car. That's not a thing. \n\nDude was WAY out of line.", "NTA.  It doesn't even matter where you write in relation to your house.  Having a bigger dog doesn't mean you cross the street.  If your dog were aggressive, it would be your responsibility to avoid people; otherwise,  the person (them) who wants to avoid a dog (yours) needs to cross.", "I only had to get to the second paragraph to say your ***NTA.*** Your walking a dog and strollering a child. (Of course you should cross the street. Absolutely **NOT!**)  \"Common Courtesy\" should have played out simply because of the stroller and they should have crossed the street, and nothing else.\n\nThose people didn't have a clue about, guess I'll call it \"dog walking etiquette\" besides just letting their dog run loose. Perfect example of dunderheads that feel entitled.", "NTA- and a big WTF?!\nPretty much anyone with a dog knows that if they don’t want their dog to interact with another on the sidewalk, it’s on them to take evasive action. So weird.  My dog doesn’t like small kids on those scooter things. When I see them coming, I move my dog out of the zone. Crazy poodle off leash? I walk away with my dog. \nSorry you had to deal with them.", "They should have crossed because baby trumps terrier. NTA", "NTA that’s completely absurd!! If his dog was off-leash, he needed to be responsible for picking the dog up or leashing it if he was worried about a confrontation with another dog. And you had your baby with you! This man sounds unhinged and I would avoid him as much as possible. If he bothers you again, get a restraining order.", "Don't let people make up bullshit rules. Walkers with reactive dogs must cross, not yell at others (esp leashed ones). Leave alone a grown man asking a woman with an infant in a stroller.", "Nta. I would have just kept going.", "NTA. They could cross the street, world does not revolve around them and their dog. Especially when you are right in front of your house", "NTA- This man thought he had any right to boss you around, especially with a unleashed dog . Clearly his bully behavior goes unchecked at home but seriously he can feck off.", "NTA. Their dog was not on a leash, the automatically lose. I come across these entitled assholes everyday that don’t seem to know animals are unpredictable.", "NTA. This is the dumbest thing I've ever heard. Just this morning my husband and I were walking our Jack Russell Terrier when we came across a black and white cat who was enjoying a sun bath on his yard near the sidewalk. My husband held our angry dog back half a block so I could pet the cat and then we traded and I held Maggie back while my husband went up to give the cat a nice, long head scratch. When we continued our walk, we walked in the street so as not to disturb the cat. We had no problem stepping aside for an animal. I can't imagine who this A-hole thinks he is that he would demand that a mom and her baby get out of his stupid way. Enjoy a good laugh at all the great comments here and don't give this idiot another minute of your peace.", "I have never heard of this “rule.” If we feel uncomfortable approaching another dog walker WE cross the street. Or step off the sidewalk and go really short on the leash. It’s on us because the issue is ours. Leaving out the whole off leash situation because I would have told the guy to leash his gd dog. What a nightmare, definitely NTA.", "NTA\n\n\nThat other dude is a deucebag.  You have a big dog and a baby and he wants you to cross? If he wants to talk about common courtesy, then you should've told his weak ass that him and his rat dog should cross since you have more going on. What a power-tripping AH that guy is.", "Imagine thinking you can demand that someone else cross the street because their dog is bigger than yours. Unhinged behavior. NTA.", "NTH same happens bro", "NTA and there is no such rule (not in the US anyway). It's generally the reverse actually. The person with the dog/dogs that are not down to meet is responsible to cross or turn around to avoid other dogs or people. Beyond that, only an AH demands a woman walking a dog AND pushing a stroller cross the street. That's ridiculous.", "NTA\n\nThere is no rule, he is being ridiculous. \n\nI would say a courteous thing to do IF your dog is aggressive would be to cross or find somewhere you can sit/stay well off to the side (not the case here obviously). As a whole I figure if someone is seriously that concerned, THEY can cross the street. The fact that their dog wasn't even leashed AND they were freaking out like that is really the issue here.", "NTA, and the only asshole here is the one who is screaming like an insane person while their unleashed maniac of a dog is running around. If that dog had come up on my dogs, it would be dead. And it would be their fault, not mine.", "NTA. Who the hell are they to tell someone to cross the street. If they’re uncomfortable with someone being on the same sidewalk as you then THEY should cross the street and get on with their day. What an idiot.", "WTF is this yelling \"Cross\" business. I've never heard of such a thing. And this expectation of someone taking their dog out of the way so it's more convenient for them is absurd. \n\nI would've yelled back, \"TRESPASSING!\" when they got to your property. Fuck that couple and their entitled bullshit.\n\nNTA.", "NTA - the person who doesn't want their dog to be near other dogs is the person who should cross the street.\n\nThe rules and manners they claim are imaginary and quite wild considering their displayed lack of manners. It sounds like they took their unleashed yapper on the road, spoiling for a fight and were excited to try to have one with a more vulnerable person. If they were so threatened by your big dog, they wouldn't have been causing and prolonging a confrontation.", "NTA. If someone wants to avoid a dog on the street, it's on them to cross. In this case, he wasn't willing to be near your dog, so it's on him cross. Simple etiquette. Yelling at you to cross smacks of \"only I matter\" narcissism.", "Wow. You are NTA. But that couple are HUGE AH. women with infants have the right of way. He wanted you to cross the street with an infant and a dog???? What an AH.", "NTA - Dude is off his rocker and unhinged.", "Sir, this is a Wendy’s.", "NTA. That guy made that shit up.   \n\n\nFurther, if someone has a problem dog, it's \\*their\\* responsibility to keep it away from other dogs, not vice versa.", "NTA. Even if you weren’t near your house it would be up to the jerks with the off-lead dog to cross. You had a baby in a carriage. They could clearly see that you had the baby in the carriage!  They are horrible people. And is it even legal where you are to have a dog off-lead?", "I have a small dog, NTA. If his dog can’t handle bigger dogs he needs to take the dog for training. If your dog was barking and lunging at the small dog sure but otherwise no. He can F himself.", "Nta, I've had dogs for over 40 years and never heard of this 'rule'. I'd have told him leash your dog (most places that seems to be a law)", "This is insane. NTA & that guy sounds unhinged. Also this is why I am a big-dog owner for life! People don’t train their little yappy dogs because “oh they’re harmless” so they remain completely out of control & try to instigate fights with everyone else.", "NTA my dog is a little poo head. So whenever we see another person or dog headed in our direction. We cross.", "NTA these people are making up rules for public places lol sorry but that's not how society works tell them to beat feet", "NTA\n\nLike most people, I've never heard of this \"common courtesty\" bs! If they were so worried, they should have crossed!", "Imagine having someone yell at you in front of your house. Like dude that's my house I'm trying to get to. \"I DoNT CaRE\" hahah NTA", "Since he's a big man, shouldn't he always cross to be courteous towards smaller humans?", "NTA I have been a small dog (chihuahua etc) owner for 10 years. This is not a thing. if you are concerned YOU cross the street. You don't yell at strangers because you are too lazy to take responsibility for your own dog", "Common courtesy in his mind only. \n\nIf he wasn’t wearing lederhosen and playing an accordion with sparklers shooting out his butt, it doesn’t count", " NTA. When he kept yelling \"cross!\" you should have said \"I am making the sign of the cross, but your demon dog is still here!\"", "Just holler back \"LEASH LAW\".", ">since I had the bigger dog it was my responsibility to cross when coming up on others with a smaller dog. \n\nFiddlesticks. If you know you have a reactive dog, then cross the street, or if you are the one who is nervous about the dog coming, then cross the street. You were by your house, on the side of the street you needed to be on, with a stroller! Common sense would dictate that the couple and their little dog would move but it doesn't seem like he's got a lot of that. \n\nMy dog might be reactive; it's only been a couple of dogs but if we meet one we don't know, I'm not going to find out right then so I'll cross the street with her. It's my issue. NTA", "NTA if he has any concerns about dog interactions he should have leashed his own dog. I’m so tired of people walking around insisting others accommodate their every whim with the sense of entitlement of kings and queens.", "I have two 3.5lb dogs. It's  my responsibility to keep them safe. At the first sight of any approaching dog, they are picked up and moved away. \n\nThe audacity and entitlement to expect a mother with a stroller to accommodate their dog is astonishing.", "NTA. This guy sounds insane... I have a small dog and we live in an area with big dogs that a lot of people cannot control tbh.  And my dog got attacked before, so I'm very paranoid. But I always cross the street if I see someone who has a dog that is losing his mind over mine. \n\nYou did nothing wrong.", "NTA - Also have never heard of this weird rule. As an owner of dogs we usually meet and greet people on the sidewalk.", "Clearly it WAS his problem.", "NTA. Leash laws are real. Even if there was a right of way situation, he loses any ground he stands on by not having his animal on a leash.", "NTA at all. Call animal control, let them know that there is an aggressive dog owner \"walking\" reactive unleashed dogs in your neighborhood. Tell them the time of day it happened, I bet they would be willing to swing by around that time the next day and catch them in the act.", "Absolutely NTA - even if you weren't right at your house, this is not a thing. Dude's crazy.", "NTA", "Nta their dog wasn't leashed and even if,  nta", "NTA I have a small terrier, she's very reactive around other dogs as they make her anxious, and I generally have to be on the other side of the road from other dogs to avoid her getting stressed. So obviously it's my responsibility to take my own dog across the road and away from other dogs.", "My work involves walking dogs, this is not a rule. Anywhere. Ever.  \nNTA, if it happens again report them to the police for harassment. It likely won't do anything, but it will make a note if anything gets physical.", "NTA. That's not \"common courtesy\". That's a rule that guy has made up which exists only in his head. Even if it was the rule, which is definitely isn't, it wouldn't be the rule *outside your own damn house*! \n\nI have a nervous dog who is on the smaller side and can be reactive. If I see a dog approaching and I don't think mine will be able to handle appropriately, *I* cross the road. My dog is my responsibility, no one else's.", "I call bullshit. There is no such rule. If you know your dog is aggressive, then you cross the road. NTA, guy walking dog should be on a leash.", "NTA, is his dog doesn't do well with other dogs it's his job to do something about it and cross not yours 🙄 the entitlement of some people is wild", "NTA. Your dog was under control and theirs wasn’t.", "NTA. Common courtesy is putting your dog on a leash. I’m sure any passing policeman would have been happy to remind him of that.", "NTA\n\nAnyone genuinely afraid for their dogs safety will not have their dog off leash when seeing another dog approach. They would leash their dog and move out of the way.", "Definitely NTA. Don't drive with men in the future.", "Um that couple is kooky as hell. Don’t give it another thought. And don’t even look in their direction if you have the misfortune of encountering them again. Weirdos.", "Nope, NTA. I think it's common courtesy to cross the road if you don't want your dog to be around other dogs or people. You don't yell at someone else to cross!", "Maybe this guy was delusional.  The only reason to yell at a mother with her baby is for their safety.", "Nta, utter nonsense if someone is shouting  out cross the road then they are  the ones that need to cross, not inconvenience the person with a child in a pushchair and a dog.", "NTA. As a woman, I’ve found that men don’t cross the street or move out of the way when approaching, so I’ve decided not to do it either. I stand my ground, 80 pound dog and all. If he has an issue, he can cross the street.", "Your husband should have knocked his ass out.", "Eh.... No, you're NTA. That rule does not exist. The only reason to cross the street is if YOU know that YOUR dog doesn't do well with whatever is coming your way on the side you're on. In that case, YOU are the one that needs to cross the street, not the other person. To yell cross at someone and get aggressive towards them if they don't listen to your commands like a dog, is insane. \n\nHe was TA, they should have crossed the street themselves instead of barking commands at you.", "It’s not your responsibility to cross the street, simply because you are about to cross paths with someone.   If he was worried about his dog, he should have had it on a leash, which would have made picking the little hellion up while you and yours made it home.   \n\nIf he confronts you again, call the cops.   In fact I would so so now, if only to get it on record so that the next time, and there will be a next time - this man is clearly unhinged, there will be a record of it with his description.", "NTA. I've had medium/large dogs most of my life, and while I try to at least get to the side when someone's coming (especially if I know my dog will pull) I know that it's my choice to do so, and I don't expect others to do so.", "NTA I've walked many dogs in my life. The easiest one to walk is a 90-100 lb lab mix who never pulls at the leash and doesn't react to other dogs. \n\nMeanwhile, I've seen little dogs that go absolutely nuts whenever they see another dog.\n\nThere's no common courtesy that says someone with a bigger dog must cross the street.", "You only cross the street if your dog is an asshole, like mine.", "NTA  - if you want you dog to not be near another one,  it's your responsibility to do that.  Not the test of the dog owners in the world.", "NTA, they could have crossed, you were basically home. Not only was your dog on a leash and theirs wasn’t you were also pushing a stroller. Most people prioritize, a baby for a dog or literately anything", "NTA. It would have been easier for two adults with a small dog to cross the street. He had no right to tell you what to do, and he really shouldn't have screamed at you, in front of your baby, and then at your husband.\n\nI have a large dog who is kind of an ass to other dogs, so I would cross the street or turn around and go in the opposite direction. But it's easier for me because I'm just one person, not walking with a baby.", "NTA, in no way, shape or form. Even if you were nowhere near your house, it's not your responsibility to avoid their dog. If they're uncomfortable with their dog getting close to other dogs, that's their problem. Their dog was not on a leash. You had a child in a stroller. I could go on. Please call the police if that man harasses you again and start a report, that's insane behavior.", "Nta if they wanted to avoid you soo badly they should have crossed. Also you had a baby in a pram. Super impracticable. I have 2 large dogs and just keep them close when passing others. I have had no problems", "NTA- IF your dog was normally agressive, then yes I think you should have. However, you had dog+baby. If he was the one worried, he should cross over.", "NTA. If they're concerned about your dog, they should cross and get away from the situation.", "NTA not even an excuse me or please from them?", "NTA that guy sounds entirely too stupid to own a dog.", "NTA. He sounds completely unhinged.", "Exactly, always thought the rule was that YOU cross the road if YOU don't want your dog near another dog for whatever reason.", "Right? This is the weirdest shit I’ve heard today. There’s no unspoken rule about crossing the street. If their dog is reactionary then THEY should cross the street. Not to mention their dog should’ve been leashed. OP did absolutely nothing wrong.", "On top of how ridiculous the whole thing is. Why wouldn't they just pick up their small dog? It would solve all the issues. \n\nPeople are so weird. OP NTA", "As someone with a small dog who does NOT like other dogs, I’ve always taken the rule as whoever’s dog is the one with the problem is the one responsible for crossing the street. Which would absolutely mean I’m crossing the street with my disruptive terrier. \n\nVery obviously NTA here.", "I agree!\n\nPlus, his dog was the poorly behaved, unleashed dog.   OP’s dog was chill.", "I missed the part about their dog being off-leash. They are the AHs in this situation just for that.", "NTA. There isn't any rule. If their dog has issues with other animals it's up to them to manage the issue by taking their dog across the road , or nicely asking you to wait a minute so they can distract their dog.\n\nAlso they are A Hs for not having their dog in a leash in a public area", "We were once doing practice for a charity walk and took our very well behaved dog, on leash, with us on a 2 lane designated walking/cycling track. I was walking next to my husband on the outside of the track, our dog was just ahead of him on a short lead on the inside of our lane on the track. This crazy woman was walking in the other direction with 2 very large dogs on leash that she clearly had no control of. As she came towards us she started abusing my husband (literally screaming at him to get our dog under control) and telling him our (perfectly calm and confused) dog should be on the outside of the path. Literally because she had zero control of the two giant dogs she had. My husband is a really calm and kind person but he did tell her to fuck off haha. Some people just want to blame others for their lack of control. NTA", "I feel like OP may be stretching the truth a litttttle bit too much but agree NTA. If anything the small dog  owner should pick their dog up when crossing paths while the big dog owner holds their dog extra tight by the collar/leash", "They made that rule up and forgot to post it on Reddit.", "The general rule is if your dog can't handle another dog, you pick it up (if it's small enough) or cross the street. Others do not have to accommodate for your badly trained dog.", "We have a 13y beagle who's hit or miss with other dogs and humans. I generally just keep him on a short leash and pick him up and carry him if things look like they might get hairy. Like wtf? If you think your pup might be a danger or in danger, it's your goddamn responsibility to handle it!", "That rule was made by people with small dog syndrome.", "You are right, except that even if you took everything the dude said for granted, \"you are in front of my home and that's where I'm going\" would trump it all anyway. A person can cross the street and still walk down the street. A person cannot stay away from the small dog in front of their home and still go home.\n\nSo like, the situation is just full of reasons that are sufficient and not mutually necessary for the guy to be astonishingly wrong.\n\nAgain, broadly, you are 100% right, just highlighting that the house point does add to the absurdity.", "This right here! Call the police! An off-leash dog and screaming AH is never a good combo!", "Yes, exactly this!  That guy and his wife wouldn't know common courtesy if it bit them in the rear end.  Them trying to enforce rules they made up themselves is ridiculous.  They were incredibly rude, demanding, aggressive, and very likely breaking leash laws.", "As someone who has an asshole for a dog, I agree. We're the problem so we need to come up with solutions. My dog would absolutely instigate a fight and then lose so for everyone's well-being and peace of mind, we move and actively avoid others on walks. To leave the situation up to someone else who doesn't know my dog is an asshole is negligent.", "ooooh, well played.", "Police will be RIGHT over.", "Again, report it NOW. THIS incident has an uninvolved witness (the other neighbor) Even after the fact having on record may encourage this guy to avoid her street in future", "I’m kinda convinced a majority of people that own dogs are assholes. It’s wild the amount of people that won’t pick up after their dog, keep it under control, or give it enough care and attention. Maybe I’m biased since my dog is my baby though.", "Yeah, this is the real key, it's totally irrelevent that they were almost home.", "Yes! My dog is a bit of freak show on lead, so we always step aside and I put him in a down as people and their dogs go by. My problem is other people seeing me do this, and come up to us anyway to try and have the dogs make friends. I am like, read the room here!", "Right? Once I was out for my morning walk, and who should come walking down the sidewalk right toward me but a skunk! You can imagine how fast I crossed the street, LOL. \n\nBut you're exactly right- the one who has the problem is the one who needs to cross the street. This whole \"the owner of the bigger dog needs to cross the street\" is not a thing. And yelling \"Cross!\" is not exactly a way to win friends and influence people. If there was a compelling reason I could not cross the street (I had a broken leg and was just standing with my dog in a tiny strip of grass while he did his business) I would say, \"I'm so sorry- my dog doesn't always get along well with other dogs. Would you mind crossing the street?\" I'll bet OP would have done it gladly if they hadn't been such jerks about it.", "This is a great suggestion, IMO.", "Brilliant.", "Check on what the fine is for unleashed dogs in your municipality and scream that back, too!", "your last sentence/question is likely why his dog is so neurotic!", "I was thinking the same thing, he’s lucky he didn’t scream in my husband’s face after yelling at me.", "really loving the visual of your chihuahua squaring up to a completely indifferent police dog.", "I also have a chihuahua that thinks everyone needs to bow down to him. I usually take him and my chow mix together on walks and somehow he is less of a dick on walks with her. I call her his emotional support animal.", "Or they could pick the stupid rat up and save everybody the trouble.", "Pitbull mix would change absolutely nothing in this scenario. Get outta here with that trash.\n\nClear cut, NTA.", "No he’s not a pittie mix. He’s lab and likely a heeler mix based on his size and coloring per our vet. He’s a big doofy ass dog who wouldn’t attack a burglar if someone broke in but rather beg for ear rubs. He may also knock you over with his tail wags.", "When we had terriers (Scottish) who were assholes we would always cross the street to not encounter other dogs unless the other party crossed first. I had the terrible dogs so why would I make someone else cross?", "That is the rule. Know your dog, if it’s unruly, take care to not let that impact people. Yelling at you to cross is the cuntiest most agro entitled thing I’ve ever heard of", "fr. plenty of dog owners want their dogs to meet other dogs. it’s not fair to expect people to just assume. it’s also rich that this guy is standing in front of her house, yelling at her to cross, and it’s “not his problem”. whose problem does he think it is, exactly? nta.", "It is. This guy is both an idiot and and asshole", "It's not even rule or no rule, it just makes basic rational sense.", "This is what I always do. I have a chihuahua and she barks a good bit. When I see someone coming with a baby or big dog or for any reason I always cross the road. Even if it is one person by themselves I do it because I know my dog can be annoying", "This is what I do! My dog is iffy with other dogs so I keep her on a short leash and don’t let her get anywhere near other dogs. It’s my responsibility to keep her safe and out of trouble.", "That is the rule.", "I have a small, old (17m), occasionally grumpy dog.  (He was so sweet with other dogs till he lost his vision.). I always pull him away from other dogs if they get close and I’ll happily cross the street if there’s not enough room.", "If only the other man hadn’t been so busy flapping his gums about he would’ve noticed his dog was the hyper one running about mindlessly.", "This is why I always cross the street.  But I also don't have an infant in a stroller.  I of course wouldn't have asked her to cross the street and my dog would always be on a leash.  Why, you ask do I have my dog on a leash, because I love my dog.  \n\nThat couple was, rude selfish, and does not love their pet.  \n\nOP was definitely NTA!", "I always cross the street now with my dog because he’s very chill around people he knows but is skittish when it’s other people/dogs he doesn’t know. It’s just easier to keep it separated.\n\nBut I’m also 8.5 months pregnant now and once I have my son and am pushing a stroller/walking the dog I’m pretty sure I won’t be crossing the street more than necessary. I would assume most people would cross or at least walk in the street for the duration of my passing since it would be a tight fit with the stroller, dog, me and another person and dog lol", "Scared they might get bit, probably.", "This is already a lost cause obliviously but picking up your dog every time you see another dog or person or stroller or w/e will just make it more tense in these situations", "I mean look at the behaviour of the owner.... Where would the dog learn any kind of manners from, because you can't teach what you do not possess.", "this right here. This is intimidation and harrassment and you want it on record", "Well, the majority of *people* are assholes, so....yeah.", "Same! I've got 2 reactive dogs I walk separately and use headcollars + harnesses to keep contained. There's only 1 neighbor in my area that doesn't have an attitude about my dogs and even stopped me when I was checking the mail to let me know she'd reroute if she saw us out. She was a total sweetheart and said I should be able to take them out without extra stress.\n\nIt's so sweet and I feel bad because I know my pups would love a friend, they're just loud and dumb in public 🥴", "My parent's Pomeranian tried to take on a moose. The moose was not concerned.", "that too.  sounds like the yippy lil thing needs a good dose of air jail anyway.", "She would be an asshole for owning a pit bull mix with 4 kids.", "You shouldn’t humour these ppl OP even if he was a pitty mix it would change nothing. Only part of what that guy said that was worth paying attention to was the “you can’t reason with these people” and apply it to the guy saying it 😂 NTA both this guy and the dude in your story are wild", "Exactly, and I have a Border Collie dog that's lovely but scared of bigger dogs and doesn't get along with certain breeds so sometimes if she's acting particularly nervous about an upcoming dog, I'll cross the road. My dog's the one with the problem so I cross the road unless they do first.", "Same. I have a hound who is insane when in our neighborhood (different dog when in the downtown area) plus two other dogs. I always cross when others are coming. I grumble under my breath when people cross to my side of the street, but I still move. \n\nAnyone has the right to walk where they please. I'm the one with the issue. It's unreasonable to think my neighbors need to accommodate it.", "I've come to the conclusion that all smaller dogs are arseholes by nature.", "I came here to say that I do that with my Rat Terrier, too. She’s a dick to other dogs and children, especially when she’s on leash.", "Terriers can be high strung.", "Hey who u calling an asshole? Kidding. I always give people and other dogs space when walking my Scottish Terrier. But he's actually pretty nice 😁", "Yes. I'm surprised I didn't see this comment sooner.", "Solidarity from one reactive dog owner to another. My boy is a rescue and I don't know what he went through before he came into my life, but he carries on *a treat* when in range of another dog, wanting to get over to them, barking and jumping - only to freeze with his tail between his legs once he gets there. \n\nI go out of my way to choose walking routes that are quiet because despite his issues he still deserves exercise and the sensory stimulation of being able to wander and sniff, and have been known to double back and take a side street if we're approaching another dog. The amount of people that let their dogs go off leash and call out things like \"don't worry, he's friendly!\" is appalling! \n\nYeah, your dog might be friendly! I don't know if mine is\\*, that's why he's wearing a harness with a bright orange \"DO NOT APPROACH\" patch, and we have a bright orange leash with \"CAUTION\" printed up and down it. \n\n\\*I should mention that he's lovely with dogs and people he's familiar with, but he's basically the embodiment of \"what if we turned the concept of stranger danger up to 11 and ripped the dial off\" when out and about", "You can't reason with these people. No matter how many tragedies you link or statistics you share, they'll always choose their dangerous pets over the humans around them who are in danger, because some people want to feel like they're the special exception instead of acknowledging reality. It's telling that they call them \"velvet hippos\" as a distraction when the violence towards humans perpetrated by hippos is also downplayed by adults who should really know better because tHeYrE sO cUtE", "Exactly.  My Chihuahua is getting better, but he is very reactive other dogs.  It's my job to scan the environment and control how near we get to other dogs.  Sometimes that means crossing the street; other times it means picking him up.  And sometimes it means doing both.  He is considerably less reactive than he used to be, but I never expect other people to try to make things easier for him.  My job.", "OP should really see if they can charge him with trespassing, harassment, making threats, or all three.", "My dog was badly abused when she was younger, and she's afraid of men and other dogs.  When we see other people, especially people with dogs, we cross the street or walk off the path in the grass, or whatever we have to do to get far enough away from the other people/dogs for my dog not to lose it.  I have the reactive dog; it's my responsibility to keep her safe and others safe.\n\nMy biggest fear is a friendly unleashed dog who thinks they're going to come over to my dog and make a new friend.  Or four of them with their owner yelling that they're friendly.  Sure, but my dog isn't, so I'm yelling at your dogs to get away for their protection, not my dog's.", "This is what I also do with my chihuahua", "YTA. So is the other dog walker. \n\n>My dog has never been aggressive\n\nAll dog walkers say that. Many are lying. I've been lunged at just trying to get mail from my mailbox. I now carry pepper spray to get mail at the end of my own driveway. \n\nTo my knowledge there is no \"rule\" including etiquette about who crosses the street. The guy yelling was in the wrong. \n\nWhat makes you an AH is not recognizing the dog you love may well be triggered by something you don't see, smell, or hear and behave badly. \n\nYour husband should have just called the police when the other guy was yelling and told him the police were coming to sort it out. And taken pictures.", "[removed]", "NTA. Why should you cross teh road with your baby, too? And did he not understand you were near your HOUSE? It's ludicrous to expect you to cross the road! \n\nI bet his dog is just as obnoxious a mutt as its owner.", "NTA. Your dog was calm and you had a stroller, whereas they had a hyper off leash dog. Whether or not you were close to their house, the onus was on them to leash their dog, which is the law almost everywhere, and cross if they were uncomfortable. They were acting entitled and making up rules that don’t exist.", "Well that's just weird", "Definitely not the AH.  I wonder if he could be arrested for... False imprisonment and emotional distress.? Guy is a menace.", "[removed]", "NTA.   I have a terrier that came equipped with the proper terrier attitude plus a bit more.   In saying that she is well behaved and well trained but when she sees a bigger dog she always thinks she can take them on (verrrrrry fine line between bravery and stupidity in that one) and because I know she is like this,   I cross over when I see bigger dogs.   Sound like his dog has the same attitude. \n\nThis man was an AH and I am glad your husband and neighbour were there because he sounds unhinged. \n\nI would like to know what was his wife doing while he was screaming at you?   She probably gets the same treatment at home.", "NTA- I have a minpin who is not a fan of other dogs. If we are out walking and I see other dogs walking on the same side I will cross to the other side. It would be ridiculous for me to expect people to cater to us and cross when my dog is the reactive one.", "NTA. They're the ones with the problem, they're the ones that should have crossed the street.", "NTA, if his dog is poorly behaved he should have it on a leash.  I have a big dog who IS aggressive and at most I'll pull over with her facing away from whatever would agitate her, but I would NEVER cross the street when I can literally see my house just to make room for someone else's little misbehaved brat of a dog, especially if they're being AHs about it.", "NTA. The audacity for him to ask you to cross the street when his dog isn't even leashed.", "NTA", "Nta if that person was worried about your dog he should of been the one to cross as it was his issue, if he had his own dog on a lead he wouldn't have to worry about his dog running up to other dogs", "NTA. How ridiculous. In the situation you’re describing it’s on the person who doesn’t want the dogs to interact to cross the street. And of course their dog was off leash. These people who let their dogs off leash outside of official off-leash areas are always the worst owners.", "He’s a loony. If you’re scared of a bigger dog, you cross over. It’s insanity the way he carried on. If you see him again I’d call the police and say you’re being accosted in the street. Let them hear him", "NTA of course. This man is seriously ill", "NTA. I have a leash reactive dog and I know it’s my responsibility to cross when safe with her, if there are others on the sidewalk.  I do get irritated when others cross when I cross, and I’m like wtf bro I’m trying to avoid you…. Or if runners or bikers (bikers are the worse about it) just insist on running too close behind me, and I don’t notice in time. She’s 70 pounds of pure muscle… pretty much only times I get peeved. But there isn’t a rule of cross because the dog is bigger. They can scoop up that little guy in no time. In your case, you have sidewalk right of way with stroller and little dog. They should be the ones crossing if they wish to avoid your dog. \n\nGuy was projecting a little too strongly with his untrained dog.", ">He kept going on and on about I had no manners and that since I had the bigger dog it was my responsibility to cross when coming up on others with a smaller dog.\n\nThat's not a thing, lol.\n\nNTA", "I cross the street to avoid women on their own whether I’m with the dog or not. He’s the arsehole.", "It's been a while since I had a dog but I did have a couple of reactive ones (adopted from shelters so we were unsure of their history) and the general rule of thumb was if your dog had a problem (or if you were unsure in those early days), then you crossed the road. Not the folks minding their own.\n\nNTA.", "NTA. I had something similar happen to me while i was walking my dog. Lady yelled at me to cross the street. Her dog was losing its mind, mine was calmly sitting next to me. I got called everything from a fat bitch to a cunt in that interaction. Some people just feel entitled. You were not wrong.", "NTA at all. I have 2 small idiots, who think they are big dogs, and will move away from others walking towards/near us.\nThat other guy is a fool.", "As soon as someone starts shouting at me to cross the road I am definitely not crossing that road.", "NTA\nThe ones with the untrained dog and with no manners are definately T A here", "NTA there is no rule that you must cross. If your dog is aggressive you probably should. But yours isn’t so I don’t see an issue. That and they were in front of your house. I cross for people with strollers and dogs all the time. Or just kids and dogs. Cause trying to get a stroller up and down the curb is tough. Trying to get kids across quickly is also a pain. So if I don’t think my dog can handle another dog we’re walking towards I am the one that crosses. They should have crossed the street. Since they’re the ones that wanted it. They sound like entitled jerks to be honest.", "NTA, you didn't do anything wrong, this man was obviously completely deranged", "NTA, also if you live in an area with a leash law I'd also threaten them with the police next time.", "NTA - as a dog owner I cross the road if I don’t like the look of a dog coming towards me. It’s not your responsibility to cross, especially if they’re outside your house!", "NTA. If I come outside to find some rando screaming at my wife and baby in my front yard, he’s gonna wish he had a bigger dog.", "NTA", "NTA. I used to have a smallish dog that didn't behave well (100% my fault) and usually barked at bigger male dogs which sometimes caused trouble. so whenever I saw a dog on my side of the street that was bigger than him or off the leash I crossed on the other side of the road. \nI only yelled at a lady once when I crossed the street (which obviously means that I'm not wanting to have any interaction) and her two off leash dalmatians came running towards me across the street. she then lectured me that this was my fault because avoiding other dogs does not solve the base problem blablabla", "NTA but the part that’s confusing me is that you’re even asking the question.\n\nSomeone with an unleashed dog was on your property yelling at you… I mean… ??? Do you really need internet validation to reassure you that you’re NTA here?\n \nI don’t mean to be rude.. it just makes me sad that this situation wasn’t clear cut enough for you to feel confident that this guy was being unreasonable.", "NTA those people are are delusional, they have the normal etiquette reversed.", "Our dog, a terrier like in your story, is reactive against certain breeds (yes, we have a racist dog). So when we spot one of them approaching, we cross. \n\n\nNTA", "\"Common courtesy\"? \n\nTranslation: \"Anyone who doesn't do what **I** want is by definition discourteous.\n\nNTA", "Nah. Fuck him.\n\nIf he doesn’t want his dog near your dog, the onus is on him to cross the road.", "If he being outside your house isn’t his problem then his inability to cross the street himself certainly isn’t yours.\n\nNTA!", "NTA. That's not a thing. I've got a small dog and I'm perfectly capable of crossing the street myself when I feel uncomfortable. Never really needed to though, unless I know the other dog is aggressive. But I also keep my dog on a leash and she behaves herself. These sound like shitty dog owners.", "NTA You were walking dogs, not sailing the high seas. There are no rules about who goes first or who crosses the road or any such nonsense when you're walking a dog. If a person wishes to avoid another dog, then they are the ones who cross the road. This person with the smaller dog was very not normal, to say the least.", "NTA and wtf was wrong with those people?? The closest thing to that rule I could think of, is knowing if you have a reactive dog, you keep them out of harms way. Meaning, it's the owner's responsibility to cross when you have a reactive dog. For them to demand that, while simultaneously having an unleashed and untrained (possibly reactive) dog is beyond insane. So sorry you got embroiled in all the drama. Sounds very stressful.", "Soooo Not the AH. They are", "NTA. I’m sorry this happened to you. It’s honestly the reason I don’t walk with my baby and our dogs without my husband. \nI’ve got two large dogs and I’ve never heard of this ‘rule’. Seems to me this guy has a badly behaved little dog but if there were to be an altercation with a large dog, he’d say the big dog started it when in reality it was the other way around, and I bet there have been altercations. Also, not having his dog on a lead makes this worse. Small dog owners who refuse to train their animals and who behave like their animals can do no wrong because they’re small make me so angry.", "So granted I’m not up on every dog related courtesy but I haven’t heard of the larger dog crossing thing.   It would make sense to me that whoever was going to be on the street side would be the one to cross.  Even with that, you made it plain to the guy that your house was right there and he continued to be a jerk about it.  NTA.", "NTA \n\nWhomever has the problem with crossing next to someone on the same side needs to be the person who crosses the street. Such a weird man, I'm glad your safe and if you deal with him again take a photo or video so you can show the police.", "You have the bigger dog so, you have to cross?? Wtf!! I've never heard such nonsense! \nThey were the ones who clearly had a problem so, they can cross. \nYou have no manners? Coming from a man who was yelling at a lady while her baby was present. \nThe guy sounds like an entitled asshole, if you ever come across him again start recording him & please do not cross the road, infact i'd start screaming cross, cross, cross at him see how he likes it! \nHe had the smaller dog, you had a stroller & big dog, it would have been easier for him to cross & not to mention he was literally standing outside your home. \nWhat an absolute bellend! You're definitely not the asshole!", "What entitled ah they are!!\n\nDefinitely nta.", "If leash laws apply he was way in the wrong!", "This guy is one of those people that goes through life looking for confrontation. If he wants his dog on the other side of the street from you he can take his lazy ass over there. It's not incumbent upon anyone else to make him happy. NTA", "NTA and f*ck that entitled guy and his unleashed dog", "NTA. What common courtesy is this? All I got from this is that this couple was acting incredibly entitled and unreasonable. They also sound like the worst kind of pet owners.", "NTA. He was a nut case. If he wanted someone to cross the street, he should have done it. Otherwise just pass each other like normal people on a sidewalk.\n\nAlso having an off-leash dog was totally irresponsible of him. He was putting you in danger, not the opposite.", "Uh, what a rude person? I think if your dog has an issue with other dogs then it's your responsibility to move out of the way. \n\nParticularly egregious since you also had a stroller and were only moments away from going on to your own property. \n\nNTA at all, that guy needs to get a clue.", "NTA OP.  This guy sounds super entitled, and it sounds like he just likes to bully people who don’t do what he wants them to do.", "NTA  You have a baby carriage --  Absolutely trumps any of his garbage.", "NTA", "That man's terrier should have crossed him if he was so scared and worried about your dog he should of just crossed he didn't need to yell and scream You know your dog unfortunately others don't so he should of crossed being unsure and worried I would walk around the opposite way as he would be on his route again take your phone and record anything he says to you Tell him straight out that his abusive behaviour was unacceptable the other night and by law you don't have to cross people with smaller animals children or aged people can cross the road to a more comfortable place if they are worried Yelling giving force and having aggressive behaviour is unacceptable  The pathway is shared not controlled  You didn't need to cross you were home and wanted to get your child inside Rude people are so horrible", "NTA. I actually would have called the police on him because their dog was unleashed, he was blocking entry to your home, he was being aggressive, he was behaving in a threatening matter. He was acting completely unhinged. Anyone knows if your dog is the issue, it’s you that crosses to avoid the confrontation and asking a woman with a pram to cross? Even if your house wasn’t there what in the actual fuck? 🤣 I would get a camera for outside if you don’t already have one as this man is nuts and now knows where you live which isn’t great", "NTA I think the rule is actually “The owner of the most hyper dog needs to cross the street.”", "I have only been snapped at by smaller dogs in my life and it looks like this guy matches his untrained toy dog breed's temperament NTA", "NTA. It wasn’t about common courtesy; you were in front of your house, and it was just common sense.", "NTA. Never heard of this rule. As long as you keep your dog under control, you’re fine.", "NTA. Never ever heard of this so called rule if cross the road when you have a big dog. His dog was small enough to pick up and walk on by. He is a complete dick", "NTA. He was demanding that a mother with a baby cross a road! Fuck that person. If he was so worried, he could have changed his path of travel. But instead, was unreasonable and making demands of a stranger while being aggressive.", "NTA  I’ve never heard that “rule” before.  I’ve also never experienced someone yelling “cross!” at me while walking my dog.  If his dog has the problem, then he needs to deal with it.", "NTA, they are clearly insane and need help. If my dog is the aggressive one, I would cross to not the other way round", "NTA - it's the responsibility of the folk with small yappy dogs to cross the road, if they have issues keeping said dog under control. I have a bigger dog who is super chill and calm, and it irritates me to no end when people with these small yappy dogs give me the look as I come towards them. My dog isn't interested in your dog mate.\n\nThankfully there are just as many people with small yappy dogs who have the self awareness to know that their dog is the problem. Kudos to them.", "NTA this is insane. You’re responsible for your dog when you’re out. Unless you’re dog is reactive, you have no obligation to cross the road if you see other dogs. It’s part of socialisation process that dogs learn how to behave around other dogs. Also it wasn’t just you and the dog, but you had a stroller which would make it awkward. \n\nAs a dog owner I look at the body language of other dogs and their owners to judge what I need to do and I expect others to do the same. Those people applied their own silly rules to you and got upset that you didn’t follow their insanity.", "NTA - who invented this crazy ass rule and surely a baby and dog will take priority over a small ass dog they could pick up and carry around you.\n\nSome people. \n\nI am so sorry you had to deal with that person - that person sucks and I hope some of their dog’s poop finds its way into their mouth.", "If their dog needs space, they are the ones that need to cross the street to give their dog the space it needs.     The baby in the stroller and your destination aren’t relevant, it’s whoever’s dog isn’t good with other dogs so if your dog was the one that was bad with other dogs you should be the one to cross and give way even with the stroller, but it sounds like your dog would have been just fine on the same side as another dog so NTA - they can cross if their dog needs space and yours doesn’t.", "Why are you even asking AITA, only AH here is the ignorant aggressive guy with the little dog. I've owned dogs all my life and  ever heard of that rule, you were verbally abused and your husband was too, that guy needs muzzling and anger management classes, also needs a big dose of cop on .", "NTA this guy is a moron! You had a baby in a stroller, and a calm dog, even if your home was 8 miles away, the onus is on him to move 1. He has just a small dog to wrangle across the road. 2. He’s the one with the problem. 3. You are a single adult with 2 vulnerable ‘creatures’ to take care of, he was part of an adult couple with one. \n\nThis is a made up rule he’s trying to implement. I have a Samoyed and German Spitz, do I stay or go?! Stupid man.", "NTA - that couple are a bit unhinged if they think they can just bark at people to cross and they’ll obey. If they have a problem they can bloody well cross themselves.", "NTA\n\nNever heard of the rule.\n\nThrow in that you had a baby and it would have been \"common courtesy\" for THEM to cross over if it was such an issue.\n\nOh, and their dog wasn't leashed? F.king idiots. It just asks for trouble. Even the sweetest dog might lash out when scared so always safest to be leashed. Before you throw in potential for them to run into the road.", "NTA there is no rule made up or otherwise that would say you should move further away from your destination to accommodate someone who has no control over their dog!", "Lol wtf? NTA. I've got a smaller dog with attitude issues. If I think it's necessary for someone to cross the street then I'm the one who crosses the street.", "NTA if its your son who has the prob, you should cross. Also why yell at people to do it when you can just  Ross yourself with no trouble. Thier dog is probably anxious because they live with someone who is aggressive and loud. What an idiot this guy is. He is exacerbating his dogs problems.", "NTA. Entitled morons there...", "NTA- That's just not a thing. Many is the time my path has been blocked by noble dogdogs on leads veering out of their lanes to say hi to each other, followed by apologies from the owners which I laugh off while I giggle at their chihuahua fronting up to a bemused Alsatian like he could take him in a square go but on this occasion he's got other stuff to do...  I've seen people with reactive dogs of any size step off the path and do a 'sit, stay' drill and get them on a short lead so they don't jump out at the old lady with the ancient terrier on a narrow canal path, but the person passing always looks super grateful so I'm guessing it's far from universal...", "He had a reactive dog and his behaviour was escalating his dogs behaviour.  He should have crossed the street and calmed his dog down.   He is an A H who has no business having a dog.  If you see him again take a photo and report him for having a dog out of control and for antisocial behaviour.\n\nYou did absolutely nothing wrong.", "Nta. Lmaoooo this guy is delusional. The person with the difficult dog should be taking precautions!", "the man with the unleashed dog is the AH for not crossing with his dog and not having it leashed\n\nNTA\n\nprobably his rule as you were not aware of it", "Mom with baby trumps everything. There is no “cross” rule, he made that up. What an idiot!  You, NTA.", "So he yelled at you that he didn't care, it wasn't his problem. Well, his issue wasn't your problem either. NTA", "Nta. \n\nJust reading this pisses me off so much. Who the f barks orders to people. Strangers or neighbors. They obviously had the problem. They obviously should have crossed. That's insane to me.", "That's a new \"rule\" to me.", "> is a lab mix of some kind\n\nPost a pic of your totally not a pit bull then. This guy was obviously a crackpot but you better have a full grip on that leash when you take it out.", "NTA.  But am confused.  What if someone with a dog larger thsn yours had been walking on the other side of the street?  Do all dogs yield the right of way to the smallest dog?", "NTA. Not your dog, not your problem. If you have control over the animal with you and know they are not an issue, why should you divert?\n\nIn answer to everyone else saying about small dogs being difficult, my grandparents used to have rottweilers while I was a child. Under 11 years old. Including 2 rescues. I used to climb all over them, hang off their necks, ride them like horses. Only injury I ever got was when I fell on the coffee table. Even the abused \"aggressive\" rescues they had, never hurt me. My uncles Jack Russel however, was a prick. Bit me loads. If the Jack was there, the Rotties used to act as my bodyguards. Literally flung the little buggar away from me at one point.", "NTA. If he has such an issue he could have picked up his smaller dog OR just crossed the street when you explained to him that your home was literally right there.", "NTA he sounds deranged", "NTA the person with the problem is the one who should be crossing the street.", "NTA\n\nNo such thing as being forced to cross the street due to having a larger dog.\n\nHey buddy. Mine is 74 pounds, yours? 72? Ok I'll cross...\n\nNow, there is a common courtesy to keep your dog on a leash.\n\nOh, and there is common courtesy to not scream at people...at all or repeatedly. \n\nKudos to...\nYour husband for nit knocking that clown out.\nYour neighbor for escorting you home \n\nAnd most importantly,  your dog for ignoring the screamer, and his ankle biter.", "NTA, lucky it didnt happen to my SO. Would have never walked past my house again and had a lesson in mannors... \n\nGet on with your day.\n\nBest wishes.", "NTA man was clearly unhinged. If he wants to avoid you and your dog he is free to do so. A clear ‘F-OFF’ was in order", "NTA", "NTA - if I want to avoid another dog when I am with my dog, I cross the road.  I also keep my dog on a leash, unless it is an off leash park.", "NTA thats bull$hit. They are just entitled jerks. If anyone *had* to cross the road it should have been them since the two of them and their *one* dog could do so much easier than you with both a dog and pram. And once they figured out they were in front of your house they damn well should have backed the hell up and let you go home.", "NTA. This guy definitely is though.", "NTA they were uncomfortable, they could cross if they wanted to. What gives them the right to stay on the side of the street they're on if they are the ones with the problem? Plus their dog was unleashed", "NTA, this isn't a rule, plus wouldn't it be easier for them to cross with a small dog and no push chair?", "NTA. There’s no accounting for idiots.", "NTA\n\nThere should be a dog police and things like that couple and their off leash beast should be destroyed.   The world needs fewer dogs and especially fewer dogowners.", "NTA. Idk if the police would come out for something like that, but this jerk is in the wrong so many ways.", "NTA. He is a very entitled asshole, though. Anyone who has a concern about another dog should make the effort to avoid, not the person with the bigger dog. We aren’t boats or ships, for goodness sake.", "NTA. first of all, all dogs need to be leashed in public places. It’s common courtesy and safer for everyone. I’m a pet sitter/dog walker and it’s unnerving for me to be walking my clients’ dogs when  someone approaches with their unleashed dog. Then they usually say something ridiculous like “it’s okay, my dog is friendly ! “.  But that’s another conversation. The couple with the small, unleashed dog were out of line. If they were concerned about the safety of their dog, and it was small, they could have simply picked it up. How hard is that? I’m glad you had assistance from your husband and neighbors. Yikes, what’s with people thinking they are so entitled?", "NTAH \n\nWhere I'm from the rule is if your dog is reactive  then you cross the stress to avoid other people or animals because your choice to keep a relative animal is your responsibility to make adjustments not others because they don't know your animal. This guy was strait up blocking you from your house & being an AH. The main thing I see as a red flag was what if this was someone who was blind with a guide dog? The dog would have been bigger but it would have more dangerous foot then to cross & they know thier dog won't react. It's on the person with the reactive dog to cross the stress not anyone else", "NTA. wtf. There is no ‘common courtesy’ to cross if you have a bigger dog. Theres no rule about crossing at all for any sized dog. \n\nIf anything, the person with the reactive dog should cross, as they don’t want to subject their dog to a scenario that clearly upsets them… \n\nYou obviously did nothing wrong, and this man clearly has issues. I hope you don’t have the misfortune of running into him again.", "That man should really teach both his dog and himself some manners. You are clearly not the ass here.", "Of course NTA.\n\nHe’s nuts. The common courtesy here would have been for him to step aside so the walker with the stroller/baby could proceed uninterrupted. That’s what would have happened in my neighborhood.", "NTA \n\ntheir dog either has known anger issues is is highly reactive and they dont either train it properly OR bother with a leash. \n\nif your dog is the issue you leash it and control it.", "NTA - I have 2 dogs, my corgi is a bit of an ass on the leash. So I cross the street to go around people, but I never expect people to cross if they have another dog. I might try to wave them on/around while pulling him closer, or picking him up if I have to… and have gotten frustrated with other people when I have him in my arms and my other dog on a short leash and they let theirs come towards us.", "That's ridiculous. What a sense of entitlement. No law stating you must move.", "This is crazy. Try to put this out of your mind as this shit it truly weird. NTA", "NTA: All dogs should be leashed so the small dog’s owners were wrong no matter what.\nCommon courtesy is:1) People with dogs go to the street or cross if the other people don’t have a dog 2) Either cross when both have dogs 3) People without a baby stroller cross 4) All dogs are leashed and their humans muzzled if aggressive", "NTA and that's an awesome rule they magically made up since they know their dog is probably going to attack others and they are too lazy to do anything about it.", "NTA and this isn't a common courtesy rule. If someone doesn't want their dog to interact with another dog for whatever reason it's their responsibility to change direction, not yours.", "NTA. I've never heard of this rule either. It isn't a thing where I live. My family has owned dogs large and small, and when we owned a small dog, we never yelled \"CROSS\" at anyone. When we owned a big dog, no one ever yelled \"CROSS\" at us.  I could see if a dog was aggressive or acting strangely in the moment, then yes, an owner would have a responsibility to get their dog away from others while walking, but otherwise, no. These people were just being terrible and harassing you.\n\n\nBtw, OP, many cities have leash laws. You should remind people being dicks of the laws, if your city has one, especially if a reactionary dog belonging to an asshole couple is off-leash. They could get a nice ticket or two, one for having an off-leash dog, and perhaps another for trespassing or being a public nuisance. Look into your local laws. Know them, and wield them as you may.", "NTA people who walk their dogs unleashed because “my dog behaves” are ridiculous. It causes so many problems for other people. Other dogs, even good ones, can have a problem with unleashed dogs. Some people are afraid of dogs and have no idea that your dog is good or bad and this can be a huge problem for them. Leash your dog and cross the street if you have a problem. Do not make up fake rules to suit your needs.", "I used to housesit for a reactive dog, only with other dogs, loved people.\n\nIt was my job to control the environment of the reactive dog. It was not my job to yell at other people with dogs to cross the street away from her.\n\nNo, I would cross. Or direct \"my\" dog away from other dogs if we couldn't get far away. Or to kindly tell people with dogs who approached wanting to be friends \"I'm so sorry, but she hates other dogs and will bite. Please don't come too close\" (as I would get my dog on the other side of me and make as much room as possible).\n\nThat guy is a jerk. He doesn't just get to make demands and move people around the street like he is the king of everything.\n\nIf he's worried about his dog, it's his job to move his dog away from any perceived threat, not everyone else's job to clear the vicinity.", "NTA…. If that guy was so worried about it he could have crossed the street his damn self or picked up his little yapper dog. He was unhinged. I’ve owned big, well trained dogs for years and have never ever had something like this happen. It’s not a thing. If you see that person again with his dog and he makes a scene call the police and tell them you’re scared and feel threatened.", "NTA, there's no 'rule' that if you have the bigger dog you have to cross when approaching a smaller one, and even if so, you have a baby in a stroller and your destination is a few doors down on that side of the street. If he was so scared of your dog being aggressive he should've crossed himself and if anything, the person with the hyperactive dog that is not on a leash should be the one moving. He also spoke of common courtesy as if he didn't, scream at both you and your husband, cause your baby to cry, disturb your neighbours and cause an argument over nothing. You are NTA.", "NTA. Never heard of such nonsense.", "NTA at all!   I have a five lb dog and walk her all the time.  No one crosses the street just because of the size of the dog.  If your dog is super aggressive with other dogs, it would be your responsibility to cross, but he’s not. When someone is coming towards us with a big dog and a stroller, I’m usually the one to move into the street for a minute just so we don’t all have to squeeze past each other.  In your situation, if someone is so afraid of your dog that they don’t want to be near him, then it’s THEIR responsibility to cross.  This dude was an entitled mess and you did nothing wrong.", "NTA\n\nThere are ah's in every group, there are lots of horrible dog owners, I was in home depot last weekend and there was a man and his intact male boxer who was pissing all over the store.  The guy didn't care in the least, didn't clean up, just went about his business.\n\nYour husband should have told them if he didn't stop harassing you he was going to call the cops for breaking the lease law.", "NTA\n\nI have a small dog who due to an attack squares up with bigger dogs. Atp I just scoop him up in my arms cause he rarely barks or growls when he’s in my arms and then I put him down when he’s lost interest. Sometimes I get annoyed when people deliberately walk the same way with their dogs when they can see it disrupts my walk, but they have as much a right to be there as me, so I just scoop him up or go somewhere else.", "NTA never Heard of that! \nI do Cross the street when someone comes my way but because my Dog can get reactive when he's in pain (and Sometimes He is despite being on pain Meds) and I want to spare my Dog extra Aggregation, the other people a scare and myself the Stress \n\nIsn't it more stressfull to yell x Times instead of Just crossing the street themselves (or trace their steps a Bit Back for you to get into your Yard)?", "I am unfamiliar with that courtesy ? He should have crossed if he was worried .", "They broke the law by having their dog unleashed. It up to THEM To cross the street if their dog is aggressive with other dogs.", "NTA. Normally the person with the problematic dog (and without a stroller) should cross the street. It's not your business that their dog has issues.", "Nta you had your dog leashed and under control the man was trying to bully you to cross the street.", "If your dog isn't leashed on city streets you're automatically TA. But to expect a person with a stroller and a bigger dog to cross makes them even a bigger asshole. Then to do so in front of the other person's house they just need to sod off.", "NTA, there is no such rule for walking a dog and that guy is totally unhinged blocking you access to your house", "NTA, fuck that guy.", "NTA, but a nice idea to have some fun. We have a pretty large dog too and yes I also notice too many people starting to panic when we approach. What I sometimes do when I spot them from a distance is shout at them to keep their dog close, since our dog is VERY AFRAID of small dogs. \n\nReverse psychology that does it every time. They look at you with a face like \"WTF is happening\" and instantly forget what to do, or what to be afraid of.", "Well, tht is not really commom courtesy, plus you have a stroller. They should have crossed over for that alone. Not sure how yelling at a stranger to cross the street is courtous either.\n\nNTA", "I have a small dog that can be reactive to other dogs, particularly larger ones.\n\nIt's my job to cross the street if I think there's going to be an issue", "Should’ve pulled out your cell phone and started filming him. Nothing calms irrational people down like the prospect of social media shaming. NTA.", "NTA", "NTA. I feel like those lacking in size are more aggressive because they feel inadequate. They bark and act all tough because that's all have. And their dogs act the same way.", "I don't even know where to start with all this, since every single points makes you NTA, but seriously, I'd be more worried about a terrier than a lab mix.  Terriers go after stuff.  Labs just want love and to play.", "NTA.\n\nOur first dog suffered from pain and anxiety, so I took him to cross the street often enough. I have never felt entitled to \"my side of the street\" due to the other dog being bigger and my dog being scared.\n\nMy dog not knowing dog language and my dog being scared are my problem, therefore it would be on me to make sure the dogs don't meet.", "NTA. I've never heard of this. And frankly, after hearing that he was standing in front of your house with his *unleashed* dog, he should've taken the L and crossed himself if it was that big a deal to him. \n\nI will say that the sweetness of your dog doesn't matter. Only because no one else knows. No one else knows if he's a sweet lap baby or hellhound in disguise. What matters here is that your dog was leashed, under control, well-behaved, and calm. Well done with the dog.", "NTA.\n\nI'm usually the one with the bigger dog and generally if people want to keep their dog away from mine, they're the ones that change their route.\n\nAnd they were literally blocking you from getting to your house when you were out with an infant?! Dog politics and made up etiquette aside, those people are definitely the assholes!!", "NTA. Little dog owners often suck. Unleashed dog, untrained. Ugh. If their dog is reactive they should cross. My rottie will bark and jump when he sees another dog to play. It’s my job to cross the street to avoid any situation. The exception would be if someone turns the corner and you’re already walking there.", "I would love to see a picture of this aggressive older gentleman so he can properly identified and warn others of his ridiculous aggressive behavior", "NTA but that bloke is they should have crossed the road.", "Holy shit NTA. Not only is crossing the road with an infant a ridiculous ask, especially when you're near your house, but the verbal abuse and threatening behaviour makes you nowhere near an A. The only A here is the man who was screaming at you and his partner. Next time call the police", "NTA my dog is reactive and if you have concerns about your own dog it's your responsibility to cross, the guy was an entitled idiot. If your out with your non reactive dog it's not your responsibility to make way and the guy clearly doesn't realise what a creep he is for barring a woman with a baby walking her dog from entering her own house.", "My dog is aggressive towards other dogs when he’s around my wife, so we’ll yell “not friendly” so others can choose to cross the street if they want but we’ve never told anyone to cross… Unpopular opinion: I will kick the fuck out of your unleashed dog so I don’t have to end up putting mine down because of your irresponsibility. NTA", "Like that rule of the road that all those truckers follow you know when they pull out of the way for the person on the bicycle /s NTA", "they need to socialise their dog if it can’t cross paths with another dog. If your dog was aggressive, it would be reasonable to cross the street. This was not the case here. If they have an issue with their dog coming across others then they should cross the street, not you\n\nedit. NTA", "Wait! What? Small dog right of way!\n\nLMFAO! I have never heard of anything so absurd.\n\nOnce upon a time, my then wife, who was about 130 lbs., was walking the 110 lb. akita of a friend wo had just had back surgery when she spied a yorkie, who was off leash, and its owner,who was talking on a cell phone. So my wife stopped. When the yorkie owner saw this, he called out, \"Don't worry, my dog won't do anything. \" My wife then responded,\"Mister, I am not worried about what your dog is going to do.\" After a moments consideration, the yorkie owner scooped up his dog and went inside.\n\nThis is about the closest I have ever heard of small dog right of way.\n\nNTA.", "You are absolutely not the AH, if they are worried about your dog they should have crossed the street. Plus you have an infant baby trumps yappy shit dog", "I would definitely repeat this to the police in case it happens again.", "NTA he should've crossed.. get some cameras this man sound like a whack", "Deff NTA", "First of all, your explanations of sweetest dog and whatnot are completely irrelevant because that's not something the dude who's a complete stranger would know. That shouldn't factor in at all here. What is important though is this whole common courtesy thing he's talking about.\n\n\nIt's BS I've never heard of that the one with the bigger dog needs to move out of the way. NTA all the way", "NTA and common courtesy is having ALL dogs leashed when in public. Other guy is TA", "Imagine having a pitty and the scared person tells uou to cross the street. That guy is an entitled ass, you however are NOT. Im glad hubby came out to protect you and baby!", "NTA. And honestly the fact that you were right in front of your own house doesn't even matter.  That guy is a complete jackass.  \n\nIf you have a dog that you know lunges on a leash, then yeah, you probably put some distance between you and other dogs, small kids, whatever to be courteous.  But it's not a requirement. \n\n If they had issues walking past you and your dog, then it was their issue.  I wouldn't give them another thought.  If you come across them again then I'd make them aware of any leash laws you may have and tell them to bugger off.", "Only known a few that had aggressive or reactive dogs, and whenever any of us locals would encounter them, they were always the ones to pull off to the side or cross the road, and yeah they'd holler but it was to make sure we all knew to leash up if not done and not actively approach them to 'say hi': was never any expectation for us to do anything but continue straight on. And they were all tiny balls of hatred, giving way to large dumb lovebugs.\n\nIn an unknown situation, where neither side is declaring aggression, the onus is on whoever has their doubts to keep their dog safe. If I think someone coming opposite me has a dog that's a risk - to me, my kid, or my dog - and they're *not* moving away, it's my responsibility to extract myself and my party and set a distance that makes me comfortable, not scream at them to move somewhere arbitrary away from 'my' path.\n\nOnly exception I've encountered was a tiny woman struggling to hold a large mutt that was aggro and going nuts: it was taking everything she had, gripping leash and collar, to hold him where they were, no hope of her moving him. Clearly a mistake for her to take that dog out like that, but done is done, and she was pleading us to go around. Yeah, we gave a wide berth, cause choice was that or walk into them with the latter definitely going to cause injury to my party and I'm not punishing my dogs for her silly choice. But even in that scenario she was excessively apologetic and polite, accepting that she was the problem and she was asking us to go out of our way because of it. \n\nProbably says a lot that in OP's situation both dogs were apparently fine and the 'reactive' one was the adult male pitching a fit over not having his personal 'rule' accommodated.", "It would be trumped by any situation in which any of the two dogs is about to enter its home and will put a distinct barrier between them...", "You don’t ever YELL at someone else to cross, if you’re the person who doesn’t want their dogs around others then you cross. \nThe closest I’ve ever come to this was I was walking my dog and a lady had two smaller dogs on a leash and was on the phone but the street I was on literally didn’t have another side of the street and is busy but the sidewalk is quite large. We could easily pass each other without the dogs intersecting if that’s what she wanted, but she gave me all the body language of a friendly greeting is fine, smiling at me and saying hi, and at the last second she went into the street with her dogs and I overheard her say “the one with one dog should be going into the street” and I forget what other worse thing she said about me but bitch, please. I’m training my pup and one thing I’m not training her to do is go into the street.", "100%", "I have a very small dog and have never heard of the bigger-dog-must-cross-the-street rule. If I imposed that rule, I would often have to yell \"Cross! Cross!\" on our walks. As it happens, I still practice social distancing whenever I can and often cross the street myself or step into the street if people are coming my way on my side of the street. Hey, maybe I can expand the Cross-Cross rule and insist that if you see me coming and I put on my mask, you must cross the street or else I'll yell *\"Cross! Cross!\"* at you in a very \"cross\" voice, if you know what I mean.", "OP should have said \"I thought the rule was that the person who is a bigger asshole needed to cross the street - so im staying right here\".", "The rule in my experience is that the person with a dog who doesn't tolerate other dogs crosses first, regardless of size", "I have a 7 pound Yorkie and an 11 pound little rescue mutt. I’ve had my oldest for 15 years. Walking them I have to keep my head on the swivel. They are little. Sometimes I do pick them up, but I have never once expected somebody to move for me. Once in a while I have noticed someone w a bigger dog redirecting and I think that’s great, because they know their dog, but it’s not anything I would ever expect. In fact, sometimes I feel bad because I know I’ve hurt some feelings by avoiding certain dogs based solely on their overly large appearance.", "Agreed. I have a Chihuahua/ pitbull mix. And I've never expected anyone to cross the street for him. That's just ridiculous. And I can't imagine yelling at anyone either.", "Yea.  People like this tick me off.  I has neighbors once (so glad I don't have neighbors anymore).  Who would drive into their garage,  let their dogs out, and the dogs would run around the neighborhood.   Once I was out in my yard and one of them charged me.  I ended up being yelled ar because I didn't tell them what they did was ok.  Why couldn't they put the garage door down and then let the dogs out of the car?  BTW these were houses on .4 acre lots and all the back yards were fenced.  \n\nI am a dog person and the entitlement of some people amaze me.", "Right? I think I would have called police and not from a place of superiority but for safety.", "There is, of course, no such rule except in that man's head because he's a selfish <insert-insult-here>. If a person knows their dog is aggressive to other animals or people, they have the responsibility to keep everyone safe. They don't get to dictate how others act.\n\nI took in a reactive dog many years ago who was afraid of everything. I put a basket muzzle on her so there would be a very obvious sign to leave her alone and people still walked right up to her to pet. She never bit anyone but she did 'mouth' a few to make them stop touching her. When we were out for a walk, I always stepped aside or crossed the street first since it was my responsibility.\n\nThat man is a selfish <insert-different-insult-here>.", "I lived in China and in my building was a lady who didn’t like dogs. This was a teddy bear poodle I could scoop up with one hand.\n\nIf I was on the elevator and she hold get on she would yell at me ‘I’m afraid of dogs!!” Implying I should get off. B**** j was here first.", "At you and your child*", "What a psycho! I agree, you may actually want to call the police and just report the incident now if you think this is someone who lives near you, just to have the interaction on record. Especially since they seemed to have an out of control, unleashed dog.", "Very good advice. The context and location makes what they did so much worse.", "And even if you *had* crossed the street. There's nothing stopping thier dog from still going for yours and getting hit by a car", "Plain and simple is absolutely correct.\n\nThe OP is definitely NTA. The other guy absolutely is!\n\nI always cross the road when approaching anyone else with a dog. And if someone doesn't have a dog, I still move over onto the grass so my dogs and I don't inconvenience the other person.\n\nGosh that man is so rude. To a young woman pushing a stroller. With an infant. What happened to our society?", "Eh, I'd say its relevant in the sense that even if the other people had any kind of valid points (which they dont), them being in front of OPs house which was OPs destination overrules everything else.", "Hey now - the rest of us who are DINKWADs don’t want entitled assholes like this lumped in with us!  We don’t claim them!", "Or, if you have the issue, you are responsible for removing yourself from the situation you have the issue with.", "Actually the fact that the couple with the smaller dog were in front of OPs house is *extremely* relevant as even if the belligerent yap-rat's owners were right about anything else, them being in front of OP's house would still trump everything else regardless due it being thier destination.", "Funny considering it was a pit that saved me from a lab as a child and another out that saved me from a Chihuahua. It's a bias from skewed statistics due to asshole owners and people that don't control their kids around animals.", "I would bet money that more children are injured (fatally or otherwise) by other children, or at the playground, than by any dog breed.\n\nSo, by your logic, we should probably should shame people for having more than one child and for taking them to playgrounds, too.", "Yes I have a lab and a retriever who are sweet as anything, always happy to meet other dogs, I have a french bulldog - she's an ashole! Had a westie when I was young, he was an ashole, with most other dogs, too.\n\nThe rule is definitely the person with the problematic dog crosses the road. Even if it weren't, baby in a push chair trumps dog every time!", "Ever thought the statistics are skewed because of the stereotypes? Ie more people think these breeds are vicious and therefore get them for that reason and because most people are irresponsible or shitty trainers the issues occur. There is no genetic reason for Pitties to be more aggressive, they are just as domesticated as any other breed so there has to be some other reason for the behavioural issues.", "I would bet money that more children are injured (fatally or otherwise) by other children, or at the playground, than by any dog breed.\n\nSo, by your logic, we should probably should shame people for having more than one child and for taking them to playgrounds, too.", "And if there is any possibility of an issue, have your dog on a fu*king leash.", "And in my area there is a leash law so I would for sure tack that on. They don’t play around with that here.", "Argue with the science, not me, lady", "This. Whilst I currently do not have a dog. I have walked many Friends dogs. And, If I'm unsure I avoid other people's dogs. But, if a Dog, is Off leash, How are you supposed to Avoid it??. I've literally had to scoop up King Charles Cavs. Because the Off Leash Dog, got Agressive.", "I hope your dog has a good time without being bothered without her comfort.\n\nThis is the main reason why I had to drill my dog full-force as she proceeds towards therapy dog certification -- she's friendly and can't understand that other dogs might not be. From the time we'd adopted her, she'd listen in any situation besides when she thought she could make friends. I've finally gotten her to the point where she'll ask to see upcoming dogs by laying down until released... but now she's automatically laying down every block or so in anticipation of getting the opportunity to play with everyone and everything she sees."]}