{"id": 32290, "submission_id": "18a4a6q", "title": "AITA for yelling at my mom over her not wanting to throw me a baby shower?", "selftext": "So I’m  30F almost 30 weeks pregnant and my mom has not brought up a baby shower for me. I grew up going to all sorts of baby showers for multiple cousins and family members specifically with my mom. My mom even hosted a wedding and baby shower for my sister-in-law. So naturally I figured she’d offer to throw me a baby shower for my first baby. \n\nI think it’s odd that she hasn’t even brought it up or mentioned it, with me being this far along. I know they aren’t until a month before birth, but to not even have a discussion? Everyone at work has been asking me if I’m having one and I feel embarrassed for not having any plans. I texted my dad and asked if my mom has even brought it up while at home.\n\nShe texted me on his behalf and said her and my aunt had been planning to do one. I got a call from her today and she decided she wanted to be honest with me and tell me how she really felt. She offered to give me as much money as it would take to have a baby shower if we could just skip it, because she hates baby showers. I knew this is how she felt the whole time but was just hoping she’d want to make me feel a celebrated with my first child. It’s not even about the gifts or anything. I never see my family, ever, now that I’m older. I didn’t have other typical celebrations families usually have because my mom has always talked me out of them. This time I just want to be normal and make this time in my life special. \n\nI yelled at her and told her that she’s ruined a lot of life experiences for me and has caused me to be an outcast with her ways of keeping me distant from the world and lack of celebrating anything in life. I asked her if this is how she treated my sister-in-law. She said that she just felt comfortable enough to share that with me about how she truly felt, and that she was hoping I’d feel the same way. She tried to backtrack and say she’ll throw me one but I told her she already tainted the entire experience. \n\nWas I too harsh in my response?", "created_utc": 1701639932, "permalink": "/r/AmItheAsshole/comments/18a4a6q/aita_for_yelling_at_my_mom_over_her_not_wanting/", "score": 1012, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I might be because of the harsh response I gave to my mom.\n\n2. I could be more understanding of my moms social anxiety.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA, mostly because you are being one to yourself.\n\nOP, the harsh, heartbreaking reality is this: your mom is never going to be the mom you want and need her to be. That mom does not exist.\n\nYou may need to mourn that loss. It seems strange to say but sometimes it is immensely healing to treat this almost like a death - you’ve lost the mother you’ve always wanted. You need to say goodbye to her.\n\nYou then need to decide what’s best for you: Can you have a relationship with your mother exactly as she is now? Do you want to? What would that look like? What boundaries would that mean to protect yourself?\n\nYou can’t expect your mother to change. You can only change how much power you allow her to have to keep disappointing and hurting you.\n\nAs someone who went through a similar journey I promise there is a way to peace. Only you can decide if that path involves your mother.", "YTA\n\nHave someone else throw the shower and leave your mom out of it. She's not responsible for making your adult dreams come true - you are.", "YTA\n\nYou admit you know how she feels about these events, she has a history of talking you out of milestone celebrations, and you had to go through your father to even get an answer. I’m not sure what you expected here outside of being upset.", "NTA. You’re really late now, but maybe you could schedule yourself a see and sip? You just get some wine (for the guests) and let them come see baby? And celebrate you two. You can even do it co-ed.\n\nDon’t invite your mum tho", "I’m with your mom. Hate these showers! Take the money and buy what you need. If a friend or co-worker or family member of the father want to throw a shower, what’s stopping them? Being the center of attention while people sit and watch you open gifts may be for some, but not everyone.", "NTA \n\nYou asked if she was throwing one she said yes she is planning one with your aunt and it was all a lie yet people are saying YTA!? \n\nShe throws one for your sister in law but not you because you should understand or feel the same way as her and people think YTA because it’s fair that she assumes you feel the same way as her!? \n\nYou are justified in feeling slighted and you are justified in telling her so. She should have just been honest from the beginning so that if someone else in your life wanted to throw for you they could.", "Yta she offered you money for things and you could throw your own little party if you wanted", "YTA. \n\nThe words selfish and entitled come to mind. \n\nSeeing as you knew how your mums felt about them all along, she probably thought you’d understand. Plan your own if it’s that much of a big deal to you.", "NTA - I’ve been in a similar situation and I know how disappointing it feels when you’re excited for having your baby and wanting share that with people who are important to you. It can also be a nerve wracking time and sometimes you’d like to feel supported. A baby shower is a great way to show a new mom they are and that they have people who they can rely on. \n\nClearly, your mom is not interested in throwing you this shower but I have heard it isn’t polite to ask your parents to throw you one. Think of how much effort and resources your mom has poured into raising you, even if you feel she has failed in some ways, she’s probably given you a lot that you could be grateful for. \n\nI think you should just decide to throw your own party and take some of the stress of figuring out who will throw it off your plate. But, I maybe you could ask your mom and another family member or two to help you plan for the party (diy decorations, help send out invites, make arrangements for food/drinks etc) that way no one is solely responsible for throwing the whole thing! It could be a nice way for you to bond with your mom and bring you two together. It would also be a way for her to show she wants to support you without having so much on her plate. If she doesn’t want to be a part of it at all then maybe you need to reevaluate your relationship and what you can reasonably expect from her in the future. It was around the same time in my pregnancy two people offered out of the blue to throw me two different baby showers so who knows!\n\nSo sorry how brutal everyone is being in the comments here. Hope you the best with the rest of your pregnancy and that you can feel supported in this last stretch of pregnancy!", "YTA. Obviously it’s easy to blame your mother for everything wrong in your life. Truth be known it’s NOT your mother that would throw you a shower. It would be a sister, maybe a sister in law but most generally they are thrown by your friends. I think it’s horrible how you treated your mother. You are quite entitled that is clear. Anything else you want to blame your mother for. Like inflation or gas prices. I’m sure you will just keep rolling it over on her", "YTA, and if you are this emotionally fragile, why are you having a kid?  Get therapy before your kid is born.", "NTA. I don’t know why some people are being downright cruel to you in the comments. It’s common where I am for parents to throw baby showers, I know many people who have had showers for their first child and they were all thrown by family. I’m sure it doesn’t feel good when coworkers ask about the shower- again, they probably expect you to have one become it’s common. What are you supposed to do, ask a non-family member to throw a party for you? I don’t like parties either, but to not give a family member a shower because I don’t like parties knowing it will hurt them is something I’d never do.", "YTA Baby showers are not supposed to be thrown by family members even though a lot of people do it that way - it is considered rude. AND no matter what, no one owes you a party. Ask a friend to host it for you.", "That kid is doomed with a selfish, entitled parent such as yourself. YTA.", "YTA. You’re a full grown adult. Mommy offered to pay for it anyway. Figure it out yourself.", "NAH She does not want to. Take the money and throw your own shower. Or give the money to a friend who likes to party plan and let then do it.", "I’m going to go out on a limb here and say this isn’t really about a baby shower but more about a pattern of behavior that OP’a mother has had towards her.  That is all based on OP’s comments. \n\nIf I was going strictly by the post I would definitely vote AH. However, it seems like your mom has a tradition of treating you like an outcast.  \n\nESH.  Your mom sucks for being horrible and you do because you are mistreating yourself by still hoping she will pull through.  Also, for arguing with the judgements of others when you came to a judgement sub.  These people only have limited information to go on and it was provided by you.", "NTA \n\nIt seems this is the straw that broke you, there seems a hugh amount of back story where you have been hurt by her actions. I think maybe you wanted her to be the mother you needed but she is not. \n\nThe fact she organized a shower for your SIL but not for you tells you everything. She can have her truth but the fact she was so against throwing you a shower and took this event to tell you, her truth and you should believe her. \n\nIm sorry you have been hurt again.", "Your mom sucks. Throw a party for yourself and anyone you want to invite. This about celebrating new life. Enjoy yourself and I wish you an easy birth", "I'm leaning towards ESH here. She should have been upfront from the start. Also, for throwing sil one. However, maybe she is tired and is finally at her wits end. I do not think you needed to yell. Apologize for the yelling.  You can express yourself without it. She did make you a generous offer to compensate.", "YTA. Your mom don’t owe you a baby shower. What’s wrong with people nowadays lol", "YTA. At 30 years of age, you should be long past the stage in your life of feeling entitled. Throwing you baby shower is something someone should willingly do out of the goodness of their own heart; not because you have the expectation that you deserve one.", "Esh. Sucks that she did it for others, but not for you. However, I get the feeling that she felt as if she could be honest with about how she actually feels about baby shower. I also do not like baby showers I find them annoying and tacky. \n\nWith that being said you are also acting like an AH by blowing up at her. Nobody owes you a party. Also if you are still suffering from abandonment issues then I think it might be best to look into therapy because screaming at others the way you did makes you a huge AH. Wish you and your baby the best.", ",YTA. she was honest with you and you decided to lash out", "[deleted]", "NTA - can’t understand why she didn’t do one for you but has done it for your sister in law?", "NTA. I’m sorry to your mom but throwing money at you in lieu of just celebrating your first child feels icky. Especially if she threw one for your sister in law ???", "My biggest point of sympathy with OP is regretting the decision not to celebrate life in general.  I wholeheartedly agree that celebrations are too important to skip.  Now you have an exciting opportunity to create a new precedent with your own child.\n\nIf you don't have family support, learn how to stage your own parties in a low-key but satisfying way that doesn't lead to stress, burnout, and more resentment.  Staging your own shower with the expectation of receiving gifts is gauche, but nothing at all wrong with just a party for friends.\n\nMaybe your mother could get on board with contributing a little something if she doesn't feel overwhelmed with total responsibility?  On the other hand, maybe she will disappoint again, but that doesn't mean you have to sit at home joyless and alone.  Have a party and raise an extra toast, with or without her!", "YTA. You’re thirty years old! Why is it your mother’s job to maintain your relationships with your family for you? I’m sure there are other people in your life who can help you organise a shower if you want one that badly. Why does it have to be her job?", "YTA\n\nYou obviously have some big issues still unresolved in your life and you are a fully grown adult about to become a mother. Instead of yelling at your mother, accept her offer of a cash gift and use it for therapy. That will be more useful to you and to your child than any baby shower would have been.\n\nIf you don't believe me, let me convince you:\n - You have resentment over not having previous celebrations because your mother apparently talked you out of them. This resentment will not disappear on its own. It may however fade when you accept that the past is not changeable, when you investigate why you let your mother talk you out of things you wanted, when you feel strong enough to know that you can arrange your own celebrations in the future, when you forgive your mother for probably acting out of her own social anxiety\n- You don't actually need a baby shower to see your family. You can host a party yourself (not a shower) and invite them. They may not all come, of course, but you are an adult. You have agency in your social life.\n- If you still really want a shower, you could ask someone else to organise it, or even organise it yourself.\n- Your mother trusted you with honesty and vulnerability and you acted out like a toddler. This is not a sign of good emotional regulation. Therapy can help you understand and regulate your feelings.\n- If you had acted as a person with agency, by accepting what you already knew, deciding what you wanted and doing what was in your power to do (not forcing others) you could have had the celebration you wanted. Now you just feel bad and your mother feels bad. You didn't make the useful choice. Therapy can help by making your life materially better as a result of better decisions.", "YTA.  Wow.  The entitlement and the assumptions.  And why haven't you come right out and asked if she was, so you could make plans accordingly?    And you KNEW she hated baby showers the whole damn time?   You need to take a step back, a deep breath, and stop this.", "YTA here. Nobody, including your mother, is obliged to throw you a baby shower. Yelling at her about it was just cruel.", "YTA. Your mother is NOT obligated to throw a shower for you, no matter what she did for others.  You could have said thank you, taken the $, and asked a friend to do it. But you had to throw a fit.  Now, your mother is hurt, you are hurt, and this will effect your relationship going forward unless you apologize and make amends.", "NTA, especially if she threw one for your SIL. If as a new Mom, you’re excited to share your pregnancy and excitement over the new baby, it’s a crappy time for your Mom to be honest about her feelings that she can be bothered for everyone else, just not her own daughter.", "Ms Manners says parents and grandparents are not supposed to put on showers", "NTA\n\nTake the money your mom offered and throw yourself a beautiful catered shower. Don’t invite her", "No one offered to host me a shower & etiquette-wise I Believe its MIL that is \"supposed\" to. Either way I pretty much planned my own & Had my mom as \"host\" but I planned it, gopt food, games & had it art my house. It was my first child so I wanted to celebrate with my friends & family more than gifts or any of that.  etiquette or no not everyone wants to plan or pay for that. I get it. Why dont you?", "NTA for feeling this way,  if she threw tgem for everyone else and attended for everyone else then she shpuld fo the same if not more for you. \nbut since she isnt going to then take the $ and have a friend or co worker throw one for you and dont invite her since she doesnt like going", "Throw yourself one if you want one.  Nobody is obligated.  I can understand feeling left out because your sister in law had one thrown by her but nobody has to throw you one.", "NTA \n\nPlease hear me out before you downvote me.\n\nIf this would have been the 1st baby shower your mum would have done then fine I would say yta but she already did one for your sil so that makes her an ah. \n\nOrganise one yourself or get a friend to do it but make sure she isn’t invited. If she doesn’t like then she doesn’t need an invite to one.\n\nAlso stop relying on your mum.", "NTA.  Your mom just used you all those years and attended those events to put on a fake persona of a loving person but never made that same effort for her own child?  Sounds like your mom needs to feel some distance, for a while.  No information for a while either.  I am so sorry for you to discover this about yourself mother.  Best wishes!", "YTA definitely. You also DO NOT sounds 30. If you want a baby shower, act like an adult & communicate that with your mom. If she doesnt want to host one, find another person or do it yourself. You owe her an apology first", "NTA - there are obviously some communication issues here - her assuming you wouldn't want a shower either because she doesnt like them, you assuming she would throw one because its seemingly a family tradition and she did it for your SIL - but im still inclined towards NTA\n\nyou're the one having a baby, so if you want a shower you should have one, as long as you can afford it etc (and it doesnt cause a wildfire). i would expect a loving mother to go through with something like this regardless of her own personal feelings about it, because shes doing it for you and she loves you, presumably.\n\nmoney clearly isnt the issue, since she offered to compensate you for skipping it. her \"hoping you'd feel the same way\" doesn't excuse not even discussing it. sounds more like she was hoping to avoid the topic altogether until its too late. or maybe she figured you didnt want one since you never brought it up either - again, communication issues.\n\nbut i dont think saying she tainted it is unreasonable. a bit harsh maybe, but probably true. having her throw you a shower after being so opposed to it (to the point of wanting to pay you to skip it) *would* feel dirty and take away from the joyful occasion. \n\nhave someone else throw you the shower, if you still want one", "NTA. I understand how you feel because my own mother didn’t even throw a shower for me BUT had 3 showers for my sister. She claimed that I was too far but she could have talked with others to help throw one. \nAll mom had to do is throw a shower and not say anything and be happy for you, her daughter.\nWhat other parties or milestones have you had to forgo because mom decided to not do it for you?  Did you have a wedding shower? Sweet 16? Birthday parties?", "NTA if your mom was so against throwing showers I don’t understand why she’s thrown multiple. Making yours the one she’s putting her foot down for is weird. It makes sense that you assumed because she sucked it up before for other people that she’d be more than willing to do so again for her own daughter.", "YTA!\n\nHow are you about to have a baby, yet you still throw toddler tantrums because you didn't get what you wanted? Your mother probably knew that you'd be a mom-zilla if you had one, so she avoided it.", "YTA and a selfish one at that. Talk about EXTREMELY entitled. Grow up and throw one for yourself instead of assuming you're special. You knew she doesn't like baby showers and still sat here expecting her to throw you one?? Yeeeaaaaahhh... Uh... That's ridiculous asshole behavior", "I’m going to go against the grain: ESH, but more your mom.\n\n\nYou did not handle that well at all. Chalk it up to hormones, but you could’ve handled it better.\n\nBut your mother. The audacity to do it for everyone else but not her own daughter is disgusting", "NTA. No your mom doesn’t have to throw you a shower but 1) what you do for one kid, you do for another 2) if she didn’t want to, she should have vocalized it a lot sooner. It seems she has no problem showing up for everyone else in the family except her own daughter. OP for whatever reason your mom has repeatedly minimized your milestones. This isn’t your problem anymore. Just please break this cycle with your children. I’d be devastated if my mom behaved this way. You deserve more.", "I understand it’s sad not to have a babyshower, but the entire point is to help prepare the mom for raising a child with helpful items. You could’ve asked some friends or your SIL if you knew your mother was like this from the beginning. Did you think she’d change overnight? That’s on you. I’d take the money and set up a wonderful nursery. YTA for just assuming you’d get one.", "NTA, but i’mnuclear option always on the table petty. i would bot take her money. i would have someone else throw a party for me and i would not invite her. i would pet her known i understand her feelings on these events and advise her she never has to worry about it again. yeah what she did is a dick move she cares how other people view her but could care less about doing that for her own child. so i would let that be known.", "ESH", "Throw your own shower? YTA", "YTA. In my culture the mom doesn’t plan it, it’s the extended family/ friends. The mom is a special guest.", "Yta.  I’m willing to bet most people hate attending and throwing showers. \n\nWant to see your family? Invite them over", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I’m  30F almost 30 weeks pregnant and my mom has not brought up a baby shower for me. I grew up going to all sorts of baby showers for multiple cousins and family members specifically with my mom. My mom even hosted a wedding and baby shower for my sister-in-law. So naturally I figured she’d offer to throw me a baby shower for my first baby. \n\nI think it’s odd that she hasn’t even brought it up or mentioned it, with me being this far along. I know they aren’t until a month before birth, but to not even have a discussion? Everyone at work has been asking me if I’m having one and I feel embarrassed for not having any plans. I texted my dad and asked if my mom has even brought it up while at home.\n\nShe texted me on his behalf and said her and my aunt had been planning to do one. I got a call from her today and she decided she wanted to be honest with me and tell me how she really felt. She offered to give me as much money as it would take to have a baby shower if we could just skip it, because she hates baby showers. I knew this is how she felt the whole time but was just hoping she’d want to make me feel a celebrated with my first child. It’s not even about the gifts or anything. I never see my family, ever, now that I’m older. I didn’t have other typical celebrations families usually have because my mom has always talked me out of them. This time I just want to be normal and make this time in my life special. \n\nI yelled at her and told her that she’s ruined a lot of life experiences for me and has caused me to be an outcast with her ways of keeping me distant from the world and lack of celebrating anything in life. I asked her if this is how she treated my sister-in-law. She said that she just felt comfortable enough to share that with me about how she truly felt, and that she was hoping I’d feel the same way. She tried to backtrack and say she’ll throw me one but I told her she already tainted the entire experience. \n\nWas I too harsh in my response?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "heartbreaking lesson for you here OP. This is how your mother is. She went out of her way for your SIL, but has a history of short changing you. STOP expecting her to change. The day you accept her reality, the day you split the living woman who exists (and who doesn't want to do stuff for you) from your dream mother, then you will find peace.\n\nAnd empty well will not have water, no matter how many times you go and beg it for a drink.\n\nYour mother doesnt want to give you life celebrations. If this is hard to embrace, work with a therapist and learn to set boundaries and make REALISTIC expectations of her. \n\nYou're going to be a mother soon. Learn to embrace the reality of who and how your mother is, and don't have false expectations of her role and contribution to your life as a mother either.", "ESH. \n\nIt is very obvious from your post and your comments that her not celebrating important milestones with you has been incredibly hurtful. Just with the way you’re digging your heels in about this suggests to me that this is about WAY more than a baby shower. It’s really hard to want good experiences with your mom and she just doesn’t feel the same way. My mom is similar, so I feel this pain. \n\nBut you’re not seeing what everyone else here sees: this isn’t the last milestone you can share with her. She’s being honest with you about this one experience, which is very good. It’s time for you to be honest with her about all of this too. In a productive way.  Spend some time really examining your feelings. Then talk with her about why this hurts you. \n\nHere’s why I say ESH- mom absolutely should have just dealt with this and had the damn baby shower. This is her child and it makes me feel sad that she didn’t care enough to try. Or even make up a good lie, like aunt was throwing it or something. \n\nAt the end of the day it’s her decision, and she can do as she pleases. I do think you need to really take a look at why you overreacted to all of this as well. \n\nGood luck op and congrats on the baby!", "NTA, take the money and have someone else throw a party! No need to tell her about it!", "You were aware of how she felt yet still expected her to throw you one? \n\nThe issue for me here is that you expected it, she doesn’t NEED to throw you a baby shower . She said no, now it’s your turn to make a decision based on that . You can either plan it yourself or ask someone else to plan it. It doesn’t sound like you have a great relationship with your mom to begin with so her not being a part of it shouldn’t be a problem,right? She also has a patter, what was it about this situation that made you think it was going to be different? \n\nI think both are in the wrong for different reasons.", "Yta you're 30 years old stop blaming your mom for your problems. Want a shower have a shower that simple", "This is excellent advice.  Thank you for taking the time to offer such a good statement that helps many of us in the same boat.  We need to support each other.  I appreciate your effort.", "You’re right.", "I love this answer. So nuanced", "Dude I’ve been having SO much trouble with my relationship with my mom lately and this has helped me a lot. THANK YOU.", "This is the one. OP keeps expecting her mum to be someone other than who she’s always been. Time to accept who she is and decide how to proceed from there", "I wish I could upvote this more", "[deleted]", "So just ignore the fact that she threw someone who wasn’t  even her own blood 2 parties and never complained? Right", "See I would agree but her mum did it for her dil", "Well you don’t know my childhood. I think when my mom took me a way from social situations on purpose, that is her fault. I’m sorry I know the root to my feelings.", "Because these commenters are complete assholes.", "Especially your own daughter for her first baby. That’s wild to me.", "I don’t know who considers it rude for family to throw a baby shower, but nobody I know does. Every single baby shower I have ever been to has been thrown by the person’s family, and no one thought it was rude.", "No one owes you a party. What kind of claim is that? It’s a tradition in my family, and I’m the only one who is supposed to be left out and be okay with it? Explain that. Because expecting others to do something nice for you during a big milestone is such a terrible thing to expect when it’s actually very normal.", "🙏", "Sorry I disagree.  OP wanted the experience.  Throwing money at something doesn’t give you a warm memory.", "Sorry but no ... This approach will likely achieve nothing but fouling the atmosphere and eroding all hope for some happier compromise down the line.  Maybe the new grandbaby will inspire her to loosen up a bit if her feelings aren't wrecked first?\n\nThe best hope from the information we've been given is to set the mother up to succeed by lowering the stakes (one example: organize your own party and ask nicely whether she could contribute maybe a little something?). \n\nWe have not been told what her mother's day to day is like now and how long ago the other family parties were.  Hosting a party is a big commitment.  Maybe she doesn't feel well and is afraid of getting in over her head, but doesn't want to admit?  Maybe the aunt knows that and didn't press?", "🙏", "This is a judgement sub, if she wanted warm fuzzies there are other forums for it.", "I've been where you are so I know it hurts but there's nothing you can do about it. Just focus on the baby and learn not to expect anything from your family.", "Why did you put that on her knowing she hates showers? I assume these other people had no clue and there were other family dynamics at work. But you know exactly how your mom feels, but you're still making this ask. Why?", "[deleted]", "I have 3 married sons with children. I’m good friends all the MIL (sons chose well) and we didn’t plan or pay for any of the showers. Where I live the friends typically host with minimal input from us.   It was always the close friends who did it", "You’re not supposed to throw showers for your own kids. Etiquette says. Sorry.", "I think you’re NTA, obviously not great that you yelled at her (you should apologize for that), but I think it’s very valid that you would expect your own mother (who planned someone else’s shower) to be okay with planning a shower for you even if it isn’t something she typically enjoys. Your expectation is very valid", "It’s not a title for tat and give op’s entitlement I can see why mom doesn’t want the drama.", "She should acknowledge that these showers are very stressful for her mom. I’d do just about anything to avoid causing my mother stress, work, expense and anxiety.", "You seem to know your mother very well. Then why have these expectations from her?. You are just setting yourself for disappointment. Take the money and ask sis in law to throw you one", "Then why are you even here?", "You gotta take a breath, OP. If you feel completely justified in your response, why did you post on AITA? For validation and sympathy or for other people’s perspectives? If it was for validation and sympathy, it looks like you might not get it as unequivocally as you’d like, and this experience will frustrate you more. If it was for other people’s perspectives, try to understand what point they’re  making without trying to argue with them.", "Boo hoo. Grow ip", "No, they simply recognize that no one is *owed* a party and that OP is being utterly ridiculous in expecting one (from her family) after what she’s shared about her family. If she wants pity, there are other subs for that.", "Yep, OP is NTA.  She wants the whole pregnancy experience.  Unfortunately at 30 weeks, the window is small now to get it planned, invitations sent, etc.  The SIL should have stepped up if Mom wasn’t doing to do it.", "You need to take some etiquette lessons.  You should never ask for presents for yourself or family.  Hosting a shower is asking for presents. \n\nShowers should be held by friends who wish to join together to gift you.", "Why are you arguing with everyone .. you asked people opinions and are getting upset with they don’t agree with. Your mom doesn’t want to throw a shower she’s not required have your friends or other family throw it. You aren’t entitled to anything YTA", "What you seem aware of yet cannot seem to accept is that you don’t come from “normal.” In my family, what you’re requesting would be something that the aunts would be arguing with each other to host. But nothing you’ve said about yours makes me think that it would operate in remotely the same way. I understand that you *want* it to, but you’re stubbornly ignoring that your reality does not lend itself to that being likely.", "Lord help your child. You are a grown ass adult about to give birth, acting like a child yourself. You came here asking for opinions, stop arguing and just accept it. Usually the mother does not throw the baby shower. However, you know your mother and you know what she’s like, so expecting something different was silly. Talk to your friends and see if you can get one set up and grow up. You’re about to be a mother, take this experience and learn from it for your own motherhood.", "Truth be told, showers are hosted by friends or cousins and not the mother. Yes, your mother has thrown it for others but that doesn't mean that she HAS to throw it for you as well.\n\n\nA pregnancy doesn't always mean that everyone should bend over backwards to please you. Irrespective of what happened in your childhood, please know that your mother cannot fix that by just throwing you a party, that's what therapy is for.", "Ima be real op I tried for three decades to get love attention affection and approval from my mother, the same I saw her give others but never NEVER me. I broke not long ago and for my own mental health I cut her off and it’s incredibly sad but freeing, stop trying to make her the person you want her be she never will be and it’s kinder to yourself to accept it and move on and distance yourself from it because it is mean and hurtful but she won’t see and won’t change", "I agree, however, this person is going way too far.\nOverboard", "If she truly hated them that much she wouldn’t have thrown them for other people. She’s willing to put her feelings aside for everyone BUT her daughter, and her daughters the problem?", "Because it’s more about making one feel loved by their family which is sn experience I have lacked my whole life. Because she should be able to overcome her own emotions to celebrate her grandchild.", "She’s my mother… whose mother throws a million parties for other people but isn’t obligated to for her own child? That logic makes no sense. So everyone but family matters?", "But she did throw one for one of her own kids, the SIL is married to her brother therefore her mother threw a baby shower for her sons baby, but won’t throw one for her daughters baby? Favoritism comes to mind", "So mum could have said something sooner then.", "According to Emily Post, you’re incorrect, by the way.", "Tell that to all the many, many people who do this. I guess everyone needs to take etiquette lessons. Too bad for the people who don’t have many friends, I guess. Also, most people invited to the showers I’ve been to are other family members.\nAnd, honestly, is asking for presents for a friend so much better than asking for a family member?", "THANK YOU. It's beyond tacky to have direct family members throw wedding or baby showers, but I suppose Main Character Syndrome and the increasing tendency to demand that others *make them feel special* has turned a lot of people into whiny toddlers when they should be preparing for the realities of marriage or parenthood.\n\nOP, YTA and to be honest you don't really sound mature enough to be a parent. Grow up.", "By that train of thought, parents should never host a birthday party? Because that’s asking for presents for your kid.", "I was you and you can hope and explain and spoil her to show her how it feels and encourage and support her until the cows come home and she will never provide you what you need and want. I had a mom just like this and while she could do all the right things for everyone else (including my sister in law) she could never find her way to do it for me - don’t offer up your life hoping.  Find people who love you and will treat you well", ">  which is sn experience I have lacked my whole life. \n\nOne party isn't going to deal with your childhood sense of abandonment. Go to therapy and deal with your actual problems rather than yelling at your mom about one symbolic gesture.", "No it’s about you thinking that you and your baby should be the center of everyone’s world. It’s also about the fact your jealousy of your sister in law.", "She said no. Accept it and move on. Stop arguing with strangers.", "You’re hurting yourself with this expectation. Like I actually agree, your mum being willing to do this for SIL even when she hates showers suggests that looking good externally is more important to her.\n\nBut at the same time, you know exactly who she is. You’re right, she’s not nice to you. BUT She’s done this your whole life already. So. Stop the pity party. Get someone else to throw the shower and remove the ability for her to keep hurting you 🫠", "Ok I am going to give you a strong dose of reality(which honestly you’re so entitled it isn’t going to help.) \n\nShe hosted parties for others because they were not high maintenance and were appropriated.\n\nI have a feeling you’re one of those people who are never satisfied.  You think the world owes you. Nothing is ever appreciated because obviously you deserve it and they should have done better.\n\nThe parties will never be good enough. You will never be happy. You will always be dramatic and want more.\n\nYour difficult at best and an entitled.\n\nThis is why your mom or quite frankly NO ONE wants to host a party with you. I bet your the person that when they see your name pop up in a text message or caller id they think OH HELL! I don’t have the energy to deal with her drama today!", "If you don't have any friends then who will come to your party and give you presents?", "Completely wrong. Longing to experience a feeling that my soul needs to feel would absolutely help heal my my childhood sense of abandonment. That’s how you overcome mental health issues is through REAL WORLD GOOD EXPERIENCES. Holy shit dude.", "Not true at all, how could I be high maintenance or entitled when I’ve never even had a party thrown for me, in my entire life? How could one have high expectations if there was never an opportunity to have a damn expectation?!", "Actually her mother is one of those people who cannot be kind or giving to her daughter specifically because somehow in her mind it takes something away from her.  Mom understands the social and practical aspects of this and can behave kindly to others so it’s not lack of knowledge or ability- it’s a very deliberate cruel choice she has made over a lifetime.  Thank the universe you don’t understand this from personal experience.", "As I said in the comment you responded to, other family members mostly. I also said “who don’t have many friends.” So maybe you have some friends to come, but none you would feel comfortable asking to throw you a party. That seems rude to me to do.", "> would absolutely help heal my my childhood sense of abandonment\n\nI don't see how it's going to address the obvious pent up resentment you have. Or address the sense of entitlement coming from whatever failings your parents have. So color me unconvinced.", "INFO: How did you communicate to your mom that her throwing you a shower was this important to you?", "Please seek therapy before you become a parent and put all this onto your own child.", "Look people very frequently treat strangers better than their own family. It’s why divorces happen and children become estranged from parents. It’s because they let you see the real version while they are manically trying to keep up appearances for everyone else. It sucks but you’re not gonna be able to change her now. Accept her as is and make a note not to do the same thing to your loved ones, or go low contact so it doesn’t bother you so much.", "Dude, you’re 30. Stop acting like a 16 year old brat.", "Because her going out of her way to help me feel loved and celebrated would be a step in the direction of me not feeling like a social outcast and that people actually care about me and want to be in my baby’s life. If she could have just thrown me a shower without admitting her true feelings than I wouldn’t have to feel the way I’m feeling now. Sometimes it’s better to hold your feelings in for the sake of making other people not feel like garbage. And sometimes you do things for family even if you don’t want to.", "Why does she have to compromise instead of you?", "You need to understand that you cannot force anyone to do anything especially to 'make up' for something. You're just building yourself up for dissapointment. Would you keep going to the same restaurant where they always serve bad food? No because you know what the outcome will be so you know to choose another restaurant.\n\nIn mom throwing the shower for SIL, do you honestly think she enjoyed it? And it's not worth doing something for family because you're forced to because you're going to resent that and it's going to build until it explodes out of you and the aftermatch isn't so great.", "Would it not feel hollow, having this party you so want but knowing the person who arranged it for you was deeply uncomfortable?", "Because she is pregnant and the world should be bending over backwards telling her she is special!", "This comment section is BRUTAL.\n\nOP, I am so sorry. You just want to feel loved and supported during an incredibly vulnerable time and beautiful milestone. It is not entitled or rude to want to feel that from your mom, after watching her give that to others. I hope you find comfort in pouring your own love into your baby’s world. Congratulations on your pregnancy 🤍 NTA", "NTA and I don’t understand all the Y T A responses. My mom did a lot of similar stuff to me with my wedding, she projected her insecurities and anxiety onto me, canceled my bridal shower last minute, and ultimately didn’t even come to my wedding. It’s heartbreaking to have these realizations about who your parents really are, no matter what age you are when it happens. Something deep inside us reverts to being a fragile child. \n\nSo was your reaction the best? No probably not. But I would give yourself some grace and empathy, and try to move on from this. Talk to a friend or family member about throwing a baby shower, even if you co-host it with them. Be kind to yourself and give yourself time to process the change in relationship with your mom, since the only move you have is to recalibrate your expectations of her and accept that they may need to be a lot lower than you originally had them.", "I’m going NTA for one reason: She’s talked you out of countless celebrations for life events and then tried talking you out of this one and it was the last straw. She even tried to bribe you so you wouldn’t do one. As someone who has also missed out on celebrating big things in my life, when you reach your breaking point you let years of hurt and frustration out and I can only imagine how that would feel amplified when pregnant.\n\nEveryone trying to shame you or throwing “EtIQuEtTe” around like it’s the same everywhere with everyone miss such a crucial point in the post: your mother has prevented you from celebrating your own life, and now wants you to not celebrate the approaching life of your child. That makes HER the AH. She could have easily asked your SIL to take the reins, had an aunt or cousin or even your brother take over, or just communicate with you that she was not able to. Instead she said “I will literally pay you to NOT have a baby shower” and THAT is where she is an AH.", "NTA. All the “nobody owes you a baby shower” comments are so bizarre. OP isn’t a 30-year-old demanding a birthday party with a bounce castle. You throw family members baby showers for their first child to make sure they have all the basic things they need to start out as parents. In turn, OP has given/will forever give baby shower gifts to her SIL, cousins, niblings, etc. for the rest of her life, whenever someone else is having their first child. That’s how baby showers work. If you come from a family that has a tradition of baby showers, then you can 100% expect to be thrown one. Like wtf people.", "NTA. I’m sorry nobody has offered to throw you a shower. That’s extremely disappointing and I can see how it would make you angry. Aside from your mom, a friend at least should be offering to do it or a SIL or other relative. All you can do is move on now. If you would like a friends support feel free to message me. Being pregnant without a support system is especially isolating. And as another commenter articulated very well, accept that your mother is not the mother you want and you can’t change her. Been there done that too. It will only get worse once the baby is born unless you learn to change your expectations of her. And congratulations on your pregnancy!", "I don't understand all the Y T A responses. You're NTA here, but I think this may be more of a cultural thing personally. \n\nWhere I'm from, you don't throw your own baby shower, your mother or mother in law should. Next would be sisters or close friends, and aunts. It would be so hurtful to me if my own mom did this. She can attend and throw a shower for anyone except her own daughter and her first baby? And she's waited so long that it would be difficult for anyone else to throw one for you.", "NTA bc she threw a wedding *and* baby shower for her daughter-in-law but refuses to do the same for her literal daughter. no, you're not entitled to this but i can see why you'd be upset. also, you said she talked you out of other celebrations growing up, and that just sounds really sad. i'm sorry your mom treats you like this, but you need to come to the conclusion that she'll never be the mom you needed. if you still want a baby shower, invite everyone except your mom (since she hates them so much) and let people know that gifts of any kind aren't needed but will be accepted. let them know that you're throwing it for yourself and you just want to see your family all together. please don't let her ruin your spirit, you're clearly a strong woman and you're gonna be okay.", "NTA.\n\n\nA lot of these comments are weird- it’s her *mom*. Her mother should be excited to throw a baby shower for her daughter to celebrate the grand baby and ensure she gets the things she needs. \n\n\nI would imagine it’s extremely awkward to ask people who aren’t family to throw the event; OP shouldn’t have to ask. And I would also imagine how hurt OP is. So the mom hates throwing parties but why wouldn’t she want to plan this for the arrival of her grandchild? 🥴 she went out of her way to throw them for other people who aren’t her kid.\n\n\nSorry, OP. I know what it feels like to have parents and family that show up for other people but not for you. I had to accept and acknowledge that about them and I just don’t expect much from them anymore. I empathize with you.", "NTA. So, OP’s mother has been attending baby showers her entire life and even hosted some including the SIL’s, but NOW she can’t stand the thought of throwing one for OP and hates them? Right. Of course OP is disappointed and hurt. And it seems this isn’t the first time the mother bailed on her.", "In my culture babyshowers can be as big as wedding celebrations. Despite always organizing, helping and/or showing up for everyone’s babyshower no one bothered to put one together for me so I did it myself. And I decorated myself, and I let everyone know that I loved that they showed up for me but that I did more than that for them. People apologized and had reasons but I was so sick for my entire pregnancy that putting a party together was really hard on emotionally because i kept feeling like no one loved me except my husband.", "NTA.\n\nIt’s hurtful that she threw 2 showers for your brother and his wife but apparently can’t make one work for you.\n\nIt sounds like this isn’t the first time you have been told no one would show up for you like they showed up for your brother, or cousin, or other family member.\n\nExpecting your mom to be excited you’re pregnant, and to want to celebrate and show off because you’re having a kid, isn’t crazy or entitled.  Especially when she’s roped you into helping her do that for others.\n\nCongratulations 🎉💕 I hope you find a way to celebrate that makes you feel amazing.  I’ve found that kind of support with friends more than family myself, and maybe that can help you.", "NTA!! Completely understandable and acceptable response! I'd be hurt as well. How dare your mom make YOUR baby shower about HER, soooo f\\*cking selfish!!!", "NTA.  This obviously isn’t over just a baby shower, but her unwillingness to celebrate any milestone in your life with you while doing it for other family members.  I’d honestly suggest going low con or even no con because if she treats her own daughter like this compared to her other daughter, she’ll do the same to your child.  If she didn’t ever want to make the effort to seriously take part in your life then she shouldn’t be given the chance anymore after 30 years.  Do what another commenter said and grieve for the mother that she should have been and do your best to move on with your life.  I can’t imagine what this feels like, but there are other people around you that obviously love and care about you, even if it’s not in a motherly way.", "NTA \nShe threw one for your sister in law, told you she was going to throw one with your aunt and then admitted it was a lie and that she wouldn’t even go through this for her daughter knowing it’s something that means a lot to you. \nYou have every right to be upset and share your feelings about that \nI have no idea why people are being mean to you in the comments.", "NTA", "NTA \n\nI’m sorry so many people are saying YTA. You are your mother’s daughter and you want to be treated just like your SIL or any other person who she has helped celebrate. I don’t even know you and I feel like giving you a baby shower because everyone deserves one. Just use this as an example of how not to be with your baby on the way. Your feelings are valid and I’m sorry she hurt you once again. You are worthy of a baby shower and I hope you and your mom find common ground so you get one. Sending you an air hug 🤗. Sorry for grammar I’m in a hurry.", "NTA- idk what everyone else is on but come on, it’s your first kid… she couldn’t suck it up for one freaking day?! She’s your mom!! If she sucks it up for others she couldn’t for her own daughter?! If she didn’t wanna throw you one she should have told you sooner.. I mean hello? Who else was supposed to throw one for you?! She was just waiting for you to either forget or not bring it up at all. That’s just insensitive and lazy of her.. I’m sorry, but I hate anything social and even I think that’s effed up of her..", "NTA\n\nIt seems you had the expectation that your mom would be excited to have a shower for you, as she had for your SIL.\n\nThe fact that she doesn't want to, is hurtful to you.\nConsidering the history you described, you should have had this conversation about a shower before now.\n\nI'm thinking there is a lot more to your relationship baggage with your mom, based on your comments and responses.  Therefore should have known better than to count on her for this.  Again, yes hurtful.\n\nPlease move on from this, I hope someone, a friend, your SIL, another relative chooses to have a shower for you.", "Your mom should be there for you, that's what moms are for\n\nNow downvote me all you want", "NTA\n\nAnd people are being horrible. You have every right to be sad and upset. Your mom sounds awful. Do you have a friend who you’re close to and can throw you one?", "NTA\n\nIf this has been a pattern of your mom's your whole life it might be better to see if you can get the money and have another family member help you plan. Go literally cry to grandma or someone about it and see if they even know you want to have celebrations like these.", "Not the asshole. She felt comfortable enough to throw your sister-in-law, a baby shower, but not you? And she waits until your last month to tell you? Go ahead and put your own baby shower together, I did. And invite your coworkers and close friends.", "NTA.", "NTA. My mom is emotionally distant but even she threw me a baby shower. You deserve so much better hun. Find a way to celebrate yourself or be honest with your coworkers and admit that you were misled to think that your mom and aunt was planning a baby shower but your mom changed her mind.", "NTA. I feel like it’s pretty ick behavior to throw a baby shower for your SIL and letting so much time go before telling you she wouldn’t do it for you (in fairness she’s really not obligated but it is kinda the norm) giving someone else in your family the opportunity to do.", "So the asshole mother would rather throw money at the OP than spend time and care, even if it’s less than other events. No grandchildren visits for her!!!", "NTA. Your mom is being selfish and a crappy mother. Even if she personally hates baby showers, she should suck it up and do one for you, her daughter! It’s not that big a deal to host one: get food and some punch and some decorations and send out invites! Frankly your mom sucks. How about your in-laws or a close friend?", "NTA. Anyone saying you are, are actually assholes. You have every right to be upset about the way your mom acted. She may not owe you a baby shower but she basically said she doesn’t care either way. It’s her grandchild.. even if she doesn’t want to throw it she should be excited for you. Hopefully some one else close to you can throw a shower.", "NTA. Please cut this toxic woman out of your life. Life is too short for people who only want to care about “appearances” and don’t want to celebrate the important moments in your life. Your mom sounds self-centered and uncaring. Maybe reach out to your aunt or best friend and arrange a baby shower that suits your needs and celebrates your new baby. Congratulations, but truly, stop reaching out to your mom until she gets some damn therapy to deal with her problems.", "I'm one of those women whose family NEVER celebrated anything for me. No wedding showers, baby showers, grad parties,etc. I make sure my kids have those parties. OP is right to feel hurt. Her mother celebrated others, but not her own daughter. This isn't entitlement, this is wanting her mother to do for her what she's done for others.", "I gotta be honest NTA. \n\nThoughhhhh you did kinda set yourself up for the disappointment. If you knew how she was/knew how she felt, why sit around and wait for her to throw you one?\n\nBut at the same time I can understand where you’re coming from. Traditionally, the mom of momma to be **does** plan it; it’s seen as REALLY weird and selfish for a mother to be to plan it herself. \n\nI think what all the YTA’s are missing here too is that the mother is making this about **her** instead of mom to be. If she can set aside her hatred for showers for SIL, she should have done so for her *own* daughter. \n\nThough, OP, I think some distance from your mother may be best for you as it seems there are a lot of underlying issues in your relationship with her. I’m not exactly saying go NC, butttt you need to just sit down and ask yourself how much bs you’re willing to let into your life.", "OP, I’m really sorry you don’t have the mother you wish you could’ve had. I was estranged from my own mom during pregnancy and same with my in law. I asked my best friend if she would throw my shower because I wanted the experience and celebrate my first baby, and I had no one. You’re NTA. Do you have a close friend or coworker you could ask to throw the shower? My best friend and I planned the shower together, she sent out invites to everyone and we had it at our house. You could spend the money on the party, plan it with her and she could send it out to guests? You’re 30 weeks, you still have time to have the party. I will say…I’d go low contact with your mother. You are not her priority and I wouldn’t expect her to ever put you first.", "NTA. I can’t make sense of half of these comments. Showers by nature are thrown for you, majority of the time they are a literal surprise for the person they are for. Not sure wtf people are on here saying you’re entitled for thinking your mom would throw you one.. who else would especially since she threw one for you sil. These votes are wild. All that said sounds like your mom sucks and this was a final breaking point.", "NTA. You shouldn't have yelled at her but I understand why you feel the way that you do. You should apologize and ask your mom to help you throw one.", "NTA. That was unexpected and disappointing news. Also, I'm guessing that you feel hurt, like she was willing to do it for other family members but not for her own daughter? Like, she was able to put her feelings aside for other people but not for her own kid? Totally get where you're coming from. Even if she doesn't love to throw them, this is your first child and you are her daughter. She should have sucked up and done it. I don't blame you at all. And I agree with you, if she's saying she'll do it now, forget it, it's already been ruined. Someone else has to do it or just won't happen. Because you'll never enjoy it, it will be on your head the whole time that she didn't want to do this and only did it cuz she felt like she had to. No one wants that.", "NTA. I'm so sorry you're going through this, OP, and I'm disgusted by some of the comments. This is so much more than having someone \"throw a party\" for you. Wishing you the best.", "NTA\n\nTalk with your Aunt, Cousins or SIL and let them in on what your mom thinks. Ask them if they would take the money and help you celebrate the arrival of your baby. I’m sure they are all waiting for the invite to arrive and are as flummoxed by the lack of information as you were. \n\nIt is okay to bypass your Mom and take the reigns of communication with your family.", "NTA. what a mother she is! try talk to a relative that you feel comfortable with. let the relative talk to the rest of the family what your mom had been doing over the years. On the other hand, I’d like to know your mom’s real reasons for not letting you participate in family/relatives events. Something to do with past behavior on your part?", "I said this earlier, but your mom is prolly a narcissist who gets validation by helping anyone on the outside.  She doesn’t deserve to meet her future grandchild!!! NTA.", "NTA she threw one for your SIL but doesn’t want to for her own daughter? Yeah, I’d be feeling bummed out too", "Sounds more like she is hurt because her mom did one for the sister in law and now her which I would e pissed off to because that’s my mom.", "Your coworkers may be asking about such plans because they would like to throw you a shower.  Let them know your mom has decided not to.  What about your SIL?", "I planned two baby showers for friends. My wedding showers were planned by friends (in the state I’m from and was getting married in) and coworkers (in the state I was living in.)\n\nMy baby shower was planned by the ladies at church. The church ladies love to throw showers. They even threw a shower for my daughter who was living on another continent, and the church paid the extra luggage fee so I could take the gifts with me when I went after the baby was born.", "Throw your own and don’t invite her\n\nI’m petty", "Does your mother have an aversion to you but will willingly go all out for everyone else that is not related to her?  I think this was a long time coming and she deserved it.  I don't like celebrations either, but I am not going to deny my niece who I raised, a birthday or any other milestone in her life to celebrate.  Your mother is something else.  Really and truly, someone else should have done it.", "I always thought they were hosted by a close family friend or maybe a cousin ?", "Can your friends throw you the baby shower? Your mom does not have to", "I had a co ed baby shower with lots of alcohol,  obviously only for the guests and not me. I got awesome presents and didn't have to do the silly party games. Highly recommend", "I would tell them to shove their shitty baby shower up their ass. Your mom can suck it.", "I know AITA comments usually suck but honestly, screw yall. OP, I had a mom similar to this, in the sense that she went out of her way for others far more than she did for me and my dad. It fucks with you, a lot. My advice is to get a good therapist, go low or no contact with your mom, and take time to realize your mother is unfortunately not the mom you wanted or deserved. And for that I’m really sorry. But hopefully you can take this opportunity and use it to become the kind of mother you always wanted for your kid.\n\nNTA.", "I'm going NTA because mom threw one for DIL. That gave you reason to expect one. I would have, however, discussed this with her much sooner, especially as this looks like a pattern for mom. You would have had more time to throw your own, tho honestly still do, but it would be more rushed and closer to due date.\n\nI'd plan a smaller event with friends and coworkers that seem to be taking an interest on you. Go low key, but maybe leave mom out of it because if anyone asks, you can explain she hates baby showers (that might be my petty side coming out, of course)", "NTA\n\nYour mother is willing to go the extra mile for literally any- and every-one else, but not for you.  She’s denied you most, if not all, milestone moments.  That makes her an absolute asshole.\n\nYou hoped your mother would celebrate you despite knowing better.  You are entitled to your feelings, but yelling at her was a step too far.  Have a quiet word with your friends and see if they can and will host for you, otherwise throw yourself a nice sip and see or bay-B-que after baby is born… or see if your MIL is willing to step up.  If I were there I’d be more than happy to host for you, I am sure you have plenty of people who would be willing.", "NTA I know it’s so hard when our moms don’t care for us the way we wish they would. I’m sending love.", "Where's the father's family?", "Honestly, idk about my rating but i’m siding onto NTA lol. You stated your mom has done weddings ect for your sister-in-law, so yeah it does seem wackadoodledoo for her not to do anything for *you*, her own daughter. It’s not hard to throw a baby shower if she can do all that other stuff for your sister-in-law. But i do agree with most of the people in these comments that say it doesn’t need to be her responsibility. At the same time, like i said though.. if she’s able to do all this shit for your sister-in-law, she can more than likely do something for you.", "Positively NTA. It’s terrible she has ruined this for you and I’m really sorry. My mom is very much the same as yours and has ruined so much. Once it becomes about not only you but your baby it’s a whole other offense in my book.", "I'm going to go against the grain here and say ESH. OP, I really empathize with you and the situation with your mom. It's hurtful that she would throw a baby shower for her daughter-in-law but not do the same for her *actual* daughter; and then her tossing money at you in hopes you'd just take that as a consolation prize and say \"OK, on second thought I don't care about having a shower for my first born child!\" \n\nUgh. I seriously feel your pain. My mom does stuff like this all the time--bends over backwards for my other siblings but  complains when I ask her for something. I'm not sure how best to deal with that, because I haven't learned myself, just wanted to tell you that you aren't alone and are allowed to be hurt by this. \n\nI'm unsure why people are getting on you for being upset over this. I'm *certain* other people here have felt slighted, left out, and hurt when their siblings are getting different--and better-- treatment than they are.\n\n I would recommend sitting down, talking to your mom, and letting her know why you're hurt by this. This is your first kid. You were looking forward to celebrating your pregnancy with your loved ones who you hardly get to see and wanted to share this extremely special moment with the people you love.\n\n From now on though, if you want something to happen then you should just do it yourself and save yourself the heartache. I hope that doesn't sound harsh because I don't mean it to be, I'm just speaking from experience. Either that, or tell/ask people what you expect of them or what you'd like them to do. For example, your mom and the baby shower.", "Do you not have friends ? Or why isn’t your sil planning one , cousins ? If you can’t rely on mom you should have been able to rely on either of those 3 options ..", "I want to say N T A but then where I’m from, your mom or church is the one that throws the official shower. My mom threw me one. It never would have occurred to me to have a friend throw one! \n\nThat being said, I think this goes beyond the baby shower, it sounds like you are mad at your mom for a lot more things than just this.", "Why does your SIL not throw you one?", "YTA, No one not even your own mother, is obligated to throw you a party for anything. You don't get to yell at her about it.", "You need to accept that your mom isn’t a mom you want and start distancing yourself. Creating a support group and family outside of biology and moving on. Waiting on your mom to celebrate you when it’s clear she doesn’t care enough to take initiative is torture to yourself", "ESH. Your mom isn't required to throw one for you but it's shitty that she's thrown some before and suddenly doesn't want to throw one for you. I'd take the money and throw one for yourself if you really want one.", "Have a baby shower and don’t invite her. \n\nYou are starting your own family. Don’t need to drag your mom’s issues into it.", "NTA for your feelings. The way you handled them wasn’t great, but the feelings are so valid. Perhaps call your mother back and excuse her from hosting a shower.\n\nLet her know you were disappointed that she didn’t want to celebrate your milestone, despite celebrating the other women in her life. Let her know you understand that throwing a party for you is a hassle and that you don’t want to inconvenience her by asking her to throw you a party to honor her grandchild. Point out that when your family asks you why you didn’t have a shower, but your sister in law did, that you’ll be able to tell them that you and your mom are so close that she didn’t have to pretend to be proud of you, like she did for your SIL.\n\nSounds pretty fucking terrible when you put it that way, doesn’t it, OP’s mom?!  I’d still say to tell her not to bother. She’s already told you that’s what it is, a bother. I’m so sorry that she treated you this way.  I agree with so many other posters telling you to reevaluate your relationship with her. That is the right time to do so. Don’t let her make your baby feel the way she’s made you feel.\n\nDo you have other close women in your life you can share this story with? I bet someone would love to step up and host a party for you, even if it’s small and on a budget. Perhaps your SIL would be willing, or your coworkers?  I get that it’s just a “silly party” but we all want our moment to shine, and to celebrate our excitement with others. I hope that someone steps up for you, girl!", "You can through your own party. Ask friends and family to help. Obviously your mom can’t support you the way you want. Sorry I know this sucks", "NTA. If you can’t get a shower set up before the baby arrives you can have a welcome to the world party. Wouldn’t invite your mother either way. Congratulations on the little one.", "I’m going with NTA.  That sounds very hurtful if she gave SIL two showers after a lifetime of no celebrations for you.  Still,yelling is bad.  \n\nPerhaps another relative would.  Does mom hate the planning and work,or is it spending money?  She sounds like she would pay.  Is she willing to ask a relative to do it,if she finances it?\n\nI hope you get a celebration from somebody.", "NTA. It was extremely shitty of your mom to host a shower for your SIL and not offer to do the same for you.", "Nta why did your mother take you to so many and throw your sister in law one if she hated them so much", "Get your mom to pay and have a friend or family member throw it.", "I threw my own shower 🤷‍♀️", "YTA\n\nWhy it's it your mom's responsibility to throw you a baby shower? Especially since you knew she hated them this whole time. You are 30 years old time to grow up. You are about to have a child so start acting like it, you want one so badly your mother offered to even pay for it when she doesn't need to. Also you ran to your dad to see if she even mentioned one .... Why are you trying to get your parents fighting?\n\nYou are 30. A lot of people that age do not have their mommies and daddies paying for this why don't you expect this from friends and co-workers?\n\nDon't expect someone who hates baby showers to throw you one when you knew she hated them. I've had 2 kids 0 baby showers and I didn't blame anyone. You want one so badly throw it yourself.\n\nIf this is how you are gonna act at 30 and pregnant it's not gonna get any easier for you I tell you that.  \n\nNo one owes you anything and YTA for expecting your mom to do a thing she Hates to do cause you wanted her to. Grow up", "A lot of people live without baby showers.    \nA lot of people feel obligated to throw them for others.    \nYour mother has been used by others to throw their baby showers.    \nShe trusts you enough with her true feelings, that she really doesn't like doing them and was hoping she wouldn't have to any more.    \nAnd you are guilting her for having her own feelings.    \n\n\nI was tempted to go the opposite, but it strikes me that you only care about yourself and not your own mother's feelings.  That makes YTA.", "YTA. I can't imagine asking someone to throw me a shower, much less demanding it! I have also never seen the shower hosted by the pregnant woman's mother. It is almost always done by a friend or sometimes a sister or cousin. The way you handled this was really rude.", "YTA for being so entitled that you think that you are owed a gift grab (sorry, I mean \"baby shower\"). You're about to become a parent- it is your responsibility to be able to provide things for your own child, not your mother's responsibility to beg family members and friends for gifts on your behalf.\n\nIf you want a family celebration of your upcoming child's birth, then why don't you organise a welcome party for your baby once they have been vaccinated (and can therefore be around people) so they can meet your baby and you can see your relatives. This also gives them the opportunity to provide gifts if they choose to do so (with no pressure) and you could have pictures taken to remember the special welcoming party, with the star individual (your baby) present.", "YTA\n\nWould have been N A H except you yelled at your mother. Most people who yell at their mothers are assholes. \n\nYour mother isn't an asshole for not being a \"normal\" party-planning, social, enthusiastic grandma and you aren't an asshole for being disappointed. We can't hold our loved ones to society's version of perfection without hurting them and ourselves.", "I'm not American, where I'm from babyshowers aren't a thing so I don't really understand why you can't just throw you're own shower if you want to see family. You are never entitled (as an adult) to someone else throwing you a party\n\nOr ask your mom that instead of a babyshower she can take you for a pamper pre baby spa day. Which imo sounds way nicer anyway.", "YTA - she obviously went to those others as she felt she had to. She was honest with you and even nice enough to throw you a large wad of cash.", "YTA. Showers are a privilege, not a right. And the way you spoke to your mother, you’ve lost that privilege. If you want one so bad ask a friend to do it. *Many* women don’t get one at all.", "YTA. You sound spoiled and entitled. You say you want to feel celebrated. That's definitely a \"me-me-me\" attitude. \n\nAlso, you knew your mom doesn't like babyshowers. So rather than expect her to do something she doesn't like, you cam coordinate it with other people. \n\nYou also say you rarely see your family. You are old enough to make the effort.", "YTA. You sound like a rude, entitled bratty teenager. Grow up.", "YTA \n\nDon’t ever assume. Use your words.", "Believe it or not, OP, your mother has done a lot for you in your life time. She doesn’t owe you anything, especially a party. Start worrying about your own child and stop acting like a dependent. If you want a baby shower, talk to your friends or coworkers or plan your own. You’re a grown ass woman now, and you should be ready to get off your mom’s nipple— and it sounds like she’s ready for that, too. She’s done enough. You’re a mother now, not a child anymore. Grow up and take care of yourself. At some point you might want to consider helping your mom in return for everything she’s done over the years. She owes you nothing, and you’re entitled to nothing. Yikes.", "I feel like you’re leaving a lot of information out here.  No mention of a husband, is that why she’s not happy about this baby?  What is her aversion to celebrating?  Lack of money?\n\nYou can’t expect a definitive answer with more facts.  Plenty of women go thru life without a baby shower.", "YTA. I feel like you’re blowing this way out of proportion. I think you clearly have some unresolved feeling towards your mom and you should work those out instead of focusing on the fact that your mom isn’t helping you put on a show. \n\nAnd for what it’s worth, you’re 30 years old, you can get together with family whenever you want.", "For a 30 year old you sound very much like a 13 year old. Grow up.", "YTA\n\nLearn how to keep your legs closed and not get somebody responsible for your baby shower. Your 30 years old and still has not matured. You act like a spoiled brat princess? Ehats next? Get your mom take care of your baby while you're busy making more babies?", "YTA.  If your mom was as bad to you as you say, wtf would you think she would throw you a baby shower?  You are 30 not 13.  Own your own happiness and plans.  My dad always tried to bring me down.  So I never relied on him for anything once I was an adult and eventually cut him out. That is called being an adult.  You are about to be a parent.  Time to put on your big girl pants.", "YTA. She is uncomfortable, she sounds reasonable in her explanation. Someone else can throw you one. Or just throw your own.", "YTA. Where I’m from it’s considered tacky for the close family to throw the shower because it comes off as a gift grab. More than that, it’s unreasonable to think you can _make_ someone throw you a party.", "Isn't your aunt throwing you a shower? Your mom sounds like a piece of work. It's fine for her not being up to throwing you shower but to say how she hates showers is weird.", "That’s really bad and ugly of your mum. Hosting numerous baby showers for other relatives and then stopping just before the one is due for her own daughter. She’s really subjecting you to emotional grief, given how she must know how you feel about having a baby shower. How embarrassing also not to have it for the own daughter with everyone in the family in the know about her past baby shower history. NTA.", "YTA- I’m pregnant with my first and don’t expect my mother to do anything for me. If you truly want a shower, plan one yourself. No one robbed you of anything but you robbing yourself of your experience.", "YTA. You need to grow up.", "YTA\n\nIf you’re that desperate, and nobody else is offering to throw a baby shower for you, host it yourself. It’s nothing more than a cash/gift grab anyhow.", "YTA but why do people have to have someone else throw one for them? Could you not organise one yourself? That way it'd exactly how you want it!", "ESH. I get where you’re coming from although I don’t think yelling at your mom was ok or helpful. If your mom has never done this kind of thing \n\nOther people are pointing out that your mom doesn’t have to do this for you and you’re being a brat about it. Sure her mom doesn’t have to. But if she’s never even tried to make her own daughter feel special and loved… I don’t know where the high maintenance accusations are coming from. I feel like most people would feel shitty if their mom was willing to throw others the exact same kind of party but not them. If all OPs coworkers thought she was a pain in the ass they probably wouldn’t be asking her a bunch of questions about her plans and such. \n\nBut yeah you should probably get therapy and forget about seeking love and approval from your mother because if she doesn’t care now, she won’t.", "ESH. If you knew this about her, why did you expect otherwise? Kind of seems like you were going out of your way to make a point with her, which kind of makes sense, but is really just your own shit.\n\nI’m sorry your mom doesn’t like baby showers. If you knew that, maybe ask a friend or a cousin to throw you one.", "YTA your mom didn’t have to throw it and you should have had the conversation a LOT sooner if it mattered to you", "YTA  You admit that you already blame all things wrong in your life on your mother.  Why would you want someone that you have a strained, at best, relationship with to host your baby shower?  You are an adult.  She owes you nothing. Ask your friends to host. It is normally your friends or relatives of your same age group to host anyway.", "YTA.  I think you fail to see the real answer here. The common denominator is you. You never see your family, yet you expect them to throw a shower for you?", "YTA & sound very entitled.", "YTA. Baby showers are not supposed to be held by family members. Do you not have any friends?", "YTA. No one owes you a shower. Quit being entitled.\n\nYou want gifts/help/money from your friends and fam right? Be grateful rather than a brat.", "YTA. I’m so confused because since when is it normal for mothers-to-be to demand a baby shower from anybody, even their mother? I was always under the impression throwing parties was optional, but the way OP is going on… maybe they’re obligations for some people? I don’t get it. \n\nDon’t hang so much of your happiness on someone who has clearly made your life much more difficult than it needed to be. You say you’re 30 years old, if that’s true it’s ok to move on and make your own life with your own traditions that don’t involve the shit your Mom did to you.", "YTA your mother has social anxiety severe enough to skip out on most family celebrations and has forced herself to host/attend events in the past. She felt safe enough to be honest with you about not wanting to host another, even offering to give you the money for it, and you chewed her out for it. You made her feel bad enough that she was going to force herself to host it for you anyways. \n\nAt any point during all of this did it occur to you to ask someone else or even just throw one for yourself? Baby showers can and often are hosted by all sorts of people. I’ve seen aunts and cousins, sisters and friends, even husbands throw baby showers, and yes, I’ve even seen people host their own. You know that your mother has a disabling mental illness that makes these sort of things awful, so why are you, at the ripe age of 30, unable to ask literally anyone else to do this?\n\nI get that growing up with a parent with a severe mental illness isn’t easy. I get that you missed out on things because of her illness. However, you’re an entire grown adult ready to make a child of your own; it’s time to stop blaming your mother for what she couldn’t give you and start providing for your own self.", "YTA.  If you want a baby shower that bad, throw one yourself!  It isn't her responsibility.", "ESH. You can't shame your mom into becoming all you want her to be. You should have figured out by now that she just doesn't have it in her. Waiting on her to be the family you want and deserve is a fools game. Grieve the loss and move forward. \nAsk a friend to host for you. It's often a friend who does this anyway. Use your mom's money to cover expenses to make it easier for your friend. Have the celebration you deserve with people who care.\nI'm sorry your mom turned out to be a jerk. That's on her. But its on you to not act like a victim.", "Yup, way too harsh. Your Mom thought she could trust you with her true feelings. She felt like she didn't need the mask she wears for the rest of the world for you. And you lit in to her. She felt like crap and tried to fix it you you crossed your arms and said , Nope, not good enough. Go apologize to your Mom for being an ass to her. This is something you want. If you don't get to see your extended family much then pick up the phone and make some trips bc phone calls and little social visits are about to become a lot harder for you in the near future and regret sucks.", "I didn't even need to read the post (I did anyway) to know that YTA. Yes, if you yelled at someone because you felt that they owed you a party when they don't like them then you're an asshole.", "YTA. The world does not revolve around you and your pregnancy. You sound like an entitled brat tbh. Have you considered your mum may be planning a baby shower as a suprsise for you? I don't know since when things like this have become expected", "YTA it is exceptionally bad manners for a family member to throw a shower- baby or bridal. They are usually thrown by a neighbor or a friend of the mother and they are (hang on for this) normally just a small party to celebrate the upcoming event (not the person) and small gifts are given- think onesies, diapers for babies and can openers and wine chillers for bridal. \n\nYTA by asking for a gift grab to celebrate you which violates good manners", "People are being so mean. As a middle child, I know how it feels to be the one always talked out of birthday parties and graduation parties that my siblings got bc my parents knew I wasn’t argumentative. But it hurt every time and years later it still hurts to think about it. Saying “no one is entitled to a party” is really cruel when you’re the only one out of your siblings and cousins who never receives one.", "NTA for OP.\n\nI'm with you on this one. If mom didn't want to, she could have told OP to call the aunt, or called OP to explain right away. She's didn't *have* to text back that things were being planned, especially if nothing had been done. That is 100% a lie.  \n\nI hope OP has someone that is as excited to throw a shower as she is to have one.", "The entire comment section is full of obtuse child/mother/women-hating basement dwellers who don't go outside and think mothers throw their own baby showers.\n\nAnd then there's the people calling her take because where they're from the expecting grandma isn't supposed to throw them, like their rules apply everywhere.", "Omg thank you! People are being absolutely horrid, telling OP to get therapy, she’s not ready to have a child. It’s all so unwarranted.", "This reminds me of the adage: \"Stop going to the hardware store for oranges.\" It's especially helpful for people realizing that their parents aren't going to give them what they need emotionally. It's not fair that other people have grocery stores and you've only got a hardware store, but it's what you have, and it's unfair to yourself to keep going there and getting your hopes up that they might have oranges, because you know that they won't.", "You’re so right about OP needing to take a hard look at her mother. I also have a mother like this and many times I’ve tried to basically get blood from a stone at my own detriment. \n\nBut I can’t fault OP for being upset since her mother did throw a party for her DIL. I hate saying ‘that’s not fair’ but I don’t fault OP for not expecting the same treatment. But after her mother said no, OP should just drop it. I would also start thinking of going low contact with mother if OP hasn’t already.", "You wrote my thoughts. I used to look at older pictures of my mom before addiction took over and wondered “where is *that* woman? She was so warm and loving. I felt safe and secure with her.”    \n\nOnce I realised *that* mom was no longer here, and she wasn’t coming back, it was a lot easier to let go of some guilt I had. One of my siblings occasionally tries to get me to talk to her, but I don’t like who she is now, and that’s unchangeable as far as I’m concerned.", "Best answer. I have a mom like this one. She over-identifies with me, so she treats my brother like he’s a little lord and treats me the way she expects to be treated: like garbage. Then she’s bewildered by the fact that I don’t want to be treated awful. My brother owed me money that was part of her expenses (he agreed to split and then reneged) and my mom told me at least he wasn’t a drunk like her brother and I should let it go. At that point I realized neither of them were going to learn to treat me well so I gave up on the relationships. No declaration, I just stopped making phone calls and stopped buying plane tickets to visit them. I’m sad, but I have more energy to deal with my work, friends, and considerate family.", "Sounds like we have the same therapist", "I don't understand why the mom threw a baby shower for the SIL if she didn't like baby showers but when it comes to her own daughter, that's where she draws the line...", "I think most people replying seriously don't understand how baby showers work or understand the function of them. What moms doing here is a huge insult to OP, especially in light of SIL's baby shower.\n\nIf I were OP, I would absolutely throw a small one (note: it will be slightly embarrassing to throw one herself; it's not the norm and people will ask who threw it), but start focusing on chosen family and people who seem interested/excited for her. Do not invite mom- it's probably just going to upset OP at this point, and I have a bad feeling mom's gonna play doting mother because that's what's expected if she comes.\n\nMom deserves lc, at least. It sounds like it's a pattern OP is an afterthought, and getting her hopes up it's gonna change is going to make her feel worse. It's going to be worse if this starts to extend to the grandchildren- where mom is suddenly too tired for OP's child because she's already done it for brother's", "Also, if I’m reading this right, the mom threw a baby shower for OP’s SIL! Of course OP is going to feel hurt that her mom threw one for her SIL but isn’t willing to do it for her.", "Yeah I think NTA as well. \n\nI don’t know anyone who didn’t have a baby shower thrown by their mom or another close female relative. Is there an obligation? Of course not. But is it expected? Absolutely. \n\nIf OP’s mom didn’t want to do it, she should have said so early on. OP clearly knows her mom hates them and sure I think she could have asked differently and earlier. Like. WAY earlier. If this wasn’t OP’s first I would have less expectation. \n\nWhat does make OP TA is the comments in this thread. Dear lord, woman, you are not helping yourself.", "I think it’s because of how many people on reddit hate celebrations to do with babies and pregnancy. Gender reveals come up a lot as being really hated, and always equated to that one that started a forest fire in the US. Then they say “just get a cake” as if most gender reveals aren’t that level of casual and more about celebrating the pregnancy and future baby than “the couple being entitled and shoving their pregnancy in everyone’s face.” \n\nSame goes for baby showers. There seems to be a common perception that they’re just gift grabs and for the pregnant person to feel important, when usually it’s just a celebration of a new family member coming soon and a chance for people to get together. \n\nI’ve even seen people say that young kids shouldn’t get birthday parties or go to places because they won’t remember it, as if a first birthday party isn’t also for the parents to remember.", "Seriously! People are being so mean. It's not just that mom's not throwing the baby shower, it's also that she's clearly not excited enough about this grandchild to want to celebrate. I absolutely *loathe* baby showers, wedding showers, etc, but I'm still more than willing to help my family and friends celebrate their happiest life events. This is utterly heartbreaking.", "I hate baby showers to my bone marrow, but this seems beyond the Pale.", "Sometimes it’s people who’ve also been neglected and abused by their family, and they think that because *they* sucked it up, everyone else should have to.\n\nOther times it’s people who get on well with their family and they’re so freaked out by the idea that their good relationships are largely down to luck that they have to find a way to villainize OP so they can convince themselves that it could never happen to *them*.\n\nMost of the nastiness you see online (and possibly IRL) that isn’t due to bigotry is one of those two things. Either “I had it just as bad/worse so suck it up you snowflake” or “that didn’t happen to me so there must be something wrong with YOU or I’ll have to face that there but for the grace of gods, etc”", "I think it’s the yelling and throwing an adult tantrum that pushes the OP into AH territory. Being disappointed is understandable- being that aggressively rude to her mom is not warranted in my opinion.", "Truly, idk why people are being so rude. Obviously she’s not “entitled” to a party, but it’d be incredibly hurtful to see others receive the hard work and attention she didn’t seem to get growing up. NTA.", "Yes, this! Talk to a friend about it. I know if my friend was going thru this, I'd throw her a shower.", "Thank you!!", "I mean it’s pretty fucking shitty for her mom to throw showers for everyone else in her life then say “oh sorry not you OP you know I hate showers”\n\nLike damn of course OP is allowed to be hurt and upset.", "The expecting mother isn't supposed to throw her own baby shower. I don't see why OP is the asshole here when her mother threw baby showers for other people, but yet doesn't want to throw one for her own daughter.", "I tried to plan one and was told off by multiple people including some who were ‘definitely organising one’ because it wasn’t my ‘responsibility’. \nI was entirely kept out of the process and repeatedly told it wasn’t my business…as the pregnant person the entire thing was supposed to revolve around. \n\n…guess who didn’t have a baby shower and had every single one of the same people telling me off for not ‘just doing it myself’. One even text the day baby was born only to say ‘guess you don’t need a baby shower then’ \n\nIf you want shit done, do it yourself. \nYou can’t rely on anyone and if you can good for you but note many of us are jealous of you. \n\nThere’s no village these days. You have to make it for yourselves and they are so much smaller than they should be.", "Wtf? You don’t throw your own baby shower. This response is not it.", "But apparently mum was responsible for doing that for all and sundry in the family without ever objecting . Can you think logically?", "Yeah, just hold a “baby-que” and invite people over to your own house!", "Wow that is so aggressive. Per etiquette where I live, you cannot ask anyone to throw you a shower, nor can you throw one for yourself.", "This is a trash response and YTA for even saying it. You sound bitter and cold. Baby showers are thrown by mothers where I’m from (Midwest state), and it’s very common for them to be highly involved in the planning.", "What a fucking stupid reply.", "Also, etiquette says family should not be throwing showers as it seems like a gift grab.  Get a close friend to do it, that’s what I had, my moms best friend and my best friend each threw one", "Exactly why can’t one of OPs coworkers throw her one? I am so confused. My Mom didn’t throw any of us baby showers and she had 9 grandkids it’s because she was disabled and didn’t have a ton of money. Others did, I never said no.", "I’ve heard of more friends planning baby showers than moms nowadays.", "I lived 2000 miles from family when I was pregnant. My co-workers threw a shower for me and we all had a blast! I've thrown showers for friends and relatives. The thing is, the hosts all OFFERED to host--no one had to be forced into it. Why has no one offered to host one for you? Why is it your mom's responsibility? Shouldn't your friends be arranging this?", "Exactly this.after my mil backtracked on throwing me a bridal shower, I asked if someone else could throw it. When I got pregnant, I asked that same friend before we even told my husband's family.", "It was once pretty standard etiquette that close family does not throwa baby shower, because it looks like a family gift grab.  Usually it would be aunts, friends of mom, etc.   \n Of course no one has any etiquette any more so anything goes.", "Obviously, the mom isn't responsible for throwing the shower, and someone else can absolutely do it.  And I'm sure that OP would have had no problem finding someone to do it, except her mother told her that her and her aunt were doing it. \n\nHer mother told her she was doing it, so she had no reason to find someone else to do it. If her mother had been honest from the start and said that she didn't want to do it right away, that would have been a different story. But instead dhe told op she was doing it and then waited a bit before finally telling her the truth. \n\nIt's not her responsibility, but she took on the responsibility by choice when she said she would do it, and then waited until later to come clean and admit that she had no intention of doing it in the first place and didn't want to. It's absolutely understandable that OP would be upset about that and she has every right to be. \n\nHad the mom been honest with her from the start, then OP could have found someone else and figured it out herself.\n\n Yes, OP should have straight up asked her mother, outright, if she was planning a party. That would have been better than assuming, and she does understand that. \n\nBut her mother never should have told her that her and her aunt were planning something when she knew full well that she wasn't. That's pretty cruel.", "How is this the top comment? Seriously? OP is clearly NTA. Mom spent time and effort on her daughter'-in-law shower but can't be bothered to do one for her *own* daughter? OP has every right to feel slighted and hurt.", "It’s not appropriate to ask people to give her a baby shower. If she snaps off on her mom like that, I can only imagine how she treats her friends. Self-entitled attitudes usually backfire. To say that her mom has ruined many experiences for her because she didn’t get a baby shower is selfish and childish.", "Are you sure they aren't throwing you a surprise shower?", "I absolutely disagree. NTA. Unless they do not have any sort of relationship, why wouldn't she want her mom to host her shower? It's extremely disappointing and sad to HAVE to ask another person to host your shower because your mom just doesn't care enough to do so.", "In a vacuum, maybe.  Given the history OP references, and then expands on in the comments?  This is not the right judgement.\n\nOP’s mother never celebrated her.  She always put her own desire not to have these social occasions over OP’s needs, her whole childhood.  She says she never had a single party thrown for her, and her relationship with her extended family suffered for that.  When you get invited to events and never reciprocate, the invitations often stop flowing.\n\nGrowing up feeling that lack, then watching her throw this specific party for other people in your family but refusing to for you?\n\nIdeally OP might have explained why this was important to her and had a conversation with her mother.  I’m not going to blame her for an emotional explosion.  Her mother earned it, not through her current actions but by her previous neglect.\n\nNTA", "lol terrible take.", "Right. I personally threw my own baby shower 🤷🏻‍♀️ it’d be different if her mom had been telling her for a while it was happening and then pulled the rug out from under her. But it sounds like OP just made assumptions", "She knows how her mum feels. And her mum knows how she feels. This is one of the biggest days of her daughter’s life, who should be the one to make the minor sacrifice of being inconvenienced here? The parent or the child?", "She threw her SIL a shower!!! Come on, try to be serious.", "Bro she never got to celebrate her birthday growing up….", "It’s not about the money, it’s the gathering and attention/affection. It’s a shower because you shower the mom", "It's obviously for the op.", "NTA for wanting to feel like her mom cares about her. Such a big deal to feel hurt that mom could do it for SIL but it's too much to do it for OP. She should \"understand\"! Hope mom \"understands\" when she is too unimportant to see the baby.", "She’s selfish and entitled for wanting her mom to celebrate her first baby when it sounds like she never wanted to celebrate any event or milestone for her, but was willing to do it for her SIL?", "Yeah, I get that someone is SUPPOSED to throw the pregnant woman a baby shower but I honestly feel like that rarely happens anymore, a lot of the time it’s the own couple planning it and perhaps get outside help from family but that’s about it. There’s nothing wrong with throwing your own baby shower", "Baby showers are almost never thrown by the pregnant woman. How many have you actually been to?\n\nThe closest female relative is normally responsible. That would typically be the mother. OP is finding out that she is not as important  as her SIL the hard way here. It actually does make a huge difference mom is willing to set her apparent annoyances aside for SIL, but not her daughter", "She offered to pay for as much as it would take to have one if \"we could just skip it\". So, she'd pay for her not to have one. That's how I read it", "I had the same questions! Where are her friends? Where is SIL? Where are her other family members? Anyone else besides mom can throw a shower.", "Telling someone that their own mother who chose to bring them into the world just to be too emotionally unavailable towards their own child throughout their whole life that they’re not owed anything is ridiculous.", "You know absolutely nothing about their relationship. You sound like a major AH.", "Honest question: I've seen a couple responses similar to yours and it makes me curious where you're from that it's considered bad manners for a family member to throw a shower? Where I'm from the mother of the bride or mom-to-be is the default host for showers and I'm wondering if it's different in other places in the world.", "Exactly this. It’s not the party, it’s not even the feelings about the party itself, it’s the cruel double standard", "This sub is super, super anti-child. I think a lot of these comments are just people being mad at the idea that OP deserves a party just because she's having a baby. \n\nChange it to any other kind of party and all the comments would be about how OP's brother must be the golden child and Mom is horrible for favoring the SIL over her own daughter.", "Not just horrid but completely obtuse?? \"Want a baby shower? Just have one! You are an entitled brat!\". Like, that's not how any of this works pal.", "And also sometimes those people have hardware stores but only talk about the times when they accidentally found oranges there. I like this metaphor personally.", "I’ve never come across this saying before, but I’m digging it.", "Taken from your post. It sounds like she talked you out of holding celebrations for yourself growing up?\n\nAnd she threw showers for your sister-in-law.  I'm guessing to keep up appearances.\n\nBecause it makes her uncomfortable.\n\nHas that been your whole life?", "I just dont understand why she did it for your SIL and not you? She also threw a wedding for your sil? What?", "OP, NTA. Your mom sucks for talking you out of celebrating milestones. Your dad’s been getting a pass, but he sucks too for letting it become a pattern. Children and adults should be celebrated by families for special events, because it shows love and support.\n\nHell, I have 4 kids and we‘ve done “D Day” for some of them, where we go to target and pick out a deodorant and a special treat because now when they’re old enough to need it. Is it silly? Yes, absolutely. But it helps make them less weirded out about the changes their bodies are going through. To not celebrate your daughter having a baby is just wild.\n\nINFO: is your brother the Golden Child? It’s insane to throw a wedding AND baby shower for a DIL, but not lift a finger for your own daughter. Where is your father in all this? Can your fiancé ask his family to arrange a celebration for you?\n\nAlso: THE YTA and mean comments must be coming from people whose families probably didn’t show support and love in caring ways. You’re not wrong for feeling hurt. Best of luck OP!", "Please do not listen to this. You are NTA. \n\nMy mother has done this to me my entire life. She did the same thing to me for my wedding. \n\nOnce, my mom offered my jacket to my cousin WHILE I WAS WEARING IT, because my cousin ran away from home and didn't have a winter coat. \n\nShe gives everything to everyone else, gets burnt out, then when it's my turn she's nowhere to be found.", "Hugs! 🫂", "It sounds like your mom has been expecting you to be the adult and protect her from the big scary world.  Embrace your aunt doing the shower. Your mother is a child who can't even have a good time.", "It's time to cut off your mom... maybe do something at work seems like your co workers wanna celebrate with you... \nIt's time to be surrounded by people that truly love you and care...\nYou and your child needs positive vibes only...", "Yeah everyone keeps telling her to throw one herself or ask someone else to do it for her... which I'm sure she'd be called entitled for either. Not to mention it doesnt solve the problem of wanting to feel important. There's no winning in this situation.", "After doing it for your daughter in law too. How crappy, you do stuff you don't want to do for your kids, even when they're adults. \nNTA", "Yeah, I'm baffled at the responses. They boil down to:\n\n\"YTA for wanting your mom to love you\"\n\n\"YTA for wanting your mom to treat you like she treats the rest of the family\"\n\n\"YTA for having feelings\"", "I suspect many are men who are not typically involved in baby showers, tbh. They have less of a clue what it actually looks like, like making sure you greet the host as well as pregnant woman, or don't play close attention when family/friends are setting up for close relatives/SOs.", "Yeah, I’m amazed by all the people saying it is not proper etiquette to have your family host your shower. This is very common. I really wonder if they have asked others to host showers for them?", "She’s also 30 weeks pregnant and her mom is being obtuse. The hormones are real.", "OP, I too had similar issues with my mother. I thought she would snap out of it when I had kids but actually it was the opposite, she hated that she didn’t have me all to herself and things slowly unravelled. My MIL threw me a baby shower, I reluctantly invited my mom even though it was going to be mostly friends (chosen family) but my MIL insisted and needed help preparing. My mom had no interest and didn’t go. \n\nNTA you probably yelled in a freak out panic after bottling it up for so many years. Yes nobody is owed a baby shower but your mom was probably the AH long before this and you shouldn’t need reddit to tell you that.", "I threw my own shower ngl, idc how tacky it was.\n\nMy giver of birth couldn’t afford it and if I was funding it why not lol! \n\nI also had it at pool hall and didn’t do typical games cause my twins were born literally a week before my shower. So I actually had to reschedule it for 2 weeks later and it was quick cause they were in the nicu 😬", "This is it.\n\nMom is free to dislike baby showers all she likes. It is INCREDIBLY shitty of her that, on this one occasion, she feels like it's finally okay to say no because it would be for her own daughter. Especially because she had even *less* of an obligation to throw any of the other ones!", "Exactly. Also if mum wasn't going to throw one she should have said something sooner.", "Yup, I’ll never understand people pleasing strangers and not their family because “they’ll understand”. I treat my family the best out of everyone I know. The mom sucks for this.", "And this is apparently a pattern. How many normal life event marking parties has she talked OP out of? Graduations? Bridal showers?", "Right?! If there is aNyOnE I will do something I otherwise detest for, it’s my kid.", "She only hosted a couple she said. She just attended a bunch with op. She was probably guilted into hosting the ones she did.", "Yeah, I think this is a lot bigger than just feeling snubbed by no baby shower.", "It is not automatically the responsibility of the grandmother to throw a baby shower. Anyone can organize one, friends, a sibling, the baby's father...", "Oh gosh I'm so sorry you went through that... How absolutely insensitive.", "Jesus that's awful.  I had friends and my bfs mother and sister all jumping to volunteer.  I basically didn't have one for my first (18 yrs ago) but I was only 22 and single without nearly the same size support group so this has been pretty exciting for me.  I can't imagine having friends behave like that.  I'm so sorry!", "Wow. You have some fucked up friends/family. I’d go find new ones if I were you.", "I hope you told them you also don’t need them to visit and see the baby.", "Baby-que as in 'baby-barbeque' or 'baby-what'?", "There’s a difference between a mother not hosting for all of her kids because of a financial situation vs here, where the mom hosted one for her daughter in law but not her own daughter. That must be so unbelievably hurtful.\n\nIf your mom had hosted a shower for your brothers wife, but not for you, I bet you too would be hurt,", "It's really not appropriate to ask your coworkers to throw you a baby shower. They're hosted by the pregnant person's family or close friends, or you have a work shower which is different.", "The coworkers were asking most likely to be sure that if a shower was planned that they would not plan something at the same time. It’s not appropriate to ask anyone really if they are planning a shower for you. It’s considered quite rude.", "I don't get why a co-worker would be expected to throw someone a baby shower. It's quite the responsibility, and not cheap. Plus you don't just go around asking random people to throw you a baby shower.", "Total bull - that mother hosted numerous baby showers in the family but then doesn’t want to do it for her own daughter? Get a grip…", "Your mom was disabled and broke. That's not the situation with OPs mom at all. Like my mom never came to school events or sports or dance stuff when I was a kid because she had to work- and I understood that.  But if she was a SAHM who never came because she just didn't like watching her kids special events, that would have hurt me terribly.", "But the mom threw a baby shower for an in law… why couldn’t she suck it up and do the same for her own daughter? That’s the kicker for me.", "I didn’t know any of my coworkers nearly well enough to ask them to host a shower, and none of them would have expected to have been asked. When asked about my shower, I’m sure they would have been shocked to hear me tell them I think they’d do a great job hosting it, lol", "One of her many family members or sister in law can do it. OP is very entitled", "OP mentioned people keep asking her about it and she’s embarrassed. I’m pretty sure she’s given out the idea that her mom (or “someone”) is taking care of it. Obviously OP has people interested enough to ask.", "Yes. Absolutely right. She gave you a very reasonable reason as to why. Stop being so entitled and ask someone else to do it", "That absolute entitlement that you’re showing here. Having someone throw you a baby shower is NOT a right…maybe there’s a reason she doesn’t feel the need to get excited and throw you a baby shower (hint: it might have something to do with your personality)", "Why does it matter though? Do you hate your sister in law? And maybe she did and wa slime NOPE not going to do it again. Just because she did it once or twice doesn’t mean she has to do so every time. Also maybe there were other forces at work there, maybe she was being pressured by SIls family or had financial help etc.", "No one owes anyone a party. Rather than whining about it, COMMUNICATE.", "And maybe that experience convinced the mom she never wanted to do it again. The mom did offer OP a lot of money. Who wants a party thrown by someone who hates parties?", "Maybe that event is what contributed to her deciding not to throw any more showers. It may have been very stressful.", "Depends on what you read, but it's not supposed to be thrown by someone who benefits from the gifts. Which usually means extended family/family friends is fine, grandmother to be is not.", ">No one owes you a party. What kind of claim is that?\n\nThe truth. The obvious truth to anyone who isn't deludedly self entitled.\n\nWhy are you even on this sub if you are going to keep arguing? Explain THAT.", "Starting to understand why no one wants to throw a party for OP.", "What made you think she’d become someone else all of a sudden? \n\nYou’re disappointed and upset because you keep setting yourself up for it with unrealistic expectations.", "Southern United States. And when I say bad manners, I mean really bad manners. It’s looked on as tacky and a gift grab and greedy.", "You’re absolutely right.", "It sounds like its been happening her whole life based on one of OP's comments that I quoted below.\n\n>Not true at all, how could I be high maintenance or entitled when I’ve never even had a party thrown for me, in my entire life? How could one have high expectations if there was never an opportunity to have a damn expectation?!\n\nSo sad. :(", "Yeah, I'm wondering if she's ever had a birthday party or something..", ">She said that she just felt comfortable enough to share that with me about how she truly felt, and that she was hoping I’d feel the same way.\n\nHer mother cares more about keeping up appearances than her own daughter's feelings.  I'm heartbroken for OP.", "My work bridal shower was really weird. None of us were close and my boss(f) got me a nightie.", "I have the sinking suspicion that SIL is married to a golden child. Not sure why, but it is my first impression", "SAME. I doubt any of the people saying these things *wouldn’t* be upset if their mom threw a bridal shower AND a baby shower for a DIL, but not them…. Do these people just have crappy families or no feelings? And OP says it’s a pattern. That hurts, especially if it’s your own mom doing it.", "Also saw a lot of commenters judging OP for not planning her own baby shower when like… that’s genuinely not really how it’s done? I’m sure some people definitely do set up their own, and it’s certainly not wrong/bad to, but come on. Just solidifies that most of the people blaming OP don’t understand the tradition", "You're not _owed_ a mother either, but it's generally heartbreaking nonetheless if something happens to yours or yours is shitty, like OP's is being shitty. There's lots of things we're not _owed_, like love and respect and kindness and expressions of the same, that we should still offer and expect and return, because relationships aren't transactions. And frankly, yeah, OP is an adult, but if someone dip on their relationship with their kid once they're grown, they shouldn't have had kids at all. People are on here talking about how pets are a lifetime commitment, but think human children they brought into the world aren't worthy of the same care.", "Feel like most of the people just not understanding the tradition are either guys and/or never had kids", "Plus OP says\n\n> I didn't have other typical celebrations families usually have because my mom has always talked me out of them.\n\nIt sounds like her mom has a pattern of doing this sort of thing to her, and it seems purposeful to make OP feel bad. I can see why at this point OP feels this way.", "She only hosted one. OP said they attended others with their mom.", "Usually aunts and sisters host showers, not parents. Where are they?", "I agree, but ESH as the daughter sounds like she was already getting resentful with her expectations and assumptions of another person before even asking her mom. \n\nWhy would you get embarrassed at work because your mum isn’t throwing you a baby shower? You can do it yourself!", "No, I think mom not saying anything made it pretty clear where she stood. Especially as OP admits she knows mom hates showers. There’s no need to say “hey, I’m not giving you a shower”, that’s just assumed.", "Mum didn’t say anything about throwing one either though. So maybe she didn’t think she was the one who had to and that her daughter has friends/others who can\n\nESH but the daughter sounds like she was already getting resentful with her expectations and assumptions of another person before even asking her mum", "I do understand it- these are people who care more about their image and social standing in their respective communities rather than the actual people.\nShe threw it for sil because she’d get more praise for that. Throwing one for her own daughter that’s just assumed- she wouldn’t get any special accolades or praise for this so it doesn’t matter to her because she can’t use it to make herself look like the ‘good- insert-whatever-religion-here- woman.\n\nNTA- she’s free to hate the parties but if she’s throwing them for others and dragging you to others than any decent mother/soon-to-be grandmother would step up and make this sacrifice for their freaking child.\n\nThat being said I wouldn’t take one from her if she begged now.\n\nReach out to your close friends/family members/maybe even sil see if anyone wants to throw one.\n\nActually maybe don’t reach out to them- when they ask about one tell them we’ll I thought my mom was going to give me one but she’s not.\n\nI’d be pretty sure someone in your life would like to do this for you.", "OP is an adult. Most adults are capable of saying “mom, I’m giving this Christmas party (or whatever), you’re not talking me out of it, but you don’t have to come if you’d rather not”.", "Yes.", "Plus if she offered enough money to cover a shower’s expense money isn’t the issue here.", "I’ve hosted baby showers for work friends, we all loved it!", "Actually they’re not supposed to be hosted by family, they’re supposed to be hosted by close friends. \n\nEtiquette says you’re not allowed to go trolling for gifts for members of your family, even though it’s a special occasion, but it’s ok to do it for close friends. A lot of people ignore that now but some people still consider it tacky. \n\nWe always have baby showers at work.", "They aren't supposed to be hosted by family. Friends, yes; family, no. It's generally not considered appropriate for family to host parties at which gifts are expected to be given, because it looks greedy and like a gift-grab.", "I agree just as an example or thought.", "Yeah and also OP fails to realize that sometimes money needs to be saved or gathered or people are busy especially with the holidays and new year so may have to give her one later after baby is born, also if she just says she doesn’t know if anyone is planning anything maybe coworkers or friends will plan one for her. OP needs to realize she can be special and loved by others, not just by her Mom and family.", "Not expected. I do know a lot of coworkers though who throw baby showers though or other events for other coworkers. Not expected just saying there are others out there who can love and show love and care for OP, not just her Mom.", "The OP never said that her mother hosted numerous baby showers. She said she went to numerous baby showers with her mother. I'm of the impression that those were hosted by a different family member. \n\nAlso, the OP's mother should not be hosting a shower for her.  Showers are hosted by close friends or sometimes extended family members like an aunt or a cousin.", "My point was just cuz she did for SIL doesn’t mean she has to for OP my MIL hosted some events for my self and her son but didn’t for other biological kids or their spouses cuz their families or friends did. Why does it have to be on the Mom?", "It's the fact that it's her daughter that makes it an etiquette nono", "If my own mother had arranged and thrown a shower for my sister in law and then didn't want to for me, I'd be hurt. Not because I'm entitled to one, but because I would feel as though my mother saw me as less important. And from ops post, this isn't the first time her mother has done this. Sometimes it's not about entitlement.", "Not entitled, hurt! Her own mother threw other people including her daughter-in-law a baby shower, but yet doesn't want to throw one for her own daughter, that's kind of fucked up!", "She can still be loved on and feel special if someone else does it. I understand OP wants her mum to do so but other friends and family can and even after baby is born they can have a shower for OP doesn’t mean it’s less then or less loved. I am so confused.", "If I went to a babyshower that was thrown by the persons mother I would think \"oh they don't have any friends close enough to throw them one, that's sad\"", "I think we’ve found the actual assholes in the replies. OP—you’re not the asshole. Your mom sounds like she’s selfish and cruel toward you, her own daughter, but generous to everyone else. I’m very sorry. I would stop having expectations of her & search for other family members/friends for the kind of support. Best of luck to you the last weeks of your pregnancy & with motherhood. Take these lessons and be better to your children", "My sister and I were both butthurt my mom didn't offer to throw us showers, they were planned by close friends instead. Eventually one of us called her out on it and she said it was usually a mom thing...we googled it and she was correct and we ate crow but having other mommy issues still butthurt.\n\n \"According to tradition, baby showers should be hosted by a friend or distant relative (like a cousin or an aunt) instead of a close family member. This custom is believed to have developed in order to avoid the appearance that the family was simply on a mission to collect gifts\"", "Etiquette says? How extremely outdated. This isn’t the 50’s. Lol. Every baby shower I’ve ever been to in my life has been planned by the grandma-to-be. Your full of shit. Sorry.", "Thank you. I've been looking for this answer. After three years of etiquette classes, I can safely say -  It's considered bad form for a parent or other close family members to host a gift giving event. I was taught the only exception to this rule is a birthday party, as the main purpose is to celebrate the birthday person, not necessarily to exchange gifts.", "Ops mom never threw her a single birthday party growing up.", "I think that's a point of etiquette that's no longer seen as particularly valid outside of high society. It was about not making other people feel unkind if they weren't willing to come help the grandmother celebrate the new baby. (All etiquette guidelines are about other people's comfort.) We're no longer in an era where accepting an invitation to such an event is seen as a social obligation, people say no to such things all the time, and don't feel like they need to send a gift just because they were invited, which also used to be the norm for showers and weddings. They just say no and keep moving.", "How did my mother benefit from the gifts given to me for my child?", "I would like to upvote this several times, please!", "I read your AITAH post and I feel like you’re projecting your stepdaughters issues onto OP. There’s no other rational explanation for your rude comments bc you seem like a good person in your post.", "That’s so heartbreaking. I’m very introverted, but I still throw big parties for my littles…it’s not *about* me or my comfort level, it’s about my kids and making them happy.", "Apparently not. Makes me wonder if bro was the golden  child since his wife got a baby shower thrown by OPs mum. There has to be more to it for mum to do so much celebrating of everyone else but always neglecting her own daughter. It sounds like OP has been  Othered by her mum and that sucks.", "\"more about keeping up appearances than her own daughter's feelings\"\n\nThis could have been written about my mother as well--for different reasons. Both of them.\n\nProbably a lot of us. Le sigh.", "Considering she threw multiple parties for DIL but has *never* thrown so much as a birthday party for her own daughter, I think you're right.", "I think this is spot-on. Tho the mum in this scenario is much more on the bus with uplifting her image to her daughter in law unlike my narc egg donor, who talks shit and is openly cold to my golden child bro's wife.", "I want to stand up and applaud this comment.", "wish I could upvote this multiple times", "Traditional Emily Post-type etiquette does dictate that showers should be thrown voluntarily by close friends but never family so the shower is not interpreted as a gift grab. A (very white, very WASP-y, usually financially comfortable) subset of society still follows those rules -myself included! I generally hue pretty close to older etiquette when it comes to decisions about my own social life. \n\nBut that etiquette is definitely not universal or culturally sensitive since there are tons of variation on this, even within white American culture (eg Italian-Americans and Greek-Americans often throw showers for family)", "…..having a baby shower for your daughter in law but not your actual daughter is wild. And then to say she hoped her daughter would feel the same… yeah no", "Pardon me, then - the mother threw the one for her daughter-in-law, I don't blame OP for having the notion that she would be getting one, too.\n\nParticularly given that even attending baby showers on a regular basis in the first place was *because* of the mother.", "The mom mentions that she and an aunt were \"planning it together\", but given the immediate walk-back, I'm going to hazard a guess that that was a lie. No idea why.", "Where I live it would be SUPER tacky to throw yourself a shower. It should typically be a friend, aunt, sister, sister in law, or cousin though, not a mom.", "I mean... she even mentions that attending and holding baby showers specifically *with her mother* established those expectations. Would she have been better off clarifying before now? Yes. But I don't think having had those assumptions based off of her mother's previous behavior makes her TA.", "OP has every right to be resentful after what sounds like an entire lifetime of emotional neglect. I don’t think she’s actually an asshole for snapping and yelling at her mom after years of poor treatment.", "Sounds like mom likes to put on a face do for others even though she doesn't want too. Mom seems comfortable enough to neglect her daughter when it comes to special occasions, because she's immediate family. \n\nThere's nothing wrong asking someone in the family to help plan her daughter's baby shower if mom didn't want tom", "It would be seen to be in *very* poor taste to throw yourself a babyshower where I'm from, to the point where you're better off not celebrating at all ... and you're also not really suposed to ask someone to throw one for you either, so I understand why OP would be upset, especially since it seems OP's mother repeatedly has convinced her not to have any celebrations. (It's also so common that it's expected a pregnant person would be having a baby shower, so a lot of people might not initially know how to respond or just have an awkward, \"oh... ok\" to someone who isn't having a shower but also doesn't seem to have an aversion to showers).", ">Mum didn’t say anything about throwing one either though. \n\n  >She texted me on his behalf and said her and my aunt had been planning to do one.\n\nShe then called later and said \"nevermind I don't like them\". I understand that op could've handled it differently and not yelled or asked if aunt was still throwing one but mom is definitely TA", "It’s usually your closest family members who throw it. Normally your mom.", "This behavior started when she was a child. OP has never had a birthday party in her whole life, read her comments. Was she supposed to throw her own birthday parties?", "I’ve never been to a baby shower that was not hosted by family.", "Most of the showers I’ve been to have been hosted by family— usually a cousin, sibling, or aunt. It’s not usually hosted by a parent but I wouldn’t be bothered if it was. \n\nThe only thing I see as tacky is hosting your own shower, but even that’s acceptable in some circles (military couples for example).", "I've never had a baby shower at work or even heard of anyone having one at work before.", "That’s not even remotely true. Every shower I’ve been to was hosted by family.. I hosted my sisters baby shower.", "To repeat: \n\n\"Traditionally, close friends, cousins, aunts, sisters-in-law, or co-workers of the mother-to-be hosted baby showers. Because gifts are central to showers, having a member of the honoree's (or husband's) immediate family host appeared self-serving. Today it is appropriate for anyone to host a baby shower, as long as there's a legitimate reason. For example, some parents-to-be live far from their hometowns, and their mothers and siblings want to host a shower so that long-time friends can attend.\"\r  \n\r  \nhttps://emilypost.com/advice/baby-showers-who-hosts", ">they’re supposed to be hosted by close friends. \n\n\nI thought this is the etiquette too. 🤷🏻‍♀️", "That’s what I’ve always thought, family does not throw showers, friends do.  And you don’t ask for a shower.  Tacky.  It’s a gift grab.", "\"Traditionally, close friends, cousins, aunts, sisters-in-law, or co-workers of the mother-to-be hosted baby showers. Because gifts are central to showers, having a member of the honoree's (or husband's) immediate family host appeared self-serving. **Today it is appropriate for anyone to host a baby shower, as long as there's a legitimate reason.** For example, some parents-to-be live far from their hometowns, and their mothers and siblings want to host a shower so that long-time friends can attend.\"\n\n[https://emilypost.com/advice/baby-showers-who-hosts](https://emilypost.com/advice/baby-showers-who-hosts)", "I’ve literally never heard of that. My family throws showers. Usually expecting grandmas host", "Every one I've ever been to was done by family.", "This is traditional etiquette, but seems to be thrown by the wayside. Often it was aunts if it was a family only shower when I was young. And girlfriend's for a friend shower.", "I have never heard or experienced that", "I keep seeing posts about family throwing the shower,but I was taught it was a huge no no.", "Well took some time and numerous baby showers in the family for the mother to figure that one out, right?", "My cousin and mom threw my baby shower. Friends don’t normally throw baby showers", "Well I personally have never heard of co-workers doing something like that. Every baby shower I've ever been to was a big ordeal, usually held at a restaurant, or a hall, and it's all of their family and friends.", "Well, OP specifically wrote that she hosted a wedding and a baby shower for her daughter in law.", "Well, at the very least that she didn’t squelch the daughters expectations early on. And because of the reason she gave, not being into hosting baby showers - after having done that without fail for others in the family.", "Wouldn’t that also apply to the daughter-in-law? And why then leave the daughter under the impression that she would get one. Strange, no?", "Yeah I’m confused how OP is the AH and not her mother that is willing to accommodate and celebrate everyone but her own daughter. Crazy! Especially as it seems she’s never celebrated OP. \n\nAs usual in this sub, yes no one is obligated to do anything for anyone else but sometimes relationships and love demand us being obligated. OP is NTA.", "Some of these responses are wild\n\nThey'd have a point except they are ignoring straight that mom has done this for other people, including OP's SIL. This is OP's first child, too, not the 9th, as another person brought up their family \n\nIt is extremely unusual for the pregnant woman to throw her own baby shower. That is typically done by family/friends. Not to say OP can't, but I'm honestly wondering how many of these responses are people who went to baby showers or were involved in them ever (you can make your own conclusions there by what I mean). \n\nThey are also a huge thing for first children in particular because the presumption is the pregnant woman doesn't even have hand me downs. It is too reduce both financial and physical stress. Money is actually not equivalent because that means OP is spending time hunting down and buying products at late stage pregnancy, when they are most tired physically. Part of it is crowd sourcing resources for the birth\n\nThey are annoying to many. People put up with them because they have a very practical aspect for people you care about. The party part ends up being the thank you for the gifts. And, yes, they have meaning as well for the pregnant party who often want to share their excitement- especially for a first child.", "Maybe Mom is just over it. Or maybe OP expects a lot from family but doesn’t act or behave like family would. Maybe Mom is like SIL and I have a good relationship and she makes an effort etc? Maybe family dynamics were involved each time that are unknown to OP. Or maybe like so many people people are just tired or over it. OP could be a total terror to her Mom and family and she is like NOPE. Where is Ops partners family in all this and why haven’t they stepped up? Why does it have to be Ops Mom, why not her eager coworkers or her partners parents or family, or one of OPs friends?", "The other people didn't already know she hated them. Her daughter does. BUT her daughter doesn't care and would rather her mother be miserable than just ask someone else", "Where is your partners family in all this? Or the baby’s other parental figure? Why not a friend or other family member or a coworker why does it specifically have to be your Mom. She can still be a guest just doesn’t have to be involved.", "So...we're getting that what you actually want is a party celebrating YOU, not really about the kid. \n\nI'm thinking Mom knows she can't make you happy so she's not going to bother at this point.", "Baby showers are always optional.  As the pending parent, the responsibility for the supplies and needs fall to you. Maybe the fact that people aren’t leaping at the chance to throw you a shower is saying something?", "That’s so dumb. Ever think that maybe grandma-to-be’s are just excited for the arrival of their grandbaby and *want* to do it? Seems like a lot of you just come from shit families the way you all talk about someone’s mom throwing them a baby shower.", "**Everyones** mother is free to throw parties for other people **Nobodies** mother is obligated to throw one for them. That logic is very simple.", "Yes, the mom is also being an AH", "Emily Post says immediate family shouldn't throw the shower \"unless there is a legitimate reason\" (e.g., mother-to-be lives out of town).", "For sure! IMO, speaking from personal experience, OP may need to go low or no contact with her mom. Ever since I went no-contact with my mom, it’s like a weight has been lifted off my chest. It’s done wonders for my mental health.\n\nEdited to add: and of course her mom doesn’t have to do a baby shower for her. But consider this: people do things that they don’t enjoy for the people that they love. it speaks volumes that OP’s mom doesn’t do things like that for her but will do that for her SIL.", "This is a familiar dynamic to me and it is still painful 13 years later. My brother was the golden child but there also seemed to be too much confusion in her mind between her and me when it came time for me. She could go along with other people’s plans for my brother/sister-in-law but couldn’t overcome the self-loathing (that included me) to celebrate my event, or frankly, even step out of the way enough to let others do it. It was a confusing disappointing mess.", "She had a previous AITA about her brother….", "Do you think that maybe the SIL approached OP’s mom and nicely asked her to hold a shower? I think if OP had acted like an adult and gone to her mom and said “mom, I know you dislike baby showers, but I really would like to have one hosted by you. Would you please do it?”, mom probably would have hosted a shower, just as she did for SIL. But instead, she feels like she’s entitled to a shower and to treat mom like crap. If this is OP’s usual MO, no wonder mom didn’t want to host one.", "Yep, same here.", "Same. My godmother did mine, and only because my parents live far away and couldn’t physically attend. They did fund most of it though", "Aw that’s sad. I guess it depends on culture too. She could’ve brought it up with her cousins and aunts. I do still think it was childish for her to yell in the first conversation about it. She could’ve calmly told her mom that she is hurt and feels neglected. She didn’t handle the call or her emotions like an adult - I dont care if i get downvoted \n\nI read in the comment section about how weird it is for coworkers to throw a baby shower, but we had one just last week. It is not a corporate work place so we’re more friendly and less invasive to each other", "Yeah I started going to baby showers when I was 12. I would be deeply hurt and upset if after attending *dozens* of events for other people, no one could offer to return the favor.", "The question in hand is if she was TA for yelling. I would say yes. For getting upset, no. We don’t know much about the “poor treatment” or the changes in the mum’s living configuration", "That’s my big issue here. After being expected to throw a shower for her DIL and following through with it, she can’t feign ignorance that her own daughter was at least hoping she’d get one. Instead of being honest, she decided she would just never say anything and hope nothing happens? Then when OP asked she lied and said they’d been planning it all along. So now OP is relieved she doesn’t have to scramble a party together at the last minute because her mom isn’t inconsiderate after all. Wait nope, mom pulls the carpet out and says actually nothing has been planned and here, **I’ll pay you to not have even have a shower because I can’t stand the thought of going**. I can try to understand why she thought that was a good offer, but it was entirely inconsiderate to her daughter’s feelings. I’d feel better if she’d offered to pay *for the party* and asked that aunt or someone take over the planning part.", "My mom wouldn’t host mine because it’s “bad luck” (ashkenazi superstition) so she had her friends/our neighbors throw it for me. And I know her friends hosted her baby shower when she was pregnant with my brother.", "So?  Doesn’t mean it’s right.  \nFamily aren’t supposed to host because that just looks like a gift grab.", "This happens? Hosting your own shower? You know what - I’m sure military couples need all the help they can get!\n\nI think cousins can also fall into the “close friends” category. \n\nI think, eh, it’s a baby, people are happy. Let’s all get together with gifts to support the new mum.  I don’t believe most people are all that judgemental about it - and I’m not either - but I’m just saying that technically it’s not the job of the new grandmother to host the shower.", "They're not really showers. Cake is purchased, maybe some decorations and an envelope is sent around to collect money and a card with signatures. If there are creative people on your team maybe a diaper cake will be made. It's a lot more low effort and usually happens during the lunch hour.", "I've been to two at work, but there have been a ton more for people I didn't personally work with. Might just depend on the culture of the company.", "Actually, this etiquette rule is true, at least historically. Of course, times change. \n\nPersonally, I don’t care who hosts, family or friends, but traditionally it is considered against etiquette for the family to host, IF you are a stickler for such things.", "Historical etiquette is that the mom of the mom to be should not be hosting the shower. So this absolutely should not be falling on her automatically honestly. Why can’t the aunt host instead?", "It is completely true.   Immediate family don’t host them so it doesn’t come off like a gift grab.", "If the family doesn't throw the shower, who is supposed to?", "The ones I have been to have been coworkers homes, the break room etc. nothing Hugeish but we all brought gifts, played games, ate food usually potluck style and ate cake.", "Yeah definitely something else going on. Personally if Mom offered the money like Op said I would take it and be done with her.", "Very strange. I think Op is ok to be upset but I also think that she needs to try to see other perspectives as well and realize others can do what her Mom can, and that it shouldn’t just be on Mom. As I mentioned upthread a comment or two my MIL gave me a shower or two one for engagement and one bridal but then didn’t give her biological daughter one nor her other DILs cuz friends or the spouses/partners families did. I don’t think my MIL even gave any of us baby showers. I could be misremembering if she did or not, because the families of partners/spouses did or friends did. So long ago. My kids are almost grown. And I have been married 20 yrs.", "No, DIL is not the same as daughter. \n\nThere is nothing that indicates that the mom ever promised or even hinted she'd throw a shower.", "And her mom is lying by saying she was hoping OP would feel the same. She KNEW OP wanted one because OP told her dad, and then mom told her that she was planning one with the aunt. Like damn of course she was disappointed lol.", "Some of the comments are baffling.", "So many people creating random scenarios to explain the mom’s behaviour. It’s weird that people will be so convinced an OP is lying that they make a whole side for the other person 😂", "I can’t agree more- OP, I am BAFFLED by these comments and can’t help but wonder where everyone is from and who has had kids/friends and family with kids. Women never throw their own baby showers unless they have specified that they would rather do so, and it’s EXTREMELY common for family to host. \nHer mother has hosted and thrown parties for others, and this is her own daughter’s first child. That is so heartbreaking, and you have every right to be upset and hurt. \nIf mom can suck it up for others, mom can suck it up for you and her future grandchild. \nAdditionally, I’ve seen quite a few people say it’s “not considered good etiquette” to ask someone to host a shower, and OP didn’t. She waited until people started asking her if there was going to be one, expecting (rightfully so) that her own mother would want to host one after through the SIL a shower. \nThe people who don’t think the mother is the AH are wild. The mom is being so selfish and honestly just cruel.", "Why would her mom tell her she was planning one with her aunt and then go back to her and say “actually I don’t want to lol how about I give you some cash” if all that was true? And idk nothing in the context implies OP expects a ton from her family or is a terror so it would be pretty dumb for me to assume that. Maybe OP stole all her moms socks and hid them around the house and covered her floor with cooking oil too. Maybe she brought a family of wild bunnies in and created a colony 🤪", "Why not both? She should goto therapy to deal with her shitty mom, and her shitty mom should hear how she feels", "After 30 years of her parents not even celebrating her birthday even once, of course she wants a party celebrating her. Who wouldn’t want that? It was naive of her to expect it, but it doesn’t make her an arsehole.\n\nIt feels like it would actually be super easy for her mum to please her. For the first time in OP’s life, her mum could put her daughter’s feelings above her own and idk, throw her a damn party?", "I do think they are excited, and that's why they come to the shower thrown by the friends.", "Nice job there, pick me.  Her mom gains the validation of others by putting in the bare minimum effort but can’t do shit for her own daughter.  She should be cut off from her grandchild", "Yes…THIS", "This is the whole paragraph we both seem to be referring to:\n\nTraditionally, close friends, cousins, aunts, sisters-in-law, or coworkers of the mother-to-be hosted baby showers.   Because gifts are central to showers, hosting by a member of the honoree's (or husband's) immediate family appeared self-serving. Today it is appropriate for anyone to host a baby shower as long as there's a legitimate reason. For example, some parents-to-be live far from their hometowns, and their mothers and siblings want to host a shower so that longtime friends can attend.\n\nThat certainly doesn’t communicate that family hosting a shower is rude or not proper etiquette.", "And it’s a legitimate, and even considerate, reason that you do not wish to inconvenience anyone you aren’t as close to by asking them to organize an important event for you. Nowadays people are so busy, nobody who isn’t really close to you is going to throw you a shower except in rare circumstances.", "https://www.reddit.com/r/AmItheAsshole/s/ke1XgKMnxY\n\nFound it, it's been deleted but saved in the comments.\n\nIs it just me or does OP sound lonely.", "It sounds like OP has built up a lot of resentment over not getting to do \"normal\" celebrations in their region. Add on pregnancy and leaving the baby shower organisation til the last minute, I can kinda relate and understand her being upset. \n\n  There are parts of the US where apparently you have to have someone else throw you a baby shower and asking is rude/tacky. It's kinda awful. What if no one has time or they all think someone else will do it?\n\n  But yeah, having a meltdown over the phone is pretty immature. I'd go ESH, maybe the mum a little more for not wanting to do any kind of celebration for their daughter.", "Yeah when you move every 2-3 years your friend group gets spread out and you’re probably far away from family. You have a local friend group but maybe not someone who is close enough to drop a couple hundred bucks and a lot of energy on a fancy shower. I’ve been to a few and it’s usually more of a mixed-gender cookout with a few presents.", "Yeah, that's just so weird! I've never heard of that. Every baby shower I've ever been to is a big ordeal. They're usually held at a restaurant, or a hall and all their family and friends are there.\n\nDefinitely not something I would expect a co-worker to be responsible for.", "Historically? Baby shower parties like this started less than a century ago. Etiquette rules about them are fundamentally modern - mostly still more trend than anything, certainly not “tradition”.", "I’ve never in my life heard this before this Reddit post. Times are changing.", "Friends, more distant family, but not immediate family.\n\nI got a bridal shower from sil.  Another from my mil since we were visiting from a different state.  \n\n\nI got baby showers from friends and other military wives association.  \n\n\nI was always told it was tacky and appeared like family was asking for gifts if it was held by my sisters or mom. They could help with expenses, but could not be the official host or have it in their home.  \n\n\nShrug. Traditions change.  Showers back then were very humble.  You also only got one baby shower, even if you had more kids.  Now it seems people have a baby shower/celebration for each kid.", "Well, given that daughter was adamant about expecting it, at the very least mother and daughter don’t communicate well 🤷.", "Good and valid points. Thanks for this perspective. Lol 😂", "Holy shit, if you actually think this you need serious therapy. That's not how any of this works. Holy shit dude.", "You sound insufferable, I don’t know how you’re bringing a child into the world having such extreme reactions to small things such as this.", ">How could one have high expectations if there was never an opportunity to have a damn expectation?!\n\nWell clearly you do?!", "THIS. These replies are insane acting like OP is an asshole for expecting her mom to do something so many moms happily do. I think OP has only been an asshole to herself for expecting her mom to ever behave like a mother should.", "Yess", "Yeah that's way bigger than any work baby shower I've heard of. The work baby shower is like the birthday cake at the office equivalent. A meeting with some small gifts and small refreshments. It's also a \"temporary goodbye\" party too, since normally the mom is about to go on leave too.", "She had hopes, and once again, for the hundredth time in her life, her mum crushed them.", "From my experience, there's showers by coworkers and showers from family. You'd never invite family to the office shower.", "I'm sure your mom screwed up raising you. A lot of parents do. I'm asking this because I'm genuinely curious and not because I'm trying to make you feel bad. \n\nWhy did you expect your mother to act different than how she usually does? What kind of conversations did you have with your mother about the baby shower?", "But you aren’t a social outcast you have coworkers and they seem eager to help so tell them no one is and maybe one will offer to throw you one? You have no friends?", "Please read what you wrote. You are saying you feel like a social outcast because your mom doesn’t want you to throw you a baby shower.  Clearly your mom isn’t the type of mom you want, sucks but it is what it is.  Expecting her to be fake to spare your feelings? K. \n\nWhat about your MIL? Or SIL? Someone else in your life that fits your ideal.", "You sound like an absolutely miserable person who expects or from the sound of this, demands others to do as you wish. You need serious help. Unfortunately, you're child will suffer because you're such a narcissist. Wish I didn't read your post, but you're a huge AH.", "LOL, you do realize what you're saying is Hey mom, I don't care how you feel or what you want. I want a party in my honor and to be the center of attention. So shut up and make me happy.\n\nNarcissistic Much?", "Exactly, showers at work are usually tiny and you’re lucky if everyone has a couple minutes to eat a piece of cake before they run back to keep on working. They’re a nice gesture but I don’t think your family and friends are all coming to your break room with presents.", "You’re asking the woman whose parents haven’t thrown her even a single birthday in her entire life why *she* can’t compromise? Are you being serious??\n\nOP has compromised her entire fucking life. Yet her mum was able to put her feelings aside for her DIL twice, but is unable and unwilling to do the same for her daughter.\n\nThese comments are truly astounding", "The post says she declined her mother's reluctant offer."]}