{"id": 32308, "submission_id": "18a8jcb", "title": "AITA for not forgiving high school bullies", "selftext": "I (24f) have never fitted into a classic girly mould (drama, tomboy, academia kid) and, although I ended up in an artsy school eventually, attended an all girls school initially.\n\nI’ve always been a bit of a tomboy and so when I finally made my first female friend around 11yrs old I decided to follow them to an all girls school… big mistake..\nWe ended up in different classes and she ended up in what I would call the “cool girl group” where I didn’t really click with anyone in my class. Don’t get me wrong I did make friends they were just in other classes.. anyway… the girls in my class took offence from my tomboy non make up approach to life (no shade to make up gals, it’s just not me) and started to single me out. It kept scaling up and up until one day while we were waiting for the teacher they were, movie bully style, standing in a circle around me chanting names, pointing and laughing as I started to cry. Needless to say I left the next year.\n\nI ran into a couple of these girls later as an adult and one of them apologised to me for how they treated me, fully expecting me to brush it off and make her feel better. Another said that she never said anything just that the others were her friends but she was sorry now. I told them I didn’t forgive them and left. I’ve heard from a couple mutual friends that I acted like a child and should just grow up and forgive them.\n\nIdk though, I was miserable for a whole year because of them but am I just holding onto the past?\n\nAITA for not forgiving highschool bullies as an adult?", "created_utc": 1701651936, "permalink": "/r/AmItheAsshole/comments/18a8jcb/aita_for_not_forgiving_high_school_bullies/", "score": 31, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Didn’t forgive high school bullies when they apologised as adults. Was accused of being petty and childish for this which makes me think maybe I was wrong..\nYeah this is a low level Ahole post, I know, but just wanting to get input from others 🙃\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\nBullying is bullying, they tore you down for their own gratification, whether it was your looks, your interests or whatever.\nIf I encountered any of my teen years bullies in adult life I wouldn't go out of my way to get my own back on them, nor would I do anything to help them out either - my indifference to them is what they earned themselves.", "NTA. This was an interaction with someone who is essentially a stranger to you now and you don't owe them anything.", "NTA. They are not entitled to forgiveness. You can easily move on but you don't have to forgive them. And fuck those friends telling you to \"grow up.\" They obviously have never been bullied before and do not get a say in whether you should forgive them. I'd cut those friends out for saying shit like that.\n\nAgain, NTA.", "You said that they expected you to forgive them to make them feel better. Doesn't sound like the right reason to me. You're entitled to your emotions and to decide whether or not to forgive them, so NTA.", "NTA obviously. I question these “mutual friends” reaction, though.", "NTA. Get better friends.", "NTA. No one is entitled to your forgiveness. \nIgnore them.", "Bullies don't deserve any forgiveness.\n\nNTA", "NTA. Awful people generally want absolution, not forgiveness.", "NTA. Nope, not one bit. You owe those trolls nothing. I’m 34 and still hurt from the mental gymnastics I endured. My mother is 69 and still has bad flashbacks to the nasty women who tormented her.\n\nDespite what bullies may think, there is no statute of limitations on being a dick. One can apologize all they wish, but we are under no obligation to accept. As long as we handle ourselves with proper decorum, they can kick rocks.", "NTA. You are never obligated to forgive a bully, especially ones that were seemingly doing it only to make themselves feel better. Even while apologising, one of them was still denying ever having done anything to you. They're still only thinking of themselves rather than what you as their victim deserve and need and these 'mutual friends' clearing don't understand or care about the impact bullying can have. They are just trying to force you to be 'the bigger person' because it is easier for them.", "Something similar recently happened to me. Your bullies never said anything to make you feel good (the complete opposite actually), and now they expect you to say that you forgive them so they can feel good about themselves??? F these people and F bullies. Definitely NTA", "Don't forgive them.  Tell them they're evil assholes and horrible human beings, and a waste of skin. Grin while you say this. Laugh. Ask for a strand of their hair so you can make voodoo dolls of them.  When done, wish them a nice day. Tell the mutual friends the same thing. \n\nNTA \n\nAt all.", "Im 42, and I still have not - and never will - forgive my high school bullies.\n\nHell, I openly celebrated when one of them died.\n\nNTA", "No if you don’t feel that forgiveness is necessary or worth it then DON’T! Forget about them if you can. Waste no more time on those who aren’t worth it.", "You should know forgiving is often more about releasing the bully’s power over you than anything else. Forgetting (as in not holding it on them, like you seem to be) is something else, and should be taken on case by case basis. The good news is one of the girls seems genuinely sorry, and another wishes she wasn’t there, but that doesn’t mean you should be nice/socialize/or let them off the hook. I can’t pass judgement on cases like these, but can ask you one question-would you rather have those girls experience what you did (and the lasting trauma), or would you prefer they were just always casual with you. Cause if it’s the latter, you maybe already moved on", "Anyone can ask for forgiveness, but no one is entitled to it - you forgive someone if it makes **you** feel better, not because it makes **them** feel better.\n\nThe fact that they are apparently still trashing you shows you that they haven't changed at all - they're still toxic A Hs, and completely undeserving of the slightest consideration or thought.\n\nNTA.", "Not judging either way - but forgiveness is for you not them really. \n\nForgiveness shows that you have processed the situation and moved on living your best life, not leaving them free real estate in your head.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (24f) have never fitted into a classic girly mould (drama, tomboy, academia kid) and, although I ended up in an artsy school eventually, attended an all girls school initially.\n\nI’ve always been a bit of a tomboy and so when I finally made my first female friend around 11yrs old I decided to follow them to an all girls school… big mistake..\nWe ended up in different classes and she ended up in what I would call the “cool girl group” where I didn’t really click with anyone in my class. Don’t get me wrong I did make friends they were just in other classes.. anyway… the girls in my class took offence from my tomboy non make up approach to life (no shade to make up gals, it’s just not me) and started to single me out. It kept scaling up and up until one day while we were waiting for the teacher they were, movie bully style, standing in a circle around me chanting names, pointing and laughing as I started to cry. Needless to say I left the next year.\n\nI ran into a couple of these girls later as an adult and one of them apologised to me for how they treated me, fully expecting me to brush it off and make her feel better. Another said that she never said anything just that the others were her friends but she was sorry now. I told them I didn’t forgive them and left. I’ve heard from a couple mutual friends that I acted like a child and should just grow up and forgive them.\n\nIdk though, I was miserable for a whole year because of them but am I just holding onto the past?\n\nAITA for not forgiving highschool bullies as an adult?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA \n\nThose things are still bullies and AH.", "Nta. Forgiveness is NOT a right", "NTA. They have done nothing to show they really mean the apology. You owe them no forgiveness", "A couple of my old bullies hang out at a convenient store near my house. I make it a point to stop there just to gloat. Sometimes I'll give them change and sometimes I don't.", "NTA.\n\nSome friends they are.", "Same here.  I’m 43 and my childhood bully was my school principal a very wicked nun.  Tormented me for years.  She’s dead now and I know where her gravesite is but frankly just too busy to pay her a visit to pay my respect after I down a big bottle of water beforehand.\n\nWhat’s good is that I did let her know of my feelings towards her when I was an adult in my mid 20s.  A classmate of mine had gotten married and his parents decided to invite her to his wedding.  It was me and several other of my classmates who showed up as guests and we all completely snubbed her.  None of us came by to talk to her, we gave her a quick glance and just moved on and treated her like a complete stranger.  \n\nI have no doubt she’s burning in hell for the behavior and horrible things she did as someone in her position and authority and to children no less.", "That's the spirit!"]}