{"id": 32329, "submission_id": "18an6gd", "title": "AITA for locking my husband out of our bedroom because he came home late?", "selftext": "I’m a light sleeper so the smallest sound wakes me up and it takes me forever to fall back asleep. My husband knows this and it’s been a big issue recently where he’ll come home late and then wake me up as he’s getting ready for bed. I’ve asked him multiple times to sleep in a different room if he’s back after midnight but he refuses to.\n\nYesterday I decided to lock our bedroom door so he would get the hint and sleep somewhere else. I warned him beforehand that if he wasn’t home by a certain time I would lock the door so it’s not like I did it out of nowhere. When he realised the door was locked he knocked a few times loudly which woke me up but I pretended I couldn’t hear him and I ignored him when he said he knew I was awake and he told me to open the door. Eventually he gave up and slept in a guest room.  \n\nThis morning he was giving me the cold shoulder and he said he should remove the lock from the bedroom over this. I didn’t say anything originally since I could see he was angry but then he asked me if I had something to say to him and I said no, so he told me to try saying sorry so I told him I wasn’t. He left the room after that and I haven’t tried speaking to him since as I know he’s still mad at me.\n\nAITA?", "created_utc": 1701705412, "permalink": "/r/AmItheAsshole/comments/18an6gd/aita_for_locking_my_husband_out_of_our_bedroom/", "score": 281, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I locked my husband out of our bedroom. I pretended to be asleep when he knocked on the door instead of opening it for him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "soft NTA with info in OP’s comment that he is coming back from hanging out with friends / family, where he could leave at any time without repercussions. \n\nNTA because you tried other solutions (asking him to sleep in another room), and he refused them. you told him what the consequence would be if he stayed out late, then you enforced that boundary. there’s nothing wrong with that bc he blatantly disregarded your requests and he was informed what would happen.\n\nHowever, this isn’t going to resolve the problem - you two clearly need to sit down and discuss a solution that works for both of you, which may be you sleeping in another room instead like some have mentioned. This requires him actually caring about your frustration though, and it seems like he doesn’t.", "INFO: where is he coming home from? something he could choose to leave earlier, or an obligation, like work?", "I was all set to call you the AH for locking your adult husband out of the bedroom instead of sleeping in the guest room yourself. Then I read that he follows you there when you do. \n\nNTA. This goes beyond who sleeps where, this is some weird powerplay on his part or something. He’s a problem.", "NTA\n\nFrom your other comments: It's mostly him spending time with his friends and family so he can leave earlier\n\nHe's not coming home from work late.  He's out partying/socializing until after midnight and waking you up every evening.  He can sleep in another room.  This is the consequence of his choices.", "NTA sleep is vital and anyone who jeopardizes your sleep for silliness is inconsiderate and could care less about your recovery. He needs to get to bed, abide by bedtime rules and thank God he has a guest bed and not the couch.", "NTA but your marriage sounds fucked", "NTA\n\nIt's possible he really doesn't get the light sleep thing. But it's a lot more likely that he's an entitled AH. A lot of guys think that marriage - or any kind of committed relationship - means they own the rights to your body. Meanwhile, sleep is about as central to health as it gets. I would really recommend counseling. There's a major disconnect here, and he's not listening.\n\nMy ex used to do this. (Though in his case, it was staying up late playing video games.) Then he escalated to trying to have sex with me, and trying to tell me that since we were married, I couldn't legally say no. It didn't end well for him - I'm both a martial artist and quite aware of the marital rape laws, though I kept saying not and pushing him off and he kept escalating until I grabbed his junk, and explained I would twist it off and shove it down his throat. But it was pretty gross and awful all the same - especially where he whined incessantly because OMG, I used the word rape in bed. (Which apparently is far worse than him attempting to rape me.)", "NTA. And you all know why? Because light sleepers can't help it. You can't just change that. She told him multiple times if it's after midnight please don't wake me up. He doesn't need his teddy bear every night to sleep but she does need peace and quiet. They literally have a made up guest room as well that I'm pretty sure he can customize to his comfort level since they own the house. See I think most people are putting YTA because they're thinking of this in terms of every night, it's not, if he gets home late then just don't wake your wife up, be polite, that's it. It's not really that big of an issue, have a little courtesy for your spouse.", "[removed]", "NTA, based on the comments that he is out with friends and could leave any time, and that if you tried to sleep in the guest room he would just follow you in there. \n\nYou completely have a right to undisturbed sleep, and the fact that he seems completely insistent on disrupting your sleep is concerning. You definitely need to sit down and talk and clearly establish this boundary.", "NTA, he knows you’re a light sleeper, you warned him, he disrespected your needs anyway, so he gets consequences.", "Just want to point out here that while a lot of people cannot see it because they may not have been on the receiving end of it, this kind of seemingly \"innocuous\" thing is actually abuse on the part of the husband.  It is not about him wanting to sleep in his room, it is about him getting what he wants when he wants it.  He has no respect for OP at all, he doesn't care about her needs and this marriage is probably going to get worse.  People like OPs husband will play victim and be all \"she locked me out boo hoo\" but actually it's them who are the issue - it's why he follows her into the guest room, and bangs on the door of the bedroom despite being told multiple times that he is disturbing her.  It is basically his entitlement over her that is the issue here, she is just trying to set a boundary after speaking with him several times, being ignored and being left unheard and having to deal with his ongoing trampling over her wishes.  I hope OP leaves.\n\nSorry for all those that don't recognise this for what it is, but it is crystal clear to me.", "NTA bc you’ve asked a few times and he’s ignoring you.", "[removed]", "NTA. But I hope you know that these issues are bigger than keeping you up. \nHe is not respecting your boundaries. Threating you like a child to take the lock, socializing without you until passed mid night, etc.  And that is just in the surface...  you need counseling and soon.", "NTA, I’ve dealt with my husband doing the same thing except he would just stay up too late playing games the night before I had to work. I’m talking I have to get up at 3:20am to get out daughter and myself ready so I could drop her off at my parents’ before I have to at work at 5am, and he wouldn’t be in bed until midnight or later. We sat down and had a conversation about it though (he just loses track of time and now he sets an alarm) and now he’s improved but if he tried the same shit your husband did I would have locked the door too.", "NTA\n\nSounds like he has access to perfectly good alternatives that would solve this. I would just move into the guest room, lock that door. Skip the argument about him moving to that room, because I doubt that will go anywhere.\n\nI don't think you should be the one to move, but he is deliberately interfering with your ability to sleep and in the short term you need to prioritize having that freedom. Figure out where his priorities lie in terms of being in the same room together.", "NTA. He’s inconsiderate of your need for sleep so he deserves to sleep in the guest room. He was incredibly rude and you made your stance clear.", "INFO - Why is he coming home after midnight?", "I had a problem sleeping with my partner too. The problem was snoring and sometimes also coming back late. At first i started sleeping in different room, he wasn't happy with it  but accepted, after maybe a month  he bought me stoppers and asked if i would try it. I agreed and sińce then we're both happily sleeping together. You're NTA. He is. Looks to me he is trying to prove something or it's Just about controlling you. Im so sorry for you. Stoppers is not the answer to your problem which isnt light sleeping but TA partner :(", "NTA.  He clearly doesn’t care about your needs which is a bigger problem than a locked door.", "Okay I was gonna. Say Y.  t.  A.   But you said he follows you into the guess room if you sleep there? The fuck? Why?\n\n\nNTA. Either dump him or talk to him until he fixes his attitude.", "You are most definitely NTA.  He's a huge jerk.  At the very least you can't convince me that he couldn't try much harder not to disturb you, but really he should be sleeping in the guest room if he's out late with his buddies partying.  And he wants YOU to apologize?  Please.", "ESH.", "NTA. He is behaving abusively, by knowingly doing something which affects your health (even if you sleep in the guest room yourself), and threatening to remove the bedroom lock. Marrying you does not give him automatic 24/7 access to your body.", "Nta you literally told him this would happen. What did he expect", "It isn't about him getting into bed its the dropping shoes,, clacking doors, turning on lights, all the things one does getting ready for bed, and doubtless he will do them longer & louder bc he's an entitled AH", "NTA\n\nAt the very least he doesn't care about you.\nAt the worst, he's a controlling abuser and you probably suffer harm in other ways as well.", "NTA\n\ni am a light sleeper as well. and some sounds bother me like snoring or my neighbour noise ( i think it calls it music ).   \nunfortuanaly, the only solution was i and my partner sleep in separate rooms. because two things would happen: me waking him up because he is snoring or me waking up tired in the morning and upset with my partner.   \n\n\ni tell you, it hurts me from inside when i have a nightmare being alone.  \n\n\nanyway. you tried to reach an agreement with your husband and he did not respect it. you were obligated to take measures in order to make yourself heard.   \n\n\nas you mentioned, you were awake when he started to knock on the bedroom order. you did well!", "NTA. Husband sounds like an abuser. If he's not physical yet, he could become physical. Definitely seems emotionally abusive at this stage, not just inconsiderate. I'd be looking for a divorce lawyer at this point.", "NTA - you have asked several times and he has refused to be respectful and sleep in a guest room.   He's also ignored your warning that you'd lock the door and banged on the door to wake you up.  Zero respect for you.", "NTA", "NTA but this isn’t going to fix the problem and you need to talk to him to understand what his issue is here because he’s just failing to respect a perfectly reasonable boundary", "NTA", "I swear to God, why is it everytime I see a AITA post, its always some drama with spouses and \"I do this all the time and he/she knows this, yet they do the opposite of what I want\" \n\nEverytime these posts are clockwork and it feels highly unbelivable\n\nJust a rant, NTA btw", "NTA. He is beyond inconsiderate and moved towards insidious. If you sleep in the guest room and he follows you to disturb you there, then you know it's intentional and not about him not being allowed in his room. \n\nHe sounds abusive.", "Nice marriage!", "NTA Your husband doesn't respect you or your need for sleep. Why are you still with him?", "NTA. I don't understand how people torture themselves like this. Sleep deprivation is torture. If your husband is torturing you, then you should move into another bedroom to sleep. You don't have to sleep in the same bed to have a good marriage. But you certainly won't have a good marriage when you're sleep deprived and your husband is indignant about it and seems to wake you up on purpose. Move into the guest room. This isn't a 'differences' issue, it's a health issue.\n\n  \n\\*Edit- I didn't see that he'll follow you around if you try to sleep in a separate area to continue to disturb your sleep. This is outright abuse OP and it's a control tactic. You're not safe. This is only going to escalate. I can't image what else he's doing to you in this marriage.", "NTA. Sleep is sacred and he should know how his behaviour impacts your sleep negatively.", "NTA —-DELETE THE HUSBAND ASAP.", "[deleted]", "If he was being loud or obnoxious I may side with you, but it sounds like he is just doing normal things, like quietly getting ready to sleep in his own bed. If you're that bothered then you could go sleep in the guest room.\n\nEDIT: It seems like the OP has supplied additional information that means this would be unworkable, and though I am not a huge fan of changing my vote with additional information since it feels like posters \"curate\" their answers to make themselves look better I'll delete mine as I've been asked to edit.", "ESH\n\nHe should be more considerate in staying in the guest room when he gets home late. \n\nBut locking someone out of their own bedroom is not okay. These are just not decisions you get to unilaterally make because you’re a light sleeper. You could elect to sleep in the guest room when you know he’ll be out late, or use earplugs. There are solutions to this that aren’t outright hostility to your spouse.", "NTA. Sleep is crucial, quality sleep = physical health and functioning brain. What he's doing is beyond inconsiderate or rude. It could be thought of as a type of sabotage or abuse. But really, it concerns me as a sort of kind of controlling behavior that ends very, very badly. This is him not caring about your needs or boundaries and loudly (Literally, figuratively) letting you know that he'll do whatever he wants to you and you have no say in it. Not great.", "NTA. People underestimate how detrimental it is for sleep to constantly be broken like this - if he’s doing this deliberately it can actually be a form of abuse. You told him several times what you were going to do and you followed through. \n\nThis is where separate bedrooms is king. The only issue is you need a partner that understands/cares and agrees, and you don’t have that.", "E.S.H., you should move to the guest bedroom if you have abnormal sensitivity to being woken up though.  \n\n\nEdit - NTA", "Your husband sounds like a creep. Remove the lock? So your sleep doesn't matter. Only his ability to do whatever he wants at your expense even though there are other viable options.\n\nNTA. But you might be T A if you don't stand up for yourself in this marriage.", "The Reddit psychologists calling him an abuser and calling for a divorce are unhinged.", "YTA.  You are the person with the issue.  You should be the one sleeping in the guest room.", "You should move into the guest room to make things easier.", "ESH. \n\nHe’s an AH for not caring about your sleeping problems and being inconsiderate. But you’re the AH for locking him out of his own bedroom and pretending to be asleep when he tried to come in. At the very least you could have let him in after he knocked a few times and still made your point. You didn’t even let him get his pyjamas. It sounds like he was just getting ready for bed like normal, there’s no mention of him being drunk and loud, or fumbling all over the place.\n\nYou basically gave him a curfew for his own bedroom.", "YTA.  Picture if he banned you from your room bc he was trying to teach you a lesson - not so cute anymore is it?", "Info: what is he doing out late? Is he working? Does he go out drinking several days per week? That seems like the issue that you’re having. Why don’t you go sleep in the guest bedroom and lock the door? Or if he’s out drinking every night, just divorce him.", "ESH. I sympathise with the light sleep issue but locking the door isn’t a good idea if he’s going to knock and wake you. Then you lie awake annoyed.", ">Yesterday I decided to lock our bedroom door so he would get the hint and sleep somewhere else. I warned him beforehand that if he wasn’t home by a certain time I would lock the door so it’s not like I did it out of nowhere. When he realised the door was locked he knocked a few times loudly which woke me up but I pretended I couldn’t hear him and I ignored him when he said he knew I was awake and he told me to open the door. Eventually he gave up and slept in a guest room.\n\n&#x200B;\n\nYTA", "ESH. there is a special place in hell for people who wake people up, but i assume the master bedroom connects to the master bathroom and closet where all his clothes and toiletries are? its pretty obvious he would need to get in there to get ready for bed, so you were just setting up a conflict by locking him out. you guys have a whole guest room, i dont see why you couldnt sleep in there if you are the one with the sleeping issues.", "[deleted]", "Have you tried sleeping with a sound machine so that your body is kinda of used to sleeping with noises going on? I also find with a sound machine or just a fan blowing next to me I don’t hear as much going on outside the room or even on the other side of the bedroom", "ESH- It feels like this is the worst possible solution to YOUR problem. It sucks to say but being a light sleeper is your own personal problem. Now, as your husband he should be considerate of you, but also, that’s pretty shitty to be given a curfew by your wife and punished like he is some teenager that snuck out at night. \n\nI think you need to have a more serious conversation with him about:\n\nA) His consideration for your sleep schedule. \n\nB) His needs to be out with friends and family so late. \n\nC) Your needs when it comes to sleep.\n\nD) Solutions you BOTH can agree on. \n\nAlso, I think there are other less volatile solutions to your problem. Melatonin is one. Going to a doctor is another. Sleeping in a separate room. Noise cancelling headphones. Sleep training. Etc. \n\nAgain, while your husband should be supportive of you, I don’t think it’s fair to have it be his responsibility to walk on eggshells around you for something as mundane (yet necessary) as sleep. You’re going to need to sleep every night for the rest of your life, and your rules are basically saying that for the rest of his life he will have a curfew.", "YTA...It's his bedroom too, locking him out is childish. Giving him a curfew of what time he has to be back to have access to his room is absurd. Wear earplugs or go sleep in the guest room.", "NTA. I would give up if I was him. So what if he needs to sleep elsewhere if he chooses to stay up later than you. He'd also have a chance to spend some me-time if he wants so why is he complaining?", "YTA for locking the bedroom, for a few reasons but one you might not have thought about. Ever thought of the possibility the locked door could make him think something had happened to you, or you could be hiding something from him?\n\nESH if he was coming home from partying or something like that. If he was coming home from work then I think YHA", "100% YTA\n\nWhat kind of behaviour is this? You are both grown adults. There are other solutions to take into consideration. You could use earplugs, he could take more care when entering the room etc.\n\nLocking him out of the room is very childish and you 100% deserved the cold shoulder.", "YTA. Use earplugs.", "YTA Grow up", "YTA. Why don't you sleep in the guest room if you know he's coming back late? I'm just saying that both of your stuff is probably in your bedroom and he needs to get ready for bed (unless the door is locked apparently), so why not sleep in the guest room where he won't disturb you?", "Yta,  it’s his room as much as yours,  you don’t just get to make arbitrary rules.     You are the one with the issue,  he shouldn’t need to change his behaviour to accommodate your light sleeping \n\nYou should have slept in the guest room \n\nYou guys need to work on communication, doesn’t sound like either one of you are offering productive, respectful compromises", "NTA - kick out this BUM, OP. Need to find a real man who can appreciate you, worship the ground you walk on.\n\nLock him out of your bedroom AND your life.", "YTA. Either this is becoming more and more a marriage consultation sub or it’s just people who can’t come to terms with the truth", "ESH - Locking the door didn't stop you from being woke up did it? No, you still got woken up. And then you were childish and still wouldn't unlock the door so he could sleep in his own bed even though you were awake, so I wouldn't be talking to your petty ass either. And IDK if you've tried to compromise by say wearing ear/plugs.  However, you've asked him to either be back by a certain time or sleep in the guestroom, and he's not compromising by doing that either.", "YTA\n\nYou sound more like a boarding school principal than a wife. Have you ever come home late from dinner or movies with your family and friends? \n\nAlso, what do you consider to be coming home late? Is he coming hours after midnight or much later? Does this happen once in a while or several nights a week?\n\nI'm also a very light sleeper but it would never occur to me to lock my husband out of our bedroom. Nor would I go and sleep in another room to \"teach him a lesson\". \n\nDo you ever go out to visit with your family and friends? It sounds like you don't go out and you're more pissed off that your husband does.", "ESH, he is being inconsiderate by waking you up, but it is his bed in his house. Locking him out is petty and you both have bigger issues than just this if you can't communicate through this. Locking him out is childish, even if you said you were going to. He should be considerate and try his best not to disturb you as he gets in bed.", "YTA. You're a major asshole, this is childish behavior.", "So, is he late because of work or what?\n\nWDIT: Why the fuck are people downvoting me for asking a question? \nIt’s completely different if he’s working vs with friends.", "YTA because you're treating him like a child. If you're a light sleeper and his noise is an issue why don't you sleep in a different room?", "What you did was unforgivable. \n\nLocking your spouse out of the marital bedroom is a declaration of war. \n\nYTA", "ESH, but OP, you're the bigger AH for sure.   \n\n\nThis is not how you solve a problem.", "YTA you're going out of your way to make him angry when it's not even helping your case. It's one thing if this was a genuine solution that helps you sleep, but you're waking up just to lock the door, knowing you're gonna wake up again when he comes to knock. You're making the whole night worse for both of you just to spite him.", "YTA. Should've let him in, smh.", "YTA\n\nAs you said it's not just your room and he's as entitled to sleep in there as you are.\n\nI would ask him to leave his clothes and anything else he needs (like a tooth brush) in another room so that we can get ready for bed without waking you and to try to be as silent as possible.\n\nBut you are not the owner of the room.\n\nBig big big YTA", "ESH\n\nHe should be more considerate of your sleep.  Asshole for not.\n\nYou don't have much of a right to tell an adult that they cannot sleep in their own bed.  Asshole for that.\n\nUltimately, you both need a new solution.  One that you both can agree on.  What you're doing now isn't working.", "YTA - it's not your room to decide with a lock. It's two people's room.", "YTA. That's just as much his bedroom as yours. So he has every right to be there, regardless of what the time might be. So get off your high horse and find another solution than being a controlling snark. Such as, I don't know, getting earplugs?", "YTA, this is absolutely unhinged behaviour!!!", "YTA. You can’t lock anyone out of a shared space imposing your own rules. Childish.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m a light sleeper so the smallest sound wakes me up and it takes me forever to fall back asleep. My husband knows this and it’s been a big issue recently where he’ll come home late and then wake me up as he’s getting ready for bed. I’ve asked him multiple times to sleep in a different room if he’s back after midnight but he refuses to.\n\nYesterday I decided to lock our bedroom door so he would get the hint and sleep somewhere else. I warned him beforehand that if he wasn’t home by a certain time I would lock the door so it’s not like I did it out of nowhere. When he realised the door was locked he knocked a few times loudly which woke me up but I pretended I couldn’t hear him and I ignored him when he said he knew I was awake and he told me to open the door. Eventually he gave up and slept in a guest room.  \n\nThis morning he was giving me the cold shoulder and he said he should remove the lock from the bedroom over this. I didn’t say anything originally since I could see he was angry but then he asked me if I had something to say to him and I said no, so he told me to try saying sorry so I told him I wasn’t. He left the room after that and I haven’t tried speaking to him since as I know he’s still mad at me.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I came home late the other night, my wife was fast asleep in our bed. I laid on the couch and started to watch YouTube scariest videos on the web. I don’t care if I was TA- but I quickly snuck into our bed and cuddled all night. The takeaway- Don’t watch that stuff before bed without having a partner to cuddle with. The explanation the next morning was a wee bit embarrassing, but boy was I glad she was somewhat receptive of me coming in the room. You are welcome for this information.", "INFO:Since your husband is too childish and uncaring to respect your request, can you sleep in the guest room?", "Why did you marry him? Has he always been an inconsiderate jerk, or is this behaviour new?", "You need to add more info, you deliberately left out where he’s coming home late from. Is it work? If so, YTA big time.", "NTA - I literally divorced my husband after dealing with a similar issue for years. Sleep deprivation ruined my health. Sleep is too important. Your husband is a jerk.", "INFO: is he coming back so late from work? Or from being out with friends/drinking/etc? And does your bedroom have an attached bathroom with a shower?\n\nI'm going with ESH, mainly because the 2 of you need to talk and work this out like adults. Because you have a spare bedroom, you guys have the flexibility to each have your own quiet space. You should make that spare bedroom either yours or his, and your current bedroom is the shared one. So on nights when he's home and you guys go to bed at the same time, you share your current bedroom. On nights you guys know he'll be late, you have separate bedrooms. \n\nIf your current bedroom has its own bathroom and he is coming home late from work, then I would suggest you make the spare room YOUR room. That way if he's still not home by the time you're ready for bed, you can sleep in your own bed without being woken up; then when he gets home from work, he can shower off the days germs and go to bed without waking you up. \nBut if he's coming home late all the time from partying or being out with friends and plans on just going right to bed without cleaning up first, then I suggest you guys make the spare bedroom HIS room. \n\nEither way, you have the space to make this a more comfortable living situation for the both of you, and it's really a very simple solution. (And you guys definitely would not be the first married couple to have separate bedrooms - it's actually becoming quite common). So take advantage of that extra space, and work this out like adults.", "ESH. How old are you two? I think there's much bigger issues than just sleeping arrangements...What's keeping him out so late or is he just staying up late? Are you sure he isn't cheating? Cheaters love to show more affection to their spouses and be clingy in an effort to hide their infidelity.", "If \\*you're\\* the one with the problem, it's on \\*you\\* to accomodate yourself. Kicking someone out of their own bedroom is fucking childish. YTA", "ESH", "Lol yes YTA are you even serious right now", "Esh. Him for disrespecting your sleep.\n\nYou for locking a grown man out of his room for being out late. \n\nI almost laughed out loud, picturing him being like \" I know you are awake\" and you pretending not to be.  You two are adults. You don't have the right to lock him out of his room. If you wanna sleep in guest room to get more sleep.. have at it. He also should be more kind about being really quiet coming home.\n\nWhat did locking him out accomplish? You woke up to him knocking", "You don't lock your partner out of their own bedroom for anything short of deliberate abuse.\n\nHowever, he is every bit as inconsiderate of your needs and SHOULD BE looking out for you by sleeping in the spare room when he comes home late.\n\nPerhaps you should discuss moving into separate bedrooms? Since you are the one with the sleep issue, you should be the one to offer to move into another room. Perhaps that will succeed in getting through to him.\n\nEdited Judgement. Missed an important detail. NTA", "Yta,  is it his property too?  Then you have no right.", "> iM a L1GhT sLeEpEr\n\nYTA. It’s your husband’s room too and you need to get over yourself snowflake.", "YTA.\n\nSleep masks, ear plugs, and all sorts of stuff exists to help people like you. You can also go see a doctor because this is clearly an issue for *you.* This issue would persist if it was another partner, and would probably be completely exacerbated if you had a family. \n\nThis reminds me of my Dad, who would use his \"light sleeper\" status to make life unnecessarily difficult for the whole family. I remember being repeatedly chastised because of the squeaky stairs that I had no control over. \n\nYou mention having him come home at a certain time. What time was that exactly?\n\nAnd for the record, my Dad never got his sleep issues sorted out, so my parents ended up sleeping in different rooms which clearly didn't help their marriage.", "ESH - he could certainly be more considerate of your sleep, but I think it’s a little much to lock a grown man out of his own bedroom. I don’t think one person in a relationship gets to make a “you can’t sleep in your own bed if you aren’t home by my set curfew time” type of rule. \n\nMy girlfriend goes to bed much earlier than me, luckily she doesn’t have much of an issue getting back to sleep so me coming to bed late has never been an issue. However, if she told me her expectation was for me to sleep in a guest room if I stay out too late for her liking, we’d be talking about compromises and I would never agree to that type of hard line rule at all.", "YTA\nWhy can’t you sleep in the guest room?", "Goodbye lock.", "ESH - Get ear plugs for sleeping, my wife does because of the dog. Compromise is fine if both people are putting something into it. It's his room and his bed too. He is being blatantly disrespectful to his wife, who has established a boundary that he refuses to respect. Y'all need to learn to work things out or something, that sort of disrespect from either of you isn't healthy.", "ESH I don’t sleep well and my partner would never wake me up on purpose but locking out isn’t really a solution. \n\nIf one of us goes to bed first we put the others pjs or whatever they need to get ready for bed outside the room, then you sneak in. \n\nLocking and knocking is rude.", "I don't think you are the AH, but I don't think you have helped yourself out at all. It would have been much better if you had slept in the other room.  Then you could have said very sweetly that since he did not make it home on time, you had to sleep in the other room to get enough sleep to work the next day.  That would hopefully make him feel bad not mad at you.", "YTA", "NTA. Sucks to be him.", "YTA\n\nthat is his bed as much as it is yours.  huge asshole move", "NTA \n\nBut it would be YTA if the sexes were reversed", "He's extremely inconsiderate. Something needs to change. However...\n\nLocking him out of the bedroom is a declaration of war. This is what you might do after consulting your divorce lawyer. This is what you may now end up doing (lawyer).\n\nThis changes things from N T A to ESH.", "YTA.  Very much so.  Get ear plugs. Use white noise.  I hope you have a good relationship with him as this could be a last straw if you do not.", "ESH\n\nIt’s his bed too - why don’t you sleep in another room?\n\nYou have trouble going back to sleep he should sleep in another room.\n\nHonestly sounds like my children are more mature than you.", "YTA", "I think you should consider separate bedrooms. Sounds like you are sleep incompatible. NAH, I think you both need to have a conversation before resentment gets too bad.", "If ur he pays for the house too then ur super the AH. Its his property he pays for u telling him he cant do something or go somewhere in his own house makes u super AH.", "INFO: Why is he out long with friends and family and you stay at home? \n\nDo you two have kids?", "This would no longer be a fight if you'll just get your own bedrooms. It's not unheard of. Or wear earplugs to bed if you want to keep the same bed. Third solution is you sleep in the guest room if you don't want to be woken when he gets home late.", "ESh.", "[removed]", "NTA but i think there could have been a healthier way. I think it would help to ask him why he doesn’t want to sleep in another room. I think you two should talk it over and come up with a solution you can both agree with. Also, consult your doctor on your sleeping issue. You may find that you can get help. That being said, he has been insensitive and you communicated your unhappiness with the situation and I hope you guys can come to a reasonable compromise. Wish you the best.", "Nta, but he woke you up anyways defeating the purpose of what you wanted, which was sleep. I'd have slept in the guest room personally. 😴 so, he seen coming in late meant sleeping alone and then if he tried bothering you in there, I'd be a turd. I too, am a very light sleeper.", "NTA - But after this, I would be moving all my stuff to another room. Husband wants to come home late, even after being warned? I lock him out (after warning him), and he knocks to *intentionally* wake me? I’m moving out of the bedroom, and asking him to go to counseling with me.", "NTA. My fiancee and I discuss which room each of us is sleeping in if one of us is out late. Then we stick to that. Your husband is being a dick on purpose. He can leave earlier or sleep in the other room. Him picking the guest room if you're already in there is a conscious choice to be an asshole.", "If you know he’s going to come home late, stay at a hotel or a friends house. But you might have to do this a few times until he kinda gets the hint that you’re doing it because of him. If he then lies to you about when he’s coming home so that you don’t stay elsewhere, now you can add lying to his red flag list. It seems like he’s really controlling and has to get his way, so I encourage you to find reasons as to why you’re with him? I know this is something small, but if he’s being controlling and willing to lie to manipulate you then that’s a bigger issue. I don’t know man this is tough honestly.", "Some info would be nice.  Why is he coming home late? \nIf it's for work, then you should be thrown out on the street. If it's cuz he's out playing, then you're justified.", "NTA and i have a few choice words for him if he woke up me constantly like that, followed me to the other room ect.  If it’s not work then he can get his ass home at a decent time instead of being out all of the time.  Once in awhile would fine but not this.", "NTA\n\nLoretta Lynn sang about this decades ago. \n\nhttps://youtu.be/OBnkAkmLtaw?si=v\\_dDnBz4yElFAG3f", "Nta and i would get hidden cameras and have him recording doing that the. File divorce from that abusive ah", "NTA FAFO", "Read all your comments and definitely NTA", "Nta - and you may need to reconsider this relationship. As you get older sleep typically becomes more difficult. The fact that he follows you to another room  is borderline abusive to me and definitely harassment. This man doesn't care about your well being.", "YTA and he's a guy, so he'll figure out a solution to the locked door with a quickness.", "NTA. I hope you don’t have kids with this guy, so it’s easier to move on if this is not the only red flag.", "Nta- this feels like harassment. It feels malicious and on purpose.  The silent treatment is immature, at a minimum.\nIf you have to option to leave for a little while to determine if this man brings any positives to your life. Because he sounds exhausting.  Regardless, couples counseling is definitely called for here\nBig hugs!!! You deserve better! Blessings of peace and joy", "If he’s hanging out with his friends you’re not in the wrong, if he’s working, or having to visit a sick family member whatsoever, then yes, he’s your husband not your child 😳", "NTA but this isn’t how you solve problems in a healthy relationship. Was it an asshole move? … Very close to one, but more petty than anything. And as you learned, being petty won’t make him apologetic.", "NTA super light sleeper here, I would hear the front door opening never mind the bedroom door. If he knows that you are going to lock the door then he should either come home earlier or go straight to spare room.", "NTA. He is being really disrespectful and you're totally in the right to set boundaries and reinforce them. If he follows through on his threat to remove the lock, get a rubber stop and it'll function the same. \n\nI have a husband that USED to do this same loud, disrespectful nonsense to me, too. He has woken me up up to five times a day. I'm not saying that this IS your situation, but he's also clingy and possessive. He also has tried his level best to control me, in many ways, through many manipulations. \n\nIf this sounds at all familiar to you, there is certainly a bigger problem at hand. Keep setting boundaries and reinforce them. Don't give an inch, even at the cost of disharmony in your relationship. I can't (in a polite, civil way) describe how much this nonsense pisses me off. Put your foot down and keep it down.", "Seems like a very toxic relationship, as soon as any party does something out of spite, it's over", "This is the behavior of a person with narcissistic personality disorder- your needs will always be secondary/unimportant next to theirs. No amount of couples counseling can address it since narcissists don’t see a problem with their behavior and don’t accept responsibility. Ever. No matter what happens, it will ALWAYS be someone else’s fault. Leave him.", "NTA. You made a reasonable request, he refused. You set a reasonable hard boundary, he broke it. He doesn't get to be pissy over this, it's his own fault.", "NTA, OP. I would have laughed in your husband's face when he said he will take the lock off the door. My response? Go ahead :) It takes about 20 minutes max for me to install another one. And if it does come to that, OP, please put in a digital lock with a passcode only you know.", "NTA\n\nI've never understood the \"I'm gonna go drink with my friends on a weeknight.\" thing.\n\nSomeone in that group can't go five days without alcohol, and that's sad.", "NTA.  \n\n\nIt's pretty clear from your other comments in the thread that this isn't about the room for him.  This is a power play.  He's determined to get his way on this and specifically regarding keeping you from getting enough sleep.  It's almost as if he wants to make you miserable and tired for some reason. \n\n I have a sneaking suspicion he's one of those people who thinks that people don't need as much sleep as they say they do.  ***HE*** can \"get by\" on 4, 5, or 6 hours, so he stubbornly insists that no one else needs 8.  So he's chosen this as the hill on which to die.  (gee, how do I know this?  I once had a partner JUST like that).\n\nDo you have any friends or family you could stay with?  If it were me, that's the course I'd take.  If he's not home within a reasonable time for bed, then you just go to a completely alternate location.  \n\nAlternately, or in addition, you go on strike.  Whatever it is that you typically do around the house and especially for him,  you stop doing a huge chunk of it.  Say \"sorry, (not sorry) this is what happens when I don't get enough sleep.  I don't have enough energy for everything.  I already have to give so much of it to my job.\"\n\nI'll betcha dollars to donuts that if some of what you go on strike against is frisky fun time, he'll change his tune real quick.", "info: what time do you go to bed, what is late.", "ESH - He needs to do better handling letting you sleep, he is showing a lack of respect for your sleep needs. \n\nHowever, the marital bed and the master bedroom is not something that should be used to change behavior or to punish your spouse. Locking your spouse out of their bedroom or bed is infantilization, and is far more disrespectful than waking you up as he goes to bed.", "What time is he coming home?", "ESH.  As always, communication.   If you guys can't figure out how to not piss each other off by what time you come to bed, you are in real trouble.  Locking him out is childish.  Silent treatment is childish.  Stating out late without you is problematic.   All I see are red flags.", "He doesn't have to wake you up just because he comes in late sometimes. So, NTA. His presumption that waking your partner is somehow normal is the part where I think he needs to grow up.", "YTA, if you have a condition that make you wake up at night, you should go to the guest room? Why is he supposed to accommodate to you?", "Big YTA. You don’t determine where your husband sleeps. If you are a light sleeper, wear earplugs etc. Don’t make your problem, his problem.", "Wow. Just wow.", "The correct answer, I think, would be to say, \"Yeah. I have something to say. My lawyer will have the divorce paperwork together for you tomorrow.\" NTA, but why are you married to someone who treats you this way?", "Nta. \nHe's deliberately depriving you of sleep, i saw your other comment that he follows into the guest room if you go to sleep in there. \nHe wants an apology from you & now you're getting the silent treatment 🚩🚩\nLook really closely at your relationship, there's other red flags there, you've just missed them. \nThis isn't the only time your feelings have been dismissed, i bet it's his way or no way??", "NTA but if he’s threatening with removing the lock, threaten back with having separate bedrooms period, if you have the space.  Even asides from you telling him not to come in late and him still doing it, fact that he knocked to wake you up despite your warning, says exactly how much he respects you which is he doesn’t. Frankly, I would be doing marriage counseling or moving out.", "NTA. Learn how to use a drill and the tools required to replace the lock so that if he tries to remove it, you can put it back on yourself. Also, see a doctor about your sleep, if your sleep really is that bad you need help. Absolutely do not apologise.", "NTA....it's more like he's a red flag/the asshole. You tried to ignore it, you tried a solution, and he still does what HE wants, even if it means that you don't get a restful sleep.", "Either way, he keeps waking you up. I would keep locking the door honestly. NTA", "Your relationship sounds exhausting", "YTA. Not because of locking the door but for leaving him to sleep elsewhere out of spite, even though you were awake. Its just childish behaviour. Your explanation to locking the door is that you will wake you up when he joins you - well, he couldn't wake you up any more could he?\n\nWhat kind of relationship is this anyway? He prefers to spend his evenings with others and not with his wife. He doesnt care about waking you up, knowing you have sleeping issues. You lock him out. That is not normal.... its maybe what teenagers might do in their 1st relationship, not a grownup married couple. \n\nDoesn't sound like either of you is willing to make a lot of effort to make eachother happy...", "NTA my wife is like you, so we have a different sleeping arrangement.", "YTA. Someone locks me out of a room in my own house, that's the end of the relationship.", "Yes..\n\nYes not your child.. You aftually gave your husband a curfew.. Its his bed as much as it is yours.", "She said in another comment that even if she went and slept in the guest room he would still follow her...poor OP she is so NTA", "So op should wait til midnight to see if he feels like coming in at a decent hour and if not scuttle over to the guest room? Fuck that. If he’s out doing whatever he’s doing til the wee hours he can sleep in the guest room himself.", "Seconded with this info - NTA but this is a deeper issue than just what is said here.", "Yeah there is only one solution that is going to work here quite obviously, and that is him getting his own way 100% of the time because he's entitled to do what he pleases.  I have been with someone like this and trust me, there is no fucking recourse.", "NTA, but y t a to yourself for remaining with a person who cares so little about you that they are prepared to interfere with your primary human need to sleep. Interrupted sleep is literally a torture technique. If someone I lived with, outside of a baby human or animal, insisted on doing this to me on a regular basis after I asked them not to the first time, I would understand that they were harming me on purpose and make a decision about my life with them based on that information.", "I love sleeping in the other room. Ops husband is crazy. But ya if op can't be disturbed at night then sleep in the other room op.\n\nGiving a bed time then locking someone out of their own room is absolutely hilarious but YTA. You can't make a rule that no one is allowed to come to bed after you. Get another room that suits your delicate sleeping needs. No need for the Internet to be involved.", "It's mostly him spending time with his friends and family so he can leave earlier", "Don't matter. You can't give an adult a bed time then lock them out of their own room. That's hilarious but insane. YTA. \n\nop needs to make other sleeping arrangements that suit their fragile sleep condition and not be locking people out of their own room and belongings.", "Wrong, can't give people a bed time then lock them out of their room (even though it's hilarious). And you can't ban coming to bed after you go to bed. \n\nThis isn't about what he's doing. It's irrelevant. She's trying to make a rule that he goes to bed before or at the same time as her at all times or he's locked out. Complete AH.\n\nOP has the delicate sleep conditions. They need to set them selves up in another room.", "Sounds end zone for sure", "She's also tried sleeping in the guest room herself but he follows her there.", "Yeah, the door knocking was especially aggressive. She told him she would lock the door, he knew it was locked because she didn't want to be disturbed, and he knocked on the door anyways.\n\nIt feels like an abuser punishing their partner for usurping their control", "Is he a jerk though? I'm a light sleeper and my wife wakes up most mornings at 530a to go running or work out. Would I be in the right to 'yell' at her that she is waking me up and to not go do what she wants?\n\nHim getting ready for bed late at night doesn't really seem any different than my wife waking up early to go running. Both of their activities are affecting their partners but would you really vote my wife TA because I'm a light sleeper? Because I don't, it's not her fault I wake up easily.", ">You definitely need to sit down and talk and clearly establish this boundary.\n\nShe already did that. Numerous times.\n\nNow what?", "Even without the comments it was obvious to me. \n\nI have sleep problems as well, and my bf is always super invested. He has offered many times to go sleep on his couch (which is horribly uncomfortable) when I'm having an episode, because he actually cares. Because people are supposed to care for their partner's well being. OP's husband doesn't care, he uses it to hurt her.", "Correct. \n\nHe doesn't want her to be able to sleep. He enjoys her misery. The main post doesn't really paint the whole picture. \n\nAn ex used to do this to me. He'd wake me up when he came into bed by stomping and slamming things and turning bright lights on. When that didn't always work, because I'm a heavy sleeper, he'd take the blankets off of me, because he knew I'd get cold and wake up. When I started grabbing the blankets on my sleep, he started ROLLING ME OFF THE BED AND RIPPING THE BLANKETS OUT OF MY HANDS. \n\nHe made sure I didn't get a solid night's sleep for six months. He liked seeing me miserable and helpless.", "This is not a punishment tho but simple self care - preventing being woken up in a middle of a night for no reason other than someone being a total jerk.", "Yes, people are missing the fact that he is disrespecting her when he ignores her need to have a good night’s sleep. It may seem small but what next? If she allows him to disrespect her with anything it will only get worse.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "How many cats do you have", "He was out with family or friends from the sounds of other comments. He knew coming later than arranged would wake her up.", "Yup! I have been through the exact same thing.  I agree totally - a lot of people cannot see this as abuse because people like this act like \"oh but it's my room too, i just want to sleep in my room\" when actually it isn't that at all.", "Have you read the post?", "He follows her into the guest room if she goes there bruh", "> then you could go sleep in the guest room\n\nor indeed, in a whole other house, far far away.", "You obviously didn't see other comments. She has gone to the guest bedroom. He just follows her in there.", "OP stated in a comment that he follows her into the guest room. I really don’t get his mind set. If it’s absolutely essential they sleep in the same bed he could come home earlier from hanging out with his friends. She doesn’t seem to mind him coming home late, she just doesn’t want to be woken up late. She’s offered multiple solutions including her sleeping in the guest room. This seems like a weird power play. It’s obviously not because he loves her so much he can’t stand to be parted from her. If that were the case he would care that he was disrupting her sleep multiple times a week and adjust his behavior accordingly.", "[If she tries to sleep in the guest room he follows her](https://www.reddit.com/r/AmItheAsshole/comments/18an6gd/aita_for_locking_my_husband_out_of_our_bedroom/kbyx4q7/?context=3)", "Tried that and he just joined her in the guest bedroom.  Doesn't seem to matter where she sleeps, he's going to go there, too, and disturb her.", "The idiots who can't recognise abuse and have never experienced coercive control are hopefully candidates for the next Darwin Awards.", "So are the people calling this an “act of war” to lock a drunk husband out of the room when he cant get his late nights/drinking in order enough to respect his partner lol", "OP wrote in another comment that he follows her to the guest room if she does.", "He follows her into the guest room op says in replies", "She has to lock him out of the bedroom she's in, if she tries to sleep in the guest room [he follows her](https://www.reddit.com/r/AmItheAsshole/comments/18an6gd/aita_for_locking_my_husband_out_of_our_bedroom/kbyx4q7/?context=3)", "Is that the only thing you got from this post?\n\nYou didn’t see where he follows her into the guest room if she tries to sleep? Not letting someone sleep properly is actually straight up abuse.", "He literally follows her into the guest room if she tries to sleep there to get a good night's sleep. This is about control.", "I the comments OP said he goes out with family and friends, it's not work and he's able to leave whenever he wants. OP also said if she goes to the spare bedroom he'll follow her, it doesn't matter where she sleep, her husband thinks he has access to her body regardless of where it is. It's actually an abuse tactic that he's employing here", "She's spoken to him several times and he's ignoring her.  So what's the solution? She should move? Or get earplugs? And he needs to change nothing about his behaviour coming back after midnight because he's out partying? Get real.", "In another comment, op states he will follow her into the guest room and wake her up if she sleeps there", "Ignoring your partner's begging to let her deep isn't childish? \n\nWhen she tried to sleep in the guestroom he woke her up, there as well.", "[He won't let her sleep in a seperate room](https://www.reddit.com/r/AmItheAsshole/comments/18an6gd/aita_for_locking_my_husband_out_of_our_bedroom/kbyx4q7/?context=3)", "Yeah this is just weird. If your relationship has gotten to the point where you have to barricade yourself from your partner, you may need to reevaluate the partnership. OP is right to be pissed that husband doesn't seem to give a shit about her needs but how is locking him out really going to help anything? Like most of the relationship posts in this sub (Congratulations! Your partner is an asshole!), OP needs to stop worrying about who is the AH and start thinking about how to fix the lack of mutual respect, otherwise it might be time to terminate the relationship.", "She tried that, only for him to wake her up there.", "You got a vibration dampening body suit too, because sound is not the only way to wake someone up.", "Full guest room, no one knows when a person is getting back \"late\",  and what do you need to get ready for bed a toothbrush and maybe pajama bottoms. I'll send him $10 so he can have both of those ready for his house with a freaking guest room. People who are inconsiderate don't consider others.", "OP said she tried sleeping in the guest room and he came back late and followed her to the bathroom to sleep with her in the guest bed.", "So he goes out and comes home late and SHE is the one who has to sleep in the guest room? fucking hell.  Ok then.", "She says in comments is multiple times a week and well after midnight. If she sleeps in the guest bedroom he will follow her in there. She given him multiple solutions, he could come home earlier, sleep in the guest room, or let her sleep in the guest room. He’s decided he doesn’t care about her well-being enough to try any of those very reasonable solutions.\n\nEdit: guest bedroom not first bedroom", "No, OP said he's hanging out with friends and family and he can leave whenever he wants", "And that he also follows her into the guest room if she stays in there anticipating he will be home late.", "Why can’t he just be fucking quiet while his WIFE is sleeping???", "Because she tried that and he followed her there", "She says in several comments he won’t allow her to sleep elsewher and will just follow her and disturb her there. So… she’s not treating him like a child. He’s acting like one. Screams abusive tiny man syndrome to me.", "She asked him multiple times to not wake her up, no compromise was had, so he literally created his own consequences. Try being a light sleeper and making the same comment.", "OPs husband refuses to find a solution. He thinks he gets 100% access to her body. Even if she goes to the spare bedroom herself he'll follow, it's an abuse tactic to make your partner sleep deprived. It's more than reasonable to say if you're out past midnight sleep in a different room, she deserves the right for health reasons. He still has access to his house and a comfortable bed to sleep in", "She had multiple other solitions: (read OPs comments too)\n\n1) him sleeping in guest room, he denied it\n2) OP sleeping in bedroom, he followed her there and woke her up to sleep in same GUEST bed\n3) get home before midnight and there are no problems\n\nBesides earplugs dont stop the bed from moving when someone gets in. If husband is late, he HAS to let her sleep.. husband is petty and abusive, just trying to assert his power and waking her up anyways (wether getting in the bed in the guest room with her or banging on the locked door.. )", "He follows her there", "she tries the guest room and he goes there instead. OP is NTA as she’s tried that solution and husband insists on disturbing her sleep there. \n\nhttps://www.reddit.com/r/AmItheAsshole/s/bttPYqrMGh", "she tries to move to the guest room instead of he’s out late so he can have the bedroom and he follows her into the guest room. husband is fully the asshole and just fucking with OP. \n\nhttps://www.reddit.com/r/AmItheAsshole/s/bttPYqrMGh", "She says in her post that she only asked him to sleep somewhere else on the nights he comes home *after midnight.* That's pretty damn reasonable, it's not like she's giving him an 8 p.m. curfew or some shit. She's also tried sleeping in a different room herself so she doesn't get woken up, and he fucking follows her into the guest room and wakes her up anyway instead of sleeping in his own bed. Being upset that he regularly comes home in the wee hours of the morning and jostles her awake no matter where she goes to get away from him does not make her an asshole, and it's not remotely the same as snapping at someone because the stairs squeak.", "OP tried sleeping in the guest room instead and he follows her there. husband is fully the asshole\n\nhttps://www.reddit.com/r/AmItheAsshole/s/bttPYqrMGh", "He'll just follow me into the guest room if I do", "I getthe feeling he would still make sure she wakes up. This sounds like a powerplay/abuse from him.\n\nHe even follows her to the guestroom when she tries sleeping there.", "she tries that. he goes in the guest room. \n\nthis is not a solution. \n\nhttps://www.reddit.com/r/AmItheAsshole/s/bttPYqrMGh", "It would probably have been much better if they didn’t get married in the first place.", "OP’s comments clarified that if she sleeps in the guest room, he’ll follow her in there and wake her up anyway.", "If she sleeps in the guest room he goes in there as well. He’s out with friends. He is absolutely the asshole. He could come home earlier if it’s so essential they be in the same bed every night. If this was because he loved her so much he has to sleep next to her he wouldn’t be such an asshole about it.", "ETA:\n\nIf you had gone to the guest room and locked that door, he'd have no valid objection.", "Really? So she doesn't have a right to a good night's sleep, or apparently a right to not suffer domestic abuse, according to you?", "He follows her to the guest room", "He follows her into the guest room, it's about control", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "The follows her there", "Ugh. I would’ve suggested that solution but instead, he just has to be a selfish ass no matter what.", "Make the guest room her room. She/he can visit each other when they are talking.", "I agree. No one is entitled to be inconsiderate to their partner. Its almost like dude is making this a control issue between them?", "Wouldn’t that apply to both?", "He’s entitled because he wants to sleep in the room/bed he pays for? Just because ur a light sleeper doesn’t meant u get to lock him out of his own house/room. Super the ah for OP thinking she has the right to do that.", ">outside of a baby human or animal\n\nMy baby boy is ill and has been waking me up multiple times a night for the last couple weeks.\nMy mind is shattered. I am exhausted. I live off coffee and have been taking secret naps at work. it's torture, but I know they aren't doing it on purpose and I do it for them willingly.\nIf a grown-ass adult does that to me knowing full well the effect it has on me, I'll be showing them the door.", "What’s OP supposed to do? Some people are light sleepers. It’s on the hubs to be respectful if they aren’t going to bed at the same time. My husband does that sometimes, he’ll chill on the couch or the guest bed bc he doesn’t want to wake me (mostly bc he knows how long it takes me to fall asleep, not that I’m a light sleeper). It’s called being respectful to your partner and taking into account their needs. \n\nThey need separate beds and that would sock it pretty quick.", "Solidly in this camp. \n\nOP YTA. \n\nThere are solutions that don’t include “my way or the highway” tactics. That will only serve to drive a bigger wedge in your relationship.\n\nEar plugs and / or sleep masks are a huge help if you’re a light sleeper. I didn’t see any indication this is a regular behavior (many times per week or month) only “it has become a big issue recently…”. Sounds like there is some lingering resentment brought out by the fact he is out late and you’re home. Maybe there is a communication gap somewhere there.", "You should edit your post to point out that if you sleep in the guest room he will follow you in there.\n\nThis has gone beyond a basic disagreement about waking you up and sleeping in another room. He is doing something that causes you to lose sleep, you’ve brought it to his attention and suggested solutions (coming home earlier from social activities, him sleeping in another room, you sleeping in another room), and he has outright dismissed them all.\n\nIt’s not just that he doesn’t care, but him following you into the guest room shows that he is trying to make some kind of point. This is compounded by him threatening to remove the locks on the bedroom (and I’m guessing the guest room if you go in there and lock it?).\n\nThe two of you need to see a counselor.\n\nNTA.", "Have you thought about getting a sleep study done? \nRegardless of who's at fault with this issue they may be able to find something that will massively improve your quality of life by making you sleep better.", "I would keep waking him up, with an air horn if necessary. At this point, if I don’t sleep, nobody sleeps.", "And what time are we talking about? It's not like ... 7pm is it?", "did you read the part where psycho husband follows them into the guestroom?", "did you not read the part where she did that? she chose to sleep in the guest room, he purposely follows her in there and wakes her up. she comes up with a solution with her partner that she will lock the door after midnight so she can sleep. he agrees, then decides to bang on the door instead when he gets home. \n\nit’s kinda pathetic that you read what you want and come up with a judgment when you didn’t even read the whole story and understand what was being read. you might need to accept that you don’t know shit sometimes, and that’s okay.", "OP says that her husband will follow her into the guest bedroom", "Nope.  That's not how it works in the real world.  He doesn't get to wreck her sleep when she needs to get up for work the next day.  If he isn't home by X time, he sleeps in the guest room.\n\nEnd of.  Never date.  You sound selfish as hell.", "Yeah that's what I'm not getting. Obviously the husband could be more considerate, but ultimately it is the wife who has the problem and the bedroom belongs equally to both of them. If she has the problem, then she should proactively stay in the guest room instead on these days. You can't give a curfew to your adult husband, I just don't think that's reasonable.\n\nThat said, the husband could be a lot more courteous with this when he is just coming home from hanging out with friends and not from work.", "Jfc, I'd smother him in his sleep.", "Considering OP clarified that he insists on following her no matter where she tries to quietly sleep, that's pretty much exactly what it is.", "Yes, I don't get some of the e.s.h comments. He chose to stay out late socializing, and then deliberately woke her up by pounding on the door in retaliation. Locking out your partner is an extreme measure, but she did it once in response to him deliberately keeping her from sleeping. I'm also having trouble understanding why a married person regularly is out past midnight by himself, especially given that he knows this wakes up his partner. What exactly is he doing?", "Ok how about I put this into perspective for you then.\n\nHow about if you spoke to your wife about waking you up, and she ignored you and continued to do it and didn't care that she was disturbing you? How about if you spoke to her again and she still carried on?\n\nHow about if you then went to sleep in a different room and she got up and started banging around in that room as well just because you were in there.  \n\nWhat this guy is doing is deliberate, what your wife is doing is not.  Does that make sense now?", "Yes he's the jerk. Her husband follows her around the house to disturb her sleep if she  tries to sleep somewhere else. You not caring that your wife wakes you up to run at 5am isn't comparable. It's not an issue for you.", "I’m a light sleeper and I’ve never gotten mad at my partner for having to wake up early. It’s when they create unnecessary or inconsiderate noise. Like why do you need to turn on the brightest light? Why do you need to slam the doors? Why do you need to shuffle your feet and watch TikTok for 30 minutes? \n\nIt’s simply HOW you wake up that’s the problem.", "If you sleep in the guest room, does your wife follow you there to wake you up?", "> Would I be in the right to 'yell' at her that she is waking me up and to not go do what she wants?\n\nNo but if you mentionned nicely several times that it bothered you, and she still didn't care and shot down every solution you came up with, I wouldn't think you'd be in the wrong for losing your shit.\n\nMy partner and I have very different schedules as well as different sleep needs. He is pretty unbothered by lack of sleep, while I'm super sensitive to it. Seriously, if I sleep less than 6 hours, it breaks me for the rest of the day to come. \n\nThe husband isn't a jerk because he wakes her up, he's an asshole because he knows her sleep is important to her yet still choses to ignore her needs and refuse any solution provided for the issue.\n\nOverall he doesn't seem to care and only wants his way, over his partner's well being.", "accept that he doesn’t care about her boundaries and leave him", "If she cant handle him climbing into bed, why isn’t she sleeping in the guest room? Does she also lock him out when he goes to the bathroom at night? This disrespect isn’t one-way, she locked him out of his bedroom.", "You might want to look at my comment history and see what I was saying in another gender issues discussion before making silly assumptions.", "Even worse, if OP sleeps in the guest room he follows her there", "My comment predates hers.", "his mindset is control.  that is all.", "WTF, missed that comment. What an asshole husband", "No I didn't see it, bc it isn't there.", "Everyone keeps saying he follows her into the guest room. I wanna see that piece of info. All I see is a comment from OP claiming that husband WILL just follow her into the guest room if she sleeps there. I read this as an assumption not a description of something that has actually occurred.", "“GeT rEaL”. Not sure why you’re having a go at me. I don’t have a solution, but clearly locking the door solves nothing for her sleep does it? Locking the door isn’t the cleverest solution is it?\n\nYes he does need to modify his behaviour. That’s why I voted ESH.", "oh. that should really be part of the OP. divorce him then", "That’s really weird. Another thing to talk about and address. They’re both adults. It’s not right to say what the other can and cannot do. They’re partners, not each others mommy and daddy. That’s just flat out controlling. There needs to be some compromises. Put a lock on the spare room then and sleep there if he’s out late. That way he has access to his bedroom and can’t complain as much; Because SHE is making the sacrifice she needs to for her sleep and not him.", "It’s already time to end it. Someone who prevents you from SLEEPING and actively makes it more difficult to do so, and then threatens their partner with removing something that allows them to rest is not a good person, and there is NO way to get him to understand. Sorry. Someone who loves you and cares about their partner would not act this way.", "She's the one with an issue. He's entitled to have fun and sleep in his own bed.", "and if she's really a light sleeper, she'll hear him come in anyway. \n\nI'm a light sleeper and I always hear the garage door open when one of my family comes home and I sleep two floors above the garage. \n\nThere's more to this tale than OP losing sleep.", "So then, NTA.\n\nBut telling us where he’s coming from makes a huge difference.", "I am a light sleeper.\n\n  \nThis didn't solve the issue. It made it exponentially worse.   \n\n\nNothing was improved. The relationship suffers.   \n\n\nESH, YTA, I don't change my vote.", "Ah, I missed that somehow.  That definitely alters the situation.", "Hm - it actually says “he’ll just follow me if I do”, which I take to mean that she has never tried that solution but assumes it wouldn’t help for whatever reason. I stand by my ruling, but if anything this is pushing OP towards YTA as it illustrates an unwillingness to try solutions that don’t involve locking someone out of their own room.", "Why are you with someone who so clearly disrespects you over and over again? And why is he spending so much time with family and friends? You’d sleep so much better without him in your life. NTA", "Move all of your stuff to the guest room for a few weeks and lock him out of there. He’ll either learn to not stay out late enough to wake you up when he gets home, or he’ll learn to sleep by himself. Either way, you’ll get to sleep.", "My ex tried this power move when I had a very important training session to facilitate at work. I took his credit card and checked into a hotel by my office for three nights.\nYour husband's behaviour is grotesque abuse, sleep deprivation/interruption is an actual torture technique. \nNTA", "OP, my advice is really really consider where else this is occurring in your relationship.  This is going to get worse.  If he's following you around like that it is not good, I had the same behaviour in my relationship and in the end I had to leave.  What he wanted went, what he decided was the final say and it was never going to change.  It's entitlement and a show of dominance and nothing to do with him not being able to sleep in the bedroom - it's about power and control and nothing else.", "This feels like the key to the whole issue. Your husband feels like he has the RIGHT to sleep with you, regardless of whether or not him coming in late disturbs your sleep or wakes you up. He'll follow you to the guest room if you go there, or he'll bang on the bedroom door if you're there. He does not care about your quality or amount of sleep.\n\nThis is extremely disrespectful, and can actually impact your mental and physical health over time. \n\nIf he won't begin to accommodate your perfectly reasonable request, it may be time to start fighting fire with fire. Wait until he's sleeping in and you're awake, and wake him up by making extra noise getting ready. Show him how it feels if he's too dense to understand your words.", "should definitely include this in the post, this is a major issue.", "What the fuck.", "Has he done that before?", "The guest room doesn’t have a lock too?", "Hm….so you have NOT tried this just to be clear?\n\nEdit:typo changed ‘clearv’ to ‘clear?’\n\nEdit again: to everyone downvoting me and saying that the husband follows her, read the comment I am replying to. “He WILL just follow me if I do”. \n\nIf OP has tried this and husband followed her, I will fully admit he is TA but that is not what I’m reading here. I am reading OP rejecting this as a non solution which is different than trying it and having husband disregard anyway.", "So would he not even be able to use the bathroom in the middle of the night out of fear of waking her? It's a problem and they need to figure something out because they're not heading into a positive outcome.", "Some people just suck and it appears OPs husband is one of those", "Why should she get the second rate room just because he can’t act respectfully and be quiet around a sleeping person?", "He follows her into the guest room so no dice on that either.  Wherever she sleeps, he does the same thing.", "She said later in the comments that if she goes to the guest room, he follows her into that room. She can't get away from him.", "In her comments she pointed out that if she chooses to sleep in another room, he'll follow her into there.  \nSo yeah - it's not really about the room.", "She has the right to a good night's sleep, and he's being super disrespectful thinking he has the right to disturb that. It literally is a form of torture to deprive another human of sleep. \n\nHe knew the consequences of his actions and she informed him of what would happen. He doesn't like the consequences, that's his problem. FAFO.\n\nAlso... it's cute you think he is the only one who can consider the home/room \"his\". He has no problem with disturbing her usage of it on a regular basis.", "er... you're a moron.  \n\nShe's attempted to talk to him.  he's ignored it.\n\nShe's attempted to sleep in the guest room, he's followed her.\n\nShe's attempted to lock him out of the bedroom to get a nights sleep after warning him in advance which he's knowingly ignored and he's aggressively banged on the door.\n\nI'm sorry but which part of this means she's an asshole?   For attempting to get a good nights sleep without her fucking asshole husband disturbing her no matter where she chooses to try and get some peace? \n\nShould she go and sleep in the car perhaps? Would that be acceptable to you?", "Why are you assuming he pays for their housing? Did I miss the part of her post that says she doesn’t work or contribute to their finances?", "I guess it depends on if the person with the sleep problem has tried to make changes or not. Is she using white noise? Has she tried earplugs? Is the husband actually loud or is it just normal noise from someone who’s trying to be quiet disturbing her? Obviously in this case he knocked loudly and woke her up so that’s on him. But if he’s normally trying to be quiet and she’s that light of a sleeper that’s something to look into. I’m the lighter sleeper and my husband gets up much earlier than I do. I use white noise and earplugs to dampen any noises and he uses his Garmin to vibrate to wake himself up instead of relying on a loud alarm.", "Please read all of the comments here.  She is not TA.  \n\nWhen she moves to the guest room he does the same thing.\n\nIf she stays in the bedroom he does the same thing.\n\nIf she locks the door he bangs on it.\n\nNo matter what she does he has to have his own way.  I hate to say this but you are way off on this one.\n\nI actually hate the fact people cannot see how abusive this guy is to OP.", "Nope.  Do not do counselling with an abusive person.  Ask me how I know.", "Joint therapy with an abusive person is contraindicated.", "Oh, Jesus Christ. 🤢", "you need to read her comments because if she moves to guest room, he follows her there instead of going in the bedroom himself. this is not a solution he is willing to accept. \n\nOP is NTA.\n\nhttps://www.reddit.com/r/AmItheAsshole/s/bttPYqrMGh", "That's why this reads more as an ESH.\n\nI'm a deep sleeper, my partner, not so much, so if he goes to bed much earlier on nights I don't have go get up early, I tend to sleep in another room if he's rolled to the middle of the bed- I don't want to wake him, it takes him ages to fall back to sleep, and it would make me an AH.\n\nDo I have every right to sleep in my bed? \nOfc, and I haven't been asked to go to sleep when he does, or that I can't move him, I just have respect and care whether my partner gets sleep.\n\nOP can sleep in the spare room, but what's to say Husband won't just follow them in there?\nOP also shouldn't bar their husband from sleeping in their own bed, but really- they shouldn't have to, as their husband should be caring enough to not want to repeatedly wake their wife up that this is an issue at all.\n\nHonestly, how often does this have to happen to be this big of an issue?", "Oh jesus christ that's so bad; [they always hide the most egregious details in the comments!](https://www.reddit.com/r/AmItheAsshole/comments/18an6gd/aita_for_locking_my_husband_out_of_our_bedroom/kbyx4q7/?context=3)", "Some people are even voting YTA! \"It's his room too, you can't just lock him out\"\n\nIt's not about the room, even if she moves rooms he just follows. It's about him demanding unfettered access to her body and it's super gross", "It’s because they either don’t understand or are also disrespectful of boundaries and would continue disrupting OP’s sleep like her husband or start gaslighting her lol. I wonder how they would feel if the reverse happened to them where they were constantly woken out of sleep shortly after falling asleep. They clearly take offense to being locked out of somewhere they feel entitled access to 100% of the time, and then project that onto OP resulting in a YTA or ESH judgment.", "Him banging on the door is clearly deliberate and he's being a jerk for doing that. But I'm still not sold on him just coming into the room and getting undressed for bed is an AH move. It doesn't sound like he is talking, poking, turning the TV on or anything like that as she would have mentioned it in her post to 'strengthen' her case. He's just walking in, getting ready for bed, and going to bed.\n\nIn the strictest sense, yes, it is deliberate because he's getting ready. But my wife is also \"deliberately\" getting up and getting ready to go running.", ">Her husband follows her around the house to disturb her sleep if she tries to sleep somewhere else.\n\nI see that in a follow-up comment, that's a dick move. But I kind of interpret it like he really wants to just be with her.", "Ya, even if sometimes it *feels* like she is doing that even though I know she isn't.", "She said in a comment that he follows her into the guest room and does the same thing if she sleeps there", "She spoke to him multiple times.  Multiple.  She's expressed her issue, he doesn't care.  Does that compute.  He [does.not.care](https://does.not.care).  It is not about him being able to get into his bedroom, it is about what he wants goes.  That is why he follows her into the guest room - because he is a bully.", "According to her comments there is no point, if she goes to the guest room he would follow her there. It doesn't seem to be insistence on sleeping in his room, but insistence of sleeping next to her.", "Yeah, no. It's not like he's getting up to use the bathroom. He's hanging out with his friends until whatever tf time. She asked him nicely not to wake her after he comes home AT WHATEVER TF TIME and he refused. He should be locked out, especially if there's another perfectly usable bedroom for him.", "I think what the other comment is saying you're probably single if you're that quick to jump to divorce... It's not about gender.", "Why would I want to do that? You sound unhinged and like you have blue hair a nose ring and ear gauges and like the other person said it has nothing to do with gender", "So.. edit it then? Or don’t be annoyed when people answer your question?", "It’s in the comments. OP provides other info that I think excludes it from the asshole category.", "But they don't do they.  How is it possible that she is sucking having had several conversations with this twerp and him CHOOSING to ignore her every time.  I get what you're saying about locking the door and everything but perhaps she feels like she wants to set a boundary and is sick of being constantly ignored and disregarded every time he feels like it.  Just sayin.", "It's likely he's an abusive partner and she needs to leave.\n\nTalking was the first step, and she did try to talk, but he chose to ignore her. He feels entitled to her and won't let her sleep privately.\n\nShe tried to force privacy by locking the door, and he responded by retaliating against her.\n\nThese are abusive behaviors that indicate a lack of respect for her autonomy, and no amount of talking will fix that", "Yes you're right, she has an issue.  What is this issue? Oh wait, him coming home late and waking her up because he HAS to sleep in the same room as her and can't possibly consider sleeping in the guest room to avoid disturbing his clearly well respected and much loved wife.  I mean you're right, that would be too unacceptable for words wouldn't it.  I rest my fucking case.", "Concidering the fact that she tried that and he followed her into the guest room and still woke her up, what do you want her to do?", "Yes him staying out late without her multiple times a week seems like a problem in itself. I’d be curious if he’s out drinking and this is actually an alcohol problem.", "i assume the woman married to this guy knows his habits a lot better than people just reading this on the internet", "And if he thinks he is going to be slick taking off the lock, buy one of the portable locks Amazon sells for when people travel.", "I’m glad that person is an ex. You deserve better than that.", "Thats illegal and super AH move wtf? People on this sub actually glorifying this shit.", "So he can bang on the guestroom door?", "She literally said what he does if she is in the guest room.", "Ugh, what an asshole", "It’s not torture, He’s not waterboarding her lol if u have trouble sleeping u cant start blaming everyone in the house just for existing. \n\nAlso yes she owns it too, but the husband isn’t the one locking her out of her own room.", "Kicking someone out of their property they pay for is the AH move. Im sorry but yes if OP has a problem she can leave to sleep somewhere else or dump him. It sucks, but OP is choosing to live with a shitty person. If he wanted to get the cops involved OP wouldn’t be able to do a thing. \n\nJust because u made a bad decision choosing ur bf doesn’t mean u can do whatever u want. Take responsibility. Dump him.", "To get that exact reply and prove a point. Sure maybe they both pay equally. But one person is literally locking the other out of their room. AH move no matter how u look at it.", "If she tries to sleep in the guest room, he follows her. https://www.reddit.com/r/AmItheAsshole/comments/18an6gd/comment/kbyx4q7/?utm\\_source=reddit&utm\\_medium=web2x&context=3", "Sweet. You have nothing to do but read everyone’s commentary. Sounds like if it was relevant op should put it in the story.", "I assume it's the same reason as to why you have to be super super careful with cops?\n\nCalm and charming abuser is believed while upset victim is labelled as the villain (or at least equal abuser)", "Absolutely agree.    If they do consent to therapy, they plan to get the therapist on their “side “ so they can “win”.", "Hanging out with friends and family is abuse? Or expecting to sleep in a room/bed u paid for is abuse?", "No, you see OP can't tell a MAN when their bedtime is! That's just ridiculous. Imagine wanting to get a good night's sleep at the expense of having your husband *checks notes, be quiet and considerate of their wife. What's next, requesting that he clean up after himself and wash his own dishes?", "Hubby does follow her if she sleeps in another room. That was her first line of defense.", "Sleep deprivation is considered a form of torture for a good reason. I went through it with a previous partner and it was a nightmare. It turned me into a zombie and ended up costing me my job. \n\nOut of all of the fucked up shit my ex did, refusing to let me sleep was one of the biggest reasons I left her. After we broke up I learned that controlling your sleep is one of the tools abusers use.", ">Some people are even voting YTA! \"It's his room too, you can't just lock him out\"\n\nThese people are either, a) children/teens who think the world is filled with black and white choices, b) selfish assholes, or c) abusers who don't want their bag of tricks to be revealed. Possibly a combination of all three.", "You're not getting it.  \n\nIf she moves to the guest room he will do the same thing and go in there, which means he has to go to their room to see she's not there, then he'll get into bed with her and wake her up in the guest room.\n\nThis is NOT about him just wanting a nights sleep in his room, it is about something else a lot more insidious.  My partner used to do this to me.  If he could see I was asleep he would come into the room and turn the light on and start banging around under the pretence of doing it because he was just \"getting on with his life\", but if I slept in another room he'd do the same thing.  \n\nWhen I spoke to him he acted like he listened then continued, this went on and on and on, and eventually I locked the door like OP.  He broke it down.  \n\nYou're thinking this guy is just trying to have a peaceful life, and i hate to say it but you're not right on that.  He is controlling and abusive.  His actions show it.", "If he really wants to be with her, he can get home at an earlier time. He isn’t coming from work or anything where he can’t leave earlier. He’s just being an ah", "Then why is he out so late socializing so often.", "I kind of interpret that as he’s unwilling to compromise even a little bit to allow her to get some decent sleep and he’s proving a point that he can do whatever he wants and she’s not the boss of him. She has said “I want to sleep, and I am willing to sleep alone if need be so it doesn’t even have to inconvenience you” and he said fuck what you want, I’m coming too and you can’t stop me. At best it’s immature and unproductive, and worst it’s controlling and abusive. His desire to “just be with her” does not trump her absolute right to agency and autonomy.", "No means no, regardless of how he feels he doesn’t just get access to her 100% of the time especially after disregarding her boundaries entirely.", "That means he's forcing his wants onto her while dismissing her physical NEEDS.", "So his wants are more important than her needs?", "No this sounds like a control issue. His behavior isn't reasonable or logical. If he wanted to be with his wife he'd spend more time with here while she was awake instead of staying out late with his friends and family.", "Yikes OP has worse problems then I think she may have married a 5 year old. That's not legal in many places", "Does this sub allow people to strengthen their own case in comments, with stuff that logically would definitely make it into the original post?", "[removed]", "This.", "BRO READ MY COMMENTS. I'M LITERALLY YOU. LOL\n\nëdit:\n\nsee here: https://www.reddit.com/r/AmItheAsshole/comments/18ah4jo/comment/kby7tu8/?utm\\_source=share&utm\\_medium=web2x&context=3", "I'm not annoyed and I hadn't checked this post until you answered.", "So how does her locking the door solve things? Was that a clever move? She didn’t get any sleep did she?", "That’s always a possibility too. I like to have a little hope though. \n\nI like to wager that when these scenarios come up, the initial “talking” is more of a “I brought it up once or twice and didn’t talk further about it”. Cuz that seems to happen a lot too. Husbands and wives can have a harder time making their wants and needs known because they fear retaliation or simply don’t have the energy to fight for their point of view, or they have trouble finding the right words to make their needs known fully. (Let’s face it, men tend to have a MUCH hardER time understanding shit, so it can be a chore to get them to listen and understand REALLY basic things regarding empathy sometimes). \n\nHis “retaliation” wasn’t really retaliation, just an attitude. It would have been retaliation had he done some kind of act as punishment or revenge toward OP. Him having an attitude about it isn’t retaliation (unless he was calling her names or something, which he didn’t); Just a petty emotional response lacking in empathy. \n\nIf he’s being an abusive AH then 1000% she needs to cut her losses and leave before it turns into something worse. There must be more going on behind the scenes that she’s leaving out.", "Sometimes I come home late. Sometimes my partner does.\n\nSometimes we're both home and one of us just goes to bed later than the other.\n\nSometimes when we go to bed the other wakes up regardless of how carefull we are.\n\nIt's still our bedroom and we're still entitled to sleep in it.", "Go back to sleep.\n\nWear ear plugs.\n\nHe needs to be considerate and leave everything ready outside of the room and then go in quietly. More than that it is what it is.", "Well when the page becomes ‘AITA If We Assume X Y and Z is also true’ then maybe you’d have a point.\n\nBased on the info given, OP has an issue with her husband and tried to give him a curfew and admitted to not exploring what would probably be the simplest solution. OP doesn’t get to tell us what she assumes husband would or wouldn’t do if asked to compromise and just negate it as an option. At that point we should just let OP tell us who TA is cause it’s an unwinnable argument.", "Where? The part where she said “He’ll just follow me into the guest room” ? As in, “he will” not “he has” as you are saying????\n\nUnless this is stated somewhere else other than the comment I replied to, what OP is saying here is that she assumes that won’t work. Hence my question.", "You've never heard of sleep deprivation torture? Lucky you. It's literally used on POWs. \n\nHe can exist... in another room. Or, he can be respectful of her and come home at a decent time. He has other choices, but he's impeding on hers by her choice \"I'm going to sleep now, I don't want to be disturbed in my sleep\" (her ONLY option, aside from locking the door) and he trounces all over that. You act like he won't get any sleep at all if he can't disturb hers.", "You're an idiot. Do you understand what consistent interrupted sleep does to the mind? Especially when you can't get away from the cause of the sleep deprivation in the first place? She's tried. He's an A-hole for torturing her by being willfully self-centred and not caring about her wellbeing.", "LOL, are you OP's husband or something?", "She already said in the comments that she’s tried sleeping in another room and he just follows her in there. Does she not deserve to get a good nights sleep, without having to get a divorce?", "i found ops husband, or at the very least some poor woman’s husband who acts the same way. no he is not entitled to wake her up, she also tried sleeping in another room and HE FOLLOWS HER does she not have a right to sleep in HER HOUSE it’s also her property that she pays for and she has exactly as much right as he does to it. so if he is going to follow her to another room and wake her he clearly just enjoys annoying her and it’s not about the room.", "It's her husband, not boyfriend. How do you know it's his place? (Unless I missed a comment, she doesn't specify) She might have paid for it,or more likely, since they are married its in joint names. Which would mean he has exactly the same rights to it as she does. Why do you default to assuming its all his and then leap from there to the frankly ludicrous conclusion that whatever he does, she's the AH?", "Some class act victim shaming right there.  Love it.", "Well it's her husband so \"dump him\" isn't that simple. And I've had times were my husband has been oblivious and woken me up. And I told him later \"Why did you make so much noise and turn the light on? I am quiet as possible when you sleep.\" \n\nMy husband's response? \"I'm sorry baby. I'll make sure I'm not so loud.\" Mind blowing, I know.", ".... The police won't get involved if she's locking the bedroom door. He still has access to the house. At the most they would say it's a civil matter. Otherwise you would see parents calling the cops because their teen locked their bedroom door. \n\nAnd seriously? Setting a firm and clear boundary, then following through on specified actions IS taking responsibility. Dumping a spouse over this is an extreme reaction if this is the only issue where he doesn't respect her boundaries. There's not enough info to determine if breaking up is a reasonable response. \n\nScience shows that the average man needs 6-8 hours off sleep a night to stay physically and mentally healthy. The average woman needs 8-10 hours. Sleep delegation is serious, has lasting consequences for both physical and mental health. Especially if it's a consistent issue. And you can build a \"sleep debt\". Say you need on average 8 hours. For four days in a row you are only getting four hours of sleep. One night of ten hours of sleep isn't going to make up for not getting enough for the previous four nights. He is disrespecting her, deliberately at this point. Especially as she has tried moving to another room. He is Shelly violating her boundaries, and yes, she has a right to protect that boundary, including by licking him out of their shared space.", "Yeah that’s weird then. The post should also be reflected to include that info.", "I love this response.  There's context you didn't realise so now you're deflecting.  How cute.", "That's one of the reasons. Another one is that therapy is supposed to be a \"safe space,\" so it encourages vulnerability, openness, and intimacy. An abuser will take the things you say in therapy and use them to hurt you.", "Yup that, and what the other poster has said about intimacy and safe space.  People like this basically play the victim.  Butter wouldn't melt, but really they are all about their own entitled wants and they are extremely manipulative.\n\nI ended up on medication and in counselling and believed i was seriously mentally ill as a result of this kind of thing in couples counselling.  Counsellors for couples basically focus on \"the couple\" so the rules you are held to are the rules they are held to which assumes equal balance of power and trust me, it is NEVER equal.\n\nYou take an issue like this to couples counselling and she will be told to stop locking the bedroom door and shutting out her husband, he will act like the victim, he on the other hand will continue doing what he does under the guise of plausible deniability.\n\n\"She just hates me, she doesn't want me near her, she pushes me away\" then she becomes the issue, she goes crazy and starts doubting herself and suddenly the therapist is helping to gaslight the victim and it also gives the abuser tools to continue crazy making and eventually she will beleive she is the issue and the therapist will reinforce it because they won't see what is really going on.  Insidious but honestly... stay the hell away from couples counselling in this situation.", "Yeah absolutely, it isn't about peace, it's about winning and control.  Always.  Apparently a lot of people on this thread don't \"get it\" though.  I dont' know whether i'm disgusted by that or envious of the ignorance.", "Nope.  \n\nNope again.\n\nBut \n\nIgnoring your partner when she has stated her needs MULTIPLE times.  Yes abusive/neglectful.\n\nfollowing your partner to the guest room if she tries to move there to sleep is abusive and controlling.\n\nBeing told that if you continue to disturb her you will be locked out and then banging on the door repeatedly and waking her up.  Abusive yes.\n\nThe issue here is NOT about the room, it is about him getting his own way, and it just blows my mind how people cannot see this.  But perhaps because I have been through it, that is why I can actually see it.    It is a control mindset.  I must get my way mindset.  it is nothing to do with peacefully wanting to resolve the issue at hand on the part of the husband, he doesn't want to do that and it is clear from his beahviour.\n\nIf he had left her alone in the guest room i may agree with you, but he doesn't so there you go.  It's not about the bedroom.", "Deliberately waking her up and dismissing her when she  tries to talk to him about it. \nIf she goes to sleep in the guest room he follows her in there too. Expecting an apology from her, silent treatment, they're all red flags.", "Totally agree with you. \nMy sons father used to deliberately wake me & my newborn up at 4am. \nI told him to sleep in the spare room , he did, but he would then come into our room at 4am turn the light on & get his work clothes, i used to ask him to get his clothes the night before, he refused! I started putting his clothes out for him, he would still walk in the room & turn the light on, knowing full well this woke up our newborn, then he would call my phone between 6:30am - 7am to wake us up again! He would ring & ring until i answered that phone.", "While I stand by my first comment about not seeing him as the jerk just for getting ready for bed, thinking about what you and a couple others said about him deliberately following her to guest room and waking her up is awful for the reason you said; at best it's immature, at worst it is abusive. Either way he's an AH for that.", "Yes.", "That is why we have an INFO option.", "I agree, the husband is a little baby who refuses to sleep without his teddy-wife.", "The man or the woman?", "I don’t see the point of clarifying your comment was before OP’s clarification unless you were annoyed since you could just.. edit it and nobody would care. But you’re just sinking your feet into the sand because ?", "I think you're missing the point a little bit on this one.  The issue is him insisting on coming into the same room she is in, she's already said he will follow her into the guest room if she goes in there did you not see that comment?   So her locking the door was an ATTEMPT (albeit a failed one) to set a boundary.  you cannot set boundaries with people like this.  They want you to know they are in charge, they get to call the shots and she will end up being accused of all sorts by trying to defend against it.  It is a shitshow she cannot win.", "You're missing the point of this problem.  Whilst what you said is right and good for you, the issue in this scenario is not about him being unable to sleep in his room, the issue is him being able to do what he wants when he wants it.\n\nIf she moves to the guest room, he follows - did you read that comment? If your partner was to say to you \"Please could you sleep in the guest room hun because I have an early one tomorrow\" would you ignore and just go against them? Wwyd in that situation? Odds are you'd be respectful no? But ops husband is not and if she moves, he will sleep in THAT room with her instead.  \n\nThis absolutely is abuse and control.  100%.  To anyone who hasn't been in that situation or seen it first hand, yes it just looks like a couples tiff comparable to any other healthy marriage, it is 100% not that.", "Dude, she avoids him so he can have the bedroom all to himself and he follows her. He just want to wake her up. Can't you see that? She asked him multiple times, she gave him the bedroom all to himself, he just wants to wake her up.", "If YOU wake up because ur a light sleeper then yes its not torture. Imagine if really loud winds or a thunderstorm woke her up. U really gonna start blaming nature? If she has sleeping issues she needs to see a Doctor or get some sleeping pills. You don’t lock people out of their property. Not unless ur an AH.", "You are right. They have the same rights to the house. But only one of them is keeping the other from using the property they pay for.", "Only victim is the person getting locked out of their own property. Bet all yall would love it if tht happened to u.", "He’s not turning on the light or making abnormal amount of noise. OP is the one with sleeping problems. Again just cause YOU are a light sleeper doesn’t mean u get to get mad when someone makes any sound.", "The only thing worse than an abuser is an abuser that has learned how to use the therapy \"buzzwords\" to abuse you further.", "It could go that way. Or it could also play out with the counselor agreeing with the AITA consensus that the dude is being an ass. I actually think the latter is far more likely. \n\nEven though counseling could play out poorly for her, your personal experience can’t be assumed to be a representative one.  In my experience, the emotionally abusive person got called out on some things and decided we needed a new counselor. \n\nHonestly, unless the husband is a complete dunce, counseling is likely insufficient to repair things. But that doesn’t mean it will turn into some horror story you’ve described.", "They resist the idea that a lot (more and more) people are all about power, in any form, than being decent.", ">The issue here is NOT about the room, it is about him getting his own way\n\nWell, that, and with his actions he's intentionally depriving her of sleep, which is a method of torture, not to mention an abusive act.", "English is not my first language and I like to take the time to write out and check over my comments. I apologize if this in any way inconveniences you.", "So was locking the door the right move then?", "I'd be as quite as possible and sleep in my own bed.", "Or he just wants to sleep with his wife, which is perfectly understandable.\n\nIf my partner started sleeping in the guest room it's when I'd start thinking our relationship had come to the end.", "Getting locked out of his room* when he has another room with another bed perfectly available, and only after op tried to sleep herself in the guest room just to have her husband wake her up anyways. \nYou sound like the AH husband.", "So having been through similar to what OP went through, do you know what happened \"Euphoric\\_Dog\"?\n\nI left.  The recommended resolution from your good self.  I left 7 months ago now.\n\nThe house that I left was jointly owned by me, and I left.   I effectively ended up in a situation I couldn't live in my own home without being consistently stopped from living normally.   I effectively ended up \"locked out of my own property\" because I couldn't live there without being mentally tortured.\n\nDo you know what the alternative was?\n\nIt was getting sicker and sicker and less and less sleep, and more and more miserable and depresed, and feeling more and more suicidal.  Ever heard of chinese water torture? I suggest you read up, because that is the effect of these kinds of situations.  They drive you literally mad to the point of illness, job loss, depression, misery and insanity.\n\nDoesn't matter though does it....as long as your narrative isn't disturbed on this one.\n\nSo if OP leaves, is SHE then getting locked out of her own property by virtue of the fact she can't live there and get a peaceful nights fucking sleep?  Or will it still be her fault because your ego is too fragile to accept you're actually a misinformed dolt.", "She states he is \"getting ready for bed\". IMO that obviously doesn't mean he is just slipping into the covers. He is probably undressing and opening or closing doors/drawers. He could have previously attempted to do everything in the separate room and slide into bed. But it doesn't sound like he is even willing to make an attempt at being quieter. Especially when she's brought it up to him.", "Oh god, weaponized therapy-speak is the fucking worst. The number of assholes who use the word \"boundaries\" to justify being hyper-controlling monsters these days is astounding.", "Hell yes.", "No it doesn't mean it will, but it also doesn't mean it's a recommended approach, and actually the general consensus is that it is not recommended at all.\n\nGenerally speaking emotional/mental and covert abuse like this is carried out and if it's addressed with a counsellor the abuser plays the victim.  It happens a lot.  The counsellor is stuck in the middle, they are \"couple focused\" as I've said.  They hold both people to the same standards when the power is not balanced in any way shape or form.\n\nIt is at best a pointless exercise and at worst a 101 for the abuser in how to abuse even more effectively.\n\nFor my personal experience we had a Gottman certified therapist, and my ex partner learned how to use the Gottman principles to effectively blame me for everything that went wrong.  If he did something shitty and I brought it up to him for example then it was \"because I didn't bring it up properly and missed out a step\".  What was the missed out step? Accountability.\n\nSo what would that look like?   \"I know that I haven't always been the best partner, but I am upset that you called me a cnt and cheated on me\".\n\nShall I go on???\n\nIn his individual sessions with the counsellor however it was \"i'm just very worried about her, she doesn't seem herself, she seems very unwell and i'm concerned and i just want to do my best for her, but she seems to be mentally unstable - please help me to understand what I can do to better take care of her\".  \n\nI'm only now coming out of the fog of \"this was all my fault\" 7 months later.", "Exactly.", "The point is there is no right move in these situations.  I know first hand because this sort of thing has happened to me.  \n\nWhen she sleeps in the guest room, he goes in there when he comes home.  When she sleeps in their room, he goes in there.  When she locks the door, he bangs on it, when she doesn't, he disturbs her.  There is no right way of handling this because HE is the problem along with his entitlement over her.  \n\nI speak from 5 years worth of experience.", "I think locking the door is the right move for now. She might not have gotten any sleep, but she sure reclaimed her body autonomy. He believes he has a right to be next to her body, even if it harms her or she says no. That’s why he follows her to the guest room. If he can’t learn to respect her boundaries, the actual correct answer would be to be done.", "Yeah so if your partner went to sleep in the guest room for example, you wouldn't follow? You'd just come home and sleep in YOUR bedroom yes? Congrats, that's normal behaviour and you are reasonable.  This is not what is going on here though.  \n\nOP is experiencing coercive control.  Extremely difficult to spot, and extremely insidious.", "Are you actively trying to misunderstand the post? OP said she sleeps there when he comes back home late (from friends and family functions he can leave earlier from) and he actively follows her there instead of going to bed and letting her sleep as she had asked him multiple times to do.", "Or saying you're gaslighting them every time you don't agree with them in an argument.", "Seems like you want to avoid saying that locking the door wasn’t the right thing to do.", "I wouldn't follow no, but I would have been pissed out of my mind.", "I didn't misread or misunderstand no. I'm saying that sleeping in separate rooms for me would be a red flag that meant the relationship was coming to an end. He shouldn't have followed her, but she shouldn't have gone to the other room to sleep to start with so...", "Or that you're not letting them \"express their emotions\" because you ask them not to scream and swear at you.", "My ex tried that on me. We remembered something differently, which meant I was gaslighting her. \n\nI went back through the chat history and provided the receipt.\n\nShe did not take that well. The relationship lasted about 1 day beyond that I think?", "Lol... right.  It sounds like you're focusing on me rather than actually admitting that yeah the husband is a shady ah.   \n\nBut so you're clarified:   Yes, I think locking the door was the right thing to do in the situation.  \n\nWould I normally think that locking a spouse out of the marital bed was ok? No.  But if you've told someone MULTIPLE times that them coming home in the small hours is disturbing your sleep, if sleeping in the guest room results in you being followed and if you are getting pissed off with their controlling behaviour... yeah i think locking the bedroom door is fucking acceptable after multiple infractions and multiple complaints.  \n\nWould I have done it in the situation? Yes!!! Did I? yes! Do you know what happened?   He broke the door down, grabbed hold of me and threatened to hit me.  Why? Control.  That's why.  \n\nEvery day is a school day for people like you isn't it.", "There you go then ;-)", "So she should just let him fuck up her sleep just because?"]}