{"id": 32370, "submission_id": "18b2sof", "title": "AITA for telling my former step-mom she's not my mom and to leave?", "selftext": "My dad (M47) and my now-former step-mom (F34) have been together for about 12 years. She always seemed to like me, but I always thought things were a little weird with them considering the age gap because at one point before they began dating she was my babysitter and my mom's (F47) best friend. When I was little, my step mom (whom we will call \"K\") was diagnosed bipolar. She would frequently lash out from not taking her medicine and would tell me that \"her life would be better without me\", would call my mom and tell her to \"get me out of ‘her’ house\", and when I was very young she kicked me out of the house and told me to go back to my mom's, though it was states away at the time. A few weeks ago in another episode, it was revealed she had been cheating on my dad and she announced to our family that she wanted a divorce. I won't lie, I may have been a bit of an a-hole by laughing about it to myself when I first got the news. She then said since she was leaving she did not have any kind of authority over me and told my dad to \"figure it out\". So, we did. Me and dad started to talk about how we would handle finances, my two sisters (2 and 7 y/o) with their schedules, among other things, all while K locked herself in her closet and called her new boyfriend. She has been extremely distant from the family despite still living in the house and won't pay attention to her kids. Most of the time, the kids come to me because my dad is at work. When discussing the kids in the divorce, K doesn't even want to keep them overnight! She wants to have them a few hours a day, then bring them back here for us to feed, put to bed, and get to school. She's moving far, either, her new place is 3 streets down. While otp with her new boyfriend she said \"no one in the house respects her as a mother, especially some\" and shot me a dirty look. I ignored it, but then as time passed she started to boss me around more and more telling me to \"stop being lazy and do more around the house\" because I was laying down and eventually I snapped. I told her that if she feels like no one respects her as a mother, it's because she doesn't act like one. I also told her that she does not get to pick and choose when she gets to play \"mom\" and that if she was going to choose not to, she should just leave. K got very offended and started crying saying that I'm \"the worst daughter ever\" and she hopes that my two sisters don't grow up to be like me. I then came back with \"thank god you're not my mom, cause I'm not your daughter!\". She called her boyfriend again and started yelling for him to come pick her up because she needed to leave. She kept telling me that she was leaving and I yelled \"fine, leave, it's good riddance.\" to her. I got very angry messages from her, her boyfriend, and various other family members saying that I'm the a-hole. I stand by what I said, but... AITA?", "created_utc": 1701747505, "permalink": "/r/AmItheAsshole/comments/18b2sof/aita_for_telling_my_former_stepmom_shes_not_my/", "score": 307, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my former step mom shes not my mom and to leave. it might make me the asshole because she's still a figure of authority whether i like it or not and i should probably respect her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA she did it to herself. Just block her and her BF's numbers, along with anyone else who's reaching out to bother you about it. It's none of their business.", "NTA. And I think you know that and needed to vent, which is ok, because your family is in a crappy situation with a woman who not only appears to be very unwell but is - by your telling - kind of a bad person. Keep your head up and focus on your siblings and dad and try to cut your losses with this sham of a stepmother.", "INFO\n\nDo the \"various other family members\" include your dad? People who don't only know you through her? People who didn't just hear her side of the story?\n\nFrom what you've said, I'd say NTA for sure, but the fact that other family members are expressing a different opinion (aside from her and her boyfriend, I mean) makes me wonder if there are things not included here that result in a different conclusion.", "NTA. Wow, I would have done the same.", "Where has your dad been all those years of her mistreatment of you? If she did want out he’d stay married to her,huh.\n\nYou’re NTA you’d just had enough.", "Nta, next time she leaves change the locks and lock her out. Have your dad start divorce proceedings immediately and go for full custody. Save all the text and be extra sneaky and things like text her so what kind of schedule do you want with your children. And that way your father can get child support from her. There's no reason she should still be living at the house. Get her out and get her gone.\n\nAnd you did nothing wrong because you're not her daughter so she can't tell you anything. But yeah your father needs to kick her out change the locks and start divorce proceedings immediately", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy dad (M47) and my now-former step-mom (F34) have been together for about 12 years. She always seemed to like me, but I always thought things were a little weird with them considering the age gap because at one point before they began dating she was my babysitter and my mom's (F47) best friend. When I was little, my step mom (whom we will call \"K\") was diagnosed bipolar. She would frequently lash out from not taking her medicine and would tell me that \"her life would be better without me\", would call my mom and tell her to \"get me out of ‘her’ house\", and when I was very young she kicked me out of the house and told me to go back to my mom's, though it was states away at the time. A few weeks ago in another episode, it was revealed she had been cheating on my dad and she announced to our family that she wanted a divorce. I won't lie, I may have been a bit of an a-hole by laughing about it to myself when I first got the news. She then said since she was leaving she did not have any kind of authority over me and told my dad to \"figure it out\". So, we did. Me and dad started to talk about how we would handle finances, my two sisters (2 and 7 y/o) with their schedules, among other things, all while K locked herself in her closet and called her new boyfriend. She has been extremely distant from the family despite still living in the house and won't pay attention to her kids. Most of the time, the kids come to me because my dad is at work. When discussing the kids in the divorce, K doesn't even want to keep them overnight! She wants to have them a few hours a day, then bring them back here for us to feed, put to bed, and get to school. She's moving far, either, her new place is 3 streets down. While otp with her new boyfriend she said \"no one in the house respects her as a mother, especially some\" and shot me a dirty look. I ignored it, but then as time passed she started to boss me around more and more telling me to \"stop being lazy and do more around the house\" because I was laying down and eventually I snapped. I told her that if she feels like no one respects her as a mother, it's because she doesn't act like one. I also told her that she does not get to pick and choose when she gets to play \"mom\" and that if she was going to choose not to, she should just leave. K got very offended and started crying saying that I'm \"the worst daughter ever\" and she hopes that my two sisters don't grow up to be like me. I then came back with \"thank god you're not my mom, cause I'm not your daughter!\". She called her boyfriend again and started yelling for him to come pick her up because she needed to leave. She kept telling me that she was leaving and I yelled \"fine, leave, it's good riddance.\" to her. I got very angry messages from her, her boyfriend, and various other family members saying that I'm the a-hole. I stand by what I said, but... AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Your dad needs to protect you better. How old are you?", "NTA. Give it to her. She deserves it.\n\nHaving mental illness is no excuse to be abusive towards people *especially* children. Not only that she didn't take her medicine, which was irresponsible. I'm sorry you had to go through that. Good riddance, indeed, that she's now out of the picture. \n\nIf her flying monkeys keep bothering you, block them. With her out of the picture they're not family anymore and with how delusional they're about her, they deserve the blocking.", "NTA. She sounds attention seeking. Repeating yourself over and over while loudly packing to leave? She expected you to apologise, grovel, and then she would be magnanimous and stay. \n\nShe sees her position in your life as way more important than it is, and she's probably most angry that you aren't \"fighting\" for her (like some demented teen romance drama). To then realise that her departure makes things better for those she's \"leaving behind\"? That must *burn her*.", "everything i wrote was all the details, the family members consist of cousins, aunts and uncles, and her siblings all on her side. i count them as family because they've been in my life for 11 years. my dad believes i had the right because of all the things i've been through", "Yep, NTA then.", "Completely NTA then, her side is delusional if they think she is any semblance of a mother", "NTA\n\nIt's her family not yours anyway so who cares and when she is out for good you will all be so much happier...", "NTA the only thing I will caution is that you don’t throw your life (or 10 years) away parenting your sisters. I don’t know your age but go to college, have a career & family of your own.", "I'm trying to decide, OP.  Would it have been better to yell at her as you did, or to look at her coolly and say something like \"You are no longer my problem\"?\n\nBecause you do make her sound like someone that it'd be fun to tell off.", "NTA but the way to manage someone like this is to stay calm and disengage/ask them to leave when they get abusive/shout etc. \n\nStand by and stick to your own values rather than getting destabilised into tit for tat.\n\nTry and hold the balance between boundaried and empathy. \n\nThe more you argue with her, the more she gets your energy.", "NTA and she's got some nerves. Her flying monkeys can get bent.\n\nDad should file for full custody: your half-sisters would be better off.", "Save the messages and show them to your father. They may help him in divorce", "NTA.", "Into- she's openly cheating, in a new relationship, talking about divorce, etc. Why hasn't your father told her to leave yet? Her being in the house is extremely unhealthy for the other kids in the house. Why isn't your father protecting them?", "NTA but why didn't you ever go live with your mom? Your dad has never done enough to protect you from K, and now it's not your job to parent two little kids and help your dad run his home (I'm assuming you're still a kid too - under 18?).", "Very complex stroy", "Why is she still there in the first place?\n\n&#x200B;\n\nNTA NTA NTA to the nth degree.", "NTA but where’s your dad. I feel like this is something that you shouldn’t have to deal with", "thank you", "he's been working, most of the time didn't know anything until i was able to get proof", "> Nta, next time she leaves change the locks and lock her out. \n\nWhy do people think this is a good idea?  It’s illegal.  Same as changing the locks on your 18 year old or your deadbeat bro who’s been living rent free in your spare room for three years.\n\nTell them you want them gone, sure.  Physically bar them from their legal residence, no.\n\nIf you want someone gone, give them whatever length of notice is required in your jurisdiction in whatever format is required, usually written.  If they own part of the residence, work it out to get legal possession yourself.", "Yeah, where's the dad in these interactions?", "I would rather not disclose my age but I will say I am late teens. My dad has recently apologized to me about ignoring things he noticed but most of the time he was at work when it would happen and she would spin things on me.", "i really tried to remain calm, i did. but after years of this building up i just snapped.", "i'm not sure and i have voiced my concerns but she seems to want to do things as a \"family\" still. like our pre-planned family trip to disney, she still wants to do. thats in march.", "i lived with my mom for years prior and had to move in with my dad again because things were even worse there. i will not disclose my age but i will say i am late teens. i also have opportunities here i can't give up to leave for my mom's again (educational, job, relationship, etc.). my mom isn't a saint, and her ex-partner actually treated me far worse than my step-mom", "she wants to do things \"as a family\" and her boyfriend hasn't moved into the state yet.", "work mostly, sometimes he wouldn't know before i started getting videos of outbursts", "mainly at work... sometimes he genuinely wouldnt know how bad things got until i started getting videos of her screaming at me and banging on doors to try and get to me", "I not surprised, it sounds exhausting. I dont mean stay calm for moral reasons, I just mean it'll be better for your peace of mind the less you involve yourself in her drama", "I wouldn't go that far.  If OP sees them as family, they are the OP's family.  But nevertheless, it seems they've been given with a one-sided narrative here about what happened, so their supporting the stepmother who turned to them for support doesn't mean they've reached a fair and trustworthy opinion on the situation.", "i agree with this ^^ \nthese are people who have been in my life for upwards of ~15 years. i love most of them dearly and i have always treated and been treated like family with them. it hurts to hear them say things like this."]}