{"id": 32383, "submission_id": "18b7e5w", "title": "AITA for not wanting to move even though I (36M) previously told my wife (36F) I would?", "selftext": "My wife and I have been together for 10 years, married for 8. We are from the midwest but now live in New York City. We have lived here since we got married. We have triplets (3F, 3F, 3M). They were spontaneous and surprised us a lot. My wife really wants to move back to the midwest to raise the kids and be closer to her family. When my wife was pregnant, I agreed that we could move later but never specified a time. \nMy wife is a stay-at-home mom. The triplets started part-time preschool this year. And my wife said we should start to look for schools for them for next year in Michigan, Ohio, or Pennsylvania because she is prepared to move. I was shocked when she said this out of the blue I told her that it is too short of a notice to plan an out-of-state move right now to be there by fall next year. I said I also don't really want to move right now. I love the city and I have a great job. She got angry and said that this was always the plan. I said we never talked about it again since she was pregnant. She said she hates it in new york and she wants to be with her family. I honestly have never heard her say she hates new york so that was shocking. Anyways, she is very angry at me now and said that it is unfair for me to not want to move now. I understand that I should not have agreed to move a few years ago but am I not allowed to change my mind?", "created_utc": 1701764370, "permalink": "/r/AmItheAsshole/comments/18b7e5w/aita_for_not_wanting_to_move_even_though_i_36m/", "score": 221, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) changed my mind about not wanting to move \n2) I previously agreed to move and told my wife I would. She is now expecting that we will move.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Info\nDoes she have any support network in New York?", "NAH\n\nBut the question you have to ask yourself is this.  Is living in New York more important to you than living with your wife and kids?  \n\nI say this because it sounds as though she isn't happy and is expecting to move away.  From her perspective you did agree to this and have not said anything different since then.\n\nYou are perfectly within your rights to change your mind on something like this but have to accept that you may not be the one who gets what you want.", "INFO\n\nMichigan, Ohio, or Pennsylvania\n\nPresumably only one of those is closer to her family (unless they live in London Ontario), so why does she suggest the other two?\n\nAll things being equal, however, at least Pennsylvania is a tolerable weekend commute from NYC", "Slight YTA because growing a child without a family support is hard. I can't even imagine how exhausting triplets would be. Clearly your wife and kids need more support. But I do understand your position as well. There will be no winners in this one.", "NAH, just  two people who changed their minds as their circumstances altered\n\nNAH, just two people with incompatible desires.  \n\nNow what?  I guess it depends. Can you get a job in Bumfuck, Ohio, that would support your family? Because now you're a dad, yeah, they come first, and it may be as well to accept that due to that your urban dream is now shattered. And be honest, housing a growing set of triplets in NYC is going to get frighteningly expensive and fast. \n\nOr can you earn enough in NYC to support two homes? I'm not saying divorce, necessarily, but have a long distance relationship and a whole lot of travelling at weekends. Because the alternatives (you both move or you both stay) mean one of you will be miserable and you'll resent each other.\n\n\nBut let's be honest. She's gonna win this one. \n\nTLDR: Condoms would have preserved your Yuppie lifestyle but now that's over. Enjoy Ohio. I hear the potatoes are lovely at this time of year.", "Sorry, but YTA. You had an agreement with your wife to move back near her family and now that it’s time you changed your mind? \nMoving from the Midwest to the City is tough and a huge change, she did it because you agreed to move back.\nYou totally disregarded her feelings when she clearly said she wanted to move, and any support she may get from her family, not to mention an agreement you made together. If you don’t move now, I doubt you’ll ever move. You’re making excuses.\nThere’s no excuse for breaking your commitment to your wife and treating her this way. I know I’ll take bullets for my opinion, but I think YTA.", "NAH but life seems to have you reaching in different directions. She wants to go, so you are on notice that she'll be miserable and resentful. \n\nYou agreed to something you don't want, so moving means you'll be the miserable and resentful one. \n\nThis is a lose lose situation. But you DID agree. So don't be surprised if she looks to go without you.", "NAH. \n\nAssuming your job is not one that you could easily move to a different state with or are fully remote if she’s a SAH mom that’s a big ask in terms of shifting income. Also assuming you’re making enough to cover your lifestyle comfortably. \n\nI do think you both need to have a big conversation about why she wants to move and why you don’t. Both of you may have valid reasons, and even if you don’t move or you end up moving, you need to understand where the other is coming from.", "NAH this is a typical long term relationship issue. i see where you both are coming from. i wonder if you could come to an agreement like moving to the midwest next year and then back to nyc before the kids go to high school or when they go to college. if you love the city a suburb in the midwest near a city may be nice as well. it’ll work itself out.", "Your wife is a SAHM raising triplets without family support?!?!?!?!?\n\nStart job hunting in the mid-west, mister.\n\nYTA", "Triplets, of course. Nearly as common as twins on here.", "This is kind of a mild ESH — you shouldn’t have said it if you didn’t mean it, and she should have talked more about it over the years rather than expecting you to be ready in less than a year’s time.\n\nBut I really think this situation calls for a couple’s therapist, not an asshole-choosing subreddit", "NAH. Redditors here apparently think humans are only allowed to decide once and never be able to change their mind or idk whats going on in their heads. There is no easy way out", "NAH. But could you get a job elsewhere that would support your family? Also I suggest a compromise. A house in the suburbs, you commute. You could become a Westchester snob. I think New Rochelle or Tarrytown would be lovely. Even Jersey has some nice areas. And if you got really desperate, I suppose there’s Connecticut. No, it would not get her closer to family, but maybe it would provide a better quality of life that she would enjoy. More space, a yard, etc.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife and I have been together for 10 years, married for 8. We are from the midwest but now live in New York City. We have lived here since we got married. We have triplets (3F, 3F, 3M). They were spontaneous and surprised us a lot. My wife really wants to move back to the midwest to raise the kids and be closer to her family. When my wife was pregnant, I agreed that we could move later but never specified a time. \nMy wife is a stay-at-home mom. The triplets started part-time preschool this year. And my wife said we should start to look for schools for them for next year in Michigan, Ohio, or Pennsylvania because she is prepared to move. I was shocked when she said this out of the blue I told her that it is too short of a notice to plan an out-of-state move right now to be there by fall next year. I said I also don't really want to move right now. I love the city and I have a great job. She got angry and said that this was always the plan. I said we never talked about it again since she was pregnant. She said she hates it in new york and she wants to be with her family. I honestly have never heard her say she hates new york so that was shocking. Anyways, she is very angry at me now and said that it is unfair for me to not want to move now. I understand that I should not have agreed to move a few years ago but am I not allowed to change my mind?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH I think it’s time for an outside party to help get to the bottom of this and find a solution that works for both of you.\n\nIt sounds to me like she’s overwhelmed by the kids and would love to get some help (I.e her family). I’m surprised she’s trekked through 3 years already alone. Poor woman must be completely burnt out.\n\nHowever, it’s not easy to change jobs or move across state lines so I understand your hesitation. You don’t yet know your earning power in the Midwest and what kind of a life that will give you and your family.", "Guessing divorce is in the picture", "NAH. I'm a city dweller and have no desire whatsoever to move to the middle of nowhere to raise a family. I'm also vehemently against it as I lived in villages as a child and it was incredibly boring and isolating.\n\nMy wife is on exactly the same page as me, which is something we discussed before children entered the equation. Neither of our families live close by.\n\nUnfortunately, your wife has decided that she doesn't want to raise children in the city. I doubt she really hates New York, but it helps her feel more justified in her decision if she convinces herself that she does.\n\nI've no doubt she wants help from her family with the triplets - and that's not unreasonable, hence the NAH.\n\nThat all said, you have my sympathy. You probably will end up leaving your job and lifestyle for something a lot more sedate elsewhere. Your wife will be happy and your children will hopefully thrive. You'll also be doing the \"responsible thing\". That doesn't mean you shouldn't be upset about what you have to give up. I'd be gutted.", "YTA.  If you had changed your mind why didn't you have the conversation with her?  The last agreement you two had was you guys would move when the time was right.  She gave you plenty of time.  And then to claim you were shocked when your wife said she wanted to move \"out of the blue\" is really being disingenuous.\n\nAt the end of the day the party who wants to change an agreed upon plan has the obligation to open the conversation and discuss the change.  You didn't do that so YTA.", "NAH\n\nYou are in a partnership so you own 50% of the decision. Changing circumstances dictate change decisions. Map out all the pros, cons, risks and mitigations for all options. You are the breadwinner so job security may be a big issue but is there any way to look for a career jump in a big city in a different state?", "Yta you lied to your wife to get what you wanted", "Poor communication from both of you to be honest. But as you are the sole income provider for the family, I would say the final decision on where you live is ultimately down to you.", "She’s expecting to do something you agreed to do. If you don’t do this, YTA. \n\nThat being said, she can’t just spring a timeline in you like that. It might be that you’re not ready, and need another couple of years. \n\nBut you’ve got to do it eventually, and you may as well do it before the kids start school. The truth is, the kids will be better off not growing up in NYC.", "YTA. NYC is super cool when you are out and about in the city and working all day. For a SAHM with three toddlers, being stuck inside a NYC-sized apartment all day sounds like a nightmare.", "You’re allowed to changed your mind just as your wife is allowed to not change hers.\n\nI think you need to go back to your wife with a bit more of an open mind and work with her to identify  the benefits that she believes the family will get out of the Midwest and the current shortcoming of New York, then vice versa. Is talks of being near her family a signal your wife is feeling overwhelmed taking care of the kids? Is that something that can be resolved by hiring a full time nanny, moving to a bigger place? Can you afford that in New York? Communicate with your wife!\n\nYou are right that it would be too immediate to plan for an out of state move, but that’s not an excuse that will keep working for the next 15 years.   Some things are gonna have to change if you want to maintain a happy marriage, happy family.\n\nAt the current stage you’re NTA but if you do nothing then you will become one.", "NAH\n\nShe's pissed that you changed your mind. But she waited until 4-5 years into marriage to bring up moving back near her home.  She did the same thing.  Then she tops it off later saying she hates NY. That's certainly something you don't wait 10 years to tell your SO.", "YTA\nThe reality that I see is that moving back to the Midwest is most likely based upon more than your oartner's dislike of NY and grounded more in 2 things: (1) the fact that she sees the Midwest as an area more conducive to raising children and (2) being closer to family, especially with triplets, would be a huge help/support as the children get older. Family connection and having extended family around is very important to some people when they move beyond just being a couple. Having the back up of grandparents and potentially aunts and uncles can provide a huge support if kids become unwell, need medical attention, parents want to have a night off and need a trusted sitter, etc. The bright lights of the big city fade for many as family takes center and \"partying\" recedes from your weekend plans. It's an adjust but it's also a maturing, an evolution into another phase of life. \n\nAcknowledging your partner's needs is hugely important and discussing this could go a long to avoiding resentment that might build if you decide to shut down a very legitimate plan. \n\nThink carefully.", "NTA people are entitled to change their opinion…however, if you want to stay with your wife, it might be a matter of being flexible on where you live…", "Yeah YTA.  You know for a fact that your wife is unhappy in NYC.  You don’t know for a fact that you won’t be happy elsewhere.  Also yes, you did agree to move and your excuse that you didn’t say when is extremely lame.", "NAH\n\n&#x200B;\n\n\"he got angry and said that this was always the plan. \" .. It really was not. There was no specific plan, only a sometime maybe . \n\n&#x200B;\n\n\"When my wife was pregnant, I agreed that we could move later \" .. this is NOT a commitment, just a maybe.\n\n&#x200B;\n\n\"She got angry and said that this was always the plan\" .. it was not THE plan, it was HER plan - and she made it without you agreeing.\n\n&#x200B;\n\nTHis can maybe be solved by couple's therapy - or it might lead to a separation.\n\n&#x200B;\n\nSo: No AHs here. And no need to move just because your wife demands it. HER plans are not more important than yours, and staying where you are is the default when you can not agree on any course.\n\n&#x200B;\n\nBut this might lead to separation due to different life visions. Your wife is an AH for not discussing it BEFORE she got pregnant.", "Yta", "If you change your mind, then that is the end of it??? some partnership.\n\nShe stuck it out for 4+ years but that is not enough??? some partnership.\n\nIn 4+ years you never thought to clue her in that you had a different idea??? some partnership.\n\n7 months is not enough time to plan a move?? You have one person's happiness on your mind but what about the other 4 people in your family, they get to live your life on your terms??", "YTA\n\nSo 9 MONTHS is too short notice (actually THREE YEARS and 9 months)\n\nShe's lived somewhere you wanted to live for years, shouldn't you consider her point of view too?\n\n&#x200B;\n\nTBH sounds like she is moving anyway (and I don't blame her trying to raise triplets without family support isn't easy) - which would you prefer moving with your family or living in new york alone?", "You two are probably crazy busy. Her being a stay at home mom of triplets, and you trying to work enough to support your family. I wonder if you both have said things and neither one has actually heard and listened, but just thought it was something just said.  You and your wife need to sit down and talk and listen to what each other is saying. Hear the thoughts for and against the move.", ">She got angry and said that this was always the plan. I said we never talked about it again since she was pregnant. She said she hates it in new york and she wants to be with her family. I honestly have never heard her say she hates new york so that was shocking. Anyways, she is very angry at me now and said that it is unfair for me to not want to move now. I understand that I should not have agreed to move a few years ago but am I not allowed to change my mind?\n\nInfo: So.. you thought about it at least another time since your wife asked you years ago because you changed your mind about it. Did you at least once talk to her about your change in view?", "ESH\n\nYou don’t brush off life-changing plans like moving and you can’t change your mind and not speak about it. The fact that you reached a point where you decided that you didn’t want to move but *did not* say that to your wife tells me that you knew she was serious about moving sooner rather than later. So you didn’t tell her how you really felt because you didn’t want to honor your tentative agreement to move. You pretended it wasn’t an issue until it reared its head again.\n\nI don’t know why your wife is deciding that things must happen now without a plan or definite agreement in place. “Later” sounds like an excuse to me, but she interpreted that as a promise with some semblance of a timeline.\n\nYou need to have a discussion about this. Everyone’s reasons need to be examined and respected. And hopefully a solution can be born of communication with your wife.", "It is unfair. You agreed to the move. You never admitted you changed your mind prob cuz you're a coward. You have 3 toddlers she needs help you sound so selfish", ">  Is living in New York more important to you than living with your wife and kids?\n\nI think you are right; I don't see him getting to do both.", "he agreed 3 years ago and she never mentioned it again so it is kind of her fault . She also has a responsbility to communicate with her husband esp about huge changes and not throw it at him because she didn't want to move for 3 years it was jsut a convo in the past no real plans", "You got that wrong.- Courts will keep his wife from moving the kids away.\n\n&#x200B;\n\nHe DID not agree, she  is deluding herself.", "I never look at Pennsylvania as being in the Midwest.  So that option surprised me.  I wan to know where exactly her family lives.  I guess it just seems that wife’s side is vague.  I think they need to sit down and discuss things realistically and what the expectations are?   Is wife expecting a New York salary in Ohio?  Fighting over where you live can lead to divorce but financial issues are one of the leading causes of divorce.", "While not NYC caliber, there are 3 large cities in Ohio, and a fair number of good sized cities.  It's not just farms and 2,000 person trump thumper towns", "\"I may be here at 3am trying to calm a screaming baby while my friends are out having fun in a bar - but those who know me, know where I'd rather be.\"", "\"But let's be honest. She's gonna win this one.\"\n\n&#x200B;\n\nShe is not. Because IF it goes to court during a divorce, he very likely CAN keep her from moving the kids away.", "She didn't move to the city based on him agreeing to then move back to the Midwest. They already lived in the city, she then said she'd like to move back some day. No specified timeframe.", "I could have missed this but where did he say she only moved to the city because he promised to move back? He said they've been together for 10 years and it was brought up when she was pregnant 3 years ago.\n\nNTA but they need to figure this out. One person can't decide where and when they move out of the blue. Randomly to bring it up 3 years later is out of the blue. Needs to be a discussion and an outcome they're both happy about.", "There was NO agreement. It was a \"\"When my wife was pregnant, I agreed that we could move later \" .. this is NOT a commitment, just a maybe.\n\n&#x200B;\n\n\"later\" is also: for retirement.", "but a long time ago and they didn't talk about it again so she is kind of the AH for not talking about it again like even mention that she hates NY in 3 years is odd", "you are suggesting this is made up? could be.", "\"You probably will end up leaving your job and lifestyle for something a lot more sedate elsewhere.\" .. or not. HIS choice.\n\n&#x200B;\n\nWhy would it be automatically HIS duty to give HIS live vison up for his wife?", "Why do you doubt she really hates NYC? You don’t know her. I’ve been to NYC several times, ok to visit but I’d never want to raise children there.", "I don't think he ever changed his mind. The way he talks, he never really considered it. He just said whatever she wanted to hear and when she never brought it up again, was relieved she forgot about her silly idea.", "He did not agree to this.\n\n&#x200B;\n\nit was a MAYBE LATER, not a speciffic plan. His promisse / Agreement would be fulfilled witl moving back for retirement.", "Key point - he Agreed so why wouldn’t she think he was on the same page?", "I’m not sure what extreme circumstances you think they’re working with here but that’s unlikely. Parents divorce and one leaves the state with kids all the time, and it’s completely legal.", "let's be honest, courts are a coin-flip", "Yes, I live in Ohio and have never heard of Bumfuck Ohio.", "true", "eh?!  context?", "We’ve very quickly gone from she wins to nobody wins.\n\nDivorce is rarely a desired outcome for anyone - not saying it’s the wrong choice in all situations, but it doesn’t sound like OP otherwise wanted to split up with his wife.", "Perhaps", "So “I agreed” is not an agreement?? lol \nThis is as funny as you are. You’re both a joke, as is OP’s “commitment”.", "Navigating NYC with triplets would be hell. I did it with one, and that's a lot. With the costs of 20 years ago. \n\nShe never let go of the idea, and probably hit that point of being done with NYC.", "I just find a lot of stories involve twins- and a bit more rarely, triplets which I find rather hard to believe. \n\nLooked up the general stats on Google and it says that 120,291 twin births out of 3.7 million births in the U.S while triplets are around 1 in 62,500 pregnancies. So like 1.5 percent. But on this sub like half the posts mention the offspring are twins, and a few handful of triplets which are slowly getting common.", "I didn't say it was automatically his duty. \n\nI said he probably will. He'll have to choose between his lifestyle and his family. A lot of men have to compromise their lives to some degree when they have children. The question here is the level of compromise that he's willing to make.", "Because she's lived there for eight years and never complained. It's much easier to argue the case for going somewhere else if you say you don't like where you currently are, especially if your case for the new destination isn't particularly strong.\n\nHis wife wants a support network and familiar surroundings. She's asking that OP give up his career and his home. It's not a small ask if it's not vital that they move - and it isn't vital. Preferable for her, but that's it.", "It sounds like there wasn’t a time frame.  I just wonder how hard it would be to find a well paying job in his field?", "He agreed to a \"later\" .. Not to NOW.\n\n&#x200B;\n\nLater is not a plan. \"For retirement\" is also \"later.", "The point is that they didn't talk about it again . Arcording to him she did not complain about NY for years and now is mad because he doesn't want to move right away . All I'm saying is that the wife didn't communicate well with her husband and it's ridicilous to get downvoted for that . Looks like this downvoters give a damn about their partners needs and wishes.  He was not against moving but he has a job he likes . I get it that she wants to be closer to her family but what about him ? Is he suppose to stay in NY in a one bed appartment alone ? She could have started with asking him to find a job there and then looking for a house . That's communication and she is unable to do that .", "All of Ohio is bumfuck Ohio, <3 from KY LMAO", "Oh, it's nothing too heavy! \n\nObviously the \"right\" thing to do is to put his family's best interests before his own. But there is a common perception that the very state of having children will automatically render everything else less meaningful. I consider having fun to be an important part of life - and not being able to do that isn't something you can mentally brush under the carpet.\n\nI've missed parties to look after my children. There was no question of doing otherwise, but I was still upset to miss the party.", "true", "Navigating NYC alone is a hassle 😂", "3K and PreK are free in NYC. Way better than most other places. I know quite a few people waiting until kindergarten before moving from NYC specifically to save money.", "I never said she can't move , all I'm saying Op says she didn't complain about NY , he didn't hear her hating NY before so it is her fault for not talking about it with her hubby and now throwing it on him , they didn't talk about moving for 3 years so hubby kind of pushed it aside and now she throws at him that they talked about it . Yes maybe but it was 3 years ago .They should at least talk about if he can find a good paying jobs there or does she expect him to move into a one bed room and stay in NY and see his family once per month", "gotcha. makes sense. \n\nthen again, they are an extreme stressor, and it's unusual stories that are most likely to make it here.  If you only read Reddit you'd think about 33% of all people are trans and everyone is an atheist. Reddit is not representative.", "How do you know she never complained? He said he never heard her say it, maybe he just brushed it off or didn’t want to hear it.", "Maybe it’s time he looked.", "Ignorant comment. Clearly you’ve never been to Ohio.", "Ah, gotcha. Thanks. Yes, all that.", "\"Obviously the \"right\" thing to do is to put his family's best interests before his own.\"\n\n&#x200B;\n\nMoving away from new york is NOT something that is in the kid's best interest. Kids can be raised in new your as well as in the midwest.\n\n&#x200B;\n\nSo: Not \"the family\" .. just \"his wife wants this\".", "They moved there when they got married. Do you not think they talked about where they were going to live?\n\nI find it hard to believe you could live somewhere you disliked for so long without your partner being aware of it. Not saying it's impossible, but married couples do tend to talk to each other.", "We can only judge on what OP tells us.", "I agree with you. I live in a huge city and have never considered it necessary to move out to raise children.\n\nHowever, it sounds like the family may well fracture if he doesn't agree with his wife. It's an awful position to be in.", "Maybe she just sucked it up b/c this is what he wanted. Married couples do that too.", "Living in NYC Childless is also a lot different than raising children there. Family dynamics change.", "I think it’s probably that she hates NYC *as a parent.* It’s a fun place to be with a partner or alone, but I imagine your perspective can change when you’re navigating that as parent, especially of three, especially when they’re all the same age. I can see that she probably loved it once but as her life changed, grew to resent it", "Or the family might fracture if the wife doesn't agree with him?", "Yes, and that is different. Even though millions quite happily raise children in NYC, I can understand people not wanting to. Lots of my friends moved out of town when they had children.\n\nShe could argue that she'd be happier raising them in the Midwest and that's fine. Her saying she hates New York seemingly from out of nowhere doesn't add weight to her argument because it's unconvincing unless she's been hiding it from him all these years, which I concede is possible even though it feels unlikely.\n\nEither way, it's a mess.", "YTA but not because you \"changed\" your mind (you haven't been too hot on the idea from the beginning) but because you changed your mind and didn't tell her right away. Also because you lied to her at first. Major AH", "YTA. Sounds like you made an agreement, and you're backing out for some pretty flakey reasons.", "YTA\n\nYou talked about it 4 years ago. This is not out of the blue", "Why does your wife hate living in NYC? Is it because she is home with 3 small children in a (probably) tight apartment, since almost all NYC apartments are tight? It's much more of a hassle to have kids in the city, dealing with the schlep up and down and the busy streets and for your wife, isolation. You, I assume, are off doing grown-up stuff at the office and don't deal with that. Why don't you see if you can find a way to make city and childcare easier for your wife and help her get connected with others? Or move to Westchester if what she wants is a house with a yard? Those 3 Midwestern states are pretty big, and it sounds like she wouldn't even see her family much if she is on one state and they are in another.", "NAH. People are allowed to change their minds- let alone about big things that require you to find a new job, new friends, new housing etc. you two should sit and discuss the realities of moving and how a) they meet your respective needs and b) how are you two going to address them.", "YTA\n\nwe've done: \nPA to AZ\nAZ to PA \nPA to WA\nWA to CO \nCO to TX \n\nAnd we have at least one more left because we don't want to be in Texas. \n\n4 of those we did with cats and 2.5 were spur of the moment. \n\nYou can move. \n\nYou'll be fine. \n\nYou discussed this with your wife and agreed to the move. If she truly hasn't brought it up again in 3 years than she is also an AH. \n\nCommunication is the key to all relationships.  It sounds like you both need to work on that.", "YTA.\n\nYou agreed to move to the Midwest to raise the kids.  When exactly did you think raising the kids started? They're three.  It sounds like you've already delayed on fulfilling your promise. You definitely should try to move before they start kindergarten so they don't miss a year of developing a community at their new school. \n\nAlso,  you have plenty of time to plan a move before the fall. My wife and I decided to move from Texas back to the midwest in September and we were moved in by May.  And we both worked and needed to find jobs. Maybe your job/house/school search ends up taking longer,  but theres no reason to start trying with Fall as the goal. You can also live apart temporarily if you need more time and the kids need to start school (assuming you can afford it or she has family that would be willing to take them in for a bit).\n\nI would dust off that resume....or decide that what you want is more important than what you promised your wife and come to terms with the potential consequences of that decision", "YTA - idk why the first comment (at this time) is N A H...", "YTA because you obviously changed your mind about moving and never talked to her about it. It’s fine to change your mind, but you need to talk to the other person about the why’s and when’s, especially for something as big as a move across the country. It sounds to me like you never wanted to leave and might’ve told her ‘one day’ with no timeline while she was pregnant because you had no intentions of moving back but didn’t want to flat out say no for like false hope is better than no hope?? \nI got pregnant and raised my son for a year 2000km away from any family and friends, my pregnancy also came as a surprise and we agreed to stay until we could figure out a move. Being isolated at home all day, especially with three babies and then toddlers with none of “your” people (family and life long friends or friends with deep connection) around is just not sustainable mentally for a stay at home mom. Even if your children go to school, she’s still experiencing all of the good and bad parts of being a mom with out being able to share that closely to the people she loves best. Personally, it killed me. On those impossible days when she didn’t know how she made it through, it’s possible the thought of being close to her family one day comforted her. And you’ve essentially taken that away from her, and you’re also telling her you have no intention to do something you agreed to. I’m sure she feels betrayed and stuck somewhere she might be unhappy. Not having a timeline is probably really hard so she tried to get one by asking about the schools, so you should discuss that next, and “when we have everything together” or something of that kind is not a timeline. Specific tasks that need to be done, milestones that need to be reached, or changes of lifestyle or even a calendar date if it’s that simple etc, everything that has to get sorted before you’d consider moving. Then let her choose if she’s willing to wait for you. Because that’s ultimately what you’re facing if you have no intention of leaving New York.", "YTA, she's thinking about the family, your family. Staying at home is not easy, kids will be better with other people around helping your wife. You can start discussing the moving, but you should remember that you are a dad now", "NTA. She's trying to get you to move with no safety net. If you could transfer to a different location with your job, that's one thing, but not everyone has that luxury, and it's foolish to plan a move without job security.", "Yta. I guarantee this isn't the first time your wife has mentioned it lately. I'm familiar with both areas mentioned, and raising triplets in NY would be insanity.", "YTA. Your life has changed. To provide for your family you have to change. Unless you make a lot of money. Native New Yorker here - you need a lot of money to raise three kids well. Go to the Midwest. You can live your city life in your 50s if you still want when college is done.", "YTA. Your wife is the primary caregiver of triplets and in a city that is not made for raising triplets. You told her that you would move when she was pregnant and likely she continued with this shocking pregnancy (surprise spontaneous triplets?! ) because of your promise to move. I would consider divorce over this.", "In my opinion, you are TA. You told her that you would move. Regardless of if you set a date or not, you promised you would.", "\"But I never specified a time\" - but it was clear that you were agreeing to move to \"raise the kids\" in the Midwest.  So, now is the time.\n\n\"I was shocked when when she said this out of the blue\" - yet you said you have talked about this.\n\n\"too short notice...to be there by fall next year\" - you can't find a job and orchestrate a move in 9 months?\n\nIt isn't clear that you actually changed your mind.  It sounds like you had no intention to move and instead of talking about it with your wife as an adult, you just kicked the can down the road and pretended to agree.  This is how marriages fail.", "NTA - this was discussed 3-4 years ago and not since. I guess she was happy and able to raise them without a lot of family help in the hardest years. I feel like something happened to spur this. \n\nDid she lose some friendships recently? Anything change back in the Midwest - death, sickness, birth, etc? \n\nYou need to have a conversation about why she wants to move now. See if you can overcome the issues. Maybe she needs a housekeeper/nanny so she can work. Maybe she just needs a few afternoons off (although she should get this since the kids are in preschool).  Maybe she thinks you work too much especially if there is an attractive coworker. This is her way of getting you away. \n\n You might need a therapist to help each other hear the perspectives and find a resolution.", "She may not have said it outright to you, but she may have given you hints that she didn't like NYC. Or when she tried to bring it up, you shot her down. More so, if you don't move soon it'll be another 6 years when that windows open up because if you can avoid it, you shouldn't move kids out of school unless there is something unavoidable happening like military. The best time to move is in between school graduation like from 5th to 6th or 8th to 9th...well here in Texas.\n\nAlso what's to stop you from going well now isn't a good time and keep stringing her along. She wants to be with her family and have her family support. She wants her kids growing up around their grandparents.\n\nYTA if you didn't consider any of this.", "YTA, she made you three babies and you had an agreement.", "Her request isn't \"out of the blue\" at all. YTA.", "YTA - she needs her family and you lied to her.  3 kids is a lot - especially triplets.", "YTA, consider how you would feel raising children at home alone all day while your wife worked and got to socialise for 8+ hours with adults. Stay at home parenting is very lonely. \n\nOf course you would prefer to stay in NYC, you havent lost your previous lifestyle for those 8+ hours because your wife has taken on that change for you. Relationships, and parenting, is about give and take. Youve had 3 years more freedom than she has had. Now isnt the time to throw your toys out of the pram over a prmoise you made and dont want to keep.", "YTA. you previously agreed, changed your mind without telling her, and want her to continue to be a SAHM with triplets with no family support.", "NAH I see both your positions here", "I understand your position that you have a good job in NY, but other than that, but kind of yes, YTA, to begin with she didn't comment on the move “out of the blue”, you had already accepted, so I don't understand why it surprised you, or what did you expect? that she would forget it? I understand that you did not expect her to suddenly say that she wanted to move rn, but you two made an agreement, you can talk about it and make a satisfactory plan for both of you, put your cards on the table, set dates,  remember that being a sahm is very difficult and even more difficult is raising 3 babies and, even with the help of your husband, it is normal to want to be close to your family, you should consider it, here the whole family matters, not just you or not just your wife. I understand that finding a new job somewhere else is a challenge, and it's not just about moving and that's it, both of you would have to do your part. I hope you can fix it and reach an agreement that you two can fulfill.", "INFO: Is there other underlying reasons your wife wants to move? It sounds to me like its more than just looking for a school.\n\nHigh costs of living? Why doesn't she like NYC? Does she have a specific or ideal way of bringing up the children i.e. close to nature and away from the city?", "NAH\nBoth your wants are valid. What you both need is more, and better, communication. She should have told you she hated NY and you should have told her when you had a change of heart and wanted to stay. \nThe two of you need to have an open, honest conversation about this move and decide if it's even still possible. As the breadwinner, I would assume a move would be predicated on whether or not you could find another job that would allow your wife to continue to stay at home with the kids.\nI wouldn't ignore her desire to be closer to family. Being a SAHM can be very isolating and having a community you can rely on is important for her mental health.", "NAH. 3 years is pretty patient and she probably could’ve given you a better heads up about her feelings. You didn’t see it coming and have a great gig. I was in Cali and we moved asap which was hard but beyond worth it for mental health and being near family. \n\nHope it goes smoothly!", "Why does she want to move?\nBeing a SAHM of triplets sounds miserable, frankly, and I’m someone who liked staying home with my kids and thinks it’s good for families for a parent to do so. \nI suspect your wife hates her life. New York is awesome. It’s not awesome to schlep three little kids at once around without a team of assistants. \nIf she had any sort of job or life before the kids she’s probably depressed as hell now watching it go on without her. \nI’d be craving the assistance and familiarity of my family too. And I firmly believe the reason I get on with my family is because I live in New York… and they live in Nebraska. \n\nHow’s your job? Do you work 9-5 and that’s it and then you’re home and an active, involved parent? Or are you just a bit outside the city with an hour plus commute each way on top of your work shift? Do you travel a lot for work? Generally speaking, people I know who say they have a “great job” in New York City are on salary, and they put in a shit load of hours for that job. What’s your wife doing during the time you’re at work? What do you do when not at work together? When is the last time you went out on a date together? Do you two ever do things without the kids? Does she ever do anything alone without the kids and without you?\n\nI don’t know the answers to these questions, but these are questions that you should think about because you will find the answers in these questions as to why your wife wants to move. If you solve some of those problems? You may be able to stay in the city. \n\nNow, if your wife is one of those types who feels that a large comfortable 3000 square-foot plus single-family dwelling is what she needs in order to be happy while raising children, I got nothin’. But maybe if the answers to why she suddenly hates New York are in my questions? Maybe you can find a way to fix it and stay in the city you love with your great job.\n\nNAH.", "Maybe your wife is burned out by caring for 3 triplets and could use some help from her family.  Having family around when you have kids is a lot of fun !  We grew up on PA and OH and it's a beautiful part of the country.  Not enough info because you don't say if she is a SAHM or who is raising the kids most of the time.", "Triplets, SAHM?? What support does she have, sounds like she needs some more and her world must be consumed with raising them. My friend had a triplet and even her mom moved in for a bit to help out. You almost need one person per child. Speak to your wife and try to understand her perspective. You can change your mind but you can’t just decide not to move when that was on the table all along. Have you even considered life elsewhere to see your job prospects? Get a headhunter if needed", "ETA and NAH, you’re just experiencing a total breakdown of communication. \n\nBoth of you really should’ve clarified what “someday” means, both of you really should’ve brought it back up, and both of you really should’ve been checking in regularly to see if each other was happy with the current situation. You both dropped the ball on communicating - her being miserable in NYC shouldn’t have been a surprise to you, she should’ve said so more & you should’ve asked more. So no you’re not an AH but also you’re sort of an AH lol \n\nInfo - has she REALLY never brought it back up? Ask her why. Have you never once asked? Ask yourself why. \n\nInfo - does she have literally ANY support system in NYC? NYC is expensive AF and being a SAHM is suuuper isolating, if you haven’t at least got some people to come in and visit sometimes. She can’t just go out & meet a friend like she would’ve pre-kids. Does ANYONE other than you come in with some kind of consistent schedule to give her a break? Have you even *said* the words “date night” out loud to each other in 3 years? If her only support with the kids is you, and tbh what babysitter’s gonna agree to 3 kids under 5 for a reasonable enough price that you can go on a date every month or so, then your relationship is suffering and you may not even have realized it yet. She’s right to see that as a concern that’s a fair bit more important than “NYC is awesome & I like my job”.", "ESH It has been 3 years and neither of you have bothered to check in on how the other was feeling about this?", "My question is can you find a job that supports her and the children in another big city in the Midwest closer to family? Cuz you can’t move and expect to live a similar lifestyle if there is not a similar income occurring and I know sahm can be hard but now that they’re in the school ages she’s not gonna have as much caretaking to do during the day and she would have to accept going back to work to make up for the definite loss of income and there is so much more than just that to consider that there needs to be so many discussions about compromises on both people.", "I can't tell if there are NAH or if it is ESH at communicating. \n\n>When my wife was pregnant, I agreed that we could move later but never specified a time.\n\nI fully admit that I might be jaded by my own shitty family, but I would like some clarification on this. This kind of 'agreeing' is how a lot of people agree to avoid fights in hopes of the other person forgetting the situation entirely. If that was your intent, YTA.\n\nTo be clear, your wife should have been bringing this up to keep it as an ongoing conversation between the two of you. I don't have triplet toddlers, so I can only imagine the levels of exhaustion she feels, but it is still her responsibility to communicate a life change if she wants it. If she expected you to know when she wanted to leave without saying it, then she's the AH for that, but not for wanting a family support system to help with your children.", "ESH or NAH - it’s a toss-up. You guys aren’t communicating. I lived in a city I hated and my partner and I said we’d like to move someday. We talked about when we’d pull the trigger. I was so relieved. When we saw our window to move, we made it happen. If he would have changed his mind I would have lost mine. But I stayed for a few extra years after I was ready to leave, before he was, as a compromise. FWIW, there were moments in which I felt trapped in a life I didn’t want, living in a city I didn’t like. But knowing that moving was on the horizon made it tenable.", "Op I think it’s a bit of both asshole but also ntah. \nYeah it’s cool about wanting to stay and change your mind, but you have to think on this one. Also too op could have been blind to the wife wasn’t happy but she stayed quiet because she didn’t want to ruin his job atm, or anything else that’s getting left out. Wife also could be missing family or something else could be going on that op or wife hasn’t told us (like family stuff and someone could be sick yk that kind) if grandparents are still around wife could also want to be closer to them so they can see them more and the kids can have a relationship with them. Before anyone says “ they can just fly or drive” I’ll remind ALL of you. Being stuck in the car with 3yrolds is exsaughsting in if it’s self and in the us flying is waaaaayy too expensive and not everyone want 3 crying three year olds on a plane.  Also if ops job offers it he can easily work remote while in other states and or work for the same job just in a different state (depending of course) \nHere is where op is the asshole. The moment he changed his mind about leave he should have talked to wife right away. Instead of leading her on the path of ‘ I can’t wait to get out of the city’ he should have sat down with her and they could have talked about what to do. If you can’t keep that promise you should have never said anything in the first place.", "What were the circumstances that you moved to NY? \n\nAre you still open to moving in the future? If yes, I don’t think you are doing anything wrong here.", "I'm going to go with ESH.\n\nIt sounds like your job isn't remote, so you and your wife need to discuss a timeline for the movie. I'm sympathetic because she probably has gone through a whole bunch having had triplets, but this really should've been a discussion and not something just brought up now as a definite matter. You are right that planning a big move may not be doable in a year.\n\nYou suck because it sounds like there is no compromise and that you didn't make the agreement in good faith or that at the very least, moving the deadline is just a way of you avoiding the conflict. I don't know what your finances are like, but I can't imagine that being the sole breadwinner of three kids and a stay-at-home wife is easy in NYC. That isn't even going into the idea of being close to family. With three states as possibilities, there should be some kind of compromise.", "NTA, this does seem “out of the blue” even though you guys had previously talked about it. Especially since there was never a concrete head talked about. It’s possible she had a timeline in her head she never talked about. A move like that is big, and this does seem like short notice. This does seem like something you guys need to actually talk about and plan for. I guess let her simmer down and retry to talk about it once you can get through to her logically. Then you guys can have a real conversation and set a plan.", "I bet OPs goumada won't move to Ohio", "Is it worth the divorce? My ex thought it was. Just sayin…", "NAH, just 2 people with conflicting and incompatible desires...\n\nHonestly... she's going to win this one, as you made the promise; so you may as well curb the resentment by being involved in *where* you end up. Given the *timing*, smart money tells you she doesn't want to raise *children* in NYC, and I don't blame her. She also wants her familial support network for her and your children, I don't blame her. There's a lot to be said for the changes people feel when they become parents, it is not uncommon to have one lifestyle when child free and something polar opposite when they have children. The city was good when you were child free, now it isn't.\n\nEdit because my phone thought child free needed to be child freedom lol", "If you still wanted big city vibes you could suggest Chicago. It's Midwest and there are suburbs but you could potentially get away with living in the city if you make it as a compromise of moving to the Midwest if we can live in the city.", "\"I made my wife a promise and I'm shocked she thought I meant it\"\n\nYou are allowed to change your mind. But YTA. And be prepared for her to move with or without you", "NAH but you will be divorced within 2 years because of this.   Clearly your wife is not a priority.", "We went through this. I did want to move closer after having my first. My husband laid out much harder that it would be to find a job in Michigan if he ever lost his job or wanted to move up.  She is probably really lonely, and it's hard to have one 3 year old, and she has three.  Being a stay at home mom with no support or close friends sucks.\nI personally feel that living in a city with kids is hard unless you are wealthy.  My sister is doing it, and the pandemic was so hard because they lived on the 15th floor. They have to start thinking about and testing for high school right now, while their oldest is in 6th grade and if he tests into the better school their is no guarantee his brother will also be able to go there.  Have you thought about any of this? Your wife probably has. Private school isn't always the answer or an option.\n\nApproach her with an open mind. Listen to her. Suggest that you start planning right away, but also that you need to have some very real discussions about it.  Can you transfer? Can you find a job with room for growth in your field if you move? Does she want to work? Suburbs are easier in many ways, but everything is hard when you can't find a job.\n\nFinally, if you really want to be in a city, let me suggest Chicagoland! We are in the first suburb west of Chicago, and it's been a great place to raise our kids.  I can get to MI or OH in about five hours (to get to the people I want to see). As compromises go, I feel we have a good one in Chicago.", "If you want to be closer to the Citybutstill have a more laid back lifestyle look in Eastern PA.along I-78 Easton, Allentown, Bethlehem...or further south along I76 on the west side of Philly. Even NJ would work if you stayed away from the east counties...Sussex in nw NJ or south by the oceanor inlandlike Gloucester County.", "It’s not just about you anymore. You both need to talk through the pros and cons calmly. NTA, but naive.", "Ohio>New York....It would be horribly expensive raising 3 kids in NY . The crime, the traffic, the noise, the chaos ... I didn't necessarily want to move to the tiny town I'm in ,but my parents are old . Our town has nothing . We got an old auto parts store and turned it into our own personal club, movie theater . Yah there is still nothing here in town ,but we are never bored and have made a huge friend group . You make your life what you want it to be , bring NYC to Ohio !!! Take all your vacations to NYC , decorate your space to reflect your life there so you won't miss it quite as much. Congratulations on your triplets though , wow !! You'll  have your hands full no matter where you are ..good fortune to you", "I think it's time to grow up and buckle down. \n\nYour kids and spouse will benefit from being closer to family, and so then will you. \n\nI don't think anyone is an asshole here, but you did lead her on for years thinking there was a plan which you then reneged on. Maybe she wouldn't have had the children, or maybe she would have moved home while pregnant. \n\nMaybe she struggled the last few years, keeping her head down because she knew help and home was around the corner. \n\nChoosing a job over every other factor in your life when you have a family is always a sure fire way to destroy it all.", "NAH but you really need to find a job in the Midwest before you move. Communication skills should improve on both sides.\n\nWould she agree to Philly or even South Jersey as a compromise?", "You are allowed to change your mind, but you would be TA if you stop her from moving if she really wants to. If I was in her place, I'd want to move anyway and you would be welcome to visit.", "INFO - Can your job be done remotely or can you find a job in the Midwest that will allow your wife to stay as a SAHM? Is she willing to go back to work to help support the family if you cannot support on a single income?", "ESH because you’re both expecting the other to be psychic.", "YTA \n\nIt's fine if you changed your mind, but you discussed it, and both agreed. Your wife wanting to move before the kids start school makes sense. Better they start where you're gonna land than uproot them and make them change schools and friends etc..\n\nWhen you agreed, what was your timeline? It'll be 4-5 years, that's reasonable from what you've stated.  You like your job but you also have a family that had to come first. \n\nI bet if you look back this isn't the first time you're wife expressed dislike for NYC. plus raising kids is tough and it helps to have family nearby! \n\nTldr; it's fine if you changed your mind, but you're still TA", "YTA.\n\nNo you are not allowed to change your mind, particularly for things that affect both parties and would otherwise have been deal breakers from the start.", "YTA you told her you would move when she was pregnant, now more than 3 years later you say it comes as a shock she wants to move. You shouldn't have promised her to move if you knew you didn't want to. \nYour wife is a sahm mom for 3 3yo, she needs all the help she can get and moving will give her that. But you don't want to because you love the city more than your family...", "You're allowed to change your mind, but you're TA for doing so when it means backing out of an agreement you made with your wife.  YTA.\n\nYou \"agreed that we could move later but never specified a time.\", and it's been 3-4 years since then.   I wouldn't call this \"out of the blue\"\n\nYour wife stayed in NYC for years now despite wanting to move, because you wanted to stay.  When does what she want start mattering to you?", "YTA. I moved from the midwest to NYC and loved it when I was child free and had a great job. Then I got married and we enjoyed exploring new restaurants and going to shows and stuff together and it was great! And then we had our daughter. And it sucked. Completely. I navigated a stroller up and down subway stairs, I strapped her onto me to go shopping. No car, so I just had to carry her around even doing laundry. And that was with just one child. \n\nWhen she was a year and a half old, we moved out to the suburbs of Long Island and got cars. Daughter went to daycare and I stopped working part time from home back to a full time job. I got my life and a social circle back. It's still hard and hectic, but I don't hate my life. \n\nIf I had three toddlers in NYC I would go absolutely insane. She needs a support network. She hates the city. She needs a house with a yard and friends she can talk to while their kids play. Her life is 100X harder than yours is right now. I don't care how hard your job is, hers is unimaginably harder. If you don't believe it, offer to watch the kids for a week while she takes a break or a vacation, and you will get it. If you refuse to move out of the city with her, you're going to find out the hard way when you split custody how ridiculous it is to keep an eye on three toddlers without any help.", "Yta. You made a commitment. If you didn’t want to move you shouldn’t have said you would", "Is it possible for you to work remotely?", "NAH all you did was tell her it isn't a great time. And you're right, there's alot of stuff you'd have to do and it could easily take longer than she wants it to even if you had said yes immediately. I guess sit down with her and go over every single thing that needs to be done in order to make it happen and then from there y'all can decide how to go about it?", "YtA and no your not allowed to she could have made different choices if you didn’t agree then its completely unfair to her for you to go back on this. I hated my partner for 2 years after finding out he wouldn’t move after he told me he would. It devastated me and put me into the deepest of depressions. I didn’t leave him but it really took a lot for me to see him well again after this betrayal.", "What kind of support does your wife have with the triplets in New York? If she’s feeling isolated, that’s probably why she doesn’t care for New York and wants to go home.", "NTA \n\nFive people are relying on a single income. That means that your career drives the bus", "She *cant* move away *with her kids* without his permission if they divorce first.", "Why would you rob Idaho of its most famous thing? \nIt would have been better to mention corn- they have literal festivals to celebrate corn in Ohio, I’ve been. ;)", "I just can’t help but to think here “happy wife happy life”. I know that’s not the standard these days but your wife gave birth to 3 kids and she is probably constantly thinking about what’s best for them (not that you aren’t but anyone who says the mom isn’t the constant thinker and worrier can bite me), and she feels she needs her family around to help raise her kids. I mean don’t we all?? Aren’t those of us with happy lives being raised around aunts and uncles and grandparents better people? I know I have a better perspective on life because other people were in mine influencing me as I grew up. I’m so thankful for that. Count your true, real blessings.\n\nEdit: LOL the potatoes. That’s Idaho. But yes Ohio has plenty of farmland so expect amazing and CHEAP farmers market crops and good food and beautiful scenery as you travel from city to city. Just gets a little dodgy in southern oh, west of the mountains.", "Moving from NYC to a flyover state would be a hard No for me.\n\nIf it’s not on the Atlantic or Pacific coast, the only acceptable alternative is Colorado.", "Me negative out here, just cuz you have kids doesn’t mean you need to give up be depressed and not have any dreams or goals. Wtf is this mindset", "\"Bumfuck ohio\".tell me you've never been to ohio without telling me you've never been to ohio.just because we have more national parks than most states doesn't make it bum fuck.", "Ok I had to laugh at your hilarious TLDR.\n\nAgree with everything.", "I agree with the NAH and that she will \"win\". The rest seem a bit aggressive, imo.\n\nIf OP's wife wants the kids to start school next year in a different state then active planning for a move should have been happening before now. There is a major gap in communication about raising the kids. The failure in communication falls on both parents. Wife seems to want their children to have a school experience more similar to her own than they would in the city. \n\nOP really needs to be more involved with raising the kids. Though that may be a harsh judgment. As a couple it is obvious you need to talk about it more.", "Agree with NAH. Your income won't be as high with a job outside NYC. We have a high tax rate but net pay is still higher than a lot of other cities. On the other hand, you've got triplets and education in the 5 boroughs is ridiculously expensive. I went to nyc public schools and I value my time there but it's so underfunded.", "I agree with you.\nThe one thing that I do worry about, however, is that they move, so the wife can have the support, and she has this vision of how her life is going to be and how her family is going to support her … and then they get there and it’s nothing like what she imagined.\n\nThe agonyaunt columns, like Carolyn Hax, Amy Dickinson… they are absolutely filled with letters from people saying they moved to be near their family so that the family could help them with their kids, and the family is way too busy with their own lives to be involved in anything more than a superficial way at best. I really hope that does not happen to these people because then you get out in the middle of nowhere in the city that OP hates, and his wife still isn’t happy, and in fact, might be even more mad to have her ideas of what her family was like and how they will be there for her completely shattered.", "And family support does not necessarily mean people are stepping in to “babysit” and stuff like that. Family support is being raised around your grandparents and aunts and uncles and cousins and getting to experience that life.", "There is no guarantee of family support. Was he from those areas and would he have support? Also can he easily obtain similar employment in other locations? If not is she willing to go back to work? They need to spend the time and effort identifying all issues that will need to be addressed by the family.", "Is she allowed to? I am not sure about America, but in the UK you cannot move your children away from their other parent even if you divorce. The court can compell you to either move back or cover all transport costs and effort.\n\nIf there are similar laws then she is stuck there.", "Yeah seriously. I imagine with three kids it can be quite cramped even an infants.", "Yes, it's surprising she waited until they're preschool age to move closer to family who can help. Cannot imagine how brutal it must have been when they were infants.", "She should for a vacation and leave the kids with OP for a week, guarantee he’ll reconsider when he lives the reality of being stay at home with toddler triplets hahah", "eh.  I would assume if she's looking at the general region of MI, OH, or PA, she probably wants western PA, so more Pittsburgh than Philly.", "I assumed that she had family and all three locations, or that she was thinking that there’s areas of western Pennsylvania, southern Ohio and southern Michigan that are close enough that you can drive with it a few hours to see people there. Or it could be that she has family in Michigan, and Ohio and western  Pennsylvania close enough to drive to make it worthwhile.\n\nAlso, there is the reality that moving to a specific town is not anywhere near as easy as deciding to move to a whole state. Focusing your job search on one specific city is something that is long and complicated whereas if you say that you’re willing to move anywhere within a state, it’s a lot easier to find work there fairly quickly. She may just be willing to be within a two or three hour of her family and feel a lot more comfortable that way. She may not necessarily be craving grandma and grandpa next-door type behavior… but just within reach.", "This was my (36m) exact thought. I have twins (2.5 mf). My wife (36f) and I are still within 30 miles of our parents, but they are technically in a different state. We've been constantly talking about where we wish we could be, where we can reasonably be, and where we are.  We haven’t surprised each other with major life changes because we both agreed early on to talk things out the best we can. Has it been perfect, no. Can we do better, yes. Have we blind sided one another on what we want to do with how we live with one another? No.\n\nIt breaks down the relationship and tarnishes the ability to trust one another if you can't be open and candid with how you feel and what you want. Set goals with a realistic timeline.\n\nProfessional help may be the best starting point to help rebuild what you both have and can come out the other side stronger than ever!", "This should be top comment agree. ESH he should have been more upfront about not wanting to move. She should have talked about planning in a couple of years. Preferably before kids start full time school but not without a discussion of finances and savings", "To be fair, she told him that they needed to talk about looking into these things. To me that says the wife is ready to start looking at options and thinking seriously about this and figuring out how they’re going to do this, and he has just said flat out no. I would be so pissed in her place and I would feel so trapped.\n\nAnd if I was him, I would never want to leave to go to more of a Midwest  / Heartland area either.", "I don't think he changed his mind I think he just enjoys where they live and expected more of a conversation than \"I want to move and be settled in a whole new state within a year\" \nAt least that's how it reads to me 🤷‍♀️", "I don't think he changed his mind I think he just enjoys where they live and expected more of a conversation than \"I want to move and be settled in a whole new state within a year\" At least that's how it reads to me 🤷‍♀️", "I don't think he changed his mind I think he just enjoys where they live and expected more of a conversation than \"I want to move and be settled in a whole new state within a year\" At least that's how it reads to me 🤷‍♀️", "As a fellow city dweller. The very thought of leaving and moving into the burbs or a rural establishment terrifies me. Being cut off like that having to drive everywhere etc. It would be a hard no for me. But raising 3 kids alone w no family support would be equally rough. The right thing to do, unfortunately isn’t always the right thing for you. I truly truly feel for OP.", "Triplets. In NYC without family support is probably pretty rough.", "How is agreeing they can move later a maybe? \nI would be upset in both their positions for the record, but I can absolutely see how if in her place I go and agree to have kids with my partner, and I say that I think that we should move closer to my family to raise them later, although we don’t have to move right now, and he says “oh yeah, we could move later!“ And then I bring it up like she did just then and he says “oh no I don’t want to. I like it here” I’m going to feel totally betrayed and angry and wondering if I would’ve even bothered to have kids with him at all if I knew that this was going to happen. I would feel trapped.", "She also never brought it up, moving out of the blue is hard especially with kids and across state lines. I also think yall forget it’s hard to find good paying jobs (esp if you are the sole provider for 3 adtl bodies.) He probably gets paid well in NYC, but not get paid well in the midwest, depending on his profession. He definitely shouldn’t shoot it down, but probably further explain why you can’t rush into it after not saying anything for 3-4 years and make a finance/move plan. My parents are going thru something similar, my dad has been wanting to move for a 1-2 years, but he constantly says something about it or sends zillow listings. They only reason they haven’t is because my mom is the one who works while he stays home with my brother. But they made a plan to move by mid 2025, it’s all about communication.", "Uh, doesn't HE have a responsibility to communicate that he changed his mind? It's HIS fault for not stating that he was no longer willing to move after initially agreeing to it.", "Generally, yes - if both parents share legal custody they'd need the other's approval to move the kids to another state. In the case of a disagreement where you end up going to court (though there are steps in beteween and OP is not even at that point at all), they are supposed to look out for the best of the children. \nAnd in this case with the information provided:\n\n- OP is working (at least full-time?) in NYC to provide for the family (i.e. would likely notbe able to care for three kids alone)\n- the wife is a stay at home mom (i.e. the main care taker)\n- they have no family where they live and the children have not yet started school (i.e. they're not absolutely rooted where they are). \n\nIt's unlikely \"the courts will keep his wife from moving the kids away\".", "Courts agree to this type of move all the time. She has no safety net in NYC, she had a reason to believe that they would move and she would have that safety net. A good lawyer will get her primary physical custody and he’ll get occasional holidays.", "Michigan also has a few cities, and a lot of beautiful sites to see. I’ve lived in Mid Michigan, the UP, and the Metro area, and honestly I enjoyed living in all three and they all have their charms. You can have it all here in terms of types of places to live. Want an urban area? Metro area! Want to be a bit more secluded but have access to the cities? Mid Michigan gives you pretty good access. I live 2 hours away from Detroit and Traverse City, but there are also closer small cities like Midland, Saginaw, Bay City, and Mt Pleasant. Want to be absolutely far away from people? Welcome to the UP, don’t mind the snow!\n\nWe don’t have NYC, but we do have a lot of good stuff!", "My sister moved to the Dublin area recently and it’s actually really nice(for Ohio lol). Lots of diversity and younger people. Nice restaurants. Reminded me a bit of Denver", "Yes, and that might allow your wife to take steps to maintain her career also.", "Pennsylvania is in the mix. I'm guessing this isn't what the wife is thinking, but Philadelphia is close to NYC and has a big metro area.\n\nPittsburgh is another option and is much closer to the Ohio.", "oops!", "Can’t forget the giant cement corn field in Dublin, HA", "> she feels she needs her family around \n\nYeah. But then why did she give OP a choice of three whole states, instead of one specific town?", "Gotta love everyone on this thread who thinks there are no urban areas in the Midwest.", "As a midwesterner, this is the attitude that makes people from either coast need climb out of a hole with a first impression. It's just \"flyover land\" because nothing between New York and California is worth seeing.", "I feel bad for the kids. My aunt fought tooth and nail for her husband to move her and her kids out to rural CT from NYC. My cousin is very nice and intellectually intelligent, but ZERO social or life skills and hangs out with a small group of the strangest folks I’ve ever met and I’m from the fucking east village, nyc the pinnacle of weird shit. \n\nI’ve noticed a significant trend between rural and urban kids and I find they’re like puppies, if they aren’t socialized early, they probably never will know how to interact with others.", "I've lived and visited all over this country. There are some terrible coastal areas and some lovely ones on the interior. A lot of coastal areas cost a fortune to live in the desirable places (eg New York City or near the beach). Once you're out of the big cities and a few miles from the coast it becomes just like everywhere else, or sometimes worse because people living on the fringes of desirable areas will endure the worst conditions. People have said this already, but lots of Midwestern cities are great. I love Chicago. Pittsburgh is a great city. Minneapolis has a lot going on. I could name half a dozen other cities I'd be happy to move to if it brought me closer to family. Stereotyping huge swaths of the country is ignorant and usually indicative of people who need to be entertained instead of knowing how to have fun.", "Kinda hilarious how you're defending the sophistication of Ohio with a comment that has eight mistakes in thirty words.", "Not really. The welfare of the children comes above the father's desire to see the kids. The custody parent (very very very likely to be the SAHM) would argue its in the best interest of the kids to be in a support network of family. Random nyc working dad very likely CANNOT stop her from moving", "My wife and I lived out of town for three years, and we eventually moved back to be near one of our families, and this was our experience, being near our family was not at all like we imagined.", "Hes not asking those questions, hes just stomping his feet and saying he doesnt wanna go.", "They made an agreement 3yrs ago - not talking about it means nothing has changed. HE is the one who had a change of heart so it's his responsibility to bring it up to HER\n\nWomen should not bare ALL emotional and mental responsibility in a relationship or marriage; so annoying seeing these comments about how SHE never said anything when he's the one who changed his opinion", "And how much of the mental and domestic load she is carrying without a break.", "Pennsylvania is probably her shot at a compromise - lots of people commute Philly suburbs to NYC.", "The agreement was made *while she was pregnant*. When is a good time to uproot kids, based on the aforementioned agreement? Now? When a change won’t be that big of a deal and they can establish roots in their new home? Or later when it will be so much harder?", "Unless he’s not telling the whole story but it seems when wife suggested they move she had a timeline in mind and op thought the general idea of moving was ok at that time.\n\nHe’s probably an asshole for changing his mind while not taking in the best interest of his wife and kids but the wife probably should’ve communicated earlier when she wanted to move and how she wanted it to happen. Like deciding between three states, presumably buying a house and the actual move seems like a lot to do in that short amount of time", "I think people aren’t taking into consideration that OP is the breadwinner as well. He agreed they could move later and they never talked more about it. It’s not exactly cheap to move", "And randomly deciding that he doesn't want to move is a dick move. Why hasn't he brought up the topic of staying in NYC? He's the one that agreed to the move and now wants to change the plans they had. All the wife has done is suggest a move date for the move HE already agreed too.", ">There was NO agreement. It was a \"\"When my wife was pregnant, I agreed that we could move later \" .. this is NOT a commitment, just a maybe.\n\nLet's move \n\nI agree\n\n\nHow the fuck does become a maybe?", "If you’re using “later” as a blanket term for “when I retire,” you’re bad at discussing things. Retirement is a very distinct period in time, barring an incredible windfall that would allow someone to stop working early. To mean “when I retire,” but to use “later” is being deceitful; someone who speaks that way knows exactly when “later” is in their mind and if that’s the way the word is being used, they know damned well it’s not how the person they’re speaking with interprets “later.”\n\nThat’s a word used for being stuck in traffic (“I’ll be an hour later than planned.”) or for postponing something within a *reasonable* time frame (“We’ll have the cake I made later, after dinner,” or “Let’s plan the vacation for later this year, Jim has a big work deadline coming up in the first half.”)", "It's not his vision, it's his preference. And at one point not too long ago he was fine with the idea of moving. \n\n>I said I also don't really want to move right now. I love the city and I have a great job.", "they never talked about when and how they moved sure she s a sthm so she can work everywhere she gets a house but what about his job ? if they did not talk about it then how can she expect him to move without a new job ? How can they not talk about how they will manage the move . It's like me telling my bf oh I wanna fly to korea and he say sounds nice and I never mention a date or timeframe and then tell him oh let's fly now and he has to get vacation NOW ? They should have talked about it again", "Sure but she still needs permission then, albeit from the courts.", "Personally I love the west side of Michigan. Grand Rapids area is nice overall. I grew up in metro Detroit and am likely moving back in the next couple of years", "That's what I find perplexing about some of the reactions. The OP's wife named three states, which each have urban areas. They're not NYC, but it's not as though the wife specifically named country farmland or nothing else.", "Dublin, OH is absolutely amazing. It’s a suburb of Columbus and last I saw Columbus was possibly the top “up and coming” city in the nation. It has an amazing city life, now all over the place (ie Dublin is now amazing, when I visit I get to try fantastic new restaurants every time), the lgbtq+ scene is very big and welcoming, the jobs are flourishing, and guess what, it’s fricken affordable and it’s a great place to raise kids!", "As a European, I was wondering why Dublin, Ireland, was nice *for Ohio*. I absolutely love being confused by American places named after European places, it takes me down this rabbit hole of wondering why it was named thus.", "I used to live in Columbus and worked in Dublin. It's a great place to live and the downtown area has a lot to offer. Theater, dining, sports events. \n\nIt's also becoming a big tech giant area offering a lot of jobs. Cost of living is on the rise but nothing compared to NYC.", "I lived in Cleveland for a bit & LOVED it (I'm from Long Island). I didn't come straight from NY though, but Pittsburgh, so it's less of a culture shock.", "As someone who grew up in OH and couldn’t wait to leave OH, and I completely understand why he’d say this, I was still completely offended.", "Yeah, what is up with that? The first time we drove by it we were like \"what the heck?\"\n\nBut there are a lot of great things in the area that overshadow that field.", "Because it gives them the option of picking a place they both love and it’s within driving distance for family to still be in their lives much more often.", "I was thinking that too, but there’s an area where those three states are very close together, where it would only be a drive of a few hours to see one another. It’s highly possible that she has family in all three of those states, or they would be close enough to be worth living in all three of those states.", "Lots of family?", "Then they can move to Philly, only 90 miles away. Maybe South Jersey can be a compromise?", "nobody said that.\n\nCoast > Midwest", "I’ve visited, hard pass", "Kanda is hilarious how someone not from ohio is shit talking. 2k for a 1 bed and bath need to shut their mouth.", "How did he changed his opinion when they never clearified a date or time or anything else ? I did not hear OP say they said in 3 years we are moving !! It was just a thought of ok we may move there some day .  You are fine when your partner mentioned once let's go to Japan I love visiti japan , and then 3 years nothing was mentioned about it and now your partner says Let's go this christmas !!! shouldn't your partner talk to you before about it ? Shouldn't your partner ask if you can get vacation or if you may have other plans for the moment ? They never talked about when she wants to move and obviously did not talk about where he gonna work . Her plan is that he stays in a one bed appartment in NY and visit them once a month ? Somebody has to pay the bills", "Or even Wilkes-Barre or Scranton to NYC. That said, I would not recommend raising a family in Wilkes-Barre.", "Bet it's cheaper than the divorce, child support and alimony he could end up with.", "\"How the fuck does become a maybe?\"\n\n&#x200B;\n\nThe \"later\" makes it indefinite.  Later can also be \"when I retire\".", "I said this before and got downvoted to hell. Either people are making it up or having twins (or being one, or in a relationship with one) creates a lot of asshole scenarios", "I’ve visited the west side, but I’ve never lived there, but I definitely agree the area is very nice!", "Completely agree. It's a great city and close enough to Columbus if you want a change of scenery and go downtown or the short north or other \"hip\" areas. Lots of great attractions, an amazing children's hospital, etc.\n\nHowever, if you love the pace of NYC, it's not at all the same. So that's why I agree with NAH.", "I only know the Irish Dublin😁", "As a Michigander, I have to be fair and say I’ve heard a lot of good things about Columbus! \n\nMid west pride really do be bringing us all together haha", "Oh my gosh I had so many amazing meals while I was there. I was honestly not expecting that. I was pleasantly surprised by everything!", "My bestie lives in Delaware, OH and loves it. Also a suburb of Columbus.", "You’ll be pleased to know then that I live next to a town named Oxford. But in Michigan lol", "US was colonized by Europeans and they named towns after places that were familiar to them.", "What's really fun is when you start getting into Western New York and Pennsylvania (I'm sure other places too but these are the ones I'm familiar with) where everything is named after native Americans. We have a creek and road in Buffalo named the scajaquada and Pittsburgh sits on the monongahela river.", "Who do you think named these places?? \n\nA. John Dublin\n\nB. Named by picking out of a hat\n\nC. Person who came from Ireland in whichever year and settled the area\n\nD. All of the above", "Yes it was a very pleasant surprise!", "So my brother in law is a Long Island native. He and my sister moved from Manhattan to Denver and they love it. And Dublin/Columbus/Cleveland definitely had a Denver vibe.", "I’m from Long Island,and went to school in Cincinnati,honestly wished me and the hubby would have stayed instead of moving back", "That makes sense, I suppose.", "makes sense\n\nmaybe they live on a houseboat in Lake Erie", "Spread out a bit? Could be.", "Trust me, it’s not worth it in terms of the cost of living and the hassle. I was in that position before with my two kids. The best thing we did was leave NYC. Unless you are wealthy and can afford a nanny, it’s a nightmare. Not to mention, there are waitlists. Also, there are places where that is free as well. We ended up moving to a state where it was free.", "That's why you get prenups so they don't have that level of power over you. Because people like you think of divorce as solutions.", "It’s possible they’re IVF children - at which point it’s quite likely to have multiples", "Yeah I dunno why I'm being downvoted for pointing out how rare twins and triplets are irl lol", "I can’t believe a fellow Michigander is saying something nice about Ohio publicly! \n\nAlso Columbus is a pretty good city", "I’m shocked every time I go back! I look forward to family and new food!", "Love it.", "I... know ? I meant more along the lines of \"Why Dublin and not Ballyfemot or Drogheda ?\" - apart from the fact that Dublin is bigger, obviously. Some references to European cities can be quite niche, and you wonder what's the story of the founders of the American version, why and how they left their small village in Ireland, Great-Britain, Germany, etc., and why and how they decided to settle where they did.", "They were just giving you the business.", "Why TF is this downvoted?? Other commenter has multiple accounts? The whole point of all of us getting on Reddit to get other’s opinions and help and your comment is sincere.", "But it may well be that his wife could use extra support with the kids and thinks she needs to be closer to family to get it.  OP may need to look at how he can step up to help more.", "The cost of living in new York is significantly higher and so is crime? Also the benefit of the kids being able to see their extended family? And the kids being able to play outside in a spacious backyard that would cost a fortune in new York?", "Can confirm. We would like to move “back home” when we/before we have kids so we can be around family but we don’t want to move exactly home. Pick a great place hopefully within 6ish hours of family that works for us and now family can be around much more often. Plus we’ll be able to afford the space and get what we really want.", "I got no idea lol. Maybe shes got one of those 300+ family member things, maybe he has no one. Maybe its the other way. Either way, thats a rough situation when partners cant agree on city vs not city (im assuming she wants a suburb/rural place, could be wrong there too)", "Prenups don't stop people from divorcing you and if the one partner is being TA, they deserve to be divorced.", "LOL...Wow, what an assumption you jumped to. Angry much??? I never said divorce is the solution. All I said is it's an option that's more expensive than moving.", "Op said they were natural, which indicates not IVF.", "also", "If you find triplets to be such an unbelievable phenomenon, you can just mentally face the question as if it’s been posed by someone who simply has three young children with unshared birthdays.\n\nAnd you get the downvotes because you’re being pedantic. You Googled the statistics of the likelihood of someone having a set of natural triplets...Incredible work, Sherlock. If you have an issue with feeling the post is false, there’s a report option for shitposts. I’m sure the mods would be delighted to read your statistics report on why OP is lying and will remove this posthaste.", "I know, send me to the stocks!", "HA my thoughts exactly! But honestly the rivalry is worse in OH. Michiganders are more kind, imo", "[Wikipedia](https://en.wikipedia.org/wiki/Dublin,_Ohio#Post-Ohio_statehood) has a blurb about the origin of the name.", "It's not just about the city, though. It's pretty clearly motivated in large part by wanting to be near family, which is a pretty normal thing for people to do when they have kids. Both to have extra help with the kids (especially with triplets!), and to build relationships between the kids and their extended family, all the aunts and uncles and cousins and grandparents they'd otherwise only see once a year at the holidays.", "It does protect your assets. The person I responded to brought it up talking about costs.", "You're taking that super personally lol literally all I did was point out stats and how common twins are as a theme here- and a slow increase in triplets. also the super new account posting said story, and then never replying to any comments or doing anything else.", "It sounds like she's okay with that as she's laying down the ultimatums.", "Or the family might fracture if ~~the wife doesn't agree with him~~ he doesn't follow through on what he agreed to do when she was pregnant?\n\nFTFY", "True, but she's offered three different states as options. Depending on which state they end up in, they could still be hundreds of miles from her parents, for example.", "Again, there’s a place for that. It’s peak pathetic to post something unrelated and then be like, “I don’t know why I’m getting downvoted.” Gosh, it couldn’t be that you’re contributing nothing could it?\n\nYes, many posts here seem to be exercises in creative writing. And there’s a process that can be followed if you feel that strongly about it. Instead you act like you’re doing some service for people who are just looking for something mildly engaging to pass the time they’re spending on the toilet.", "He initially agreed to move. She's simply asking for that to follow through. Its not her \"laying down ultimatums\".", "Dang, you're super indignant about this aren't you. I dunno why you're accusing me of being emotional when you're throwing an absolute fit but whatever makes you feel better, buddy. Have a great day 👍", "I didn’t call you emotional. You asked why you’re getting downvoted. I answered. Any other context you’d like to attach to that is all you."]}