{"id": 32396, "submission_id": "18bfvq6", "title": "AITA for thinking my husband is showing favoritism?", "selftext": "My husband and I have been married for about a year. He has a 10yo Nia and I have a 9yo Adeline.\n\nMy husband is the kind of guy who considers himself very \"manly\". He won't do anything he considers \"feminine\" for example if I need tampons I have to buy them myself because he thinks it's too feminine for him to do however he is a hypocrite because he does everything Nia asks him to do for example Nia loves doing make up on other people and my husband let's her use him as a model.\n\nWell yesterday I got home to my husband kneeling in front of Nia and polishing her toe nails. Adeline asked me to polish her nails for her. I was busy preparing the dinner so I asked my husband to do it. \n\nHe told me that he is not comfortable with doing this, too feminine. I told him then why was he comfortable doing this for Nia? He told me to ask Adeline's dad to do it and I told him that Adeline's dad is not here right now is he? Just do it. He refused again. I told him he is a jerk and a hypocrite and is showing favoritism. He called me an asshole", "created_utc": 1701793745, "permalink": "/r/AmItheAsshole/comments/18bfvq6/aita_for_thinking_my_husband_is_showing_favoritism/", "score": 211, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole for thinking my husband is a hypocrite and expecting him to do something he is not comfortable with\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Why did you marry a man who's afraid of buying tampons for you? \n\nEdit - YTA. You knew how he was and decided to marry him and subject your daughter to him anyway. You can't act all surprised when he behaves the way he has always behaved.", "YTA for marrying mr Red Flag while you already have a daughter who should be your priority. Didn’t you see it coming that someone who can’t buy tampons will not be the best stepdad for your girl?", "ESH \n\nYTA for putting your child into a situation with a man who is this way. Why marry a man who isn't interested in even being a friendly adult to your child? \n\nHe's an asshole of course for his double standards and views.", "Looking at your replies, YTA because you put your daughter in the position of having to deal with a misogynist.", "INFO\n\nWhy is he afraid of femine stuff?", "Why did you marry him?\n\nPart of the whole \"blended families\" deal is trying to treat the children of the family equally. In his mind, Adeline is definitely the unwanted stepchild.\n\nNTA", "Info: Why did you marry him in the first place when he’s a chicken to buy tampons", "My husband prides himself on being masculine and “manly”. You want to know what peak masculinity is? Taking care of your wife/partner. Guess who not only buys my tampons, but also goes out of his way to get my favorite treats/cozy blankets/pain meds/etc? My husband. Your husband sounds like his masculinity is being held together by two shoelaces and chewed up gum. He is also showing clear favoritism to his daughter, and neglects to show any of the same care to you or your daughter. NTA but you would be if you continue allowing him to treat you and your daughter like that.", "You married a sexist, misogynist and now you're surprised that he's behaving like a sexist, misogynist? Are you OK? Have you had a stroke or something? \n\nObviously you're NTA in this situation but you're a massive fucking arsehole for subjecting your daughter to this man.", "Good job picking a step dad who doesn't care about your daughter.  YTA.", "YTA for marrying a jerk. Great role model for your daughter!", "ESH. It would be nice if you both could resolve conflict without resorting to name calling. Hopefully this wasn’t in front of the kids.\n\nSo what’s his plan if you’re not around when Adeline gets her period? Let her free bleed?", "YTA for marrying an idiot who doesn't respect your or your daughter. Out of interest, how long were you dating your husband before you married him?", "Did you get married after a week? How could you have not seen this? Now you have two different families in one household.", "Why did you marry a man who’s not even interested in your daughter? Does he even care for her when you’re away? YTA for exposing your daughter to a sexist.", "ESH. He's just a sexist ass. But you already knew that since he won't do anything traditionally feminine. You are because he was not showing care to your kid before being married and somehow expected that to change?  Marriage isn't some magical thing that suddenly changes a person's attitude.  The view anything would have is woefully naive.\n\nYour choices are pretty much to talk to him to see if he will ever feel comfortable with your daughter. If not then be ready to suffer the consequences of your daughter asking why her step-dad treats her worse and sibling rivalry.\n\nObviously we don't know your lives. So we don't know how good or bad things are besides this.", "ESH your husband is the AH for showing favoritism but you married a person that won't even buy you tampons?! May be time to rethink your life choices.", "i’m sorry why did you marry a blatant misogynist? \n\nESH tbh. you knew what he was like.", "It sounds like your husband is super insecure in his masculinity if he's afraid of \"feminine\" things.  In the words of my 23 year old stepson \"Why would I be afraid of what is basically a napkin?\"  Like girl, your husband is intimidated by a NAPKIN.  The frailty of it all!\n\nNTA, he is definitely showing not only favoritism but massive insecurity.  IDK how on Earth you would talk sense into a \"man\" that is afraid of napkins and paint in a small bottle.  Good luck with that (that sounds sarcastic but I genuinely mean it.  You're going to need it.)", "Based on your responses, YTA for not putting your kid first. He’s a misogynist who doesn’t care about your needs or your child. You thought he was a different person, but he’s clearly showing you who he is and how he will treat you both.", "The fact that he said, \"Ask Adeline's dad to do it\" shows you the issue. She's not his daughter, so he won't do it for her. The fact that he is too insecure in his masculinity to buy you tampons is another issue - but what the hell?? You're NTA, he is. But making excuses for his poor behaviour and character flaws by putting it down to him being \"masculine\" isn't going to help anything either, he's just selfish af.", "ESH for the name calling in front of your kids. But I gotta wonder why you married a guy so insecure that he will just flat out refuse to do anything based on his arbitrary definition of masculine and feminine. Does he think that the teenagers working at CVS are gonna think he's got a vagina because he picked up some tampons for his wife?", "bro he’s to insecure to buy tampons at his age??  my younger brother was 11 the first time i asked him to by tampons for me and he did it without complaint. NTA", "red flags all over!!!", "I would greatly reevaluate my decision to marry a man who seems himself too manly to do anything \"feminine\" and who clearly will always treat your daughter differently. Just the comment of why don't you ask her dad to do it has red flags like crazy. No one is telling him to be her father, but if she is with you, he should sure as hell be treating her as she is.", "Although it's ridiculous and shouldn't be an issue for any man to buy tampons.  I do see the difference between buying tampons and polishing his daughter toenails as one of these is done in a very public space and the other is done at his own home in front of only his family. \n\nHe said he's not comfortable doing your daughter nails and that word 'comfortable\" is super important, why is he uncomfortable with it, has he been accused of some kind of misconduct before, or is he very worried that her father may think this is somehow a sexual fetish?\n\nThis dude is wild, and I think he's using the feminine thing as an excuse for his real reason, he doesn't trust this kid or maybe the kids father to not turn this into something it's not.\n\nYou need to have a conversation about this and find out if he is simply a chauvinistic ass or if he's attempting to protect himself from perceived issues.  \n\nNTA", "sooo. he’s a good dad. and a shitty husband and stepfather. nta.", "YTA - Not because you said what you did but because you married this man in the first place. You knew he wouldn't buy or do feminine things for you. You knew he wasn't doing or buying things that he deems \"feminine\" for your daughter. So why you think all of a sudden he would have pulled a 180 and start doing these things just because you two got a piece of paper that says your married is beyond me. This is something you should have addressed before you married him. A conversation of \"Hey you do X, Y, and Z for your daughter. When we get married I expect you to treat everyone the same. I need to see those changes in you before marrying you.\" And then you should have waited to see if he changed or not.", "NTA. He's an asshole, but you married him and what does that say about you? He's clearly showing favouritism, think about how you daughter must have felt? This marriage won't last, and if it does, your poor daughter will suffer. You husband also sounds like a closet gay being so \"manly\"", "Yta for marrying a man like this and fucking gross for exposing your daughter to this.", "Not to jump to conclusions or anything about 1 little piece of your life, but you should probably get a divorce over this.\n\nNTA", "YTA, because you shouldn’t have put him on the spot in front of your daughter, clearly he will do things for his daughter he won’t do for anyone else. You accept or leave", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I have been married for about a year. He has a 10yo Nia and I have a 9yo Adeline.\n\nMy husband is the kind of guy who considers himself very \"manly\". He won't do anything he considers \"feminine\" for example if I need tampons I have to buy them myself because he thinks it's too feminine for him to do however he is a hypocrite because he does everything Nia asks him to do for example Nia loves doing make up on other people and my husband let's her use him as a model.\n\nWell yesterday I got home to my husband kneeling in front of Nia and polishing her toe nails. Adeline asked me to polish her nails for her. I was busy preparing the dinner so I asked my husband to do it. \n\nHe told me that he is not comfortable with doing this, too feminine. I told him then why was he comfortable doing this for Nia? He told me to ask Adeline's dad to do it and I told him that Adeline's dad is not here right now is he? Just do it. He refused again. I told him he is a jerk and a hypocrite and is showing favoritism. He called me an asshole\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Your husband is.", "I hope you love living with this man for the rest of your life because your daughter sure isn't going to.", "You're just as much to blame you stick With the asshole.  He obviously does not care for your child like his own.  If he couldn't do  for your child after doing it for his  l would have made dinner for myself and my child and told him l wasn't feeling manly enough to take care of the whole family", "NTA but I hope you can accept that you made a mistake and married a man you didn’t fully know. Now that you do see the real him and see that his presence/attitude/favoritism is harmful to your daughter, I hope you will put protecting your innocent daughter as your primary concern. Your primary concern shouldn’t be “why” is he this way but how do I protect my daughter (and be willing to leave your mistake)", "Why did you marry an A H?", "NTA, but you *are* the TA for raising your daughter around a sexist guy. You're setting up some poor expectations and low standards for her future partners.", "INFO: Did he and Adeline meet before you two got married? Did you ever get a feel on how they interacted beforehand?", "And that would be it for me, nobody is going to treat my child like that and make her feel like she isn’t as deserving as a sibling. Boot his a$$. Also he is not a “manly man”, that dude is fragile as hell. Bet he calls himself and “alpha” to doesn’t he?", "NTA. He is a hypocrite and has some major toxic masculinity/sexist vibes which is not good for either daughter to be around.\n\nIs this really the best man you could have brought into your daughter's life?", "ESH\n\n\nYour husband needs to grow up and you need to consider his negative influence on your daughter. \n\n\nIt's telling that you can still call him \"manly\" while describing how he is too insecure to purchase tampons for you.", "NTA since this is mainly not about his view on feminity but more on favoritism. It's clear he will not see your child the same way you see his daughter. Slim chance, but he could be someone who bought tampons for his daughter but not for you or your daughter, so in the end, your family unit is not a team because of his blatant favoritism. Very much a hypocrite. Personally, this is a dealbreaker though, toxic view of feminity and favoritism, the best time to rethink about living with this guy is before you decided to marry him, the second-best time is now.", "NTA\n\nDo you really want to spend your life with this AH. He is obviously only interested in his own kid. \n\nThere needs to be a line in the sand, either he treats them equally or it's over", "tbh E S H because you married a man who firstly doesn't care very much about your daughter, which is unfair to your child, and secondly is at best a bit of an ass and at worst filled to the brim with toxic masculinity. not a good role model for your kid.\n\nbut NTA. you know what's not very manly? being scared to do things because you think if people people hear about it they'll say you're not manly. he needs to fix his attitude. he needs to educate himself on toxic masculinity. you need to make it clear that you won't tolerate favouritism.\n\nlove wouldn't be enough to make me marry a man too scared to buy me some tampons, just saying... and imo, being scared to be feminine is one of the least manly things.", "NTA. This sounds a lot like Weaponized Incompetence (Google it). Often used by straight men to avoid chores (\"I don't want to unload the dishwasher because I don't know where everything goes\").\n\nHe doesn't want to paint his stepdaughter's toes or buy you tampons. \"Too feminine\" is just the excuse you have accepted in the past and didn't notice the hypocrisy until this incident.\n\nEdit to just put it a little nicer??: Painting his daughter's toes is fun to him, painting your daughter's toes is a chore.", "NTA wow your husband is probably only going to get worse from here regarding Adeline. He can only do fatherly type stuff with one kid in the house? He can only make an \"exception\" to do \"girly\" things for one kid but not the other? How does he think Adeline is gonna feel about that?", "YTA.", "NTA - its a weird hill to die on but your husband is \"sacrificing\" being overly manly for the sake of his daughter - which is quite manly in a way. yeah its dumb but you knew what you were getting into, didnt you?", "ESH you should have stopped making dinner & painted your daughter’s toenails. Your husband could finish up making dinner when he was done.", "Just speaking from experience as the dad in a blended family here, but there were things, when we first got blended, that I was far more comfortable engaging with my son, because we'd been doing them for years, that I wasn't comfortable doing with the three I inherited. That eventually changed, but it took some time.\n\nNot excusing his sexism/misogyny in any way, shape, matter, or form, but perhaps he's not yet comfortable doing for your daughter the same as his, with whom he already has that familiarity, that bond.\n\nJust something to think about.", "Didn’t you think twice before marrying this guy or didn’t you discuss what the situation might be after you blend your family? He is clearly showing favouritism and blatantly gaslighting you. Stop doing Nia’s chores and then show the hypocrisy like he says. You’re NTA in this case but definitely TA for marrying a guy like him.", "...I am so tempted to go with N T A given just how ridiculous he is over masculine/feminine activities....but an activity like that with someone else's daughter could be misconstrued elsewhere. It's an awful double standard, but maybe he is just protecting himself here... It's one thing for his own daughter to be that in his face, but if your daughter went back to her dad's and mentioned it then he may have an issue.", "NTA.  He is being hypocritical, and a jerk who is showing favoritism.  If this happened to me I would have stopped preparing dinner and painted Adeline's nails, then gone and finished dinner, if I didn't make him prepare it.  But from the sounds of it he might think making dinner is too feminine.  Painting nails is obviously not so feminine he won't do it for his daughter, but doing it for your daughter so you could continue to make dinner doesn't make it suddenly more feminine.\n\nI would say sorry that you're dealing with a husband who sounds very insecure in his masculinity, but it sounds like he's also using it as an excuse to get out of things he doesn't want to do.", "Lmao it’s his daughter , maybe it’s their thing that is bonding for them , u should take that into consideration", "NTA, but at the same time, it’s pretty common for people to think of their own children as a step above stepchildren. I’m not saying it’s right or wrong, but it is a thing.", "NTA for calling him out, he is showing favoritism, & his logic doesn’t even make sense, he’s not into feminine things, but helps his daughter polish her toes, like, which is it dude? Are you “manly” or not??\nBut at the same time, I can’t really call you TA for marrying him, it’s not exactly clear from this if he showed these signs before marrying him, but if he did, then you’d be more of a moron than an AH, but based on what’s said in this post there’s not enough info to weigh in on why you married him & if he was like this before.", "Sounds like he’s stuck in the closet.", "INFO 1: Why do you expect a man to treat your daughter just like he treats his own when you have only been married for a year? Of course he will have a different relationship to your daughter than the child he has known and taken care of since her birth. The excuse that he doesn’t want to do it because it’s feminine is a weird one. I would be more sympathetic if he just wasn’t comfortable being close to your daughter in that way, because he found it too intimate or something. \n\nINFO 2: Was your daughter comfortable with your husband polishing her nails? She asked you specifically to do it. Did she just want her nails polished or did she want to spend time with you doing something fun that he saw your husband and his daughter do?", "First of all, polishing your daughters toe nails is fucking weird. But besides that, Nia is his daughter? Why would he polish another childs toe nails? Its his choice wether or not to play step daddy. If you wanted someone to polish her toe nails maybe u should’ve stayed with her father", "Not really TA but the marriage only been a year so this is all still kinda new. But him not buying you feminine products because it feels feminine sounds cap. Doing makeup and nails is hella feminine though lol. He should take them outside and play catch or sonething", "Some men are afraid to physically touch a female child that isn’t theirs due to fear of being accused of sexual improprieties.  \n\nAnd since she’s only been in his life for a year (ie. he hasn’t raised her from a little child) that could be a real concern of his.", "NTA and I’m not understanding why so many people are asking why you married him, or judging you for being with somebody who feels this way. It’s natural for your husband to prefer his biological child. However, that doesn’t mean he can make it obvious in front of them. His excuse makes zero sense and I’m wondering if there’s another reason why he didn’t want to do this for her. Does he want to make sure Nia feels special for example? The comment about “ask HER Dad to do it” is not OK and he is absolutely an asshole for saying that. I wonder how the whole situation made Adeline feel?\n\nI think you need to have a conversation with your husband about how you co-parent the children you both live with and agree on how you’ll proceed moving forwards. You’re the adults here. I’d also have a family meeting where you allow the kids to talk about how it made them feel.", "I have a hormone spiral, together with my husband for 20 years and we still use condoms. The only time we didn't use them were when we wanted children.\n\nNot only for the prevention, but for the disgusting mess between the legs after sex I don't have to deal with if he uses a condom.", "Nta", "You admit he was like this before you got married. You're the asshole for not putting your daughter first. \n\nYou're a grown woman, if you thought things were would change once you were married you are either woefully naive, or choosing ignorance. \n\nEither isn't a good thing as a mother.", "NTA, he's being an asshole.  Sorry for all the people saying you are because you chose him... I doubt he had all his faults labeled on his chest when you first met.", "There is an asshole here, but that's not you OP.", "Your poor daughter! No girl deserves the second class treatment of being left out....of anything including getting her toenails painted. Was it beneath Nia to offer to paint your daughter's toenails or would her father not allow it?\nYou staying in this marriage will speak volumes to your daughter later in her life: know your worth and how you want to be treated with future partners. Walk away from this shambles of a marriage. You owe your daughter a better impression of what a real man truly is.", "The tampons bit is ridiculous, but ultimately unimportant. This isn't about his fragile sense of masculinity, it's about treating your daughter as someone else's burden. If you are married, and there is an expectation that your children will be raised equally by both of you, that applies to him as well. You are correct, it is obvious favoritism.\n\nNTA, your husband needs a good talking to and, if he refuses to treat your daughter with respect, you should evaluate what this relationship is modeling to your child.", "ESH - He's clearly an asshole and you're with him despite that and letting him be an asshole to your kids.", "Next time tell him to swap with you and make dinner so you can pay attention to your daughter since he won't", "I mean, that is his daughter so I could see why he would favorite his daughter over yours. That’s kind of understandable in my opinion. But it would be nice if he would learn to interact with your child, especially since she’s going to be around as long as you two are married.", "I dnt care how awesome he is..if a man treated my child like this I’d be gone in a heartbeat", "Ugh. Why did you marry this dude?", "NTA but I think your husband is a jerk.", "NTA and years from now he'll be upset when he doesn't have a relationship with adeline and went her bio dad to walk her down the isle.\n\nyes he is clearly showing favoritism. and it is foolish to think the girls don't see it", "It doesn’t matter if you are or are not TA.  He has shown you what he thinks of your daughter.  She deserves so much better.", "INFO: what is the arrangement? Is he supposed to act like a parent to Adeline when she's with you?\n\nIf so, then yeah, he's showing favoritism. If not, this is something he feels comfortable doing with his daughter but not with anyone else.\n\nIs he a jerk? I knew he was one from the moment you said he refuses to buy tampons because it's too feminine. But is he a jerk for wanting to do things with his daughter that he doesn't want to do with anyone else? No. It sucks for your daughter that you married someone like that, but he's entitled to feel like that. Unless, of course, the prerrogative is that he acts as a parent to your child.", "NTA husband is showing favoritism and this 'I don't do anything feminine' crap is just that -  crap. I'd be rethinking this relationship.", "YTA. You married this guy who provided clear boundaries of what he wouldn't and won't do for you and your kid. He doesn't want to do those things for you and you chose to marry someone who lacks generosity or consideration for your needs. He was like this the day you married him and he's like this now, YTA for assuming that anything would change.", "Girl 😐 you know who you married. Nta clearly but sounds like you rushed into things with a raging misogynist", "Your husband is TA", "ESH. Husband for being a garbage person. OP for knowingly subjecting her daughter to a garbage person as a parental figure.", "Your husband isn’t “manly”. \nHe’s an asshole.\n\nEDIT: and so are you for marrying someone who treats you and your daughter like this.", "lol your husband refuses to by you tampons or do his step daughters nails because it is to famine?!?!  Tell the whiny little thing to put on his big girl panties and man up.  he is not manly he is a coward.  if he treats your daughter like this on other things and you stay with him then YTA...", "Why shouldn't he show favoritism?  N is his daughter, A is not.  Give him some time, this may change, but in my view this is what happens when you blend families.  \n\n\nYTA.", "I loath men like your husband lol. It’s way more “manly” to be secure in yourself and feel comfortable doing things like buying tampons for your wife or expressing that you aren’t an emotionless robot. Men who think certain things aren’t “manly” are so annoying and insecure.", "Oh course he called you an AH, hypocritical jerks don’t like being called out on their BS. Why are you married to this man? NTA", "YTA for marrying this loser lol.", "My only hope for my fellow ladies is that they grow some self-respect and not even look at men that are like yours. \n\nYTA for letting him near your daughters.", "YTA. You KNEW he was sexist, didn't go out of his way to be fatherly to your daughter, and yet you chose to marry him anyway. Your child deserves better and it is 110% your fault that she is (and let's be real, will continue to be) mistreated by your dirtbag husband.", "Look, you're only the asshole if you stay married to this ass", "Since you’re not overly concerned about how your daughter is treated by her stepfather, as evidenced by your marrying him despite all of the red flags, you should send her to live with her father.  She deserves to be treated fairly and you’re so busy making excuses that she’s going to be left out in the cold.  You’ll be lucky to have any relationship with her at all after she turns 18.\n\nTo answer your question, N T A for expecting more of your husband, but YTA for marrying him after seeing these issues up front and thinking he’d change after he spoke a few words in a ceremony. You are in serious denial.  You may love him, but he doesn’t love you or your daughter.  Love is an action, not just a feeling.  His actions speak volumes and you’re covering your eyes and ears, not wanting to see it.", "Sounds like good old husband is over compensating. He is so mainly that one day he will only be with men to not be too feminine. \n\nNTA", "NTA HE is the asshole.  \nI would reconsider this marriage. You obviously can’t count on him and he doesn’t treat your daughter as she deserves", "From what I see, YTA.\n\nYour husband sucks, but I wouldn't even call it an ESH.\n\n&#x200B;\n\nFrom looking through your responses you knew your husband didn't give a crap about your daughter before you were married. You expected him to change after marriage??   \n\n\nHe showed to you that he doesn't care about her. You are putting your daughter through a horrible situation that will traumatize her and most definitely cause problems for her throughout life.  \n\n\nWhat's the situation with Adeline's father? Does he have any custody over her? If that's an option he should have full custody if you won't leave your husband. Not having a mother figure sucks, speaking from experience, but it's better than a mother putting her child in a shitty situation intentionally. \n\n&#x200B;\n\nIf you want to be a good mom leave your shitty husband. You wont leave him because you love him? I guarantee your child will grow to hate you both and be miserable growing up. if you want a good relationship with your child or any relationship at all after she's grown you need to be an adult and stop complaining on reddit.", "ESH\n\nGive him the ultimatum of going to family therapy or you’ll walk. He can’t be so sexist to not buy tampons or support your daughter. Clearly he can be not a d*ck if he wants to be bc he does it for Nia.\n\nSeriously. Therapy or leave.", "ESH. He refuses buying tampons for what? Being too feminine? What a joke. Also him not doing it for the other daughter when he was just doing that for “his own” erm. I think you should be glad he was not the one you were with when you gave births. I don’t think he would have been able to support you with this attitude. But also you do sound like you are kind of jealous of his and his daughter’s relationship so that’s why the judgement.", "ESH - him for being a misogynist and a walking red flag, and you for marrying him. Do better for your daughter", "I hope you were only making dinner for your daughter, not his? Make him see how terrible of a stepdad he is. 🍀", "He’s sexualizing your daughter.", "Your daughter will be noticing this favouritism. how Are you a butt for wanting him to treat both daughters the same.\n\nhe agreed to get married! He now has two kids\n\ni assume the older isn’t your and the younger isn’t his.   \ndo you treat both equally?", "Woooooooooooooooowwwwwwwwwwww- what a jerk!!!!", "ESH. He is being a baby about this, but at the same time I don’t think it’s unreasonable for him to favor his own daughter. As you should your daughter. \n\nThings aren’t always equal in blended families", "So, if you couldn’t join in the fun activity because you were making dinner did you follow his lead and only make dinner for you and Adeline? You husband is an ass and that type of excluding from an activity and favoritism will end up hurting your child.", "YTA", "Why did you marry him? A man who won't buy me tampons will not be considered for a relationship, never mind marriage. The fact that he'd treat your child like that as well.... Seriously, why did you marry him? YTA for marrying a \"manly\" (read mysoginist) asshat.", "There is always more to the story. First, you married someone for some reasons you found attractive and you are or were in love. It sounds like the other guys isn't in the picture and you're bagging on your current guy. This is an indicator to some poor decision making skills. It sounds like you two both need to work on your communication skills. If you are TELLING someone to do something instead of asking or taking a break from what you are doing to help your daughter there are a couple issues. Is that thing you are doing more important to help your daughter? If you have time to have a conversation with your guy in ordering hike to do something, then why don't you have time for your daughter? Do you like being ordered to do something or would you want someone to ask you? Personally if Someone tries to order me to do something I will tell them they can FO. You both sounds like you have some issues that you individually need to work on.  ESH.", "Omgeezers, my husband used to keep tampons in the passenger door of his truck just for me and my daughter for emergency reasons. He's definitely a keeper!", "Yes, this is a huge deal breaker for me. I'm a woman, I get periods. That's just part of how it is. I get that a partner of mine doesn't want to hear hour long period chats every single month (if for whatever insane reason I felt the need to hold those haha), but if they can't even buy me tampons then it's over.", "Yes, this is a real ick.", "I wonder *why* he was a single dad in the first place. I’m going to guess…this", "Right! She’s the asshole to herself and it’s so hard to have any sympathy for people like this.", "This is what makes her the real AH.", "Because I love him?", "sidenote: Does ESH stand for something? New to this subreddit, I keep reading it as eeeeshhh 😭", "He is not. He does them easily for Nia. You would be surprised of the things he is willing to do for Nia but when it comes to anyone else he is suddenly oh so manly", "I didn't think he would treat my daughter like this. I actually saw him as a loving dad and considered that a good thing", "Not very masculine to be that worried about being seen with a feminine product in his grocery basket.", "People are not 2 dimensional he also has positive traits that I love", "I’m sure he does care but it’s fine that he favors his own. And she should with hers.", "I don't know but it's not like he is incapable of doing this I bet be will do it for Nia so I'm just gonna hope he does it for Adeline too", "Does the principle of blended families ring a bell for you? A serious relationship w someone that had a kid mean you have to be a fatherly/motherly figure wether or not there's both parents present", "No I can't accept it. His child is not better than mine she doesn't deserve special treatment", "How does this even make any sense", "Polishing the nails was not the problem, the difference in his treatment was the problem so while I could do it I felt like he should do it", "??????? why would he marry someone with a child if he's uncomfortable doing dad-type things with another child.", "Especially when she’s only been in his life for a year.  Be different if he has raised her since she was a toddler.  \n\nBeing accused of inappropriately touching a step-child is a real concern.", "Then he can and should bond with my daughter too", "Putting nail polish on a kids toe nails is ‘fucking weird’? The fuck is wrong with you?", "he chose to be a stepdad when he married someone with a child. the fuck? and you are willfully missing the entire point.", "There is nothing weird about doing makeup with your kid man. He would polish another child's nails because he agreed to be a stepfather by marrying someone with a child. You seem like a downvote farmer.", "That's ridiculous. He plays with Adeline and hugs her without any issue", "Okay?", "My dad used to do the same thing!", "This is a great idea … does heat damage them at all though?", "This is the right kind of masculine man. Drives a masculine car but has female things just incase. Hold on to this man!", "So you knew what he was like before you married him.  Did you expect him to change after you got married??\n\nYTA for putting yourself and your daughter in this position.", "Why would you love a person who clearly treats you and your daughter poorly and who is clearly a misogynist when it suits him?", "Okay, enjoy his sexism then.", "Girl… love isn’t enough. You’re going to be very unhappy in a couple of years.", "Clearly, you love him more than your own child. I feel bad for your daughter. She's going to cut you off eventually and it will only be your fault. Not his. YTA", "Are you asking us, or telling us? XD", "YTA for marrying a misogynist who makes excuses and treats you and your daughter markedly differently than his own child. That you love him is not enough when your kid is involved. You really should have known that.", "really? what exactly do you love about him? because he sounds awful", "Stop complaining then you made your bed, so shut up and deal or move on 🙄 people like you are annoying", "Then you’re accepting it", "Maybe don’t admit that publicly", "imagine loving something like that", "Love isn't enough honey. There's also being treated well. He is not treating you nor your daughter well.", "You can’t go in to a marriage with your eyes open about him being a misogynistic prick and then complain about it.", "So then you made your bed? And should have seen this coming? From miles and miles and miles away?", "Then you love sexism. Idk what to else to tell you, you knew what you were signing up for, now you’re surprised when that toxic masculinity and sexism effects your daughter? I’m confused.", "Welp.", "It's good you love him, cause you have no love for yourself.", "Omg grow up.", "Enjoy him continuing to treat your daughter like this and being an ass to you then. Because of this, you’re both assholes. YTA", "More than your daughter and her wellbeing if you’re willing to expose her to someone who not only shows favoritism but who leans this hard into toxic masculinity. YTA", "Everyone Sucks Here. But I still read it as eeesh as well", "everyone sucks here", "It stands for Everybody Sucks Here.", "Everyone sucks here.", "That sounds like a terribly unattractive personality trait, I'm still baffled that you married him in the first place.", "If his masculinity is threatened by treating another girl than his daughter correctly ( including you plus your child ) then it's fragile and he's an ass", "He will never change. I was married to someone like this. Choose now how you want to spend yours and your daughter’s lives. Better to own a mistake now, rather than ride the wave and live miserably to avoid the inevitable.", "Thanks for answering.\n\nSo he uses this fake manlyness as an excuse to treat Adeline and You badly? He is AH. Thanks for defending your daughter, but if she stays in this toxic enviroment for a while longer, you are AH too.", "Damn right he should do anything for his daughter, but he should also do the same for the woman he chose to marry & her child he signed up to be a stepdad for.", "You saw him as a loving dad to *his* child, not to yours", "Well now you have seen the evidence to the contrary.\n\nHe is deeply sexist, not fit to raise daughters, he is not a loving dad, nor is he loving husband. The signs were there, and you chose to ignore them, and this is the result.\n\nUnfortunately, this is who he was before he married him, he's not going to change.\n\nI'd say that you have to choose, your daughter or your sexist husband.", "He's using that as an excuse to treat your daughter badly. She just wanted to be included in the fun, and he couldn't even do that. And when you called him out on it, he treated you badly.", "Maybe you thought that he would tear your child properly based on how he treats his own. But now you know better. He couldn’t have made it more explicit for you — he literally told you that he won’t treat them the same. YWBTA to your daughter if you stay with him. I’m sorry that you found this info out at this point", "Well then I guess you need to live with an asshole.", "There are no amounts of positive traits that can make up for lack of morality.", "Stop defending him and start to be a mother to your daughter. \nIf you want your daughter to continually feel like the black sheep and like she isn’t part of the family, then stay with him but that will make you one gigantic AH much bigger than you currently are. Your husband is already a gigantic AH and I bet your daughter is secretly hoping and waiting for the day you both divorce and I wouldn’t blame her. \nBut I can see her asking to go and live with her dad, soon, if this continues", "Then you need to stop complaining on Reddit.", "Yes and one of the bad ones is that he's willing to leave you in a bad spot if you're in need about something that he consudere too feminine ( or to be mad about it if he still has to do it )\n\nLike, my dad is big macho type, a dripplet of blood visible in the toilet and he's waking up all seven seas, but he will never, ever, considere that helping a woman in need w periods is a threat to his masculinity", "I hear Ted Bundy had a few positive traits here and there, too.", "Like? \n\nHe’s a misogynist who has no problem mistreating a little girl, and doubles down when called out and mistreats you.\n\nYWBTA to your daughter if you stay.", "I’m sure you do but are those worth letting your daughter be treated like she’s beneath Nia?", "Your poor daughter gets to live with two assholes then, your husband and you.", "And those outweigh the treatment of your daughter? I really hope she’s got adults in her life who actually care about her.", "Did he ever do *anything* fatherly like this for Adeline before you got married??", "Your daughter (and you) deserves better than just a “hope” that he gets better.", "Hope is not a plan", "You’re staking your daughter’s future emotional well being on the *hope* that he’s going to: 1) step up to the plate with his own daughter when she goes through that, but also; 2) treat your daughter like his, when he’s clearly demonstrated he does the opposite. \n\nHe’s shown you who he is, believe him. He’s not going to change. He’s not going to magically wake up one morning and treat your daughters the same. It’s not going to happen. And you waiting and hoping is only doing damage. How long before your daughter really realizes she gets treated differently by her step dad, if she already hasn’t? That’s going to create so much resentment towards him, her step sister, and you for choosing your relationship with a misogynist over your relationship with her.", "[https://www.scientificamerican.com/article/einstein-s-parable-of-quantum-insanity/](https://www.scientificamerican.com/article/einstein-s-parable-of-quantum-insanity/)\n\n“Insanity is doing the same thing over and over and expecting different results.”", "And if you’re showing you cannot do that, which he is, then mom has to decide if this is a relationship to keep", "It doesn't have to. My father remarried. I never wanted to be treated as a daughter by his new wife. They had a daughter and I loved (and still love) that child. She's my sister (fck the half). But her mother, his wife was never a motherly figure for me per my choice ( I was 13).", "Your husband has made it crystal clear that He believes that his child is better than yours and definitely deserves special treatment. He has told you in words and shown you with actions.\n\nAlso, his \"manliness\" (as you call it, the rest of us call it misogyny or sexism and find it completely unacceptable) Will not allow him to be wrong.\n\nYou can either keep your daughter in this situation and make it clear to her that you agree with your husband, that she is a second or third class citizen and will never receive good treatment, and raise her with that mindset. It seems that you have already chosen that. You're married to someone who treats women like second class citizens, and that's the behavior you're modeling for her.\n\nOr, you can model better behavior for your daughter by making sure she knows that women don't have to stay with men who are sexist, cruel, and unfeeling.", "You said in another comment, he was like this before you married him so why did you marry him then?", "And yet you DO accept it. You say you don't, but you've been accepting it and you continue to do so for as long as you stay with him and allow his behaviour to go on, and you don't take active steps to put a stop to it or leave. \n\nSaying, \"I can't accept this,\" is utterly meaningless when your actions show the opposite. Every single thing you do is showing your daughter that you are, in fact, fine with her stepfather treating her this way . . . because you sit there and allow him to do it. And you allow him to do it to you as well with his, \"I cannot possibly touch a box of tampons.\" \n\nActions speak louder than words. Saying you won't accept something is meaningless if you continue to stay and . . . accept it.", "This comment alone, you deserve YTA judgement.", "Then you have a decision to make, he’s not hiding who he is", "you’re already accepting it because you married him and refuse to leave. YTA for not being a better mother to your daughter and picking a better man.", "Then...?", "Really because it seems like you've been accepting it, maybe put your foot down and leave then", "You seem to be taking it out on the child & not your husband.", "Too late", "This should have already been established before marriage. Bonds can’t be forced. My partner adores and cherishes my daughters like his own, and same for me with his. We treat them as equitably as possible, and it’s never been forced. \n\nThink about what you’re doing to your daughter. What you’re teaching her. This isn’t on him, not quite nearly as much as it’s on you. Adeline is your responsibility, and part of that is making sure that she is welcome in her home and family. You created something, because you didn’t want to be alone, that is harmful to your daughter emotionally. You should be ashamed of yourself. It is far better for a child to see a single parent working in themselves and building their own life than to be in an inequitable relationship where the child is also treated with disdain. YTA for putting your child in this situation.", "It takes time to bond. He's not going to immediately jump to paint your daughter's toenails if he's too scared to buy his wife tampons.", "Find another way because those may be him and his daughter’s thing so u have to respect that boundary even if u don’t like it", "Yes but you can’t make him and he obviously doesn’t want to. So now it’s on you to choose if you’re ok with this life for your daughter or not.", "Its my opinion. I think its weird", "I was already correct about the stepdad thing. They’re both his kids. In which case it is weird that he wont do it for his other daughter", "Is downvote farmer a real thing? 😂😂", "Playing and hugs are different.  And if it were fingernails it would be different.\n\nWhat was she wearing?  Because if it was shorts, he was likely fearful due to the view it would afford him.  \n\nLike I said, fear of false accusations is a real thing.\n\nThere were things I was uncomfortable to do (or say) at first with my step-children that I did all the time with my own kids.  It takes time to get comfortable with new additions.", "Dad's are awesome aren't they? Except for the idiot in this post.", "The wrapper fades, but still very usable. If kept in the glove box, it's a hilarious surprise for unsuspecting mechanics looking for information about your vehicle specs😂😂", "Funny thing is he is a feminist when it comes to Nia. He has raised Nia to be a feminist. I don't know why he is not the same for anyone else", "Thank you 😂", "Thank you!", "Because she looooves him /s", "Apparently he is a loving dad to his own daughter so your argument is false. Not saying that he is marriage material but still cant fault someone for not loving another person's kid like their own.\n\nI mean fuck i cant love another kid like i love my son, cant help it, doesn't come naturally to me. Afterall my son is my flesh and blood and I will got to hell and back for him. Its unreasonable for people to blame me for not loving someone who is not my own blood or who is a grown child iv just met. Although i probably would love a child even if its not my own provided I literally raised them from a baby. Attachments are not conjured on the fly but nurtured over years.", "You mean her daughter needs to live with an asshole.", "No but I didn't expect anything when we weren't married", "Came here to say this…thanks for saying it for me!", "She said it’s because she thought he would be different once they were married.", "I mean if your kid wants to wear it you kinda have to, i let my young cousin paint my nails a few years ago, they got it everywhere", "Because he doesn’t want Nia to be treated the way that he treats women (including you)", "The why doesn't really matter. What does matter is that he does it. And that you knew that he acted this way when you dragged your daughter into this mess.", "Because he's actually a misogynist with an exception, that doesn't extend to your kid.", "So that makes it worse. He treats his own daughter as though she is worthy of respect and dignity, but YOU AND YOUR DAUGHTER as though you are not.\n\nAnd . . . you act as though this is a defense of his behaviour? \"He is a feminist when it comes to his daughter!\"  So what? He isn't when it comes to YOU, or to your child. He treats you both like second class citizens in his eyes. \n\nShame on you.", "Because your child isn’t his so he’s showing favoritism, why would you marry a man who didn’t accept your child or treat her equally? And don’t tell me “because I love him”. Because all that excuse says is that you love him more than you love your daughter.\n\nChildren should always come first and if your husband couldn’t treat them the same then why on gods earth would you marry this man and put your child in that situation? \nYou should be with someone who is willing to accept both of you, not just you", "He obviously don’t like your daughter.", "He's not a feminist if he's scared of buying tampons and perfectly fine with acknowledging he has double standards. Same vibes as \"I'm a good guy because I would never hit a woman but I can't control what other men do.\"\n\nETA: ESH here and you're the bigger AH. I removed an earlier part of my comment that stated you likely knew he was a myoginist and that this was his norm because your own comments confirmed it. Your poor daughter, you married him with the full knowledge he would favor his daughter. You can't say you \"didn't expect him to treat your daughter like this\" and \"I didn't expect him to do anything fatherly when we got married.\" Those contradict each other. Your daughter is only nine years old, it's unfortunate at such a young age her mom chose not to keep her best interest in mind and marry a mysoginist.", "Is he a feminist for her or is he just doing everything she wants? /gen", "Because Nia is an extension of him and gets special treatment as a result (for now - good luck to her when she hits puberty).\n\nYou and your daughter are property, and property doesn’t get to make requests.", "Because your daughter wasn't from his seed, probably. I'd imagine if you got Adeline alone to ask about this there would be a whole host of issues exactly like this she has observed and just been afraid to tell you.", "He actually isn’t", "Because Nia is his daughter and his daughter is an extension of himself.", "He's not a feminist just because he said he is one, his actions prove the opposite, he is a misogynist.", "He is a good father and loves his daughter. He is not a good husband though. \"Too feminine\" is just an excuse to not engage and do staff. Are you sure your daughter needs a stepfather like that?", "Because to him all women are pathetic and their needs/wants are beneath him... except for his daughter because he sees her as an extension of his awesome masculinity.", "It’s not being a feminist if it’s only for one person.", "Because he thinks his daughter is better than yours. When he said “have her dad do it” he said to you that she’s not his child and he has no intention of treating her equally to his own. Get out before you let him destroy all your daughter’s self worth, because that is where this is going. As they get older Nia will also adapt the “I’m better and more deserving” attitude towards your daughter.", "That isn’t feminism. I’m a feminist, but I’m not picking and choosing which women deserve to be treated with dignity. I want rights and equality for all women, not just the ones I have a preference for.", "The way someone behaves when they aren't married is the way they'll behave when they are. If you guys got together while thinking he would change after marrying you, then YTA for putting ur daughter in that situation as a whole.\n\nEither way, he is also the ahole because it doesn't take much to paint someone else's nails... and no one is watching. He is also teaching your daughter, as the father figure in the equation, that is okay to be treated like that (being ignored) because of his masculinity.\n\nSo bottom line... ETAH. Just... if this is the hill you gon die on (no plan to get a divorce in the future) you guys need to be civil and discuss all of this with a therapist, to get to the bottom of his conduct and see if he sees how this is hurting himself as well as both children (cus there is a 50% his daughter will grow up thinking she is better than yours).\n\nIf everyone is willing to work things out, this can be resolved eventually. Just make sure that love takes first place in the family for everyone.", "So you knew how you treated you daughter **before** you got married.  Now you expect him to change.", "\nDid you talk to him (before the wedding) that you expected him to be a paternal figure for your daughter? These expectations must be clear before marriage.", "So you married a guy without knowing how he’d treat your daughter, while knowing he doesn’t do feminine stuff even for you?? Why would you put your daughter through that", "That was . . . unwise", "Bless your naive heart", "People don't change just because of a piece of jewelry and a new title.", "Thanks for helping me decide ESH instead of NTA, you set your daughter up for a garbage childhood.  Good luck, hope his traits you love are worth it.", "Girl 🤦‍♀️", "YTA because you’re a bad mom. Your poor daughter. Frigging Jenelle Evans over here.", "De rien", "Ding Ding Ding!\n\nLater in life he will hate every man his daughter dates because “how DARE he treat women, EXACTLY how I treat women!”", "This right here.", "This right here.", "\"I'm not racist, I have a black friend.\""]}