{"id": 32407, "submission_id": "18bc2ng", "title": "AITA for telling my best friend she will be fired at a job I got her for not performing?", "selftext": "Is it appropriate for me (23F) to express concerns about my best friend's (24F) job performance to her at the medical spa where I facilitated her employment? In October, I was offered a social media position at a medical spa but declined due to time constraints and an inadequate salary as I run my own ECOM business. \n\nMy friend always says she’s in debt and needs to make money and I am all about putting my friends on opportunities. So with that being said, recognizing my best friend's social media skills, I recommended her to the owner, who paid me to provide her with a 30-day training. I consistently vouched for her, and went there with her the first day to meet him and talked her up so much.. and closed the deal for her.\n\nOn my last day of employment, I addressed concerns from the owner's wife about my friends lack of initiative. She expected my friend to go out of her way to make a good impression and work really hard since she would be rehired without me - and she did not. Keep in mind this monthly pay almost matches her other job, for not having to do much work…\n\nThroughout the month we worked together, she didn’t do very much. She didn’t grow the social media at all.. didn’t answer messages from dms, nothing. She filmed videos with me, uploaded them on a google drive for another person on social media team, and uploaded 2-3 TikTok’s.\n\nAt the end of November when I was now no longer working there, I definitely observed a further decline in her social media activity, particularly during her absence in November for a week for thanksgiving. This is a job you can do anywhere too (besides when she’s needed there to film) When I asked her about the recent posts on the spa's social media because I thought she posted it, she admitted to not posting anything. I expressed my disappointment and I emphasized the importance of fulfilling the responsibilities we initially promised to the owner. In a group chat with her sister and I, I had learned she was canceling her second trip to New Jersey (she was just there a week prior), I said oh good! It’s definitely too much traveling (she’s also leaving for a week at the end of December for a cruise - so she would be gone about 3 weeks in a month….) and then made a comment in jest only to clarify that it was a playful remark. I said “Kyle will fire you lmao”\n\nShe became upset, claiming that I had hurt her feelings. I told her that I vouched for her and she really needs to make sure she does the job.\n\nShe now refuses to communicate (it’s been a week) unless I apologize (as told to me by her sister). I find her reaction somewhat dramatic, as my other friends often provide constructive criticism without offense and constantly tell me if my performance isn’t up to par in my own business. It upsets me that someone would ghost me for days like this. I have truly done so much for her (I pay for a lot of her stuff including food, coffee, given her tons of brand new high end makeup products, perfumes, etc… I have done several math and business assignments for her for school. Literally always go out of my way which now I’m never doing again. I noticed I’m a big people pleaser and shouldn’t vouch without knowing someone’s work ethic lol) What are your thoughts on this situation? AITA?", "created_utc": 1701783271, "permalink": "/r/AmItheAsshole/comments/18bc2ng/aita_for_telling_my_best_friend_she_will_be_fired/", "score": 33, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My brother had told me that it was none of my business and I shouldn’t have said anything, so I figured I may be the asshole. Which now I’m thinking maybe it wasn’t my place… but my other friends agree with me that I am not since I got her the job and vouched for her. I’m kind of stuck.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. I get there’s a whole antiwork trend going on and while I support folks fighting for better benefits and pay, I also think one needs to actually do the job they’re hired to do. You went out of your way to set up what seems to be a cushy position for your friend and she’s taking advantage and potentially putting your reputation on the line. It’s sink or swim time for your friend. I definitely wouldn’t bail her out anymore.", "NTA not only you vouched for her but she took advantage of that and has been slacking on doing the job. I think you could have communicated more directly instead of a sarcastic/tongue in cheek “I think they are gonna fire you lmao” and been just more sincere in your approach- but it’s okay at this point she’s digger her own grave and you aren’t at the job so hopefully this doesn’t effect future employment for you. It really just sounds like a her problem at this point -  no need to overthink it further op you’re good.", "I have been burnt so many times by people that 'needed a job' and I used my connections to help them on their way. You are NTA.\n\nThankfully my last act of putting someone in touch with a contact has turned out really well. In 50 years of employment it is the first one.", "Nta. You staked your own  reputation", "NTA. Your friend seems to not understand the real working world. If shw wants to be cuddled and not told, that she might be fired if she is not doing her job. Don't pay for anything for her again, just wait - maybe she comes around, maybe not then no big loose. Unless you think it could help to meet with her and talk this through - like 'you have to do the work to keep it. If you don't want it, quit but I put my reputation there for you. So please don't just ghost them.' - but maybe she isn't the person you can talk to about this.", "NTA, she's deflecting, I'd stop letting her get her cake.", "NTA\n\nYour friend knows full well that she's slacking which is why your lighthearted warning hit so hard. She comes across as someone who is constantly freeloading. In fact, I suspect this demand for an apology may be a means of manipulating you. \n\nIf anyone is owed an apology it's Kyle. You've done way too much for your friend and received no gratitude.", "NTA - never recommend her for anything again. I once got my own brother a job at my company where I worked and he quit 2-3 weeks in very embarrassing. I never recommended him for anything again. It's been 20 years, and I still wouldn't.", "NTA, but why are you mothering your friends and caught so much up in their lives? Are you bored? Let people Be who they want, go where they want, work where they want.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIs it appropriate for me (23F) to express concerns about my best friend's (24F) job performance to her at the medical spa where I facilitated her employment? In October, I was offered a social media position at a medical spa but declined due to time constraints and an inadequate salary as I run my own ECOM business. \n\nMy friend always says she’s in debt and needs to make money and I am all about putting my friends on opportunities. So with that being said, recognizing my best friend's social media skills, I recommended her to the owner, who paid me to provide her with a 30-day training. I consistently vouched for her, and went there with her the first day to meet him and talked her up so much.. and closed the deal for her.\n\nOn my last day of employment, I addressed concerns from the owner's wife about my friends lack of initiative. She expected my friend to go out of her way to make a good impression and work really hard since she would be rehired without me - and she did not. Keep in mind this monthly pay almost matches her other job, for not having to do much work…\n\nThroughout the month we worked together, she didn’t do very much. She didn’t grow the social media at all.. didn’t answer messages from dms, nothing. She filmed videos with me, uploaded them on a google drive for another person on social media team, and uploaded 2-3 TikTok’s.\n\nAt the end of November when I was now no longer working there, I definitely observed a further decline in her social media activity, particularly during her absence in November for a week for thanksgiving. This is a job you can do anywhere too (besides when she’s needed there to film) When I asked her about the recent posts on the spa's social media because I thought she posted it, she admitted to not posting anything. I expressed my disappointment and I emphasized the importance of fulfilling the responsibilities we initially promised to the owner. In a group chat with her sister and I, I had learned she was canceling her second trip to New Jersey (she was just there a week prior), I said oh good! It’s definitely too much traveling, and then made a comment in jest only to clarify that it was a playful remark. I said “Kyle will fire you lmao”\n\nShe became upset, claiming that I had hurt her feelings. I told her that I vouched for her and she really needs to make sure she does the job.\n\nShe now refuses to communicate (it’s been a week) unless I apologize (as told to me by her sister). I find her reaction somewhat dramatic, as my other friends often provide constructive criticism without offense and constantly tell me if my performance isn’t up to par in my own business. It upsets me that someone would ghost me for days like this. I have truly done so much for her (I pay for a lot of her stuff including food, coffee, etc… I have done several math and business assignments for her for school. Literally always go out of my way which now I’m never doing again) What are your thoughts on this situation? AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but maybe there is something for you to learn in terms of recommending friends and that having an impact on your reputation. Think it is always useful to get some learning from difficult situations :)", "NTA.\n\nMaybe she is not into SM as much as you thought, or is pulling away from it, which is not bad.\n\nBut then she needs to communicate that with her boss so the boss can go find someone else that will the job better.  Maybe your friend is waiting to get fired?\n\nIt's totally normal to vouch for people who you think are good employee prospects.  That's how lots of business teams get made.  Just in this case, it did not work out quite that well.  In the future, work with the person first and get a good idea of their work qualities before recommending them.", "A lesson i learned at 13(my family had a seasonal business that was usually the first job for a lot of kids in our town) NEVER recommend or help your friends get jobs. You can tell them where there is an opening, but NEVER put in a word or anything, because in a professional setting, it is YOUR reputation that you are putting on the line. Just because someone is an incredible friend, does not make them a good employee. My literal best friend for the last 25 years is a great guy, has been there for me through literally everything in my life, but he cant hold a job to save his life. He will ask me at least once a year for help getting a job delivering parts or something, but he will quit, or not show up for work, within the first few weeks, and ive worked too damn hard for MY reputation to besmirch it.\n\nETA. NTA, But this is a lesson for you more than it is for your friend. Because you are also seeing that your friend doesnt care about your professional reputation. And if you run your own business, that is more important than anything.", "This girl is 24 years old.  STOP paying for things for her.  She is an adult, and needs to pay for herself.\n\nHer not doing a good job can reflect badly on you when you recommend her for a position.  You now know that she isn't a hard worker.  Do not give her any more recommendations.  Also, if she ghosts you when you give her some feedback, she isn't much of a friend.  I would distance myself.\n\n&#x200B;\n\nNTA", "Wait, you vouched for her w/o knowing her work ethics?\n\nBut why would you do that? You straight out lied to the owner.... your reputation will suffer really hard from this.\n\nESH", "Yeah I really don’t think I want a friend like this, but it’s rough because I’m so close to her sister too. Her sister told her she wrong, but she won’t budge.", "If op was still working there I could see it. But if op doesn't even work for that company anymore, its kind of nuts to be checking up on her so heavily. Her friend's boss should be fully capable of not approving time off or telling her when the work isn't sufficient. \n\nFor all we know the boss might be perfectly happy with how things are going even if op personally things her friend isn't doing so well.", "Ugh yeah I talked to her a few days prior when I asked if the posts being made were hers and that’s when I was nicer but it seems she didn’t listen so I then made the snarky comment 😂😂", "Ugh! Glad to hear it went well thankfully!", "I also could have negotiated to be my rate I needed I’m sure because he agreed to pay it for us combined the first month but I truly wanted my friend to make money and help her build her career since it would look good on a resume for her. 😅😅", "Ugh, it really upsets me.", "Yeah :( My personal trainer the same day this happened told me to go get the job back and told to the owner and say I noticed she’s not fit for the position. I didn’t want to step on any toes- so I had texted the owner Kyle this. I figured he would find out in time she isn’t fit for the job but regardless now I will look like an idiot and he won’t message me again \n\n“Hi Kyle,\n\nHope you and your family had a great holiday! I wanted to extend my gratitude for the time we spent working together. \n\nAs I transition to new endeavors and pushing my focus on my main company, please know that I'm more than willing to offer assistance in the future, especially concerning anything related to Facebook ads or social media strategies. If there's ever a need or if you require help with specific tasks, please don't hesitate to reach out. \n\nI appreciate the opportunities provided during my time with you and look forward to the continued success of the team 😊”", "What do you mean exactly? If my friends ask me for help, I do what I can to help.", "For sure! You’re definitely right", "For sure! I think she’s just being lazy tbh. She’s obsessed with social media and trying to be an influencer so she posts on TikTok like 5x a week and loves it. Her sister ended up telling me this is just how she is", "You’re right though I should have seen how she works first", "She does really well with TikTok and brand deals she gets so I vouched expecting her to carry that over to the social media med spas business 😩😩 definitely stupid on my end", "Stop warning her and let her get fired.  When she complains just say wow!", "You shouldn’t have done assignments for her - that is fraud, and I don’t see what’s in it for you. She sounds like a massive leech.", "Young guy with the right attitude. I just liked him. I'm very pleased for him.", "It's a good response, it sounds neutral and it doesn't look like it's blaming her but that you're offering to help him since he was your previous employer.", "She didn't ask you for the job, she didn't ask you to comment about what is important about her life choices, she didn't ask for your input if she should travel somewhere, she didn't ask for any of this. \n\nShe's ghosting you because you're not her friend, you're in her life so long as you get to dictate it.", "I understand your perspective, but when she constantly tells me she’s in debt, was looking for better work situations, wanted to get more into social media work and I get her a job doing what she likes.. I don’t really see this as mothering or dictating? I don’t really care what she does outside of the equation of the job I got her that I vouched for her for. I was just trying to be a good friend to make her life easier.", "> I am all about putting my friends on opportunities  \n>  \n>I recommended her to the owner  \n>  \n>I consistently vouched for her, and went there with her the first day to meet him and talked her up so much  \n>  \n>I closed the deal for her.  \n>  \n> I addressed concerns from the owner's wife about my friends lack of initiative.  \n>  \n> I was now no longer working there, I definitely observed a further decline in her social media activity  \n>  \n>When I asked her about the recent posts  \n>  \n> I expressed my disappointment and I emphasized the importance of fulfilling the responsibilities   \n>  \n>I had learned she was canceling her second trip to New Jersey (she was just there a week prior), I said oh good! It’s definitely too much traveling  \n>  \n>she really needs to make sure she does the job.  \n>  \n>I pay for a lot of her stuff including food, coffee, given her tons of brand new high end makeup products  \n>  \n>I have done several math and business assignments for her for school.   \n>  \n>Literally always go out of my way\n\nThis is just one story, and i would be exhausted if my friend was like this. I'd end up just trying to fade out, or never tell them anything, because it could never just be a simple conversation and i'm allowed to get on with my own thing. You'd try and take charge every single time. \n\nI'm being serious, learn how to be a friend - you can still be a people pleaser if you want, but give everyone their own autonomy to live their lives and know that they can talk to you about issues without it being a hostile takeover.", "yes, she's talking about her life, TO HER FRIEND, that's what friends do, chat about current life situations. Offering the job was great, and it should have stopped there, but you're actively in her life trying to dictate what she does and does not do. You need to take a step back, and learn how to be friends with people and not meddle so much or this ghosting is going to be a recurring theme throughout your life.\n\nNot everything your friends tell you means you need to step in like mother to fix, it just means they are discussing it. A good rule of thumb would be to ask them 'Do you just want to complain, or do you want me to help find a solution?', and stick to what they answer.", "Again, I understand your perspective. I guess I am used to some friends who paved the way like this for me. \n\nShe’s very shy and stand offish. It’s just her personality and she was terrified to meet the owner and talk to him. As I probably should have put in here, she wanted my assistance with this or I wouldn’t have done it. I am not like this with my other friends. The only thing she really hasn’t asked for is me to buy her some stuff- which again is my fault. I am uncomfortable asking for money and when we go out she sometimes doesn’t even offer to pay for her portion or give me the money so I just stay quiet as it’s uncomfortable. She’s asked me on many occasions for help with her school assignments and to do it for her. I didn’t just offer. I don’t try to dictate her life. I am upset about my reputation being put on the line when I assured the owner and his wife several times she is AMAZING at what she does", "Then you've learned a valuable lesson. Next time, you can suggest the job to a friend, let them know it's open and let them apply themselves. You've gone way above and beyond what is reasonable here. \n\nYou're upset because she's not doing the exact thing you told her to do, and now she's ignoring you. Let her go, she's not acting like your friend, but please please learn how to stop going beyond for people, it's going to consistently burn you.", "You are right. I am deff done doing that! I learned my lesson. Thank you ❤️", "The other hard lesson is that there are friends, and then there are \"friends\" in name only. The latter care more about themselves than you, and will take, but rarely give.\n\nGiven other examples ie not offering to pay for food in the past and wanting school work done without puttingin any effort, if there's a glaring warning sign or say 2 red flags, I'd be extremely cautious in the future dealing with \"friends\". \n\nYou have to be civil. You don't have to be friendly."]}