{"id": 32418, "submission_id": "18bnl4i", "title": "AITA for Refusing to Let My Sister Stay with Us?", "selftext": "Hey Reddit, I (36f) and my husband (31m) are in the process of moving into my parents' old house, as they're retiring to Florida. This house holds a lot of sentimental value for me, as I've spent my entire life here. My younger sister (22f) currently lives with our parents, but she has flat out refused to join them in Florida and wants to stay in our hometown.Here's where the issue arises: she asked to stay with my husband and me, and I said no. This will be the first time my partner and I are living in our dream home together, and we're also gearing up for the exciting journey of starting a family. We've been planning this for years and want to create a positive environment for our future child.I love my sister, but I don't want her living with us. She claims it's unfair and rude, and she hasn't spoken to me in weeks. My (60f) believes I'm being cruel, but my husband and I see it differently.My sister unfortunately doesn't have a place to stay, but I believe she's old enough to figure it out herself. AITA for not allowing her to stay with us during this crucial time in our lives?\n\n&#x200B;\n\n&#x200B;\n\nEDIT: For some reason I typed mother in-law instead of just \"My Mother\" before, typo LMAO\n\nHubby and I are being given the house. \n\nAnother reason we don't want my sister moving in is because she has Bipolar Disorder and my husband cant deal with her crazy mood swings from what he's seen from her over the years, and I've been dealing with her episodes my whole life and I cant handle it anymore.", "created_utc": 1701813420, "permalink": "/r/AmItheAsshole/comments/18bnl4i/aita_for_refusing_to_let_my_sister_stay_with_us/", "score": 738, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1- I will not let my sister move in with me and my husband because we want to start our life together\n\n\n2- My sister will be homeless if I do not let her live with me and my husband for the time being\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Are you giving your sister time to find a place or save money?", "I recommend you tell everyone you meet this fun story", "INFO: Are you purchasing your childhood home from your parents and becoming the legal owner of it?", "INFO - Your parents gifted you a whole house and gave her zip?", "The narcissistic entitlement is strong here. YTA. Learn to be a better human.", "I hope your sister claims squatters rights and drags you through the legal system. Your parents are a bunch of dummys for this decision to begin with though. \n\nNot sure if you are from the US or not your response make me think you are from another culture or just uneducated.\n\nYTA you clearly don't like your sister.", "Info. Why do you get the house? Did your parents give it to you, are you buying it? Isn't your sister going to inherit half of it one day? She's certainly got the same reason to be emotionally attached to it as you do.", "YTA. And your parents too. It would be one thing if you were purchasing the house, with money you had saved up for and worked hard for. But being given this place ‘because I’m the oldest’? That reeks of favoritism, especially if your sister isn’t being presented with something of equal value or half the ownership as well. And ‘she might get mom’s car someday’ is NOT equal value. You have some nerve to be dismissive of your sister’s soon to be homelessness and act like she should go find some magical solution that lets her life not be upended because ‘she’s an adult’ when YOU as the OLDER adult are getting presented housing stability with zero effort on a silver platter. It’s obvious from how you write this that you’ve lead the privileged life of a golden child who just doesn’t understand why everyone else could possibly struggle when you always seem to get what you need just by asking. You treat your sister as less than, and it’s frankly disgusting. But the blame falls equally so on your enabling parents. If they can’t split things evenly between siblings and treat them the same, then they obviously caused this callous entitlement you display.", "YTA. You're kicking your younger sister out of her home so you and your husband can have it all to yourselves. Your parents and you are all AHs. They should have given it to you and her equally, or with the condition she's allowed to stay and also given her something of value to help her eventually afford her own place. \n\nOf COURSE she doesn't want to uproot her whole life and leave her friends and familiar surroundings to go with your parents somewhere unfamiliar where she doesn't know anyone. Do YOU want to move with your parents? No, you don't. Why do you think she would? She's 22. Not quite old enough to get on her feet yet or comfortably afford her own place, and basically her whole family is just abandoning her. If I were her I'd never speak to any of you ever again. You're all fine with her being homeless. You're completely selfish. Completely. And on top of it, you and your husband are greedy. I'd rather not have a sister at all than have one like you. What a complete betrayal your sister is experiencing from the people who are supposed to love her and care about her the most. It's clear that none of you do.", "~~INFO:~~ So you're *buying* your childhood home from your parents?\n\nYTA. Your post and your comments make it clear you don't give a flip if your bipolar sister is getting pushed out of the childhood home that you're now getting for free. If your parents are fine with this then they're also assholes.", "YTA - So you’re planning on making your sister move out of HER home because YOU want to live there without her? Have you read what you’ve written? YOU think your entitlement to a home that should be both of yours family home comes above her right to continue to live in HER home? You’re expecting your 22 year old disabled sister to go figure something else out so you can move your ass into a property you’ve done Jack shit to afford or deserve? Give your head a shake. Your attitude and sense of entitlement is gross. Don’t hurry yourself to reproduce. We don’t need more of you in the world.", "YTA. Reading through this thread and your responses you and your parents are doing something really cruel. You are getting a dream house while your 22-year-old sister not only gets nothing but loses her home. Can you really not see how unfair this situation seems, or do you not want to see it because you're the one who's benefiting? I actually think your parents are the biggest AH's here though by creating this situation. Seems like a family severely lacking in understanding and empathy.", "YTA. You said it yourself your sister will be HOMELESS so you can... live in the house you're kicking her out of??\n\nWtf dude?", "You and your parents YTA - you chose to leave critical info out of your post - your parents are gifting you a HOUSE and giving nothing to your sister except (possibly) a car in the future that is a depreciating asset of far less starting value. Both you and your sister grew up in the house yet you seem to think you deserve it more because you’re the oldest. Can I say double YTA?!", "YTA", "You are a pathetic human being\n\nAbsolutely YTA", "YTA. And your parents are assholes. You are gifted a whole ass house, the house your sister currently lives in, and she was given nothing but marching orders. I can’t believe that four grown ass people don’t see the cruelty of this scenario. You say it holds sentimental value as you have lived there your whole life. Not if you are moving BACK into it… Know who HAS lived there her whole life? Your younger sister. Either she moves out of the home she has always lived in and moves to some retirement community in another state or she is homeless, while you and your husband move into your free house. What kind of parents gift a HOME to their eldest child and then do this to the youngest?", "I honestly cannot let go of this. My younger brother was a pig headed, directionless asshole most of his life. If my parents ever said, “Hey! We’re giving you our house and moving to Florida!” My first question would have been, “What about my brother?” and he didn’t even live with them. I couldn’t live with being treated so unequally.", "YTA. You no longer have a sister. Happy family starting 😊", "If you are not outright purchasing the home, then YTA. That is her home too. However, if you ARE outright purchasing the home, then NTA, baby sis can find somewhere else to move. We need more information.", "YTA and so are your parents. You're spoilt and your sister is being left out of everything, I'm sure not for the first time. Don't be surprised when she cuts you and your parents out of her life one day.", "YTA. Parents house she also grew up in. Not yours. Learn to share, buy her out, or sell it and split the money.", "YTA, massively. Both you and your parents. JFC you’re awful!", "YTA. You are & your parents are. The only person who isn’t is your sister. I smell “golden child” vibes here. I am a mother of 2 & call bullshit on you & your parents. A house & a car are completely different assets. Your sister is 22 years old & you’re throwing her out. One assumes she’s just finishing college or at the start of her career. You’re 14 years older. You & your parents should be utterly ashamed of yourselves. You make me vomit.", "Since you refuse to answer anyone’s question as to the ownership of the house, then YTA as your sister has as much right to live in your parents’ house as you do.", "Yes, YTA. You’re leaving your 22 year old sister homeless, so you can live out this crucial time in your lives? She may have bipolar disorder, but it sounds like you’re suffering from narcissistic personality disorder.", "Info: If its your parents home and she lived there until now, doesn't she have the same rights to it as you do (i.e. 50% assuming you and her are the only kids)? Or did you buy the home  from your parents?", "I cannot for the life of me understand why your mother would gift you a house and put your disabled 22 year old sister into a state of pending homelessness. The stress of that alone could easily trigger an episode. You're all just fine with this? Wild! \n\nI KNOW it's not easy living with someone who is struggling with a mental health condition and I can only imagine what it feels like living with one. This as the solution? Awful!  \n\nYTA *mom too/moreso, marginally", "Wow, YTA and your parents even more assholes than you. So you are getting your childhood home (which is also your sister's childhood home, by the way) for free, she is being kicked out with nothing, and you don't seem to see the problem here. Your parents are hugely favoring you over your sister in a massive, crushing way and she is left into the street, while her sister denies her a place to stay while she is being robbed of a possible inheritance unfairly. In Spain she would be able to sue your parents and you. You are within your rights of not wanting to live with your sister, but the fact that you don't see anything wrong with the away your parents are treating your sister, who is almost ten years your junior, makes you a huge asshole, as well as them.", "YTA. And greedy. And selfish.", "YTA, you are being given this home for free. What does your sister get? 22, disabled, and tossed out onto the street. You, your husband and your parents are all TA", "YTA You are  36 and are being GIVEN your dream home. You should’ve been working towards that anyway or a home to start a family in, at least, by this age. I think I would argue that 22 is a more crucial time in life. It’s easy to be broke and rack up a bunch of debt at 22.", "YTA you are greedy and selfish. The fact that you’re ok with her being homeless is crazy to me, you didn’t buy the house so she’s entitled to stay. She grew up in that house too.", "YTA. I would be so mad if my sibling got the house because of stupid reasons such as I am the oldest.", "YTA.", "YTA. Your parents gifted you a house that your sister was living in, and now she's evicted with no grace period? Your comments make you sound really cold too. Give your sister a grace period to find a place of her own at least.", "YTA and it sounds like your parents created you this way. Your sister may very well have a condition that affects her ability to function but if you really cared about her (and evidence here suggests you don't) you would at least offer her a place to stay if she is in treatment and doing the work treatment requires. At the very least you could create a formal lease and sublet a room for a period of time that allows for transition.\n\nThe fact your parents have moved was something that was likely in the works for a while and if your sister was aware of these plans then she has some culpability in not finding a place to stay but with what you have said her ability to interact with the world might be severely compromised. But naturally this is all very terribly inconvenient for you and that is what is really important here. Everyone here sounds like an asshole and you most of all. Giving off real \"but it's miiiiiiiiiiiinnnne\" vibes. Furthermore depending on your parents for a house is lazy and entitled, if you had a shred of decency you'd try to find a way to be supportive in this mess but your clear sense of un-deserved and un-earned self-importance likely prevents that. The fact you can seem so judgmental towards your sister while relying on your parents to be able to provide you a house in which to start a family speaks volumes about your character.", "Yta. You're  not going to your dream house, you're  moving into your sister's home your parents gifted you.", "YTA\n\nit's her childhood house too, and apparently you hate her for some reason (ableism maybe by how you called her episodes \"crazy\") you could have tried an arrangement but kicking her out of her house just because you and your husband can't understand someone with such condition is just AHloery, learn and try to understand what is bipolar and how you can treat someone with it, do you even like her?", "YTA It does not sound like your mother is on board with giving you the house if she thinks kicking your sister out is cruel.", "YTA-You are trying to save butt by mentioning how your sister is crazy because she has bipolar. My mom has bipolar and even though it’s tough, your sister has nowhere to live and is probably still in college plus u guys are much older than her. Just how you word things just gives me the ick", "I think there’s a lot more to this than you’re telling us & i’m getting a whiff of asshole from you.", "YTA and so are your parents. \n\nI honestly can't believe you are this cruel and dense, like...surely you can't be. Of course YTA, how can you not see that at all? \n\nSo your sister has been living with her parents, probably trying to save money, and is considerably younger than you and also not married \\[so doesn't have the added bonus of two incomes\\]. She has a disability that will make it hard for her ultimately in life in general. You are a major AH. \n\nShe asked for a grace period simply to get herself together so she can move out on her own, which is a completely REASONABLE and MATURE thing for her to do, yet you can't even give her that? You and your parents must honestly hate your sister because this comes off so cold and cruel of you all. \n\nThe way you talk about your sister sounds like you absolutely despite her existence. It's just disgusting. You keep saying she can be a 'big girl' in your comments but she is 22, you are 36 and married. You've had 14 years and a marriage partner to help you be in a better position than her and you can't even give her a grace period? \n\nYou are the worst.", "I kind of think this is your parents’ problem.  Sister had been in their care until they gave you the house. What did they expect to happen?", "YTA.  You and your parents are both being extremely thoughtless here, and I'm usually one who's all \"you have no obligation to molly coddle a full grown adult. \"  But it seems as if there has been little warning or reciprocal gifts to your sister and that's very much ta.  \n\n\nThe fact that you're being gifted the house changes everything.  Do you not see that?  It's not ta to not want to live with a difficult person, that's not the part that's ta...  \n\n\nThe part that's ta is that your parents gave you everything and her nothing.    \n\n\nAt the very least they should have set her up with a jump start in an apartment and a vehicle or the like.", "ESH - except your sister. The full truth came out in your comments. You’ve been told your entire life that you’re being given the house and there’s no current plan (that you know of) for your sister to inherit anything. Given the 14 year age gap, I’m guessing you were the child your parents wanted and your sister was an “oops” baby. Then she gets diagnosed with a mental health disorder, likely linked to growing up knowing she wasn’t “the chosen one.” I hope for her sake she’s able to get on a solid medical treatment regime and go NC with you and the rest of your toxic family.", "ESH but what does your sister do? If she’s 22 she must be in or finishing uni or already working so why does she need to live with you? \n\nLike someone else commented tho, are you buying or just receiving the house? If she was already living there it’s kinda harsh to kick her out.\n\nI think in general this post needs more info.", "YTA\n\n\nYour parents aren’t even trying to be fair here. Many wills will do something like “house equals 375k and 375k life insurance policy.”", "You’re being given home by your parents that your sister currently lives in, correct?", "ESH\n\nOP, \"giving you a house\" because you are older, you do understand that s not a valid reason now, do you? If you were in your sister's shoes, you would be screaming \"unfair,\" and we all know it. It is fair, only if it is equally fair for all the people involved.\n\nTruth be told, I don't know many married couples who would like to stay with a relative for a long period of time, regardless of their mental state. I, too,  find it suffocating.\n\nYour parents are first world AHS. They treat your sister like she doesn't mean or count as much as you do. Not only second in birth, but apparently the bottom in all their choices. I wouldn't talk to them again. Or you who are an active part of their unfair treatment. Not that it would make a big difference since selfish people only care about their *ss\n\nThey should have sold it and split the money equally", "Your sister has \"holds a lot of sentimental value, as she spent her entire life there\" just like you do!  You are older have husband, but she is just starting her career/life. Doesn't matter who owns what, you cannot ask her to leave. OP + husband + parents have no human values. Cannot believe what i am reading here :( So SAD!", "YTA. Your sister is going to spiral after rightfully feeling betrayed by her entire family. If she hurts herself, it's your fault.", "YTA\n\nIf anyone could be expected to find their own feet it’s you and your husband. Your parents should have included her in the will or offered her something of equal value. You’ve commented who would say no to a house, well you should be able to see how unfair this situation is. If you don’t want her to move in I would expect you to take responsibility and help her find a place including financially.", "The only work around is you should have paid her half the money that the house is worth, in order to get her share. Super fucked up to give one sister a whole ass house and leave the second sister with nothing, less than nothing, she’s now homeless cause she had been living there her whole life. YTA and so are your parents for such blatant favouritism", "how tf can you say shit like “it holds sentimental value to me” as if it wasn’t your sisters childhood home. i’m an older sibling and have discussed if anything happened that i would get the house out of me or my younger sister and if it ever came to that i wouldn’t kick her out especially if she doesn’t want to. you are a gross person and a shit sibling", "YTA\n\nI don’r care that your sister has a mental illness. They are difficult .\n\nYour sentimental home is hers too. Your parents are giving it to you, a 36 year old without making suitable arrangements for their 22 year old that clearly needs supports. \n\nYou were 14 when she was born and out of the house when she became symptomatic. Your husband hasn’t dealt with shit to be over her shit. \n\nYou two are selfish beyond belief. Your spawn will be entitled pricks", "You're being given the house... this could easily turn into \"were going to be given.\"   \n\nYour parents and you are both YTA", "NTA - she's 22 and an adult.  If she hasn't prepared herself for this then it is on her.  She was given an option but refused it on preference not necessity.  It's time for her to spread her wings and make something of herself like an adult.", "Assuming there are no undisclosed issues like a disability, NTA.\n\nI feel like your parents should have done a better and more clear job preparing her to move with them or move out, it sounds like they expected you to relent and let her stay.\n\n(EDIT)\n\nWith the additional info provided I am reversing to YTA. You were given the house for free and there are additional circumstances with you sister's health that make your attitude pretty selfish and uncaring.", "NTA. You don't owe your sister a free ride.\n\nIf you're concerned about her being without shelter, and you were feeling exceptionally nice, you could draw up an agreement where she would pay you a small amount for rent and utilities and live with you for a short amount of time, but you're by no means obligated to do so, nor would refusing to do so make you an AH.\n\nFrom what it sounds like, though, sister wants a place to stay for free indefinitely.", "I don't understand the people who are saying the sister will be homeless. If she looks for a place to stay she won't be homeless.  She also has the option of moving with the parents, and she's staying in the hometown by choice. She has options.\n\nI'm not sure I'd like a much-younger, bipolar sister living with me when I was starting a family. NTA.", "EDIT: A lot of people have been asking.. Me and my husband have been given the house by my parents, we did not buy it.", "NTA. She is a grown adult.", "NTA. She’s an adult and you’re not her mother. Her parents need to figure it out, not you. It’s unfair and rude that she feels entitled to your resources and home. Your mother in law is cruel for ditching her without a plan for her.", "NTA. But.. it would be decent of you to let her stay with you for a little while until she figures her shit out and can branch out on her own. I am assuming your parents made it clear that the house is unequivocally yours. Otherwise, the analysis may change", "I feel like I am going to be down voted for this but ESH.  Quick question though, is your sister abusive in any way and that's why you are being so apathetic? Otherwise, I don't quite get it and it looks like you are the golden child. I also don't think you are doing yourself any favors by responding in 5 words or less without adding any elaboration. Might want to add details as to why you are behaving like this in your post or in comments. \n\nAs it stands now, your sister is an AH because she has an opportunity to move to FL with your parents and is actively choosing not to. She is not going to be homeless like some other redditors are saying. Your parents are AHs because they still have a relatively young daughter and should be still caring for her as she moves into new adulthood and not making your sister your issue. You are an AH because while it's not your problem, you should be working towards a solution with your parents to make this transition easier for all involved parties instead of ousting your sister entirely. While I don't think you are an AH for getting gifted the house since it wasn't your decision, you should have a certain amount of grace and compassion on the transition if there aren't any other factors that are causing this disturbance.", "Nta - your parents didn't want to make this decision, so they left it up to you. They knew for months, maybe years they were moving to Florida. They could have helped her find a new place any time. They didn't. They knew this would happen, and now they are acting fane acting like it's all your fault. \n\nTell your sister you will help her find a new apartment or house. You understand she's upset. But this is happening and she can pretend that it's not but she will have to leave. Don't be shocked when she stays as a squatter. Your going to have to evict her. You cannot lock her out under any circumstances.", "Nta if she can’t find a place to live she needs to move with her parents. She wants to be a child then she’s gunna be a child in your parents new home", "NTA - having someone wth extreme mood swings is not someone I'd want to live with either, especially with bringing children into the world. Your parents at TA for not giving her something else of value (depending on the circumstances)", "NTA  Time for sister to grow up, adult and take care of herself!", "NTA if the plan was always this sis should have been preparing herself. She asked a question and you have a right to say yes or no. It's legit not your fault or problem if she doesn't prepare herself. You also can't control what your parents do. Fault is on the parents. If they knew and have been preparing her then it's sis fault for not doing anything.", "NTA. To me this is basically your inheritance being given to you before your parents pass. \n\nGods forbid, but if they had passed, and the house was only given to you, no one would be calling you an asshole. This is the same thing, without the death of loved ones involved. \n\nI get why your sister doesn't want to leave, she's never lived outside of the home. But the house wasn't given to her. It was given to you. \n\nEspecially with your sister having BPD, and your husband not being equipped to deal with her disorder. That's extremely unfair to both your husband and your sister.", "NTA. I think it's bad idea staying under one roof with sister while married + bpd. Have you people read other reddits stories", "NTA. Your parents agreed to have your sister live with them. If they sold the house to someone other than giving it to you then she still couldn’t live there. You are being given the house yes but if your parents wanted you to still allow your sister to live there with you then it should have been part of the agreement. Unless it was explicitly agreed she would continue to live there then you are TA.", "NTA at the end of the day it’s your new house and your new family, I understand wanting privacy. But have you thought about letting her stay if she helps with the future baby? You’re gonna need your sleep", "NTA. She was living with her parents. Her parents will no longer live there and have her the option to move with them. Let say OP decided she didn’t want the house. Will the sister be able to afford all the costs and maintenance of the house? If not. It’s as if she want to use her sister for a free ride. And why would a married couple who is trying to start a family wants another adult playing house with them?", "Nta, she's an adult and has been for a few years. She can get a job and a roommate, and suck it up. That's real life. Coming from someone kicked out at 16, I had to grow up faster then your sister, she had her time to.\nShe also needs to get on meds, she sounds exhausting to deal with and a little crazy", "NTA - not your responsibility", "NTA. If your marriage is important to you, stand your ground. Any third party living with you will disrupt your marriage. Disruptions will be exponentially worse due to your sister’s horrible, entitled attitude — and her mental issues.", "NTA - you are not responsible for housing your sister and I’m shocked so many people think you have an obligation to care for a 22 year old. If you were 16 and she were 2 these same people would be horrified that you’re expected to parent her.  Good grief. Such hypocrisy.   Your parents have made the decision to gift you the house. That’s their right. They could have asked you to pay for it. They didn’t. That’s their right. Your parents are offering your sister a home in their new house but she is choosing not to move. She’s an adult who is making decision and has to live with the consequences of that decision.  IF you want to do something to make this transition easier for your sister, you could offer to give her a lump sum of money or pay for a year of a rental so she has time to adjust to being the self sufficient adult she should be.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n  \nHey Reddit, I (36f) and my husband (31m) are in the process of moving into my parents' old house, as they're retiring to Florida. This house holds a lot of sentimental value for me, as I've spent my entire life here. My younger sister (22f) currently lives with our parents, but she has flat out refused to join them in Florida and wants to stay in our hometown.  \nHere's where the issue arises: she asked to stay with my husband and me, and I said no. This will be the first time my partner and I are living in our dream home together, and we're also gearing up for the exciting journey of starting a family. We've been planning this for years and want to create a positive environment for our future child.  \nI love my sister, but I don't want her living with us. She claims it's unfair and rude, and she hasn't spoken to me in weeks. My mother-in-law (60f) believes I'm being cruel, but my husband and I see it differently.  \nMy sister unfortunately doesn't have a place to stay, but I believe she's old enough to figure it out herself. AITA for not allowing her to stay with us during this crucial time in our lives?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Does she work? Is she capable of living independently? Does she need care and support beyond that of any other 22YO? Are your parents open to her moving with them to FL?", "Yes, if you're being given the home, then YTA. I get that living with a bipolar 22yo is a lot and you'll end up doing some caregiving. If you don't want to do that, then you can be an adult and find a place you can afford.", "INFO - were there conditions attached to giving you this house, namely any support your parents wanted you to provide your sister?", "YTA", "YTA. And more.  What does little sis get?  You get a house.  She gets nothing?   You are real selfish    And it will be interesting to see your kids 10-12 years from now with their karma coming in generationally", "With every answer, OP adds to the avalanche of heartless behaviour. The entire family are unfair and cruel to her sister. OP: YTA. If you cannot see why, YOU are the problem. \n\nI hope your sister is alright, and finds care. Apparently your family don't give a toss", "YTA - A massive gaping one, hopefully with a persistent itch.", "Info—is she on meds and in therapy?", "INFO: have you always hated your sister? You were 14 when she was born and I’m sure you handled that transition from being an only child to having a newborn sibling like a CHAMP 🤣", "YTA. You are being given the house?! This seems wildly unfair.", "I think I see why your parents are moving to Florida and giving you the house… They don’t To live with her anymore and don’t wanna deal with a evicting your sister.\n\nFind out legally what you have to do to evict her .\n\nTo be kind, I would try to find out what state programs there are  to help her find housing. Is she on SSI for her bipolar?\n\nIf you’re being gifted a house and have to make no payments on it, you should get your sister an apartment and pay for the first year of rent to get her situated .", "Bipolar is TA.  Nobody chose this for your sister.\n\nIt's left everyone not really knowing what to do next, without feeling selfish. Because every one of you wants to live their life with LESS stress.  \n\n\nYour sister:  still very young to have anything figured out-- it's not her fault but she does have to understand that her life with bipolar will never be easy.  And she needs a realistic living situation: 1) Free (?) with you, but you don't want her, 2) free with your parents, for now, but she does not want that in FL (and perhaps they knew she would not want to go), 3) find a place/room to rent (you did not mention a job/income situation for her).\n\n\nYou (and husband): our 'gift home' our rules. Lucky you (UNLESS you are purchasing/renting).  IF it's truly a gifted home, you are the luckiest.\n\nParents:  wanting to live their life, nearing/in retirement, and now having to worry about what each or their daughters will do, knowing that this would be a huge predicament -- a gift and a curse.\n\nI think the best solution would have been for your parents to sell the home and gift both you and your sister some/or all the (proceeds) between themselves and their daughters. Or gift you AND your sister.\n\nHow are your years of growing up in the 'childhood home' more important than your sister's?", "YTA, why do you deserve the house over your sister, when you're both your parents' children? Quite frankly, your parents are also TA for not mediating this situation better, or dividing the asset up fairly somehow (even if this means selling the house and each of you get a piece).\n\nYou're not only TA, but referring to your parents' house as a dream home that you somehow earned (which you didn't) is delusional. Also \"she doesn't have a place to say, but she's old enough to figure it out\" is extremely rude. It's like you're talking about a stranger, not family. Very rude.", "YTA. Your parents too. Your parents are giving you the house and you are throwing your sister out. You should be buying g your sister out of her portion of the house. Of course you’d never do that. You’re too entitled as the golden child. You are not in a “crucial” time in your life. She obviously is.", "YTA. You should take some mental health classes before having a child also, Bipolar disorder is hereditary as are loads of other things. Imagine having a child EXACTLY like your sister and what that would look like. \n\nAlso, she is 22, you are making her homeless and using her mental health as an excuse. If I were your parents, I would give the house to her instead just for this.", "YTA - way to turn your back on family. Get her the help she needs instead of kicking her out.", "YTA. A massive hairy asshole. And your parents are too. I hope your sister wins the lottery and doesn’t share one thing with any of you horrible people.", "If you’re inheriting the house , for FREE, then let her stay? Like yes YTA", "YTA sorry not sorry, but you should be.", "This is just good old fashioned family dysfunction. It's not you. It's your whole family's design. And now you can pass it on to your kids (probably). \n\nIt's not your desire to start a family or individuate that makes you an asshole, right? It's the fact that you were raised in a family where the oldest child is \"burdened\" by a sick younger sibling and your parents didn't do enough to foster compassion in you or support your sister the way she needed earlier in her teens. This is just a natural evolution of shitty family dynamics. Everyone loses.  \n\nIt's okay though. It's not your fault. Your family conditioned you to play responsible big sister too much for too long and now you're an ass to your sister because she's young and sick and you resent her. \n\nYes you are an asshole but it's not your fault that you learned to be one.", "YTA\nAnd a big one\n\nAbsolutely selfish if you ask me\nAll you think is about yourself nobody else\n\nYou're just a jerk", "YTA you are being given the house. She is being gifted homelessness. Of course YTA and your parents. You all sound entitled and selfish I hope your sister gets away from you all and lives well", "YTA, you get a free house and your sister can’t stay where she already lives.", "YTA so much that I'm wondering if this is rage bait. \n\nYou're dancing around the fact that you are essentially kicking her out, not just \"not letting her move in.\" Your comments also say that even your mom says you're being cruel. The mom that is GIVING you a house. \n\nI get the impression that you think her having bipolar disorder makes a better case for you, but its quite the opposite. It just makes this much more cruel. Your mom is right. \n\nAnd even without her disability, she is quite young, especially given current economic conditions. And given her no grace period? Its extremely difficult to find housing, even in the best of circumstances. \n\nBut I'm wondering if you're already quite aware that times are very tough financially, because you seem eager to accept a free house without even offering your parents anything in return. Without even considering your parents wishes about your sister. Do you have any money either? \n\nDo better.", "YTA.  I really hope your karma is public and messy.", "YTA.\n\nAlso since you're inheriting the house and not purchasing it and because your sister is already living there, she most likely has tenants rights. You probably can't legally kick her out", "YTA and so are your parents. Giving your sister a small grace period to get a place of her own would be better than just throwing her out. You’re moving back in, she’s been living there for the last 22 years. You could draw up a lease that she must sign, laying out the rules of staying and what time frame she needs to have her place. \n\nIs she being properly treated for her BPD?? \n\n\nYour parents are bigger assholes for just giving you the house and nothing to your sister of the same value. Really shows favoritism here from them.", "YTA \n\nWhy are you being given A HOUSE and your sister made homeless?\n\nYou and your parents are assholes", "YTA Completely", "YTA and you know it. You lowkey made this post just to rub it in your sisters face. One of your comments said she works full time but doesn’t make a lot but “she can just get another job or something” means you know she can’t afford anywhere else to live and you still are willingly making her homeless. You’re the worst", "Stand your ground. Keep your own family's needs first and foremost.", "YTA and your sister should sue you and also report the lot of you to the IRS.", "No, her original offer was just for a little while but no, she isn't gonna move in with us. She's 22 and can be a big girl", "At work functions…\nParties…", "Yes 100% tell everyone how gracious and kind you are to your sister", "This is a critical piece of information for this one.", "We are being given the home", "Yes, I was always getting the house. Im the oldest in the family. She might get my moms car one day or something but no house.", "We were given it, my sister was never going to inherit it.", "They like OP because she isn’t seen as damaged, when clearly the sister struggles.  Instead of helping the younger sister it sounds like they shun her.  OP doesn’t seem to care how big of an impact this will have on the sister (leaving familiarity could adversely impact her mental state and OP doesn’t give a rat’s ass clearly).", "OP says they are being given the [home](https://www.reddit.com/r/AmItheAsshole/s/GxmXyV9seR)", "Exactly what I was wondering.  If no agreement of some sort of recompense is in place, or unless your in-laws specifically stated she was out then she has as much right to the place as your husband does.\n\nHolding judgement until more information.", "We are being given the home", "She can move to Florida with her parents or get a job and pay rent in an apartment. If she ends up homeless in this situation, that’s by choice.", "Asshole parents.", "She is not. Parents gifted her the home because \"she's the oldest.\"", "It's whomever the parents give the home too. Maybe it's not fair, but here in the US, you can do just that. I know because my \"brother\" got our family home...", "I was promised this house, not her. From what I know she wasn't promised anything", "My guy, you haven’t experienced real hell until you’ve lived with an un-medicated person with bi-polar disorder.", "Someone had to say it. I can’t believe people are this entitled and cruel nowadays, maybe it’s always been that way. What 22 year old can even afford to live on their own nowadays?", "She’s 22 years old….", "She says her parents “promised” her the house so it sounds like they just gave it to her. They clearly have a favorite child.", "She did answer now. She has been given the house. For free. Because she is the oldest. The sister might get an old car one day", "She says that the parents gave them the house for free and try to defend herself saying the parents promise it to her because she is the oldest. Which is legally dubious, depending on the country they are in, if they don't offer the sister something of equal value to the sister. In Spain that would be a possible criminal offense, as the law indicates that parents can't disown children and there an specific part of their properties that have to go to them forcefully. Something like what OP did would be reportable, as it can be seen as a way to circumnvent those laws giving her a \"donation\" while they are alive in detriment of the youngest daughter. Depending on the country, if I was the youngest, I would seek a lawyer. But they are giving a complete house for free to their oldest daughter and kicking a 22 years old to the street.", "I have been tested and all I have is basic anxiety, her illness is on another level, she used to get crazy when she was a kid, and its still bad now", "My parents have given my husband and I the house", "I legit hope she leaves this family and never gets back to them \n\nJust let them rot in that house", "She works full time but honestly doesn't make much money but she can just get another job or something", "If you consider bipolar disorder a disability then yes she does have one. Another reason I don't want her living with us, I cant handle her mood swings and my husband cant stand when she gets \"manic\"", "Disability is irrelevant. He doesn’t owe her shelter.", "Well, to be fair OP is also looking for a free place to stay since she’s being given a house.", "Oh, yeah, in this case, YTA. What did your parents give to your sister? Or did they give her nothing, assuming she would also live in the house?", "Well, then it depends if she got a house or money as well, or did only you get a house and she got nothing? If its the latter: YTA, and also the parents for essentially giving one kid the whole inheritance and the other kid nothing.", "YTA. You should be mortified that your parents gave you a house and displaced your sister (and didn’t offer her any help). The favoritism from your parents is disgusting.", "Yta.  I hope you have a crazy case of termites.", "It’s OP’s parents, too. The house is also the home the younger sister grew up in. She has never lived anywhere else. The parents (not in-laws) gave the house to OP, but the younger sister got nothing. (OP said she might get their mother’s used car someday…) So, while her older sister is being given their childhood home for free, younger sister is given the option of moving to another state or being homeless.", "The sister can't be cheated out of a part of the property, even if it is a very minor part, unless she is given something of equal value, which she isn't. Depending on the country, like Spain, what they are doing would have been totally illegal and prosecuted. So they are effectively cheating the younger sister out of the inheritance by giving her the house while they are alive, as in their wills they will only have to present the goods they currently had, which doesn't include the house. OP says she would have been given the house anyway, but depending on the country, they might have been stealing from the younger sister.", "She isn't responsible for that", "You are completely believing OP. But I think OP is an unreliable narrator myself. If anything I find OP entitled. Just because she;'s the oldest doesn;t mean she deserves her \"dream home.\"", "Says the 31 year old that depends on mommy and daddy to have a home", "That statement is really hilarious /s coming from someone who did NOTHING to earn the house other than being born first. May you receive the karma you deserve.", "You are 36. You can be a big girl too and buy your own house like most people instead of indulging your parents and their unfairness. How would you feel if she got the house and you didn’t!", "\"she can be a big girl and just have mommy and daddy give her a house like I did.\"", "You're not going to give her a grace period for her childhood home? You sound really harsh. Do you even like your sister?", "You are even a bigger girl. You can buy your own house without stealing thousand of dollars of a property that should have gone to both of you to your ten years younger's sister.", "If I was given a house, I'd sell the house and split the money between my siblings.\n\nBut then I actually love and care for my siblings.", "\"Move in with us\" How delusional are you? She has BEEN living there, you are literally kicking her out. And to your other question \"Would you say no to free house?\" Hell no, but I also wouldn't make my younger sibling homeless. You aren't going to age gracefully with all this hate in your heart- you will rot.", "You're 36 and can't afford your own home, why are you expecting her to be able to at 22? You're just cruel honestly.", "You can buy your own house like a big girl.  Spoiled brat", "Do you mean \"she isn't going to move in with us\" or she isn't allowed to continue staying in the home she's already living in? \n\nHow do your parents feel about this?", "Lol you’re saying someone is a big girl and can figure it out.. while you’re being GIVEN a house? You are out of touch and a total AH", "Aren't you much older? Why do you get the house when it could help her a lot more? Do you and your husband not have enough money to live on your own?", "That doesn't really answer the question. To stay in? Or is the deed and ownership being transferred legally to you? And if ownership is being transferred legally, why did your parents pick you to give it to over your sister or joint ownership between the two of you?", "Than YTA and your parents. It doesn’t matter that you’re the eldest. It’s really shit of your parents to gift you their assets like their house but not give something of equal value to your sister. You’re TA for going along with it and your view that it’s perfectly okay to displace your sister from her home that you’re not even buying.", "Please for the love of god do not have children. We have enough greedy hateful cruel people in the world without you raising more of them.", "Thanks for the quick reply. Then, yeah, YTA. Ultimately your parents are the real AHs, who should have offered you and your sister the choice of living there jointly, or selling and splitting the money. Nevertheless, you accepted the fruit of the poisonous tree, so…", "That’s not how inheritances are suppose to work. Assets being divided have nothing to do with age. It’s supposed to be equal. You were GIVEN a house. The house that your sister lives in. Now you are kicking her out of your free house when she was given nothing. A whole family of assholes.", "It doesn't work that way. You are not given the house in normal terms, but it is given in property to all the children equally. Some childrens may get more shares, but unless it is an inheritance of a parent you don't share with your sister, you would never get it completely legally without compensation for your sister of the percentage contemplated by law for the children of the marriage. So your sister is being kicked out, robbed for all purposes and you are very happy because it benefits you. And you still think you are not the asshole in this situation? And your parents sucks and they should never being forgiven for this.", "Why being the oldest matters in the slightest?\n\nYou are a huge AH. Your husband too. Your parents too.\n\nYour poor sister", "YTA. Your sister grew up in the house too. Let me guess, you are the golden child in the family.", "Is your sister being given something of equal value?", "It’s her parents house, not the in laws", "then god that is disgusting levels of assholery. Like not an asshole in this situation but in life, how can you possibly be so entitled, what is wrong with you levels", "Imagine just being fucking given a house.  Holy shit some people are born with a silver spoon", "\"Let's remove this person from her home so we can live comfortably... she can rent! She can move!\"\n\nYes, but also... huge AH move to kick someone out without ANY prospects or chances. (Moving states away, with no support system outside family is NOT a good prospect on the face of it.) OP says her sister has bipolar. It doesn't matter. Finding housing as someone with mental illness is already a struggle; she's essentially condemning her sister.\n\nDon't kick people out of their homes, especially if you're just being handed their home cause you're the bigger and better sibling.", "And OP is making a choice to accept a blatantly unfair gift at the expense of her disabled sister. We can judge her an asshole for that choice.", "Parents and sister are TA then. Unless parents are doing something similar for the younger sister. Is it more than just bi polar where they're setting up a trust for her? Would change things, but with the info they're TA", "Makes you sound worse then", "Yep, you are defo the AH here then", "Keep digging, tell us how it goes.", "This isn't going the way you hoped it would, is it? I feel bad for your sister.", "Did you stomp you feet when you said that? Bc I envisioned a toddler having a temper tantrum when I read that. \n\nYou and your parents are horrible.", "Does everyone want her homeless?  Does everyone hate her bc she’s disabled?", "Then you and your parents are all assholes.", "Promises mean Jack shit. The name on the deed is what’s important and if it’s not very clear on the will she will automatically become part owner. No deed transfer equals no property and also until you see the final will you can’t assume you inherit everything because she can contest it very easily. And with your attitude probably will contest it", "YTA", "Promises are broken every day", "I can’t say the things you deserve to hear without being kicked off this sub. So I’ll just leave it at YOU ARE AN AWFUL PERSON!", "So not only are you an AH you're entitled as well.\n\nI hope it isn't too late for your parents rescind the offer and give the house to your sister instead.", ">My (60f) believes I'm being cruel\n\nOther than to keep living there...", "You seriously wrote that and don't see any issue with it?", "Ok my earlier response was wrong. There’s not a whiff of asshole to you, there’s a stench. Even your parent thinks you’re awful for doing this.", "And that sounds fair to you?\n\nBig YTA", "The fact that the house was promised to you may entitle you to it, technically, but do not doubt in the slightest that you are, indeed, an AH. Way to be a big sister.", "Wait…why do you get a house and she gets nothing?  That screams massive golden child entitlement, leaving the “mentally ill” child in the dirt.  YTA at this point because you don’t seem to care that you are leaving your sister homeless.", "She can move to Florida with her parents. I mean not everybody wants to live with someone that's bi polar problems and constant mood swings", "In Spain she would have been able to sue her sister and parents. You can't leave for free a whole property only to one child and circunvent the possible rights of another to their fair share of the property. She would have had to be compensated. The parents are giving a whole freaking house to the oldest child without any compensation and kick the youngest one in the curb. The difference in treatment is astounding.", "Roommates? Does she even have a job?", "Her parents sound like assholes too.", "She can live in that, then /s", "In the US you can disown whoever you want. If you have 5 kids and 5 million dollars left when you die it can all go to one kid. If they're in the US it's legal, but they are TA", "How do you think homelessness will help with her mental health?? You’re so selfish", "Have you been “tested” for lack of basic compassion?", "Has anyone considered she might be misdiagnosed. A lot of girls and women are given incorrect diagnoses when they may be autistic or adhd or both. Sounds like your parents have failed to help her, and now you’re throwing her out without giving her any time to situate herself. I do understand how draining it can be to be around behaviors, but you’re just being cold.", "They should have tested you for being the devil incarnate asshole", "OMG, you are awful. Truly. Every comment makes you worse.", "This comment alone makes you the AH.", "God, your poor sister...I hope that at least she go NC with you and, if she can, depending again on the country, to sue the lot of you. Your parents and you are truly awful people! No wonder OP doesn't see anything wrong with anything, she has been raised as a golden child by parents so horrible that they think that put a stunt like this is a good ide.a.", "You can just get another house or something. YTA", "What a despicable comment.", "[removed]", "So... hear me out. You're choosing to force her out of the home she grew up in so you can be comfortable living in her space, just because she has a treatable mental illness???\n\nAbsolute menace.", "Um yes, bipolar absolutely is a disability.", "No OP was given the house so that means OP will be paying taxes and whatever else the house needs.", "From my knowledge she didn't receive anything.", "They are in the US so that's not relevant. \n\nBut if her parents were to pass away tomorrow and their will said \"house goes to OP, not sister\" the sister would have legal grounds. If the sister isn't written into the will, but they have stated that OP Gets the house in the event that they die, the sister does not get any part of it unless OP wants to be nice. \n\nShe can try to contest it, but if the will explicitly states that \"OP is given the house in the event that we die\" then no judge is going to say \"you have to split the house\" or anything of that nature.", "You're 40 years old and you're genuinely considering ruining your sister's life.\n\nStop talking about responsibility.", "OP is 36, husband is 31", "Sounds like everyone would be happier if she died in some ditch and didn’t burden them with her existence. Sheesh she may bipolar but everyone else sounds like a sociopath", "No grace period.", "I think it's because im the oldest and have responsibility, she doesn't.", "You’re spouting a lot of legal theories that vary wildly by jurisdiction. There are lots of places where parents can blatantly favor one child and cut out the other one, as OP’s parents are apparently doing here.", "Not that I know of, perhaps a car hopefully?", "Ah, the MIL comment threw me.  Thank you for clarifying.  Still waiting to know if they bought out her folks though.", "They’re inheriting a house. They don’t want to live with their sister whose mental illness makes it difficult or unpleasant to live with her. Sister has been invited to move WITH the parents, she just doesn’t want to. She’s not being condemned, she’s an adult that needs to make a decision whether to move with her parents or find a place to rent nearby, and she has to live with the consequences of the choice - she’s a grown ass adult, this is how that works.", "Reminds me of Kendall Roy's \"I'm the eldest boy!\"", "Bipolar doesn’t mean disabled. Though if her illness is severe enough to be disabling, putting her out on the street is even more cruel.", "It is mine, I've known that for years.", "The parents are moving to Florida to get away from her.", "No offense but this is clearly ablelism. Bipolar can be controlled with a variety of meds and therapy.", "That the thing in the US. As the owner of any of your properties or assets that you work hard for and paid for. You have the right to give as you pleases. Just because you are someone child does not gives you the ditto a parent belongings. Especially if you’re an adult.", "Question: in Spain, would the parents gifting the house while they're still alive be worthy of a lawsuit? I would imagine the parents own the house and can sell or give it away at their discretion. That is, unless your laws state the children own anything their parents own.", "Is for the parents to give— my dad gave a house to my only brother (last child)— we were 4 sisters— no one complained—my dad and mom gave some money to my 3 sisters for a down payment on their houses. All this happened in El Salvador— is not as much as in the US— I got nothing because I moved here to the US.", "OP says in another comment the sister has a full time job, so \"she can pay herself a place to stay\". As she was earning herself her dream house with hard work, lol.", "They are so much the assholes...I see some posts or messages with a lot of \"missing, missing reasons\" in their future, to be honest.", "Test for the “sociopath” test 😂. All of this is so…ick", "Lmao op is something else", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I will be paying bills and taxes", "Yes, I’m aware. Paying taxes is still quite a bit different than actually paying for a house. It’s just a little hypocritical that OP is acting like her sister is such a freeloader when she’s literally being given a house. I think it’s wildly unfair that she gets a house while sister gets (maybe someday) a car, but that’s their family business. OP could certainly allow her sister some time to find her own place. We also don’t know if sister is willing to pay rent or not, so she might not actually be looking for a feee ride.", "She’s still getting a house for free. What a stupid take.", "You mind me asking why? Are they estranged?", "So you know she didn’t receive anything and are still ok with kicking her out of the house she also grew up in? Be a big girl and a good older sister ffs", "But the sister might have something of equal value (they are moving, so I suppose they have another house) or if that is a promise given only by word (very usual in families) the will might not reflect that in the written will (or they might not ever have an updated one). As they are not dead and their assets can be shared, or disposed of, and the parents are only gifting something one daughter while enjoying the rest, the youngest sister is being economically harmed now, without knowing what will happen in the future. In fact, given that the house is not going to be theirs when they die, if they were to share their current assets between their kids in the future, OP can be twice favoured, by being given the house, and then the same part of the rest of the inheritance (or even more, given how the parents are behaving) when they die. \n\nThey are the assholes anyway. You don't give a whole house to one of the children for free, giving her thousands and thousands of dollars, and kicking the other one out (I am thinking potential tenant rights, as OP says her sister works and I she didn't say if she contributed to the household), especially being this young in this economy. The unfairness and difference of treatment is outstanding.", "If you don't mind me asking, but why? It sounds as if you are literally moving in and asking her to vacate the same day.", "YTA. Selfish, heartless, dick of an ah.", "Hopefully someone clues her in that you’re subjecting her to an illegal eviction. Depending on the jurisdiction, she could probably get a year or two of living in the house for free before you eventually relent and give her cash-for-keys.", "You sound like you don’t care for your sister at all.  It takes time to find a place to live and save up for deposits and such, but giving her a grace period is too much?  Don’t ever have children—you are cruel.", "> have responsibility\n\nSo much responsibility you bought your own home.... oh wait...", "That’s ugly. You’re getting a whole house for free that has sentimental value TO YOU..YTA.", "You don't \"have responsibility\". You and your parents are AH.", "And your solution is to make her homeless?", "This is you being hugely favored. You are being gifted a whole freaking house in this economy without paying one cent while kicking your sister, ten years your junior, into the curb. This is not about responsabilities, is about them favouring you.", "That bull and you know it. What responsibility do you have that she doesn’t?", "I hope y’all take this feedback to heart lol", "What responsibility do you have, though? Responsibility to take care of your younger siblings? Like...letting her have a home?", "That's why I said depending on the country and put the example of Spain, where I live and work. As it depends of the jurisdiction, the sister might have a case, or not. This doesn't change the fact that the parents are a huge asshole for giving a property of thousands of dollars to one child for free, while leaving another one with nothing. The asshole veredict doesn't have anything to do with legalities, but OP have defended herself saying that it would have been hers anyone as the oldest, which depending, again, on the country and jurisdiction, might not have been true. But the fact that the parents are gifting one daughter over the other that much, and that her eldest sister (by many, many years) sees no problem with it because it benefit her makes them the assholes anyway.", "I didn’t really have a judgement at the end of the original post. I was leaning toward YTA but I had questions\n\n\nComments like this answer all of my questions\n\nYTA, with out a doubt", "A car isn’t the equal value of a house..", "Well, she’ll be fine, she can just live in the car that she may or may not get. /s", "Then you're a massive AH! You're getting your DREAM HOME and at best she has a car?\n\n\nYou can house her; she's losing her fucking home so you can take it.\n\nEvil.", "According to a comment OP made, she was getting the house due to her being the oldest but sis might get a car or something but no house.", "OP said in the comments that sis offered to move out after a short grace period so she can get a better job/find a place to live, and OP won't give her that grace. OP is an asshole.", "And OP says she works full time, so she is not jobless. But of course, OP is being gifted a full house without having to move a finger to obtain it or work for it or anything, but the 22 years old have to make her own way while her sister is gifted by their common parents thousands of dollars for, again, nothing at all, in this economy, knowing that even working full time she will never be able to afford that house gifted to her sister unfairly. And then OP will be here in a couple of years asking \"Am I the asshole for not wanting to take care of my elderly parents, who live in another state, because my sister does nothing for them?\".", "They are not inheriting the house. They are being giving a house, which in legal terms can be seen as cheating the youngest sister out of possible inheritance depending on the country to the benefit of the eldest. In places like Spain that would be completely illegal. OP is 31, she can pay for her own house without her parents showing a favoritism so blatant that there are hundred of thousands of dollars between the treatment of the two of them, especially with OP being ten years younger than OP.", "Well it can be a disability as it can be difficult to medically manage.  The op said she has episodes so clearly not well managed and will be a barrier (esp at 22) to just be on your own. Typical college grad is 22, so shes supposed to support herself right out of college with mental disability?  This family sounds weird, maybe trying to force her into moving to Florida", "Who thinks you're being cruel?", "Answer clearly and plainly. Is the deed on your name currently? Is the final will and testament written and signed ? If the answer isn’t yes to either of those then promises legally mean zero and she will have the legal right to half the house upon their death. And even if the will names you many states will allow her to contest the will and the judge will decide since it can be considered unfair treatment, so even then without the deed you have NOTHING and she has just as much right to be there. Want the house, have you parents transfer the deeds and pay the IRS their due for said transfer. Promises in the court of law mean zero", "But the person needs to stay on their treatment plan, and many don't.", "Ableism would be coddling the sister more than the patents already have and enabling her to not be responsible for herself. Helping someone to remain dependent isn't helpful\n\nGolden Child???? How about the daughter living off the parents and still at home, getting an offer for same ride in Florida with them acting like the real Golden child.\n\nShe's an adult, new owners are moving in---time to go and time to grow (up).", "Of course it can be but one of the traits of BPD & BPD2 is that there can be an issue with med compliance. \n\nAssuming OP is telling the truth, the sister might not be med compliant. So while I do think OP is TA, I don’t know that the comment you got salty over is “ableism”.", "Then, Op doesn't have any right either because she is the oldest for something she has not earned. It can be legal, but still will make all of them huge assholes.", "Yes. If they sell it, it is their property to do as they wish and that would be no problem. Even if the house had been sold to OP for a fair price, it would have not been an issue, as it is their property. But in Spain all the children have rights to a specific part of the inheritance of their parents, even if there is no will, even if the relationship is no good. It is called \"la legítima\". In properties, all the children have to be given that part of the inherited property, or something of equal value of their parents' assets, even if one of the children is given a higher share of said property. In this case, if this was in Spain, at least a 33% of the house would have gone to the sister in the even of the parents's death (1/3 of the parent's property). As many parents would try to circumvent this norm by gifting properties to one child while they were alive, as the law was only enforced after their death, gifting a whole house without compensation would have been seen as a suspicious movement by the parents, called \"alzamiento de bienes\", that harmed the future gain of OP's sister, so she will have grounds for a lawsuit, as they can be seen as cheating the law to favour one child over the other. Legally, all the red alerts will sound like crazy in the same moment they see a person trying to gift one of the children their property in full having other kids. \n\nIn Spain it is very difficult to disown a child and there are very solid laws to avoid things like Op describes here, also to protect descendants from being harmed by acts like this or to avoid the properties as a way to presure the children into doing the parent's bidding. But in compensation we also have laws that force the descendants to take care of the parents if they are in a situation of need, so all the parts are protected. But it is really difficult to cheat this inheritance laws here. In fact, even if you renounce to your part of your parents' inheritance before their death, you have to follow a recognized legal process. For example, my dad used to tell me the story of his grandparents by his mother's side. They were a ton of brothers and sisters, and some brothers didn't want to take care of their parents in their old age. They promised they will forfeit their part of the inheritance if the other brothers/sisters took care of their common parents in their place. They agreed, but they didn't do the process correctly, so when my great-grandparents' died, they were able to claim their part of the inheritance, despite everything.", "I know that's what I was saying.", "Because she pretty clearly hates her sister.", "What do you want to bet OP is one of those women who thinks because she has a husband, that she's entitled to her parents' home?", "22 and disabled.  Good luck!", "14 years. OP is 36. She's acting like she's 16.", "In my country I would sue their ass to the heaven and back and I would win. There would not be jail for them, but the would have to pay me a good deal or give me an equal share of the house as my sister, as well as to compensate me for the problems they occasioned.", "Once more, I thank you for the concise update.  Much easier to read than OP's sickening comments.\n\nComplete and total YTA judgement.\n\nEvicting a family member with a disability, who while employed does not make very much, by OP's own admission, is the height of entitled dickheadedness.", "I should have said isn’t *necessarily* a disability. It can be tough to manage for sure, but the way OP seems to be using the diagnosis to demonize her sister is obnoxious. She doesn’t give any details about her sister’s “moods”, so I am skeptical", "my mother", "A signed will is no guarantee. People change their wills all the time", "The deed is in my name. The will is signed", "That is a common part of the disease itself not the random whims of non-compliant patients.", "New owners moving into the house? I missed the part where OP mentions she and her husband purchased their “dream home” from the parents. Unless OP is buying the home for market value, this is pure BS.\n\nHoping this is some Chat GPT rage bait, it worked, I really can’t stand OP’s smugness combined with her utter lack of empathy for the younger sister.\n\nHow about this: freeloading OP and her husband should pay rent on their “dream house”, at least enough so little sis can get a baller apartment in their hometown?", "What has OP done to demonstrate she deserves this \"dream home\" other than being \"the oldest\"?", "Fascinating! Thank you so much for this information.", "Also, there is another variable here. Here there is a legal duty to care for your parents if something happens, and that can go against all the children equally. So if you give something that expensive to one child while you are alive, and afterwards you need extra medical care or something, and you don't have enough money to pay for it, you can legally force your children to take care of you (economically, of course) and that potential lawsuit would go to all the children, not only to the one economically benefitted by the parents. So that protection also serves for this, to assure that if the parents want to sell a property, they have to sell it, not gift it to their favorite child for nothing, because the future responsabilities are also shared if something goes wrong with the parent's health in the future.", "Anyone think she implied we won't bring the grandkids to visit you unless you give us this house?", "Well hopefully she'll change her mind and not give you the house if she thinks your being cruel to your sister or give it to you on the condition that you let your sister stay.\n\nEdit: Is the ink even dry on the transfer of deed.", "Your mother is correct. You should listen to her.", "Hopefully your mother will come to her senses and not give you the house.", "You are contradicting yourself. If the deed is in your name the property cannot appear on the will because it doesn’t belong to them. You are either a troll or lying. This contradiction is too stupid if you actually did the paper work", "Even if they bought the house the money wouldn’t go to the sister lmao, she doesn’t own shares in their parents assets.", "What has the daughter living off her parents demonstrated? Other than codependency & entitlement to stay in a house her parents are no longer living in?", "Or \"your grandkids will be homeless!\"", "My mother will say things and then not really do anything about it.", "Then she can handle my sister.", "A deed can have multiple names on it.  Could be that OP’s name is on the deed along with her parents, but the will leaves OP parent’s share in the house upon their death.", "She's 22. She might not even have graduated college yet. She's allowed more grace than someone pushing 40 with a husband.\n\nAre you OP logging in with a different account?", "Wow. You seem like a peach.", "Yup, YTA.  Huge.", "Then you can buy your own house with your own money.", "Gargantuan, grotesquely huge, asshole. YTA YTA YTA. How utterly obnoxious.", "Wowwwwww. YTA for the comments about Bipolar Disorder AND for kicking your sister out of her childhood home because of it. That’s it. That’s your whole reason. What a piece of work.", "She has, for years. She knows what she is asking. Maybe your parents will reconsider their distribution of their assets and decide there are better things they could go with their house, like give it to your sister, put it up for sale, or donate it to a charity.", "Your sister should get the house. Then she can handle herself.\n\nYou deserve nothing.", "Your paranoia is telling.", "My \"paranoia is telling?\" LOL. Have fun with the dream house, OP", "If she already lives there with your parents, then it isn't whether or not she's \"moving in\" with you. That's her current home. The question is whether she moves out once you move in, and how long she has to do so if so.\n\nI find it a bit ridiculous that you're willing to kick your own sister on the street to create a \"loving home\" for kids that haven't even been conceived yet. Maybe work on addressing the real world issues in front of you before setting up your pie in the sky dream home for future kids, you'll be a better parent for it when that time comes.\n\nYTA", "INFO: when you were 22, could you afford $1500 rent + utilities (without any help)?", "YTA and so are your parents.\n\nYou are given the house, which probably is the major part of your parents' assets. This means when they die one day and the inheritance is split, your sister will get way less than half the current value. The parents are basically disinheriting the sister.\n\nThe morally correct thing to do here would be for the parents to sell the house to OP at half market price, and gift that money to OP.s sister. That would give the sister a chance to get her own place to live, without having to live with OP (which sounds like a bad solution, and just inviting problems into the family).", "EDIT: I read through some of your comments. My gosh you're absolutely cruel and heartless. So are your parents. YTA all the way and I pray for your heart to be softened one day. Geeze.\n\n\nI understand the want to just live with your husband and no one else. NTA for that and NTA for not wanting to deal with her disorder.\n\nBUT..... Are you and your parents doing anything to help her out?? You're leaving your sister without a place to stay. Are you giving her money? Starter cash to find a new place? Time for her to get herself settled and find somewhere new?\n\nYou mention that this is your dream house and that you grew up in it. You're not the only person who grew up in that house. Your sister did too. She was still living there and you're just tossing her aside. You and your parents have handled this horribly and as your sister I'd resent you and your parents 100%. Does she even matter to you?\n\nYTA for how this whole thing is being handled.", "YTA and so are you parents. It is super unfair to give one child a house and not give a Damm about the other child. You seem to think that because you are married and \"about to start a family\", your life and your happiness somehow matters more than hers. She cannot help that she was born later than you! And the fact that you are older,  MORE stable, and presumably do not have bipolar disorder (given the condescending way you spoke about it) means you have MORE tools to \"figure it out\". Funny how you expect her to \"be an adult and figure it out\" when you are being GIVEN a house. You did not figure anything out but how to (somehow) convince yourself that you are more entitled to that house than your sister is. You sound like an incredibly selfish human being, so good luck creating that loving, perfect home for your (not yet existing) children. I hope you end up being a better mother than you are a sister. Your parents suck, too. If I were your sister, I would never be able to forgive you or them for this. YTA 100%.", "YTA and if I were your parents I’d pull out of giving yall this incredibly generous gift. \n\nHow tragic of you to have to share your FREE HOUSE with your parents other child. \n\nWOW you’re a jerk.", "“This house holds a lot of sentimental value for me.” Then you should also understand your sister’s feelings.", "YTA. Also, don’t have kids. I can only imagine the hell you’d put them through if they had a mental illness like your sister", "You know where I lived when I was 36? In my own god damned home that me and my wife bought ourselves with our own money. YTA here, plain and simple. You know what I want from my parents when they pass on? Nothing, not a damn thing. I don’t need it, I worked hard to have my own house, my own things all on my own. I’m only a couple years older than you are now, I find it pathetic that you have to be gifted a house, your “dream home” while at the same time kicking your SISTER to the curb. Grow up. She lives there, you don’t.", "Yta - I hope she refuses, forcing you to evict her. That buys her half a year or longer. During that time maybe she will introduce a slutty friend to your husband.", "Your parents have set you up to be the ah. They gave you a gift worth significantly more with the idea that you’d let her live with you.  She has no where to go and likely lacks the skills to be fully independent.  everyone but your sister sucks here but for judgement purposes YTA sorry", "YTA. I understand wanting space for you and your husband to start a family. But just kicking your younger sister out of a home you were gifted by your parents is extreme. Besides the fact that this is ALSO HER childhood home, you could at least try to work with her to find a solution. Maybe set up a time line for her to move out and help her get to that point. Especially if she struggles with mental health, stability is crucial in managing it. Set boundaries with her while she’s living there, and work with her to find a solution to eventually move out.", "YTA; you owe your sister half the value of the home in cash. The fact you managed to weasel and manipulate your parents into giving you half your sisters inheritance is disgusting. Then you have the fking audacity to kick her out of the only home she’s ever known. You belong in r/choosingbeggars.", "Okay, YTA for all the reasons people mentioned, and also for the ableism. \"Crazy mood swings\"? As a bipolar person, when you're properly medicated and in therapy, those are not exactly a common occurrence unless something drastic happens (like, say, being kicked out of your childhood home by your own sister). If your husband can't deal with a bipolar adult, children will be the most impossible challenge of his life, and I pity any kids the two of you might have for having not one, but two terrible parents.", "Oh yeah, YTA. You’re throwing your sister out of her home too and don’t seem to give a flying fuck about it. This is the epitome of “I got mine, fuck you”\n\nDont want to be an a-hole here? Sell the house and split the proceeds with your sister and then go your separate ways because that’s what it seems you want.", "YTA. Your parents too because of the differential treatment between their children.", "YTA and so are your parents. It’s just wild that you all can be so callous. I get that dealing with someone with BPD is a lot, but that doesn’t explain your parents gifting you a whole house and leaving your sister with nothing AND no place to live. At the very least you should pay for her move, security deposit and several months (or a years) rent for her to get settled and have some time to adjust. For the love of god please do not procreate, the world doesn’t need anymore self righteous, entitled jerks.", "Hope your sister is on Reddit and sees this bc YTA. I would take a bullet for my siblings and if they needed somewhere to stay I would give them my bed and sleep on my couch… this is why family falls apart. If I was given my parents home it would also be my siblings home. Love means making sacrifices…. If you’re wanting to start a family and plan on having multiple children I recommend instilling those values in them. I moved home from another country bc my sister was having a baby and I wanted to be a part of my Nieces life. YTA YTA YTA", "Yta. I was with you until you said you were being GIVEN the house, not buying it. Sounds like you are the golden child.", "YTA- let’s say you get pregnant tomorrow which at your age not impossible yet also not likely, you would still have 9 months. Give her a set time period to get herself settled. Say 6 months/a year. It’s impossibly cruel to leave your own sister without somewhere to stay in her hometown.", "YTA- it’s not that you’re “Not letting your sister move in with you” it’s that you are actually kicking her out of her home. I think it’s an absolute bullshit move, but that’s you and your parents decision.", "YTA. The narcissistic entitlement is off the charts. Being “the oldest” does not give you more rights than your sister. She is as much entitled to the house as you are. *Especially* since she is disabled and not making a lot of money and you’re the golden child with a working spouse.", "YTA. Your parents are effectively bequeathing the entire house to you before they pass, even though they have a second daughter. Legally fine but an asshole move. You’re enabling this asshole move by booting your younger and more established sister from her home and reaping the entire benefit of receiving the house. The non-asshole move would have been some sort of arrangement where you “bought” your sister out of a fictional share of the house so that she had a firm financial footing to live on her own. If that wouldn’t be possible financially, her staying in the house sounds next-best.", "I can't even grasp your level of selfishness. I sincerely hope that you are planning to help out your sister financially since you are getting a home free and clear. She has a disability. Hope if you are having children they are perfect and you can tolerate them. \n\nYTA", "YTA \n\nMy little brother is roughly the same age as your sister and I’m around your age myself… I could never ever throw my baby brother out of a home I was moving into. If anything, I’d want him to live with us forever. You are truly a selfish and entitled person to think what you’re doing is in any way acceptable. It is not. You’re being cruel, and your parents are just as much at fault as well.\n\nI hope your sister outshines you in everything and is way more successful in life. She deserves a better family.", "YTA for kicking her out of the family home as if it somehow belongs to you more than it belongs to her.\n\nIf you were buying the home from your parents, it might be different. But no, it’s a gift.", "YTA based on what we know… and you’ve said your Mom thinks you’re an asshole. She’s likely pretty familiar with the dynamics here. \n\nAnd when you say your little sis is “old enough to figure it out herself”, but in the same breath say “this is the first time my husband and I will be living in our dream home” and “we’ve been planning this for years”. \n\nYou’ve been “planning” on a handout from your parents for “years”. Entitled.\n\nI hope your parents back out of the deal they have with you and either give it to your sister or sell it. I’m picturing an Angelica Pickles level tantrum if that happens.", "Please do not refer to anyone (let alone a \"loved\" family member) as crazy or having \"crazy mood swings\" when they have mental health issues. The word \"crazy\" when used it anything connected to mental health is stigmatizing, unhelpful and perjorative. Honestly, that right there tells me a lot about how you view your sister. \n\nYTA here, and your parents are also TA. The house should belong equally to BOTH their children and you should either have equal rights to make use of it or it needs to be sold with your parents keeping the money and passing it down when they move on. What on earth they were thinking here, I don't know. But you - who have been given a HUGE gift then look down on your sister as \"she's 22, she should be able to find some where herself\" - when you who are so much older aren't even doing that. So many 22 year olds are struggling with housing now because it's so expensive - and she's got mental health issues that are extreme enough that your darling hubby can't deal? But fuck her, right? Cause you're getting what you want. YTA, and your parents suck as well. I hope you get termites and bedbugs.", "If this ain’t rage bait….\n\n\nYou are a BAD person. Like deep down on the inside, bad. Selfish. Cruel. Truly awful. Do not have children, for the love of god. Let your selfishness and cruelty die with you, don’t pass it on to another generation of hateful brats. \n\nYour sister has a mental illness and requires support and compassion to thrive. You’re literally pushing her to her next manic episode, or into a deep depression. You’re putting her on the streets, out of HER childhood home. All so you can play happy homes with your chump husband. \n\nSeriously, in what conceivable universe would you not be TA? \n\nEnjoy the karma coz it’ll be all you’re left with one day. \n\nYTA.", "YTA. Your parents should have sold the home and split the money 50/ 50. Who cares if this is your \"dream home\", how entitled are you to think, that matters more than making your young, mentally unwell sister homeless? At the minimum, your parents' house should be properly valued and you should have to buy your sisters half out from her.\n\nYou have said she's old enough to figure it out yet you and your husband are in your 30's and haven't figured yourselves out yet clearly as you are relying on Mummy and Daddy to give you a whole house.\n\nI hope she gets legal advice and sues you and your parents and that it drains your funds so much that you don't even get half of your dream house by the end of all the legal fees.", "You’re being GIFTED the house and you’re kicking your sister out and saying that someone 14yrs younger than you should be able to ‘figure it out’ when you couldn’t find your own home?! YTA massively.", "Honestly...yeah, YTA. Not just for kicking out your sister, but also for the smug and entitled tone of that entire post and your total lack of interest in her welfare. You talk at length about your dream home, your dream little family, your this and that...with zero thought for what your sister might have been wanting and dreaming of all this while. You say that she can figure it out for herself - but OP, your dream house was a gift, no? It doesn't sound like you and husband \"figured it out\"?\n\nThe edit gives me slightly more pause. Yes, it's tough having a sibling and roommate with serious mental health issues. But that doesn't excuse you and your parents for abandoning her right as she graduates: if anything, it makes the situation worse. Without an enormous amount of truly transformative context, YTA in this situation, but so are your parents. Not just for denying your sister a place to live, for but for being so cavalier and unconcerned for a vulnerable young woman's welfare. The original sin is your parents', for SURE (they should be concerned about their youngest child's wellbeing, and requiring her to move to a whole another state ain't it) but it doesn't sound like ANYONE in the family is showing much concern for the sister.", "YTA, your golden child entitlement is stinking up this whole page.", "YTA", "YTA", "Question: are you buying the house from your parents? Or just moving in while they move out? I\n\nf you’re purchasing it outright,  and hubby and you are sole owners, it’s up to you. \n\nIf you’re freeloading in mom and dad’s house, then the least you could do is let your sister stay there too. Honestly, if they own it you don’t really have a say. \n\nI’m going to hold judgement here, but it’s a solid one way or the other based on the result of the first question.", "Your dream home is the house you grew up in? Yikes. Of course your sister would try to continue living in the home you both  were raised in. I bet your parents thought you would be taking over your sisters care. NTA. You likely wouldn’t be dealing with this if you had moved to a home elsewhere.", "Shame on your parents for gifting you the house.  I assume they expected to pass the other daughter on to you to “take care of”.", "Why do you get the house? Why is it not split equally between you and your siblings? I can't imagine doing that to my siblings, and I'm not on great terms with 2 of them.  Still wouldn't fuck them over this way.\n\nYou seem kinda heartless. Please don't have your own children if you're just going to throw them away due to poor mental health. \n\nWith your current mindset, their mental health will surely suffer. \n\nYTA and your parents are poor examples of fair and decent parenting.", "Yep.", "YTA", "I would say if you bought the house at fair market price from parents then yes no sister. You are getting a free house your sister should have rights to half of it.", "Super YTA.", "YTA really your parents should be giving it to both of you. Why aren’t they that seems awfully unfair.", "It’s * My husband and I, not I and my husband.  And you and your parents are definitely the a—holes!", "I was completely on OP’s side until I read the edit about them being given a freaking house. If they’d bought it, even at a discount, it would be different. But you’re getting a free damn house, she can stay. YTA, and honestly, how do you not see it?", "YTA, and a spoilt one at that. Do you know what can cause a manic episode, instability in one's space. Like her sister kicking her out. Also bipolar disorder is very much a disability even if you don't like it. It sounds like you don't like your sister very much all over something completely out of her control...", "YTA. She’s 22 ffs.", "Your parents didn’t handle this well.  Why do yuh get a house and she gets nothing while having no place to live? But also, she should go with them if she doesn’t have a place to live.  Your parents are essentially dropping the responsibility on you.  You’re NTA for not wanting her to live with you.  But your parents did a piss poor job at making this arrangement", "YTA unless you are purchasing the house. Your sister already lives there so I would have assumed she comes with the house.", "\"Mommy and daddy are giving me a house because I couldn't just figure it out at my age but my 22 year old sister probably can.\" \n\nYta for that alone. That whole attitude is so gross. You obviously look down on your sister and your commentary about BPD tells me everything I need to know about you. \n\nYou had 16 years to kick your feet around waiting to be handed something valuable but your 22 year old sister should just figure it out and be an adult. I truly hope none of your kids have any mental disorders because yikes on bikes they deserve to be loved and it's clear you don't have the empathy or compassion for that. \n\nI hope your sister finds happiness and grace in life.", "Yta...you're literally making her homeless. A home she currently stays in and you currently don't", "Yta. You have a 5% chance every month of getting pregnant at 36. You live in your parents home and are depriving your sister the ability to live in the house she has been living in? Yta Yta Yta. As well as your parents. They clearly have a favorite child", "YTA - you’re being given the house. You did nothing to earn it.", "I don’t think you’re wrong for wanting to live on your own, but unless some other compensation is available to your sister, it’s massively unfair for your parents to give you a huge financial asset and not make things equal in some way for her.   And no, offering to let her live with them isn’t it.", "YTA. And who cares if your “hubby” thinks your sister should move out, he is being given a free house by your sister’s parents. How entitled you both are.", " The people have spoken, the motion has passed. YTA the massive ablist, selfish, entitled AH", "Your sister already lives in that house that you're moving into. She's not the one coming to live with you. You're taking away her home by kicking her out. That makes you YTA here.", "YTA, you're throwing her out on the street because she has a disability.", "YTA! Every single comment just makes you sound worse. This is a very clear example of you being the golden child.  I feel sad for your sister. Here you're given a house, and she's being left homeless. You aren't even giving her a grace period. You might claim you love your sister, but someone who loved their sister wouldn't do what you're doing. It would be unimaginable.", "so you’re 36 and couldn’t afford a house without mommy giving it to you but your 22 year old sister is old enough to find her own housing? YTA you and your parents are the worst people imaginable. please don’t have kids.", "I say NTA yeah it sucks for your sister but she’s fully grown and should be more than capable Of figuring it out or she can go with your parents. It sounds like you have a lot of trauma from dealing with your sisters BPD and I too wouldn’t want that in my home after dealing with it for years. I’d say at least give her 6 months to figure out where she’s gonna go/do but other than that what was she gonna do if mom & dad decided to sell the house instead? As a 22 year old myself she really shouldn’t have refused to go with mom and dad without talking to you first seems like she burned all her bridges. I’m not sure where you guys are located but I currently make 17.50 an hour and rent a 4 bedroom house in a nice area so it’s definitely possible", "YTA - Don't start that family. You have absolutely no concept of family love.", "YTA - You and your parents are total aholes for disinheriting your sister. Why can't your parents split the value of the house between you two? Why do you not see how unfair it is that you are being given a house and your sister is being thrown out on the streets?", "YTA you’re 36 and being gifted a whole ass house and telling your 22 yo sis to just figure it out? The fuck? Who gives someone a house?", "YTA  if I were your parents I’d give her the house after all you and your husband are full adults why haven’t you figured out to buy your own house.", "You are a massive asshole. You are an entitled, selfish, cruel, gigantic mother fucking asshole.", "You are 100% TAH no doubt about it. \n\nThe bipolar thing is thing. I wouldn’t want her to move in because then she has tenant rights so that is a no go. Since you now have a house and no mortgage, the fair thing to do is take out a mortgage for about half of the value of the property and put money in a trust and find someplace for sis to live. This way she has time to get a job, etc and you did your part to care for her. \nThis is what your parents should have done in the first place.", "YTA. I hate golden children. Just buzz off OP. You're 37, and still not financially competent? Not capable of buying a home? Stealing everything from your sister?\n\nYour parents are bigger AHs than you. \n\nJust buzz off all of you. \n\n\nBeing bipolar is not a reason to screw over one child.", "YTA.  Also, what 31 year old man marries a woman five years older than him?", "Even if my mom was cool with treating my bipolar little sister this way, I wouldn't let her because I don't suck. But my mom would never do something like this because she doesn't suck. \n\nYTA. You and your parents are the worst.", "You, your husband and parents are all ASSH$LES.  In honor the house belongs to you sister as much as you, possibly more because she has a disability.   \n\nYou are willing to throw out a person who is working and can not afford a home so you can have your dream home. You are being selfish and uncaring.   \n\nThen again you have been taught this by your parents.   You believe that you matter more than sister.  Your “dreams”matter more than her safety.  \n\nYou have asked if someone would turn down a house that they were given.  If it meant making my sibling homeless the answer is no.   You don’t deserve the house more your sister.  Over and over again you are proving that YTA.   Your comments illustrate selfishness and distain for others.   \n\nA solution is buying a place for your sister to live.   A place that YOU pay for.   A small condo costs less than the house you are getting.   It is a fair deal.   Housing for your sister.   \n\nAlso remember that bipolar runs in families.   Your children may have mental illness.   Be the sibling you would like your children to be to each other.   \n\nYou don’t have to be an ASSH$LE.   You can be a good person, if you choose to be.   Right now you are not choosing to be a good person.", "YTA", "YTA how the fuck do you think it's okay to displace someone from their home??? She has an equal right to it.", "YTA and the fact that it’s not blatantly obvious to you makes you an even bigger one. Try thinking about what position you’re putting your sister in, and stop saying that you love her. You don’t.", "You are fuckin selfish and a bad sibling. If you were raised right you'd take a mortgage and give half of it to your sister, subtracting the car's value. You're undeserving of it as there are 2 of you. Show that you care about your family and ACT as a Big Sister. YTA.\n\nIs this how you plan on raising your future kids? Make a difference between them? Pathetic. Where are your morals? Be careful, Karma always gets to people. Do the right fuckin thing.", "YTA. Parents are A’s too. Poor younger sister. Selfish gross OP", "YTA \"the exciting journey of starting a family\" = \"we're ready to start raw doggin\"\n\nSeems like your sister is troubled. Not saying she should live with you, but there's a lot of \"me, me, me\" here. Maybe you can find a way to help her out.", "Your parents told her to move with them... that was her ability to have a roof over her head. She refused for whatever reason/excuse. She has a place to stay in that scenario. You don't need to give her a second option. NTA. She needs to learn that just because she wants something doesn't mean she's going to get it ... and that \"unfair\" moment in life is what creates us and molds us into being hopefully self-sufficient human beings. She doesn't get to mourn this \"I don't wanna\" entitled situation. An additional option, draw up a contract that has a time-frame and rules of your willingness to give her something like 6 months or a year to find a place/room someplace else, and clear rules if those rules are violated. Sounds like she needs a grown-up wake-up call. Again, NTA cuz she has an actual housing option that has nothing to do with you and your husband.", "Sigh.\n\nIt’s Reddit, so you don’t owe anyone anything, your sister is a golddigger/trainwreck/leech…\n\nBut she is and always will be your sister. I’m so very sad for you; you have no idea what this will be in 10 or 20 years.\n\nIf your sister is bipolar, she has a disease. If she were diabetic, would you refuse her shelter? You are having one child. Perhaps in another 14 years, you will have another. I hope that she will not be ill. How would you feel, as a mother, if your one child treated the ill one this way?\n\nMe? I’d seriously question my parenting skills.\n\nYou will do what you want. It’s your right. But that does not make you right.\n\nJust because you can do something doesn’t mean you should.\n\nWishing kindness makes a private appearance to you.", "NTA, at all - I see people mostly going for YTA but please don’t let a Reddit post change your mind about this. If you want to be fair to your sister, fund her move, help her look for apartments, even help her w rent and bills for three - six months so she can get on her feet. If she’s eligible for state/fed benefits, help her apply and get to appointments for medical documentation if needed until approved. Bipolar is tough but manageable for an adult.  She needs to get out of the nest and start her own life so she can figure out how to manage her mental health diagnosis while supporting herself, just like every other adult with mental health issues.  Be supportive as you can but don’t give in.", "NTA. Sister is not out on the street, she has the option of moving to FL. I imagine that parents would gift the florida house to youngest daughter. May be dead (sorry OP) in 14 years when youngest is same age as OP, meaning each daughter for a house at 36 years old. Boom, mike drop.", "YTA you get a free house. What does she get? Your parents are AH too", "YTA \n\nSo at 22 years old she should be old enough to figure it out ? But the only reason you, at 36 years old, have it “figured out” is because you’re being given a house ?", "NTA but your parents are....why are they giving you the house and throwing your sister to the wind? I completely understand not wanting her to live with you but what is she going to do?", "YTA and I hope the house increases in value to the point you cannot afford taxes when you sell. By gifting you their house your parents have set you up for a world of hurt concerning taxes. \nAlso, dream house or not you cannot afford a family just because you’re living there free.  I can’t believe your husband bought into this whole scam.", "NTA\n\nYou're not her parent. I'm assuming that she is not providing for herself, in which case her options are move with the parents, or work it out herself.", "Your home deserves to be at peace. At 22, it is her choice to either find a place to live or move with the parents. Either way, she's an adult, and it's her problem, not yours. You aren't her caretaker. You're her sister, and you deserve to live the life you want.", "Dang what a complicated situation. Why do you get the home and not the little sister did the parents not do anything for her", "NTA - so you’re kicking your baby sister out of the house she CURRENTLY lives in so your old millennial ass can stay there for free? Buy your own shit.", "Wait, your parents are \"giving\" you the house?  What is your sister inheriting from them?  If you were buying the house I'd say NTA, but it's being gifted to you.  You and your parents are the AHs for kicking her out of the house she also grew up in and not helping her get settled into something else.  I'm assuming she just finished college and is starting out in her life as well.  I would have at the very least, given her a year to stay in the house to give her time to save money to move out., or help her with rent money (may 6 months) to get her own apartment.   Nothing is preventing you from starting your family (e.g kids).  \n\nWith respect to your sister's bipolar issues is she taking medication to treat her condition and has she been responsible and minimized any \"episodes\"?", "Parents gifted you the house so they could get away from your sister. Figured you would feel obligated to take her as part of the deal. Guess they should have just given it to little sis and let you beg for a place to stay huh? Seriously though I don’t blame you for not wanting her to stay but you’re a cold hearted harpy to see this as a fair situation.", "I don’t even know how to judge this right now. The parents are ah for clearly favoring one child over the other and giving them the house, but that said I don’t necessarily think op is an ah for accepting and wanting to be alone w their partner in the home. I completely get that. But maybe op could let little sis stay for an agreed upon amount of time w the expectation she begins looking for her own place? It does seem pretty cold to just say no, but with that said, we weren’t told if sis is on proper medication etc or how bad her mood swings are. There’s a pretty big variation between individuals. If the home legally belongs to op now she has every right to decide who lives there/doesn’t, especially if it’s an open ended stay that could cause problems. If it’s in their parents name then the sister has just as much right to live there. I don’t know that there is a judgement here on this sub where I feel like the only real ah are the parents. Op might be a little cold, but is overall likely within her rights. But if you happen to read this OP, it might be helpful for everyone to add some of those details in an update to give the full picture", "Where did you and hubby live before? Rent or are you selling a house to move in? How long have you been married?", "Personally I would t want a (22f) living with my husband and I.  Especially a bi-polar sister.  OP wants to start a family.  How can she have a pregnancy and baby when dealing with bi-polar sisters mood swings and whatever else comes with that?  Sister is NOT her responsibility.", "If your parents seriously wanted that daughter to live in that house they should’ve either given it to her or stayed there and babysat her for the rest of theirLives.\n\nThis is a her problem not a you problem. You say she has nowhere to go. That isn’t even true. She’s been offered a place in n Florida which SHE refused.\n\nNTAH", "NTA. Unpopular opinion… I don’t apologize for it… but as someone who has lived with a bipolar person and has been homeless because of it… it will be the worst mistake you would ever make. It’s ok to be the asshole sometimes 🤷🏻.  Be the asshole and keep your PEACE.", "Wow. There’s a lot of unchecked privilege from all of you here. But I’m still going with NTA, because she is a grown ass woman. I think there is zero wrong with not wanting her to live with you, but I think she deserves a bit of a buffer if she’s having trouble finding a living situation and as her older sister and you’d be kind to give her X number of months to live rent free with you to get her feet under her.", "NTA, she's 22 she can figure it out.  I'm sure your parents gave her time to figure it out. \nIt sounds like your parents even offered to take her in and probably tried to work with her to find a solution", "Nta", "NTA. Good for you for having boundaries and telling your entitled sister she can’t live with you and your spouse. Stand your ground and don’t give in. If she doesn’t want to move and continue to live with your parents she needs to find her own way. She needs to learn she can’t mooch off of family forever. Worst case she rents a room somewhere or gets a place with a roommate. She’s an adult and you’re not obligated to house her. Let her be mad at you. Tell anyone else who’s mad at you about it to let her live with them. I hope you enjoy the house just the two of you.", "Given the edits about sisters mental health, I have to go with NTA. It sounds like sis isn't taking her meds or she wouldn't have such wild mood swings.\n\nI wouldn't want to live with that either. Maybe call adult protective services, they may be able to help you find resources for your sister.", "O think everyone sucks here your parents should have figured this out before you were even offered the house you should be at least a little compromising maybe rent her a room or given her a time frame to move out by give her a few months to get on her feet or prepare to move and your sister is an ass for not getting her shit together and demanding you take care of her", "Reddit is so weird. We don’t know even a fraction of a whole story on why she’s getting the house and the other sister isn’t but the point is, if anyone’s the A H it would be the parents. People jumped to “she might still be in college” with ZERO context of that. She’s either a full grown adult who can make her own way, which I will assume OP did until now. Or she’s a person with mental illness so severe, she can’t handle her own treatment in which case- the parents need to deal with that. \n\nSince we’re making assumptions about the sister, I’m going to assume there’s a known knowledge or agreement that OP and her husband are reliable and responsible enough to help take care of the parents when they are elderly. 🤷🏼‍♀️🤷🏼‍♀️\n\nI don’t even have an opinion on this. As the oldest of 3, I couldn’t imagine our parents putting us in this position but I know if they did, there’d be a reason behind it.", "NTA your parents gave it to you and husband for a reason! You want to start a family and unless your parents told you that sister gets to live there don’t feel guilty 😞🙏🏻", "NTA. You have no obligation to house your sister (or anyone, for that matter) for an undetermined amount of time- you want your home to be your sanctuary, and you are allowed to keep it sacred, comfortable and safe.\n\nAnyone saying Y.T.A. has never had someone take advantage of their home and generosity before. I've had several of my partners \"friends\" freeload on us because we were kind and offered shelter when they needed it.\n\nYour sister can get a housemate like everyone else.", "NTA you are not obligated to House your 22 yo sister .. she is not homeless she’s just refusing to move w your parents", "NTA.  Sounds like it's time for baby to leave the nest.  If your parents gave YOU (and only you) the house, maybe that's their way of getting your sister into the world.", "It’s everyone’s personal choice. Your family cannot demand anything from you. You can be kind and compassionate but not when it puts you in discomfort. You are not AH.. tc girl.. life is too short to worry about these simple things anyway..", "YNTA \nDo as you please. If your parents gave you the house, is yours, and your sister have no legal right to force you to accept her in your life. She can go ti Florida, or find a place to live in the city she is living now. Take a deep breath and kick her out if she doesn't comply.", "NTA - It's understandable not to want your bipolar sister to live with you.", "NTA. One thing you could do is set your sister up in the apartment agree to pay the first 3 months or 6 months of her rent and then tell her she's on her own. Of course if you guaranteed you're on the hook for the whole year or however long the lease is. But it gets her out of the house. I'm assuming your parents are sick of dealing with her. You don't say if she's in college or just graduated from college or whether she's on medication for her bipolar I'm assuming not from the description though. She needs to figure it out. she's an adult it's not like they're not giving her any warning. But yeah if you let her stay you're not going to get her out unless you legally evict her so you need to make sure she's out of that house whether she goes and lives with a friend or gets a full-time job and gets her own place or rents a room somewhere. I would definitely offer to help her for a few months with rent since you're getting a free house, it's not like you have a bunch of costs. All you have to worry about at this point is real estate taxes. And if the state you're in has personal property tax, then that. But I don't think too many states have that. They suck though I'll tell you that. In any case she knows you don't want her living with you and from your description I don't blame you. But you definitely need to somehow compromise and help her out even if she's not living with you period of time.", "It's a case of ESH.\n\nI completely understand your reasons and I wouldn't want your sister living with me in the same circumstances.  \n\nIt doesn't sound like your sister is medicated for her bipolar.  If she was, would that change your husband's and your opinion of her.  It would actually make it easier for her to function in general and probably hold down a job and her social life will improve.\n\nThe problem you have is that you are moving into the house that she currently lives in.  I also get your parents wanting to make some choices for themselves and living where they want to live.  They don't have to take your sister because she is an adult.  She's also still quite young and living at home at 22 will not get the same judgement as someone still living at home at 35 and never having left home at that.\n\nYou're not being cruel and your mom is not in the right in saying that to you.  She wants you to fix the problem she has with your sister not wanting to move to Florida with them.\n\nAre your parents supporting your sister financially currently?  Does she have a wage or income coming in from any description.  Perhaps the best thing for her is for your parents to organise an apartment for her to move into and learn to support herself.   If they are currently supporting her then they should continue to support her in this kind of situation.  This means she doesn't need to live with you and fixes the issue of her not wanting to go to Florida with your parents.\n\nIf your parents can afford to give you this house, and buy (or just move) to one down in Florida then it sounds like they have plenty of money and can afford to at least subsidise your sister in an apartment.  Giving her some autonomy and the expectation that she sort herself out and make it on her own over time will probably help her mental health... but she needs to be medicated if her bipolar is out of control.  Being manic for weeks/months causes issues.. and being depressed for weeks/months causes issues too.  A mood stabiliser may make all the difference.\n\nIf you were moving into a different house than your childhood home that is currently housing your sister, I would give a different judgement.  \n\nBut your sister needs to take some responsibility for herself and that's likely going to need to start with sorting out her mental health.  She may need to hit rock bottom for that to happen.  Your are not your sister's keeper and not expected to sacrifice yourself or your relationship for her.", "NTA", "NTA. You are not responsible for another adult who is capable of making her way in life. I have bipolar disorder, and have never expected anyone to take care of me. I’m going to say this with the upmost of respect. It’s not a good idea to have another female in the house. I don’t believe your husband would cheat on you, but one aspect of bipolar is hyper sexuality. Not a good idea to have her near your husband. That being said, do not let her stay with you!", "Be a good one to tell at the house warming party\n\n\"So, where's Sister?'\n\n'Well...'", "And right before Christmas. How nice of them.", "Not to mention people with mental illness like bipolar are much more likely to experience homelessness.", "Lmao makes me wonder if she’s actually got bipolar, or if years of dysfunctional family drama has done major damage to her development. I personally know three people diagnosed with bipolar disorder, and two of them have been have since had the diagnosis dismissed and begun treatment for DID after the dysfunction within the whole family unit became apparent after years of therapy. Idk, maybe an actual therapist could chime in. But I think a lot of people are incorrectly diagnosed with bipolar and borderline when they first start therapy", "Triple.  They are not even willing to give the sister time to find a place or save money for this.  Which means the sister will soon be homeless or retirement community bound.\n\n&#x200B;\n\nOP, YTA.", "Also OP — enjoy that tax bill!", "Kicking her out in the middle of winter, with Christmas coming up. Just a special kind of cruelty.", "It irked me that she kept phrasing it as \"letting her move in\" in the post. She already lives there! That is not the same!", "OP seems really cold and selfish - maybe she's an undiagnosed sociopath.\nAnd maybe the parents didnt realize this and fucked up by not making it a condition that the sister was fairly compensated. The mother is a day late and a dollar short trying to reason with OP now.\nIt's kind of like there's \"nobody home\" as far as fairness and empathy.\nThe only people I have known like this were addicts or seriously mentally ill.\nThing is - why does she care enough to ask if she's an asshole...", "Ummm...it sounds like she can move with the parents, she just doesn't want to...am I missing something?", " It’s almost like, if you had to wait for your parents to give you a house, how do you expect your significantly younger, non established sister to do that on her own with this little notice? Op is v much TA", "Uh no it’s not big sisters job to parent little sister", "She said sister suffers from bi polar disorder and she has spent her whole life living with the fall out of that, I totally understand not wanting to live with that now.", "This 22 year old had the choice to go with her parents", "My parents bought my older brother a house because he has a kid. Meanwhile, my husband and I lost our place to live and had to spend 2 years living in an RV. I feel for the sister...I suffered an ectopic pregnancy earlier this year and my stepdad was essentially relieved because he was worried that they'd have to support us the same way they support my brother even though my husband and I have been self-sufficient for years!", "I think parents want her in Florida. I think they probably will be able to take care of her better when she is close by.\n\nAlso how do we know youngest won’t get Florida home???", "NTA I for one am so sorry that you have to experience a sister that would like to stay in our family home that might mean the same to her as it does to you. I’m also sorry that she does understand that it’s a gift been given to you with absolutely no cost to you and your husband. Where is she’s being forced out to find some place to live or move to what seems like a whole different state. I’m sorry that she has the audacity to raise her emotional concerns over what she may think appears to be greed and cruelty on your part. I’m also sorry for the ones that judged you harshly just because you forgot to put in the fact that she’s bipolar and you are definitely not an ableist. The world has been very unfair to you. You know, I once heard the story about a person slept in a bed of roses, and then got upset when the roses had the audacity to rot over time. I thought that person was the most unlucky person in the world until I read your post. Keep your head up and I hope things get better for you.", "Why is OP TA when her sister can just go to Florida...?", "You also gotta remember it's winter in the US. It's definitely a time of year when you don't want to be homeless. And with Christmas around the corner, it just seems doubly cruel.", "Wait, so OP should be responsible for providing a home for her sister, but sister shouldn't be responsible for taking care of herself?\n\nHoly fucking entitlement. \n\nMy 19 year old coworker has managed to find a place to live without forcing their family to pay for them. But you think OP should give up on having a family until her sister chooses to be an adult some day?", "And her husband. Does anyone notice her post is all about “my hubby feels this, my hubby feels that.” Sounds like OP is choosing her husband over her sister. He’s a grown man getting a free house from people who aren’t even his parents and freakin OP thinks her sister should have to move because he can’t deal with her", "She’s 22 years old. She has to learn to go live on her own and manage herself. Like every other 22 year old with 3 roommates out there.", "Edit: the sister is bipolar.", "Have you considered taking some pepto?", "Her sister is 22, she is old enough to be self sufficient.  By 22 I owned my own condo and worked - worked my ass off, but successfully had a place to live, a vehicle, a full time job and my cat.  WHY should anyone be ashamed of themselves?    You are assuming the 22 year old is helpless.  She has had to have known for at least 6 months that change was coming.   We have children to raise them to be independent self-sufficient adults.  Suppose that parents allowed 22 year old to stay with them for free so she could save up money and be able to have a nest egg for when it was time to fly the coop.  At 22, if she is just finishing college, she should have the skills to survive.   Please don’t infantilize your children, teach them to take care of themselves and not depend on mommy.  You make me vomit.", "You did see where the sister is mentally ill- right?", "Exactly. There's seems to be a lot of anger on OP towards her sister. She even says that she's dealt with enough", "Yea that’s not fair to op to force them to be their sisters caregiver but she got a free house. If the parents really don’t need the compensation from their property value for retirement op should be paying at least half if not three quarters the value so her sister can have housing too. She wants to evict her sister from the family home which she more or less is stealing from their common inheritance so she and her hubby can comfortably fuck and not “have to deal” with sister’s mental illness. Truly vile narcissism", "Also of note, lots of women with ASD have historically diagnosed with bipolar or BPD before they are correctly diagnosed. I can't say at all if that's what's happened here; either way very unfortunate situation for the younger sister.", "Quadruple, with Christmas coming up, that means sister will probably be homeless just in time for Christmas. This is grinch level.", "YTA but your parents are the biggest Arseholes of all. A house should be divided among all siblings. What were they thinking? You being older has nothing to do with is except for the fact that you’re 36 and had nothing to show for it, until mummy and daddy gave you a handout. Same with your husband.", "It’s clearly more than that though. They want the home to stay in the family, so they’ve given it to the child that doesn't have serious mental health issues and would be far more likely to be able to actually maintain it instead of squandering it or burning it down or something. She’s also married and starting a family - they need it way more than single adult woman, especially one with these kinds of issues.", "This isn’t “do I have the right” this is “Am I the Asshole”", "This is AITA not askalawyer", "Did your parents pass away or just give your brother the home? If they gave it to him keep quiet knowing he will be taxed without benefit of a step up valuation of the house if he ever decides to sell. That means the value of the house is whatever your parents paid when they purchased the house. If the house was willed to him a step up valuation would mean the value of the home at the time your parents passed and he got the house.", "This Buffalo speaks the truth. Every day is like navigating a minefield of broken glass, broken eggshells, lego pieces, and invisible tripwires. It's awful. And made worse when parents feed into it and refuse to do anything because they just want to 'keep the peace'.", "I can emphatically confirm this.\nI (reluctantly) let one of my best mates of 10 years move into my house because he had nowhere else to go, and it ended the friendship. I ended up on the receiving end of a lot of vitriol and threats and I felt unsafe in my own home. He would only take his meds sporadically. He had caring, supportive parents, whom he regularly dismissed as 'interfering'. He did not want to/was incapable of taking account for his own actions, especially when unwell. I couldn't help him further. He turned on me despite all the support I had given him and I ended up having to kick him out for my own safety.\n\nPerhaps OP and her husband have similar concerns.", "My BIL had problems galore, including bi-power and intermittent explosive disorder. He was prescribed a lot of medication, but every once in a while, he would have a breakthrough reaction. Once, he even beat up his mother (she took me in another room, took off her shirt and showed me the massive bruises from navel to chin). Her husband didn't want him to be arrested and pleaded with her to drop it. But he ended up in some sort of halfway house for a short while before returning. Eventually the FIL passed, and then the MIL (she set up a family trust and made my husband the executor). BIL continued to live there while working on his PhD (and it took him so long, he almost was kicked out of the University), and then got a professor job, but managed to lose that. My hubby would go over to that house to do maintenance until his brother jumped him one day. That was it for my hubby. I helped him file a restraining order (I wrote up an affidavit about what the mother being attacked.) and my hubby hired an eviction firm to kick his brother out. (BIL thought he was entitled to the house because his brother has a house -- which my hubby paid for -- but he had never checked the paperwork for the trust. He wasn't on the deed so eventually he had to leave). We went on no contact with him as we didn't trust him not to attack us or our daughter. He has sent letters saying we should let him back in our life, but wasn't really apologetic.  \n\n\nMy guess is that the OP's parents saw moving to a retirement home as a way to enjoy their life without having to deal with an uncontrollable daughter.\n\nI don't blame the OP and her husband, knowing what I know about my BIL's behavior.\n\nNTA.", "Are we sure shes unmedicated and if so… someone needs to help with that. (Cough cough family)", "I live next door to a person with bipolar D/O who doesn't take medication....& it is HELL...\n& I say that as a neighbor. 😕", "95% of the retirement communities in FL are 55+. If they are moving to one her moving in with them might not even be an option.", "As someone who is freshly 22 as of yesterday, 12/04/2023 I can confirm that I definitely don’t make enough money to live by myself. Here in Oregon because of our property taxes, I would need at least 2 other roommates", "She doesn't have to live on her own. She moves with her parents.", "But that's the parents problem to solve.  This is not OP's problem.", "I did at 22 and I'm not a boomer. I think the OP is perfectly entitled to deciding what kind of environment to raise their kid in, and sometimes family gets in the way. \n\nRaising a kid around someone suffering bipolar? That's a nope from me too. Get them mad on a down day around your infant and see if they don't off the kid to spite you.", "Especially, considering her sister is BPD. OP seems to be looking down on her sister when she herself has to be given a home.", "Nailed it. If she is 36, 2 income couple and didn’t purchase her own house, big red flag. She isn’t as put together as she is pretending. But it should make her empathetic to her sisters dilemma. Totally the TA.", "She’s been offered a place to stay. No one is making her homeless.", "OP got the house for FREE and is kicking out her young sister who currently lives there. Talk about ENTITLEMENT.", "When you get married your spouse should come before your brother or sister.  Secondly, you have clearly never lived with a person in a bipolar episode. In the past I've taken in my brother's ex, who's bipolar and has some other diagnosis, because she is the mother to my niece and nephew. Little things like her ¹making a joke could send her into an episode. She tried to stab my boyfriend and my brother. She hit my brother with a hammer. And that's just some things, and we had to live with it daily walking on eggshells trying to not set her off. Her oldest from a previous relationship is with me now. She's finally medicated, but there are times when it doesn't work, and she still is manic. I know that from September until January, she's in a full-blown manic episode regardless of her medication and Dr's. \nOp's husband is allowed to feel uncomfortable. Just like I was allowed to throw her out of my house for the safety of me, my children, and my boyfriend. The sister was offered to go to Florida. She doesn't want to go, so she should pay her own bills and go live somewhere else. Also, the parents are allowed to do with their property as they please, and since they gave it to the established child, little sis is entitled to nothing. You might think it's unfair, but that doesn't make the OP an AH!", "Update: the sister is bipedal. As is the OP. As am I.", "So? She’s not disabled.", "With you in general, but OP is 36 and she and her husband/partner are being “given” a house by her parents, according to her update.", "You must be privileged and not realize how much the cost of living has gone up.", "\"By 22 I owned my own condo\" ... this smells of nepo baby. I was in my 40s before I finally saved enough to buy.", "“My parents have given my husband and I the house.” Ok, if this story wasn’t rage bait enough already, PLEASE learn proper grammar.\n\nIt should be, “My parents have given my husband and ME the house.” Would you say, “my parents have given I the house?”\n\nBut seriously, your sister might have problems now - she’s 22, FFS. Lots of people with mental illness through their teens and 20s find a balance as they get a bit older. \n\nWhy not help her out a bit and share this winfall of a FREE HOUSE you’ve received from your parents. I have siblings. I love them, even though they’ve been difficult at times. If my parents were to go senile and leave a major asset to me with nothing comparable given to my siblings, I’d do everything I could to even it out and preserve relationships I hold very dear.", "In another comment you admitted only your name is on the deed. Are you now saying both you and your husbands names are on the deed?", "Why did you put manic in quotation marks?", "Who cares about your husband?! Let him buy his own home then instead of forcing someone out of hers. He’s getting a free house from HER parents! Is your husband telling you she can’t stay?", "YTA.  You clearly don't understand mental illnesses.. at all.  I hope you have the life you so clearly deserve.", "You are indeed, an AH", "YTA - So you’re kicking your sister out of your childhood home because YOU have memories there. What about your sister? She grew up there too. And how uncaring and selfish to not see how unfair this was to your sister. Your parents should have given the house to both of you and then you’d have to buy her out to be the sole owner which would give her a financial start at least. Also, this is your “dream home”? Did you dream of living in the same place your entire life from childhood up. The house your parents picked not you? Wow, ok. That’s a choice I guess but you should have to buy out your sister’s share. \n\nUnless you can justify why your sister got cut off besides a completely treatable but debilitating illness. Mental illness is a disability by the way and it’s horrible for those suffering because many of them know they need help but the very nature of their illness stops them from being able to reach out.", "And you’re acting like she can control it. Has she ever gotten help?", "Bipolar is ABSOLUTELY a disability. It’s recognized under the Americans with Disabilities Act and the Social Security Administration. While I understand it can be stressful sometimes to be around others with disabilities has anyone stopped to think about just how stressful and hard it is for her to have to live with it? I also have a mental illness that is recognized under the ADA and every day is an internal battle with myself. It’s exhausting to put it politely. I am fortunate and have amazing support from my family and friends. It doesn’t seem like your sister has that. Structure and routine are SO important with mental illness. Moving is difficult enough with mental illness but being kicked out of the only place you’ve ever called home with little concern or compassion by your own family is something else entirely.  The fact that you suffer from anxiety and can’t even sympathize a little with your sister is baffling to me.  I’m not saying she has to live with you forever but this really should have been worked out better and with more consideration for her.\n\nYTA", "I hope this is rage bait. If not, you are an awful human being and your parents are assholes who play favorites. I truly hope you and your husband are unable to conceive. You're too monstrous to have a family of your own. Please be sterile.🤞", "That makes the parents at fault like I said. She doesn’t owe her sister anything but the parents failed her sister and had the nerve to call her cruel when they’re the ones who had the living arrangement with the younger sister in the first place", "*Moving states away, with no support system outside family is NOT a good prospect on the face of it.*\n\nAssuming she gets along with her folks, that's alot more of a support system than many people have", "From the comments, it sounds like sister is getting nothing.", "We don’t know they aren’t. Maybe you get sister will get an equivalent gift when she is 36. Parents are retiring to Florida, likely will buy a property there. There will be more to inherit than just this house.", "Actually no. A fragile child with bpd needs stability and protection more than a 36 year old woman with a husband. And Holy shit at the ablelism. You realize ppl with bpd are not likely to \"burn down\" a home right? How offensive. Do better.", "Ok… but many people are capable of thriving with a support system", "That's the problem with helping people still spiraling downward, you are enabling them and just delaying the breaking point.", "You generally can't force treatment.", "U cant force meds down ur family members throat", "She’s 22. What can they do?", "They are, they’re moving to Florida 😂", "It says \"retiring\", not moving to a retirement community.  It also states that \"she has flat out refused to join them\".  That strongly implies that moving to Florida is an option for her.", "It says she 'refuses' to live with them, which implies that she could if she agreed.", "Happy belated birthday! Mine is today and I turned 35. Enjoy your 20's, it goes by so fast.", "Shared living is happening more often.  Nice when it works, but a nightmare when it doesn't.", "Yes, and most 22 yr. olds should expect to have roommates, not expect their adult siblings to house them.", "As terrible as it is, it doesn't make sense to just leave a house to someone who can't support themselves.  It's not just a free house where a broke 20 something can live.  Houses are expensive even if they're owned outright.  Property taxes can be nearly as high as an entire rental depending on where you live.  Home maintenance is expensive.  It doesn't make sense to leave a house to someone who can't afford to pay property taxes and maintenance.  Even more unfortunate, but I doubt a 22 year old with what sounds like poorly managed bi-polar disorder would have the ability to manage these things on her own.\n\nDo I agree with the fact that our society is like this?  No.  But I don't think anyone is TA here.  Little sister needs support, it's not big sister's job, parents have offered to help little sis in Florida.  Little sister needs to suck it up and move in with her parents who are responsible for her well-being.", "that's horrible. What if one kid totally sucks and is abusive and the other isn't? The abusive child can sue? yikes.", "That’s so interesting and really cool to hear. That’s my whole take on this- why isn’t the younger sister just being bought out by the op?", "They gave older sister the house! You cant give one kid a house and give the other sibling an offer to move into a retirement home. If OP bought the home it would be entirely different", "She's married and well into her 30's. Why can't she buy her own house and let the younger, more vulnerable sibling stay?", "The way I see it is this: \n\nParents retiring and relocating is not something that happens over night. The youngest knew this was coming and was invited to join her parents in their new home. She just doesn’t want to. \n\nWhile being given a home is a massive gift, this is the oldest daughter’s “dream home” and has sentimental value. I’d reckon that a married couple in their 30s, planning to start a family, is in a stable enough financial position to pay for taxes and maintenance on the home. The younger daughter likely cannot. \n\nThe alternative would be selling the house and split the proceeds of the sale between both daughters, crushing the oldest daughter’s dream of starting a family in her childhood home. Both the oldest AND the youngest would then need to find new living situations. \n\nIt does seem like the youngest is getting shafted in this deal, but she has been given the option to stay with the parents. We don’t know what the parents have planned for the youngest daughter. Will the parents contribute to the purchase of the youngest daughter’s own home once she’s reached the point where she can be responsible for it? Is she set to inherit this new property in Florida?", "There are very good reasons someone would not want to move to Florida, including their own general safety in the future.", "OP could at least give a grace period. Treating family this way shows a lot about how they treat people. Moving to another state is a big move, especially without good support. I wouldn’t trust the parents would treat her well, seeing as their giving OP a house and leaving the sister with nothing.", "That can absolutely disable a person", "I was privileged to have a mom who stayed home and a dad who worked.   But the day I moved out of my parents house was they day they stopped supporting me. I worked, I saved, and I had crappy roommates until I decided no more.  They gave me no money.   Times were certainly different back then.   But you know what?   Salaries were lower, food was still expensive and college education wasn’t the common thing for many.    No, I could not do that at 19 now, but the opportunities and possibilities now for a 19 year old are also different.   \n\nAt 22, people should be self sufficient whether in college or working.   yes I know that not everyone has the same opportunity depending on their region, but by OPs story, she is not from an inherently poor area.", "Nope, it smells of I knew what I wanted at an early age, apartment rent was more than a mortgage, and why not?   Yes, my dad helped me with filling out the mortgage paperwork since this was in the 70s and no computers about,   Yes, the mortgage company questioned if I was qualified and my age.   My dad kindly pointed out that I was an adult according to the law, I had been working for 3 years, had a stable job with a good salary and surely they were not discriminating against me were they?  A two bedroom condo cost me $20,000.   In the 70s I could drink beer and wine and women were finally allowed to have a credit card in their own name.   Could I do this today at 19?  Probably not unless I was a trust fund baby.  \n\nTimes were different 60 years ago.", "So an AH and a liar. Stay classy OP.", "I disagree. As I said in another comment, my brother was a pig headed asshole, but if my parents ever said, “Hey, we’re giving you our house!” my first question would be about what my brother was getting. I would never stand for such inequitable behavior toward me and my only sibling. Only an asshole would accept such a massive inheritance without knowing there was  at least a solid plan for their sibling to have something at least somewhat equal.", "Great support system she has, parents who give an entire house- the one that’s currently her own home- to her sister for free and Jack shit to her. \n\nI can’t even imagine how that kind of blatant favouritism damaged her as a child. It certainly damaged OP, turned her into an entitled AH.", "The fair thing would have been to give the house to both and the eldest buy out the younger. She would have more than enough equity to do so.\nInstead they seem to be giving a big FU to the youngest (based on available info)", "BPD isn’t bipolar. BPD is borderline personality disorder.", "True, but that’s an extraordinary burden that isn’t the responsibility of the older sister to carry, especially if she wants to start a family - it’s probably not even safe to raise a baby in an environment like that, not to mention the strain it would put on her marriage since her husband can’t stand being around her. Who could blame him?   \n\n\nThe sister is an adult and has a housing option available to her, she just doesn’t want to move, but that’s just too bad. Things change. No is a complete answer.", "Sister has burned those bridges. If she wants family in her support system, she needs to take responsibility for her own treatment and behavior, and show them she is managing her illness.", "if those people want to be the support system.  OP does not.", "Right, but I don’t know if it’s a good idea to have OP and her husband be the support system for her while they are trying to have a baby. I get that it’s a difficult situation, and I hope lil sis can get the support she needs, but i also understand not wanting that to be your home life.\n\nI love my sister, and there is absolutely no way on earth that I could live with her mental health in my home. I’d have a breakdown.", "Not forced treatment but support  which can take many forms we dont know her situation", "Nobody said that", "They can support her in her medication regimen… advocate for her. Make sure she has regular contact with psychiatrist and… if she gets psychotic, help with inpatient care.  Its multifaceted.  Ideally she would be able to manage on her own but even successful people get in trouble and spiral", "Oof. Dark 😂", "And OP seems like a reliable narrator?", "Thank you friend absolutely 🥰❤️! And happy birthday in return!", "I never said once that I didn’t expect to have roommates at 22. I said that I couldn’t afford to live by myself. There’s a difference", "Op got a free house and wants her sister on the street. She’s barely family at this point", "That is the case in many jurisdictions, especially European ones. Children have rights to a proportion of parental property.", "As it should be. I should decide who gets my stuff. Regardless of reason, if i own it, how i gift it is my business.", "Not in every state. In La if my spouse dies, my children become part owner of our home. That’s state law.", "There are especific instances in which parents can disinherit their child completely, one of them being mistreated by said child, but you have to show in front of the judge that your reasoning is valid and the judge has to authorize that. It can't be only your will. Many parents who doesn't have a good relationship with one of their children only leave them the minimum percentage that the law requires them to give them, and that's it, sharing the rest with the other children and relatives. But, in compensation, children have duty to take care of the elderly parents and can't legally abandon them (or said parents can sue the children) and the parents are the direct and legal heirs of the parents if they have no children of their own, so the main idea of this is to protect the interests of the direct ascendants and descendants.", "But you can gift a responsible person a house and not someone who is unable to even manage their meds - which by the “mood swings” sounds like she’s either inconsistent or not on the right cocktail. \nIt’s ABSURD to expect one adult to take on another regardless of the circumstances. No one wants to be pregnant or raise a baby with that kind of chaos around. Daughter is an adult who should be managing her life and looking for a place to stay not imposing on someone else so she doesn’t have to do adult things.", "Then be mad at the parents.  OP is not responsible for housing her adult sister.", "Probably because op is the only one who could afford it.", "The parents are moving regardless. So leave the house to the youngest who clearly can’t afford the mortgage & bills?", "This, the parents are aholes more than the sister.  Why give the couple who can support themselves the house?  Either they are complete aholes or made assumptions that the daughter would be living with her sister, hence the free house?", "If they hadn’t offered her to move with them I would agree. BUT I bet they were thrilled when she refused.", "Where did you get that?", "Which one?", "Have the house appraised, OP could get a note for half the value &!buy lil sis out. Lil sis can get a home as well. THAT is what parents should do. FFS treat your kids equally.", "I agree with you. Lots of ableism in these comments (and from OP)", "u/Historical-Set-3791  you are really butthurt at the OP being given something so amazing by her parents arent you. You don't know any of the circumstances but bottom line is it is their house to do with as they wish.\n\nI can totally see OPs point of view, wanting to set up in their permanent home & start a family. Having anyone else there is not the same, especially a very young sibling who would be exhausting on her best day.\n\nOP --- NTA", "Ok so you are the AH. Because you admit this was 50 years ago, yet you wanna be all \"kids today, can't afford their own houses at 22.\"", "Which would be a rounding error compared to an actual mortgage in this time, am I right?\n\nI hate my GC sister (who is a lot like you) with the heat of a 1,000 suns, and I still wouldn't do this to her.\n\nWon't be enough christians to pray you out of the hellfire.", "\"Why does my sister never talk to me? She lived off my parents until she was 22, when we decided to give her a reality check to make her grow up. Now my parents are sick and none of us have heard from her in 5 years, because she's still mad about the reality check. But SHE should be the one to go to Florida and help them, since she lived off them for so long into adulthood. Help!\"\n\nYup, that'll be her next post a few years down the road lol", "Big assumption.  We dont have that info..", "You are making up a narrative that isn’t suggested in any way here.", "We know nothing about the level of medica support she's receiving from her parents or OP.  Her parents do care enough about her to let her live at home and to offer her a place with them in FL.", "We don’t know her situation, so you shouldn’t assume they’re not giving her support for her BPD", "Ok so how are family supposed to help with someone who might not want help? Sis is 22 and unless she js deemed unfit to make her own decisions family can only do so much.", "But she is 22, so unless she gives them power of attorney or just goes along with whatever they say, they can’t do any of that.", "The whole conceit of this letter is that parents are moving and sister refuses to move with them.  If you can't believe that, I'm not sure why you're bothering with this aita", "Add Spain to the list of places I’ll never live. Kids shouldn’t be owed anything, what a sense of entitlement.", "What happens if someone remarries?  Can they not leave their property to the new wife?", "Oh wow. So wills does not apply?", "That where you wrong. It was given to her no matter what the reason. So she not supposed to take a gift that’s given to her because her sister chose not to move with the current people she was living with? That like saying someone gifts you a millions dollar just cause but you don’t have the right to do as you please because you didn’t “work “ for it or earned it. Her parents made that choice of their own free will.", "That’s a good point. It’s a shitty, absurdly unfair choice the parents made, now the op is left to enforce it, just deepening this awful move against her own sister that’s taking place. The op, though, sounds shallow and empty enough to just project it all on the inexperienced, lost and mentally ill younger sister bc she wants to stay in the town with more opportunities that’s familiar to her. I mean, it’s just a testament to how fucked families, peoples actual parents and siblings, can really be. It’s like yes YTA, but that’s prob bc your parents suck, but hey maybe sis’s illness came from somewhere and someone’s undiagnosed, like yr parents, so is the sucking really their fault?    \nPeople need access to mental health services. This poor girl should take that car and drive to a social worker if one exists nearby.", "This isn't OP not letting her sister move in, this is OP kicking her sister out", "Depending on which country they are OP's sister can ask for half of the house if it's the parental house or at least to get the equivalent in money.", "OP should  either be offered the home, but only if sister can stay rent free for X. Or she should have to pay her sister's share off, so sis can afford a rental. Eithef way OP would've still gotten the better deal, but it would've been fairer than \"OP takes all\".", ">So leave the house to the youngest who clearly can’t afford the mortgage & bills?\n\nOr sell the house and distribute the proceeds between the two children.  Or give each child an interest and let one rent the house while distributing money to the other in proportion to the ownership interests.  Etc.", "Shes 22. Reddit is so (*****). Inconsistent… the word i wanted is inappropriate ;)", "I know that kids today can’t own their own house at 19.   Hell, I couldn’t afford to buy a house in my neighborhood now.  I also know that all three of my children could afford an apartment when the moved out, even if they had to have a roommate or two.   Two of them have purchased at least one home.  It can be done, and this “oh, she is 22 and you are all AHs for kicking her out”. Nope.  They are not.  You don’t know that they haven’t encouraged, helped, taught her how to live on her own and be successful.   You are assuming she is some poor thing.   I am not.", "Let alone a 22 year old trying to navigate mental illness. The lack of basic empathy for those who are struggling…. It’s cruel", "I don't think so. \"Why my golden child, who have been gifted a house by us and be given a lot of things without her earning anything, is not grateful and don't care for us?\" Because you raised her that way. You are not given reality checks at 22 when you are already working a full-time job. Maybe the one who needs a reality check is OP who is 36 and couldn't afford a house until mommy and daddy gift her one.", "It doesn’t sound like the sister is making any changes", "Agree", "I dunno…. Not hearing a lot of support here", "BPD is not Bi Polar Disorder, it’s Borderline Personality Disorder. If you’re going to speak on it, at least get the acronym correct.", "Why are we assuming she didn’t want help?  We are filling in story holes with  our own biases", "They could make even half of a gesture to support their kid’s struggle with mental illness", "They can.  They can.. they can do a lot of that just by checking in with her they can help her if she needs inpatient as well provided she consents to their help.  If shes not consenting to help and psychotic there are state dependent legal avenues to pursue", "Dude. The sister likely has a good reason to \"refuse\" to move. A 22 yr old likely has school, a job, or a multitude of other reasons not to want to uproot and move states. Just stating she doesn't want to move smells of missing missing reasons.\n\nNo need to be so aggro over nothing.", "You have to go to court to disinherit children here, and show you have a reason for it. The very few cases that the judge rules that a parent can completely disinherit a child have even made the news, they are so rare. You have to argue why. For example, a very rich man recently died in Spain. He disinherit in his last will his first five children. The children are contesting it because it is illegal unless very specific causes, like mistreatment of the parent by the children, or fault in the duty to care for the parents. If the named heirs can't demostrate in a trial that the deceased was right, those five children can't be deprived of their \"legitima\" (the obligatory part for the children).", "And not just in Spain, same laws apply in Finland as most likely in several other countries as well. In Finland you can only cut out a child if they have committed crimes against you or \"have lived very immorally\". Immoral living is often decided at court and can include being part in organized crime, committing murder etc.", "I will go to cry with our universal healthcare, our universal education (I only paid 1.000 euros for my education, from childhood to my Ph.D), our elderly pensions, our maternity and paternity leaves, our mandatory one month paid holiday plus other days, our two years unemployment payments, etc., etc. for your opinion, internet stranger who lives in United States, one of the richest places of the world with one of the highest rates of dying by money-preventable causes.", "Spain wouldn’t have you", "Louisiana has inheritance laws too. Every state has different laws with this. If you own your home & die, your children get your ownership of the property even if a spouse survives. \n\nSo if my spouse dies for example, I’ll own 1/2 and the other 1/2 will be split owned between our kids: 50%, 25%, 25%. As minor children the surviving spouse still has the ability to sell it but technically that portion of the profit belongs to the kids.", "Not completely, no. It has to be divided with the children, and if it is an inheritance, it can't be given to a spouse to protect the children's rights. If it is a normal property, usually the wife/husband inherit 50% of the property, and the other 50% is divided between said wife and the children. For example, if someone has one child, the spouse would inherit 50% + 25% and the child 25%. If that person remarries and dies, they have the same right to their property, and the same percentages would be applicable again, but the children can't be completely deprived of the legitimate part of their parent's properties, which at the bare minimum 1/3 of each property and of the liquid assets. Also, if the property is an inheritance that is passed to blood family, the spouse doesn't get anything. But there is a legal figure called \"usufructo\", in which you can left said in your last will that your spouse have the right to reside in a property and not be kicked out of it while he/she lives, as the property was maintained with shared money during the duration of the marriage. But it will not be the property of the widow, and he/she could never make big decisions or sell it without the legal owners' permission. For example, my mom owns her family's house, passed down generation to generation since my great-grandparents, in other city. As it was an inheritance, it was solely property of my grandma, no shared by my grandpa. When she died, pretty young, the house passed down to my mom and aunt, 50% each, but she established in the last will that her husband had the right to live and use that house as long as he lived, although the property was my aunt's and my mom's legally. They couldn't legally evict him or sell the house with him in it, if it was his primary residence. When he died, my mom bought my aunt's part. Now, when she dies (I hope in many, many years), my dad will have the use of that house, but the property will be exclusively of my sister and me. If he remarries, his new wife will have no right to that house when he dies.", "Sure but the wills have to follow the law. You can’t disinherit your kids but I guess if you’re wealthy enough you could pick a different state, change residency, & die there.", "Sometimes parents make choices of their own free will and those choices make them assholes. Not sure why you think otherwise, but you are misguided.", "If it is going to hurt my sister, I would never. In fact, with lesser money, I have never let her being unfairly treated. In this case, the unfairness is especially important because the sister is currently living there, is pretty young, almost 15 years OP's junior, OP is not giving her even a grace period and  the difference of treatment between them is so astounding, and her disregard for her situation so blantant. She could have said: \"Ok, I know it is unfair for her, but I really want this for me and my family, so I will make sure she will receive everything that is left when they die to try to even out, or I will take care of my parents to compensate for it if necessary\". Or: \"She is living here. I am going to give her a grace period (she says in the comments that she is not giving her one, despite being the sister's home) so she can find somewhere else with my help\". No, Op doesn't even recognize she is being unfairly given a gift of thousand of dollars without earning anything because of her parents' blantant favouritism.", "Her parents are moving so she needs to move w them , she wouldn’t be able to stay there if the parents were selling the house to strangers", "No the parents have surrendered the home. So sister doesn't have a home there anymore. She does however have a home with the parents still.", "Technically not. The parents are moving either way. If they weren’t giving the house to the oldest, who can afford it, they’d likely sell it. Would you sell it & force the new owners to keep her there because she refuses to move to Florida with her parents, & because she clearly can’t afford (& likely doesn’t want to) her own place?", "Absolutely it is. I have a daughter that is bi-polar and she goes through cycles of not taking her meds. She feels better snd after a while thinks she can do life without the meds. A couple weeks later when the mood changes drastically, I usually call her on it and she’ll admit that she hasn’t taken them.", "It's almost as if you think OP is the parent.  If you are upset about the lack of care for the sister then you should be mad at the parents.", "Thats in no way part of the post", "This is fan fic. We dont know anything about her outside her diagnosis", "She is living with the parents currently and could join them in their new home.  That implies some level of care for her general well being from the parents.", "You are correct but the person using BPD isnt as familiar its ok though.", "Because thats what reddit does lol", "On the bright side for the parents, you can't disinherit them either. Your legitimate heirs in Spain are your children, or, if you don't have them, your parents. If you have neither, you can leave your assets to whoever you want. But for example, my sister has a kid, so it is very difficult for her to desinherit him, even if she wanted, but I don't, so I wouldn't be able to disinherit my parents if I die before them, either. These laws are made to protect all the direct ascendants and descendants of the family, and if you are legally liable of things, you get to be economically protected, too, and no part can be left out if all of them are liable if something wrong happens.", "lol I literally hate the US and am trying to move for many of the things you stated. Calm your tits, I can have an opinion.", "Of course we wouldn't. We have low tolerations for assholes. That person couldn't take it.", "No one is talking to you, shhh.", "Are you a child?", "This isn't correct. That order of inheritance only applies if you die intestate. You can will or give your property to whomever you want and it will be followed by probate.", "Ok I see what you saying. But as you said, there’s a big age difference. How do you know the OP has  not been there for her parents when they needed her? Rather financially or just being there in a time of need? And as for the sister, she may just be one of those people that take and not give. So in a stance she may just have earned the gift Does your reasoning still apply?", "They could sell and give 50% to each child which would allow the 22 year old to be able to house herself", "But they’re not selling the house so that scenario doesn’t matter here. OP is moving into their parents house and kicking the sister who lives there out. \n\nIt would actually make more sense to sell the house and split the profits between the two children and younger sister can use the money to get her own place and OP can get her own dream home.", "Wow. See, I have siblings, I care about their well-being, and about our family relationship. Lots of people recognize unequal distribution of assets even when it’s in their favor, and take it upon themselves to help restore some balance. To put it simply, just because you’re given 100% doesn’t mean you can’t share.", "It’s part of what OP reports", "What do you mean? We know what the sister tells us. Do we know the sister’s side? Of course not. It’s not her post.", "Whatever. You guys can be ok with this… i think it sounds trashy.", "Sorry, but it’s not ok for them to have an opinion when they don’t even know the name of the disorder, let alone anything about it.", "Its a lot of fan fic 😂", "This is fascinating thanks for sharing", "And good food too! And some of the most wonderful beverages ever.", "Correct, that only applies to intestate estates. In the US nobody is entitled to anything if you don’t want them to be, you can leave it to whoever you want. We don’t have royalty mentality here.", "The only reasoning OP gave is for her to be the oldest. That is not a merit, that is a biological accident.", "So OP is suppose to just put family planning on hold so sister can stay with her rent free?", "Are you OPs sister?", "The giving OP of the house without similar monetary for consideration for the sister is highly questionable if not outright wrong. \n\nBut alot of people think the sister deserves to continue in her childhood home just as a general concept.  Theyre acting like OP is making her homeless.. That's just dumb, since she will still be housed if she moves with her parents.", ">In the US nobody is entitled to anything if you don’t want them to be, you can leave it to whoever you want. \n\nThat's not true; many states have a minimum that must be left to the legal surviving spouse.", "But, of course, Op can back you up with more info. But I really doubt it, given that her parents are moving far away when they are getting older, that is the moment when parents need more help, and Op, who have an age difference of almost 15 years with her sister, doesn't mention helping them especially, or with babysitting duties, or with money to sustain the house. In fact, she says that the sister is currently working full time, so it is possible that she has been paying rent to maintain a house she is being evicted of without any grace period whatsoever. But we really don't know, as OP, doesn't clarify.", "She could buy her own house", "Stay with OP rent free, in OP’s rent free house? Yeah, that sounds about right. I bet the free dream house has enough bedrooms for OP & hubby, little sis, and kids. Little sis wasn’t even asking for that much, just to be allowed to stay for a little while until she could find her own situation.\n\nedit: I am refusing to believe this is real. OP is a massively self-entitled asshole, but surely she must have enough self-awareness before posting on reddit to recognize the story makes her look like a fairytale villain."]}