{"id": 32469, "submission_id": "18c5b7q", "title": "AITAH? My mom and my brother took ~$100.", "selftext": "I woke up this morning for work and noticed that around $100 was missing from my checking account. They apparently spent $40 on gas and withdrew another $60 cash. My mom kept $40 and my brother kept $20. I wanted to buy something that restocked online today and now I can’t afford to. Am I the asshole if I demand the money back from my brother? I’ll let my mom keep the money because she’s my mom, but I’m not letting my brother keep it just so he can spend it on some ho. What would y’all do?", "created_utc": 1701873430, "permalink": "/r/AmItheAsshole/comments/18c5b7q/aitah_my_mom_and_my_brother_took_100/", "score": 35, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > That might make me an asshole because he’s family. I just want some outside opinions\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Why/how do your mother and brother have access to your checking account and why do you allow them to steal from you?", "Info: why would your mother take your money and give it to herself and your brother? Why aren’t you upset that your mother stole from you?", "NTA.  And you should demand your mother give you your money back.  You're not her personal ATM.  You worked for it, it's yours.\n\nThe next thing to do is to either restrict their access to your checking account or get a brand new checking account where they can't access your money.", "Listen closely. Mothers do not typically steal from their children. She STOLE from you, as did your brother. You need to make your account unavailable to them. Tell the bank what  happened. I'm sure they have suggestions. If you let them (and I mean BOTH of them) get away with it once, it will continue.\n\nFYI:  My mother would have gone hungry before she took her children's money. That is what a typical mother does. Your mother is not typical. I know you love her, but she has shown you what she is capable of doing. She has officially warned you. Stealing from your children is unethical. What you do with that knowledge is up to you. \n\nNTA", "NTA. \nCan you make it so they don't have access to your account?", "NTA. They stole your money. You have to ask your money back from both. If they really need money, they need to ask not steal.\n\nYou say in one off your comments that you don't pay rent, but this doesn't rectify stealing. I don't know your age, but if you are 18 or above and earn some decent money, you can always suggest to your mom to pay for rent or other living expenses.", "NTA - you need to change your PIN ASAP!!!", "Demand the money back and then cut off their access to your accounts.  Only you should have access to your money.   Hide your cards/wallet when you sleep.  Lock it in the bathroom with you when you shower.  NTA", "First thing I would do is end their access to my checking account! If hey took the money without permission, I might request they pay it back.", "NTA . . . I would change my bank account so they no longer have access and have to ask you for money.  You do not have to give them your money, but letting them have access means they will continue to borrow a bit from time to time and could cause you to get penalty payments if they overdraw your account.", "NTA. Report the fraud to the bank and have the charges reversed. Be very clear with the bank that they were not authorized and tell the bank you'd like them to pursue charges", "You successfully have been brainwashed by your Family into thinking that stealing from you is perfectly fine - gtfo this place asap and take legal Action against Them, nta", "NTA - I'd demand all the money back ASAP. Regardless of the relationship with that person (family or not), no one should have access to your account and on top of that, feel like they can withdraw **your money** as they like. Please change your PIN number and keep your savings safe. You worked for it. It's your money.", "NTA. That's theft. If your mother needs help she can ask you to pay rent. She doesn't get to help herself to your money. Sad but you are going to need to secure any credit and ATM cards you have so this doesn't happen in the future.", "Why do they have access to your checking account? Fix this.", "NTA call the cops on them.", "Your mother and brother having any access to your account should be squished. I noticed you said they stole your card. Well, first things first is to take legal action for that because that is ILLEGAL. Wherever they withdrew the money from will have cameras proving they did and can be used in court. Second, get yourself to your bank and get a new card with a new pin and NEVER EVER GIVE THE PIN TO ANYONE ELSE. Don't even let someone within 10 feet near the ATM when you use it.", "Buddy, your mom and brother ***stole from you***. \n\nNTA", "NTA. This is theft. Get the money back from both, because not doing so will just make them confident they can do it again.", "As a mother myself, good Mothers do not *steal* money from their kids. \n\nNTA. You are not the asshole. Your mom and brother are. Stop allowing them access to your bank account.", "You need to go off on everyone because she stole from u not necessarily your brother", "NTA, why does your brother have access to your checking account??", "Demand that money back gurl", "Why does your family have access to your account? I don’t think YTA, but at the end of the day you let people touch your hard earned money. I would take this in as a 100$ lesson learned, protect your accounts and stop letting them touch your finances. If they need money they can ask you and you can decide whether or not to give it.", "NTA \n\nGot to the bank and immediately get a new card. Change your PIN number as well. Ensure that you keep your card on you or hidden from now on to ensure this happens again \n\nSidenote, just because she’s your Mom does not mean she can steal. You can be fine with it, that’s okay I understand, but she took money from you without you knowing. Your brother and your Mom stools from you, their thieves. They should have the decency to ask you.", "They stole from you, and not even simply for an urgent necessity. If they'd *just* gotten the gas then perhaps one could argue \"Okay, they needed it\", but obviously that's not the case.\n\nSo for that, N T A.\n\nHowever, for your demeaning language towards women, YTA.", "NTA, buy a safe, and move if you can. Honestly feels like petty small stealing is worse sometimes.", "NTA \n\nThey stole your ATM card and stole your money.", "You have a weird relationship with your mom. NTA but dude seriously? Grow up, why is she taking money out of your account without asking? How old are you? And why do you allow that? She should ask you. Not go behind your back and steal from her child", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI woke up this morning for work and noticed that around $100 was missing from my checking account. They apparently spent $40 on gas and withdrew another $60 cash. My mom kept $40 and my brother kept $20. I wanted to buy something that restocked online today and now I can’t afford to. Am I the asshole if I demand the money back from my brother? I’ll let my mom keep the money because she’s my mom, but I’m not letting my brother keep it just so he can spend it on some ho. What would y’all do?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - I'd demand ALL the money back, tho I don't know about your living situation but still, your not an ATM for them to use whenever. If they asked it would be fine but straight up stealing it while your asleep is borderline insane. Get that money back.", "NTA\nI agree with a lot of what is said here. Go to the bank and talk to them and tell them the situation. Change your pin, and maybe even get a new card in case they have the card number written down. What they did is theft, there is no other word for it. If they want money from you they need to ask and you need to agree. You will never get that money back, make it so that they can't steal any more from you.", "You need to grow some self-confidence and stand up to your family, why are you even asking if you’re the AH? They stole from you, demand the money back.", "NTA \n\nYou should steal stuff from them. Break something valuable.", "NTA. Your mom and brother stole from you.  I have access to both of my children’s accounts and I NEVER take any money without them telling me to do so.", "I would demand my $100 back from whoever was responsible for taking it. no one asked, they just stole your cash. Why make a big deal about $20 that she gave him if you're letting your mother waltz away with the other $80?", "NTA - change the pin asap. \n\nFrom what I’ve read, you’re 19 and living at home? If you want to help out, discuss with her about paying some rent every month. My son is 19 with a full time job and living at home. His money is just that, his money. We have discussed asking him to help contribute as just groceries to feed the household is getting astronomical. \n\nWhat your mom and brother did was not okay on any level. Perhaps a discussed upon arrangement will keep this from happening in the future. If that doesn’t work and they can not respect boundaries, you need to look into getting a different place to live.", "They STOLE from you. Stop letting your thief mother have access to YOUR money. NTA", "NTA. You need to file a police report. They stole your debit card from you and withdrew the money.", "Lol so which is it OP? Did mum have access cause she helped set it up, or did she steal your card while you slept? I'm leaning to option 3: this is made up.", "\"some ho\" Do you go around automatically branding women as \"hoes\"?  Are we just casually referring to women as \"hoes\" now FFS?", "They took my card while I was sleeping.", "They needed spending money apparently. I’m not mad my mom stole from me simply because she could use it. My brother, on the other hand, is most likely going to spend it on some girl he’s been seeing or fast food.", "What if I live with my mom and don’t pay rent/utilities. Does this give her the right to steal from me?", "I don’t think she knows she’s in the wrong. She believes since she raised me, she can take money.\n\nEdit: I know this is crazy, so let’s chill with the downvotes.💀", "I’ll try to change the pin.", "Can I do that online or does it have to be in-person? (I use Chase)", "That’s tempting, but too far. 😂", "I wonder what my mom would think of this post and all of it’s replies/comments. 🤔", "My mom helped me set it up a few months ago.", "That’s a bit far, isn’t it?", "I won’t get them arrested over this. I will change my pin though.", "Would it be an asshole move if I charge him interest on it if he cannot get it back to me by the end of today?", "I didn’t let them. They took it. They broke my trust. How is that on me?", "Yeah, if it were just for gas, I wouldn’t be as upset. Also, what demeaning language towards women? I never said every woman is a ho, just the ones that my brother picks. 😂", "Telling me to grow up when I’m asking for advice is crazy.\n\nEdit: I’m sorry again, grow up DOES NOT = f**k you. I know this now. 🤦‍♂️", "They didn’t want to wake me up. That is their excuse.", "Unfortunately, “two wrongs don’t make a right”.", "She gave him $20 for gas, then another $20 to spend. It’s mostly that spending money I’m upset about. My brother just started his job, so I know he needs gas money until he gets paid. He doesn’t need to go out every night and waste money.", "I’ll discuss helping out with rent or something like that so this doesn’t happen again.", "Let me get this straight-they STOLE from you and you have to ask if you're the asshole in this situation?\n\nPlease get the hell out of that house ASAP and then get yourself deprogrammed.  They've got you brainwashed into thinking that somehow stealing from family members is ok just because they \"need the money.\"  Neither of those things are true.  Your mother AND brother ARE thieves, they do not respect or care about you, they suck, and you should tell them both the next time they take your money without permission you will call the police and mean it.", "Change the pin, disable the tap feature at the bank.  I’m sorry but this is a loss, you’ll never get that money back.", "Why do they have your PIN/password? Change it immediately.", "They stole from you they both should pay you back and you need to move. If this is acceptable it behavior in your home I feel bad. Your brother needs his ass beat.", "Call me crazy but I’d be miffed if my money was stolen. If my mom asked, hell yes a thousand times over. If she straight up stole my money AND gave it to my brother without even telling me what was going on? \n\nI don’t want to presume what your family life is like but the fact that they so easily take from you shows me that they don’t respect you. \n\nYou’re NTA for wanting money back, but it’s toxic to think it’s just your brother wasting your money.", "No one has a right to steal anything.  Stealing is wrong.  Your mother has an obligation to provide you housing, clothing, food, and all other necessities as you are her child and still a minor.", "You are 19 so it is reasonable to expect you to contribute to the household in some way, whether that is by furthering your education with diligent study or by getting a job to contribute to family funds. But this is something that NEEDS to be talked about and quantified, so that everyone is on the same page and nothing is a surprise. It would be okay for your mom to say “I need you to contribute 200 dollars a month to household funds for gas and groceries.” It is super not okay for her to get access to your debit card while you are sleeping and take what she needs from there. It is completely unjustified for your brother to get your money at all. NTA for wanting your money back, but you need to sit down with your mom for a conversation about expectations.", "No. Never. You’re her child, not her ATM.", "No. If that’s the agreement then she’s stealing from you. Change your PIN number today.", "No. She can ask like an adult.", "NO", "No. If you're a minor your mother is legally and morally obligated to provide for you.\n\nIf you're an adult then the situation is different. Many parents do provide some support for young adults. If that's not feasible or if they do not believe in paying for *everything* then they need to agree in advance how much the young adult pays for their room and board. Or, if the budget simply is short one week then they still need to *ask* unless the situation is somehow *very urgent* - for example, if due to an unforseeable emergency your mother needed $50 to keep the electricity from shutting off  it would be understandable if she took what was necessary to cover that cost and informed you afterwards with an agreement to pay you back later.\n\nSo you could argue that perhaps the gas is covered under necessity. However, nobody could argue that your mother or brother needed walking-around money. Wanted, yes. Needed, no.", "And there’s your problem. Asking for $20 gas money? Fine. But she has to provide for her underage children, and support her children in launching successfully. \n\nInstead, she has no money because she allows your brother to mooch. Now she wants you to support your brother. \n\nLock down your account so she has no access. It’s your money.", "This must be a cultural thing because it’s definitely not the norm in the US which is why you’re getting so much pushback here.", "Then she is almost certainly violating reasonable boundaries all over the place and you have no barometer for what is normal or acceptable behavior.\n\nYou need to make an exit plan. In the meantime, lock down your account - if she's ever had her name on it, close it and open a new one elsewhere. Definitely use a totally different PIN for your card. Take your documents - birth certificate, social security card, ID - and put them in a lockbox in your room. Keep that box locked, and get a lock on your door as well, ideally one that you can lock from the outside.", "There's this thing in the Bible called The Ten Commandments and one of them is Thou Shalt Not Steal.  There is no clause that says \"except from your children because you raised them and that makes it ok.\"   And most everyone learns that by the age of 6.  And if you aren't Christian, every religion has some variation of that basic moral principle, as does common sense if you are Atheist.  \n\nShe knows she is in the wrong.  No magnet in the world is strong enough to fuck up someone's moral compass that badly if they have one at all.  Stop fooling yourself about who your mother is and how she treats you.  She treats you like shit because you allow it.  Stop.  \n\nLockdown your account.  Now.  \n\nWhy are you still sitting here?  You should be changing your PIN!", "The last time I did it I used an ATM.", "You can lock your debit and credit cards at Chase online or the mobile app as well.\n\nSetup alerts for your accounts too.\n\nThere is a link on the website that allows you to request a pin change. I did not click it to see what it takes but it is there.", "Should be able to do this online.", "Why? Fraud occured. Your money was stolen. \n\nFraud protection is a typical service that banks provides.", "She would most likely try to convince you that everyone here is wrong and we don’t understand that’s just how things are done in your family. Or she’ll say that you were sleeping and she didn’t want to wake you. She stole from you regardless of how she tries to excuse it. \n\nYour mom had choices that didn’t include stealing from you. She also decided to give your brother some of your money. You appear to be more upset with your brother when it seems your mom was the ring leader. \n\nI’m a mom. I would never steal from my kids. I have went without to make sure they had everything they needed. It was MY job to provide for my kids and I don’t expect any repayment. \n\nChange your PIN number and never give it to anyone again. Make sure your mom knows that what she did was wrong and she needs to ask you if she needs money. It sounds like you would’ve been fine giving her some money had she ask you. Also, she shouldn’t be taking your money and giving it to your brother or anyone else. Good luck.", "Go into branch and make sure your mom isn’t listed on your account. If she isn’t, change your PIN.\n\nIf she is, make a new account entirely.", "Bad move.", "They stole from you because what \"they needed the money\"\n\nWtf?\n\nEven if the cops cannot do anything right now it will (likely?) scare them and (possibly?) think twice before doing that. Else you could try to have a convo with them about this but personally I don't think it will help.", "This is a mistake. If you charge him interest then you're implicitly saying that you approve of his actions.\n\nIt's like charging parents for being late to pick up their children from daycare - you end up seeing more late pickups because you've turned it from an embarrassing social lapse to a *transaction*.", "So there’s no way they have access to your bank account? They just obtained your debit card and stole it? How did they get the PIN? It sounds like you’re a very trusting person, which I admire, but giving someone unfettered access to your bank account is unfortunately on you. I don’t even give my spouse access to all of my bank accounts and she sleeps with me😂", "Yeah exactly, grow up. You should know the answer to this.", "That is the advice my dude.  Don't let your family treat you like a child. Grow up and demand the respect that growing up entails.\n\nAlso, open up new accounts at a new bank and don't tell your family.", "Thats not an excuse, thats a lie. They knew exactly what they were doing. Get back the gas money and the money your brother has/spent if your not gonna get it from your mother.", "My brother did that to my mom a few years ago and was laughed at by the police when they showed up. (To be fair, he was threatening to hit her and was acting irrationally)", "He is wasting it though. Dude is behind on bills and still chooses to go out every night. (WITH MY MONEY BTW)", "I’m 19. 😅", "If my brother can’t give it back today, I’ll charge him interest. Is that petty?", "I’m 19 and I think I’ll try talking to her about me helping out with rent/utilities. That way, she won’t always be broke. She would have spending money if she didn’t drink so much Pepsi and stopped smoking cigarettes. I need a way to get through to her.", "I’ll check out that link, thank you!", "That’s just not how I do things. Going to the police is the LAST resort.", "It was my only option then.", "I didn’t know they charged parents for late pickups. Does that really not work?", "They know my pin because I told them. You’re right, I trusted them too much. I’ll change the pin. Appreciate the advice.", "You woke up and chose to be the AH today.", "I realized that I’m 100% in the wrong now. I thought that grow up = f**k you. I don’t know where I got that from lol.", "You’re right. She always pays me back. We are almost living paycheck to paycheck right now and it’s almost never a problem when she borrows money. I just don’t like that she’s been taking an extra $20 out every time just so my brother can go out and waste it on some girl. (Bad habit of his)", "And your mother allows him to have your money to do it.", "Sorry, I thought I read somewhere you were 16.  Must have had it crossed with a different post.    \n\n\nSo, as your 19, your mother can make you pay rent, but she so far hasn't.  That's a decision for her to make.  It still doesn't make stealing from you right.", "She also should respect you enough to ask for the money. Her taking it whenever is not really a good thing. But maybe that is how your dynamic works. However, you seem to be okay with your mom taking money and she did and then proceeded to give some to your brother. I think you need to set boundaries with your mom. Cause clearly there needs to be a conversation about who can have access to your money.", "I don’t know the history between the two of you, so it’s hard to say. It might be more effective to just tell him that you expect the money back immediately and that taking it was not acceptable. If he is reasonable, hopefully he will give the money back. If he is not reasonable, I doubt that threatening to charge interest will make him more likely to pay. Your first priority should be securing your bank account so that either way, no one but you has access. If this is a childhood account your mom opened for you, it is definitely time for you to open your own account, preferably with a new bank.", "It’s only petty because interest on $40 is trivial - that’s like 67 cents per month at an outrageously high 20% interest.", "If he stole from you, why would he voluntarily give you more money the next day? Maybe that's how y'all operate but I doubt it. \n\nThis sounds like reoccurring behaviour, I'd threaten to report it to the police.", "Why was it your only option? Weren't you a legal adult already?", "My mom used to steal from me. Then I grew up and realized that it wasn’t fucking ok. There are boundaries. You should not be normalizing this OP.", "She usually asks me, but since I was asleep, she thought she’d take it herself and not wake me up to get it for her.", "I asked for the money back and he just now responded. He says he can’t send the money back because it is cash. I told him to figure it out. 🤷‍♂️", "Interest was not the right word. I’m basically saying I’ll expect something like $30 back instead of the $20.", "I’m starting to think he didn’t take the money. My mom must have taken the money, then gave him some. I’ve been helping him out with gas this week and he has agreed to pay me back with his first paycheck.", "Grown ups don’t insult others that are looking for advice. I’m also not normalizing it, I’m temporarily allowing it due to our current living situation. I’m mostly upset that my brother is using the last of MY hard earned money to take a girl out to eat and not on essentials.\n\nEdit: Grown ups don’t get offended. Sorry gang.", "How would she react if you did that to her next week, after she gets paid? If you just went in her room and took her card and withdrew $100?", "My comment was not an insult, it *was* advice, that echoed what everyone else was saying.", "OP you're NTA to be upset that they took your money but you seem to be oversimplifying shit here and not understanding things.\n\nIf your mom needs or wants money, she has to ASK for it. Unless you have an agreement and she's asking for rent then she can't just fucking take your money by using your card. Not even the fact she birthed you gives her the right to fucking steal from you, mom or not or whatever mental gymnastics you want to use to rationalize it.\n\nHer stealing money, WITH your brother, from you is two people you call family doing the same, equally shitty thing to you. Your brother isn't the only bad guy here but you keep rationalizing it when your MOM is the common denominator since she's done it to him as well.\n\nYou either need to get an agreement for rent/board in place or lock your card up. It was $100.00 this time but what happens the next time? And trust me, there's going to be a next time.", "Your mother stole from you for your brothers benefit and you’re only worried about the $20 he has?", "Honestly, I don’t know.", "Being told to “grow up” is used as an insult ALL THE TIME, so I’m sorry I took it personally. You’re right, it’s not ok and I need to let them know.", "Trust me I know there will be a next time if I don’t say something. I appreciate the comment and I’ll make sure to say something to her when I get off today.", "I’m upset about all of it.", "Wow..overtly sensitive and you need a backbone. Either put an end to them taking your money or shut up about it"]}