{"id": 32501, "submission_id": "18cjqph", "title": "AITA for having the power to my apartment disconnected after being asked to leave", "selftext": "18 months ago I moved into my best friends apartment because she was struggling to pay rent. Having a pretty good income  I payed the majority of the bills including all of the electric, heating, internet food costs and half of rent. I was paying roughly 1800 per month while she was paying $500 per month. 10 months ago my roommates mother moved in with us and the financials didn't change. I was still paying half of rent, all of the electric, heating food for 3 people and internet. Her mother paid NOTHING.\n\nMy roommate met a guy about a month ago (From the other side of the country) and this week they had planned on him coming to stay with us for 2 weeks. I was NOT happy about it. It was clear he didn't like me when we chatted on the phone. I digressed and said whatever.\n\n24 hours before he was set to arrive her mother started an argument with me (Her mother is irrational and rude) after a bit of attempting to appease her, and it not working she told me \"If you have a problem, you can leave\" and I said \"when do you want me to leave\" and she said \"Right now\" so I packed a bag and left. 2 hours later THE POLICE SHOWED UP TO MY PARENTS HOUSE to speak to me about the happenings of the night. Her mom claimed that I made her \"Feel scared\" and demanded a police officer escort me to retrieve my belongings from the apartment.\n\nThe police told me I don't need them there to retrive my stuff and if they try to block me from getting my stuff to call them.\n\nLast night I brought a buddy and a truck and in an hour and a half we moved all my belongings out from the apartment.\n\nToday I called the electric company to have them cancel my electric as I no longer live there. The electric company let me know that they will be shutting off the power to the apartment tomorrow and reminded me that if the pipes weren't full of antifreeze that they might burst.\n\nAITA for not giving my roommates a heads up that they will be shutting off the power?\n\nEdit for clarity - I am not on the lease \n\n\n", "created_utc": 1701911848, "permalink": "/r/AmItheAsshole/comments/18cjqph/aita_for_having_the_power_to_my_apartment/", "score": 3223, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I had the power company disconnect service to my old apartment after being asked to leave\n\n2) I could give my old roommates notice and maybe they wouldn't have to spend 2-3 days without power\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You're not obligated to pay for anyone's power. Plus, her mom filed a false police report in order to try and get you arrested—I think the leniency ship has sailed.", "NTA. But you need to tell the landlord so that he can tell them. Let him know that you moved all of your belongings out of the apartment and are giving up your tenancy. That way, he can't name you in the eviction that is going to happen. Cover your ass from a mark on your record.", "NTA,  but how do you figure that you paying 1800 a month and her paying 500 a month is half?  You were being used. \n\nAs far as her momma goes, that is a case of fuck around and find out. \n\nContact the landlord to give them the heads up, they shouldn't have to incur property damage.", "INFO: Are they somehow under the impression that you will be continuing to pay the bills now that you no longer live there?", "NTA  - they FAFO - however frozen pipes will wreck the place and the property owner will be screwed so you might want to tell them", "Nta, they sound awful. But you need to get off that lease if you are on it, like yesterday.", "100% NTA.. what a bunch of moochers. You were asked to leave therefore you’re no longer responsible for the utilities and such. Don’t forget to cancel the internet and gas, if it’s in your name, or stop auto payments if that’s the case.", "Nta. You don't live their and they are being aholes so I would do the same. Not your fault that they obviously haven't thought about who pays the bills when they kicked you out", "NTA\n\nDon’t forget to cancel the Internet. You may have to go back for the router, depends on the company.", "NTA just tread carefully, you turning up with a big strong man with  scary truck and turning off the water could be claimed as harassment, and the situation twisted against you.\n\nIn my jurisdiction, I would send a letter, through a lawyer, saying for them to not contact you at all and in genuine cases where communication is needed, go through a lawyer, and also notify them you removed yourself from the utilities as you no longer live there. To cover yourself for moving your belongings, confirm that you turned up and removed your belongings \"without issue\" on xx/xx/xx on the advice of police officers \"y\" and \"z\" on xx/xx/xx and advise what to do with anything you left. This gives you a cause of action should you have forgotten something and they chucked it (generally no right to do so across jurisdictions due to torts and legal protection of renters) *and* if they later claim that you were threatening them bringing a big strong man over with a bashed up truck. I see that card being pulled often.", "NTA, WOW the audacity roommates mom. You pay everything an she pays nothing so how dare HER to tell you to get out. She must be planing on helping her child pay all things you where paying.", "NTA for shutting off the power, NTA for not telling them.\n\nThey cast you out, you take your power with you.\n\nAnd when they come crying to you for help, calmly whisper back, \"No.\"", "NTA. The mom got you so fucked up & the fact that your roommate is silent on the matter says a lot. Fuck them. Please update us.", "NTA not very smart of them to push out the person paying the majority of expenses. You were basically told to move out it’s only logical to take your name off the utilities.", "are you on the lease in any way? this could equally fuck you over. i would post on legal advice", "NTA. But do do the right thing and give them a heads up to put it in their name, for the sake of the landlord, if not your former roommates.", "NTA\n\nAt their request, you've moved your things and any utilities provided in your name are a normal part of your things. No notice from you to the former roommate is necessary, or advisable. Your former roommate knows how to turn on utilities in their own name; they took care of their own business before you came along; they'll do so again.", "NTA. sounds like just desserts to me", "NTA they called the cops on you", "NTA, fuck those leeches", "NTA in any way. You don't live there anymore, so you are supposed to turn off any utilities for that place. Given the way you were put out, this should already be expected by them.", "Need an update, please", "NTA - you've been paying more than your share of the expenses and the mom was super irrational and unreasonable in making you get out of the home with no notice. Luckily you had some place you could go. \n\nI suggest you record the activities when you pick up your belongings so that the mom can't make claims that you are being threatening. If you are on the lease, you better get a hold of the apartment complex and let them know that you need off the lease and what occurred so that you held accountable for the rent and any damage that they do after you leave.", "Was the roommate around when their mom kicked you out?", "NTA. OP, please post an update.\n\nI don't think you have to worry about possible harassment. You were living in an apartment which can be verified. You were told to leave immediately. The mother filed a false police report, of which all you did was remove all your property with help. You are no longer obligated to pay for anything in that house, and your only real obligation is to terminate any contracts associated with your name and that address. It should be expected that anything that's in your name would disconnect.\n\nI just wonder what they plan now. OP was paying that vast majority of the bills, they are in for a rude awakening. But with 2, possibly 3 incomes shouldn't be an issue. But the reason you moved in was she was struggling. Maybe now mommy will pick up the slack, or the boyfriend. \n\nJokes are ultimately going to be on them. Just relish in that, and update us!", "Don’t forget to cancel the internet as well.", "👋 I worked at an electric company. You did the smart thing. If they don’t pay & your name is on the bill, you will be on the hook for it. And if it gets disconnected, it will be sent to a collections agency. That could seriously screw you over. NTA at all.", "Tell the landlord about the power cut-off, and you won't be TA.", "NTA for removing yourself from the utilities but you would be if you don't get in touch with the landlord. As the person last on the account you may be held liable.", "Nta- but tell the landlord asap. It could cause serious damage if the pipes freeze.", "NTA and I did a similar move with turning off power without informing the shitty roommates, but during August in Texas. It's extremely satisfying.", "“ friend, your mother asked me to leave so I have left the apartment And she called the police on me…. This, of course means that I will not longer be paying for anything so you need to set up a power account in your name. Make sure you let your mom know that she killed the goose that laid the golden eggs.”", "I’m wondering why you were carrying the useless roommate and her mother and paying for their food.", "I’d turn off everything that had my name on the bill. Electric, gas , internet, etc., so I wouldn’t be responsible for any further charges.", "NTA\n\nBut tell the landlord/property owner that electricity is getting shut off due to you being kicked out of the apartment. Mention the electric company told you about the pipes.", "With the potential to have a lawsuit for damages of frozen pipes bursting, text the ex roommate that you turned off the power since you were kicked out. I would also shut off any other recurring payments you have been covering. Mom called the police because this is an illegal eviction. \n\nNTA. But don’t be an A H to yourself by risking damages you can be sued over.", "I want an update. The blowback your ex roommate and mother fixing to be good. I would keep all evidence and get that police report they called the cops on you just in case they want to sue. And NTA.", "Well, technically speaking, you are kind of the asshole--not for cutting off the power, but for not telling them that the power will be shut off.    \n\n\nWhy:  They're going to scream bloody murder at the power company and make some other schmuck's day miserable while they try to get the power turned back on.    \n\n\nYou should send them a text tonight, letting them know they can expect the power to go off since you're no longer living there and paying the bill.  That way they'll cry and carry on with each other, instead of getting mad at the guy at the power company.", "NTA! But tell them in the morning! For some reason I'm worried bout the pipes bussing!", "NTA\n\n\nAs an aside I think I would also not be happy if my LDR gf was living in an apartment with a guy who seemed happy to lay all her bills. I’d assume things.", "> if the pipes weren't full of antifreeze that they might burst.\n\nInfo: did you mean antifreeze here? Because antifreeze in the pipes would be a bit hard to do... not to mention its toxic if ingested. And I'm sure boiling it would make it worse.", "You don't have to keep paying utilities but you should definitely tell them the date the power is set to shut off.", "NTA but CYA and send a text listing all the utilities you have been paying and are now canceling as of X day so that they can restart in their own name", "NTA for shutting it off, but YTA for not telling them. \n\nAlso, unrelated, but you shouldn’t have antifreeze in your pipes.", "—— I would have given them a heads up. If lack of power contributes to or triggers something bad (frozen pipes, medical equipment that needs power, etc) you are at risk for liability.  They are jerks, but so is no notice on your stunt.  Take a higher road.", "Why not leave as the better person and let them know. Don't sink to their level.", "ESH 99% them", "NTA to the specific question about cutting off the power. Absolutely NTA for closing your account. However, I feel OP will be encroaching Y W B T A territory if you don't warn your (ex) friend as it sounds like it is freezing where you are.", "YTA- not for disconnecting the service, totally the right move, but for not telling them. They would still have to start paying.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n18 months ago I moved into my best friends apartment because she was struggling to pay rent. Having a pretty good income  I payed the majority of the bills including all of the electric, heating, internet and half of rent. 10 months ago my roommates mother moved in with us and the financials didn't change. I was still paying half of rent, all of the electric, heating and internet. Her mother paid NOTHING. \n\n  \nMy roommate met a guy about a month ago (From the other side of the country) and this week they had planned on him coming to stay with us for 2 weeks. I was NOT happy about it. It was clear he didn't like me when we chatted on the phone. I digressed and said whatever. \n\n  \n24 hours before he was set to arrive her mother started an argument with me (Her mother is irrational and rude) after a bit of attempting to appease her, and it not working she told me \"If you have a problem, you can leave\" and I said \"when do you want me to leave\" and she said \"Right now\" so I packed a bag and left. 2 hours later THE POLICE SHOWED UP TO MY PARENTS HOUSE to speak to me about the happenings of the night. Her mom claimed that I made her \"Feel scared\" and demanded a police officer escort me to retrieve my belongings from the apartment. \n\n  \nThe police told me I don't need them there to retrive my stuff and if they try to block me from getting my stuff to call them. \n\n  \nLast night I brought a buddy and a truck and in an hour and a half we moved all my belongings out from the apartment. \n\n  \nToday I called the electric company to have them cancel my electric as I no longer live there. The electric company let me know that they will be shutting off the power to the apartment tomorrow and reminded me that if the pipes weren't full of antifreeze that they might burst. \n\n  \nAITA for not giving my roommates a heads up that they will be shutting off the power? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "This is a play stupid games win stupid prizes situation. I would give the landlord a heads up if you can. But in all honesty it’s still gonna take some time for the electric to be turned on in their name, assuming they have the funds to do so and aren’t currently in arrears with the utility.", "NTA - They kicked you out, it's all on them", "Nta", "INFO: Does your friend know about this situation? If so, what do they have to say about it? Are they blaming you? Yes, then yep shut everything off and let them figure out how to pay rent and electric. Let's see how her new BF like being in a house huddled around a camp fire in the living room to stay warm.  Mommy is in for a surprise when she won't be able to make her morning coffee.  NTA", "NTA. I also hope you terminated your internet account and anything else you were paying for.", "Just tell the landlord.", "Home pipes can’t possibly be full of antifreeze. This doesn’t make any sense.", "Are you on the lease, or subletting?  It’s a violation of many leases not to maintain power and heat because of the risk of burst pipes, so you could get in some trouble with the landlord if you’re on the lease. \n\nHaving said that, NTA for removing yourself from the situation and from financial responsibility.", "NTA\n\nAnd please update when you hear from them", "Nope, NTA! Wouldn't you love to see them when the power goes out? I would.", "NTA\n\nYou weren't given any notice before being asked to leave.\n\n> I payed the majority of the bills including all of the electric, heating, internet\n\nDon't forget to turn off the heating and internet as well. \n\nI wonder when the mother is going to realize that you were the one paying for all that and how she'll react? Post an update.", "So NTA. When a roommate leaves whether on good terms or not to expect them to continue services they were providing after leaving is delusional. This is definitely a FAFO situation.", "NTA. I hope you cancelled everything you were paying for.", "NTA - good for you. Let those jerks learn from this.", "No, they asked for it", "You were never on the lease (per your comment) but you went to the trouble of transferring the electric bill to your name? X doubt", "NTA, good for you!!", "NTA", "NTA you were carrying the household and should have received thanks, not more people crowding in especially with disrespect.", "I call BS.  You don't put antifreeze in the pipes of residential plumbing.", "Antifreeze is extremely toxic. There is no way anyone would put it in their pipes, and no way the power company would suggest they need antifreeze in their pipes.", "No. They should have figured that into the decision to force you out. You owe them nothing. Cut them off. They are not friends, really. Just users, abusers.", "YWBTA if you didn't tell them it was going to happen. You don't have to pay their bill, of course, but not telling them they're going to lose power is something you're doing out of spite.\n\nYeah, they're being assholes to you. Sending them a text message is not going to kill you.\n\nAs mentioned in other replies, though, you've fucked up royally if you're on the lease. If you are on the lease, you need to either figure out how to get off of the lease, or be comfortable being legally liable for the rent.", "You're gonna update us on what happens right? 😂", "NTA\n\nThis is pretty basic adulting behaviour for your (presumably ex-friend).  You have to make sure bills are in your name if you want power.", "NTA\n\nI would've done the same thing. I hope Mom's cold, hungry and bored (without the heating and Internet) but happy now! (I hope you change the wifi password asap). These people sound like users. I think you dodged a big financial bullet getting out when you did.", "NTA and don't forget to get the internet and heat disconnected if that is in your name.  Momma is not going to be happy and neither is the boyfriend who will not have the \"vacation\" he is expecting.  Oh well, not your circus, not your monkeys.  (Did you remember to take all the food you bought? I sure would have!)  Please tell us you are not on the lease.", "Nta they didn’t give u one", "be careful. This sounds like it could be in breach of criminal law. If the utilities are in your name, then that's going to show ownership from the apartment you should consult with a lawyer before doing something that drastic because the damages will be so high and you might be the one stuck paying them.", "I need a update.", "NTA, your friend took advantage of you for months, her mother moved in and not only took advantage of you, but started shit with you repeatedly. \n\nIf anything you should be thankful because now that idiot and her boyfriend/mom have given you the push to stop being used.", "Yeah I agree. Definitely NTA they have every right to turn off the power the moment they leave. It's not their responsibility to pay for anyone else.", "Totally agree regarding leniency ship sailing. Another reason Op shouldn’t contact the roommate is to protect themselves from the police being called again. It wouldn’t surprise me if the roommate’s mom tried to report Op for harassment and more threatening messages if Op have a heads up.", "OP didn't ask whether they should pay for the power - they've already decided not to do that. They asked whether they should tell the former roommate that the power was being shut off.", "Always cover your ass. Are you on the lease? If so, you need to get out of the agreement. Make sure you're not liable for any possible damage, should the pipes freeze.", "I doubt the landlord ever knew OP was living there in the first place. The roommate’s mom and now BF have now moved in.", "If the landlord didn't know about OP living there, she needs to contact them and tell them op was under the impression they knew she was there. Then let them know about the new inhabitants", "I’m inferring the rent was 500 each, but then OP covered pretty much all other expenses, which apparently were about $1300 a month which I could see.", "If the freeloaders thought that OP would continue to pay, it would be a common occurrence, according to what I’ve read on Reddit. \n\nFor example, here at AITA, a woman was mulling over leaving her wife. She learned that her partner thought that Wife #1 should stay, while sleeping on the couch AND continuing to pay all expenses for her and her adult twin daughters. Neither twin was working or going to school.\n\nI’d commented to Wife #1 that her story reminded me powerfully of my brief marriage to a starter husband decades ago. After I moved out less than a year after the wedding, my ex-MIL implored me to set up a schedule that spelled out the days I’d come back to the apartment in order to cook, bake (!), and clean.\n\nAfter I declined politely, my ex’s mother wailed piteously, “That means he won’t know if a hot meal is waiting for him at home!”\n\nI replied, “Uh, that was sort of the point.”", "Yeah, I think is the key. Most leases require that utilities be maintained. You can tell the company you will keep it on thru the weekend, but if no one has taken it over then shut it down. Notify the roommate and the landlord.", "Property owner could sue OP for damages caused by busted pipes, so better give them a heads-up. Informing the former roommates is optional, as the landlord will probably tell them to get the power in their name.", "I don’t think you need to tell them….when they flip a switch and the lights don’t come on, or the furnace doesn’t kick in, they should be able to figure it out rather quick.", "I’m so surprised that they will turn off the power. Where I’m from you have a landlord account on the property so when a tenant closes their account it automatically goes back to charging the landlord. They wouldn’t shut off power unless you had months of non payment.", "NTA\n\nI think you should tell them that you closed the utility accounts.  \n\nHowever, it has been my experience as a landlord that during this time of year that the utility company will rush someone out there to get the electric back on. So it is doubtful the electric would be off for even close to 24 hours, with 24 hours being the max.  \n\nAlso, unless for some reason they're already keeping the house at very very cold temperatures, the house won't cool down enough in 24 hours to freeze the pipes.  Perhaps you live in Canada and it is 0°, I would expect that the electric company's urgency would correspond with the lower temperatures.\n\nThe probable biggest issue is that they might not have what it takes to get the electric turned on. Because sometimes a deposit is required, etc.  But that is not your problem. It is the reason why I would tell them versus waiting for them to experience it. I imagine there are probably ways to get the electric on, what with different services etc, but telling them now could add spice to their fresh shit sandwich versus stealing thunder.", "Thanks for the advice!", "He's already moved the stuff out though?  And he's not thier landlord, he's cancelling the paying off an account. That's not harassment, they know he pays the bill and told him to leave. \n\nThe fact they  tried to involve the police falsely will go against them as they will have record of the call and the hike visit as well as purpose and outcome.", "This is not necessary.", "Never was on the lease!", "There are different kinds of antifreeze for different applications, not all of them are toxic.", "You can just drain the pipes and not use anti-freeze", "It's just for the drains. You just shut off the main and open the fixtures for the supply side of things.", "I just had a relative’s house that’s not in use winterized and the plumber put antifreeze in the pipes. That’s been done many times before and has never caused any problem. It’s drained in warm weather if the house will be occupied.", "Antifreeze is used to winterize pipes  IF they wont be getting used. You see this the most in RVs.  Once they will be used you just drain it and run water to flush they system out. \n\nMain ingredient in antifreeze is ethylene glycol or propylene glycol. Dont remember which.Which im pretty sure. some  processed food has some in it. If i remember fda allows a certain amount. This is due to manufacturing.", "Let the burst pipes be a good learning experience for the former roommates in responsibility!", "[removed]", "It's a rental. The roommate and Mother do not own the apartment. OP, you should report the prospective lack of heating as a potential problem to the management company. Not because you are being nice to the roommate but because you are protecting yourself from any possible intentional ‘acts of vandalism.’\r  \nPlease, OP, call and send a letter or hand deliver a letter. Have the management personnel sign a receipt of the letter. Whatever happens after that point is not your responsibility in any way.  Because we all know if they think they can blame you for any damages that may occur, they will.", "It's a rental. The roommate and Mother do not own the apartment. OP, you should report the prospective lack of heating as a potential problem to the management company. Not because you are being nice to the roommate but because you are protecting yourself from any possible intentional ‘acts of vandalism.’\r  \nPlease, OP, call and send a letter or hand deliver a letter. Have the management personnel sign a receipt of the letter. Whatever happens after that point is not your responsibility in any way.  Because we all know if they think they can blame you for any damages that may occur, they will.", "Read the title homie", "If OP was on the lease, they wouldn’t have left.", "To be fair, he did actually know which days would have a hot meal waiting for him.\n\nNone. None of the days.", ">my ex-MIL implored me to set up a schedule that spelled out the days I’d come back to the apartment in order to cook, bake (!), and clean\n\nthat cant be real", "perhaps they thought someone else was paying the bill?", "I'm not so sure.  Atleast in my state, if you turn off the utilities on a rental, the utility company automatically switches it back to the property owner or property management company.  It will get you evicted, though.", "Yeah, but a lot of people might not think about the pipes in that situation. So the landlord or property manager oughta be notified. and I don't usually say that.", "Yup. It's hard to miss.", "All about negligence and liability.", "We are going to need an update when they realize they have no electricity!", "I need an update tomorrow pls. 😎🍿", "I would send a text stating that you have moved out and effectively immediately, all utilities need to be transferred into someone else’s name, as you have removed your name from all accounts. NTA, but this may cover you from future issues.", "Did you cancel everything and not just power? Make sure the landing doesn't come after you for rent. NTA", "we love to see it", "Did the landlord know you were there and have your name?", "Depending on the laws where you are, that still could have been an illegal eviction. In some states you are considered a legal tenant after you receive mail or have utilities in your name for x number of days/weeks/months, no matter if you were on the lease or not. \n\nCheck into that. You could wind up being able to cut all the utilities that were in your name, then drag them into court for illegally evicting you.", "How can you have it turned off when electric is not under your name, it was already existing either under your friend or her landlord's name before you moved in? \n\nIf it's under your name, it would seem legally reasonable to do so. \n\nIf it's not, be careful you might incur liability (even criminal) for messing with a utility registered under someone else's.", "Yeah that's what I was thinking. My pipes almost freeze every winter and we just leave the tap dripping to keep them from freezing still.", "Well, TIL. \n\nPropylene glycol is safe for consumption, my understanding is ethylene glycol can fuck up your kidneys and pancreas, but I could be misremembering here.", "Read the full post homeslice.", "Read the WHOLE post home. Last line in op.", "I’ve seen dumber", "*Good one!* \n\nAmong many post-move outrages, my ex deposited two bulging duffels of laundry at my new doorstep, without notice. I tripped over them and went flying. \n\nWhen I called to suggest that he should retrieve them, he complained that his laundry was the *least* I could do, since I had access to the household’s washer and dryer. I replied that he had a car for the nine-block hike to his closest laundromat.\n\nUpon collecting his bags, my ex hauled them upstairs to his apartment, and *only there discovered* that the contents had not, in fact, been properly laundered. He promptly called, irate. “You told me to come and get them!” he whined.\n\n“I did. I never said that I’d washed what was inside,” I answered.", "Oh, Redditors, this event absolutely did occur.. \n\nAnd when divorcing him, my attorney successfully squashed my ex’s request for a settlement and alimony. When I left (can’t say “we separated.” I left), I worked for a prominent environmental organization that paid me $11,000 a year, a pathetic salary even forty years ago.", "every US state I have lived in a rental has done this. OP should just double check though.", "Then they'll send the shitty what kind of person does that oh poor me text lol", "Not to mention who'll pay for for everything now that OP's gone.\n\nNTA.\n\nAnd that is SOME VERY nasty petty, OP.  I LURVED it.", "I was wondering that very thing.\nAt what point did OP say to the friend/legal tenant \"let's take your name off the electricity bill and put it in mine?\" And why would OP do that, given that OP wothen be liable for the whole bill/s?\n\nThis doesn't ring true.", "No you are right. I went back to edit it. Ethylene is in antifreeze and propylene is in food processing.", "I've read the full post. Champ.", "I read it. Why does that supercede what it says in the title?", "To be fair, I too often confuse the notion of \"wife\" with \"indentured servant\".\n\nThey clearly sound almost exactly the same. \n\n/s", "He sounds like such a peach. I would love to hear more.", "That should give OP a good laugh 😁", "They lost me at antifreeze in the pipes.", "Also the question at the very end, dollface?", "The subredit is in the form of a question. That question was asked at the bottom of op, after the explanation. The title obviously was worded as such to get more attention.", "I’d grown up as an indentured servant. So having married this guy right after graduating from uni, it took a while—including lots of therapy—to learn that there *should* be a different between a servant and a wife.", "Okay, you’re on. One of the ways by which I was expected to prove my love to my ex was to include his pet boa constrictor in the equation. He had used a coffee can as the starting point of instructing a trap iqthat would catch live mice in the warehouse in which he worked part time.\n\nBy “part time,” I mean that he only worked a couple of days a week. And either the trap wasn’t very effective or the mice were uncharacteristically bright. I became accustomed to the phone call at 5 p.m., asking me to pick up Lillian’s dinner at the pet shop on the way to the commuter bus.\n\nThe warehouse mice *were* smarter. The minute they were placed into the terrarium, they *freaked out* (“OMG, what’s this?!? Where am I?”). By contrast, the big fat lummoxes from the pet store bounced around, oblivious to the fact they no longer occupied one of those takeout boxes with a wire handle.\n\nWhen I left Lillian, I deprived *her* of a “hot meal” as well.", "I missed that bit!", "You monster. Please ma'am may I have some more.\n\nThe balls on this one perplexes me. I have never been blessed to meet someone like him. The petty shit I would do in each of these situations.", "Judging from the outrage expressed by his family, they considered me petty AF.\n\nOh, I didn’t mention that ‘way back then, so-called DIY “turkey-baster babies” had become a thing. I had an infertile BIL and SIL whose eyes were fixed on my flat midsection as they repeatedly begged me to serve as their surrogate. In those mostly pre-IVF years, surrogacy would have required fertilizing my very own egg.\n\nAfter receiving a post-separation letter begging once again for a baby, I replied that I’d “essentially given up” on the possibility of adding any children to the family. The couple seized one last time on the word “essentially.” They replied by return mail (our only pre-Internet option), “You mean *you’d still consider it?!?”*\n\nI replied (again by return mail), “*For G-d’s sake! No!”\n\nAfter one butthurt admonition from them “not to take the Lord’s name in vain,” our rapidfire correspondence ended.", "Wow just wow", "NTA and your best friend is an AH and taking major advantage of you. Her and her mother deserve a lot worse than having to get the power restored. She called the damn POLICE on you!!!", "Cut all the utilites you were paying for ?", "Please update with the aftermath and she is not a friend she is a moucher", "NTA Our first roommate \"handled\" all the rent formour apartment, we'd each give him a check and he would pay the leasing office.\n\nSo we thought.\n\nTurns out he was pocketing the money and not paying rent at all. We learned this when an eviction notice was placed on our door.\n\nMy ex and I quickly found a new apartment and the day we moved out of the old apartment, we took EVERYTHING that we brought with us. Couches, lamps, microwave, EVERYTHING. We didn't even need the couches, so we put them by the dumpster and put a \"free\" sign on them.\n\nWe waited a few days, to lull them into a false sense of security, then we called the power company and had the power shut off to the house.\n\nPetty? Yes\nWorth it? Also, Yes.", "YTA the asshole to the landlord. I would def inform him", "YTA if you *destroy a house* because you're angry.\n\nGive them 2 weeks notice in writing for goodness sake!", "YTA for not giving the heads up, not for shutting off the utilities.", "Umm yes? I seem to be minority here. Obviously they are AH for the way you were treated and calling cops. But you are also AH for not telling them they needed to call electric ASAP to get their name on bill or power would be cut the next day. \nYou are under no obligation to pay for anything for them, but yes you should have warned them what was going to happen. You don’t have to be petty or vindictive just because they treat you horribly, you can be the more mature person.", "YTA for not letting them know this bit of information\n\nbut\n\nNTA for being expected to pay for them all, the mother and the bf can pay for it", "YTA\n\nJust because everyone else is awful doesn't mean you need to be too.", "Soo....as jean24k noted, your name is presumably still on a lease. I assume your lease didn't magically end the moment your roommates kicked you out. Which means, you will have to break your lease. Go to your apt. mgmt. and explain the situation. Ironically, they will not want to let you out of your lease since you were paying the majority of the rent, and they should be rightfully doubtful whether your roommate will pick up the slack. Technically, you should not have moved out until they assumed the lease in full.\n\nIf the apt. management does not allow you to break the lease early, then you should tell your former roommate that she will need to pay the early termination fee, or you will move back in, with police escort if necessary. Most likely, her mom is not on the lease, but legally should be. If she balks, just tell her that you will be informing the apt. management of all the permanent tenants of the apt. They will surely be interested to know about anyone staying there longer than 2 weeks who is not on the lease, as the lease provisions generally limit guest stays in exactly this way. My guess is that her + her mom will not qualify to hold a lease on their own, and they might get kicked out of the apt. entirely. Let her understand these implications fully before she does anything rash.", "NTA, Your house mates got a subsidized home for long enough. It is not your responsibility to keep doing this. They didn't give you any window to move out, so you shouldn't need to warn them.", "Is this story based in the US?", "NTA", "NTAH\nFor everyone saying she needed to contact the landlord,  you are assuming she even knew who the landlord was or how to contact them.\n\nAlso don't worry too much about them having to go without electricity for an extended period. The electric company will turn it on at any time. The only thing is that it will cost them dearly for emergency or after hours service charges.", "Lol! NTA. You had no \"friends\" in this scenario, just people who were using you and abusing you. And they're about to have a very rough reality check without the money, power, internet, rent and food you provided. Be prepared for calls begging for money.", "OP what has your friend said/done about the argument with her mom.  Did she also want you out of the apartment?  Cut off all utilities and the internet ASAP.  Send her a text informing her that since you've moved out everything (utilities and internet) in your name at that address is being cancelled.", "NTA. If you were an asshole, you’d have waited until the 23rd or 24th to make that call.", "NTA for getting it disconnected especially considering how you’ve been treated but I would just give her a last minute heads up it’s getting turned off. Do it in writing by text or email so you have proof. If you wanted to be twisted then I would inform her by email since not many people check their email and you can always show the fact that you did inform them and keep it formal. If they start complain the you can always say you didn’t want to call or text incase you get accused of harassing them.", "NTA, but report the power outage to building management to protect yourself from any blowback.", "Nta get everything that is in your name cancelled etc so they can’t run up bills in your name you don’t want your credit score nosediving \nYou don’t live there anymore so you don’t have an obligation to pay for anything", "Remove everything in your name, NTA", "NTA they would run up your bill even\nMore.  Sitting in the dark and cold might wake them up. Do NOT move back in.  Mom lied to police. Run too many red flags", "Was OP ever on lease?", "Nta for closing your account obviously, so don't downgrade yourself by just not saying anything to them.  You don't owe them, but thats still a crap move.  Avoid the headaches and leave on the high horse.  A simple notification via text or email is enough.", "Don’t forget if you had any streaming services in your name to cancel those as well including the internet if it’s in your name.", "NTA, they sound horrible, let them suffer.", "NTA. You no longer live there, so you were right to cancel the electric power that you've been paying for, and you should cancel heating and internet too. After you were the victim of a false police report and being unceremoniously kicked out, you owe them nothing. But, as a courtesy, you could text them that if they want to continue having those utilities they have to put them under their name and pay for them as of tomorrow. \nYou definitely need to give the property owner a heads up, and also clearly tell the owner (and put it in writing) that you have moved all your belongings out and are officially no longer a tenant.", "I feel I must ask. Several stories on this sub contains crazy sums for bills/rent/restaurant bills and such. \nYou say you payed 1800 dollars per month and she payed 500, that's 2300, which in Sweden is sligtly lower than a regular monthly salary.\nMy rent is 1050 dollars, for a 3room apartment in a nice Stockholm suburb, and then would be lower if we had not gotten renovations.\n\nWhat kind of place did you live where the rent + utilities were 2300 dollars? \n\nAlso NTA at all.", "NTA….but you at least need to let the landlord know.  Your ex friend is renting the property.  So they do not own it.  If the pipes freeze and burst, that is a homeowners nightmare to fix.  Please call the landlord and let them know so they can do something about it.", "NTA\n\nMake sure you've communicated with the landlord/rental office that you were evicted by the other tenants and the date. \n\nYou have a contract with the landlord, your lease, and need to let them know your roommates threw you out. There may be issues about who violated the lease and their (roomie and mom) responsibility to pay all rent and expenses to the end of the lease.", "NTA. If the bills is under your name, then tough shit for them. They’ll need to get it on their own under their own names.", "I did that to my former roommates on a Friday so they had to wait until Monday to get it turned back on.", "NTA!  You were more than generous and helpful, and your best friend and eventually her mother, took advantage of you, big time.   Please post an update on how life is for them after you left.", "NTA", "I would tell them you switched the power out if your name, just to cover yourself", "F them. Don’t look back.", "I would have told the friend.  Last thing you want is some kind of legal liability for pipes freezing.", "NTA\n\nThey brought this disaster on their own heads. That said, you should give the landlord a heads up with what is going on.", "Kinda? I don't know why the electric company would instantly shut the power off, when you just could've told them to take you (and your payment information) off and tell the roommate she need to set up her own payment plan. ESH.", "NTA\n\nYou were doing them a favor for a while. \n\nThey'll have to figure out the bills on their own now. Change your number and redirect all your mail.", "Very stressful for Op, but at least she won't have to live with that horror of a mother. Instant karma for her 'friend'.", "NTA but tell the property owner", "How did your name end up on the electric bill?  How were you able to get the power shut off?  So many questions.", "NTA if they’re not able to work out on their own that the person who paid all of the energy bills was forced out and to check themselves, they deserve everything they’ve got coming. Though tbf they deserve everything they’ve got coming regardless. \n\nTheir ignorance is not your problem 👍", "NTA but you could put yourself in a bad situation if you don’t tell them. \nDoes your friend own the place or rent? Did you sign a contract or are you on the lease?\nIf the pipes burst they might have a case against you for damages. \nYou didn’t mention the roommates part in all of this, but the mother seems unhinged and like someone that would go after you when they realise they don’t have the money to live on their own. \nSo I would advise you to tell them about the power, gather all the evidence of payment and eviction. Because they are coming for you, and that will be a better revenge than having to pay for the consequences of this revenge.\nHope you will update us no matter what you choose to do.", "I have a feeling they think this new fella will take on all the bills it would be so funny if he came and moched of them nit paying anything", "Nta. But you should’ve left as soon as her mom moved in. That was the sign you were being taken advantage of. Good luck and I hope to hear to an update in the future.", "I wonder if the mother realized that OP was paying most of the bills?\n\nIf so she's next level stupid.\n\nI wonder how the roommate reacted to her mother kicking out the bill payer?\n\nNTA", "Where do you live that it is so cold RIGHT NOW that the pipes will burst without antifreeze? (Also, do people put antifreeze in pipes with drinking water? Isn't that...poison?)\n\nThis seems like fiction.", "NTA for not continuing to pay for utilities after you were, imo, kicked out by the mom. \n\nYou would be the AH if you didn't tell someone. Like, text your [former?] friend to tell her she needs to call to get the electricity turned back on.", "If.your not.on the lease, go for it.", "NTA. Don’t forget to have the internet shut down and change the WiFi password.", "I say shoot her a quick text  last minute and move on", "NTA. \n\nChanges in the power, internet, food...are all natural consequences of you no longer living there.  To take these things into consideration is all on their side of the table.", "Make sure the landlord knows you moved out. Cause when they don't pay the rent, you will be responsible. Get you're name off that lease ASAP", "ESH", "NTA\n\nThe mom has burned all bridges and made it very clear that any communication with you isn’t welcome.\n\nSo cancel everything in your name, and don’t bother notifying them - anyone with sense would know that they need to get things in their own name. \n\nIs your name on the lease at all? Make sure you contact your landlord if they have your name at all.", "NTA, although as much as you'd want to burn all bridges, they seem keen on bringing you to justice over this, so better cover your ass. Idk anything about American laws, so I'd say consult a lawyer.\n\nAs for your \"friend\", personally I think she has taken advantage of you over the time you lived with her.", "Sort of YTA but not because they deserve it. Because if the pipes burst it's not them that's going to pay the repairs, but the landlord.", "Nobody in their right mind would expect you to keep paying the bills after they kicked you out and filed a false police report. I am glad to hear that the police believed you.\n\nBeing a nice person, you might warn them that their power will be shut off as of tomorrow and they should consider making arrangements. The warning might save you a bit of additional grief if their pipes freeze. They won't be able to throw that one back at you. \n\nNTA", "As for shutting off the power without giving a heads up, it might come across as a sudden move. While legally you may have the right to do it, consider the practical side. Maybe drop a quick message to your former roommate and her mother, explaining the situation and the reason for shutting off the power. It's a courteous move and avoids unnecessary surprises.", "I noticed a change from “best-friend” before you moved in to “roommate” after. Things happen, and having your income taken advantage of for so long can certainly cause a falling out, but I want to make sure: you no longer want to be friends with your former roommate and best-friend, right? Because while you’re NTA here, you’re definitely ending a friendship (or *at least* acknowledging it has ended) by not informing her. The mother deserves to be surprised by a lack of heat, lights, and internet.", "YTA for not giving them a heads up that they're shutting off power. The whole situation is ridiculous and you're not at fault, but don't be an extra jerk on top of it. It's a 20 second text and block situation.", "Did you cancel everything else is your name?", "The mother gained a valuable lesson in FAFO", "[removed]", "[removed]", " Are they somehow under the impression that you will be continuing to pay the bills now that you no longer live there?", "Yep, call the cops? Fuck them….wonder how they will afford all the income OP was spending on them", "No moral obligation, but know that if you don't you won't have any relationship with your friend (?) in the future.\n\nYour call, but NTA", "You don't know if she felt scared or not", "OP should make sure to turn off the internet and any subscriptions they may have had (Netflix, HULU, etc.)", "Not really. Usually landlords have to keep a backup electricity account in case this happens, it’s turned on at almost double the rate for regular accounts. Turning off the electricity is part of the lease and if you, the original signer breaks it, she breaks the lease.", "OP will be screwed if the pipes burst and he's on the lease.", "I think they'll notice when nothing works.", "She said she was never on it", "Landlord probably didn’t know op or mom lives there", "OP was never on lease", "Yes", "Radiators.", "This is my perspective as well!", ">but for not telling them that the power will be shut off.    \n\nWhy would they assume OP would continue to have the account after being forced to leave? They don't need to be told, basic logic and common sense would tell them any utilities in OP's name would be shut off.", ">Why not leave as the better person\n\nNo one ever tells the abuser this, it is always the victim that gets told to \"be the better person\". It's bullshit, and nothing OP did makes them as bad as their abuser.", ">But you are also AH for not telling them they needed to call electric ASAP\n\nI mean, if I locked out and called the cops on the person whose name is the electric bill I would know I should call and start my own account. It isn't on OP to explain basics of renting a home to the others.", "sod that .They tried to get OP arrested .  Petty vengeance is sometimes warranted", "So what? Treat them with kindness when they treat u like shit? No that’s how you become a doormat. I hope nobody takes ur advice", "OP said he/she isn’t on the lease", "Rent on the coasts can be very high. I have a friend who lives in California and her rent is almost 3k a month for a one bedroom apartment.", "> I payed the majority of the bills including all of the electric, heating, internet food costs and half of rent.\n\nI hope OP cancelled the gas for heating, service for internet and deactivated any shared accounts for groceries/streaming services etc.", "I'd also turn off other utilities in your name...trash, water, gas, Internet, etc, etc.  if you have renters insurance cancel it....and if the apt asked you to carry it please let them know it is no longer valid and you do not live there.  Plus look for other bills like cable tv, alarm systems, food delivery services, and other services which might have been used.\n\nRegardless of the renters insurance situation, I'd let the apt complex know just in case.  Oh yeah, file a change of address with post office and be careful not to move the entire household.  ;)", "[removed]", "That’s not the question, the question is about letting them know the power is going to be shut off. And yeah they’re the asshole especially if it’s somewhere cold enough that the pipes might burst.", "Thank you! And honestly? They SHOULD give the roommate a heads up. \"These people treated me badly \\[def not disputing that!!\\] so I made the pipes burst in the apartment they were renting\" isn't as good a look as they seem to think it is. Why don't commenters go to r/revenge if all they want is the satisfaction of OPs sticking it to people? What about the frickin' landlord, what did they do to OP?? **At least tell the landlord, OP.**", "But that's if it's a regular apartment building owned by a corporation.  Where I live we have houses converted to apartments, and the landlords are just regular people who may or may not have setup the utilities properly.\n\nAnd it's possible the electric company will screw up ;) Better that OP covers their butt and notifies the landlord.", ">If it is a commercial rental, the power company does not disconnect. All they do is bill the owner for power usage until a new tenant establishes an account.", "Ok I am sure I’m going to get downvoted because everyone hates landlords. \n\nBut if the pipes freeze it’s someone else’s house, not theirs. They will just leave, which they have to do already. The landlord will be stuck with the damage and may even be able to sue you for it. It doesn’t seem like a good idea and it’s super petty because you are hoping the pipes freeze and burst and are specifically acting (or not acting) to impel it to happen. All it takes is one call to prevent this. You already won. This isn’t “Did They Deserve it”? It’s AITA. So YWBTA", "What about all the other utilities you were paying?", "Please update us!", "If you are on the lease, and you abandon the place, there could be issues. Is the power account in your name? If the account is in your name, all good. If it isn't, a crime has been committed.", "Good deal.  Get anything in your name shut off asap.  The power company will notify landlord power has been cut .  If they can’t get it on in their names they will be moving", "Give us an update after the power gets shut off lol. I’m sure they’re going to be contacting you pretty soon, if they haven’t already. NTA, btw.", "Okay, but this place is inhabited.", "And all the food they'd paid for", " And took the router and modem and all the food as well", "[removed]", "Who do you think will end up paying given former roommates' financial condition? The landlord.", "Tenants  probably thinking all services automatically switch to them. lol", "No, antagonizing the person paying your bills, then kicking them out of the apartment, then calling the police on them, that is being an asshole. The mothers assholeishness negates the necessity of OP giving them a heads up about power loss. That call to police necessitates going no contact ( as soon as possessions are retrieved). Any further contact leads to further abuse, potential legal trouble.", "<<Have the management personnel sign a receipt of the letter.>> I don't disagree with this idea, but was OP even on the lease as a legal tenant?\n\nis Mother on lease or will boyfriend be on lease?  \nI have a feeling that friend has been shady AF.  OP should definitely report situation to management.  If roomie doesn't have permission for all these additional tenants, she may get kicked out which would be the ULTIMATE PETTY.", "I strongly urge you to take this suggestion contact management company", "Take my upvote you rogue.", "My ex-MIL schemed with my ex to extort me for money for the safety of my children while we were splitting up and I was still in the military. He was living with her at the time. Plan was, he abandons my kids at her place and leaves the state. She then called me and said I had a week before I needed to give her money or she was taking the kids to CPS to drop them off.\n\nI got emergency leave a day later and went and got them. They thought I had nowhere for the kids to go, so they thought they'd be able to get \"all my money\". I only know all this because my ex-SIL witnessed the plotting conversation and had a crisis of conscience a year later and told me. \n\nWhen I took my kids back, she got mad that her plan didn't work, and had the audacity to have her sister call me to say I was being ungrateful and spiteful for \"taking the kids away\". I told her that her sister gave me a week and threatened to put my kids in foster care and she stfu. \n\n\nSo yeah, I totally see a MIL thinking someone owed their precious son cooking and cleaning. Some MILs are fuckin wild.", "And the internet.  Have the service at that address suspended.", "She said she wasn’t on lease", "It was in her name and she was never on the lease", "Blocked them!", "I would yes I'm that petty if I paid for it all", "This account is a bot. Please report this comment!", "Yeah potential legal trouble for OP from the property owner as they had the electricity in their name. They’re not just fucking over the mom, but everyone including the property owner. I know your justice boner is rock hard but chill - the very least they have to do is notify the property owner or management company. Of course OP is going to face a lot of legal issues because they assumed responsibility for it when they put it under their name.", "At some point, usually around the first 30 days, on the lease doesn't matter as much because legally the person is a tenant", "If it is a commercial rental, the power company does not disconnect. All they do is bill the owner for power usage until a new tenant establishes an account.", "The mom probably didn't realize how much they relied on OP . Oh well", "If the friend let utilities lapse, OP could have set up a new account at the same address with their name. The utility companies would just assume it's a new tenant.\n\nEdit for grammar.", "Good! They have no one but themselves to blame for all of this.", "As a lawyer, I agree.  The electric company warned OP that the pipes could burst for a reason.  If OP shuts the power off without giving the same warning to her roommate opens up the potential for a claim from the landlord against OP and roommate (joint and severally) if anything bad happens.", "I think the question was asked because if OP was put on the lease then the landlord could hold her partially responsible if the lack of heat causes damage to the apartment.", "Because that's what we decided years ago when we discussed how this sub should work.", "How do you let utilities 'lapse'?\nYou can't.", "The landlord could certainly hold them liable if the pipes burst. The power company explicitly warned them it was a possibility.", "Right, he asked a question at the end. I never disputed that. But he also asked a question in the title. So, the statement \"OP wasn't asking if he was TA for disconnecting the power\" just isn't correct. Not sure why this is so hard for people to grasp.\n\nTo the prompt, \"OP has offered the following explanation for why they might be an asshole,\" OP even answered, \"I had the power company disconnect service to my old apartment after I was asked to leave\" as the first reason why he might be an asshole. It is pretty clear that OP was, in part, asking whether he might be TA for disconnecting the power.", "\"OP has offered the following explanation for why they might be TA: I had the power company disconnect service to my apartment when I was asked to leave.\"\n\nOP, when asked why he might be TA. Read it for yourself.", "I was meaning lapse on payment. You can stop paying the bill. They would eventually shut them off and would require the account to be brought current before turning back on again. Or the OP could set up a new account in their name as if they were a new tenant at that location.", "OP claims they paid the electricity bill since they moved in. If that was the case, their would be no unpaid bill.\n\nAlso, if the friend/tenant had unpaid bills to the point of being under threof having the power cut off, I am sure they would be telling us how they paid that too.", "Your story deserves its own post. Maybe in r/entitledpeople", "Apparently I'm in the minority, but YWBTA if you didn't tell them, and the landlord. They are the assholes for everything else, but setting up a situation where the pipes burst and cause massive damage to the apartment is going to affect the neighbors as well, who have done nothing wrong in this situation, and the landlord is who will be on the hook to fix everything, because they obviously dont have the money to do it or to pay the landlord back.", "I say YTA, because although you are discomforting ex friend, you are risking causing the landlord terrible expensive damage. The landlord didn't hurt you. At the least, landlord should be given a heads-up to protect the situation.", "Mild YTA.  I know you just had a falling out and everything, but this used to be you best friend.  You could have just sent a text saying \"Hey, I'm all moved out and canceled the utilities.  Please dont contact me again\".", "NTA for canceling the power that was in your name, but Y w b T A if you dont tell them. They wanted you gone so you are gone, and your paying for them to live is gone too.", "NTA for cutting the power, but yes, give them a heads up.  Otherwise, you're explicitly moving from 'tying up loose ends' to 'trying to cause major property damage out of spite.'\n\nI don't see anywhere here where your 'best friend' has stopped being your best friend; you seem to have mainly had a problem with her mother.", "YTA for not giving them heads up about electricity being cur (and pipes potebtially bursting as a consequence), bit NTA for leaving and cutting the electricity bill.", "In my area you'd be YTA - you are legally required to inform the occupants before doing anything that could result in frozen pipes regardless of if you are on the lease or not. It is also illegal to knowingly let an occupied dwelling get that cold in winter. This is because in my area it gets dangerously cold all the time. So it depends on where you are located.", "YWBTA off you don't at least give them a heads up you have cut off your account for electric service. Burst pipes can make the place uninhabitable until repairs are made, and can cause other damage to the property when things melt.", "YTA I keep thinking from their perspective they have this intimidating guy living there. Mum doesn’t get along him and feels threatened because this guy is tall or strong or extremely angry or whatever. She asks him to leave. He does but he turns off the electricity and causes the pipe to freeze… without telling anyone… in pettiness due to the argument…\n\nSure you probably don’t think that your height or demeanor is a big deal. Sure you have been paying more than you should and nobody (including you) has addressed it. \n\nDoesn’t make you not the asshole though.", "NTA.  Be sure to block calls from your ex-friend and her mother.  They are gonna be so mad.  Is the internet in your name too?", "your bills and food cost 1300 a month?", "I mean did they expect you to still give them money after they kicked you out? And then for the mom to make up that BS, they don’t deserve anything. They’re adults, let them figure it out", "NTA. But please update us!", ">AITA for not giving my roommates a heads up that they will be shutting off the power?\n\nF 'em", "Would love an update in the coming days.", "NTA!   But we’re going to need an update on this one!", "NTA. Get a new friend.", "NTA.  If I bought it, then it would be on the truck.  Food included.  Internet, power, and gas, all cut off if I footed that bill.  Mom can figure it out and the new guy.  I would never have paid for the mom when she moved in because you were there to help out the roommate, not her family.", "NTA\n\nFAFO", "You should at least tell them since they will have no heat. In fact, you could be held liable if anything happens if you don't give notice. \n\nJust a quick text and then block everyone.", "NTA", "Does your roommate know that her mom kicked you out?   If this is just crazy mom then you should text the roommate to let them know that they will shut off the power.  But if the roommate knows then it is kind of assumed you would not continue to pay.  I get the impression that roommate is not home and may not know.  Glad you got out of this situation.", "You're NTA for ceasing payment on the power. It's a BIT of a rough move to not warn them, but frankly it has me laughing my ass off. I've been taken advantage of by a long string of needy, pushy, and ultimately selfish people. Thinking about that lot sitting in the dark gives me the evil grins.", "Love this!!! Sorry you were living in this but glad you’re out of there snd now they can figure out how to Kay for life.", "Nta because of how your roommate went about things.", "NTA for shutting it off, but give your friend or your landlord the heads up.", "Why did you put up with this for so long?", "YWBTA if you don’t give them notice of intent to turn off power/heat.  \n\nYou are absolutely within your rights to cut it off since you were given zero notice to vacate.  Extricating yourself from the situation is absolutely within your right; shutting off power, knowing it’s likely to lead to burst pipes (property damage) is another level and would make you the AH.\n\nTell “friend” via text or email with a read receipt that you are removing yourself from all accounts related to the property immediately or “as of X time and date”.  I’d even pass along the power company’s caution about frozen pipes.  \n\nIf it’s cold enough for pipes to freeze, they can prolong that by keeping the water running a little bit, but only if they know they need to take action.\n\nWalk away.  Cut all ties.  Don’t be an AH in the process.", "NTA. Give landlord a heads-up since interaction with roommates have involved lying and false police report.  Explain to landlord so he can keep his other tenants hassle free.", "NTA I'm sure there are unique situations but most apartment complexes have an agreement with the utility provider. When A tenant cancels' service, the power is NOT shut off but the account is now the complexes until someone moves in and takes it over.\n\nThe complex needs power to remain on continuously  in the apartment to keep pipes from freezing, clean up and make ready fo the next tenant, showing the apartment to a prospective tenant and security", "Soft YTA.  You're not an AH for not paying anymore, or for having the utilities shut off.  However, you do need to tell at least the landlord.  This is an apartment.  Others might be affected if pipes burst, etc. (I don't know how likely that is to happen, though)", "NTA after her shitty behavior moving people in without notice or without consent, kicking you out without notice and filing false police report - they deserve to sit in the dark. Make sure to cancel everything and block her", "NTA. Seems there are quite a few posts here where people are not valuing the monetary contributions people are making to the household….", "NTA RUN", "NTA - lol keep us posted if the pipes freeze and bust, this could get entertaining!!", "Esh. You should have given them a heads up, especially given the risk of burst pipes. That would cause so much damage. \nYou were treated poorly, but this type of retaliation is equally poor treatment.", "I bet her and her mother are planning on living off the new boyfriends income... because it seems like they won't be able to survive without someone else paying for it. \n\nNTA.", "NTA.  Play stupid games, win stupid prizes.  Hope they enjoy the cold.  And if any other fake reports surface about you, file a counter complaint and get a lawyer.", "NTA, and child, you let that go on too long. First you are paying 75% of the bills for 2, then freeloading Frieda (aka Mom) moves in, next coming down the road is the boyfriend, deadbeat Danny.. Odds are you were going to be footing the bills for everyone.", "NTA.  They didn't give you a heads up on kicking you out or about calling the cops on you. They relied on your compassionate nature thinking you would  just roll over and not take action. They knew what you paid for and I'm hoping they didn't think they would still benefit from those things", "Where I live, the power company will contact the landlord and transfer the power back to the landlord.  I'm sure he will be following up with the tenants.\nThis really embodies the no good deed that goes unpunished saying.", "Up Here, power company cannot shut-off the electricity, government regulations.   \n\n\nThey actually said they are turning the electricity off?", "NTA\n\nYou were paying way more than your fair share yet they didn’t respect you. Whatever happens now is an asshole tax they will have to pay.", "INFO:  If you are not of the lease, then how were you able to have the electricity shut off?  Not on lease means not on utility bills, even if you pay for it.  Also, I've never heard of the electric company just cutting off the power immediately, especially during winter.  Lastly, why would anyone put anti-freeze in water pipes?", "YWBTA if you don't tell them that you shut off the power.  There is no reason for it.  Are you trying to allow the pipes to freeze?  Yeah, they took advantage of you and are AHs, but you also lived there whether you had a lease or not.  Do you really think you should screw around in a way that may cause property damage with blowback on you?  I bet you are not as insulated from liability as you think.\n\nNTA for everything else and if you just send a quick text that you are shutting off the power.", "Let us know what you do!! I’d call the landlord so they know they have to pick up those bills. Most landlords won’t allow tenants to stay without those being on", "INFO: I am assuming your friend already had power before you moved in. Even if you were paying for it, how did you move her existing utilities account to your name? Don't you have to have some evidence to show the power company that you live in at apartment?", "OP should at least let the landlord know, if not the former roommate. But NTA for turning it off.", "Shoot, this is a tough one.   I'm afraid I gotta say yes, YTA if you don't notify them that the power is being shut off tomorrow.   That is an obligation you should discharge.    NTA for the title though - you can shut off the power, I just think you'd be the asshole for not informing them.", "NTA. The mom FAFO. I'd probably post on legal advice just to be safe from the psychopath mother.\n\nUpdate when available please.", "No, and I love this for you, lol.\n\nEdit - Please update this with the reaction, I really need to know the outcome!", "NTA.\n\nWow! You are an awesome friend and insanely generous roommate. And you were insanely used and then tossed like trash. \n\nYou did nothing wrong at all, (In fact, the exceptionally great thing was getting away from any bills to support people who would call the cops on you), but also anytime you privilege someone else to that extent over your own welfare- it's generally not a healthy dynamic. This proved to not be a healthy dynamic and I am so glad you are out and away from all of it.\n\nAnd I would guess...the friend will realize her error and come love-bombing you and begging you to return. Please don't.", "N T A for not paying for their power (per the title) but absolutely YTA per your question in the post about not giving them a heads up, if the pipes have a chance of bursting.\n\nYou don't owe these people any money or anything but regardless of how your relationship was at the end, not even warning them that their apartment might get flooded -- and anyone in any units below them too -- is an AH move. Yes they should expect to pay for it themselves, but power is a pretty important thing that you ought to coordinate the switch-over on.\n\nAt least tell the landlord, if no one else", "INFO: What country do you live in? I have never heard of a company shutting off electric within a day because someone is moving. There is always notice and an aoppotunity to switch the bills or switch to another provider.", "Erm, I get why you're angry at the mother and everything, but you're not just taking it out on her, you're taking it out on your friend too (who wasn't part of the argument and who you had an agreement with). And on the landlord. Pipes freezing and bursting is a major cost, it's pretty unnecessary to cause that. You could have waited a couple of days before shutting things off to allow your friend to figure out the electricity and heating situation. It would have cost you nothing to do so.\n\nESH.", "NTA after what they did screw them. You don't owe them a damn thing.", "NTA the roommate and the mom can go fuck off", "think a little... you're friend brought her rude mother to stay in the apartment knowing full well that you were paying for the majority of the expenses. She brings a boyfriend who's disrespectful to you to stay for two weeks without considering your feelings. SHE LETS HER MOTHER KICK YOU OUT. I would wreck everything in that house, turn off the power myself and throw her clothes out of the window. but thats just me:)", "NTA - They played around. Now they'll see how it worked out for them.", "For shutting off the power, N T A. However, if you don't give them a head's up when it's below freezing you're very much YTA.", "YTA if you *don't* give them a head's up.  \n\nI also have to wonder if there is potential legal ramifications of this.  While you say you are not on the lease, you were paying the electricity.  You were warned, by the company, it could cause the pipes to burst.  And you are failing to notify your (Former) best friend.\n\nAgain, are you TA for shutting it off - no.  Not telling them?  I think that's a mistake.", "YTA.  You are not wrong in wanting to cut off the power, you don’t need to pay for that anymore.  Not giving a heads up because hope that their pipes freeze and they owe tens of thousands in damages would make you TA.", "Good job!", "Nta and please update with the aftermath I'm sure it's going to be good", "You handled it perfectly. NTA", "Nta", "The power, internet, heat, gas, water… whatever bills are in your name there, call & have them turned off. \nChange the Prime/netflix/whatever streaming services you have p/w’s - You no longer live there, you don’t need to pay for anything.", "OP did not ask if they are AH for no longer paying the bills. OP asks if they are the AH for not telling anyone knowing that the pipes will probably burst. That is definitely AH behavior.", "This. OP, show no mercy. I'd also make sure to block them all on everything, and I'd share with any friends what happened, so the story comes from you first.", "The title and final AITA are different. Based on the title, OP is N T A. But they finish off with:\n“ AITA for not giving my roommates a heads up that they will be shutting off the power?”\n\nI think not warning them is a YTA move. OP should absolutely stop paying, they were already going above and beyond. But they should at least send a heads up text like “as Im no longer living there, I canceled the electricity. Better get on that”", "More like power boated away.", "I'll bet the mother didn't know OP was paying everything. She was likely trying to get OP out to get a better room or a room.", ">you turning up with a big strong man with scary truck and turning off the water could be claimed as harassment, and the situation twisted against you.\n\nIs this a sarcasm and I'm not picking up?\n\nBringing a friend and a truck is completely normal. And ending utilities in your name is completely normal. \n\nLiterally nothing there can be twisted. Adding in the fact the cops literally told her they don't need to be there", ">and if they later claim that you were threatening them bringing a big strong man over with a bashed up truck. I see that card being pulled often.\n\nI **don't** believe you. \n\nThis is the most hyper-normal thing to do when you leave a residence. You *move*. It will never have legs as a line of argument. A bad faith actor can try and twist anything, but this is not something they are going to get traction trying to argue. It just *isn't*. No reasonable person is going to find that to be a credible accusation.", "Why would she be there when the water company shuts off the water? Plus it was stated that the electricity was being cut, not water.", "And for the sake of the neighbors in other apartments. 😬", "Exactly", "After her mum got the police involved?", "Antifreeze can be placed in pipes. It is used to winterize a home when no one is living there/ the utility are going to be off for an extended period of time. You then flush it out of the pipes afterwards when they come back into use.", "What’s wrong with spite?", "Seems like a pretty shitty friend to me. I'd still warn about the pipes and bills I wouldn't be covering anymore.", "That’s true, but no power company (in the US at least) shuts off the power as soon as the account is closed. They have a grace period of at least a month, so they can send a notice. Even if they told OP they’re shutting off the power the next day, they won’t be.", "They will know when they flip the switch.", "Are you sure about that?     The title poses a different question than that line at the bottom of the post.\n\nSo which one are we supposed to judge?", "A person like that rarely learns anything that remotely resembles them being wrong.", "It's not about whether she felt scared, it's about whether that fear was reasonable. If someone has a fear of balloons, it would be unreasonable for them to call the police on someone for having balloons.\n\nSure, we don't know if OP is being truthful. But based on OP's version of events, which is the only version we have, it sounds like she's just manipulative—all OP did was pack his bags and leave.", "No, OP did not ask if he was TA for no longer paying bills. He asked if he was TA for having the power disconnected.", "Yes that’s the way it should work. The owner should have  an account that automatically switches on if the tenant leaves or doesn’t pay. \n\nEither way, OP is NTA. The owner should agent taken steps to make sure the property always has coverage. OP isn’t on the lease and no longer lives at the property. OP has no obligation to ensure the utilities stay on or that the transfer is successful.", "States several times \"I am not on the lease\".", "Yes it is. This is what could be claimed by someone malicious to file a false police report and/or defend or make a civil claim. Even if it goes nowhere the whole process can be abusive to live through.", "\\>He's already moved the stuff out though\n\nYou clearly didn't get what I am doing.", "Better safe than sorry, and to be informed that somethings things like this need to be done.", "Account for the utilities", "Yes.  It was the mom that called the cops, not the friend.  Plus it's not a bad thing to send one last text to put closure on the whole thing, considering the past years of friendship.", "Sure, but there are still people living there. \n\nI highly doubt that (a) the power company would immediately shut off power, especially in winter and (b) would give out any suggestions regarding winterizing pipes.", "Not sure where you are getting your info. OP said she moved out. Take the power out of my name. They gave her a shut off date. Who do you think they are informing? As far as they know or care it is unoccupied. I have moved and called the power company and it was shut off that day.", "Plus, it's an apartment. Do the other commenters think broken pipes only affect one unit? I can tell you from experience they don't.", "Agreed, it will cause a lot of damage and that should be avoided.  Otherwise it's being willfully destructive, which isn't laudable.", ">What about the frickin' landlord, what did they do to OP??   \n>  \n>At least tell the landlord, OP.\n\nAnd honestly, for those of us here for the revenge satisfaction, telling the landlord is satisfying too. \n\n\"Hey landlord, I have been living here for 18 months without being on the lease, paying half of the rent and all of the utilities because the tenant was unable to afford rent on her own. The third roommate, who also is not on the lease and pays no rent, kicked me out of the apartment and filed a false police report against me so I have moved out, will not be paying rent, and am cancelling all utilities in my name. You might want to take actions to ensure the pipes don't freeze\"\n\nThen the mooching friend, her mom (who basically swatted OP), and the sketchy boyfriend will all be out on their ass as soon as legally possible (which might be immediately depending on what the lease says about illegal tenants or long-term guests).", "They’re not on the lease so they don’t have a responsibility to the landlord.", "Sadly this be true, at least karma comes round for em in more ways than one", "Oh I’m talking about old brownstones converted to apartments too. At least that’s the practice where I am where not having power during the winter would definitely burst your pipes.", "That is not the case in my jurisdiction, and I think clearly not the case here since the power company openly warned OP about the pipes possibly freezing. That doesn't sound like they intend to switch it to the landlord.", "Yeah that is pretty common and in most areas the utilities company is not permitted to shut anything off in the winter, the bill will rack up for sure but nobody is getting forced through the winter with no heat.", "Cold, hungry, and broke....not a sexy combo. Roommate is gonna be passed at her mom.  I'll bet the lights and gas require a deposit to get cut on. it's gonna cost way more than $1800. Right when the boyfriend is about to show up. Whew.", "Def.!", "OP wasn’t on the lease. Landlord would have to sue the tenant, not OP.\n\nI just want to be a fly on the wall for the conversation roomie probably had with Mom, who likely had no idea OP was paying three-quarters of the freight here.", "She wasn't the tenant. The landlord signed a lease with the tenant she just moved in with her bff (the tenant). If the pipes freeze, it's the tenant's fault because they were supposed to have electricity in their name.", "But the advice was given from the utility company upon being told that the inhabitant left...", "oooh do it the petty married at first sight style... take everything from the pantry, down to the spices.", "How do you cancel the food?", "That's not really OPs problem is it?", "The landlord has insurance and could recoup the money from the roommate and her mom by going to court if the terms of the lease include keeping an active utilities account. The landlord could evict them and deduct the cost from the deposit too.", "A double bonus!!", "Where I live that would be considered negligence by the tenant (failing to get the electricity reconnected and leading to frozen pipes), so the landlord would have to pay for the repairs but could then go after the tenant to recoup the money. Probably unsuccessfully though by the sound of it. Still not OP's problem though.", "It doesn't matter.  If the landlord seeks recoupment of damages, you can bet she is getting sued too.  Would landlord win a judgment against OP?  Hard to say, but exposing oneself to potential legal liability from a third party to get back at two AHs doesn't seem worth it.  Just send a message saying the power is being shut off.  They will get theirs when no one is paying the bills", "Woman in my building racked up 40k in damages flooding out the two units beneath her this spring.    Water heater broke during the night.\n\nSimilar shit happens a couple times a year.", "Oh my gosh, I can't believe I didn't think of this. *Really* good point.", "Haha good point!", "Wow. Are you for real?\n\nThey have a responsibility to their *fellow human beings* (b/c remember there are neighbors too as another commenter pointed out) not to risk causing many thousands of dollars of damage to their property/living space just because they couldn't be bothered to give these people a heads up while they revenged themselves on someone else.\n\nMaybe they don't have a legal responsibility (wouldn't be surprised if some judge decided otherwise if things really went sideways, but I don't know the law that well so maybe not) but thinking that anything legal to do is automatically ethical to do is *messed up*.", "It was kind of you to call him to retrieve his goods rather than dropping them in the trash as abandoned property.", "For reference, $11,000 USD in October 1983 is the same as $33,508.72 in October of this year.", "Ditto for here (MA).  But when I was renter I was told that when I started it stopped utility service I had to tell the gas and electric to transfer it back to the landlord.  The landlords were very specific about that.  But the system you're describing sounds much safer!", "No.  This is not necessarily true.  Landlord may have a claim against OP even without a written lease.  Further, even if the claim against OP isn't a good one, there is little reason for the landlord not to sue all people living in the house.  So, you may not get a judgment, but you still have a court case until you get it dismissed.  It's just an idea with very little upside to it.", "I don't know where that's even a possibility. You can't get any type of utilities turned on in your name here without a lease or mortgage paperwork with your name explicitly on it.", "You don’t have to be added to the lease for the landlord to know you’re living there and have your contact information.", "Not petty at all, sensible!!", "She went and got her stuff. Her stuff is all the food, lol", "By carrying it out of the apartment like all of your other stuff.", "Good luck collecting on a judgment, given their financial condition.", "Pardon my ignorance, but how does one tell that an account is a bot?", "Name wasnt on the lease, so thats not a problem either", "That depends on state/local law, and generally should only affect what it takes to evict the person. The lease is a contract about mutual rights and obligations, to which OP is not a party", ">Water heater broke during the night.\n\nThat happened to me several years ago. Roommate texted me panicking that there was water pouring through the ceiling. The management company had to break into the unit above us to cut it off because they weren't home, and there were fans and dehumidifiers drying our unit out for a week- and that was in fall while it was warm out. Then they had to replace the ceiling, repaint, and treat for mold prevention.\n\nOn another occasion, a urinal got jammed one evening and flooded the entire ground floor of my office building in a matter of hours - we're talking standing water in the offices, and pouring out from under the front door. Tens of thousands of dollars of damage across multiple office suites.\n\nI think people just aren't thinking about, or don't know, how far and fast water damage can easily spread.", "From the looks of things, a lot of commenters haven't thought of it!", ">Maybe they don't have a legal responsibility (wouldn't be surprised if some judge decided otherwise if things really went sideways, but I don't know the law that well so maybe not)\n\nIf my belongings and living space were damaged due to this, you'd best believe I would sue them. Not being on the lease doesn't mean you have no responsibilities or liability if you engage in actions you know are liable to cause harm to innocent parties.", "Relied?", "My point is he has a solid case against the tenant, right up to, \"You have / had additional people living in the residence who are not on the lease,\" which is what directly led to the potential pipe freeze issue.\n\nTo make a case against OP is going to be significantly harder and while a lawyer would tell you to go after any deep pocket you can find, it'll come down to, \"You should have kept paying electricity somewhere you were staying in violation of the lease,\" and that's going to be a very hard sell, particular if it goes to a jury trial and not small claims.", "That’s not an issue where I live", "I was subletting an apartment from a friend once and my name was not on the lease but we put the utilities in my name right away. Eventually we put my name on the lease, but it was a few months before we did it. \n\nNone of the utility companies ever asked me for proof I actually lived there or if I was on the lease and the apartment complex didn't care as long as somebody was paying for it. Maybe it's different in other states/countries but I had absolutely no issues. My dad passed away almost two years ago and we've just never bothered to change the electricity to my mom's name. As long as they're getting paid they do not care.\n\nThere are lots of stories out there of abusive or neglectful parents putting utilities in their kids names and hurting their credit.", "It copies other people's comments. I read this comment further down, as part of a larger comment. So I checked the profile. It has no posts, just comments that are copied from others.", "That would be the case even if not officially on the lease", "2 years ago, had 4 apartments seriously damaged by water.   Super had to go in, and...\n\nNeighbour had died in the shower, toppled and his body cracked the toilet tank.\n\nI didn't know him well, but he was always super nice, would come to me to have me explain various condo rules and stuff (English wasn't his first language)\n\nRIP Van.", "That's for sure...", "What point were you trying to make with this post? Mine? Ok thank you. Now take the L and move on. Maybe don't post just to be a dick next time?", "I hate to break it to you, but 4,000-plus up votes isn't really indicative of an \"L\".  \n\nOP asked if he was TA for having the power disconnected. That's my point. I said he wasn't. I don't understand how that's being a dick—it's literally how this subreddit functions. If anyone is a dick here, it's the people that piggybacked onto my comment claiming that OP didn't ask something that he clearly asked. \n\nI don't even know what point you're trying to make, so I can't answer your question.", "So it's the entire family, huh.", "That’s sweet such a suggestion! One fine day, I’ll learn how to utilize all of my I iPhone functions, including how to link, and how to start a post, not just to comment on the existing posts.", "Both nta and yta. Nta because fuck that living situation. Yta for not telling them, because of the pipes issue.", "Maybe call the land lord and let them know about the pipes. And also mention all the randos living there🤷🏻‍♀️.", "As they are renting and frozen pipes might be an issue, I would give them a heads up. It's going to be the homeowner who will have to deal with damages and it can be a lot.\n\nI know reddit hates landlords, but honestly, most landlords are small time and are just trying to keep their investment safe because they moved or inherited, or bought a second home to fund their retirement or place their parents later when that's an issue.", "Hahahahahaha NTA. People get dumb af about rent and living situations. Good on you getting out", "NTA, as a matter of fact what you did was standard adulting. If they weren't prepared that's their problem.", "NTA  The apartments I've lived at will switch the account from the renter/person being removed from the account and just move it to the apartment management company without disconnecting.", "INFO: Do you want their pipes to burst?\n\nIf that's your intention with this then yeah, I think you're crossing the line so ESH. It's in the same spirit of going over to the place and vandalizing it yourself.\n\nIf you just want to end all contact with them, and you hope they sort out the pipes alright on their own then NTA.", "NTA. Classic case of FAFO. You weren’t on the lease and they were mooching off of you. You needed to make sure you could get power to your new place, so you closed the account you had because your it there anymore. Tragic for them, but it’s what they wanted.", "Don’t forget any and all other bills that you paid. Get your name off of them.\n\nThat being said, I am not sure about Canada, in the U.S. having bills in your name gives you certain rights. Here, they would have been required to give you 30 days notice. Even without your name on the lease.\n\nNTA", "INFO: Are you asking if you are ta for cancelling the power or not informing your roommate, because that's two different things. Tricking her into potentially bursting the pipes is going to land not just her, but the apartment owners but especially your neighbors into some shit that they don't deserve.", "Nta but ywbta if you don’t give us an update about what happens once it’s shut off lmao", "Probably in violation of you lease to not tell your roommates about power being off and would burst pipes.", "Would love to see Mom try to explain this to the now ex-roommate. Why Mom who pays nothing threw out the person paying the lion's share of the bills", "NTA! You did exactly what you should have because they would have let it go until it got disconnected and that would be a bill for you.  Let them figure it out.", "This sub’s verbiage is limiting here: Strictly on whether you’re being an asshole to the mentioned in the post, you’re NTA and I’m formally voting that way.\n\nBut Y T A and I N FO with respect to the landlord if you’re shutting off power without telling anyone.  First, it’s not clear whether you are on any lease or even in a tenant-landlord relationship, or if you were subletting from your former roommate. Second, failing to inform anyone that you are knowingly getting the power cut off *might* put you on the hook if the pipes freeze and cause damage. I would CYA and inform at least the landlord that you’ve moved out, the electric was in your name, and you have consequently cancelled your service as of your move out date. Let the LL deal with your former roommate et al.", "YTA for not TELLING THEM you are having the power shut off, in the winter no less.  Tell them, it is the decent and honorable thing to do.  NTA for shutting off the power and any other bills in your name.", "\"The electric company let me know that they will be shutting off the power to the apartment tomorrow and reminded me that if the pipes weren't full of antifreeze that they might burst. AITA for not giving my roommates a heads up that they will be shutting off the power?\"\n\nIn answer to your question, yes, you would very much be an asshole for doing this. If their pipes burst they would be in a seriously fucked up situation. They took advantage of you on rent, and then they have taken you for granted, and instead of ever standing up for yourself you just let them. And now this incredibly destructive, passive aggressive plan to completely mess up their lives is your answer? You are a person who really needs to learn about ASSERTIVENESS to get your needs met and get treated fairly by others. Just by leaving them without your help will be a shock to them, there is no need to completely tear up the working conditions of their house. ESH", "ESH it would be an asshole thing to to. But it's not like they haven't deserved it.", "Same shit happened to me but with my brother,his gf, and her mom. got out and immediately shut off every bill i payed for gas, water, electric, internet, even changed passwords to my streaming services cause FUCK THEM. They got evicted not even a month later because they couldn't pay rent", "Yes you would be TA if you do not tell her the power will be cut off.", "NTA. and you need to cancel EVERYTHING that is in your name. If the mother is THIS spiteful to create a false police report, I can only imagine what they'd do to rack up those bill and leave you holding the bag otherwise. You don't owe them anything, not even a heads up. You weren't given a heads up about being kicked out. You don't live there, you were mistreated, you don't pay for their shit. Period.", "NTA\n\nYou have been taken advantage of for too long.", "Nta.  They gave you no heads up about moving out when mom told you to move.  You owe them nothing.", "NTA. Don't bite the hand that feeds.", "Not TA, you have every right to do something like that and if your “best friend” is sticking up to her mother then with you she isn’t really your friend and you should move on", "You should give them a heads up in writing to protect yourself from liability if the pipes burst, regardless of who the AH is.", "Please update later. I wanna know the juicy consequences of their actions in detail.", "NTA.  They asked you to leave on the spot.  You left.  You’re not on the leases. You’re DONE.  The sooner you got the power turned off the better and save you the money for the power they’re enjoying. Freezing pipes?  That’s on them with their no power.  Now if you wanted to be petty I wouldn’t blame you & If you could have scheduled the shut off for as late day as possible they would have been no power all night and sure to deal with a poop-storm all night and in the morning!  A little petty pay back for the mom’s BS.", "u/Careless-Place-4414 I'm sorry this is happening to you, and I'm glad you're out of that oiving situation.\n\nNTA:\n\n1. Your best friend and her mom took financial advantage of you for 18 months.\n2. Your best friend exacerbated the situation by trying to move a guy in that she's know for only a month.  I'd bet my next paycheck that he wouldn't have left after two weeks.\n3. Your best friend's mom ordered you out of the apartment.\n4. Your best friend's mom tried to manipulate the police into arresting you.\n\nI agree with everyone who said that shutting off the electricity is where you *start*.  You also payed all of the heating, internet, and food costs, right?  Cut those services off.  If you shared any other services (accounts for ordering groceries, food delivery like Door Dash, Netflix, gaming, anything),  delete their profiles and change your passwords at once.  Oh, and check your credit, in case the mom tries anything shady.  \n\n\nI agree with those saying you should deliver a letter to the landlord company and to your roommate that (a) because you're no longer a resident, you're no longer contributing to the electric bill, and (b) the electric company advised you that when power is shut off on date, there's potential risks that include pipes bursting.", "YTA for not telling them.", "NTA. But you still make some dumb moves here. Shutdown the rest of the bills too. The shared grocery accounts, heating and internet or whatever you haven't mentioned too. And make her mother turn into an absolute bitch and either getting herself arrested or a ruined life", "NTA. The'll figure it out.  \n\n\nPlease, for the love of god, update us tomorrow!", "NTA and I highly doubt the ex-roommate and her mother will keep the electricity off long enough for the pipes to freeze. I may have done the same if I was OP. Also would have cut off any and all other utilities in my name. Why would you pay for their comforts?!?", "I can’t wait for an update lol", "NTA and I hope you cut off everything in your name. Buuuut I need a follow up on their reaction.", "I forgot to add: since it's a rental, I'd inform the landlord. They have a right to know that the power is out because it would cost them, not your roommates. But skip telling the roommates.", "NTA they asked you to leave while they were mooching off of you. BF is about to find out that she will have a turn back on fee and all that money she was saving by not helping out Wow! Better hope she has extra cash and mom will be dipping in her money! Did you turn off anything else in your name hell I’d do the same thing you did. She better hope boyfriend has some cash too he is not mooching off U for 2 weeks or longer bet that was the plan. Need up date??", "yup\n\nforget them", "They are NOT on the lease so no call is needed.", "This is the kind of response that only a Redditor would agree with.", "Makes me wonder if Mom is unaware of the financial arrangement.", "You would use propylene glycol, not ethylene glycol.", "They illegally evicted her and called the police it’s now their problem because she can prove all of that including finical abuse.", "But wouldn’t they kinda know if they kick someone out of their house they will stop paying rent and utilities?", "Isn’t it common sense that if you kick someone out of the house they stop paying rent and utilities?", "The thing is roommate’s Mom called the police on her after they took financial advantage of her lied so it’s on them what happens even in court she could prove they illegally evicted her called lied to police and it’s not her responsibility to warn them after an illegal eviction!", "They illegally evicted her after not paying any bills and called the police with threat of boyfriend coming. It’s on them if the pipes burst!", "Definitely nta", "OP edited and said they were not on the lease.", "\"Hi, Landlord?  My name is ____ and I just wanted to give you my full name and all my contact information in case you want to come after me legally when your real tenant nosedives on her rent or causes damages.  I know you probably don't know much about me right now, so I definitely want to fix that.\"  \n\n(I wouldn't contact the landlord at all.  Just quietly bow out and let the ex-roommate deal with the landlord, which is what the landlord expects)", "Please make sure the manager knows the power is off/ getting turned off, while the ex-roomies may deserve some chaos and flooding the neighbors probably don't.", "assuming people are intelligent is never a good idea", "These people threw him out, knowing he's the major bill payer.  And now you're expecting common sense from them?", "Spite isn't a particularly good justification for damaging things and hurting people. It's just a form of hate.\n\nAnd yes, people having their power go out unknowingly does hurt them.", "If OP were asking about whether or not they should do something in the future, the post would be titled WIBTA.\n\nI understand he asks that at the end of the text, but the post title is \"AITA for disconnecting the power.\" In the summary comment, it says, \"OP has offered the following explanation for why they might be TA,\" and OP answered with the following:\n\n\"I had the power company disconnect service to my old apartment when I was asked to leave.\"\n\nI'm not sure how you believe that *isn't* the question, or at least *a* question.", "The post literally ends with the question ‘AITA for not giving my roommates a heads up that they will be shutting off the power?’ so what the hell are you typing so many words for? \n\nWho the hell cares.", "And the toilet paper. \n\nGo full on Grinch, OP! This is ridiculous. You know OP'd be paying for the boyfriend too.", "Thanks. I *did* warn my ex, though. “Bring your junk to my rented room just once more, and I won’t even  call,” I’d advise,* “I’ll pitch those bags straight into Dumpster,” I advised him.", "Don't forget the light bulbs", "definitely NTA!!! if anyone is living and eating all the food you paid with your own pocket, they need to start paying up as well. ESPECIALLY if they are grown adults. you don’t need to tell these people anything because they took so much advantage of you. maybe tell the landlord you’re cutting the utility bills but your roommates do not deserve any explanations.", "YTA - this post should be in petty revenge. Be the grown up, tell them you’re cutting off the power", "NTA. Take your stuff and go. Roomie should’ve been smarter than to let mom mouth off, much less move it and not contribute anything aside from\nSniping.", "NTA, I think you’ve been more than fair during the past 18 months and you’re not doing anything wrong. Please give and update as I’m dying to know their reactions to this.", "Absolutely NTA - your friend and her mother having been taking advantage of you to an absolutely wild degree since the day you moved in. You were paying *all* of the bills, on top of your half of the rent and *all* of the groceries. *AND YOU WEREN’T EVEN ON THE LEASE*. Frankly, your former roommates sound like horrible people, and it’s not like they’re going to freeze. It will take them 15 minutes to call the power company, open an account in their name, and have it turned back on. They’ll be fine.", "OMG I need an update.\n\nNTA", "If they contact you please let us know! Reddit loves Updates and Drama!", "YWBTA for not informing someone that the pipes could freeze. Just call the landlord. NTA for moving and taking things out of your name.", "You might do the landlord a solid and let him know so he doesn't end up with a house full of broken pipes. He can fill it with antifreeze. He isn't the problem and it's a bit unfair to him. \n\nHe can then evict the mother and anyone else living there as I doubt the mother is on the lease.", "Any half decent landlord should have set it up with the utilities to keep service going when a tenant leaves. It honestly might not even end up shut off, they may just have to tell the person who has service currently that it will be shut off even though it would just flip back to the landlord. However if that's the case here the roommate is going to have an awkward conversation when they are still living there and the landlord receives a bill for the electricity.", "Maybe they can start sponging off him since they're so good at it.", "I'm sure that will be a great comfort to the families forced out of their homes right before Christmas. Especially after any of their Christmas presents that might be getting hid in closets get destroyed.\n\nI swear, AITA has the absolute most selfish, reckless and inconsiderate assholes as posters.  Don't give a flying fuck for anyone.", "I cancel food at least once a day. Sometimes more often depending on what I eat.", "Wouldn't that be expel :-)"]}