{"id": 32539, "submission_id": "18cwm7h", "title": "AITA for not wanting to reconnect with my sister after she almost ruined my wedding day?", "selftext": "My sister (23F) and I (26F) have a complicated relationship. Our parents divorced when we were young, and we lived with our narcissistic mother until I left to stay with my dad at age 16, her staying with our mom, whom I’m now no contact with. \n\nWe went through a lot together in childhood, and were there for each other when our mom was abusive. However as we grew up, we bickered like normal sisters do throughout our teenage years, except it would get intense at times and we would yell at each other and get into some nasty fights. It goes without saying that we had trauma, and I was our mom’s scapegoat while she was the golden child. \n\nIn our adult life over the past 5-6 years, I’ve shown only compassion and kindness towards her, even when I wouldn’t agree with a lot of her bad decisions and lifestyle choices. She’s also done morally questionable things for money (she’s been arrested, had DUI’s, is a dancer at a club, has OnlyFans, dates married “sugar daddies”, etc). Despite all of that, I didn’t judge her. I can see that our childhood trauma had a negative impact on her, and she very clearly has mental illness, which I believe she’s at least aware of. Our relationship hasn’t been super close, as we are COMPLETE opposites, but in general it’s been okay. I’ve always invited her to my boyfriend’s family’s events, etc but have always walked on eggshells around her because that’s how short tempered and unstable she is.\n\nFast forward to my wedding this April. She arrives very late, completely missing the ceremony and almost misses photos. I notice she seems “out of it”, and my first instinct is she’s already drunk or something, but I let it slide. I don’t even show my frustration towards her.\n\nLater in the evening during the reception, someone lets me know that my now-MIL and other family members saw my sister snorting cocaine or some other drug right next to the bar. Obviously embarrassed, I try not to let it bother me, and continue on with my big day. Then, an hour or so later, I find out she’s had a mental breakdown in the bathroom and our other sister (half sister) has to take her home.\n\nLater that evening once my now-husband and I arrive at our cabin for the night, I see multiple nonsensical texts from her consisting of very hateful, toxic things such as I’ve always tried to look better than her ever since we were kids, I’ve always put her down, and she doesn’t want to be in my life anymore because it “feels wrong”.\n\nIt upset me deeply that night, and never texted her back. She texted me last night for the first time since April, saying “can we talk soon? Hope you’re doing okay”. \n\nTruthfully, I don’t know if I want to talk to her. I simply don’t know what to say. I don’t know if I want to reconnect with her. She’s very toxic, and while I know she has mental illness and have felt bad for her over the past few years, and although I do love her, I feel the need to protect myself. \n\nAITA? What would you do? I haven’t responded to her text.", "created_utc": 1701958867, "permalink": "/r/AmItheAsshole/comments/18cwm7h/aita_for_not_wanting_to_reconnect_with_my_sister/", "score": 71, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m afraid that not responding to my estranged, toxic sibling’s request to talk might make me look like the asshole. She almost ruined my wedding and has brought me nothing but grief the last few years of our adult life.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You do not have to ever respond or you can just say no. You have the right to protect yourself. It just depends on if you are in a place where you can handle being in contact without a negative impact on you.", "NTA.\n\nThe best part about growing up is the fact that you get to choose your family. \n\nNow that being said, it's clear throughout this post that you do have love for your sister, so if you *do* want her to be a part of your life, then it's probably key that you set firm boundaries for that relationship which might include, but is not limited to, getting mental health treatment and getting off drugs.", "NTA. Don't respond. This is the cycle, and nothing you do can ever change it:\n\nwalking on eggshells to keep her happy.... then toxicity, hate, ruins your plans.... then silence for months.... then the reconnection attempt...  repeat and repeat", "NTA  if you don't want to. If it were me, I would. I would say, \"Honestly,  I'm not doing okay. You showed up to my wedding high. You did coke at the reception. You had to be taken home by [name] because you were such a mess. Then you send me all these nasty texts.  \n\nIf you want a relationship with me, you need to clean up your act, get help, and get into rehab. THEN we can talk. Send me a letter when you're clean and sober. \"\n\nSee what her response is, then block her if it's more toxicity.\n\nBut that's me. You are completely justified if you're already at your last straw and want to block her now.", "NTA\n\nI personally would respond and say that I hope she’s doing better but that I still feel hurt and do not feel ready to have a discussion. That said, you would not be an AH if you chose not to. That’s just a step I would need to take for my own sense of peace.\n\nI’m glad you still managed to enjoy your wedding night despite your sister’s struggles. I completely understand wanting to protect yourself, and I hope you continue to do so. I hope your sister finds a way to get herself healthy as well. My heart goes out to you both.", "I do not believe you would be an asshole regardless of whether you choose to reconnect or not.", "Nope, break all connected. Trying to help mentally ill people and drug addicted too . Forget  it focus on your husband and your new life.", "NTA\n\nThe answer is very simple. Don't respond and block her on all channels.\n\nWhat she is doing to her self drugs etc is causing whatever Mental issues she is having and are self induced. You are right you need to protect yourself. Steer clear of her.", "NTA - You are under no obligation to accept her apology (if that's even what she has in mind. You have no info at this point).  Sometimes family does things that just can't be forgiven, and no one is entitled to it just because they say they are really, really sorry.", "NTA, I strongly suspect that nothing good can come from reconnecting with your sister. The information here indicates that she likely has, at minimum, narcissistic traits. Do you really want to find out what she wants from you, because she is contacting you now in order to get something. My first suspicion is that she will offer \"forgiveness\" & '/\"reconciliation\" in exchange for financial favors. I would not respond. Edit to add: A therapist should deal with her issues, not you.", "NTA, her mess is her own, you have no obligation to be drag down with her.", "Nta sis is not your responsibility. When people show you who they are believe them. No matter how she got to this state it is still all on her. Do you really want to bring these emotions and her bad behavior back into your life.", "You are NTA.  If it were me, I would talk to her and see where she is at.  Maybe she is starting to get counseling, help with the trauma, and help with addictions and bad decisions.  If none of this is true and she is just going to continue to lash out and treat you badly, then you can let go and protect yourself moving forward.", "I mean...you can absolutely choose to not respond. This is a perfectly valid choice. But if it were me, I would respond as a way of acknowledging that I'm choosing to not continue putting effort into the relationship. I'd write something like this:\n\n\"Hey thanks for reaching out. I'm not sure I want to talk to you at this point. You still haven't apologized for the way you behaved at mine and Hubby's wedding, and for the things you texted to me that night. I recognize that we have a complicated history, and that we both have trauma, but I was really hurt by what happened. Because of that I feel like I need my space for now. I will reach out to you if anything changes.\"\n\nIf you wanted to add language around what it would take to move past the incident, you should and then mute or silence her texts. \n\nIf she's the golden child though that could open up the door to your mother or others harassing you to \"just get over it\" which you have literally zero obligation to do. Good luck.", "NTA. You can't manage this. It's on her to manage. Nonsensical toxic texts every once in a while from a mentally ill person is one thing, but doing cocaine at your wedding and then having a breakdown in front of your friends and in-laws is a completely different thing. You don't need it in your life.", "NTA.\n\nIf I were in your shoes, I would probably respond, and if the first words she had to say didn't include massive apologies and indications that she's getting real help, I would then tell her that I have no interest in maintaining contact until both of those things are true.\n\nIf she gets mad and starts raging, then you know it's time to just block and move on. (And this is the most likely outcome.)\n\nIf she says \"I understand\" and then goes away until she's sought help, then I'd leave the line of communication available for her to use once she's taken the steps she needs.\n\nHowever, that's all what *I* would do. *You* are under no obligation to give her that additional chance. You would be perfectly within your rights to just cut contact and move on now.", ">She’s also done morally questionable things for money (she’s been arrested, had DUI’s, is a dancer at a club, has OnlyFans, dates married “sugar daddies”, etc). *Despite all of that, I didn’t judge her.* \n\nI guess I think that deep down, this is probably false. You judge her a little for her life choices. \n\nNTA, but don't lie to yourself.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy sister (23F) and I (26F) have a complicated relationship. Our parents divorced when we were young, and we lived with our narcissistic mother until I left to stay with my dad at age 16, her staying with our mom, whom I’m now no contact with. \n\nWe went through a lot together in childhood, and were there for each other when our mom was abusive. However as we grew up, we bickered like normal sisters do throughout our teenage years, except it would get intense at times and we would yell at each other and get into some nasty fights. It goes without saying that we had trauma, and I was our mom’s scapegoat while she was the golden child. \n\nIn our adult life over the past 5-6 years, I’ve shown only compassion and kindness towards her, even when I wouldn’t agree with a lot of her bad decisions and lifestyle choices and has done morally questionable things for money (she’s been arrested, had DUI’s, is a dancer at a club, has OnlyFans, dates married “sugar daddies”, etc). I can see that our childhood trauma had a negative impact on her, and she very clearly has mental illness, which I believe she’s at least aware of. Our relationship hasn’t been super close, as we are COMPLETE opposites, but in general it’s been okay. I’ve always invited her to my boyfriend’s family’s events, etc but have always walked on eggshells around her because that’s how short tempered and unstable she is.\n\nFast forward to my wedding this April. She arrives very late, completely missing the ceremony and and almost misses photos, seems “out of it”, and my first instinct is she’s already drunk or something, but I let it slide. I don’t even show my frustration towards her.\n\nLater in the evening during the reception, someone lets me know that my now-MIL and other family members saw my sister snorting cocaine or some other drug right next to the bar. Obviously embarrassed, I try not to let it bother me, and continue on with my big day. Then, an hour or so later, I find out she’s had a mental breakdown in the bathroom and our other sister (half sister) has to take her home.\n\nLater that evening once my now-husband and I arrive at our cabin for the night, I see MULTIPLE texts from her consisting of very hateful, toxic things such as I’ve always tried to look better than her ever since we were kids, I’ve always put her down, and she doesn’t want to be in my life anymore because it “feels wrong”.\n\nIt upset me deeply that night, and never texted her back. She texted me last night for the first time since April, saying “can we talk soon? Hope you’re doing okay”. \n\nTruthfully, I don’t know if I want to talk to her. I simply don’t know what to say. I don’t know if I want to reconnect with her. She’s very toxic, and while I know she has mental illness and have felt bad for her over the past few years, I want to protect myself too. \n\nAITA? What would you do? I haven’t responded to her text.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA stay away from her", "NTA for not answering. But maybe tell her: 'yes I'm doing okay. Hope you are fine too. But I don't want to talk to you anymore'", "She might have started getting help, and usually an early step is apologizing to those that you wronged. You don't owe her forgiveness, but maybe see if she's trying to fix herself and trying to apologize to you.", "NTA drop that trainwreck from your life. She is just like your asshole mother. You don't need all that in your life.", "Nta, you need to put your mental health always first, if i was in your situation the only way i would talk to her is if she gets clean and goes to rehab and a psychologist. But you don't have to talk to her, ever, if you don't want to.", "NTA.\n\nYou can go or not. But if you do, be prepared. This could just as equally be about asking money as about repairing the relationship.", "NTA You can love someone, and stillnot have them be a part of your life. Like you said, she's toxic, and you don't need that in your life, nobody does.", "NTA  \nShe's had her chances, why subject yourself to more trauma?", "NTA. As an adult, you get to choose who is in your life.  It’s ok to cut out toxic people or folks that you just don’t like.", "Personally I think it’s ok to judge someone for knowingly dating married men and driving while drunk. \n\nNot so much the sex work, but the other behaviors are worthy of judgement.", "I don’t agree with her choices, sure, but I have not *judged* her for it. If anything, I’ve only worried for her.", "I'm generally on OP's side!\n\nBut she's judging her sister over past choices too! Not just the wedding stuff. \n\n(You can tell she's judging because she included the sex work and not just the DUI/cheating/arrest stuff.)", "Ma'am, everyone judges everyone deep down. \n\nI just think its naïve to say that you're not judging her while listing out her \"morally questionable\" choices.", "Idk I think it’s fair to say I don’t agree with your choices. That doesn’t always imply judgement. \n\nYou can express to someone you care about that you think they are making poor choices without judging them. If OP believes sex work is a poor choice for her sister because of safety concerns or that there are no benefits, retirement plan, social security buy in, and you eventually get less work as you get older because that’s the nature of sex work, well then that’s just saying “logistically this isn’t a good long term plan.” It’s not “sex work is gross and you should be ashamed.” We don’t really know OPs thoughts on it. \n\nWe know sex workers ARE harshly and unfairly judged. But I see nothing in OPs post to indicate she’s participating in that. \n\nMy point was more she SHOULD judge her for the DUI and willful cheating lol"]}