{"id": 32586, "submission_id": "18dktxx", "title": "AITA for embarrassing my nephew?", "selftext": "English is not my first language.\n\nI teach boxing and my best student is my daughter(16) she can easily kick anyone's ass and she even once won against me(though in my defence I was sick that day lol)\n\nAlso my daughter is the typical girly girl. She is beautiful, she likes wearing dresses and her favorite color is pink and she is always wearing make up. This has made many people to understimate her because for some reason people don't think such a girly girl is capable of boxing. My daughter is also not one to brag so people don't know how good she actually is\n\nI have a nephew(17) who started boxing about 6 months ago and a few days ago he and a few of his friends decided to come to my gym and I started teaching them.\n\nYesterday I saw them making fun of the girls in the gym and telling them things like \"why don't you try cooking or knitting instead\" those girls have recently started boxing so they weren't exactly good at it.\n\nSo I had an idea. I asked my nephew if he would like to have a match against my daughter or maybe he is afraid of losing to a girl. He said ok let's do it.\n\nMy daughter kicked his ass so quickly. She usually holds back against the ones that are not as good as her but this time she didn't.\n\nAfter she was done I laughed and told my nephew that maybe he should try cooking instead and leave these sports to girls. He didn't say anything and just left. Later I received a call from my brother calling me an asshole and telling me what I did was unfair and cruel to embarrass him like that", "created_utc": 1702034848, "permalink": "/r/AmItheAsshole/comments/18dktxx/aita_for_embarrassing_my_nephew/", "score": 71, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole for embarrassing my nephew on purpose because of what he said to the girls\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Hopefully he learned a lesson, and he should be embarrassed but not getting his ass handed to him by a girl but because he was being a misogynistic asshole.", "NTA this is amazing, nephew is an AH and needs to learn some manners and not to judge a book by its cover. Bro should be mad at nephew for what he said (if he told him the truth) and be cool with you teaching him a lesson", "NTA. This was a valuable lesson for him. \n\nLet's hope he's learned his lesson, and that he won't pick up any more sexist BS from his father.", "NTA, hopefully that stops him from automatically stereotyping people, good on your daughter sounds like she needed to vent some frustration on her cousin.", "Nope, NTA.\n\nYou just taught him a great lesson about never underestimating people.", "NTA. Some people need some perspective. \n\nI would also say it’s worth a conversation with nephew. First about his view on women, and then if he’s serious about boxing and would like to become better like his cousin. Could be a nice way to bond as a family.", "NTA. He deserved to be taught a lesson, and it's possible you have steered him toward becoming a man who respects women rather than a chauvinist.", "NTA\n\nBut how hard exactly did your daughter go? \n\n\nI'm all for teaching a lesson and hurting his ego, but not if he was seriously injured afterwards.", "NTA.\n\nYour nephew was being a sexist creep, and you and your daughter taught him a lesson.\n\nYour brother might be the reason why your nephew acts like that - that's one possible reason for his enabling reaction like that.\nAnother possible reason is feeling that any criticism of his children is an attack on his parenting skills.\n\nPS - you DID NOT embarrass your nephew, he did it all to himself.", "NTA, although this whole post sounds like a movie scene so also likely not real.", "NTA he needed that reality check", "NTA, tell your brother to stop raising a misogynist or more people are going to be wanting to fight him.", "NTA. Your nephew accepted a challenge and he lost. I think this was prolly an excellent lesson for him.\n\nNephew and friends were being rude and unkind to the girls.  Simply telling them to stop it with comments might make them quiet when you're around, but in the long run would not have accomplished any permanent changes.\n\nYour brother being upset about things is prolly not good. It seems he sees this only through a sexist lense - boys vs girls, etc.  I bet ur brother wouldn't be calling you if his son was beaten in the ring by another make.", "NTA. Maybe next time your nephew will think twice before letting sexist bullshit out of his mouth 😂", "NTA, but it’s immature.", "NTA. Your brother is. He has raised a disrespectful and misogynistic child. You just helped embarrass the misogynist, as one should.", "Nta sounds like your nephew got what he deserved.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nEnglish is not my first language.\n\nI teach boxing and my best student is my daughter(16) she can easily kick anyone's ass and she even once won against me(though in my defence I was sick that day lol)\n\nAlso my daughter is the typical girly girl. She is beautiful, she likes wearing dresses and her favorite color is pink and she is always wearing make up. This has made many people to understimate her because for some reason people don't think such a girly girl is capable of boxing. My daughter is also not one to brag so people don't know how good she actually is\n\nI have a nephew(17) who started boxing about 6 months ago and a few days ago he and a few of his friends decided to come to my gym and I started teaching them.\n\nYesterday I saw them making fun of the girls in the gym and telling them things like \"why don't you try cooking or knitting instead\" those girls have recently started boxing so they weren't exactly good at it.\n\nSo I had an idea. I asked my nephew if he would like to have a match against my daughter or maybe he is afraid of losing to a girl. He said ok let's do it.\n\nMy daughter kicked his ass so quickly. She usually holds back against the ones that are not as good as her but this time she didn't.\n\nAfter she was done I laughed and told my nephew that maybe he should try cooking instead and leave these sports to girls. He didn't say anything and just left. Later I received a call from my brother calling me an asshole and telling me what I did was unfair and cruel to embarrass him like that\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA hope he will think twice next time", "This was a good laugh lol, yeah you're kinda an asshole but it's perfectly acceptable", "NTA - not even close.\n\nOne of the first lessons you should pick up in combat sports is humility. There is always someone better than you in the gym and everyone was a beginner once. \n\nIt sounds like he would have got a pummelling further down the line anyway, given out by someone other than your daughter. \n\nHe probably have taken it better if it was a male who'd beat him up. It's just his bruised ego reacting. If he's worth anything, he'll eat humble pie and come back ready to train harder and not be so cocky and judgemental in future.", "Nta, nephew literally asked for it", "NTA - your nephew and his pals were being sexist and misogynistic, and you got a girly girl to kick his ass. \n\nBut, all that's going to happen now is your nephew will go to a gym where he *won't* get shown up by a girl.  Long-term lesson would have involved not laughing at him afterwards, but pointing out, man to man, that he got his ass kicked by an expert boxer who's been training far longer than him: that the girls he was making fun of were beginners. That in sports, you don't make fun of people who are less good than you because they're less experienced than you, because if you do, someone *more* experienced is going to come along and kick your ass.\n\nGetting his ass kicked by a girly girl: good first lesson. Your laughing at him and telling him to try cooking instead - bad second lesson.", "NTA. Your brother needs to be told if you have a misogynist for a son and he is shown up by a girl. That's not on you.", "NTA and I’m super proud of your daughter!", "I laughed xD\n\nThis sounds hilarious! And he deserved it. Assuming he can still walk and is not hurt too bad is was Indeed a very good and necessary lesson.", "NTA what a brilliant solution. I hope that took him down a peg.", "He is mad at my nephew he just thinks we didn't handle the situation well. He thinks I should have just made them apologize to the girls or my daughter should have held back a little", "No he wasn't seriously injured", "Yes, because young men being sexist in a gym respond well to admonishment and discussion. /s\n\nSometimes it takes being knocked on your ass. Immature? Sure. Effective? Definitely", "Yeah but it felt good", "Not necessarily.\n\nSometimes that feeling of shame from their actions being reflected back to themselves can let them understand basic empathy.\n\nThe nephew only feels embarrassment because he made his victims feel embarrassed.", "He doesn't deserve to practice the sport if he's going to be nasty to half of the others practicing it just because of their gender", "Well on the bright side the girls he bullied will return to the gym", "He wasn’t “acting shitty”. He was bullying girls based on their gender. Pure misogyny. He got what he deserved and learned a hard lesson in the process.", "was nephew black and blue after that fight?", "Honestly, I think that was the route you should've gone first. Because here's a factor you might not have considered: Now that she's done to your nephew, what's to stop your daughter from giving him a hard time about it from now? \n\nI only say this because I have several teenage nieces and nephews. Most of whom wouldn't hesitate to act that way themselves.", "Lol then definitely not the asshole", "Neph wasn’t forced, he was willing, & I bet he won’t be so quick to judge a girl next time. 😊 NTA!!", "You’re an adult. Teaching children.", "All that matters", "A little", "And it was a valuable lesson.\n\nEdit: Not all lessons are readily accepted. Some are harsh and born of adverse experiences.", "I love a story with a happy ending!", "This lesson was “a girl who grew up in a boxing ring can beat me” not “even if a girl isn’t as good at you as boxing they are humans and should be respected”"]}