{"id": 32591, "submission_id": "18diggf", "title": "AITA for Calling out my Coworker in front of everyone?", "selftext": "I F 27 recently started working at a company with a casual dress code, which was confirmed during my interview. However, upon joining, I noticed that my colleagues had a slightly more formal interpretation of casual attire. This made me feel a bit underdressed, even though my managers were dressed similarly to me. During lunch, a coworker F40s confronted me in front of everyone, suggesting that I should dress more appropriately for work. I was taken aback by her audacity and her implication that I lacked common sense. Not wanting to cause trouble, I simply acknowledged her comment and continued with my day. However, during my onboarding process, I confirmed the dress code again with my manager, highlighting the discrepancy in dress styles. They reassured me that the dress code was indeed casual and that there were no strict enforcement measures in place.\n\nThe following day, I decided to wear black pants and a turtleneck, as it was a bit chilly in the office. The same coworker made some remarks, but I brushed them off with a lighthearted response. These interactions continued for weeks, with her suggesting brands and making comments about my appearance. I would respond with explanations about limited options for curvy individuals or it was simply out my budget.\n\nWhile these interactions didn't initially bother me, they eventually crossed a line. One day, she approached me with a flyer for a local gym, assuming that I needed to lose weight. I politely declined, mentioning that I was already a member of another gym and offered to recommend a friend instead. This seemed to disappoint her, but she let it go.\n\nDuring lunch, a coworker pulled me aside and commended me for not giving in to the pressure. He revealed that the company used to have a business attire policy, which this particular coworker still adhered to. He explained that most people had given in to her pressure when the dress code changed, but I had chosen to stand my ground.  \nThis conversation sparked a sense of empowerment within me. From that day forward, I decided to overdress for work. Unbeknownst to my coworker, I had previously worked as a secretary for a major fashion brand and still had a collection of high-quality clothes that were tailored to my body. I saw no reason to let them go to waste. The satisfaction I felt when I saw her reaction to my impeccable attire was undeniable.  \nOf course, she made a remark, questioning why I was dressed so formally in a casual work environment. I responded by reminding her that dressing appropriately for work is common sense. I made this comment in front of everyone, just as she had done to me. Surprisingly, she never said anything about my attire again, and our other colleagues also started dressing more freely.  \n\n\nWhen I told my friends, some sided with me, however some was saying that I should had pulled her to the side and was A-hole move to say it in front of everyone. AITA?", "created_utc": 1702024387, "permalink": "/r/AmItheAsshole/comments/18diggf/aita_for_calling_out_my_coworker_in_front_of/", "score": 210, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I called my coworker out in front of everyone without pulling her to the side about it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.   Your coworker is just a busybody.  She's just upset that you proved to be a more qualified fashion police officer than her.", "I don’t think you were an AH but as a side comment I think you let this colleague have way too much influence over you.\n\nIn the future, these sorts of things should be nipped in the bud immediately. What I mean by that is your post indicates this colleague of yours was allowed to make ongoing comments to you which you either didn’t respond to or passive aggressively disagreed with.\n\nI think the best thing would have been to simply shut down that line of questioning immediately but professionally. On that first day, I would have said something like “during my interview, dress code was discussed and to my knowledge what I’m wearing is in line with company policy. To be sure, I’ll ask my manager that what I’m wearing today is appropriate. However, I would also like to point out that if my attire is at any point unsatisfactory then it is for the management / manager, not you, to point out.”\n\nIn my opinion, by dressing in your nicest clothes, I know you think you’ve shown up this colleague of yours but to me that just says how much of an impact they had on you that you felt the need to make a demonstration like that.", "NTA awesome comeback xD i would've just kept referring to the dress code being casual instead of giving her excuses, it's not like you went to work in pyjamas or only underwear", "isn't there a rule about revenge stories", "NTA-She tried to enforce rules that existed only in her mind and you didn’t let yourself be steamrolled by the office bully good for you.", "Let me see if I’ve got this straight. \nYour colleague publicly berated you for dressing too casually, and after some time you got sick of it, then after a co-worker said good on you for not letting her pressure you, you felt empowered to…dress how your colleague was demanding you dress the whole time? This showing her you did bend to her pressure?\nAnd then you repeated her words back to her? Which is not calling her out, simply making a smart comment. Nta but this story makes no sense", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI F 27 recently started working at a company with a casual dress code, which was confirmed during my interview. However, upon joining, I noticed that my colleagues had a slightly more formal interpretation of casual attire. This made me feel a bit underdressed, even though my managers were dressed similarly to me. During lunch, a coworker F40s confronted me in front of everyone, suggesting that I should dress more appropriately for work. I was taken aback by her audacity and her implication that I lacked common sense. Not wanting to cause trouble, I simply acknowledged her comment and continued with my day. However, during my onboarding process, I confirmed the dress code again with my manager, highlighting the discrepancy in dress styles. They reassured me that the dress code was indeed casual and that there were no strict enforcement measures in place.\n\nThe following day, I decided to wear black pants and a turtleneck, as it was a bit chilly in the office. The same coworker made some remarks, but I brushed them off with a lighthearted response. These interactions continued for weeks, with her suggesting brands and making comments about my appearance. I would respond with explanations about limited options for curvy individuals or it was simply out my budget.\n\nWhile these interactions didn't initially bother me, they eventually crossed a line. One day, she approached me with a flyer for a local gym, assuming that I needed to lose weight. I politely declined, mentioning that I was already a member of another gym and offered to recommend a friend instead. This seemed to disappoint her, but she let it go.\n\nDuring lunch, a coworker pulled me aside and commended me for not giving in to the pressure. He revealed that the company used to have a business attire policy, which this particular coworker still adhered to. He explained that most people had given in to her pressure when the dress code changed, but I had chosen to stand my ground.  \nThis conversation sparked a sense of empowerment within me. From that day forward, I decided to overdress for work. Unbeknownst to my coworker, I had previously worked as a secretary for a major fashion brand and still had a collection of high-quality clothes that were tailored to my body. I saw no reason to let them go to waste. The satisfaction I felt when I saw her reaction to my impeccable attire was undeniable.  \nOf course, she made a remark, questioning why I was dressed so formally in a casual work environment. I responded by reminding her that dressing appropriately for work is common sense. I made this comment in front of everyone, just as she had done to me. Surprisingly, she never said anything about my attire again, and our other colleagues also started dressing more freely.  \n\n\nWhen I told my friends, some sided with me, however some was saying that I should had pulled her to the side and was A-hole move to say it in front of everyone. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA It seems like you found a creative way to address the issue and make a positive change in the workplace attire culture. While calling out your coworker in front of everyone may have been a bit direct, it did lead to a positive outcome for you and others in the office. It's a subjective situation, and opinions may vary, but your intention was to stand up for yourself and establish boundaries.", "NTA - This coworker has never given you that courtesy, and has been attempting to bully you (along with everyone else in the company from the sound of it.)\n\nThis went way past taking her to one side some time ago.", "NTA\n\nSome people have to be put in their place.", "NTA- she tried to shame you in front of everyone, you clapped back to the same audience. Sauce for the goose and all that.", "no no, taste of her own medicine! and you didn't swear at her or anything all you did was repeat what she said to you. Glad you put her in her place. NTA, at all", "Is that fat phobia I smell? NTA", "I totally agree with your comment. Also, by dressing \"up\" so to speak, OP probably inadvertently gave the busybody colleague the idea that she had \"won\" because she was literally doing the exact same thing that the colleague had been pestering her to do. So I'm not sure the lesson was successfully learned. It just seems so childish all round and like you said, why let some nobody occupy space in your mind or tolerate obnoxious behaviour like that for weeks and weeks.", "I totally agree with your comment. Also, by dressing \"up\" so to speak, OP probably inadvertently gave the busybody colleague the idea that she had \"won\" because she was literally doing the exact same thing that the colleague had been pestering her to do. So I'm not sure the lesson was successfully learned. It just seems so childish all round and like you said, why let some nobody occupy space in your mind or tolerate obnoxious behaviour like that for weeks and weeks.", "I see how one would say I was influenced by my colleague but isn't that what happened to everyone in the office? Again, I was never bothered by her passive aggressive comments until she indirectly told me that I am fat. If it kept happening, I would have told her to stop and escalated it accordingly if it did not work.", "Initially, my colleague's comments about my casual attire didn't bother me much. However, things changed when she indirectly made a remark about my weight, which was deeply hurtful. It seemed like she had formed a judgment about me, assuming that I couldn't dress nicely because of my size, and perhaps even pitying me. Up until that point, I had dismissed her behavior as mere boredom and attempts to annoy her coworkers. But her personal attack pushed me to prove her wrong.  \nI wouldn't say that I bent to her will; rather, I wanted to demonstrate that I am more capable than she believed. So, I decided to dress in a way that surpassed her expectations. Also, I did not dress the same as her, I went above that.", "NTA.  She started it in public, you finished it in public.", "NTA. She sounds like a pain in the ass.", "NTA", "NTA And good for you!! But you also should have gone to Human Resources the minute she handed you the gym flyer. She sounds like the typical office busybody, sadly every office has one.", "NTA\n\nI worked at a place with a casual dress code (mostly jeans and nice tops were the rule of thumb), but did take one coworker aside as she was basically dressed in pjs and slippers - she didn't change her dress and I never said anything else. But I am pretty sure that if you are the least dressed, it will get noted and you might be overlooked for potential promotions.\n\nHowever, you were dressed in alignment with management. Your clothes were appropriate and coworker called you out in front of others. She was nothing but mean.", "NTA\n\ni love you.", "NTA. hehe you are rad!! that's the way to deal with a work place bully LOL 😂", "Did everyone clap?", "NTA.\n\nFrankly, I'm surprised your co-worker didn't get written up for harassment.", "NTA. But honestly thats a person you just say “you can relay your concerns to MY direct manager, but they have confirmed I’m within the proper dress code.” Ain’t her business, ain’t her company, woman needs to focus on her work instead.", "I’m surprised everyone didn’t stand up and clap", "I was waiting for the \"and everyone stood up and clapped\"", "As soon as she said anything about your body size and especially after her pushing the gym on you, you should have gone to HR.", "It's natural to be a bit more vigilant, as you have been, at a new workplace. You cleared it with the bosses, stayed polite, and monitored the situation closely. Kudos! NTA.", "NTA. You called out a bully. Bravo! Also, what she had been doing amounts to harassment. Maybe document the incidents.", "Oh hey, it's Andi! Is Miranda on the phone with Versace?", "NTA. Someone should tell your coworker that if you come for the Queen, you best not miss.", "NTA. She commented in front of everyone, why wouldn't you?", "You literally freed a lot of people from her pressure, they needed this to happen like that. Thank you", "I don't think this is the gotcha to your coworker that you seem to think it is."]}