{"id": 32617, "submission_id": "18dj3pz", "title": "AITAH For getting my dead cousin’s cat not know my bf was allergic?", "selftext": "I (26f) and my bf (27m) recently inherited my deceased cousin’s cat, me and my cousin were like sisters we grew up together and did everything together. Last month my cousin got in a bad car accident, I will not go in to much detail but she got hit head on by a drunk driver. Last week was her funeral I ended up taking her cat because it was her first pet and she had him throw out collage and I thought it would be the best thing to do I made sure no one else wanted him and my aunt said she thinks it would be best if I took him because I know him better than anything else. I thought it would be a good idea, that night I messaged my bf to make sure it was ok with him. He said that he would be fine with it, I told him that I will go and pick the cat up tomorrow. The next day I showed up to my apartment with the cat in the back, I walked in the doorway to see my bf standing there with his arms crossed. I asked him if something was wrong and he said that I shouldn’t have taken the cat. I give him a puzzled look and asked what he was talking about because yesterday he was fine with it, he said he only said that just in case one of my family members was looking at my phone. I asked him why he doesn’t want the cat and if there was anything problem. He got mad and said that he was allergic to cat and I should know this, I tell him he has never told me about his allergy and if I knew I would’ve found someone else to take him. He rolled his eyes and left to the bed room, later one of his friends came and picked him up. Now I am left waiting to see if he will come back, I have tried contacting him but I think he blocked me. I don’t know what to do and I feel like a AH.", "created_utc": 1702027293, "permalink": "/r/AmItheAsshole/comments/18dj3pz/aitah_for_getting_my_dead_cousins_cat_not_know_my/", "score": 44, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I am be the AH because I brought home at cat not knowing my bf was allergic to cat\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA you can’t make good decisions if you don’t have all the relevant information, and your bf not only concealed that information, but actively lied when it would have been directly relevant. I think you need to reconsider this relationship.", "NTA, “only said that just in case one of my family members was looking at my phone” wtf?! Sounds like the sussiest sus. If he doesn’t communicate honestly with you that’s on him. Also for him to abruptly leave and not respond when you’re mourning someone close to you, just wow. Good riddance! \n\nEnjoy your new cat!", "NTA. How does he go with I'm fine with you picking the cat up to I'm allergic?? So sorry for your loss.", "NTA, you asked him, he daid it was okay. I don't see how family members seen \"sorry babe, but I'm allergic to cats\" whould be a problem? I think he lacks communication skills and the fact that he blocked you proves that. Keep the cat, ditch the boyfriend", "NTA, for sure.\n\nFirst off, allow me to say, that I'm sorry for your loss.\n\nSecondly, I think your boyfriend saying he only agreed to you getting the cat was in case your family members were looking at your phone to be a little weird. Assuming that even if your family did snoop around your phone, I would think a simple response stating how it might not be a good idea since he is allergic to cats, or something along those lines, should be a decent enough of a response without sounding unreasonable. Also, assuming he was distracted like you responded in the comments, why did he wait to the next day to tell you he didn't actually want you to get the cat because of his allergies?", "NTA, first, Sorry for your loss.\n\nYou literally asked him if he is ok with it, and he said yes.\n\nWhat kind of excuse is that he was afraid someone is looking at your phone? So he cant be honest with you when you are around family? and how is his allergy something that needs to keep hidden from them anyways?\n\nHonestly, I would have probably developed an allergy to him at that moment", "NTA\n\nYou asked him. He agreed. Then got mad that you - *checks notes* - did exactly what he’d agreed to you doing.\n\nSorry for your loss, OP. I hope having the cat brings you some comfort and lovely memories of your cousin.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (26f) and my bf (27m) recently inherited my deceased cousin’s cat, me and my cousin were like sisters we grew up together and did everything together. Last month my cousin got in a bad car accident, I will not go in to much detail but she got hit head on by a drunk driver. Last week was her funeral I ended up taking her cat because it was her first pet and she had him throw out collage and I thought it would be the best thing to do I made sure no one else wanted him and my aunt said she thinks it would be best if I took him because I know him better than anything else. I thought it would be a good idea, that night I messaged my bf to make sure it was ok with him. He said that he would be fine with it, I told him that I will go and pick the cat up tomorrow. The next day I showed up to my apartment with the cat in the back, I walked in the doorway to see my bf standing there with his arms crossed. I asked him if something was wrong and he said that I shouldn’t have taken the cat. I give him a puzzled look and asked what he was talking about because yesterday he was fine with it, he said he only said that just in case one of my family members was looking at my phone. I asked him why he doesn’t want the cat and if there was anything problem. He got mad and said that he was allergic to cat and I should know this, I tell him he has never told me about his allergy and if I knew I would’ve found someone else to take him. He rolled his eyes and left to the bed room, later one of his friends came and picked him up. Now I am left waiting to see if he will come back, I have tried contacting him but I think he blocked me. I don’t know what to do and I feel like a AH.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA he should say he allergic to cat. You not mind reader if he not tell you how you will know it. It looks like your relationship with him is already die just moves on with your life don't feel bad.", "Dude NTA.\n\nYou're dating a sitcom drama-queen! \nAnd by the way the dude is a massive red flag. Yeah, not the behavior, the entire person.", "NTA, but your partner is.", "Holy crap. Your boyfriend lied to you about adopting the cat while you are grieving the recent loss of your dear cousin? Then made a big deal about how you *should have known*, even though he lied and said he was ok with it “in case anyone was looking at your phone”. \n\nWhy the hell are you dating this ************? That is not a loving partner. That is a giant AH in a parade of red flags. \n\nNTA but you would be if you don’t but the whole boyfriend in the bin. \nYou and kitty have some healing to do x", "Your boyfriend is clearly the Alpha in your relationship. if you really loved him you would have gotten rid of the cat. YTA", "YTA \n\n&#x200B;\n\nSure,HE should have answered \"sorry, no - i am allergic\". But you did not even give him time to think. You are the AH for not having a longer PRIVATE discussion and putting your bf on the spot.\n\n&#x200B;\n\n&#x200B;\n\n\" I don’t know what to do\" .. Give the cat back RIGHT NOW. And apologize to your boyfriend, And do better in the future. -- MAYBE that will make your relationship salvageable.\n\n&#x200B;\n\n\"and I feel like a AH.\" .. you are.", "NTA... Question, how long have you been together? Because if it is for more than a few months and if he was truly allergic to cats, you would absolutely know it. Do you have friends with cats that you have gone to their house with him? Why I ask is because if he was really allergic and depending on hoe severe the allergy is, he would at the very least absolutely need to take extra allergy medication to be in their house. At most, he wouldn't be able to go there at all. If you haven't been together long enough for it to come up, than he should ahve communicated it to you the second you asked. Him saying yes, and then freaking out AFTER you have already brought the cat home to the point of leaving and not responding to you is ridiculously immature. Not to mention, you are grieving the loss of someone who is like a sister to you, and this is how he treats you?? \n\nI feel like he may just not like cats and is using this as an excuse. Or he is super selfish, and he is worried all of your attention will be on the cat and not him. Regardless of the reasoning, you really need to consider if you want to continue a relationship with him. If he is treating you like this now through this incredibly hard time in your life, he is giving you a very clear picture of how he is going to act anytime you are struggling and that he definitely won't be there to support you. I would highly recommend cutting your losses and being thankful it ended sooner than later. And in the future, be very weary of anyone who makes your hardships about them.", "I'm really sorry for your loss. \n\nHow long have you been together? Do you live together?\n\nNTA. Thank you for taking in the kitty. Kitty must feel confused and lost without their person.", "NTA. BF shoudl have been honest and told you he was allergic. Even if people were looking over your shoulder at your phone, nobdy would have thought any less of you for not taking cat when partner is allergic!\n\nThat he's acting this way and appears to have blocked you is a concern. You don't need ths BS.\n\nI'm so sorry for your loss. My heart breaks for your cousin's family, too.", "NTA - I don’t understand why he “only said yes in case a family member was looking at your phone”. That doesn’t make sense to me. Sorry for your loss. KEEP the cat, ditch the BF although he may have already made that decision.. OH! One more thing. So his friend picked him up.. does he not have his own car?", "NTA. Dump him. Who makes something like this about him?\n\nYou gave him the opportunity to say no, he didn’t, and now you own a cat. Please don’t get rid of it for his sake!! I was going to say NAH when I thought he just didn’t know ahead of time, but clearly he did… \n\n\ndump him, enjoy the cat, and I’m so sorry about your cousins.", "NTA\n\nHe doesn't get to be mad about it when he told you yes.  He had an opportunity to decline.  At work or not, he could have said we'll talk later, instead of yes.", "He's not allergic to cats or he would have told you long ago. He just doesn't want a cat. He's ghosting you now? Let him keep that up and quit trying to reach him, it gives him a certain satisfaction while he's making this power play. In fact, when he does try to reach out, give him a taste of his own medicine and tell him you need time to think about this relationship going forward....because you do.", "NTA. Kitty is a family. BF can pck his bags.", "I think he is using the cat as a reason to leave. Now he can blame you and play the victim instead of manning up and being honest.  \n\nHe is a tool.  \n\nKeep the cat. Honor your cousin.  Live a good life.  Leave him in rear view mirror.  \n\nNTA", "NTA, I find it strange that your boyfriend didn't bring up his cat allergy when you asked about bringing the cat home. Is he even telling the truth about that?", "Keep the cat, yeet the bf. NTA. The fact that he reacted well \"in case someone was looking at your phone\" is disgusting.", "What the.\n\nSo he said he was fine with it at first, but then he said he didn't want to say over text because a family member might see it? Why would a family member be going through your phone? Why would that even MATTER if a family member saw it?\n\nThis is a red flag.\n\nNTA", "NTA but your \"boyfriend\" (ngl, with this behaviour probably ex soon) is a massive one.\n\nFirst off you are grieving and I am really sorry for what happened. \n\nBut that aside he doesn't get to be mad at something he said was okay and didn't inform you about. He's really overreacting here, which seems kind of odd to me", "He said \"I only said that in case one of your family members was looking at your phone.\" This sentence should be making you question everything. He has clearly told you he cares more about other people's opinions of him than being truthful to you. This is a HUGE red flag. What else will he lie to you about to make himself look like the good guy? What else will he lie about to keep himself in other people's favor?", "This dude is immature. He expected you to instinctively know that he was allergic to cats, and that when he said \"yes\" he really meant \"no\". And then had a tantrum and blamed you. He's not a good partner.", "He tried to make the op into the bad guy as well during a time she just suffered a difficult loss.", "Thank you for your comment, I think he was a little distracted because he was at work", "Only AHs bring pets into their home without carefully discussing all aspects.\n\n&#x200B;\n\nAnd OP was an AH for putting her BF on the spot, and NOT even giving him the chance to think it trough or have a PRIVATE discussion about it.", "Thank you, he was at work when I texted him I been thinking he was just distracted and said yes as a answer so he could get back to work", "exactly. ! There are people other there that are not capable of being open to an pet affection, everything is excuse. and the way he talked to her and his posture says everything. probably he was jealous of sharing the attention ahah", "Bro, reread the post. He lied to her about being ok with her bringing home the cat because her family might be reading her txt messages. The NEXT day told her he wasn't ok with it when she already had the cat. Why didn't he tell her the evening before she brought cat home? Why didn't he txt her he remembered he was allergic and didn't feel comfortable anymore? How is she the asshole for bringing home the cat when he lied?", "We have been together for 6 years but we moved in together a year ago and I have a few friends but he doesn’t talk to them and he isn’t always this, we will get into arguments, but nothing big", "We have dated for 6 years,but we just moved in a year ago", "Good point.", "He is very probably not allergic to cats in any difficult way, since nobody would blame him for mentioning that he is allergic to cats in a text message.\n\nWe can invent a scenario in which he is taught as a child that people will blame you for being allergic to cats, but that probably didn't happen.\n\nKeep the cat, don't let him hurt the cat or leave the cat abandoned.", "Speaking as someone who is allergic to cats, I highly doubt that he was distracted by work so that his allergy “slipped his mind” when you suggested taking in the cat. Anyone with allergies is usually hyper vigilant about their allergen(s) and avoids them. I think he didn’t want to look bad in front of your family. Indeed he told you that when **“he said he only said that just in case one of my family members was looking at my phone”** 🙄. Then when you don’t go along with him and his narrative he starts to [DARVO](https://www.choosingtherapy.com/darvo/) you and strop off in a tantrum . He’s shown you who he is, where his priorities are and where he expects yours to be: him first, always him.  He probably was able to hide his true colours before but it’s really hard to do in times of crisis, you’re experiencing a really hard time and whose feelings does he prioritise?  Sadly not yours, he’s tried to make it all about him so you focus your attention on him and not on your own life. He’s even conditioned you to come up with excuses for his behaviour eg he’s too distracted by work to remember his allergies (so I’m the bad guy)\n\nReally sorry for your loss, keep the cat to remember and honour your cousin, get rid of the guy", "dodge this bullet while he's still just a boyfriend", "I'm so sorry love but there just isn't a reasonable explanation for this. He wasn't 'distracted' if he had time to worry about your family's reaction to him saying 'no'. Best case scenario, where he's telling the truth about his allergy and his motivations, he's shown he's perfectly willing to lie to you, stress you out in a time of grief and ghost you because he doesn't want to 'look bad' to a hypothetical third party. He obviously didn't mind 'looking bad' to you. There's no other scenario that makes him appear any better. There are several where he looks worse, or a lot worse. Keep the cat. Lose the liar. And I am so very sorry for your loss.", "Don't repaint it like that to make it seem like somehow you did anything wrong.  He said he actively lied in case any of your family was seeing the messages (why would they be mad if he said he was allergic??). He ITA, and he punished you for believing him, and for not being psychic.  It's kind of a blessing you're finding out now - people who act like that tend to get worse over time, never better.  \n\n\nI'm sorry for your loss.", "I don't get his reasoning with the phone.  Surely, finding a new home for the cat would involve telling family members why you can't keep it.  Therefore, he didn't keep your family from finding out anything and only made it into a bigger deal than if he said no right away.  So this path leads to more gossip, not less! \n\nThe only way to avoid that is exactly what you should do. Keep the cat and ditch the guy.", "And you put him on the spot and did not give him the time to think it through. What an AH way to treat your partner.\n\n&#x200B;\n\nDon'T kid yourself. YOU Are the AH here. Bringing a pet into a home would need two CLEAR and thought out yeses, and discussions about the live with a pet. A pet has a MASSIVE impact on your life.\n\n&#x200B;\n\nAnd: since your partner is allergic, he will NEED to move out (or have you move out) - being exposed to cats when allergic can (and often does) lead to asthma and worse - so he SIMPLY CAN NOT live with a cat withourt risking his health.\n\n&#x200B;\n\nSo: If you are lucky, you still can decide between your relationship and the new pet you got for yourself.", "He should have been honest with her despite feeling uncomfortable. She clearly didn't mean to put him on the spot.", "Stop trying to think of excuses for him. He could have just not replied or said he’ll respond later. He didn’t have to say yes to agreeing to let a cat he’s “allergic to” live in your home. He clearly is just backtracking on his previous agreement", "He admitted that he was lying when he said he was fine with it.\n\n\"he said he only said that just in case one of my family members was looking at my phone.  \" \n\nEither he wants to break up, or he's playing some other game.  This is a big red flag..\n\nNTA", "So he either lied because family might have been watching or he was blowing you off so you wouldn’t bother him. Which lie do you believe?", "So normally, I agree about seriously considering pets, but I don't think he was really put on the spot? His excuse that her family might be looking at his phone is really odd unless there's more info that we don't have.", "But she did DO it.\n\n&#x200B;\n\nShe can correct that by giving back the cat at once.", "\"I would love to take the cat, but I have to ask my bf first. Give me 5 minutes while I wirte him\" ... OF COURSE that is putting the BF on the spot.\n\n&#x200B;\n\n&#x200B;\n\nEverything but I will have to think about it. let's talk tomorrow\" does.", "She checked with him and he wasn't honest. What is hard about mentioning an allergy? That is the easiest reason to not have a cat. I understand being distracted. But once he realized his mistake, he should have called her back. This not a hard conversation. Just say, this can't be a permanent solution because of my allergy. Done."]}