{"id": 32620, "submission_id": "18dt6n5", "title": "AITA for laying down the law with my daughter?", "selftext": "I (M44) have a daughter named Jamie (F14) with my ex-wife Miranda (F43). Miranda and I have been divorced for the past six years and she's had primary custody since then, but I have generous visitation rights and custody on weekends and one week a month (so I get Jamie about 40% of the time.) Jamie and I have a great relationship in spite of the divorce, but things haven't been as easy for the last few months after my girlfriend Brooke (F36) moved in with me. Brooke and Jamie don't always get along, which I expected, but because Brooke doesn't try and overstep her bounds I didn't pay it much mind until the last few weeks, when Jamie began to go out of her way to disrespect Brooke.\n\nLast weekend, I came home from a meeting to see Jamie and Brooke arguing. Apparently, Brooke asked Jamie to do the dishes and Jamie responded with something along the lines of \"you're not my mom, I don't have to listen to you\" which sparked an argument. After Brooke left to run an errand, I asked what was going on before Jamie gave me her version, saying that Brooke overstepped her bounds. I countered that while I agreed with her, she was still a member of the family and then told Jamie that while she's under my roof, she'll be expected to treat Brooke with respect. Jamie was moody for the rest of the weekend, which I understand; however, I don't think I'm asking for anything unfair here.", "created_utc": 1702060085, "permalink": "/r/AmItheAsshole/comments/18dt6n5/aita_for_laying_down_the_law_with_my_daughter/", "score": 711, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my daughter she'd be expected to treat my girlfriend with respect when she's visiting. She was moody around me until she went back to her mother's house.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Make a family chore chart. Who does what on what days and stick to it. As much as possible he home when Jaime is there. Don’t put Brooke in the step parent role.", "Info: what did Brooke do that overstepped her bounds? Because if she just asked Jamie to do the dishes, that’s not overstepping.", "I'm a stepmother.\n\nWhat's appropriate is for me to say \"Hey can you do the dishes?\"\n\nIf she responds to me with \"You're not my mom!!\" My answer is \"No, I'm not. We both ate a meal and I'm asking you to do your part.\"\n\nIf she still picks a fight, I shut up until her dad gets home. She isn't my child. I became a stepmother when they were 8 and 9, so the same deal. I'm not the disciplinarian, and my only job in their lives is to love them.\n\nThey're old enough to understand how to communicate but young enough to not have the words to say, \"I wish I didn't have to share my dad with you!\" (That may not be the issue, but whatever the issue is, stick it there.)\n\nYTA. For not supporting your girlfriend AND not supporting your kid. You need to all sit down and set expectations that can be agreed upon. Sure, some things aren't negotiable, but Jamie is 14. She is your kid and predates this girlfriend.", "How is asking someone to do the dishes overstepping boundaries? Jamie is staying there on a regular basis and should help with the dishes. \n\nI say NTA. Jamie doesn't have to be BFF with Brooke but she needs to treat her civilly. If Brooke asks her to do a reasonable chore, such as washing the dishes, Jamie should do so without the \"you're not my mom and I don't have to listen to you\". If she has an issue with it, she can state what the issue is and then you can resolve it if necessary. \n\nIs your ex remarried or seeing someone? Would she allow Jamie to treat/speak to them disrespectfully?", "Did you have these issues before your GF moved in?", "NTA and all the ytas just show that 90% of people answering are kids themselves. Asking a teen to do the dishes (OP confirmed it was just asking) is not overstepping boundaries. Treating kids like they're royalty will only make them grow into entitled assholes. Not everything is a personal attack and I feel we as a society are starting to forget.", "There doesn’t seem to be a conflict here. Jamie is just being a typical teenager, and you’ve asked her to be more respectful. Sounds about right. NAH.", "YTA - I say that because of this:\n\n>Jamie gave me her version, saying that Brooke overstepped her bounds. I countered that while I agreed with her\n\nYou just told your daughter that you agreed that someone overstepped her bounds but that it doesn't matter. You basically set up for your daughter that it's fine that people overstep her boundaries and when they do that you will just let them and that she should do the same. I wouldn't be surprised if you visitation gets less and less. If you let your GF overstep now, just imagine what she's going to do if she becomes your wife. You daughter is 14, she's already realizing this and thinking about spending less time at your house.\n\nI'm not saying that to say that your daughter should have no chores. But you should setup a chore list or something like that. Your GF isn't a parent to her in anyway and letting her parent your child is just going to cause resentment between you and your daughter.", "YTA for adding fuel to the fire and making this about respecting your gf.\n\nIf dishes need to be done, why shouldn’t your 14 year old daughter do them? You bought into the drama that she didn’t do them because “Brooke isn’t her mom,” when all you had to say was doing the dishes is a reasonable way to contribute to the household.\n\nA household you’ve brought Brooke into. So now you need to manage the results of that, and not in your passive “it’s to be expected” way.\n\nJamie doesn’t have to like Brooke or adjust well to the idea she’s no longer spending time with her dad, but with a couple. She does, however, have to function as part of the household she now finds herself in. 14 year olds are learning how to be the adults they will become. That’s more important than her personal feelings about Brooke. Raise a daughter who knows how to handle conflict, and who does chores without resentment because they need to be done.", "YTA\n\nFirstly, if your child isn't getting along with your SO then you better be paying it mind. That's your kid that spends 40% of her time in that house!  \n\nBrooke isn't a member of the family, that's something that comes with years or bonds. A girlfriend isn't the same especially if she just moved in. \n\nTechnically Jamie isn't wrong, Brooke isn't her mother and shouldn't be acting as such. If Brooke wanted Jamie to do dishes and Jamie says no that's an issue Brooke needs to take to you as the father to handle.", "I'm not sure why everyone is voting the way they are but NTA. Asking a child to do house chores that they contributed to teaches them how to look after their own place when they have one. ASKING SOMEONE TO DO DISHES IS NOT \"OVERSTEPPING\". Doing dishes is such a small task and to be met with such a strong comment is truly ridiculous. It sounds like Jamie just wanted a reason to push against Brooke.", "QUESTION:\n\nWho's dishes were they? You are all old enough to wash your own dishes.", "14 is old enough to have a say in custody. \n\nBrooke is not Jamie’s family. She is just ‘her dad’s girlfriend,’ and nothing to her, save that. \n\nYTA.", "If I was a teenager and a person I don't know very well moved into my house and started telling me what to do, I'd be super mad too. Your gf has been there for a few months? And already she has parental privileges? YTA.", "\" I didn't pay it much mind until the last few weeks, when Jamie began to go out of her way to disrespect Brooke.\"\n\nOP I found the problem", "ETA Brooke asking/telling Jamie to do the dishes.  Jamie says “no”. What happened next is the real issue what was Brooke’s response to the No?  Whatever that was, prompted the “you’re not my mother” response and the yelling.  Then OP as moderator basically said do whatever Brooke tells you.  That’s not right because you agreed with Jamie but you’re taking Brooke’s side and want Jamie to give in to whatever Brooke wants.  Today it’s the dishes what will it be tomorrow?  Being a parent doesn’t mean you can’t date or have your SO move in but you need to remember it’s your child’s home too and she was there first.  \n\nYou need to have both in the same room and find out how you can all move forward.  Keep in mind that Brooke is temporary in Jamie’s mind so her looking at your live in as a future mom isn’t going to happen.", "NAH. 14 yr olds are moody to begin with. Add in a new person in her life (NOT OF HER CHOOSING) and of course she's going to be a little bit of a jerk. Since your daughter is going to be there often I think its time to set up some rules of the road about the chores she's expected to do. If she made something for herself in the kitchen then yes she needs to clean up after herself. But you needs to communicate all this in front of your girlfriend so there's no mistake about the rules.", "YTA. She's your girlfriend, not a member of the family in any way. She has zero authority over your daughter.", "Going against the grain but hard NTA. \n\nCome on people, we’ve all been teenagers. She lives with her dad and his gf for almost half her time, she should be contributing towards housework. The GF asked Jamie to do the frickin’ dishes, not to slave around. Her answer was disrespectful and uncalled for. She is just testing her boundaries. I am glad you, OP, had your gf’s back. \n\nIf this was the GF’s post telling about how her boyfriend teared her a new one, you’d all be in front row shouting that the boyfriend/dad was the AH for not stepping up for his girlfriend…\n\nNTA, great parenting.", "YTA\n\nYour Jamie's dad, you should be very immediately involved in how your daughter is getting along with your live-in GF. It's not acceptable for you to ignore the situation until you can't because of a blowup.", "Does Brooke cook for Jamie?  Does she do all the shopping for the family?  When she gets home with all the bags,who helps put it away?  Did Jamie eat off any of the dishes that needed washing? Some responders are comparing the living arrangements to roommates.......excuse me, but if one roommate is responsible for all the cooking and shopping, the other roommates generally pitch in by cleaning up.  Brooke is not Jamie's Mom,  but she's also no Jamie's maid.", "YTA -- that you use the language laying down the law shows an incredible lack of sensitivity to your own daughter.   \n\nIf they were daugher's dishes, you could just tell her.  Before GF showed up, did you guys leave dishes in the sink?  Is your GF changing rules?", "Why would you move your girlfriend into your home if she and your daughter don’t get along? \n\nYou should have either fixed that or stayed in separate homes. What have you done to fix this? How long have you dated prior to moving her in? Do you and your daughter still do things separately from your girlfriend?\n\nYour daughter had no control over the divorce. No control over splitting her homes and time. And now no control over a woman living in her home with you who she doesn’t get along with.\n\nShe’s old enough to start choosing where she lives. She’s getting older and weekend will start including a social life. Why don’t you have her during the week?", "Why would you move a girlfriend in if she and your daughter “didn’t always get along”? That’s just a recipe for disaster. Expecting your daughter to automatically be ok with your choice of a roommate is a big ask. Your roommate isn’t the parent or boss of your kid & you should have had that conversation with both PRIOR to Brooke moving in. Expectations and reality are 2 completely different things. You are the arbitrator in this tenuous relationship. If you don’t handle this situation with care, you will lose one or both of these women.", "NTA. \nThere’s no way asking a 14 yo to do dishes is overstepping. And there’s no reason why Brooke shouldn’t or couldn’t ask your daughter to do so. If your daughter is at your home 40% of the time, she should definitely be helping in keeping the house clean, and acting like a brat because someone asks her to needed to be addressed.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (M44) have a daughter named Jamie (F14) with my ex-wife Miranda (F43). Miranda and I have been divorced for the past six years and she's had primary custody since then, but I have generous visitation rights and custody on weekends and one week a month (so I get Jamie about 40% of the time.) Jamie and I have a great relationship in spite of the divorce, but things haven't been as easy for the last few months after my girlfriend Brooke (F36) moved in with me. Brooke and Jamie don't always get along, which I expected, but because Brooke doesn't try and overstep her bounds I didn't pay it much mind until the last few weeks, when Jamie began to go out of her way to disrespect Brooke.\n\nLast weekend, I came home from a meeting to see Jamie and Brooke arguing. Apparently, Brooke asked Jamie to do the dishes and Jamie responded with something along the lines of \"you're not my mom, I don't have to listen to you\" which sparked an argument. After Brooke left to run an errand, I asked what was going on before Jamie gave me her version, saying that Brooke overstepped her bounds. I countered that while I agreed with her, she was still a member of the family and then told Jamie that while she's under my roof, she'll be expected to treat Brooke with respect. Jamie was moody for the rest of the weekend, which I understand; however, I don't think I'm asking for anything unfair here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I feel a grown ass adult yelling at a kid that isn't theirs nor is even a step parent is disgusting. It's called learning how to handle things like a grown up.\n\nAnd yes if you yell you do need to grow up and learn to communicate properly. Work on that instead of yelling at children", "I need clarification. Were the dishes Brooke’s, Jamie’s or everyone’s? It’s find to ask a kid to clean up after themselves, or do all of the dishes when the parents have cooked a big meal for the family. But if it’s mostly Brooke’s then YTA.", "Once Brooke asked Jamie to do the dishes and Jamie said what she said, Brooke as an adult should have never engaged in an argument with Jamie. What she should have done is let Jamie be a teenager and discussed it with You once you guys got a chance. Your literally changing Jamie’s life with Brooke being around especially when she’s use to having you to herself for 40% of the time. Just because your screwing Brooke does not give her a right to speak to Jamie any type of way girlfriends come a dime a dozen and unless your planning in marrying Brooke you better create some boundaries immediately or risk having your daughter resent you for a very long time", "How often do you leave them alone together for meetings, etc., and what’s the expectation for Brooke in terms of Jamie when you aren’t there? What if any responsibilities does Brooke have in re: Jamie? Watching her while you’re out, preparing meals, shopping for her? Driving to/from school or activities?", "YTA. You ignored the issue until it escalated. Jamie lives with you half of the time. Can you imagine what it feels like to live half your life with a person you don't like who doesn't like you?\n\nYou pulled out the \"we're all a family and need to respect each other\" when you got dragged into it, but before that, it was just a conflict between your girlfriend and daughter that you ignored. So which is it? Are you a family who works together to resolve conflict or not?\n\nFamily. Therapy. Now.", "YTA OP - you have set the household rule that only parents can assign chores to Jamie, but when your girlfriend overstepped and tried to assign a chore, and Jamie (rightfully) pushed back in accordance with the rules as she knows them, you’ve decided to back up the person who broke the rule. You can’t have it both ways - either Brooke is allowed to assign chores and _Jamie is not allowed to say no_, or Brooke is not allowed to assign chores and _Brooke is not allowed to ask_. You need to pick one rule and **stick to it**, because right now your daughter can’t win - she’s trying to obey your rules, but you’re saying your rules don’t count when you feel like it, and she has no way of knowing when they’re in effect and when they’re not.\n\nYou’re also discouraging her from coming to you if Brooke (or any future girlfriend) ever oversteps more egregiously, or does something that hurts your daughter. Because right now you’re showing her that you will back Brooke and punish Jamie, even when the three of you all know Brooke was in the wrong and Jamie was in the right.\n\nI would also like to point out that it is only “just asking” for help if someone is allowed to say no. If they’re not allowed to say no - if it will result in an argument, or nagging, or punishment, or snide remarks about “some people never helping” - then it’s not “just asking”, it’s an order. Jamie was not allowed to say no, because when she said no your adult girlfriend started arguing with her.", "INFO how long has Brooke been in Jamie's life and how long has Brooke been living there? And did you talk at all about that big change with Jamie a good bit before Brooke moved in?", "YTA\n\nYou can't just force the person your sleeping with on your kid. that's not laying down the law that's not being able to see past your own selfishness.", "Maybe i as coddled, but chores while growing up really focused on my own stuff, keep the room clean, maybe take the trash out, make sure to put my laundry away, set the table, help a parent with the dishes (like drying them or putting them away) etc. \n\nAsking a 14 yr old to do dishes by themselves seems a bit exploitative. \n\nYTA.", "YTA\n\n You say nothing about what chores your daughter is regularly expected to do in your home, and you should have gone over this with Brooke before she felt comfortable telling daughter what to do. I had a mom who was not [ and still isn't] domestic in any way. We had a ton of fights in my teen years about housework, because I was literally only home on weekdays from 11pm to 6am, so I never ate there, but she always expected me to wash all the dishes from the entire week and clean the kitchen on the weekends. I didn't think it was at all fair that I was expected to wash every one else's dishes on the 2 days a week that I had \"off\".\n\n Expecting a kid to clean up after themselves is fine, but asking a part time household member to do cleaning for every one else on their weekend off is not right.", "Brooke IS overstepping. She should not have the authority to tell a child who barely knows her to do chores. She isn’t the parent.", "YTA for not being clear whatsoever. - You don’t seem to know exactly how you feel about this. You told your daughter that Brooke did overstep the boundaries (that it doesn’t sound like you have even discussed with them or laid out), but you still told your daughter that she was in the wrong for telling Brooke she overstepped. Why did you have your girlfriend move in with you without any discussion about how her relationship with your daughter was supposed to work? It sounds like you all need to have an open discussion about exactly what the boundaries are, so everyone is on the same page. \n\nYou cannot just move two people (particularly a strange adult and young teen) into the same house with no preparation and hope they sort it out themselves. You are the one connecting these two, so most of this breakdown in planning lands on you. Your girlfriend carries some of the weight, because she is an adult who also didn’t have a talk about how this was supposed to work. Your daughter is only 14 years old, so she is just stuck in the middle of two adults who did not plan well, one of whom is her dad who has been willfully ignoring the tension between her and the woman he moved into the home.", "YTA. Could've told you that from the title.\n\nAnyone who's \"laying down the law\" (not the law, just you having a tantrum) is always the asshole.\n\nNot for nothing but there's a really high overlap between authoritarian parenting and kids who grow up to be fascists.", "YTA for thinking it’s overstepping to ask your daughter to do chores. Your daughter helps make the mess she can help do chores. Your live in girlfriend isn’t her servant. Teach your daughter some respect. While she’s not her mother, she is an adult and a member of your household.", "I would suggest perhaps a \"house meeting\" OP with you, GF, and child.\n\nTalk about what's fair, what are chores or tasks that kid is expected to do (with prompting if need be, within limits obviously), tasks that should be shared between folks (like if one person is cooking, the other folks set and clear table and do the dishes), maybe come up with a task board. Outline expectations for everyone's behavior. GF isn't allowed to yell (unless kid has pressed all her buttons), as daughter is also not supposed to yell (with the expectation that GF isn't pressing her buttons either).\n\nThere is allowed to be a time out when folks can gain perspective separately - I am not saying send the kid to her room, but maybe the living room. Or maybe GF wants to go to the bedroom for a bit of quiet and to destress.\n\nGoing for walks or to the library (if it's safe) are good outlets.\n\nAlso, why didn't you have these discussions before your GF moved in?", "YTA for not establishing and communicating ground rules with everyone before your girlfriend moved in.", "Info: did Jamie eat off the dishes in question, or did she get home and they were lunch dishes? I ask because you were at a meeting which generally implies this was during the day when Jamie should’ve been at school. \n\nIf they included Jamie’s dishes from her eating, then NAH. \n\nIf they were dishes she didn’t eat from, YTA as is Brooke. \n\nAt the end of the day, Jamie is really behaving like a normal teenager, which definitely includes being a dick about being told to do chores. Brooke is not a member of Jamie’s family, she’s an unrequested roommate to her, and while Jamie’s response was shitty for sure, you’re wacky if you think she deserves to be treated like a parental figure. It isn’t Brooke’s place to give Jamie tasks, it’s yours.", "YTA because your communication abilities suck.\n\nYou say you agree your gf overstepped? I would hardly think asking someone to do the dishes is overstepping. What actually happened?\n\nIf you agree she overstepped then telling her \"you're not my mom, I don't have to listen to you\" isn't unreasonable. If she didn't overstep, and this whole situation really was about doing the dishes, then you really need to clarify with your daughter that it's a perfectly reasonable request and it was not, even remotely, an abuse for your gf to ask.\n\nYou kinda have to pick one. You can't realistically tell your daughter that your gf is being crappy to her AND expect her to just deal with it.", "Wow what a totally fucked up sub 🤷🏼‍♀️", "I suspect your kid will spend all her time at her moms.  Be prepared to pay more child support", "YTA\n\n&#x200B;\n\nRespect goes both ways.  YOu are doing your best to drive your daughter away.", "Brooke may not be Jamie's mother but she's also not Jamie's maid. At 14 Jaimie should be helping with household chores which are basic life skills.", "Are they equal members of the household?  Can Jamie assign tasks for Brooke to do?  Did Brooke ask Jamie to help her do the dishes, or just tell Jamie to do them?  Why didn’t Brooke just do the dishes herself?  Are you upset at Jamie’s response, or that she didn’t do the dishes?   Telling Jamie to do the dishes implies Brooke has some authority over her— does she?  Set some household rules that clarifies what everyone’s responsibilities are.", "Info: did she tell her to do the dishes or did she ask her to do the dishes?", "Uh, no. Your girlfriend is not a member of the family the way daughter is. That takes commitment and years and years (or fantasy land). GF should stay in her lane. \n\nYTA", "YTA. Brooke isnt her mother. She is your SO who is relatively new to your daughter. She doesnt automatically get the right to tell your child what to do. Yes your daughter should show Brooke respect but that goes both ways. Be careful of siding with your SO too much, you could push your daughter away.", "YTA\nBrooke is just dad’s girlfriend. She’s a very new resident to yours and Jamie’s home. Brooke should absolutely not be telling your teen daughter what to do in her own home. Tell her to stay in her lane… and tell your daughter she needs to speak respectfully to Brooke. Any issues should be brought to you.", "ESH\n\nJamie for her response to a reasonable ask by Brooke.\n\nBrooke for continuing to engage in an argument with Jamie rather than coming to OP first to see how he would like the situation handled.\n\nOP for trying to appease Jamie by saying Brooke overstepped but then walking it right back and demanding Jamie respect Brooke.", "NTA, and I think the comments here must be a bunch of children themselves, my goodness.\n\nThe dishes are not a big ask, and would likely be expected of the child regardless. Asking her to do the dishes was probably not some authoritative command, since she hasn't overstepped otherwise. It could have been as simple as asking Daughter to clear the dishes before GF begins cooking - a really fair and even trade. Or, they were still there when they should have been done hours ago, and GF asked/reminded.\n\nKids should respect the person their parent is dating. They don't automatically become stepparent (and it's great GF isn't trying to!), but they are an adult. The child is a child, with age appropriate responsibilities. Your daughter should not have blown up at her.\n\nEven if, like some people say, they should somehow be treated as equal roommates - if my roommate forgets a chore previously agreed they would handle, I am reminding them to get it done.  \n\n\nEDIT: typo", "YTA", "I don't get the yta comments here. If I'm reading this correctly, the girlfriend only asked OP's daughter to please do the dishes. That's not an overstep, if that's all there was to it.\n\nIf you share a household, you share chores. Sounds like the daughter was using the \"you're not my mom\" classic because she wanted to get out of doing the dishes. Again, if that's really all that was said here.\n\nNTA for asking for some common courtesy in your home.", "YTA. You keep insisting that your daughter treat your girlfriend with respect but you are happy to let your girlfriend disrespect your daughter. And that's wrong. Your girlfriend isn't her stepmother and she doesn't have the right to discipline your daughter.", "YTA. Your girlfriend shouldn’t be asking your daughter to do anything. I don’t care whose house she’s lives in. You are her parent not the woman who had only been living with you “for the last few months”. If the dishes needed to be done you should have asked her. You ignored the conflict between your daughter and girlfriend until it affected your girlfriend.", "YTA this reminds me exactly of the guy I was dating who had two kids. He was a crap parent in the discipline department (NOT saying you are!!) but would literally tell me that since I’ve never given birth I can’t “understand” parenting and had no right to make any suggestions or have an opinion, because I’d never be a “parent” to his kids. \n\nBasically if I had stayed with him I would have been a bang maid in the house and a servant to the kids, who were slobs, but I really liked them a lot and we got along great. I’m a teacher with a ton of child psychology experience…not saying I’m perfect, but I don’t think it’s “overstepping her bounds” for Brooke to have expectations and input in the home and she especially shouldn’t be cleaning up after anyone unless there is a chore agreement. By undermining Brooke and saying she overstepped, that’s 100% fueling resentment and damaging Brooke’s reputation- you’re essentially saying she isn’t your “equal”, has less authority, and is less qualified than you. Similarly though, Jamie shouldn’t be expected to clean up your messes unless the chores are fairly divided and agreed upon.\n\nAll three of you need to work on communication of expectations.\n\nYou guys need to sit down together and talk about your concerns without arguing and come up with a set of expectations. Your daughter should get to suggest her own expectations too on equal terms. \n\nMaybe Brooke felt like she was cleaning up too much, maybe Jamie felt like she was being asked to clean up after you! Maybe Brooke was a little confrontational in her suggestion, or maybe Jamie was being unreasonable. Maybe they both just need to get a little more comfortable with each other in general. You’ll never sort it out until you talk together about it.", "YTA to your GF. If I was her, I would dump your ass so fast. Asking a child to do the dishes is not overstepping boundaries, it’s a household chore that teenagers can do. And the question is…whose dishes were they?", "Nta. Your daughter was asked to do a chore by the adult who was watching her. It wasnt out of bounds.", "YTA for not laying down the rules as far as chores for with your kid so that your wife didn’t have to play maid to everyone", "You didn't lay down any law, title is miss leading. More like I told my 14yo that my GF overstepped in an attempt to make her happy.While I also telling her she should have done the dishes to make my GF happy.\n\nYTA for not having a meeting with all three of you and discussing expectations of each BEFORE the move in.\n\nWe don't know what is going on because YOU don't know what is going on. If you actually want this to work...you need group therapy for you all. Who knows maybe Brooke is starting to resent you and daughter because of unsaid expectations...like being the maid for the house. Maybe your daughter listens to her mom go on and on about how horrible Brooke is and she's projecting her mother's feelings. You clearly don't pay enough attention....this can't be the first time in months.", "Your new girlfriend should not be in a position of authority over your daughter. She is NOT part of the family. Not yet. \n\nYour gf needs to earn that spot with your daughter, and getting into petty arguments will not help.\n\nYou should be the one delegating chores and discipline.\n\nYTA", "YTA just from the title alone. I don't have to read any further", "YTA.  Boundaries are to protected your child.  And you prefer tour bedmate to your child in this regard. Weird.", "You moved your gf in with your teenage daughter? That's already overstepping the bounds as far as your daughter is concerned.", "YTA A random woman overstepped her bounds and argued with your kid, but somehow you’re ok with it. Brooke is just your current girlfriend, not a figure of authority.", "YTA. Not for “laying down the law” but for not actually laying down the law. Sounds like you tried to split the baby, by telling your daughter that you agreed with her complaint (which you were frankly wrong to agree with) and then hypocritically insisting she do it any way, you undermined Brooke, you made yourself look absolutely spineless, and you encouraged your child to see this as an opportunity to wedge you away from Brooke.\n\nUsually the problem is the other way around. So at least this is slightly novel, but ya f-ed up my dude.\n\nIf you *really* believe that Brooke over stepped, you should have a conversation with her, but I doubt you will cause you know that’s not gonna go well for you.\n\nOn the merits, if you were all roommates, and one roommate didn't do the dishes, it would be completely reasonable for the other roommate to ask the offending roommate to do their part. That's an expectation of living in a society. Brooke didn't pull a \"I'm your mom card\" by telling Jamie to do her part, she's just an equal member of the household. It's literally her home too dude.\n\nAll around YTA.", "YTA. Brooke isn’t family, she’s not Jamie’s mother and you haven’t noticed Jamie doesn’t like her??\n\nWhat else does Brooke do to Jamie when you’re not around??\n\nYou basically told Jamie that it doesn’t matter that her boundaries are overstepped. Chores NEED TO COME FROM YOU, not Brooke. Brooke is just the girlfriend. You’re the parent.", "YTA", "I think he's going to get less than 40% after this.", "YTA.  You threw your girlfriend under the bus when your daughter should actually have chores like doing the dishes.  It has nothing whatsoever with Brooke not being her mother.  It has to do with respecting other members of the family.  You need to take your role as a parent more seriously and figure out what you're supposed to be teaching her.  Because you just taught her that Brooke is an underling.", "Man, there are a lot of spoiled brats here. Where and when I was growing up, step-parents, even if not married, could literally beat your ass and make you do any kind of chore. \n\nIf he wants his daughter to act right and not be an entitled little brat like most of America, then he did the right thing. \n\nRespect, especially lack of is a major problem. \n\nIt doesn't matter married or not. If he moved her in, that's serious. That means his teen daughter should respect her as an extension of the respect she has for him. And asking to do the dishes is not a big deal. She was just being a brat.", "YTA. brooke has zero authority to tell jamie to do chores. its also clear that jamie is not comfortable having brooke in the house at all and this is causing her to act completely different than normal. it’s your job to figure out why.", "YTA. Were they her dishes or was she just asked to do the dishes?\n\nWhy don't you care that your daughter and SO don't get on?", "YTA, why is Brooke telling her to do chores? Their relationship isn’t there yet and Brooke hasn’t been around long enough to be giving out chores. You honestly should have just texted your kid to do the dishes if you wanted her to do them.", "Yta", "NTA. Brooke is an adult, your daughter is a child. Brooke asking Jaime to do the dishes, given that she lives there, is not overstepping any bounds idk why so many people have a problem with a teenager being asked to do a basic household chore. Jaime is being disrespectful plain and simple. Maybe a sit down conversation with everyone could help but I don't see where you are the AH here except, depending on how severe the previous differences, not addressing them not getting along before now.", "I want to know if Jamie made those dishes or Brooke? Cause honestly if they’re not mine I’m not doing them unless my step mother asks. Chores are agreed upon with the relative primary parent involved not the step parent going “you need to do dishes” to me she told her instead of asking and if the relationship wasn’t that great of course it’s going to create more tension.", "NTA. A lot of bitter kids of divorce in this thread, yikes. \n\nDoes she do dishes at her mom’s house?", "YTA.  And she's 14?  Get ready for another trip to court.", "YTA \n\nYou need to split with your gf out of respect for her and sort yourself and your relationship with your daughter out. You can’t have someone live with you and have your daughter there 40% of the time, so she will be involved with your daughter and doing things for her, then telling her she can’t ask your daughter to do any household chores.\n\nQuestion is this your 1st gf since the divorce?", "YTA - nope, you don’t get to just throw a random woman into a home with your kid and expect it to go well. Brooke might be a member of your family but she is no one to your daughter. She shouldn’t be trying to parent your kid and to continue to do so is setting this situation up for failure. \n\nDo you care that your daughter is going to interpret your “under my roof” comment as letting her know she should stop visitation with you?", "NTA. \n  \nYour daughter needs to be taught that she cannot be disrespectful to people just because they aren't her mother. Brooke didn't ask anything of her that requires parental guidance. You live in a house, you help maintain the house.  \n  \nPretty sure this isn't the 1st time your daughter has acted out towards your new girlfriend. You're going to have to try to get your daughter into a better state of mind with the new girlfriend or things will just get worse", "The only person you were an asshole to here was your girlfriend. Asking your daughter to wash dishes was in no way overstepping.", "At face value, NTA. I don't see anything wrong with Brooke asking Jamie to do the dishes. IF, as you say, Brooke is kind and doesn't truly overstep with Jamie, then Jamie IS TA and you are right to correct her.", "Sounds to me like she might just be lazy and doesn't like doing chores and starting a fight with the girlfriend probably got her out of doing chores.", "I'm confused, she's an adult who is taking care of the house and asked another household member, a child, to participate in that care in a reasonable way. How is that overstepping? Arguing isn't great, but she also has no experience and hasn't learned to be a parent. Because she isn't one. \nGirlfriend didn't overstep, and telling your daughter you think she did just helps your daughter drive a wedge between the two of you, which isn't healthy for the daughter, either. \nYou're the only AH here, but not how you think.", "NTA. While your step-wife is not your daughter's mother, children should treat all adults with respect. Provided her request was reasonable, your daughter was in the wrong.", "NTA.  I'm sure Jamie is having a hard time with Brooke being around, but that's pretty typical of the age and situation.  Hopefully things smooth out between them. \n\nI could see Jamie being upset about chores, but doing the dishes is a reasonable thing for her to do.  Not like she was having a Cinderella moment there....", "After reading this NAH. Just poor communication and a need for ground rules, both for your daughter and GF.", "Brooke is your girlfriend, not even a fiance and you are choosing her over your daughter. \n\nYou were not there and do not know the tone Brooke used. How do I know?  Because I am also a stepmother, and I know I was bitchy to my stepdaughter on multiple occasions.  \n\nYTA, OP.", "Brooke moved in two months ago, and Jamie is expected to defer to her as a mother? Are you high?!  Jamie got dealt a raw deal, and is trying to find some agency. Brooke is marking her territory & pushing her weight around, and Jaime has just been trumped by the new young GF. I’m not saying there won’t be any behavior management, but you’re very insensitive to your daughter’s position. You probably won’t have much of a relationship with Jamie once she’s old enough to be on her own, so I hope Brooke is worth it!", "NTA.  Did no one here have a blended family?  It’s completely normal for a stepparent or pseudo step parent to ask a teenager to be pitch in with chores.", "MTA, remember most redditors are kids and have no real world view.", "YTA you let a woman your daughter does not get along with move in, and admit she over stepped. If you continue to allow her to over step you might find yourself losing that visitation as your daughter might refuse to go. I’m not sure where you live but your child might have to right to choose at 14. If your daughter doesn’t like her there’s a reason why, have you asked? Have you been less available to your daughter bc of her moving in? Has your daughter been around the gf before the move in? Are you still doing things just you and your daughter or is the gf always there?", "YTA.\n\nYour new partner isn't her mother. To your daughter, she's a stranger that her father sleeps with, that's all. Don't be surprised if your daughter starts trying to lessen the time she's around you.", "I believe 99% comments come from a kids who hates do a chores... 💁 Op..you did a really good job.. NTA..", "Sigh. Yet another post from a man more interested in keeping his dick wet than investing in a strong relationship with his child.", "YTA give one good reason why Brooke couldn’t do the dishes herself if she felt they needed to be done then.", "Sorry, yta. You can't say that you agreed that Brook overstepped but still told your daughter to suck it up. Did you tell Brooke in front of your kid to stay in her lane and not order her around. \n\nYou even said you knew Brooke and your kid wouldn't get along. You expected it. Did you sit both down and talk about what the expectations would be, or was it sprung on your kid? You get her 40% of the time and prioritize your new gf feeling and emotions over your kids? \n\nYou need to sit them down together and say look- we live together 40% of the time. So while we are all together, here's the deal- Brooke, you're not her mom or step mom or anything other than a potential future adult. My daughter will hopefully grow to trust and love. That's it. Don't think because you're her dad's gf that you have the same rights as a parent. And you daughter - your responsibility is to be kind, speak kind and be kind to Brooke. You don't have to like her but I live her and you need to be kind to her.", "Reading these comments I wonder if anyone is actually a step parent. Either way she’s an adult and needs to be respected. There should be a discussion between the father and gf on what’s acceptable. \n\nI’m a step parent. When I was my now husband’s gf we talked about our children. I always felt that once you’re in a relationship with someone who has children they should be treated as if they are your own. We discussed what the expectations were of each of us and the children. We get along fine and when I ask his girls to do something they do. And when he asks my son to do something he does. Communication is key. \n\nI grew up with step parents and they told me to clean something then I did. No question. No yelling saying they aren’t my parent. They were the adult and with that I respected them and did what I was told. It’s washing dishes for Christs sake. Not committing murder.", "NTA; your daughter needs to get used to your girlfriend. If she’s asked to clean up, or do dishes, she’s expected to contribute otherwise she’s welcome to prepare her own food in the future.\n\nFrom what I’m hearing Brooke didn’t demand anything or impose herself as her mother, so it was a reasonable ask. When Jamie said no however, Brooke is an adult and should have dropped it, talked to you.\n\nIt would be on you to set expectations at that point and if you failed to do so, Brooke wouldn’t be obligated to cook for 3 or do anything for Jamie.\n\nEnd story…\n\nPeople in this thread really hating on your gf asking someone to do dishes is funny. Idk what they assuming about the break up here but it’s not relevant", "NTA some of these comments they’re so completely wild the entitlement is dripping off of these children’s responses", "NTA- your daughter should have respect for everyone, as long as your girlfriend shows the same respect to her.", "NTA and I don't understand why this isn't the common verdict...\nHow does asking someone to do the dishes = overstepping boundaries?", "NTA just cause your gf isn't her mom doesn't really mean that the gf can't ask her to wash the dishes. That's not how that works. It doesn't actually sound like any boundaries were crossed outside of your daughter going out of her way to be rude. Not liking that she was told to do chores isn't really a boundary.", "NTA. Your girlfriend is a member of the household and can ask your daughter,  as another member of the household,  to help out. That's not trying to be a mom,  that's just living in the same house.  \n\nAs for the tension between the two,  you're going to have to make a point to give your daughter plenty of 1:1 time doing fun things to reassure her that the changes wont diminish your love.  She may not be able to articulate this,  but she's probably afraid you'll love this new person more than her.", "You’re all therapy speak obsessed lunatics, kids can be bratty and should clean up after themselves", "NTA. Asking someone to do dishes isn't overstepping.  Jamie should be expected to help out.  If she tried to discipline her for saying no, THAT is overstepping.", "NTA. Asking for respect is never out of line as long as it is expected on both sides.", "YTA.", "If I read this correctly, YNTA, All Brooke did was ASK Jamie to do the dishes. Who prepared the food and cooked? I am curious if anyone replying here has children.", "YTA op you should be dictating what your daughter should be doing! She already doesn’t like the gf, having her give out chores is only going to make it worse .", "Nta- it's dishes a normal request. There is also nothing wrong with asking your daughter to respect an adult in her own house as long your girlfriend doesn't overstep. Your daughter is a teen and they are rebellious at times but she could be feeling insecure about you moving on with someone else.", "Ugh. Leaning everyone sucks, except maybe Brook but need some info. Does you daughter usually have to do chores i.e. the dishes in your house ?", "NTA - Thank you so much for standing up for your wife!!! Now remember to enforce it at all times. <3", "NTA.  14 is a difficult age with girls especially.  Asserting that respect need to be the order of the day is reasonable.  It doesn’t matter that Brooke isn’t technically family- she is her father’s friend, an adult, and a permanent member of the household.\nThe other part, of course, is making sure that Brooke doesn’t overstep.  I don’t think asking Jaimie to do a chore is out of line, but maybe sitting down all together to clarify expectations would help.", "NAH.  The comments heere are insane.  This is an ordinary family disagreement in this kind of situation.  It's the sort of thing you handle by negotiation and discussion, almost exactly the way you did.\n\nGotta teach Jamie not to go nuclear over being asked to help with the dishes.  Especially given that I'm sure being a typical teenager with a typical teenage appetite she played more than average role in creating the dirty dishes in the first place.  It flabberghasts me how much kids that age can eat\n\nAlso, Brooke is getting a pretty bad deal here with your daughter allowed to disrespect her.  She doesn't have the right to give Jamie orders  but requests should be a matter of negotiation and refusals should be polite, and a reason given.\n\nJamie is being immature here and throwing Brooke's status in her face just because she can.  That's understandable, she's 14 and mature behavior is taught, it doesn't come naturally.  So, teach her.  You need to make sure Jamie's giving Brooke at least the level of respect due to any human being in their home.  This is Brooke's home too, she's moved in and Jamie needs to learn to respect her at least that much.\n\nI'm sure it'll be a battle but don't give up on it.  Brooke deserves your protection too.  Jamie can learn this IF you stick with it.  hopefully Mom can be an ally in this because this behavior by Jamie is not attractive.", "NTA. Many teenagers act this way at some point, even in nuclear families. If Brooke treats Jamie well and this is just common teenage douchebaggery, then you need to have a conversation with Brooke about how these interactions should go. And a conversation with Jamie about what’s expected of her around the house. And those two conversations need to be aligned. If Brooke doesn’t treat Jamie well, then you need to end your relationship with her if you have any hope of having a good long-term relationship with Jamie.", "NTA- Asking a child to do the dishes isn’t a big deal. They usually become annoyed when they are asked to do chores, regardless of who is asking. But in this case I think your daughter is acting out. I think you are right in laying down the law and teacher her to respect her elders. And honestly to just show respect for the people you live with. Keep the common areas clean.", "NTA, your chosen partner, was responsible for the house at the time. She asked your daughter to do the dishes, not a demand, not an order, a request. \n\nShe is not your daughter's mother, that is correct, but she is your partner at the moment and has the right to requestassistancein keepingypur home in order. Chores are everyone's responsibility, it's not unreasonable for her to ask her to do some.", "NTA. It's perfectly normal to ask a teen to do the dishes and it doesn't require a parent to ask for that.\n\nYou might still have to stop ignoring the inconvenient fact that your gf and daughter don't get along. It's not going to fix itself.", "Nta - how does ASKING some to do the dishes an overstep? She simply could have just said no and then talked to her dad about it. Brooke never said she was her mom or implied it in any way. She simply asked her to do the dishes. If you’re living someone and you ask them to help you out somehow you are over stepping? Daughter straight up went from 0 to 10 with “You’re not my mom”! Daughter was disrespectful.", "I can’t even believe the crud I’m reading. Brooke is now living there. It is her home, too. Asking a teenager to help out with housework is fine. Jamie was disrespectful to answer the way she did. They’re dishes not a big task. Specially if some of those dishes were Jamie’s. Are you ok with Brooke cooking a meal for Jamie or is that overstepping, too?", "NTA. Your daughter is being a disrespectful brat to someone who did nothing to her. Children don't get to dictate who lives in the home and what their chores are.", "How is asking for help over stepping boundaries?", "I lived in a big multi-generational household. My aunt, cousin and grandmother lived with us at one point. We often had our teenage friends staying long-term (months or years) due to their various family issues. \n\nIf any adult asked any of us kids to do something, we did it. There was no arguing. If one of us bio kids thought it was unfair we brought it to a parent and they ruled on it.\n\nBut \"clean the bathroom\"  was the same reasonable instruction from my aunt as it was from my mother, so I never really saw the issue. Do American kids never do anything anyone tells them unless they're an immediate bio parent? That's totally fucked up and also explains a lot about US public education. \n\nThere were a lot of people in my house and all the adults and most of the kids worked at least part time after the age of about 14. If we didn't all pull our weight the place would have been a total chaotic bomb site all day every day. \n\n\"Do the dishes\" isn't \"shit on this photo of your Mom so I can film it and laugh\"  child should react accordingly.", "ESH. You,  yourself,  agree that Brooke overstepped. Jamie overstepped. You thoroughly dropped the ball.\n\nAlso, respect goes both ways. If Brooke expects respect,  she must give it. \n\nBio parents are also often operating with blinders on when it comes to blending a new SO with their kiddos and most often that's at the detriment of the kiddo. Pay attention not only to what you see and hear, but also to what goes unsaid and what happens when you aren't there. If there's constant tension, but you only witness Brooke acting appropriately that may well be an indication that she is not acting appropriately when you are not present.", "So it’s unreasonable for girlfriend to ask for help with the dishes?", "How on earth can being asked to do dishes be called overstepping bounds??? The kid just didn't want to do them, like most teens, and also wanted to cause friction between her dad and his partner.", "NTA. Very much within your rights to express house rules that your daughter must adhere to under your roof while living with you. She is also disrespectful of your partner. Your daughter may not like it, but you have moved on in life so must she whether she likes it or not.", "NOT THE ASSHOLE. Brooke did NOT ask anything wrong; Jamie needs some chores to do, and, since Brooke was the only adult there, it was appropriate for her to ask. It is NOT overstepping or trying to act like a parent for Brooke to ask Jamie to do a chore. Do not listen to these children pretending to be adults on here, telling you that you are the asshole. From what I see, most of these \"adults\" think that teens should just tiptoe through the tulips all day, every day, and that chores are beneath their vast importance. Your daughter needs to do chores, no matter whose house she is in, and if she does not like it, too bad for her.", "NTA", "Your not the ah and neither is your gf there’s nothing wrong with asking your daughter to do the dishes, her attitude however was not respectful at all, yes your gf isn’t her mum but she lives there and should be respectful towards her", "She ASKED the kid to do dishes, absolutely not the same as COMMANDED. If course she had the right to\nask, a drunk stranger walking by had the right to ASK. if she'd need issuing punishments or threats, that would be inappropriate.  But ASKING another person living in the house is just normal.  Did the kid have the right to say no?  That's debatable and Dad gets a huge vote in debate. I don't know if the kid's an entitled brat, Mom's been running Dad town to her for years (never ok, the kid hears \"half of you is worthless so that makes all of you bad.\" (Yes, that's f***ed up but kid are world champs at figuring out how to take the blame for family problems).     Mostly  it sounds like she's wants she excuse to be a bi...oops, a brat.", "NTA. You’re the parent, she’s the child. She might not be her mom, true, but she’s an adult. Both people could’ve reacted better. Girlfriend and you should have talk about what her role is as a girlfriend and not a stepmom.", "I see all these YTA comments and no wonder I see so many entitled brats running over their parents.  Asking a 14yr old to do the dishes is far from over stepping boundaries. \n\nNTA, it's only dishes.", "As long as Brooke isnt being overbearing or crossing any lines, then you are NTA. I think you did a great job explaining the ground rules for respect. I would also reassure Jamie that you love her an no matter what.", "That's what I am wondering. What boundary did she overstep?", "He said in a comment that asking Jamie to do chores was “overstepping”.  I don’t agree at all.", "I understand that stepparent-stepchild relationships are complicated, but it is totally normal for an adult to ask a child who lives with them to do the dishes. When my nephew comes to stay with my parents I ask him to do the dishes there, that isn't overstepping, it is teaching him to be a considerate member of the household. I do think it is off limits for a stepparent, or especially a girlfriend of a parent, to give a stepchild larger commands about how live their life, like whether or where they should go to college, how they dye their hair of what clothes they wear, who to be friends with, etc. But this is just common dialogue between people who live together. If Brooke leaves her car in the driveway and Jamie can't get out is it a boundary violation to ask her to move it? Where do we draw the line here?", "The Dad fucked up by agreeing with the daughter about this out of bounds stuff.", "This thread seems to be mostly full of children of divorce, and/or children who never had to do chores... \n\nI don't say that to be insulting or insensitive to COD, but it's painfully obvious the type of lens these responses are colored by. Unless Jamie isn't being fed at OP's house, I can see no situation in which being asked to assist with a common household duty is grounds for this level of indignation.", "I’m assuming that when Jamie said no to doing the dishes, Brooke may have tried to push the issue and/or discipline her in some way for “disobeying.” Again, this is just a guess bc OP says that the two were in a middle of an argument when he walked in.", "The first intelligent post start or whatever this is called. The yta have to be kids. There is no other way they are anything else.", "I never thought I would have to scroll down this far to see this question.", "This is the only Y.T.A. in this thread with any sense to it", "Yes!  This is a great comment.  \n\n(I would also say that he should sit down with his daughter without Brooke present, so that Jamie will feel more free to talk honestly about issues she might be having with Brooke, or her feelings about Brooke, that she wouldn't be comfortable saying in front of her.  Maybe those feelings are reasonable, maybe not.  Her getting them out might help.  Her feeling like she can trust her dad enough to express those feelings would be a good goal.  It doesn't even mean that he has to validate all of her feelings -- like, \"I feel like Brooke is getting in the way of you and Mom getting back together\", no, that isn't fair to Brooke, or to him.  But it's a feeling, and getting it out into the air is better than not.)", "I agree. NTA, and here’s why: if this situation was that OP’s sister moved in with him and asked Jamie to do the dishes, everyone here would be like “yep that’s fair,” although last I checked, someone’s aunt is not also someone’s mom (except in some creepy circumstances). The “you’re not my mom” logic is completely faulty. Adults are expected to act as adults around children. If someone’s actual parent isn’t around, the next person to take on the parenting role in that moment is the adult in that home. If a kid is hanging out at a friend’s house and the friend’s mom says “in this house, everyone does the dishes after themselves,” that’s what the kid does. They don’t say “you’re not my mom Mrs. Johnson!” \nBrooke is not “family,” but she is a member of the household.", "Why did I have to scroll so far to see something this sensible?", "I’m willing to bet there was no conversations on OPs part about what it will look like when Brooke moves in.  Like OP and Brooke didn’t talk about it (what her role is) and I bet he didn’t talk to Jamie about it either.", "I’m sure it has something to do with their relationship or lack thereof. It doesn’t sound like there’s any at all. How would you like an acquaintance level person giving you chores? Dad needs to intervene now and establish roles.", "Because OP has established the boundary that Brooke is not allowed to assign chores to Jamie, and Jamie is aware of this and tried to enforce the rules. Instead of backing up Jamie, or saying “hey I didn’t think this through let’s reassess”, OP has told Jamie that she is right but he won’t back her up to Brooke.", "No. Jamie listens to me and her mother. I'm pretty sure that she's just acting out because I'm with someone other than Miranda.", "Exactly the daughter is 14 she can do some dishes holy hell. These commenters are hella entitled", "I really am starting to think this sub is an opportunity for teenagers to go on a witch hunt for parents.", "I don’t think she’s bad for asking, but if she was rlly just asking then why was there a fight when she said no? That should’ve been the end of that convo. And if Brooke rlly just wants her to help around the house some, that’s fine, but that’s a convo her dad should be involved in. Solution? Chore chart. Then this issue never would’ve happened.", "GF's have no place dictating anything to anyone.", "Remember that like 90% of the people here are women.  This post hits all the prejudice points.  OP is a man, who's disciplining a teenage daughter with a live in GF in the house.  I can hear the national pearl clutching parade from here to San Francisco.", "When one member of the household does the cooking and asks another member of the household who ate the meal to contribute by doing the dishes, that’s not overstepping boundaries.  However, OP needs to have a discussion with G.F. and daughter together on chore distribution so everyone’s on the same page.", "How is an adult asking you to help out “overstepping bounds”?? She’s a teenager and dishes won’t kill her", "Buddy, I'm pretty sure that he meant that he agreed about her not being the girl's mom I don't really think it was about overstepping bounds that he was agreeing. She asked the daughter to do the dishes, that is a common chore that kids are asked to do", "It makes me so mad when the top reply is so low-quality in this sub. *The alternative scenario you're suggesting is the same one that you just read.* NTA.", "Holy moly, so the kid just gets to treat Brooke like crap? No way.", ">Firstly, if your child isn't getting along with your SO then you better be paying it mind. That's your kid that spends 40% of her time in that house!\n\n>Brooke isn't a member of the family, that's something that comes with years or bonds. A girlfriend isn't the same especially if she just moved in.\n\nSure, pay attention but not getting along isn't a reason to not be a family, of it was then all teenagers would no longer be in their family.\n\n>Technically Jamie isn't wrong, Brooke isn't her mother and shouldn't be acting as such. If Brooke wanted Jamie to do dishes and Jamie says no that's an issue Brooke needs to take to you as the father to handle.\n\nThat's simply bullshit. Sorry but Brooke is an adult in charge of a house. Jamie is a child in the house, she can, and should, do dishes when told. Doing dishes isn't outrageous, nor is it arduous. It's literally a normal chore.\n\nIf I have my kids friend over and she makes a mess on the floor I am well within my \"rights\" to tell her to clean up her mess. I wouldn't be required to go ask her parents.\n\nWhen did adults all forget that they are adults, and should act like it.", "What a trash take.  Parental roles have ZERO bearing on household chores that everyone shares in.", "Sounds like that's what he did.", "Are you people all insane? The dad is allowed to have another relationship. Is he supposed to become a monk because his kid doesn't want him to have another partner? \n\nHe clearly stated that she never over steps with her. But yeah, she's allowed to ask her to clean up after herself or to help out.\n\n I swear everyone makes step moms look like they're evil on this sub. God forbid she ask her to do something. NTA.", "Who is upvoting this hot garbage comment? The girlfriend may not be a wife but she's LIVING together with him. That's serious. And living together means it's her home. Asking a child in your home to do dishes is not asshole behavior, and neither is expecting it to be done either. Lord I almost downvoted the original post for being too mundane but wow ...", "Wait I’m kinda confused. He’s the asshole? Because Brooke did exactly what you said she needed to do. And imo, asking a kid to do the dishes and them retaliating because they think she’s trying to replace her mom, isn’t ok, I don’t think it’s Jamies fault, it really sounds like she isn’t handling their divorce well which is more than understandable, especially considering her age.", "See to me this is bs if the SO didn’t do anything for the kid because she wasn’t her responsibility you would be saying she was an ah.", "Still, Brooke is a member of the household and asking someone you share a living space with to pitch in isn't an unfair ask. A little bit of an overstep given their relationship, sure, but not unfair to ask.", "If they're moved in they're probably getting married soon, that means that she is a part of the family for the most part. Like literally after I became engaged to my partner the entire family starts saying they are part of the family, and the dad is definitely NTA because from what it looks like all the partner did was ask her to do the dishes, which that is a kid and kids normally do chores. So other than that I don't see how the dad is in the wrong. Like if they were just having small Petty arguments it makes sense to not really pay it any mind, like this happens all the time when a parent starts dating again, does the child typically doesn't take too kindly to the step parent. So I don't get why people are saying the dad is in the wrong", "Brooke is another adult in that household.  The girl is a teenager who has been asked to do a simple household chore...not go sell herself on the street corner.  And this has nothing to do with whether or not Brooke is the new wife or pretending to be the girl's Mom...this is simply about respecting another responsible adult in the house while getting a bratty teen off of her butt to help out with basic household chores.", "Wtf are you talking about? Brooke did nothing wrong? Jamie was being a brat, and the dad handled it well. Its not like brooke was being mean or rude to the daughter", "> Technically Jamie isn't wrong, Brooke isn't her mother and\nshouldn't be acting as such.\n \nAgreed, but also, she isn't even a stepmother at this point. \n\nOP, YTA. Food for thought, 14 is old enough for the courts to listen to them if they decide they no longer want to live with a parent.", "ESH. Dude should pay more attention to his daughter and gf’s relationship. But regardless the gf is no an adult in the home and should require a modicum of respect. Being asked to do the dishes isn’t stepping over a line.", "Nah. This is a bad take. If OP has been dating Brooke long enough that they have moved in together, then Brooke is due some level of respect from his child. Asking the kid to wash the dishes in the house that she spends 40% of her time in, thus USING those very dishes, is hardly trying to act like her mom. Snarking back the way she did is unacceptable and needs to be corrected. 95% likely that this is purely a case of a bratty teenager being a bratty teenager and pushing their boundaries. \n\nUnless Brooke is abusing or otherwise mistreating the kid, the kid needs to have a basic level of respect and obedience to BOTH adults in the house as well as be held accountable for her part in keeping the house clean. \n\nI'm the girlfriend of a man with a 14 year old kid, and believe me that kid would NEVER disrespect me that way. I don't try to act like I'm their parent, but I DO reserve the right to ask them to do small chores when they are with us in our home, and they respect me enough to not snark back or refuse to do those chores.", "Yep, encouraging the bratty behaviour, awesome tactic.", "Noone needs to be a member of the family to be shown respect. Brooke is a grownup residing in the same house, thats enough. And a grownup can ask a child to clean up after them in their own house. Even if that house is shared.\n\nThis \"Youre not my parent - you cant tell me what to do\" cliche is just old. And so incorrect. What a \"Step parent\" can or cannot decide regarding a child is for the actual parents to agree upon, not the child. And in this case the dad asks her to be respectful.", "This kid is going to be a nightmare roommate if being asked to do the dishes sets her off.  Since her knickers are in a knot about dish doing a chore chart is needed.  Dad needs to teach her a few manners.", "I don't blame Jamie for being moody; I'd be too if I was in her situation. Still, I'll communicate with both of them about what I expect going forward so we can nip this in the bud.", "Except she is an adult who lives there and her fathers friend.", "Your definition of 'family' is really narrow. I'm not sure you have a good understanding of families in the modern era. We're not in the 1800s any more.", "Asking someone to do something isn’t being authoritative.", "She didn't exert any authority. She asked her to do the dishes.\n\nBut I agree, she is not a member of the family. However, she is a member of the household and should be respected as such.", "True, but Jamie shouldn't be pulling the \"you're not my mom\" card either.", "Genuinely curious-what makes you think this is great parenting?  It reads to me like there was no communication during a big time of change and transition (gf moving in) so of course there are toes being stepped on and resentments coming out.", "Asking a child to do dishes, no matter who you are, is not over stepping. I was the child and GF to step-mom. This kid like my step kids seem entitled. There is no reason daughter should speak to any adult that way and the GF shouldn't have argued with the kid. \n\nTeenagers are the worst, especially when you aren't their parent asking them to do something.", "Just thought I would comment that I think it’s funny we both think op is an ah. Me for the way he is treating his gf and you for the way he is treating his daughter.", "Sorry but kids (especially young teen daughters) can get very territorial over daddy's attention and act irrationally towards any girlfriend dad may have regardless of if they are nice or not.  It's neither fair nor reasonable to have children essentially call the shots on who daddy/mommy can date and who can live in their house.", "Jesus Christ, are parents allowed to have a life at all or is that something you just give up when you have a kid?", "Where's the part of the story where HE stepped up and helped Brooke with the dishes?  I need that part of the story.  He gave me no reason to believe his hands are not fully capable of submerging a dish in soapy water and cleaning it..", "That's not how custody or child support works.", "Oh, found the destroying your family response!\n\nWhat a joke, grow up.", "How so? By asking my daughter to show an adult she shares the house with the same level of respect as her teacher?", "Are you genuinely stupid in what world do you think a 14 year old living rent free and a 36 year old woman most likely contributing to the household equal???", ">Are they equal members of the household?  Can Jamie assign tasks for Brooke to do\n\nWhat an asinine question. And you really thing you did something here lol", "She just asked.", "Yea, these comments are so wild!", "She didn’t discipline her.  She asked her to wash some dishes.", "Ikr ! These comments are insane", "Most of the people on this thread are clearly teenagers with insane amounts of entitlement. It's clear from the outrage for Jamie whose childish response to being asked to do the dishes was YOURE NOT MY MOTHER! Stepparents are vilified in this thread no matter what the circumstances and are never allowed to be treated with any respect in their own homes.", "I suspect that's what's going on.", "Same here, I thought it was normal to be asked to help out and it was only dishes it wasn't like the GF tried to impose anything on Jamie.\n\nThe only issue I see here is that the GF started to argue with the daughter, she should of brought up to OP and go from there.", "I wonder if Brooke was informed, prior to moving in, that overstepping was going to be defined so strictly that she'd best not make any direct requests to the daughter. I don't know where the line for \"overstepping\" should be drawn but it sounds like it's going to be terribly uncomfortable for anyone living there as the second adult.", "It would be considered overstepping in many blended family situations\n\nIt also sounds like it was more of a demand than an ask; an ask ends at \"no\" and an argument begins at \"no\"\n\nOP even said he agreed with his daughter that Brooke overstepped, so it's supposed to be the norm for their family and Brooke pushed that boundary, clearly\n\nOp is TA because he's not being consistent and trying to teach his daughter that if someone pushes your boundaries you should still just do it; he needs to stand up for her. Blending families is hard enough, a \"recently moved in gf\" should not have authority over this kid, especially since they clearly don't have any kind of relationship other than \"that's my dad's gf\"", "You don’t set the boundaries for their household though?? If OP and his daughter agree Brooke overstepped, that’s it, she overstepped. You don’t have to agree at all, they’re not your boundaries.", "People are extremely hung up on Brooke being the girlfriend and not another adult living in the house. I’m sure if OP was living with his sister and she tried to get her niece to do the dishes, most people here would say “she’s an adult in the household and she gets to partake in basic coparenting, such as asking for chores to get done.”", "Because they set boundaries stating that Brooke isn’t an authority figure who can ask Jamie for common household duties. I think it’s painfully obvious your response is coloured by the fact you never had to navigate this dynamic", "I'm also assuming that these dishes could have been from everyone in the family. A child shouldn't have to do dishes for an adult. While chores are important, they should really only be given by parents/guardians as they are tools to help foster responsibility. I am wondering why Brooke asked her to do the dishes, and how she asked – maybe it gave of more of \"you need to do this\" vs \"hey, mind helping out\"", "Exactly. I’m flabbergasted at these replies.", "And a full-time member of the household, at that!  It's Jamie's home too, but Jamie isn't there full-time.", "Because step-parents are always trashed in this sub. They’re somehow neglectful if they don’t treat their stepkids like their own but also abusive if they do. I honestly think this sub is just filled with teenagers lmao", "Because most people on the internet are fucking morons", "Reddit is full of children with no real world perspective.", "Nothing states or indicates that OP told his gf about these boundaries.", "Or maybe your GF is not nice to your kid.", "And frankly that’s valid and instead of lashing out at her you should be talking to her and finding out what you can do to make the transition easier for her.", "Listen -- \"pretty sure\" isn't good enough.  I don't necessarily think you're an asshole for what you described here -- but you're toeing up to the asshole line by giving every indication that you haven't just TALKED to your daughter.  And not just about this incident -- overall.\n\nJamie and Brooke aren't getting along?  Then it's time to sit Jamie down, without Brooke present, and talk with her until you get to the bottom of why Jamie feels this way.  Might take a while.  Might involve some stuff that you don't see as a problem, or that objectively shouldn't be a problem -- but if you start arguing with her while trying to get her to open up, then you'll never actually succeed in getting her to open up.  You need to listen for a while, until you get to the root of whatever the issues are.\n\nNeedless to say, though, you'll also only ever do this if you convince your daughter that you are someone she can talk to honestly, without it getting her in trouble.  And yes, that includes hearing her say things like, \"I don't like Brooke being here, because I wish you were still with Mom.\"  \n\nIs that \"reasonable\"?  No, of course not.  But it's also the key to unlocking some \\*feelings\\*, and it might point to ways that you have failed as a parent.  Failed to explain adequately to your daughter WHY you and your wife divorced, and won't be getting back together.  Why that's not your daughter's fault.  Why Brooke is not replacing Jamie's mom, but yes, Brooke is now a part of the household.  (Don't push onto your daughter the idea that because Brooke moved in, Brooke should now be regarded by Jamie as \"family\".)\n\nIt also very much sounds like you never discussed the idea of Brooke moving in with Jamie before it happened?  While you didn't need to give Jamie the right of refusal, you should have talked to her about how she felt about it, what she thought it meant.  AND, you should have created boundaries from the get go. Who gets to discipline Jamie? (It should only be you, not Brooke.)  Who gets to suggest chores to whom?  (That, IMO, \\*should\\* be both Brooke and you.)  You can't take for granted that everyone has the same understanding of what it means that Brooke lives there now.\n\nIMO, you're right to create a ground-rule that Jamie has to be civil to Brooke, at the very least.  The same, of course, goes for Brooke. (No indication here that Brooke wasn't civil, although we don't know how heated the argument got.)  You should also create ground rules for how the household functions (it's your house and Brooke's house, you are both adults, both of you have the right to ask Jamie to do a chore, within reason).  You and Brooke should get on the same page about HOW to ensure that the parenting of Jamie is left up to you, and Brooke isn't seeming to step in and try to do it.\n\nFrom what you've said, Brooke asking Jamie to do the dishes sounds perfectly reasonable.  It's hard to tell whether Jamie's reaction to it was \"just Jamie being a brat\" (not saying you think that, but it sort of comes across that way), or whether it was a symptom of a larger set of issues that finally erupted over one smallish thing.\n\nHow much of an asshole you are depends on how you go about trying to make yourself into someone your daughter feels she can talk to honestly -- about her fears, her hurt, or her anger -- without you just getting mad at her, or shutting her down, or her getting into trouble for it.  Do you want to be the kind of dad your daughter can confide in?  Then work on that, and maybe you'll be able to get to the bottom of what's wrong between Jamie and Brooke.  You won't really fix anything until you can do that.\n\n(That doesn't mean Jamie calling all the shots, or \"getting rid of\" Brooke, either.  Respecting Jamie's feelings and helping her work through them doesn't have to mean allowing her to do just anything, or allowing her to set the rules.  It's just that you can't lance a boil until you actually find out where the boil is.)", "I'm particularly concerned that Brook is just doing all the household chores?  Brooke wanted help with the dishes and OP agreed that she couldn't have any.\n\n  where's the missing part of the story where HE goes and helps Brooke like a mature adult?  Does he have a rare genetic condition where the flesh of his fingers dissolves in dishwater?", "She can totally do dishes, if *her dad* asks her to. It is not the job of his latest side piece to dish out jobs and responsibilities or to argue with Jamie for saying no.", "Have you ever met a teenage girl?  Asking them to do chores can easily result in smartass comments.  That's entirely normal.", "Kinda in a similar situation - have my own kid, bf lives here part time, and has his own kids part time. I’ve never shied away from asking kids (mine, bf’s, or friends’) to help me do household things, and while most of the time, they’re happy to help, I’ll get the occasional “I don’t want to”, which is fine. \n\nIf I was told “I don’t have to listen to you because you’re not my mom” that a whole other story. I know I’m not their mom, but I’m a person making an effort, and if they want to insult me because they don’t want to participate, you bet your ass, I’ll call them out for their attitude. Hell, just this morning, I told my 3yo niece that I know she can be very good at being helpful and polite and that being mean or rude will only hurt my feelings, which she understood.", "She is an adult who lives in the house? If the father invited a random friend to live in the house, and that friend was involved in cooking and cleaning for this child, them asking her to wash up is really not crossing any boundary at all. An adult doesn’t need to be a child’s mother for them to have basic respect, if she disagreed that she should be doing the dishes then she should have just waited until her father was available to involve him.", "Children have no place talking back to adults heading the household they live in.", "Here I disagree. \nShe’s (the girlfriend) an adult, living in a home where her partner has a child. Asking the child who is there almost half the time to help with chores is more than reasonable. The only thing that made it an argument was the blatant disrespect from the daughter. \nWhat OP should do is have a discussion with daughter on why she thinks it’s okay to talk to someone like that, but guessing on some of OP’s replies he’s allowed this behavior. ETA except girlfriend, she should leave and can do better.", "Telling a teenage girl that saying no is disrespectful or unacceptable is a super bad lesson to teach. Telling a teenage girl that she has to be respectful and agreeable to all adults is a terrifying lesson teach.", "If the boundaries set were that the stepmother doesn’t ask the stepdaughter to do the dishes, then she’s overstepped those boundaries.", "If both father and daughter agree she overstepped her bounds then she’s overstepped her bounds. Boundaries are defined by those setting them", "That adult isn't your parent. And you had no decision in letting them live with you.\n\nMy mom had a live in adult boyfriend for like a year.\n\nNot once did he try and tell me or my sister a single thing to do because he knew it wasn't his place. If he thought we should be doing something, he talked to our mother first and if and only if she agreed, then she would bring it to us.\n\nHe would occasionally ask if we could help him with something, but he never pushed it if we said no.", "Totally depends on how she asked. A parent might assign the dishes as a chore that a kid is expected to do, whereas I assume the Dad's gf relationship is more like a roommate, where it would be more reasonable to ask politely. It really  isn't clear which category this would fall into. I don't see how people can make an asshole judgement without understanding the nuances of the situation.", "Just because some is an adult that doesn't give them the right to order a kid around. You can bet your ass Brooke didn't say, \"Jamie, could you do me a favor and wash the dishes, please?\" It probably wasn't an ask at all. Probably close to do the dishes. Probably no please, or a reasonable reason why it should be Jamie's responsibility.\n\nObviously if the kids life is in danger your jot running to ask if you can tell her to do something but this is the exception.", "She should definitely treat Brooke with more respect but I don't think it's right to have your recently moved in girlfriend trying to command your kid to do *anything* - it's not her place", "Well OF COURSE. She's his daughter. Dad isn't allowed to have any other relationship and daughter should get wtv she wants and not be expected to contribute in anyway.", "By the original commenters take,  no one but parents are too be obeyed. That may well explain the state of the schools to be honest. The teens are running the show, and having been a teen, I can tell you that is no good for anyone.", "I think this depends on whether this would be a normal chore or if Brooke is asking her to do above what she already does and that if Jamie is feeling some type of way, definitely defer to her dad. That's not a Brooke problem.", "I agree and confused why this is top comment - as long as Brooke wasn't a jerk and asked then she did nothing wrong. Maybe shouldn't have argued, but took the no and went to OP to have him discuss with Jamie.", "Jamie is the daughter, Brooke is the girlfriend. You switched them in one paragraph.", "I don't think people read the same post that You or I did. I am really beginning to wonder about this subreddit.", "After she argued with the kid. Shouldn't have argued with the kid.", "Yes I came here to say this.", "It’s sounds like instead of going to him she chose to get in a fight with a teenager. Then he just played the member of the family which she isn’t and then said be respectful. I’ve been on both sides of this issue as the parent and stepfather, it’s hard, but it’s even harder on the kids especially when they feel like they had no say on the new living arrangement.", "No, he threw a tantrum about it. Those are different things.\n\nWhat fourteen year old ever responded well to WELL JUST DO WHAT YOU'RE TOLD BECAUSE I SAID SO?", "No he didn’t. He told Jaime to respect Brooke. \n\nBrooke also needs to respect Jaime and cannot TELL her to do the dishes. She isn’t a parent", "No, that's perfectly reasonable as well. I grew up with divorced parents, one of whom remarried and another who dated on occasion. \n\nIn neither situation, did my actual stepmother nor any of my mom's boyfriends ever tell us to do anything. If they thought we should, they told my dad/mom respectively and if the parents agreed. They told us to do it.", "You ask her, take Brooke out of the equation. Your only making the situation worse.", "It was unfaid for your GF To ask because they haven't built that relationship.", "Tell Brooke to speak to you about the chores she wants done.", "If you weren't going to listen, why did you post here?\n\nPeople that use this sub only for validating the shit they know they did wrong are the worrrrssstttt.\n\nBe a better person, OP.", "Think of Brooke’s and Jamie’s relationship like randomly assigned roommates. Why would one ask the other to do a common chore unless it was decided earlier about turns or if Jamie had dirtied most of the dishes? Brooke is overstepping. Jamie assumed she was doing a power play. I’d say NAH here but it will be a bigger problem with repetition. I second the chore charts or having assigned duties.", "But that's not what you told your daughter.\n\nYou agreed that Brooke somehow overstepped boundaries by asking Jamie to do the dishes.\n\nAsking for dishes to be done is \"overstepping\"?\n\nYou need to figure out how this is going to work.", "It is unfair to have an adult you have no connection to and are being forced to cohabitate with dictate what you should be doing", "Did Jamie have an opportunity to get to know Brooke over time before she moved in? I realize it's too late now if that didn't happen, but introducing a new partner to a household with a child in it is always tricky, because while the child clearly has a greater claim to the history and familiarity of the home, the adult has, well, the authority of being an adult. It automatically puts those two people at odds with each other when it comes to who is more \"in charge\" in the house\n\nIdeally, they would have had the opportunity to develop a relationship with each other before moving in together, including conversations about what eventually moving in together would be like, so that both felt prepared for how they would handle the inevitable disagreements", "Nope.  \n\nIf you ever want hope of your daughter to actually be friendly with Brooke OR any other significant others you might have in the future,  be the sole parent.   Your daughter will respect you more for it in the long run.  \n\nAsking your daughter to do a chore is NOT the role for the girlfriend.  She's not a member of the family as a spouse.  You aren't even engaged.  Brooke has been living with you for a \"few months\". That's all.  In fact, it's possible that by moving in, it created a extra internal stress in your daughter.  Before, you & her mom were split up. \n\nNow, there's a live in girlfriend,  a younger woman  who, for sure has, replaced her mom.  She was handling it OK, until Brooke asked her to do something that her \"mom\" would ask her to do.  And that's the snap back source. Loyalty issue too.   Probably feelings were  quietly brewing, but until that moment, she could keep control. \n\n\n\nIt doesn't matter if mom has a boyfriend or is married herself, feelings aren't logical, especially to a 14 year old. Brooke's familial status is clear to your daughter.  Unless it's an emergency & she's acting in an adult capacity, she's ONLY her dad's girlfriend.  \n That is all.  She isn't on the mortgage or lease either, right?  Other than her relationship with you, she is technically nothing to Jamie, not even a co-roommate since Jamie has NO CHOICE. So do the parenting & asks. Leave Brooke out of it. \n\nYTA", "14 year olds don’t have “roommates”. She just had her father’s GF, not fiancee or wife, move into her home and start bossing her around. I don’t think she has valid authority here and overstepped. Kid responds the way a kid does. The fault lies with the adults for not setting expectations prior to this new living situation.", "All of the language you're using here is the language of Authority. You'll tell them *what you expect*.  You'll put an end to this problem.\n\nDude.  Try doing some LISTENING.  Without coming across as the guy who thinks that the solution to everything is just putting your foot down and making sure everyone does as you say.", "See I’ve read your responses and you’re defending Jamie while throwing your gf to the dogs. There’s nothing wrong with asking someone to do the dishes. That’s not overstepping boundaries. Your gf shouldn’t have to do everything while Jamie does nothing but be disrespectful. You don’t have a problem leaving Jamie home with Brooke but you do have a problem with her asking the child to help with chores. If I was Brooke I’d bounce instead of dealing with your disrespectful kid and you who didn’t immediately let Jamie know she should’ve done the dishes when she was asked.", "Sure, but arguing with them when they say \"no\" is", ">She didn't exert any authority. She asked her to do the dishes.\n\nShe didn't \\*just\\* ask that though. And it was clearly a demand and not a request, or there wouldn't have been an argument in the first place.\n\n>However, she is a member of the household and should be respected as such.\n\nThe daughter has zero say in whether or not she lives with this person, so I don't see why she deserves respect for sharing a space. Also, how exactly was she disrespected here??", "Does the GF show any respect for the kid?   I doubt it.", "Exactly.", "It depends on a lot.  Before GF showed up, was kid allowed to leave dishes in sink?  Are these kids dishes or someone elses?   \n\nI would like to know why is kid there when dad not home and only GF.  Does GF not work?  or works PT?  Lots of issues.", "Yeah, that’s what I’m not getting with all the people calling the dad the asshole. That is a super reasonable request. It’s not like the girlfriend grounded the kid. I think they all probably need to sit down and have a conversation about everybody’s expectations. Teenagers are a pain in the ass, but it’s surely going to be a hard adjustment for the kid. But I don’t think that merits blowing up at the GF over a chore", "Haha, Maybe because I was a stepchild and you are GF?   I ended up spending most of my time at my mom's where I was treated fairly.", "Of course you’re allowed a life but the child comes first and if you can’t manage that you shouldn’t be a parent.", "If OP asked about him being an AH because he refused to do dishes, then I would be saying he was. But this was about his daughter.", "In most states, a judge will listen to where a kid wants to live.  Once kid spends all time at moms, CS that dad pays may go up.", "That's *exactly* how it works. At 14 my husband told the judge he didn't want to go back and forth anymore and wanted to stay with his dad. He lived full time from that moment on with my FIL and he stopped paying my MIL child support...and that was over 20 yrs ago.", "Her teacher actually does have authority over her. Your girlfriend doesn't. Further, your daughter will always be a part of your life (even though you are just a weekend dad) but your girlfriend will be gone eventually. Keep that in mind. YTA", "I understand children don’t dictate their parents dating choices, but you moved someone into her home who she doesn’t like and at 14 she’s struggling to adjust to that.  I also find it troubling you that you refer to her being at your house as visiting when she lives there 40% of the time. That’s her home and she no longer feels comfortable there. What are you doing improve the situation and make sure your daughter is comfortable in her own home? \n\nBrooke overstepped, then when Jamie had a very predictable reaction, she escalated the situation into an argument instead of walking away and letting you handle the situation later. She’s the adult in the situation and needs to act like it. \n\nYou can’t just wait this out and expect it to get better. Maybe you need a therapist to help you and your daughter work through this in a healthy way. In the meantime you should be finding a way to make sure she feels like she still has space in your home and spending ample 1-1 time with her. Don’t force a relationship with Brooke on her. If you end up trying everything and they still can’t get along, you’ll have to ask yourself if the relationship is worth a lifetime of conflict and damaging your relationship with your daughter.", "And what about respect for your daughter? Brooke overstepped her bounds, and that is disrespectful. But you keep insisting that your daughter is the only disrespectful one here. Brooke doesn't have the same authority over your daughter that a teacher or a parent would have. She's just the woman who's dating you.", "An adult she is *forced* to share a house with.", "Don't listen to this turd. They say respect goes both ways and literally the next comment says your daughter doesn't need to respect your GF.", "Did you talk to Jamie about Brooke moving in?  Did you prepare her for what it would be like?  Did you ask her how she felt about it?  Because kids act out when they feel ignored/unimportant.", "A teacher she has to live with and who fucks her Dad?", "Does the adult she shares a house with show her the same amount of respect her teacher does? Brooke isn’t owed respect simply for sharing your bed. Respect is mutual and needs to be earned.", "Your gf isn't in that kind of respect and authority yet she acts like she gave birth to the kid lmao. Did the gf think of forming a bond with the daughter?", "You REALLY don't get ANY \"abuse of power\" vibes, from this woman, do you? \nI bet you think you're an excellent judge of character. \n\n\nWhen you dole out, authority cards to various adults, you are not strengthening the community around your daughter. You are watering it down. \nDo you REALLY want a teacher to have the same influence as a parent? \n\nYou believe that this woman, ordering your daughter to do the dishes, and her not doing them = such a egregious level of disrespect, that gowing forward your daughter is to follow any and all \"orders\", untill you come home. \nEffectively elevating girlfriend to parent/ mom status. \n\nWhat, if anything, has girlfriend done to earn that privileged? Besides you that is?", "Because a parent's GF/BF isn't an authority figure the way a teacher is.", "Asking implies that no could be an answer. If she wasn’t allowed to say no, then it was a demand.", "She can ask, but it can be answered no. She is a GF nothing else. IT does give her any authority over the kid.", "Thank you, you are correct.", "Maybe see if she would be open to therapy or counseling. It can be extremely helpful but only if she is open to it otherwise it'll probably piss her off more. Also remind her that no matter what she is your daughter and you love her, but your life is yours and you also love your girlfriend", "Bingo - Brooke should have deferred to OP instead of engaging in an argument with Jamie. That is the singular error on her part.\n\nSeems to me that OP didn't establish with Jamie what, if any power/authority Brooke has in the household, and Jamie is committed to being as defiant and rebellious as literally any 14 year old would be, lol.", "I’m guessing it wasn’t.  Discipline should be left to the parents but you can’t have a the other adult in the house walking on eggshells or ignoring the kid.", "When asked if she asked or told her to the dishes, OP said she asked.", "OP needs to be in charge of assigning chores and making sure they are done then. It’s ridiculous that anyone in the house can’t ask someone to help with a chore, but if that’s what you’ve decided then there needs to be set chores with consequences for not doing them. Is Brooke also not allowed to ask Jamie to hang up her coat or any other normal thing? That’s not going to improve the situation any, because it’s just allowing Jamie to dictate everything in the house. It doesn’t sound like Brooke is trying to parent, or overstepping. If you frame Brooke asking Jamie to do anything as overstepping the relationship isn’t going to work, just like it wouldn’t work if you pushed Brooke to parent Jamie. It’s Brooke’s home now too, you need to figure out some basic ground rules around respect.", "It’s an opinion sub…", "If the aumduly is Jamie's aunt, then she has a relationship with Jamie.\n\nBrooke doesn't", "She would also be the kids aunt and have a relationship with her for longer that dad has moved Brooke in. Some random your dad is sleeping with doesn't get to tell you what to do. Not for years. when you've earned the kis respect and they can trust you, that's when you have a smidgen more authority. Jamie will be 18ish before that happens hear.", "And so, the hit dog hollers, lol. \n\n>Because they set boundaries stating that Brooke isn’t an authority figure who can ask Jamie for common household duties.  \n\nThis is not stated anywhere in the OP, but go off if you must. \n\n>I think it’s painfully obvious your response is coloured by the fact you never had to navigate this dynamic  \n\nI'm not sure if you're being intentionally obtuse or what, but I fail to see how fabricating an entirely unconfirmed argument and speculating on the conditions of _my_ upgringing could make your case any more salient than calling Cheerios \"donut seeds\".", "A 14 year old can and should do the families dishes. Mine does every night. Kids can and should contribute to all chores they are physically able to do that they benefit from. My older kiddo does all of the dishes, except sometimes I will do heavy pots and pans. They also clean the bathroom. Because we all live here and have to contribute to upkeep. I had a job dishwashing in a restaurant when I was 15, it’s fine lol.", "Does she sniff each dirty plate to determine if the user was under 18?\n\nWhat the fuck?\n\n\"Do the dishes\" means all the dishes that are dirty, not just your own. I would have thought that was normal.", "Oh Jesus, she’s 14 years old. That’s plenty old enough to do dishes. Almost every family I’ve known (my own included) has a rotating dish schedule where someone new loads and unloads the dishwasher every week. I’m not going to comment on the actual situation playing out because I wasn’t there, but let’s not pretend like a 14 year old doing dishes is this unrealistic ask. \n\nThe only way this would be different would be if someone else used a bunch of big pans/dishes to make a big meal and then tried to force Jamie to clean those. That’s unfair. But just general dishwasher load/unload? Come on, that’s a normal chore\n\nEDIT: mixed up names for daughter and girlfriend", "I always wonder if this sub is just all children who think they know more than they know.", "She’s not her stepmom though, she is her dads girlfriend of a few months. I don’t think it is wrong for OP’s girlfriend to ask OP’s daughter if she would help with the dishes (expecting that the answer could be no, because it was a question), but telling her to like she has that authority (which OP has stated that she does not), and then arguing with her was wrong. Girlfriend should have let it be and talked to the father when he got home. It’s also confusing for him to tell his daughter that she was right, but should have done it anyways.", "True, and if so then he’s doing a disservice to both women in his life and causing all this trouble himself.", "Brooke's generally kind to Jamie and doesn't try to replace her mother in any way. Believe me, if she was mistreating Jamie I'd dump her.", "Nobody's lashing out at anyone except possibly for Jamie.", "wtf are you on about? Did you just invent a grievance against the dad out of thin air? Keep reachin, sunshine.", "This is really gross language used to talk about a person that the OP is dating, with absolutely no indication that OP goes through relationships at a fast pace.\n\nI really hope you're projecting and don't just hate women.", "I can’t rlly say whether or not I think that comment was truly insulting, as a part of me thinks she was right but another part of me thinks she should’ve just left it at no and that saying that was unnecessary.\n\nWhat I will say is I don’t think the gf should’ve pressed the issue with her then. If she didn’t like the comment, that’s fine, but she should’ve talked to the dad about it. What did arguing with her do? The daughter made it clear she wouldn’t listen to her, but she would listen to her dad. Her dad should’ve told her that saying no was fine but to just leave it at that, just “no.” Her pushing it right then and there instead of taking it to her dad just made the daughter angrier and she doesn’t have the authority to punish her so she can’t stop her from doing it.\n\nI rlly just think she should’ve got the dad involved once the daughter made it clear that the issue wasn’t about the dishes.", "If she said no there wouldn't be a problem.  She said no and then twisted the knife.  Thus there is a problem.\n\n14 year old needs to be taught to be more mature.  She's of an age where \"no\" is an important word to learn, but it's gonna be important for her to learn HOW to say no.  Because HOW can be very impactful and can make or destroy relationships.", "Yes I agree, IF the boundaries were set. It sounds like they weren’t. It sounds like boundaries are being decided after the fact based on whose reaction is the most dramatic. Boundaries are meant to prevent problems, not to underscore them.", "Yall are gonna have a hard time in the real world", "Most seem to be naming him an ass for rolling right over his daughter. If they agree Brooke overstepped, then Brooke owes Jamie an apology. Instead, he tells his daughter she's to be treated with respect. Why? What has she done to earn anything beyond general courtesy. And it can be inferred that Brooke has been earning less and less general courtesy.may even be stepping into outright ire", "She’s an adult who lives there full time. Asking a 14 year old to do a household chore well within her capabilities isn’t overstepping any bounds. If you, an adult, were staying in my house like this I would 100% at some point ask you to do the dishes. Asking a kid in a house you live in to contribute to household chores is generally not some big bad evil. It’s pretty standard in my experience", "Why is doing the dishes, a common duty that virtually all normal households share responsibility for, being deemed a command that warrants this much indignation? I assume Jamie is fed at OPs house, thereby contributing to the accumulation of dirty dishes, so it's not much more than a simple request for her to assist with a basic chore.\n\nWould Jamie have done the dishes without resistance if OP had asked her instead? If so, then Jamie is simply being spiteful, and choosing not to validate Brooke's authority. I could find some justification in Jamie's favor if Brooke's authority has not been explicitly dictated to her by OP, but it's still pretty hard not to view her response as being bratty for the sake of it. If Brooke's request were unreasonable, or she had tried to discipline Jamie when she refused, then we may have a more black & white scenario to judge. Otherwise, Brooke's only error was arguing with Jamie instead of immediately deferring to OP to handle it and properly establish the expectation that, while she may not be Jamie's parent, she should still be respected and considered an authority when OP is not present.\n\nAt the end of the day, this sounds more like a lack of communication on OP's part. It's a learning opportunity for everyone involved, so NAH here unless OP fails to rectify the situation in a neutral and constructive way.", "So, she shouldn’t have asked her to wash some dishes? And when she did and the kid refused the girlfriend should have just cowered into the back corner. Fuck that. Girlfriend has every right  to ask kid to help around the house.", "Being asked is not a command.", "I could be wrong here, but recently moved in doesn't mean recently dating. They could be at the stage of talking marriage, etc. At that point, it definitely is her place. OP sucks here though, he's been far to passive until now by his own admission.", "What is her place? Is it in the kitchen with a baby (of her own) on her hip? I thought adults were supposed to be adults and ensure the house was taken care of, even if that means telling a child who lives in the house to take care of it.", "She isn't commanding her. She's asking her to help and do a chore. Maybe it was her dishes? Why should brooke do the kids dishes? I'm sorry, but it's normal to help out around the house. She sounds like a spoiled brat.", "Didn’t OP agree with that? It doesn’t negate the fact that Jamie needs to be respectful.", "She's an adult which makes her an authority figure in the household. Like it or not children are required to listen to the adult authority figures in the home. OP has made it her place.", "I was raised that step parents are parents. I'm not sure when family became only about blood, not about relationships. Like by the system yall have hate if Jamie was adopted by a family she could just not listen?\n\nAs with any relationship, if Jamie is over worked or otherwise can't do something she should say so, but just deciding she doesn't want to do it is wrong. Once done she can talk to either parent at dad's house to get clarification on why she needed to do it, but arguing at the moment of twist is a losing battle (and it should be, unless the request is outrageous or dangerous)", "In all reality Brooke has the authority to punish Jamie. She is an adult in the household.\n\nThat said Brooke can't do something stupid like telling Jamie she is grounded for 3 months for not doing the dishes, but something reasonable (go to your room) is fine.", "Ah, thanks.", "This subreddit has become hot garbage", "Everyone on this subreddit makes every step mom sound like she's evil. It's insane reading the comments. \n\nIt's okay to ask the kid to clean up after herself or clean up. It's also okay for a parent to date another person after a divorce even if your kid doesn't like it. \n\nEveryone assumes the step parents are awful vs thinking maybe the kids are spoiled or in the wrong. I honestly think everyone commenting must be an angry teenager.", "This sub was driving me crazy until I accepted that it is likely the home to a bunch of kids or basement dwellers. Once I came to accept that, it doesn't drive me as nuts. \n\nIt just means if you are asking an aita question, you have to throw out a good 60-80٪ of the opinions with the understanding that they are kids that are responding.", "It’s full of obviously young kids and nosy people who live off drama.\n\nI think there’s so many young people here because of the trend of these types of threads on Shorts and TikTok.", "It really feels like people on this sub just read the \"I, whatever age, male...\" and jump straight to YTA instantly no matter the scenario.", "Eh. Arguing with a teen is a pretty normal thing. Have you met teens?? lol sorry trying to be funny not snarky", "She's 14 and the gf is responsible for her for the time being. Brooke is within her rights and nta. It's a simple task.", "Ok but like kids get asked to do chores at camp, at some schools (should be freaking ALL of them) and I’ve 100% was asked as a kid to pitch in a friends houses from time to time. None of these people have established a familial relationship with kids and they get to ask. If you live with someone being asked to share in communal chores isn’t really something a relationship needs to be built to do…", "I love how stepparents need to view their stepkids as fully theirs and treat them exactly the same, but that doesn't include asking for even the simplest of chores or household tasks or responsibility. And stepkids get to treat the stepparents like shit all the time with no consequences.", ">Why would one ask the other to do a common chore unless it was decided earlier about turns or if Jamie had dirtied most of the dishes?\n\nBecause Brooke was running late, because no one decided who was going to do it, because broke was choking for, honestly there's hundreds of reasons one roommate would ask another to help with a common chore", "Overstepping my 🍑... 🤦🤦🤦", "Brooke is not overstepping a dang thing.  If she is the only adult in the house then she has every right to ask/tell the spoiled brat to do the dishes.", "So using your analogy she doesn’t need to do anything for the kid then. Or will you say she is an ah if she doesn’t?", "They aren’t roommates though she lives there and is dating the dad I don’t expect her to treat all amzing but icl I do think the child needs to treat with normal decent and listen.", "Exactly! Dad needs to stop thinking with dck and start paying attention to his daughter. OP, have you ever talked to your daughter about your girlfriend? Before she moved in? Ask her how she feels about it? That's your kid dude. Do your job.", "Yeah, I read the story and OP's responses and in Brooke's shoes, I'd bounce -- or at least start preparing my exit strategy.", ">There’s nothing wrong with asking someone to do the dishes.  \n\nThere is if ground rules and expectations weren’t reviewed before the move in.  If nothing was discussed between the couple and/or between OP and Jamie then I could see Jamie feeling resentful.  Based on the post and OPs comments it sounds like the move in wasn’t handled great and it was set up for failure.  Big changes require communication for things to go smoothly.  Hopefully OP has learned and will take that into consideration moving forward.", "This. OP even said Jaime has been being disrespectful before this. Teenagers are jerks, I raised 3 of them.  Brooke should follow OPs rules...to the letter. And give him some of her own. As in do not ask Brooke to do ANYTHING for that child. OP does it all.  Everything. I wouldn't so much as pick up snacks at the store for Jamie.  I wouldn't clean a single dish or item of clothing that Jamie used. Let OP handle it, he clearly has in the past and Brooke moving in should not change his responsibilities to his child in any way. Don't be mean to Jamie, just don't engage with her at all.  Brooke gets boundaries also, and how a child talks to her and acts can be her boundary.", "She started the argument by telling her she’s not her mom and she doesn’t have to listen to her. Nothing says she told her to do it anyway.", "By that logic since kids have zero say in anyone they live with then they don't need to show respect to anyone in their home.\n\n14 year olds will find an excuse to argue with wet paint.  The fact that Jamie was arguing and trotted out \"you're not my mom\" isn't proof positive that she was being disrespected.  It's proof that she's 14.", "Oh clearly. Because 14 year old children of divorce are *never* overly dramatic.\n\nAll people deserve basic human respect.\n\n\"You're not my mom, I don't have to listen to you.\" is completely disrespectful. She wasn't acting as her mother. She was asking her, as one member of a household to another, to do the dishes.\n\nTry saying that to a roommate in the same situation (the request and the response) and see what happens.", "That's a massive assumption.", "Normally my mindsets tend to agree with more of the younger generation mindset, but this is one instance where I’m baffled at all of the people trying to claim that dishes are this super unreasonable chore for a 14 year old. I realize that the context is what makes this situation more complicated, but a serious girlfriend (who at least lives in the home) asking a teenager to do dishes is not this wild and insane scenario that so many people are trying to make it out to be", "OP has said in comments repeatedly that the rules of the house are that only he is allowed to assign chores to Jamie, and he agrees that Brooke asking Jamie to do the dishes was not in accordance with the household rules. But he won’t back Jamie up for trying to stick to the rules as she knows them to be - which is that only her actual parents can assign chores, and Brooke is not her parent.\n\nThat is what a lot of people are criticizing, along with the fact that if it really had been “just an ask”, Brooke would have let it go at least refusal rather than getting into a fight with a teenager. It’s not “just a question” if you won’t take no for an answer.", "So basically if your kid, at any age or mental ability, isn’t 100% on board for a decision, you shouldn’t make it. That doesn’t sound like a life to me.", "Describe what you believe is putting your child first. Where is the line?", "They won’t change custody and support over your girlfriend asking your kid to do the dishes one time.", "Settle down", "Overstepped her bounds??? By asking her to *do some dishes*???? This sub really makes me feel insane sometimes", "This is un fucking hinged", "It cannot be answered no. She is a kid living in HIS house she has to follow his rules lmfao", "Except she didn't say no, she said \"you're not my mother\" which is blatantly disrespectful for a simple request to help clean a mess she no doubt contributed to. She's 14, not 6.", ">t it can be answered no.\n\nSee this is where you're wrong. The kid should be doing these chores anyway and being reminded by the adult is not an overstep of authority. Who is she to think she is to be getting out of them? What is she doing that's so important? Bringing in funds to support the household? No? Studying to get a scholarship? Maybe. Texting or scrolling Tik Tok? Highly likely.", "It's easy this stranger has 0 authority over the child.  As with any random person introduced into your life.", "Then how does an argument ensue if the gf supposedly asked and let it go? If she asked and the kid said no, she clearly pushed the issue and at that point it's not an ask no matter how much you word it as such", "And I'm surprised everyone here is overlooking the fact that Brooke and Jamie were home alone because OP was at a meeting on a weekend.  And what I'm also missing here is whether Jamie is usually expected to take on household chores and only refuses when Brooke asks. This would be a YTA for OP and Jamie and a N T A for Brooke.", "There’s no opinion needed on whether Brooke overstepped her boundaries though, that’s an agreed fact.", "She’s not some random person, she’s the OP’s partner. Kids often see their aunts and uncles a few times a year if that. It’s possible she would have had way more time cumulatively getting to know the girlfriend than an aunt. \nAny adult living in the house gets to tell you do the things you’re supposed to do anyway, like the dishes.", "Well, the fact that the OP agreed with his daughter that Brooke overstepped would suggest that the boundaries are clear, if not explicitly stated.\n\nI didn’t think anything I said was obtuse tbh, but while we’re on the subject of obtuse comments I don’t understand what point you’re making with the donut seed Cheerios simile. I am interested in the metaphor about the hit dog hollering though, what does that mean?", "I think this person just meant that it would be a lot to start asking a 14 yr old to start being responsible for the messes of adults. Cleaning up after themselves, for sure. Lending a hand with messes made by the whole family (“I wash, you dry” or “I scrub, you load the dishwasher”), fine and dandy, but asking a kid to do the job of the parent is a little more of a grey area. I’m just guessing that’s what the other commenter meant, and you’re still free to disagree, but I think that would be a fair and reasonable point of view to have.\nEdit to add: not everyone has the luxury of a machine dishwasher, and being asked to manually do all the dishes of all the people in the home is definitely not fair to ask of the kid in the house. That’s a parents/guardians job. (Of course the exception being if you made the mess yourself)", "I swear, before AITA blew up on TikTok and YT Shorts, people were actually fair and levelheaded in the comments. There were some slightly unhinged users, but their comments usually got buried. Now it’s like it’s just teenagers who think they’re immune to rules and etiquette 🤦🏻‍♀️", "It’s mostly kids and bored stay-at-home moms.", "Yeah, I mostly come on here to share screenshots for my friends to laugh at so they’re providing me with plenty of free entertainment 😄", "Well. If OP responds smartly, he can use this opportunity to set the boundaries and expectations clear.\n\nMake it clear and obvious for everyone involved.", "But things may be different when you are not home", "> Believe me, if she was mistreating Jamie I'd dump her.\n\nSo what exactly happened that made you agree Brook was overstepping?", "“Generally kind” isn’t much of a glowing review of her behaviour.", "Do you know how Brooke treats her when you are not home?", "I sincerely doubt that.", "Do you know how things are when you aren’t with them?", "Grievance? It sounds like they’re just pointing out a perspective that hasn’t been taken into account yet.", "Why did she twist the knife? Did Brooke accept the initial No or did she push? None of us knows how that conversation played out or how Brooke has really treated Jamie in the past. OP *thinks* Brooke has been “generally kind,” but they were fighting while he was gone. He has no idea what’s been said when he isn’t there.", "Except even OPs comments said the gf OVERSTEPPED by asking her to do the dishes. So clearly some boundaries were set.", "Yup. And OP doesn’t mention it, but I’m willing to bet she pays bills there, too. She’s now one of the heads of the household. Daughter doesn’t need to call her mom or consult her about private matters, but showing a modicum of respect and accepting chores should be expected.", "This is something that needs to be discussed in advance. \n\nIn general, However, dad's gf is not a parent and has no authority over the kid. \n\nThat can change, but those boundaries need to be clearly defined.", "You don't know what Brooke's standard housekeeping is like though. If I came over to my dads house on Friday night after dinner and Saturday morning his girlfriend was telling ME to wash the dishes, I'd tell her to get bent. I'd tell my mom the same thing at that age- and we did fight over exactly this situation, often, because as I was going to school and heavily involved in extra curriculars, I literally never ate any meals at home during the week. Mom's not domestic in any way, and as she was used to me doing most of the house work, she saw no problem with not doing any dishes for herself and my little sister all week , because she thought I would do it all on the weekend. Nope.", "But daughter isn't staying at GFs house.\n\nThat is literally the daughter's house which GF just moved in to.\n\nIt is not GFs house it is OPs house", "💯", "Not if the father isn’t there. The kid has been around longer  than the gf and a parent’s new partner doesn’t get to assign chores unless there’s been an agreement with all 3 present. Not because the daughter shouldn’t help, but she’s not the parent.", "It is if you don’t take no for an answer.", "It's not being \"asked\" if it then turns into an argument when the kid says no. Thats just a command in disguise", "Well Brooke argued because she said no, so sounds like it wasn't asking but demanding.", "It is if you argue when the kid says no. It was NOT th GFs place to ask. And my kids have a atepdad and I would never let him have that control. This is a new GF too. Not someone important", "Simply being an adult does not giving you command over a teenager who is inside the house. She’s old enough to be alone in the house and doesn’t need a babysitter 24/7. Her father is responsible for telling her what to do, not just any adult who happens to be in the home", "I mean if it was a request why did they fight about it when Jamie said no?", "But she's not a step parent though and the understanding was that she doesn't ask Jamie to do any chore. That's the deal they have currently and they have to reassess to change it. You can't expect to run over one of the parties in the deal and it be fine.", "Was it ever not hot garbage? It's always been one big advertisement for therapy and divorce.\n\nAny problems in your life? Therapy. Not working? You just need another therapist. Still not working? Another therapist. Still not working? You must be the problem then.\n\nor\n\nHave a disagreement with your spouse? Sounds like gaslighting to me, time for a divorce OP.\n\nThe best part of this sub is seeing people make up wild scenarios to fit a narrative they want to disparage.", "Yep. Everytime I hear my teacher friends/family talk about what undisciplined, rude nightmares the kids are today, or read news stories about their antics, I think more & more about the commenters on this Reddit sub being the parents of those terribly-raised kids or they're the kids themselves taking a 3-minute break from posting stupid shit on TikTik to comment stupid shit here.\n\nHow does anyone in their right mind think it's \"overstepping\" to ask a fucking 14 year old to do dishes for a meal that was presumably cooked for her that she ate, or used some of them??!! Spoiled little beast playing Daddy & Daddy allows it. If I'm living in that house, paying my share, and (possibly) cooking for the kid, that kid's gonna do some dishes when I tell her to. She didn't get to be a bad human on her own, Father is definitely YTA for enabling her entitlement.\n\nHow TF is that garbage take above the top answer, let alone 1k+ agreeing?!", "Hot Garbage!!  Leave my ex out of this!!", "Bots. So many bots", "Oh no poor men", "Teens are grade A AH's. Lol. Unfortunately most of the responders on this forum are also teens, so you are getting a teens take on things.", "It is not normal.\n\nYou don't fix problem by arguing.\n\nHow can you expect a teen to control their emotions when you can't do it yourself?", "Fr. Bunch of lazy fucks on this sub that never had to do chores.", "Brooke isn’t responsible for Jamie, Jamie is old enough to be home alone which means that so long as she’s under her fathers roof, the father is responsible for her, not whatever other adult happens to be around at that time", "I agree but if she doesn't listen would still let the father know.", "So at camp those adult actually were given authority over the kids.\n\nTeachers have authority over kids.\n\nThat is their role.\n\nDad gf doesn't automatically ear authority it has to be earned.", "She’s not a step parent. She’s a girlfriend.", "Do stepparents have a greater responsibility to stepchildren than vice versa? Absolutely.\n\nIs this woman a stepparent? No.\n\nIs deciding to have a power struggle with your boyfriend's teenaged daughter, rather than discussing your concerns with your boyfriend, a stupid and childish thing to do? Yes.", "One is a kid with no say in essentially strangers to them moving in, one is a full grown adult who made the choice to move into a house with an already established family in it. She doesn’t get the choice, Brooke does. Brooke is the one with the burden of being more careful though, it’s just something you have to take on if you’re moving into a home with multiple people in it, especially since it’s only been a few months. Don’t date people with kids if you can’t respect that it’s hard to get along with kids and can’t wait to let things settle, especially if the kid is a teenager which is already a bad age\n\nBut in its own way, no I don’t expect Brooke to do everything for Jamie either. Be a responsible adult, yes and what that entails. Go with her to doctor visits, attend activities or games, and give her deep intimate parent talks? No.", "It's unlikely that your Brooke, the gf in this post.\nBut what does appear clear is your likely the gf or ow in real life to a person w/kids judging by your comments here.", "How exactly did the daughter start the argument by stating a basic fact? And if that was the end of the conversation, then there wouldn't have been an argument.", "Are you saying you expect your roommates to do your dishes?", "Dishes are not an unreasonable chore for a 14 year old, *if* the person assigning the chore is a parent or guardian. If it’s the dad’s recent GF who already doesn’t have a good relationship with the daughter, it’s absolutely unreasonable for the GF to try to assert any kind of parenting role over the child. And assigning chores *is* a parental responsibility. \n\nI would be equally pissed if a grandparent tried to give my kid a job in my house and argued with them for saying no. Don’t assert authority you don’t have. Don’t yell at a kid who isn’t yours.", "That’s not what I said at all. I suspect you intentionally misconstrued it but whatever.", "They will likely change custody if a teen asks for it, and then Child Support follow custody.", "Struck a nerve?", "I feel like I’m in the twilight zone", "Speculation; Brooke has only _lived_ with OP for a few months, but we don't know exactly how long OP and Brooke had been dating prior to co-habitating. Unless OP is deranged and lacks enough basic judgment to avoid U-hauling Brooke into his home and his child's life as quickly as possible, I'd wager that referring to his live-in GF as a \"random stranger\" is a bit more than an embellishment.", "She asked, the kid threw a fit and said “you’re not my mom” instead of saying no. That’s when the argument happened. Brooke should have just dropped it, but that is easier said than done when a 14 year old is being as rude as possible to you all the time. Brooke is a person and is within her rights to set boundaries about how she is spoken to, including to a child she isn’t the parent of.", "I mean you can’t say clearly the gf started the argument at all.  OP doesn’t say.  It could just have easily been the kid saying “don’t tell me what to do your not my mom”.  Definitely would have started an argument with my stepdad.", "Thinking kids can’t do totally normal chores is why young adults can’t manage their lives. A 14 year old can do the family dishes and will be just fine, even if they have to wash them by hand. It’s like 20-30 minutes", "What household did you grow up in? If I did dishes, it was everyone's. If I did laundry, it was everyone's. If I swept the floor, I swept the whole floor, but just where I had been. \n\nIt is an odd dynamic that a 14 year old would not help the whole daggum house.", "Even YouTube channels dedicated to 15 min+ videos of straight up AITA threads didn’t cause this kind of influx 😭", "If that's the case, Jamie hasn't said anything to me about it. However, I'll talk to her about it.", "Brooke shouldn't be asking Jamie to do household chores. I do think that was a little bit of an overstep.", "I’ll never understand the need for excessive pedantry over words on this sub.", "Boundaries were clearly assumed. Were they ever actually discussed and defined? Was it made clear that during the 40% of the time OP teenaged daughter lives with them that G.F. must cook for her and clean up after her without ever expecting the daughter to lift a finger at any time? If so, G.F. clearly overstepped her boundaries. \nBut also if so, then G.F. needs to pack her stuff and GTFO of this master/ slave relationship while she still has some sanity left.", "I agree they should have had this convo well before gf moved in. But I stand by my statement that being asked to do a communal chore in a house you live in is not some big bad awful. People really need to stop coddling teens around chores man.", "So GF should not buy food for Jaime, cook for her, or anything of the sort since she is not the mother?", ">In general, However, dad's gf is not a parent and has no authority over the kid. \n\nThat's completely wrong. The GF is an adult in the household, that makes them an authority over all children in the household. Children are to listen to and follow the instructions provided by any adult in the household, parent or not. The fact kids arnt being taught this is one of the reasons they grow up to be shit adults.", "Umm did your parents never ask you to do the dishes?  Did a friend’s parents ever ask you to clean up after dinner?  \nI was taught manners. If you eat a meal at home or someone else’s house you offer to do the dishes.  I hated doing it as a teen but the GF isn’t doing any favors to the teen by doing all the housework.", "You haven't been around teens very much have you. After the 'no' as far as we know Brooke may very well have said fine. Teens are very capable of STILL taking that and creating an argument. \n\nWe don't know how the argument progressed. We don't know if Brooke back off or if she pushed. We don't know if the daughter turned full Linda Blair a'la The Exorcist. We just know there was an argument.", "Have you been around a teenage girl?  Being asked nicely about anything can turn into an argument.", "Brooke argued because being told \"you're not my mom\" after making a perfectly reasonable request is highly disrespectful. \n\nWe don't know how the argument played out, we don't know what Brooke said, we only know they were arguing. Brooke easily could have simply been telling her \" do not speak to me that way, I have done nothing to deserve it\" \n\nWe simply don't know. Bottom line, she was asked to do the dishes, she got pissy because someone had the audacity to request something of a teenage girl. She knows she can use the overstepped boundaries to her advantage, and she tried to do it here.", "When you live there you do have command over someone that dose not. If she is old enough to be left alone then she is old enough to wash the dishes.", "What would make Brooke a step parent? Does one need to be married to be a parent? A step parent?\n\nDid OP at somewhere else that the agreement was no asking Jamie to do chores? I didn't see it, sorry. If there was an agreement then us they need to figure olit out together.", "I mean therapy is a very hit or miss thing....it really is about finding the right therapist. But I get the general idea of what you're saying.\n\nThe number of extreme NTA Or YTA is insane....and has gotten worse.....there used to be at least a few posts that occasionally were semi sane....but now it's EXTREMELY rare.", "This is exactly how I feel even going on Facebook...I get therapy advert after therapy advert. It's severely annoying.", "Yeah I’m surprised the first comment wasn’t a “get divorced” comment.", ">Any problems in your life? Therapy. Not working? You just need another therapist. Still not working? Another therapist. Still not working? You must be the problem then.\n\nHave you considered therapy to get over your dislike of therapists?", "You forgot that they really really hate dogs", "A lot of kids are literally raised by tablets and youtube these days.", "Because it is 14-year-olds upvoting who have never had to wash a dish in their life.", "And that's the mind set that I think is wrong.\n\nThe kid has no choice I the matter .\n\nIf you're in a relationship with someone with kids and you live in to their house, and star paying bills, you are helping your SO not their kids.\n\nIf you want the kids to listen to you and to respect you, you don't go up to them and be all like \"well I paid for the food you ate tonight\" you build a relationship where they learn to trust you and they see you an authority figure.\n\nHaving sex with their parents doesn't give you authority over them", "You ever have a stepmom who hated you?\n\nShe’s barely old enough to be Jamie’s mom and we only got the tail end of what Mr Happypants thinks he heard\n\nDismissing kids just because they are kids? That’s just as fucked up", "If you think just trying to control kids with RESPECT MY AUTHORITAH is the way to produce well-behaved, thoughtful teens...\n\n... You're the parent of those disrespectful kids if you're a parent at all.", "I'm sorry I thought your ex was dumpster fire! My mistake I apologize!", "Do we need to drop the mental health/suicides statistics?", "Oh for sure. It’s really funny to watch the answer/upvote/downvote trends before 5pm on the weekdays. You can literally watch the adults get on here after work and things sway in a different  direction", "I would not have my husband tell my kids what to do. Especially before we married and right after we moved in. And absolutely not without eiscisson boundaries with him and my kids. They're adults now but when they were teens he was NOT their parent. OP is wrong and his GF is way out of line.", "14 year olds still need to be supervised and asking to do some simple chores is not unreasonable.", "Uuummm Brooke did let the father know…", "Yeah I know. I just think people freaking out that someone asked a kid to do an easy chore is wild. The gf should have stopped when the kid got ugly and tried to buck up-that’s where dad is needed. But I don’t think asking crossed any boundaries", "I mean, adults are people. It sounds like the kid has been rude, shitty, and disrespectful for weeks on end and Brooke wasn't having it. \n\nAdults are allowed to have an end to their patience, and it seems that in Brooke, that just looks like asking a kid to do the dishes. To me it sounds like the take of \"she overstepped but holy shit you need to start treating her with some respect\" is a pretty reasonable fucking take.", "Yup and adults make mistakes too. It can be hard to avoid arguments with teenagers if we’re being honest. But yes, gf should have dropped it when kid got ugly with her. Everyone has to learn and let’s hope no one stops learning just cause they aren’t kids anymore", "Actually you are wrong on both counts. \n\nLook everyone is saying the gf isn’t related and can’t say anything to the girl. Surely no say means no responsibility.\n\nTo clarify I’m a male who has 1 son with my partner and we have been together for over 20 years.", "You know it’s not stating a basic fact that was a statement to bring a rise out of the girl friend who asked her to do one thing", "Yeah. If I’m cooking for the roommates I expect them to be a part of the clean up. Thats basic levels of respect.", "No one yelled at the child, no one asserted authority they didn't have, no one argued with the child. Brooke went to OP after the child decided to have a tantrum for being asked a reasonable thing.", "That's what you implied lol", "That is what you implied. So if it isn’t what you mean, then where is the line? Because I think a parent making decisions about their love lives is kind of their own business and not the kid’s.", "That's the typical rude card played by kids in this situation many times.", "She might be uncomfortable to tell you if there is something going on when you’re not home. I think you should sit down with Jaime and try to get her to explain how she’s feeling and what’s going on.", "So if it’s an overstep - as you’ve said repeatedly in the original post and in your comments - how is Jamie saying “no” inappropriate or disrespectful?", "Wait.... Do you ask Jamie to do household chores? Since she is with you 40% of the time, she has set chores ... Right?\n\nBecause if you don't direct her and she doesn't have set chores, that's a problem.\n\nBrooke should not be expected to do anything for your child other than be polite. Not get groceries, do laundry, clean her dishes..... Nothing. You are the parent. So....parent.", "Ok In future don’t ask or expect her to do anything for your kid. You can’t have it both ways sorry.", "I agree it is not big bad awful,but it is also not big bad awful for a 14 year old girl to not want to take commends from dad's gf.\n\nShe does have a point, she is not her mom. \n\nIf the dishes are her chore, assigned by dad, sure.\n\nBut this was some net new thing that the gf wanted the kid to do.", "Gf should do her share of the household activities just like the daughter should (and dad should).\n\nOne of the activities that should be dad's job and not her job is parenting the kid including assigning chores.", "How far does this authority go?\n\nInteresting question. \n\n\nThere is a degree of authority that all adults have, but i see assigning chores as parenting which is outside of that scope. \n\nThe three of them need to sit down and discuss this.", "She's not a parent. She's not even a friend's parent (actively ignoring the fact that guests usually aren't asked to clean just anyways). She's the dad's girlfriend. It's not super appropriate for her to be handing out chores to someone she barely knows. That is something reflective of a parent's duty. Kids aren't so fond of parent's girlfriend and boyfriend doing that kind of thing without some guidance from actual parents because they just don't have that relationship.  It'd be different if the dad had asked to pass along chores and the kid flipped out but that wasn't the case. The kid is resisting a huge change in the relationship between herself and the girlfriend. That's normal and needs to be handled gently. Blended families are difficult and forcing these things can make the kids miserable.", "It’s also not her place to set the rules, that’s a recipe for disaster.", "Does’t really apply to my comment. We don’t know, the other commenter assumed that GF didn’t force the issue. My teen is very helpful so your comment about me not being around teens also doesn’t apply.", "Same with a tween. I can say the most bland thing to my tween and she gets pissed cause she thinks I said it in the wrong tone. Like what?", ">Brooke argued because being told \"you're not my mom\" after making a perfectly reasonable request is highly disrespectful\n\nReally?  Why?\n\nI think it is perfectly legitimate to draw the line that dad's gf is not her mom.\n\nJust because she is an adult, does not mean that she gets to command all house occupants around. \n\nThe gf JUST moved in a few weeks ago.\n\nThis is not the time for the gf to start playing mom and ordering anyone to do chores. \n\nChores should have been clearly defined by dad.\n\n>she got pissy because someone had the audacity to request something of a teenage girl.\n\nI think you are missing the point here.\n\nShe got pissy because gf is starting to take on the role of a mom.\n\nI think that is 100% legit.  Especially since it was clearly a command and not a request.", "OK. I agree with that. It's definitely gotten worse.", "We need Cesar Millan to come in here.", "Yeah it is.  We let the insane run the asylum while we are gone. It explains the answers for sure.", "Yeah I can't believe everyone is missing this. \n\nDad's new gf moves in and starts to thing she is co-parenting?\n\nWTF", "I think it is 100% legit to not want your dad's new gf to start taking on the role of mom.", "I mean as soon as she insisted and got into a fight she crossed boundaries.", "What about roommates child?", "Um, no. He walked in to find them arguing. By OP’s own assessment, Brooke overstepped. If she wasn’t trying to assert authority, what were they arguing about? Brooke asked. Jamie said no. It should have ended there. \n\nUnless you’re Brooke, you weren’t there. You have no idea what tone she used or what she said. Neither do I. But I *do* know she argued with a child who isn’t hers over something she had no standing to ask.", "He flat out says in his initial post he walked in to find them arguing, so your comment is categorically wrong.", "It's also pretty easy to ignore. Like it's barely even offensive. It's the truth. But forget that. Lets remember a 36 year old woman let a child control her emotions. If she is an adult worth listening to, why is it so easy to push her button.", "If it’s anything like the situation I was in where I did spoke up about what was happening then I would understand why’s she isn’t going to say anything.", "I think saying “no” is perfectly reasonable, but answering the request with “you’re not my mom, so I don’t have to listen to you” is inappropriate and disrespectful, especially at 14.", "Where in any of the post or comments has OP asked or expected his gf to do anything for his daughter??", "A child and an adult should have different expectations.", "Nah fuck that, literally any adult I am around I will ask to do dishes if they are eating and didn't cook. Who raised y'all? This is like... The barest modicum of respect for someone who you're living with.", "That’s real. I’m just chucklin over it now", ">There is a degree of authority that all adults have\n\nThe degree that adult has is absolute authority, it's not flex or up for debate. If you are in an adults home you do as you are told or you leave, those are your options. There is no need for a discussion.", "She fucking asked the fourteen year old to do dishes and the kid got an attitude so she stood her ground lmao. That's a simple ask that I will fucking tell my adult roommates to do and no one cares. It's not attempting to co-parent lmaoooo", "she asked someone living in a house that she also lives in to do the dishes. Relax", "Telling a 14 year old to do the dishes isn't even a co parenting thing tho. It'd be the same if she was living with a family member, \"please what the dishes you left\"", "asking someone to do the dishes isn’t taking on the role of the mother", "This level of request isn't parenting, it's a flatmate level request", "Gtfo with your strawman, argue the point at hand or don't.", "Honestly I’m a little torn. I don’t think asking a teenager to do the dishes is some wildly inappropriate ask. BUT OP believes it is and has said so quite a few times, so that’s the basis we’re working off of (and FWIW, Brooke is essentially a roommate as far as Jamie is concerned, and I can’t imagine fighting with my roommate because they said “no” when I told them to do some specific household chore). \n\nCould she have just said “no”? Of course! But she’s a teenager who is almost certainly struggling with/upset about her parents’ divorce and father’s new relationship. Saying “you’re not my mom” is not only a completely benign 100% factual statement, it’s also a VERY typical thing for kids to say to their parent’s new partner. I honestly don’t think it’s that wildly disrespectful or inappropriate. It’s a basic factual statement, and if hearing it said upsets Brooke so much that she starts a fight over it, that’s a much bigger problem than a teenager being mildly bratty.", "Brooke was doing household chores.  If OP isn't helping with those chores then Brooke is getting a really raw deal here.", "Nah ah either she has responsibilities to the kid or not you can’t pick and choose.", "Hint: it's not about the dishes. \n\nObviously the daughter need to have a talking to about being more respectful but that is like totally normal 14 year old stuff. \n\nThe dishes were just the straw that broke the camels back. \n\n\n\nI was raised in a household where we had chores and we all pulled our fair share.  It was very balanced and everyone had clear age appropriate expectations put on the which were communicates by a parent. \n\nIf the dishes are something the daughter should do, not Problem. \n\nThat is dad's decision\n\nI get that you think dishes are a totally normal thing and I generally agree.   But the daughter can and should be able to set the boundary that the gf is not her parent. \n\nMy terrible terrible step mother was like this. She walked into an established and functioning household and wanted to be the boss. \n\nMy step father on the other hand was smart enough to leave parenting to my mother, at least until we had established the", "Agreed, this level of request is not parenting, it's simply doing chores. Parenting is guidance, right from wrong, morality and behaviour. This is \"I made dinner, please do your share by at least doing something\", and you are right, it's a flatmate level request and totally not unreasonable to ask of your partners kid, even if you are reasonably new in their life.", "Where did you get the part about daughter doing the dishes she left?  \n\nAll we know about the dishes is that Brooke asked Jamie to do them. \n\nWe know nothing about how many dishes.  Though I would argue that \"the dishes\" implies not just Jaime's dishes as you seem to think.", "I get where you’re coming from. I guess in my house, it’s standard to ask kids to participate so I’d side with the GF. \n\nObviously “you’re not my mom” is factual and mostly fine in my books, but it isn’t a good enough reason for “I don’t have to listen to (or help) you”. If my kid said that to one of my friends (nevermind a live-in boyfriend), I’d be embarrassed, and having a talk with the kid about kindness or respect.", "Fair, but that’s more general upkeep of the home more than “doing things for his kid” and it could also have been something Brooke wanted to do in order to contribute to the house she’s just moved into. I’m mostly just pointing out that OP has never mentioned asking or expecting Brooke to do things for his kid, so I don’t know why this person keeps commenting this same thing in different comments under this post.\nBut also yeah OP better be doing his fair share of the house work."]}