{"id": 32674, "submission_id": "18eip9w", "title": "AITA for walking out of a dinner after being accused of supporting incest?", "selftext": "Hey. I'm posting on here because I need people's opinions on this. It's so fucking stupid and such a non-issue, (unless I'm wrong about that too) that turned into something bigger. \n\nFor reference, this happened on Thursday evening. We are all in our early 20s and all names are fake.\n\nThursday was our friend \"Sarah's\" birthday. To celebrate, our friend group decided to go out for dinner. There were about 10 of us. Everyone was in a good mood and it was really nice to just talk to everybody about whatever for hours, especially since I kind of had a stressful week.\n\nHours into the dinner, we landed on the topic of movies/TV shows that we were watching. Our friend \"Amy\" mentioned a show that I had also watched. As soon as she brought it up, I said that I really liked the show, and that the acting, writing and directing was top notch. \"Mary\" chimed in and said that she really didn't like the show and how she had been watching other things. Cool. To each their own. Mary then asked me how I felt about the main romantic pairing in the show. I responded that I liked it, and thought the romance was cute. This is where the drama started.\n\nFor context, I don't want to get too much into it because it might be confusing, but basically, the main romantic pairing is between the male lead and the female lead. There are some people who have interpreted that these characters to be related to each other. I do not. But I know that people are free to think whatever they want, and honestly thought that this topic was harmless. Well, I was wrong.\n\nMary took offense to me saying that I liked the romance. She asked me if I supported incest. I said of course not, as the characters are not related. She said that they ARE related and that me supporting their pairing is supporting incest. Mary then said that I should \"educate\" myself before saying \"stupid shit\". I was dumbfounded and thought she was joking but she was REALLY angry with me about this. She told me to rethink my values because supporting incest makes me a horrible person. I told her she was making harmful accusations over a TV show. Our other friends were telling her to stop, including Sarah, but she kept claiming that I was a disgusting incest supporter. She then claimed I was homophobic, since the male lead is bisexual but still ended up with a woman. Mary just wouldn't stop saying shit like this.\n\nSo here is where I may be the asshole. I left Sarah's dinner. My friends were asking me to stay but I felt uncomfortable, so I paid for what I ordered and left. Many of my friends reached out to me on Friday to ask if I was okay. Some of them, while they understood why I was upset, said that it was wrong of me to leave Sarah's birthday dinner and that I should have just ignored what Mary was saying and stuck around. I feel like they may be right and that I may have ruined her birthday by getting up and leaving, but I felt like I couldn't stay because of Mary throwing accusations at me over something that doesn't matter. ", "created_utc": 1702143608, "permalink": "/r/AmItheAsshole/comments/18eip9w/aita_for_walking_out_of_a_dinner_after_being/", "score": 81, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I ruined a close friend of mine's birthday dinner because I got up and walked out over a fight and didn't stick around. However the reason I left was my other friend was making accusations about me supporting incest and saying horrible things and I felt like I couldn't stay.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA you didn’t have to sit there while taking Mary’s verbal abuse.  The only one who ruined the dinner as Mary with her attitude.", "nta, if u feel uncomfortable its in ur right to leave. ur friends are weird for insisting u stay around someone who blatantly insulted u and soured the mood", "Nta it was not you who ruined the birthday it was Mary. Like you said everyone has different opinions about different things. I don't know why Mary couldn't leave this topic or why she was so hurt about it but it just shows that she can't accept other people's opinion or their perspective on things. I would have walked out too. If you had stayed there I am sure she wouldn't have shut her mouth and ruined the birthday more.", "NTA.\n\nSounds like Mary is an antishipper, and people should really leave those types of fandom arguments online. They get a little unhinged, as you can see.", "NTA", "NTA and Mary seems like she takes things FAR too seriously.\n\nI am super curious what the show is though. Do you mind sharing?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHey. I'm posting on here because I need people's opinions on this. It's so fucking stupid and such a non-issue, (unless I'm wrong about that too) that turned into something bigger. \n\nFor reference, this happened on Thursday evening. We are all in our early 20s and all names are fake.\n\nThursday was our friend \"Sarah's\" birthday. To celebrate, our friend group decided to go out for dinner. There were about 10 of us. Everyone was in a good mood and it was really nice to just talk to everybody about whatever for hours, especially since I kind of had a stressful week.\n\nHours into the dinner, we landed on the topic of movies/TV shows that we were watching. Our friend \"Amy\" mentioned a show that I had also watched. As soon as she brought it up, I said that I really liked the show, and that the acting, writing and directing was top notch. \"Mary\" chimed in and said that she really didn't like the show and how she had been watching other things. Cool. To each their own. Mary then asked me how I felt about the main romantic pairing in the show. I responded that I liked it, and thought the romance was cute. This is where the drama started.\n\nFor context, I don't want to get too much into it because it might be confusing, but basically, the main romantic pairing is between the male lead and the female lead. There are some people who have interpreted that these characters to be related to each other. I do not. But I know that people are free to think whatever they want, and honestly thought that this topic was harmless. Well, I was wrong.\n\nMary took offense to me saying that I liked the romance. She asked me if I supported incest. I said of course not, as the characters are not related. She said that they ARE related and that me supporting their pairing is supporting incest. Mary then said that I should \"educate\" myself before saying \"stupid shit\". I was dumbfounded and thought she was joking but she was REALLY angry with me about this. She told me to rethink my values because supporting incest makes me a horrible person. I told her she was making harmful accusations over a TV show. Our other friends were telling her to stop, including Sarah, but she kept claiming that I was a disgusting incest supporter. She then claimed I was homophobic, since the male lead is bisexual but still ended up with a woman. Mary just wouldn't stop saying shit like this.\n\nSo here is where I may be the asshole. I left Sarah's dinner. My friends were asking me to stay but I felt uncomfortable, so I paid for what I ordered and left. Many of my friends reached out to me on Friday to ask if I was okay. Some of them, while they understood why I was upset, said that it was wrong of me to leave Sarah's birthday dinner and that I should have just ignored what Mary was saying and stuck around. I feel like they may be right and that I may have ruined her birthday by getting up and leaving, but I felt like I couldn't stay because of Mary throwing accusations at me over something that doesn't matter. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Holy biphobia, Batman.", "NTA.  When Mary wouldn't drop the unjust attack,  the friends should have asked her to leave if she wouldn't stop. Since they didn't,  you removed yourself,  which I think was wise.\n\nThe only thing I might have done differently (except if I were in that position, I would probably not be thinking really clearly) would be to say, \"I am about to leave this party if Mary says anything more.\" That way, your friends would know your boundary and hopefully side with you and ask her to leave.", "NTA Mary ruined the party by bringing her weird takes on a TV show into the discussion. Is Sarah upset with you for walking out of her party? You can make it up to her privately if that's a friendship you want to maintain. But you don't need to apologize for walking away from a crazy person.", "NTA. Virgin Mary's acting unhinged. You are entitled to leave when you feel uncomfortable, especially if the other person is doing it on purpose.", "NTA\n\nMary is acting weird. Attacking someone over fannish beliefs that are not part of current canon is being rather extra and over the top. \n\nAnd even if this eventually becomes part of canon, someone who like the couple when it was not canon, were not supporting incest. They would have been misled by the creators.", "NTA…her exaggerated reaction makes me think that maybe this is a hot button topic with her for a reason if you know what I mean…be gentle with her. Maybe after a conversation you guys can mend this. You weren’t wrong for leaving you should always remove yourself from those types of heated exchanges so they don’t escalate but don’t lose a good friendship over something that could probably be fixed with a convo. Good luck!", "NTA. She is taking it WAY too seriously. It's a TV show based on fictional characters. The story doesn't affect our daily lives; they're just something to enjoy.\n\nP.S.: I love Loki, too. 😁", "Something might have happened to Mary, we don't know.  But you're NTA", "NTA. Mary was definitely just trying to get in an argument here. It’s just a TV show. She’s making it out to be more than it is, so you made the right call to leave.", "NTA. Mary ruined dinner, not you. Invite Sarah out for a cup of coffee or a glass of wine, just the two of you, and have a lovely time celebrating her birthday.", "NTA - Mary does not sound like a fun or interesting person.", "The fact that you’re being vague about the show is sus.", "Omg want show are we talking about?  You are NTA, clear as day, and this Mary is an awful, holier-than-thou, virtue signaling, awkward as hell, guest.\n\nBut I gotta know the show so I can see what the fuss is about.  \n\nPerhaps she’s projecting?", "Wtf was \"Mary's\" problem?\nSounds like some kind of icky projection crap.\n\nSo NTA", "NTA. You removed yourself from a volatile situation instead of hanging around taking verbal abuse from someone who seemed dead set on tearing you down over a make believe story. If your friends can’t understand how this was the mature thing to do, that’s on them. Nobody deserves to be accused of such things for no good reason and you don’t owe it to anyone to sit there and take it imo", "NTA. You felt uncomfortable and left. Mary was making a big deal about a show and took it way too far.", "NTA. Mary is the one who picked a fight over a ridiculous interpretation of a TV show. FFS, this is fanfiction-messageboard-shit. \n\nMaybe reach out to Sarah and apologize if you made her birthday less enjoyable. It’s the kind thing to do.", "NTA…so…in a similar vein….I’ve never watched one second of game of thrones…but I have been made to understand through osmosis that there is some incest related story line…all my friends loved the show…the number of times I told them ( or even thought) they ‘support incest’ and need to ‘rethink their values’ is precisely zero.", "NTA. Who cares what they think? \n\n\nYou were being verbally assaulted, felt uncomfortable and left. \n\n\nYou owe no one en explanation or an apology. \n\n\nMary is unhinged.", "NTA.\n\nAnd don't feel bad. Mary ruined Sarah's birthday dinner, all you did was refuse to be abused by her.", "Mary is a clear asshole. There's no question here. And a very stupid asshole, if she thinks that bi people ending up in a relationship with someone of the opposite binary gender is homophobic. (Clue: half of the people that a typical bisexual person is attracted to are of the opposite gender. You might actually expect bi people to be in a relationship with someone of the opposite gender significantly more often than half the time. If you're a bi man, then your set of possible partners are (for the sake of argument, and there's some simplification of sexuality here) gay men, bi men, bi women, and straight women. The largest of these groupings, by quite a long way, is the group of straight women.\n\nNTA", "NTA. You didn’t ruin it, Mary did. She should have been the one to leave, but to end the unpleasantness for you and everyone else, you did. You also have the right to set boundaries about what you will accept in other peoples’ treatment of you. I also believe that, had you ignored her she is likely to have escalated and had you not left she would have continued. Personally, I don’t think I’d choose Mary for a friend because I doubt theis kind of judgmental and boundary-crossing behavior is a one-off.", "At first I thought HoTD but they are related so can’t be that.", "Loki", "I haven’t seen my family in years and you just don’t give a shit, huh?", "It's Loki", "The tv show is “Loki”, a multiverse MCU show. The 2012 timeline Loki ends up with an alternate female version of himself from a different reality (Sylvie). It’s more “self-cest” than incest", "Someone downstream said it’s Loki", "Oh my, yes icky projection creepy AF.", "Yea, her response was honestly biphobic.\n\nThere is an argument to be made that bi characters are often written to have an opposite sex partner but that is a discussion that goes beyond specific pairings.", "That and what if you stayed she continues. And some stranger makes a video, and it’s all out of context, which could lead to all sorts of mess for you if it caught some attention", "I'm wondering if it's maybe Loki? But that doesn't work cause he doesn't really end up with anyone.", "What? They’re not related, they’re two different „incarnations“ of the same person. Mary is incredibly narrow-minded, and possibly stupid. \n\nAlso, Loki is way beyond „bi“ sexual. If anyone is pansexual, it’s him.", "Having seen Loki myself, they aren't siblings at all O.o\n\nIt's literally an alternate universe version of the same person not biological siblings...\n\nSo yeah, she was way off track...\n\nNTA", "Ahh Sylvie and Loki while they aren’t technically “related”.  They are just different versions of the same person.  I don’t find anything weird about it.", "See this doesn't even make sense with her argument. It wouldn't be incest because the two aren't related, they're literally different variants of the exact same person. \n\nIt definitely falls on the weird side of things but definitely doesn't count as incest.\n\nAlso I'm going to assume neither of you finished the series yet so like I'm even more confused by this take.", "? Not sure which particular story you're actually referring to here.\n\nStar Wars?\n\n(Personally, I don't even really have any desire to shame anyone supporting incest that is canon; there are too many popular books/shows which have gone that route in canon. It's all fiction. Whatever)", "Thank you!  Never watched it.", "They did mean Loki \n\nEdit-Finish sentence", "Seriously beyond. Going back to the myths before the comics? Hello, Sleipnir...", "They're the same person, that's weird as fuck. More closely related than siblings.\n\nAnd it IS weird that the show is so willing to explore self/self romance given how scared it is to deal with Loki's bisexuality and gender fluidity. I think these are reasonable axes on which to criticize the show.\n\nBut none of that changes that it was bizarre of this person to hound OP about it at a third party's birthday dinner 🤣🤣🤣", "So it’s selfcest?? That’s not even incest 😭😭", "Yea we need a totally different term than incest for this particular trope in fantasy.", "I finished the series. I don't know about Mary. I know that they don't end up together, but the point is that even in season 2 the implication is still there. But Mary was just upset that they were romantic in the first place.", "Ending was fantastic.  I’m glad they aren’t doing another season.  It doesn’t need one.", "Oh yeah. Okay, he fathered a bunch of monsters, too, but Sleipnir is definitely special.", "Technically, wouldn’t it be masturbation?", "We already have one. “Selfcest”", "Menage a un?", "Ugh, she's been drinking the far right koolaid.... An argument could be made that sleeping with an alternate version of yourself is masturbation. Any pregnancy would be immaculate conception.", "She is just a silly prude.\n\nBut then again, I recall the way back days of the Internet when it seemed like half of a particular fandom (Supernatural) was going OMG GROSS YOU ARE ALL SO GROSS to the other half for the whole concept of Wincest and I was just over on the side watching it all in amusement since I couldn't even give a damn about the show.\n\nIT'S ALL JUST FICTION, PEOPLE", "FWIW, as a bi person, it absolutely infuriates me when people say it's \"homophobic\" for a bi person to be in a hetero relationship. Do they understand what \"bisexual\" means?", "I have mixed feelings on it, personally.", "Cool. I haven't been around fandom recently.", "I would think it's really some form of narcissism given form.", "Oh! It’s not exclusive to Loki! If you ever have two versions of a person in any fandom (canon alt version or fandom alt version) and you make a ship out of it, it’s a selfcest ship.", "I figured. I mean the first time I encountered the trope was the Future History series by Heinlein, which which a character literally creates twin clones of himself with XY changed to XX so he could eventually have sex with himself.\n\n(Edited: and not just sex, but a threesome with himself, obviously. I find that series a whole \"WTF you could get anything published in the 1960s\")", "Just saying — Lazarus did NOT create clones of himself. That was done by Ishtar, Hamadryad, Galahad, and dog knows who else. Yes, they did have a threesome (repeatedly), but that’s tame compared to some of Heinlein’s other stories."]}