{"id": 32687, "submission_id": "18einzg", "title": "AITA for telling my brother's ex that her daughter is ashamed of her?", "selftext": "My brother has a daughter(15) with his ex. His ex has a terrible taste in clothes, I'm talking about wearing long sleeved shirts with a long skirt and flat shoes and she chooses the ugliest of these.\n\nMy niece has complained to me many times that she is embarrassed about her mom. A few days ago it was my niece's first soccer game, my brother couldn't be there because of work and my niece asked if I could come to her game and pretend to be her mom because all the kids parents are attending and it would embarrassing for her to not have a parent there and it would also be embarrassing for her to have her mom there.\n\nOf course I said yes and went to her game as her mom. We took some photos and she posted them on instagram, once again claiming I'm her mom.\n\nHer mom called me shortly after and asked what the hell this is all about. I explained everything to her. She got mad and started yelling at me and called me a bitch. I got mad and told her that if she didn't dress like a begger her daughter wouldn't be ashamed of her so she called me some other names and I ended up blocking her.", "created_utc": 1702143504, "permalink": "/r/AmItheAsshole/comments/18einzg/aita_for_telling_my_brothers_ex_that_her_daughter/", "score": 423, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole for being too honest with my brother's ex and telling her that her child is ashamed of her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA.  And fyi, all teens complain about parents. \n\nIf the mom goes to court, your brother may lose parenting time, or may be told if he cannot be with kid on his time, he has to give time back to the mom. \n\nThis is parental alienation.   YOu are not the mom. \n\nKnock it off.", "YTA\n\nNot everyone is going to like how others dress, especially between parent & child. If your niece is more concerned about how her mom dresses than her mom actually attending games, then soon enough, your niece will learn that it's important for parents to be there regardless. \n\nYou, however, should have just been there as Aunt since that's literally all you are to her. To let your niece post on social media claiming you as mom should have been shut down because others will see it, including family. \n\nYou condone letting your niece write her real mom off as some stranger over how her mom dresses? Really, she's not getting abused, starved, or homeless, just the way she dresses.", "YTA, OP. You are stealing the mother’s identity and colluding with your niece in erasing her mother from her family for the sake of perceived social acceptance. You are teaching the girl to deny her mother exists, which seems to me to be a moral crime. She needs to accept her mother as she is and own up to her being her mother, and treat her well and respectfully. Instead, you join her in looking down on her own mother for her attire, and denying who she is. Her attire doesn’t sound awful to me, but even if it were, she needs to be treated with respect. You sound like you let flattery go to your head. That’s appalling that you would join your niece in that deception and cruelty.", "YTA. You are acting entitled over your niece. Don't pretend you're not doing what we all think you are. This is ugly behavior.", "**YTA** \\- It is fine to accompany your niece, but posing as her mom is an AH move.  Next time tell the truth: you are her aunt.  This is identity theft.  It is an autonomy violation of your niece's mom.", "You are everything she called you and probably more.\n\nYTA", "YTA, plain and simple. It’s normal for teenagers to think their parents dress horribly. Her sense of fashion doesn’t mean she is a bad parent to her child, and you pretending to be this girl’s mother is extremely overstepping boundaries.", "YTA. Mind your own business and grow the hell up.", "Definitely an asshole.", "YTA here. You encouraged and helped your niece lie. You faked being her mother, which makes you a liar, too. \n\nYou clearly don't respect your brother's ex, but teaching your niece that it's OK to lie about something as serious as who her own mother is, over something as insignificant as not liking her wardrobe is just a bad precedent to set. \n\nI'd be curious to know what your brother thought about you encouraging his kid to lie about her mom.", "I highly doubt this is real, but if it is you’re obviously the AH. How she dresses is none of your business and it’s not your place AT ALL to get in between that conversation that needs to happen between her and her daughter.", "YTA. \n\nFlat shoes? The ABSOLUTE HORROR. 😒", "YTA", "YTA\n\nEvery teen is embarrassed that parents exist. You seem to enjoy showing up mom as much as  supporting your niece.", "I’m unclear as to what you expected if being considered an asshole wasn’t your goal or why it surprises you.", "YTA", "YTA. The mom is absolutely correct to call you the b word. You are rather enjoying playing mom. If you really cared about your niece you would have an honest dialog with her mother, not try to usurp her position.", "YTA. And what are you going to do when people find out you are her dad's sister?", "YTA of course. Kids are embarassed of their parents, that's their job. Your job as a parent is to teach them that judging others by their looks is unkind, and that nobody gets to dictate another adult's healthy self-expression. You failed and decided to act like an immature child yourself.", "are you sure you're not the 15 year old?  grow up, and learn your place.  YTA.", "YTA and so is your niece.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy brother has a daughter(15) with his ex. His ex has a terrible taste in clothes, I'm talking about wearing long sleeved shirts with a long skirt and flat shoes and she chooses the ugliest of these.\n\nMy niece has complained to me many times that she is embarrassed about her mom. A few days ago it was my niece's first soccer game, my brother couldn't be there because of work and my niece asked if I could come to her game and pretend to be her mom because all the kids parents are attending and it would embarrassing for her to not have a parent there and it would also be embarrassing for her to have her mom there.\n\nOf course I said yes and went to her game as her mom. We took some photos and she posted them on instagram, once again claiming I'm her mom.\n\nHer mom called me shortly after and asked what the hell this is all about. I explained everything to her. She got mad and started yelling at me and called me a bitch. I got mad and told her that if she didn't dress like a begger her daughter wouldn't be ashamed of her so she called me some other names and I ended up blocking her.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. Jesus, you're attacking this woman over what she chooses to wear? You pretended to be her daughter's mother? Psycho vibes here.", "YTA.   Shallow puddle much?", "YTA and a weirdo. All teens are embarrassed by their parents\n\nHow long have you been in some weird competition with your ex sil?", "YTA ugh this is gross, instead of helping a kid learn a valuable lesson you chose to go along with an idiotic plan that you knew would hurt her mother.", "YTA, a Mean Girl the mental age of your niece if that, and from the sound of it, you probably think the Kartrashians are chic and tasteful, lol.  Did you wear FM heels and show off your $2 décolletage at the soccer field? How shallow and ugly can you be?  Nasty.", "Please tell me on what planet a 15yo is not embarrassed by their mom? Since the beginning of time this always the case. YTA should have told your niece to talk to her mom. Maybe give her kind words to use. Just stay out of it.", "YTA. Oh my god you are a horrible human being. For a teenager that behaviour might be excusable, even though it’s already questionable. But you enabling her, and judging the mom’s way of dressing? You are acting like a pubescent bully.", "Parental alienation? How exactly did I alienate her? Did I buy the clothes for her?\n\nAlso what idiot judge is gonna take away my brother's custody because he *goes to work*?", "This. \n\nYTA. \n\nIt's not like her mother is dressing inappropriately, it is normal for kids to go through this phase, and it's not your place.", "I never, not even once, said I'm her mom. My niece called me mom and introduced me as mom", "Identity theft?😂😂", "With LONG SLEEVES??? Stop the presses.", "By calling yourself mom.   Only the parents get to be called mom.  If he cannot control you, that is a problem.", "YTA a hundred times over. Your edits make you more of TA.", "You are claiming a parental place publicly and undermining niece’s relationship with her mom by affirming, condoning, and encouraging her distance from her parent because she doesn’t…(checks again bc I still can’t believe it)…*like Mom’s clothes.* Yes, this could affect custody.\n\nAnd by the way, it was really embarrassing to read how very shallow you and niece are - and even more embarrassing to read how blind you are to it. I always hope for more out of women than this - hurts my feminist heart to see a woman degrade another for her fashion.", "You agreed to go pretend to be her Mom and let her introduce you that way.", "You should have stopped her. Explained that she shouldn't be ashamed of her mom if she dressed a little different.", "You are the adult. You went along with her deception, and so are just as guilty, if not more, of all that is wrong with this.", "Also you asked if you were the AH or not so can you try understanding on why you were the Ah and why people are calling you out for it? Rather than continuously defending yourself try understanding what people are trying to tell you for God's sake.", "But you didn’t correct her. So you are condoning her lies.", "And you are the adult who completely enabled her. And you are obviously enjoying this. I hope your brother and his ex find a way to cut out your toxic presence from your niece's life. YTA.", "You literally pretended to be her mom. You're a liar and so is your niece.", "It is called collusion. You were still an active participant. Don't play all innocent now.", "Lying by omission is still lying?", "And you didn't correct her. She's 15. That was a teaching moment and you failed.", "Dude, I had a grandma who picked me up in bell bottoms and tube tops and a mom who would show up in two different kinds of plaid bc she was working around the house and just didn’t care.\n\nOf the things that have hurt me in my life, I can truly say that doesn’t even rank. In fact, I respect their commitment to their tastes, however different they may be. I’ve even stolen some of my mom’s old shirts bc now they’re in style. I was fine, even with the mild embarrassment that actually reflected on my classmates, and your niece will be just fucking fine, too.", "Yes, pretending to be someone you are not. You think it is funny. Why even ask if YTA when you are not open to feedback. You are a horrible influence on your niece's life and I hope your brother and her mom cut you off.", "YTA. Both of you are bullies and you as the adult should know better. That is her mom whether either of you like it. If she was my daughter you would never speak to or see her again. The only people who should feel ashamed is you and her daughter.", "Info: how old are you? I’m guessing early 20s with very little life experience who seems to think dressing well is more important than being an actual\nParent ? \n\nYTA - the fact you’re asking indicates you being a borderline sociopath", "Oh. An insane person! YTA", "YTA. This was so utterly inappropriate. Your response to your niece should have been “I’m happy to come support you but it’s not ok to lie about me being your mom”.  The end. You going along with it was an asshole move. You implying it’s ok for her to treat her mom like this is an asshole move. You implying both here and to your niece that the way people dress is AT ALL important in determining how to treat them is an asshole move. Shame on you.", "YTA what the fuck", "If anyone should be ashamed, it’s you for not realizing what an obvious AH you are instead of thinking you’re some hero 🤷‍♀️\n\nYTA", "YTA. You are not Miranda Priestley and your niece is not Anna Wintour. It's not a crime to want to wear outfits that others don't consider \"stylish\", and it's horrendous overkill to claim extreme embarrassment over someone's sense of style (unless they're constantly running around in a Batman costume or something). It was also super disgusting of you to be down with posing as her freakin' mom. Like, what the hell?? YTA YTA YTA", "There's is no way you wrote this thinking you would NTA. I suspect OP is a child because there is no way an adult can be this obtuse. Do you have your own children? Make your own or adopt do not steal others children.", "YTA. You sound so f annoying and obnoxious. The ex-wife is a way better person than you.", "Way to model healthy behaviors for your “daughter”.  How about showing her it doesn’t matter what a person wears, but who they are on the inside.  You’re the ugly one in this scenario.", "YTA. It would have been a perfect opportunity to talk to her about respecting how people dress, choosing their own clothes, and how everyone's tastes aren't the same.\n\nInstead, you took the opportunity to play stand-in, try and shame her mom for how she dresses, and now you're indignant she called you a B when you were being a B? 🤣🤣", "YTA. She is 15. If it wasn't the clothes it would have been something else that would make her embarrassed by her mom.\nYou however are an adult. You are far too old to play these stupid games.", "Her mother could wear everything perfectly and still embarrass a teenaged daughter. Encouraging this behavior and colluding is disgusting. I'd restrict the time you have with your niece. Clothes? Really? How about mothers that disrespect, abuse and don't value their kids, noooo this is about clothes. Superficial, childish and toxic, and this is just you!! YTA super sized.", "This is made up.", "A teenagers job is to be embarrassed by their parents & it is the parents job to comply.\n\nIt is not your job to impersonate their parent", "Sounds like you are encouraging and enabling the mean girl activities. What sort of adult encourages bullying another woman for shallow reasons such as attire? The niece is 15 and all teens go through that stage. What's your excuse? Past trauma? Or are you simply bored and miserable so you play along with your niece to feel loved? YTA based on information given. Maybe if you were kind and reasonable, you wouldn't have to do these things for adult people to like you.", "YTA. Are her tits out? No. She's wearing clothes and that's all the universe commands of her.\n\nYou and your niece are perpetuating judgmental stereotypes about what women should wear and who they should be. Also, pretending to be her mom is gross. Her dad is your brother, ffs. What would happen if THAT info got out? Ew.", "YTA:  Swim lanes lady, swim lanes.", "YTA, but this is such bizarre behavior from presumably an adult that it reads troll who has watched too many \"wacky switched identities\" shows.", "YTA\njust straight tf up. \nYou're messed up for going along with that. That poor mother. \nThe way she dresses is not for you to judge and for that to be a reason you go behind that mothets back and do that??\n\nIt could have been an insightful lesson for that kid that looks and appearance don't matter that much. \n\nShit i thought you were gonna say the mom was dressing provocative.\nLong skirt? Long sleeve shirt? Flats? Oh thank goodness you were there to step in. 😒", "The ex's clothes sound fine; they're just not to your and the nieces' taste. You don't need to pretend to be her mom because niece thinks she dresses badly.", "Yta. You could've done so much to encourage her to talk to her mom or to accept her mother for who she is. Most teens feel like this at some point in puberty. \nInstead of behaving like an adult, you acted childish and stood between her and her mother. That could be seen as alienation even if you had no such intention. \n\nYou were so wrong in how you handled this and that fact that you don't see that, tells me you've got a lot of growing to do. \nApologise to her mom. She deserved better from you.", "I could understand if the mother dressed inappropriately, i.e. wearing revealing clothes but you said she wears long sleeves and long dresses/skirts. I see nothing wrong with that and if her daughter is embarrassed, you should have told your niece that she shouldn't be embarrassed by that. You sound like a pickmisha, who is not a girls, girl. You're definitely the asshole and not a good role model for a teenage girl.", "A skirt and lingerie sleeves?! 😱", "YTA", "YTA. This is such a toxic trait. Kids will be confused on many occasions. As adults, it is our responsibility to teach them from right and wrong. Now she is embarrassed of her mom and she wants to exchange her mom. What are you teaching the kid, that she can do anything to fulfil her wishes? You have to apologise to the mom and make sure none of u are in the same situation again.", "YTA. Holy fuck OP. How could you agree to do something this terrible? The only appropriate thing to do would have been to tell your niece that you'd love to go to her game but that she shouldn't be embarrassed by her mother. Engage in a healthy discussion about why she feels this way and encourage her to talk to her mom. Why you'd think going as her mother is ok is beyond my comprehension.", "YTA and not for going to the game or being honest with the mom, but for not stopping your niece from lying to everyone that you are her mom. \n\nAll kids go thru being embarrassed by their parents, it’s not the end of the world either. But allowing her to lie to people is ridiculous! People are going to know at someone that you aren’t her mom when this charade falls apart, and then you and your niece both look like huge assholes.", "YTA. It’s weird you don’t know YTA.", "YTA \n\nSeriously, wtf it doesn’t even sound like this woman dresses so badly. It sounds like she just prefers to dress more modestly. Stop being a judgy asshole.", "Goodness. YTA. A lack of fashion sense isn't a moral failure, so there's nothing to be ashamed of. And Your niece would probably find a reason to be embarrassed by her mom - this is a developmental stage rather than something your ex-SIL caused. \n\nYou're being a ln AH to her and also *really* not helping your niece by indulging her teen tantrums.", "Wow YTA. Seek therapy.", "YTA. \nUnless Mom's clothing presents a health risk, you need to MYOB. \nAs the grown up you should demonstrate to your niece to measure others actions and values and to look beyond superficial appearance. \nBe a role model vs wallowing in your basest instincts.", "Oh no! Not a long sleeved shirt and flats! Oh the humanity. YTA", "YTA.\n\nBoth you and your niece are incredibly shallow. Is she a good mom otherwise? Does she take care of her daughter? Does she support her? That's what is important, not...flat shoes and long skirts. This is already an incredibly immature take for a 15 year old, much less for someone your age.\n\nHell, I wouldn't be surprised if you are part of where your niece learned this problem.\n\nYour family should be ashamed of you for your behavior.", "Lol! Clearly YTA -  All those parents at the game must think you are absolutely unhinged to pretend to be the mother of your niece.  Imagine agreeing to this plan made up by a 15 year old.  Are you actually even an adult?   Because that is not adult behaviour at all. \n\nThis is one of the most cringest things I have ever read on here.", "YTA. You’re gross. Grow up.", "A shirt, skirt and shoes sounds like normal clothes?", "Yta", "YTA. \n\nYou entitled your niece's little tantrum about his mother's taste, and posed as his mom. What did you expect to happen?", "YTA. She is a teenage girl, if it wasn’t her mom’s clothes she was embarrassed by it would be her hair or something meaningless she said or did. Teens get embarrassed by just about anything and everything. \n\nEveryone has their own taste and sense of style when it comes to clothes. Just because what the mom wears doesn’t aline with what you like or what your niece likes doesn’t mean it’s bad. It works for her and that’s what matters. You never should’ve encouraged your nieces behaviour by pretending to by her mother and shaming her real mother over something so trivial.", "YTA and you should do better", "YTA. And come of as child snatching creepy in this post. In a few years your niece will look back at this and cringe so hard while thinking she was a dumb kid but you were a moron of an adult to help her with this nonsense.", "YTA - obviously", "YTA. \nOh, my, your family is vain!\nBut go ahead and steal someone’s identity. Makes it all better. /s", "YTA. Are you kidding? This was not your place to interfere in. I'm sorry to say it. I want my sibling's kids to be happy. But, I can't support them shunning their parents - let alone for such shallow reasons as fashion.\n\nI can see being supportive of your and your niece at the same time by buying SIL a couple of items to add to her wardrobe. But, its not OK to support a child who says, \"Mom dresses like a freek and I hate it that people know she's my mom!\"\n\nAnd it was hurtful of you to allow and photos on social media to claim you are the child's mother. That was very wrong of you.\n\nThe name your SIL called you is an indictment of your behaviors.", "Having kids around that age I’d be more worried if they approved of my clothing to be honest.\n\nYTA OP. Don’t act like her mom.", "YTA, what a shitty thing to do to that woman, all over her clothing. This is so gross high school mean girl. Yuck.", "YTA, instead of thinking about your niece and her relationship with her mother you went on an ego trip for yourself. You have to know that letting your niece claim you were her mum and then posting it on instagram was wrong. You're really giving your niece all the wrong lessons.", "YTA, literally every 15 year old hates either mom or dad and complains. You are not the parent and you have zero right to make a decision like this for someone who isn’t your child without speaking to their parent. Not to mention teaching the girl that clothes and vanity are more important than family. Get a grip.", "YTA, and so is your niece.", "I wonder if this is rage bait post particularly with the posting on social media (of course the mother would see it).... But just in case\n\n1- When appearance is more important than personality. God forbid you would have had a conversation with your niece about that or reminding her that her mum loves her.\n2- Even if the mother choice of clothing is not a fashion statement (grab the first thing I can get, her hands on) and she doesn't know how to dress to compliment her body, maybe you could suggest that your niece spent some quality time with her mum and do a fun make over.\n\nYTA", "So, are you unblocking her and apologizing?\n\nYTA", "YTA, and bigly at that. Is there a large age gap between you and your brother? You sound like a teenager yourself.  IMO, the niece is ashamed of the wrong woman in this case.", "First of all, parents are supposed to be embarrassing for teenagers and preteens. My oldest is twelve, but while she loves me in public, she'd like to pretend I don't exist.  I don't mind, but if an adult pretended to be me so she didn't feel embarrassed, I'd think that adult was an asshole. She'd be in trouble too because that's just too far. I bet you've been encouraging her to see her mom as embarrassing, or else you wouldn't have gone along with it.  Yta", "Wow.... who the hell does something awful like this? You apparently. YTA!!!!", "Weak troll, try to make yourself likeable in your post next time.", "Rule #1 of aunting. You're not the mom.", "YTA so hard. You don't pretend to be a child's mother unless they are in danger not because they don't like the dressing habits of their parent.", "This was definitely written by a teen girl lol. \n \nYTA. Judging people by the way they dress is never a good look, and you have no idea why she dresses that way - could be trauma from body dysmorphia or SA, could be tactile sensitivities, most likely she doesn't prioritize clothing because she has better things to do. And the fact that you'd bully your own *mother* is completely disgusting. Take a moment to imagine how she must feel, the woman who loves you and gave so much of herself (maybe even her fashion choices!) to provide for you. She must be heartbroken. \n \nI hope the part with your aunt is creative writing, because as adults its our job to teach you how to be good people and if she's real she should be ashamed of herself. If she actually wrote this she should reflect on the fact that so many people think she sounds like a child.\n \nEmpathy will get you very, very far in life. I hope you think about how terrible this was and apologize profusely.", "YTA. Find me a 15 year old girl who thinks her mom is cool and I’ll show you a liar. She doesn’t like the way her mom dresses so she’s going to pretend she doesn’t exist and you’re OK with that? You pretended to be her mom? Of course your the AH.", "So, instead of having some healthy conversations with your niece about what is really important in life (Hint; appearance ain’t it) you go along with her and actively participate in her deception? I hope your brother makes you go NC with your niece. She doesn’t need to be around anymore of your toxicity. YTA", "YTA", "Uhm, she's a 15 year old? And you're a grown ass woman? How far up is the stick up in your asshole?", "YTA.\n\nIt just sounds like you're trying to take on the role of a mother for personal reasons instead of doing it for your niece. You're also judging her mother based on something so trivial as the way she dresses, which makes no sense. Maybe talk to your brother about whether or not you should take on that motherly role instead of just giving yourself the green light and intruding on boundaries.", "YTA. You’re not her mom and shouldn’t be complaining about something as trivial and stupid as clothing. She might be able to go back to court and accuse your brother of parental alienation over this.", "Wow YTA.", "Yta", "Yta your not the mom have an adult conversation you're not helping anyone", "YTA", "Yta. You could have told her clothes aren't something to be embarrassed by and neither is her mother", "YTA you had no right to do that. She can ban you from being with her and use this shit as evidence in court if she has to. Her daughter needs a reality check. I’d ground her so fast her head will apin", "YTA, i would say you're *more* than an asshole, this is \"cut you out of my life\" territory.", "I wonder if mom buys cheap clothes because she’s making sure her kid has good clothes? My sister is a single mother and almost all her money goes to her kids. YTA", "YTA\n\nI hope for the love of everything this story is rage bait. OP is acting like a 15 y.o. themselves. Who the fuck pretends to be someone's mom? I'm sorry, and I'm not proud of this, but if someone did this to me with my daughter, I would find it very difficult to not physically hurt them. You can't alienate a parent like this. In fact, you shouldn't even be involved.", "YTA is her mom a good person and a good mom? That’s all that matters. Trust me when your niece came to you that should’ve been a teaching moment. When your nieces mom is gone like mine she is going to be ashamed.", "YTA and you know it. The mother isn't dressing inappropriately. We all know what kids are like, especially teens. You should be ashamed of playing into your niece's little game.", "Is the mom dirty, slovenly, does she mistreat or abuse her daughter? Is her home a pig sty and run down? If not, then this is all a bunch of head games over perceived status. As was said elsewhere in here, the daughter needs to learn NOT to be so superficial. The aunt needs to get over herself and grow up.. YTAH", "My mom was the same way. I was never embarrassed by her. Color blind and just weird clothes. We went out once a month together. I truly didn’t care, I dressed with the 80’s fashion. She was probably embarrassed by me. I cherish those times and I miss her so much. Terrible people.", "YTA. There's nothing wrong with the way she dresses. And you pretending to be her mom is identity theft. That's a criminal offense.", "YTA - there is something deeply wrong with you to behave like this, honestly I think you need psychiatric help.", "Wow..\n\nYTA.\n\n\nI had to recheck your age. You're supposed to be an adult? \n\nWhat part of the whole \"pretend to be her because I find her style ugly\" you thought was correct??", "'His ex has a terrible taste in clothes, I'm talking about wearing long sleeved shirts with a long skirt and flat shoes and she chooses the ugliest of these.'\n\nWhat is wrong with you? Why would you foster such shallow behaviour from a child. Grow up\n\n&#x200B;\n\nYTA", "“Of course I said yes…”\n\nWell, there’s your problem!  Aren’t you supposed to be the adult?  How about, “I’ll be delighted to go, but not as your mom.  I’m proud to be your aunt, and that’s how I’d like to be introduced.  If you’re ashamed of your mom, that’s something you’ll have to take up with her.  Please leave me out of it.”  \n\nSee how easy that was?  You have your niece’s back and stay out of their issues (which almost all 15 year old girls have with their moms, btw).  Everyone wins. How old are you?  Is this even real?  I hope not.  Either way, YTA.", "Soccer season starts three weeks before Christmas?", "YTA for everything expressed, but also, that's your *brother's* child. So, you're cool if people think you and your brother had a kid together?", "so the mom just dress like a normal person...  YTA", "Yta. Holy shjt.", "Omg YTA so much op. This is a great teachable moment about looking past the surface and you blew it.", "YTA and you're encouraging your niece to be one too. Do better.", "Totally 100% YTA. Are you 16?", "has this woman actually done anything wrong or do you just despise her. YTA", "YTA. The names mom called you were more polite than you deserve. It would be the last game you ever attended if I were mom. \n\nNot only did you screw up big time in assuming mom's identity, you and your niece have most likely screwed up her relationship with her teammates. Her soccer team will know you aren't mom and niece is a liar. She will be shunned because people don't want to associate with, nor do they respect, liars.\n\nBoth you and niece should be ashamed of yourselves.", "YTA. You should've known this would be incredibly hurtful to her and never should've gone along with it. To be this concerned with what clothes someone wears is incredibly immature. Your niece is a teenager so it's to be expected, but if you're old enough to pass as her mom you should really have grown out of this kind of thing.", "YTA times a trillion lmao", "YTA\n\nLOL\n\nTeenage girls are embarrassed by EVERYTHING. \n\nThe mom was right about the adjectives she used for you.", "The audacity is real with you.", "YTA\n\nAlmost every teen goes through the stage of being embarrassed by how their parents dress / look. There comes a point where you'd prefer to never to be seen with your parents.\n\nYou're taking a normal teenage stage and feeding into it.", "YTA. One theres nothing wrong with long sleves and long skirts. If you dont like it you dont have to wear it. You are not better because you have different tastes. Two its really gross to talk to a kid that way about their own parent just because you have a different sense of fashion.", "Looks like your shallowness is rubbing off onto her.", "Ugly is an ugly word spoken by emotionally ugly people.", "The child is 15!  They are at that age when parents embarrass them no matter what they do.  YTA", "YTA. Oh my god.", "Are you the asshole for claiming that you made a baby with your brother because the actual mom wears ugly skirts?\n\nYeah gonna have to go YTA on this one...\n\n🤣 y'all are really like \"it will be embarrassing for the other kids to see her mom in a long skirt but totally fine when they realize that her dad and 'mom' are actually brother and sister\" kids totally never get made fun of for things  like THAT\n\nAnd you're doing it posting pictures ON THE INTERNET FOREVER??", "YTA. And you’re a mean girl.", "YTA - most teens are embarrassed by their parents at some point in their lives.  Your niece's mother isn't a doll that she can dress up how she pleases, everyone deserves the dignity of dressing how they feel comfortable.  \n\nYou're teaching your niece to lie, and be shallow.", "YTA", "YTA.     You want to watch you don't fall off your lofty perch.   Pretending to be her mum..   what an AH", "Is this seriously a question?\n\nYTA", "YTA. Your niece needs a better influence in her life than your stupid, snobby ass. Jesus Christ.", "The daughter is most definitely the AH for pretending you are mom.\n\nYTA, for agreeing to pretend you are mom.  \n\n In what world did you think that would fly?", "YTA. \nWow. \nOk, I get the kids concerns about being embarrassed~ kids are assholes and I’m sure she’s been teased at least once because of her mom’s appearance. BUT. You basically “stole” the mom’s identity as a mom. \nHow I maybe would handle the situation: \n*APOLOGIZE…ALOT* calmly explain the kids situation and that she came to you and all you wanted to do was help BUT you now realize how wrong it was the way you went about it. Then something like “Why DO you hide your kickass body in these frumpy clothes? You are SO pretty but you cover yourself up. Let’s surprise daughter’s name here and let’s go shopping and let me teach you how to work whatcha got!!!” OR if $$ is an issue suggest going through her closet and showing her how to refashion the wardrobe she has in a more flattering style! \nOh and apologize.", "It was kinda A**y of you to call her a beggar dresser..but like am a teen..and God knows how much guys at school be harsh when parents wear the unthinkable...we talk about it...not to their faces. It was kind of you to go to her game and give her the social advantage. But you could have been nicer to her mom. And most importantly stopped her from posting on her ig claiming your the mom. So yta", "ESH. This reminds me of this post: [AITA for telling my brother the reason his kid is bullied and unpopular is due to him](https://www.reddit.com/r/AmItheAsshole/comments/18665n3/aita_for_telling_my_brother_the_reason_his_kid_is/); it seems niece and mother are in a similar situation, minus the bullying, for now.", "This situation could’ve been handled better. I would NOT have played her mom but I would have showed up for my niece. I’m not going to say this lady is the asshole. I do commend her for showing up to her game. \n\nIt’s unfortunate the young lady is ashamed of her mom. Let’s be real kids are mean. Has the little girl been bullied for how her mom dresses? I get to us adults this may seem like a trivial thing but to kids this means a lot to them. \n\nThe mom called and the aunt told her what the problem is. Me personally I would’ve thanked the aunt for telling me what is going on and FIRMLY told her NEVER to play my daughter’s mom again. The next thing she should’ve done is had a conversation with her daughter. Obviously the daughter didn’t feel comfortable telling the mom what the issue is and seeing how she handled the convo with the aunt I can see why. Hearing that your daughter is ashamed of you could be a hard thing for the mom to hear. Obviously she doesn’t see anything wrong with how she dresses and that’s good for her. \n\nThis can go 1 of 2 ways she can talk with her daughter and try to find jeans, top, and tennis shoes to wear in public with her child. Surely out of her whole wardrobe she come up with 2 outfits the daughter can bare in public. OR she can wear what she been wearing and her daughter continue to disown her in public. I do understand this is unfortunate and hurtful. Some of you may say why should the mom do this. As the mom she doesn’t have to. It’s either try to find a solution or punish the girl in some way \n\nMy question is if the mom dresses like a beggar and seems to be modest who buys the daughter clothes\n\nEdit - see this is getting downvoted and I’m curious as to why? Are we not going to suggest help or just bash the lady for being a asshole", "NTA for going with ur niece, but how could u not think it would be a problem with her posting it on instagram?", "I wanna say nta but now she’s gonna continue a lie what happens when mom actually shows up ? I say nta because you helped you niece but yta because you could have just been Aunty “mom dad had to work” it’s still a lie but not as bad as saying your her mom", "NTA, but kids are weird.  Glad I don't have a 15 yo to embarrass.", "YTA i thought she was wearin a thong up to the school, let that lady dress like a mormon if thats what she wants all kids roast their parents", "YTA: You’re pretty much telling your niece that what matters is looking pretty and that’s it. I assume she has no issue with her mom driving her places or buying stuff for her.", "YTA lol I wear leggings a shirt pretty much all the time and my daughter would love if I were more fashionable. I told her I could only afford for one of us to dress aesthetically and she could choose who. She chose herself obvs lol", "You cannot seriously think you are anything other than YTA", "You're the posterchild for the worst a.h!!!", "Dang OP. You may have ruined your relationship with your niece with this stunt. The mom can definitely keep you away from her. Please apologize and explain to your niece that regardless of how her mom dressed, she's still her mom.  I would be heartbroken if my child and their aunt did this to me.", "OP, YTA.  If you had participated with that with my child? You'd no longer be welcome to be in contact with my child. The disrespect and immaturity you've shown here is staggering.", "YTA. Your niece is a teenage gremlin and you have the same maturity Level as your niece If you believe that it is OK to insult your Former SIL because of some superficial bullshit.", "YTBAE (you’re the biggest asshole ever).    \n\nWho cares what mom wears? She’s not forcing it on her daughter.    \nMost kids are embarrassed by their parents, especially at that age.    \n\nwtf is wrong with you?", "Who made you and 15 yo the fashion police?  Your shameful, hope you don’t have children for their sake.", "YTA\n\nNot only an arsehole but actively engaging in parental alienation and deceit.", "YTA. Bigtime.", "YTA & the other parents think you’re incredibly strange knowing you’re not the mom, but showing up and pretending to be the mom. Are you in love with your brother? This is beyond gross what you’re doing", "YTA", "YTA", "YTA\n\nAn adult would have said to your niece that her mother loves her and she shouldn't be embarrassed about her mom, because Looks aren't important, it's what's inside that counts.", "YTA. How is anyone going to believe l that teenager like you has a 15 year old?", "YTA - The child is 15! Of course she’s embarrassed of her mother! If it wasn’t because her clothes, it be something else that’s equally stupid. Good grief. Instead of being an adult and helping your niece to mature/teaching your niece perspective,  you’ve decide to adopt a teenager’s mentality. I used to walk 2 miles to and from school in high school instead of letting my mom drop me off all because she drove of station wagon. 🙄", "YTA and you should be embarrassed about how you handled this.", "YTA and a huge one at that'", "YTA. First of all for attacking the woman’s clothes. You have no knowledge of why she wears the things she does. It could be for religious reasons, security reasons, whatever. \n\nSecond, you condoned your nieces behavior, essentially going along with the awful bullying of her mother and telling her that it’s okay to look down on people regardless of their reasoning. That lying and manipulation is a good tactic to get what you want. That the way a person chooses to look is enough reason to look down on someone. But considering YOU think it’s okay to be a tactless, awful person, it’s no wonder you allowed your niece to treat her mother as such.  \n\nThird, mind your own damn business. If your niece has an issue with her mother, she’s more than old enough to address it with her mother, or her father, if she’s not comfortable saying something. \n\nYou need to grow up. The ugliest thing about your post is your attitude toward others.", "Op you’re the daughter making up an aunt eh?", "YTA\n\nIf your niece is judging her mother by her clothing then she has bigger problems than being embarrassed. She isn't dressing like a beggar either...she's dressing how she's comfortable and if she wants to dress like a mormon and show no skin then that is her choice. It isn't your place to step in and you have no right being angry over what clothes another adult decides they're comfortable in. You should have been using this as an opportunity to teach your niece that choice of clothing doesn't matter and instead reinforced the idea that her mother shouldn't be allowed to be comfortable. Grow up.\n\nAnd also...is there any possibility she is being physically abused?", "YTA, obviously! You should have called her when the niece talked to you about her scheme. It could have been a bonding experience or an excuse to shop but you royally screwed up. Do better.", "You are a giant AH, that’s actually pathological.  You don’t like the way the ex dresses so you pretend to be her mom? Who the fuck does that? An immature AH that’s who", "YTA. Nothing wrong with long sleeves and skirts!!! Lying about your relationship is certainly wrong.", "YTA", "YTA. It would have been fine to go as her aunt which you are. Not letting your niece pretend you were her mom. Who are you t judge what your sister in law wears, it is absolutely none of your business. Hopefully your brother and his wife are smart enough to ground their daughter, make her apologize for lying on her post so everyone can see what a liar she is and that they cut off contact between you and their child.", "Yta and this is teaching your niece to be shallow", "I would have sided with OP (and niece) if bio mum was some kind of narcissistic, homicidal, maniac that is often posted in this site. Alas, the biggest \"crime\" that bio mum committed was a fashion crime. How disgustingly shallow of OP and her niece. \n\nYTA and not a very nice person regardless of how you are portraying yourself as some kind of female \"role model\" for your equally shallow niece. No matter how \"nice\" you dress yourselves up, you will always be TA.", "It’s more about lying.", "YTA, and enforcing your niece’s belief that clothes are a judge of someone’s character means you’re double AH", "YTA ,good job, instilling judgment about what people wear into a 15 yr old girl, instead of using it as a positive teaching moment about how no one should judge about that kinda stuff  because it's not actually a big deal . No you used it to teach her a really nasty habit (judging one's clothing)and  also creepy pretended to be her mom ??? Like are you 15 too??? Bc that's the only way this makes sense  bc what adult would be that silly/irresponsible.", "YTA\n\nWhat is wrong with you? You should be ashamed of yourself. Someday, when your niece is older and out of her teenage phase, she’ll realize how awful you were to her mother. You’re terrible.", "YTA this is parental alienation and the ex should definitely sue. And you should be kept far away from your niece", " yta you weird judgmental freak", "YTA\n\nYou should actually read what you wrote. I can't believe you wrote that in good faith. You've got to be hoping that someone somewhere will take your side, right?", "YTA\n\nHow old are you to be this dense and callous?\nGet help.", "Wow YTA many times over. I love when people come here for judgement and then argue with everyone in the comments. You just wanted people to validate you because you think you are superior because what you think you're more fashionable? Get over yourself.\n\nYou sound incredibly stuck up and judgemental. \n\nI hope your niece grows up, realises that she was immature and cruel towards her mother and remembers that YOU actively encouraged it and isolated her mother and decides to drop contact with you.", "YTA", "YTAH and so much more!! What is wrong with you??", "You're lame as fuck.", "YTA\n\nAll kids are embarrassed of their parents at one point or another. You way overstepped and if this were my kid, your access to her would be severely restricted if not taken away completely. This is absolutely ridiculous and disgusting behavior on your part.", "YTA 100% everything was handled so wrong", "YTA and alienating her mother because you yourself have some twisted reality that her mother is a terrible mom because she's not fashion forward. Do you understand how shallow and cruel you are for that reasoning alone? Your the adult and are a ahitty role model for your niece.", "YTA and so is her daughter. You guys are so vain. Out of all the problems in the world her mother could be causing, you choose her fashion sense. I pity the both of you, seriously. It must be hard living such hateful lives", "Why long skirts is terrible?", "YTA 100%! You’re helping your 15 year old niece judge their mother based on their mother’s choice in clothing? Grow the fuck up and be an adult and maybe teach your niece that it’s not ok to judge someone for something so trivial, particularly the person who gave them life.", "YES YOU ARE HUH", "You are an asshole. A big one", "YTA... what the hell OP? Why would this be ok?", "Wow you’re the absolute worst. You’re actively putting her against her mother. Her mother isn’t doing anything wrong just wearing clothes you both don’t agree with. She’s not abusing the child or even seemingly neglecting the child", "YTA. Not your place, not your role.", "YTA. She is 15! News flash, most teen girls do this. There is nothing wrong with how her mom dresses. Also, did you carry this child for 9 months? Did you labor to bring her into the world? No? Then step the fuck back. The only thing you taught this child is that being shallow and cruel is fine and hurting your loved ones over how they look is justified. I hope you don’t have children.", "YTA. I thought you were gonna say the mom was dressing in neon pink thongs and metallic pasties. Not that she—gasp—wears long sleeves.", "Wow, YTA. Your niece is being a bratty child, and this was an opportunity for you to step in with a teaching moment on how a mother is worth more than the clothes she wears. Unfortunately it sounds like you and your niece are in the exact same place maturity wise, so you were only able to encourage her to be a meaner, more superficial girl than she was already being. Grow up.", "YTA you don’t see how that’s extremely hurtful to her? When your niece is older she’ll be embarrassed that she asked you to do that and probably disappointed that you actually did that.", "YTA for colluding this way. Most teenaged girls get embarrassed by their mothers. It's a common phase. What you did was not only shallow (her clothes don't match your ideas?), but cruel.", "Yta. So her mother dresses conservatively and it made you think it's okay to bully her? What are you in high school or something? What you are participating in is immature to say the least and ridiculously cruel. Do you suddenly feel super good about yourself? Have all of your insecurities disappeared now that you took this woman down a peg or two for wearing ugly outfits? You could have been a decent human being and talked to her kindly. Maybe asked if she'd like to go shopping or something. Instead you told her that her daughter was embarrassed of her, said she looked like a beggar and then told her off. Who even are you to tell her anything? You're a nobody. The only reason you're liked is because of the way you dress. Clearly not because you have winning character traits. Like kindness or empathy or even the forethought to talk to your niece about kindness and acceptance. Ugh.... I just really don't like you. Now we're going to have your niece growing up to be just another bully in the world. You did us all a disservice", "Yta", "YTA. It seems highly unlikely that you addressed this to the mother from a place of kindness and honesty but rather from a place of pettiness and spite, as this is your brothers ex so you may have something against her. It’s not your place to assist your niece in erasing her mother/ pretending she doesn’t exist. And you admitted to describing as having the appearance of a “beggar.” You were coming from a place of nastiness and hate. YTA all the way.", "YTA. I could write at least two paragraphs as to why, but I'll shorten it. She dresses modestly, with which you find some inane problem, and you're just as if not less mature  than **her** teenage daughter.", "YTA You said the CHILD's age, but you didn't say your ADULT age. When I first started reading, I had hopes that she was upset with you because you went to her about how her daughter felt but nooooo... honestly not sure how you would think you weren't the asshole in this situation.", "WTF? You did what? How old are you? You fed into a 15 yr old's shallow idea of importance on attire? FFS. YTA. And you have no business influence a child's life.", "Were you really a teenager if you were not embarrassed by one of your parents? I think it’ll be more embarrassing for your niece when people find out she used you as a fake mum. Good job at being the actual embarrassment. YTA.", "YTA  \nYou should have not humored this in any way. One persons taste in cloths is not going to be the same as the other. Instead, you should be teaching your niece that it's okay if someone has different tastes in life then us. You are not her mother. You should never be claiming in any way that you are.", "YTA and some day your niece is going to look back and regret this and be angry at you for encouraging it.", "Ummmmm… YTA. BIG TIME. \n\n1. You do not act like another persons child is your own and post it on social media like a crazy person. I know that’s what the daughter wanted, but she’s a kid and obviously didn’t consider any of the consequences or how hurtful she was being to her real mother. \n\n2. You missed a teachable moment as a bonus parent. You should’ve told her that her mother’s clothing is her choice and that you shouldn’t judge a person by their attire, even if other people do. It’s wrong and she should be proud to call her mother her mom no matter what she wears, bc she loves her just the same. \n\nYou’re teaching her it’s okay to oust people bc of their clothing and treat them like lesser for it. \n\nFrankly, you saw the opportunity to “replace” her mother and took it instantly so you could look more important. \n\nI think the mom has every reason to be angry with you.", "YTA, and a judgmental snob. You sound insufferable. If I was your brother, I’d be limiting my kid’s contact with you. You’re encouraging the very worst of teenage behavior, and teaching her to look down on people who don’t dress the way YOU think is ‘right’.", "I feel this is a fake post… However, if not 100% YTA. \n\nHow judgmental and arrogant can you be? 1. It’s normal to be embarrassed of your parents at 15. 2. How could you pose as her mother? How many late nights did spend soothing her? How much money have you spent raising her? How many tearful nights have you had worrying about her future and what you can do even more to make it great? 3. Oh my god… she dresses very modestly… what a crime. Not… \n\nWhat you did was extremely misguided… I hope you learn something from this.", "YTA for being judgmental and not considering your niece or niece's mom in all this.", "YTA, and further more, WTF?", "YTA. You sound immature like a teenager no wonder the niece likes you", "YTA.  You crossed a line there.  Very few 15 year olds think their mothers wear stylish clothes.  Her mother's clothes sound modest and simple, but certainly not embarrassing to anyone except her daughter and YOU, of course.  You could have gone to the game, taken pictures and posted them as your niece and her aunt.  I would be surprised if the girl's mother will let her spend much time with you.  That was a rotten thing to do.", "YTA X 1000. edit fumble", "YTA and encouraging your niece to be a bully just like you.", "YTA!! Big time. How did you think this whole scenario was going to play out? Did you think you were just going to be able to swoop in and pretend to be this girl’s mother for the rest of eternity? Did you think no one was ever going to find out (especially her understandably outraged mother)? What do you think things are going to look like from here on out? People are going to know that she lied, and that’s not going to look very good for her. (It looks even worse for you — supposedly a responsible adult.) What are her friends going to think about her now? And if I were her coaches and found out, I would ban *you* from any future games! That’s some next level BS, claiming someone else’s child as your own.", "Wait ... what? You are stealing her mother's identity because both you and your niece don't like the way she dresses? Have you ever heard of not judging people by their looks? Or being the adult and teaching that to kids? \nYTA", "Yta\n\nYour job as an adult in this child’s life would be to explain how fashion is transient and driven by people making money .. and how important it is to let go of the kind of external pressure to judge something or someone\n\nConsumer culture / advertising is making her pull away emotionally from the most important person in her life, and instead of caring about how damaging that is for her, you gleefully jumped on board.\n\nWhy?  Does it give you joy to hurt the woman who many years ago was with your partner? That’s so pathetic.\n\nBe a better human.", "Mom’s can’t win. You look frumpy or non-conventional daughter hates you. You look hotter than daughter, daughter hates you.", "I'll take your word that the mom's clothes are fugly and honestly embarassing, it would have been fine for you to attend as her aunt but you crossed into AH territory with letting her pretend you were her mom in pictures.", "Also, question, when your neices friends find out you pretended to be your own brothers wife do you think the incest fakeout is gonna be more or less embarassing than wearing long sleeves with long skirts.", "YTA.\nWho are you, to impersonate this girl's mother?\nThis is some seriously twisted shit.\nMind your own business.", "Wow, the true inverse of the 'my stepmom is too slutty' troll", "YTA. Wow, what are you 12?", "Over step ! You jumped in with both feet . You need to back off ,be her Aunt let her Mom be her Mom . Not everyone is into fashion . And every teenage dislikes the way her parents look and act.", "YTA\nAnd not for what I keep seeing in the comments.  It was nice of you to go to the game and take pictures.  You can’t control that your niece posted the pic claiming you are her mom.  But here’s where YTA.  You allowed it and didn’t tell her to be truthful in the post.  Then you went and butted into their relationship.  Your response to mom should’ve been “You should have a conversation with your daughter” and that was it.", "YTA. It's normal for teenagers to feel embarrassed by their parents. What's not normal is (as a grown ass adult) being so judgemental of the clothes people wear that you feel you can be disrespectful as fuck to them. You know what you're doing, everyone here can see through your bullshit. Get off your high horse, you're no better than your niece's mom, in fact you seem a hell of a lot worse based off this post alone.", "YTA you could have reacted in so many different ways.", "YTA\nAll the way.100%. Total A. WTF. Not only are TA, but you are teaching a child to be one as well. Wow. Just wow.", "Whoa, wait a second!!. OP seriously thinks that her niece’s mom has a terrible taste in clothes just because she wears long sleeved shirts with long skirt and flat shoes. Has she ever thought about why ex dresses that way? \n\nI don’t see anything wrong with the way she dresses. Your niece is a AH for judging her mom as embarrassing because of the way she dresses. There’s more to a person beyond the way they dress. Your niece has to come to terms that whatever her mom’s fashion style is none of her business. Everyone has their own preferences and comfort levels and your niece has to learn to stop being condescending to her mom and learn to appreciate her. \n\nAnd it seems your niece needs to learn a lesson on not judging people based on their appearance. \n\nYou’re clearly colluding with your niece to erase her mom out of the picture. YTA. The mom has every right to be angry.", "OP is a freaking weirdo\n\n\nYTA", "What the hell is wrong with a \"long sleeved shirt and long skirt\"?  I wear that.  Do you want her to walk around in stripper wear?  You and your niece are ridiculous.", "YTA - I get that a 15 year old girl acts like an over dramatic teenager that is embarrassed about everything, but what the f***, you are a grown up, an adult who should know better.\nSure, play her mom, being the 90min star of the show and a couple of insta posts equalizes full time parenting. \nAs an aunt you should help her getting an adult view of the world in a time where a teenager and her parent are “enemies”. You should be diplomatic not emphasizing being a brat.", "YTA. You and your niece talk as if shes dressing like lady gaga. Shes wearing very normal and very comfortable clothes. Calling your ex sil a beggar is trashy.\n\nTeenagers get embarrassed when their parents breathe, dont feed her behaviour", "You're not TA for telling your brother's ex that her daughter is ashamed of her. You should have had that talk with the mom days ago when her daughter asked you to participate in this ridiculous sitcom plot of a scheme. YTA because you *didn't* talk to the mom then and instead enabled an insecure teenager's doomed attempt to lie to her peers", "YTA", "YTA. Nothing more to add.", "Your niece is a brat, and you're a biased, opinionated snob. I've been known to wear long-sleeved shirts with long skirts and I only have flat shoes. I'm sure your wardrobe is very fancy; so effing what? You and your brother are apparently encouraging your niece to scorn and belittle her mother; that's horrible. And potentially legally actionable.\n\nTake your high heels and walk off; YTA", "YTA! She is a child and isnt thinking this through, but your an adult. You should have told her mother or at least your brother what was going on. It honestly was not your place to pretend to be her mom.", "YTA\n\nWtf is this, anyway?  People have already berated you, as they should, for your commentary, but what are you even doing here?  How shallow and oblivious can you be?", "YTA! How can you not see you’re AH. You could have gone to watch the game but told your niece that you would not be pretending to be her mum because that would be disrespectful to her mum, and she would be upset if she found out. Seems like daughter only cares about appearances. I know she’s 15 and teenagers can be crazy, but this is a bit much. But it’s even crazier from you seeing that you’re supposed to be the adult with common sense.", "YTA. \n\nYou are not the mom, that is disgusting that you would pretend to be your brother's wife. A good aunt would have sat down with the niece and told her to be honest with her mother. The niece could open up to her mother while being respectful about it. You missed your chance to be a good person and a good aunt.", "YTA\n\nI get it. Her clothes might be ugly to you. My men's fashion choice is also considered to be \"ugly\", compared to the culture of skinny/slim fit jeans, sweaters and oddly shaped t-shirts. I mainly wear hawaii shirts or rockabilly/bowling shirts, and high waisted jeans or trousers. Clothes are about what makes us comfortable.\n\nThe mom is being there for her daughter. Oh, what a sin! She's providing for her daughter, but she has the audacity of \"being ugly\"? Honestly, both you and the daughter sucks.\n\nEdit: For reference, this is what I usually wear, even at work - just with a blazer on top: [1](https://www.amazon.co.uk/gp/product/B0C4PB7V1F/ref=ox_sc_act_title_10?smid=A3LDDXL5QKFD35&psc=1) , [2](https://www.amazon.co.uk/gp/product/B0C8Z122D1/ref=ox_sc_act_title_35?smid=A19ACZEX4J86ZA&psc=1) , [3](https://www.amazon.co.uk/gp/product/B07SZD217H/ref=ox_sc_act_title_36?smid=A1661H6ZGXC12H&psc=1)  .. and I work as an archeologist / curator at a museum.", "YTA you don’t know why she’s dressing like that leave her alone", "YTA \nShe dresses less than fashionably. Not like a homeless person. And either way- you are absolutely the AH. She is the child’s mother and you encouraged this rude behavior on the part of her child.  Instead of behaving like an adult and saying appropriately “of course I will attend but your actual mother should too and even if you don’t love her attire; she loves you regardless and would be very hurt by your behavior”", "YTA I don’t think you will get much sympathy for self imposed drama. And you put your niece in a weird position too. Good job", "No matter how much you dislike your brother's ex - surely her style isn't the main reason - that was the wrong thing to do.  You don't sound like a grownup. I hope you reflect on your actions and correct them. Don't be too hard on yourself though. Mistakes happen.", "YTA going for your niece is one thing but attacking how she looks and assuming the identity of her mother is entirely different. You could have explained without your own personal opinion and attacks coming into the mix, and that’s exactly what you should have done because your opinion means nothing", "You went and impersonated her. YTA. This is unforgivable. Are you deliberately  trying to cause a rift between the mother and daughter? You are immature, selfish and stupid.", "yTA.", "YTA.  You’re NOT the Mom.  And all teens go thru a period where they don’t want to be around their parents!  Sucks, but it’s true.  It’s nice that you supported your niece in her chosen sport, but you can’t usurp the parental relationship.  You owe the Mom an apology.  And your niece needs to know that no matter how her Mom dresses there’s a bond there that she will never have with anyone else.", "YTA for lying and for being deceptive. Your neice is a teen, but you should know better. There is no reason to be so judgmental of your brother's ex.", "YTA. Oh my god. How could you even THINK this was ok? You're the adult. You tell her how much her mom loves her and is proud of her and wants to be there for her.", "Sometimes I wonder how ppl like you have the audacity to post here and act like this? Didn't occur to you, to read out loud what you wrote?", "YTA", "This can’t be for real. Seems like it was written by a shallow judgemental mean bully 14 year old. You are not only shallow and immature but you are also classist for saying she dresses like a beggar. Grow up. YTA", "OP get. A . Life.  You judge somone based on their dress sense get a life honestly I don't understand why stuff like weight looks dress sense and other meaningless stuff exactly like this makes an easy target for judging its disgusting", "Partial yta. You should have spoke to the mom about how your niece would appreciate a wardrobe change for the first time all her teammates would meet her.", "Eww. You pretended to be her mom because you're more... fashionable? Since when does being a parent require someone to dress to please a teenager? It's practically a guarantee that teenagers will be embarrassed about their parents over *something*.\n\nSo mean and spiteful and gross and rage-inducing tbh. Teaching your niece that it's okay to dismiss and disrespect people who don't look a certain way? You're an utterly awful excuse for a role model. YTA.", "you and the niece are TOTALLY the AHs here.", "Ok but is the ex a good mom to her kid?", "YTA. Great work being the cool aunt who has absolutely no regard for the real welfare of this child. It's **normal** for teenagers to go through a stage of being mortified by their parents for any or no serious reason (and guess what, a middle aged mother wearing boring adult clothes is not a serious reason). But the adults around them are supposed to help them distinguish between their feelings and appropriate choice of actions, not help them erase their families. Assuming this isn't just a proxy story where you are actually the 15yo, you deeply wounded this family in a way that wasn't necessary because you don't know how to behave like an adult yourself.", "YTA. \nSo is the kid, but at 15, is at an age where their priorities are all mucked up. \nYou should know better. \nI fee sorry for the ex for having to deal with two petty a holes.", "You are truly a disgusting person for this. It's hard to believe people with absolutely zero empathy like you exist. Maybe instead of agreeing to her truly awful request, you could've tried to use this as a teachable moment? Maybe about not judging people for their appearance, or not caring what others might think? \n\nOr better yet, not to be the type of woman that shames and puts down other women for simply existing comfortably? YTA!", "YTA. You overstepped your boundaries and made the wrong decision to post pictures of you and your niece on IG. You owe her mother an apology. It doesn’t matter how she dresses! That’s not your business and you absolutely had no right to collude with a 15 year old girl! Get off your high horse and apologize!", "YTA. \n\nYou should be ashamed of yourself. She is a teenager, it makes sense that she would have some shallow, materialistic impulses, but it’s your responsibility as her aunt and a fucking mature adult to teach her to be kind and respectful and not let something incredible petty and unrelated to someone’s character, like their clothing, define her relationship with that person. \n\nBut I saw in other comments that you guys all treated your ex SIL like shit because of the way she dresses too, so who could expect you to be any sort of a role model", "NTA for dropping the truth on your niece’s mom. But you shouldn’t have said it in anger.\n\nYou are an AH for not explaining to your niece that having you impersonate her mother makes _both of you_ liars. And the lie can’t stand. You don’t think people will notice the difference when your ex-SIL shows up for events?\n\nI suspect that your relationship (with your niece’s mom) is less than stellar and you used this as an opportunity to goad her.", "If you can’t see already typing this out that Yta you’ll never listen to us", "YTA, and you’re letting your neice be a little AH too. Her attire is fine, she is comfortable in who she is as a person AND he clothing; eff you t w a t s for being such nasty females. This is a perfect example of times when women could and should band together, and instead it’s the ones like you that just tear other women down. Congrats on being the “pick me” female 🙄", "This is so fucked up. I don’t think people understand the damage words can do to someone’s self esteem and over all life.", "YTA why are you so comfortable disrespecting the relationship between mother and child by partaking in this? You are everything she accused you of. Your niece needs to learn to not weigh appearances and others opinions over that of love for someone and here you are reinforcing shallow, petty, rude, bratty behavior. Incredibly disrespectful to the point that this feels like a sitcom plot point", "YTA, you are the one that should be embarrassed. You deserved every bit of what she gave you. While she is at it, she needs to have a serious conversation with her daughter as well. That is disrespectful. You don't have to like the way that she dresses, but she has the right to dress however she wants.", "OP: You're actually the 15 year old, right?", "You sound like a 9 year old mean girl and so does your niece.  \n\nYTA.  Super weird of you to pretend to be someone’s mom when she already has one, and then act like it’s justified because you and her bratty daughter don’t like her clothes.", "Holy shit YTA\n\nIf anything this needs to be an A(mom) and B(daughter) conversation so C (yourself) out", "YTA.  Your niece doesn’t get to control how her mother dresses just because she’s a snotty, arrogant teenager.  And neither do you.", "This might be my favourite fake post yet. OP is clearly a teen writing shitty fiction. No one else at soccer had ever met her real mom? She posted on SM that this was her mom and expected what to happen? And what sober adult would think \"yeah, this is a great plan! I mean, I could just go as her aunt, but I'm going to full crazy lady and pretend to be a completely different person.\"\n\nOP, you likely have homework due Monday, get off Reddit and get cracking on that.", "YTA-  wow, I guess you never grew out of middle school, mean girl bullshit. You are absolutely an asshole with no home training or common decency.", "You are totally TA big time! All teenage girls are embarrassed by their moms in some way and instead of urging her to maybe open an honest conversation with her mom you have point blank supported her lies and validated her feelings of her mother. Just bc she doesn't have the same fashion sense as you does NOT give you the right to usurp her role especially if her only bad mark is she dresses \"ugly\" SHAME. ON. YOU!!!!! Your niece will now feel its ok to not only further lie to her mother about anything but that you will always LET HER GET AWAY WITH IT. I hope both of her parents limit her contact with you. If you think her mom was the only person to see that that knew it was a lie you are an idiot.", "YTA. Women are awful to other women.", "Holy shit you're TA, even if this isn't real.\n\nYou described exactly how I dress.\n\nWhy do I dress like that?\n\n1. I want to keep the sun off me.\n2. I don't like the way certain parts of me look.\n3. I have an injury that flares up when I wear flats.\n\nJudgemental AH.", "Soft YTA. Mom is entitled to feel hurt. Is this kid being made fun of at school? Too risque or too fundamentalist is going to draw attention. I was lucky and had a beautiful well dressed mom but kids that had mom's that were frumpy pjs and hair rollers at drop off and pick up had it ROUGH. It is not fair but happens. This is similar post recently about a father whose style was getting his kid bullied. Comments ere NOT on the dad's side. His artsy style was getting his kid bullied because he had the weird dad. Hope to see an update.", "YTA \n\nYou….pretended to be her mom? Weird, concerning, utterly juvenile", "I am the queen of the stiletto. But, as I age - I really don't give a flying dang. I wish my kids would trip because I'm not wearing a five-inch heel to go to the hardware store. 😂", "I had to read the description a few times to see if I missed something.  I have a coworker who’s default attire is just that (long sleeves, long skirt, flat shoes) and I think she’s adorable.", "I would clutch my pearls but OP didn’t specify if pearls are allowed 😐", "How dare she choose comfortable clothing!", "ETA: YTA\n\nWhen I was in 7th or 8th grade, I was embarrassed of the way my parents dressed and did not want to be seen with them. My daughter was embarrassed of me at that age as well and didn’t want me going to her games. At that age there is a strong desire to conform and fit in.\n\nFortunately I grew out of it by 9th grade when I was no longer an adolescent. I appreciated the uniqueness of my parents in a community of unoriginal people.\n\nEventually my daughter did the same with me.\n\nWhen we have strong, secure adults around us to show us how unimportant image and status are in the grand scheme of things, we are able to move out of adolescence and into mature autonomy and security. This aunt failed to be a strong, secure role model for her niece. My guess from the way she speaks is that she never moved on from adolescence herself.", "The niece is going to make herself look stupid for lying about who her mom is when her friends find out.", "Not all teens, I’m a teen and I never went through that phase and I’m about not to be, speak for the other 99.99% of teens", "And OMG the daughter is 15! No girl *ever* hates their mother when they're 15!\n\n Oh wait, I made a mistake - virtually ALL 15 y.o. girls hate their mother. Fixed that. \n\nOP f'ed up big time.  The disrespect is stunning.  Maybe the daughter has been hanging with aunt too much and picked up her insufferableness.\n\nEdit: picked up, not packed up", "She supported the child in publicly shunning her own mother for her fashion sense? How in the hell is OP in her right mind pulling a stunt like that?", "Not husband’s niece. Brother’s daughter. So OP pretended to be her brother’s wife at the game (or at least chose to not correct her niece). \n\nYTA.", "OPs niece is acting like a 15 year old because she is one, what's OPs excuse? Grow the hell up. YTA", "Yeah I was really expecting some kind of \"she dresses like a prostitute\" type of thing, which may be understandable....but...long sleeve shirts, long dresses, and flat shoes???\n\nThat's an odd thing to be embarrassed about", "YTA Not to mention parental alienation is starting to be more and more looked at by the courts as child abuse. OP basically described their parental alienation of the mom. Teenagers are always ashamed of their parents. We aren't there to be fashion models. If her freinds are so awful they care about mom's skirts they need to be dumped as buddies.", "Don't worry, if the kid ever needs an organ,she'll go running to her real mother then!!\n\nYTA OP.", "Yeah, does OP not know there are many styles of fashion?", "I'm in awe of how awful OP is. Like I have to actually sit with this for a bit.", "How exactly did you see this playing out in your mind? I feel like you didn’t give it much consideration or you would have realized it was a terrible idea. Any mother would be profoundly angry to discover someone pretending to be their child’s parent for a sport/social event. Especially for such a ridiculous reason. Everyone’s fashion style is their own. I feel like all you’re really doing is encouraging a teenager to judge people for their clothing choices. YTAH", "She just tells that they are from Alabama. /s", "I'm pretty sure \"Mom\" is not an identity.  She is not claiming to be the woman's legal name aka identity.", "I hope that the mom goes to court to revisit the custody agreement over parental alienation. I could certainly see a judge deciding that OP is not allowed to spend time with niece unsupervised. That seems like it would be best for everyone concerned. Even OP. Because then maybe she'd actually reflect on why that is.", ">If she was my daughter you would never speak to or see her again\n\nLittle bit of an extreme response that's pretty much guaranteed to alienate the daughter and send her running to her aunt pretty much the second she turns 18.\n\n\"You asked her to pose as me, she did as you asked, so now you're not allowed to go near her because she did as you asked\"\n\nShe's 15, not 6.\n\nAt that age I lived with my mom (by choice, I'm the one who told the Judge who got custody of me.) If my dad tried telling me which family members I could and couldn't associate with that would have been his last visitation.\n\nI'm going to go out on a limb here and assume if the girl got posed that same question, she would choose her father (I'm basing this on her wanting her father at the game, not the mother, a clear preference has already been shown).", "OP lacks the depth to be a puddle.", "Someone's enjoying the fantasy of screwing and being impregnated by her brother is my best guess.", "With the way it’s written, perhaps it’s the niece pretending to be the aunt? 😂", "Please do not encourage this person to procreate or adopt. Lol", "LOLOLOL!!  Only for people with impeccable style sense like OP and niece!  /s", "Probably cause you didn’t put YTA first.", "no but you guys don’t understand—she’s picking the UGLIEST ones??? uh hello she’s obviously not a fit mother / woman / human being", "Oh, dear God!", "CPS is on standby.", "I know!!!! The humanity!!!", "My mom always made sure we looked great. But, she didn't put the same energy into designing her own look. When we hit our teens and had jobs we all just started gifting her with pieces she could add to her wardrobe. (My brothers still buy her cute shoes and she's 80 now.)\n\nBut, lots of times parents invest more in their kids than they do in themselves and the kids should at least acknowledge that THEY are the parents' priority - not being the chicest mom in the damned room.", "What a great comment", "Can’t wait for her friends to figure out her “parents” are brother and sister, because of course that’s way better than having a mom who wears long sleeves", "Forreal like you really think she's going to keep lie up for so long.", "I wonder if your parents would say the same about you.", "YTA.\n\nYou probably thought you were the \"cool aunt\" or something, but you're really just a distateful person. \n\nPosing as someone's Mum over something so DUMB as fashion taste... My God. If there was a remake of \"Mean Girls\", you could probably take the lead.", "God, you are horrible", "Her clothes don’t even sound offensive. A long sleeved shirt and a long skirt? Like what is even the problem?", "You're the asshole, but you also come across as trash in general.", "When an insane woman starts telling people that she is the real mom? Restraining order time", "You should really look up \"parental alienation and custody cases.\" Just because you don't understand it, doesn't mean it's not real.", "An idiot judge that decides your brother is allowing his kid to hang out with a family member who is okay with pretending to be her parent. You went along with it willingly and didn’t correct the impression. If I knew who the ex was I’d encourage her to take this to court. Parent alienation is real. I know someone who lost custody because of it.", "You are aiding your brother into putting a wedge between child and mother. Because of what you do, you will cost your brother a lot. \n\nYou agreed to pretend to be her mom. That’s you being an inconsiderate asshole who doesn’t actually give a shit about your niece or brother. You just want to make sure that her actual mom feels like shit and is cut out. God, you are an idiot to think you are in the right. \n\nIt’s cute that you delete your comments as well. YTA", "Because YOU could be deemed a threat and the child is YOUR brother’s.     \n\nI mean, a judge could go “oh wow, the paternal aunt was pretending to be the mom in public and on socials? That might not be a good environment for the child. I should limit dad’s time so the child isn’t exposed to the aunt as much.”", "Are you actually a teenager posting this or just vapid? As an adult you should have spoken to your niece about how her mother's clothing *not* being embarrassing & if anyone said anything about it that *they* weren't good people. What you shouldn't have done was cut out her mom by pretending to be her & encouraging it by doubling down & bullying her actual mom. Grow up & stop this (if this is real) before you cause trouble with your brother's custody or lose access to your niece due to your bad behavior. YTA", "All this that others have said- and also parental alienation is a form of abuse. You are without a doubt the AH. You are harming the child and her relationship with the mother. \n\nYTA.", "Honestly, this reads like a teenager venting  about her family. \n\nAnd it is, in fact, real- you’re dripping with condensation and conceit. YTA", "Because his family is encouraging his daughter to deny who her mother is and pretend she isn’t her mother. Which would very much be a problem in the eyes of the court. Add to the fact that you then insulted her mother while basically calling her ugly and the court could tell your brother that you are not to be in contact with your niece as contact with you is damaging her relationship with her mother.", "You think the way someone dresses is a reasonable excuse to think poorly of them?  Treat them differently? What an awful human.", "You're a joke. YTA.  I hope mom, REAL mom, takes your brother back to court for parental alienation. Instead of using this moment as a teaching moment, gently correcting her skewed views of entitlement and selfishness that all teens have, so she could be a better person you chose to double down it which shows you too are mentally a teenager never growing out of  that phase in life. Unless you are purposely trying to either A.  Make her have limited mental functions and shallow personality traits like you OR B. You're purposely sabotaging your brother legally.   Which one is it? Then you called her names because she was right? She pegged you to a T.  Explain to your neice WHY you were wrong.  She has a good mom. Don't be prejudice just because she wears \"ugly\" long sleeve shirts and skirts. She wasn't dressing slutty or dirty. She doesn't make her daughter dress nasty. Whats wrong with you??", "The whole soccer thing and claiming to be her mother on social media is paternal alienation. Instead of encouraging your niece to take her actual mother to the soccer game you've potentially helped damage her relationship with her mother over *ucking clothes...FYI you as the adult shouldn't have allowed your niece to bad mouth her mother and even poured more fuel onto the fire by agreeing...\n\nEdited a word.", "You literally replaced the mom.", "This story reads like the daughter actually wrote it.", "Can confirm, was a 15 year old girl. Hated my mum then. \n\nLost her a while ago and would give ANYTHING to have the lady back.\n\nIt can be and often is a rite of passage... a phase.", "I didn't. We went trough our conflict phase when I was 12, at 15 we were pretty close.", "And called her ex sil a beggar", "Teenagers get embarrassed by their parents mere existence. OP should be telling her niece to knock it off, not encouraging it", "Yeah, I assumed the mom was dressing provocatively, which would have at least made a little sense. This just sounds like mom isn't stylish, which is pretty typical. Also, many parents struggle financially and certainly don't have the ability to purchase fashionable clothes. My mom dressed from thrift stores and wore clothes long past their prime so that she could afford new clothes every year for us. Even at my most self-centered teenaged self, I'd never have thought of insulting her for her clothing. It's foul that an adult (OP) would encourage such behavior. \n\nYTA", "Oh man I didn’t realize this—what’s more embarrassing: your mom dressing kind of frumpy or people thinking your parents are siblings?", "You clearly say \"I went to the games as her MOM\" \nYou know you're not, she knows your not but you let her introduce you that way, and with youre attitude i would put money on that you played up the lie and referred to her your daughter. \n\nThink about a scenario,you find out your friends group regularly dothi g without you, you confront them and 1 says, well we don't like your clothes, they're not our fashion, you look terrible. How would you feel? You'd be on here telling us they were such a$$holes\n\nYTA", "Ah yes the famous \"I didn't lie, I just didn't correct the person who was lying about me\" defense.", "Doesn't matter. Most teenagers go through a hating their parent stage. If her mother was the pinnacle of style and grace? She'd hate that. If she was basic? Hate it.\n\nInstead of giving her some understanding and comfort and stewarding her through uncomfortable feelings...you pretended to be your brother's wife. Cut it out", "Lying by omission doesn't make it better.", "And you didn’t correct her", "That is called a LIE OF OMMISSION.  STILL A LIE. YTA", "Um....that's saying you're her mom without words. How dense are you?\n\nI'd be more embarrassed to be seen with you, a typical \"mean girl\" who is as emotionally stunted as a box of rocks and never matured beyond high school than someone who I didn't like the dress sense of.", "And you just let it happen?", "Did you correct her at any time? Clothing doesn’t take away one’s ability to parent. Nor should it take away the respect they deserve if they’re a good parent. You’re an adult and should not be encouraging this shallow behavior.", "Girl, how do you not see that YOU'RE THE PROBLEM?!?!? She introduced you as her mom and you never straightened her out. You compared yourself to a very loving step mom in the comments. You're weird af for that, considering she's YOUR BROTHER'S DAUGHTER. You admitted to shutting the mom and your brother out purposefully when they were together, just because you and your family thought she should dress better. As if that's any of your places to decide how the mom should dress. You all sound like trash to me because who values looks so late in life? I'm assuming you're 30-32, wait until your ugly spills to the outside and you try wearing the same clothes you are now.\n\nTalk about a clusterf**k!\n\nHow about, instead of judging how she dresses, you all evaluate your outlook on what's important in life, and stop trying to have your sweet home Alabama fantasy with your brother. 🤢🤮\n\nYTA and if I was your niece's mom I would smack the stupid out of you and take my daughter away from such shallow people. If your brother approves of your behavior, he should be smacked with some sense as well!\n\nAgain, YTA!!!!", "She's either an idiot or a manipulator. You need to be an adult with her", "And you went along with it. So yes, you said you were her mom", "Your nice told everyone you fucked your brother and she's the result of your affair, and you dare to shame other woman for how she dresses.\n\nYTA, no wonder why your \"daughter\" is such a fake teen.", "\"Of course I said yes and went to her game as her mom\"????", "It is going to be real fun for your niece when the people in town put together the fact that you are her dad's sister and apparently her mom.... I am sure that no one will make fun of her for having an aunt who dreams of being the mother of her brothers child...", "Golden 😂", "In this case it is because it is a specific mom.", "Lol, that part was pretty funny. Some of the people on this site are nuts.", "You are so immature with your responses and thought process. How old are you and exactly how well is your own life going?? Is lying about being someone else’s mom and being proud of it really the best you can do, cause I doubt you have a lot going for you based on this post.", "Oh I see. So you have no situational awareness *and* you aren’t smart. That’s a lose-lose combo for you.", "Identity theft isn’t a joke, Jim! (Sorry I had to)", "Please use these emojis when your brother is called into court for parental alienation and points the finger at your vapid ass", "Also, the brother may not know any of the stuff that happened.\n\nI imagine that he would be mad if he found out too.", "I agree that she’s 15 but OP is the adult. She should have used this as a teaching moment but chose to be a bully. So yes she would never be around my child again. If my kid turned 18 and decided to go running to her bully of an aunt then so be it.", "LOL!", "Fuck that call the FBI!! This woman subjected a whole team of teenagers to poor fashion choices! (Hoping the irony in that is obvious because hooboy teenagers have some *regrettable* choices.)", "Awww this is adorable.", "Don’t forget the *ugly flats*", "Yes my mom uses me as a example of a good kid", "I mean, really. Her *clothes*. I'm absolutely flabbergasted", "Right?! The comment about her dressing like a beggar because she wears long sleeved shirts and long skirts…seriously?! I thought for sure OP was very young, but if she can pass for a 15 year old’s mom, the hyperbole of that beggar statement just makes her sound astoundingly immature.", "And flat shoes. The horror", "I wonder if there’s a religious reason behind the clothing choice?", "What insane woman starts telling people that she’s the real mom of her brother’s child? \n\nEw", "Yeah, it’s such rage-bait I’m wondering if it’s real.", "Yeah, especially the way she describes her clothes. I would hope no actual grown adult is that shallow and immature.", "Was both a 15 year old girl and had a 15 year old girl. Can definitely confirm. She -hated- my clothes at 15. She’s now 20, and will tell you that my clothes are not my clothes, they’re our clothes 🙄", "This! I would give anything to have my mom back. I don’t care if she wanted to walk around in an actual trash bag if it made her happy.", "No, TBF, she didn't. She only said she dressed _like_ a “begger” [sic]. \n\n(Though, TBF in another fashion, that is kind of a more logical spelling.)", "That was one of the fun parts of having teens. \nDoing all the things you've always done as a couple and then they are suddenly such a huge and major embarrassment. \nThings like holding hands in public, it’s almost obscene.", "Exactly. I was embarrassed by my Mom (and really everyone else's Mom too). Now I realize how ridiculous we were.", "Eh, what? Presumably nobody at the game knew that the niece's fake “Mom” was actually the niece's aunt, so why would they think her parents are siblings?", "She's definetly more guilty. This could have been a moment for OP to teach her niece to knock it off", "Or even validate her feelings while still being like “but she is your mom, and I’m uncomfortable with whatever this is”", "Yep, and you can see how many moms love their  AITA drama by how many downvotes I get.", "Since when is it immaturity try to steal someone’s role and then make fun of them for how they choose to dress to that person’s child?", "Yeah, I was thinking that too. Parental alienation attempts can *absolutely* affect custody, and if he's got any sense he's gonna be pissed AF when he finds out. \n\nIf he *did* know, then he's as much a problem as OP, but from the post it doesn't sound like it.", "It honestly probably wouldn't even take that long. Depending where this is taking place She's old enough to cut contact *right now*\n\nThat conversation could very well go \"You can't hang out with your Aunt anymore!\" \"Okay, I'm going to move in with dad full time now. If you need me I'll be packing.\" Thats assuming she lives with mom now, based off the post, I think she already lives with dad. In that case, there might not be a conversation at all, just \"Okay\" and next time visitation comes up, she's old enough to decide she doesn't want too.\n\nBecause thats *exactly* how I would have handled it when I was 15. You want to try and separate me from my family? Fuck you then\n\nPersonally I don't think this whole scenario is worth risking tanking the relationship with the daughter over.", "I think there’s also a difference between: ‘gosh my mom is *soo annoying*, why do I have to make my bed if I’m just gonna unmake it to sleep later?’ and ‘my mom is so gross and ugly she dresses like a peasant I can’t be seen with her in public, what a loser’.", "The exception that proves the rule. ;-)", "God forbid anyone ever wear shoes that are *comfortable*!", "That's the only reason I can think of that someone would object to a covered-up dress sense and imagine it's fair criticism.... then again, maybe she does just think long sleeves are a moral failing in their own right.\n\nI mean, it's not like the opinion is any less unreasonable no matter why she holds it, though.", "I pray no adult on earth is this insipidly insensitive.", "I get the feeling it's fake.", "I read it and came to the conclusion it's not real.", "I know many of these posts here (including the replies) are so outlandish I do question how real they are.", "It's just gotta be fake. No one who is around an active social media user would allow themself to be tagged as someone else's parent and expect it wouldn't get back to the actual parent. You only do something like that if you're the jealous step-mom, et cetera.", "After hearing about my own aunts and uncles from my Mom I'd say it is very possible", "My mom could have dressed like a friggin fashion magazine model, and I STILL would have been embarrassed by her at 15.", "My mum said the hardest part was the first time my brother and I didn't want to hold her hand in public 🤣 it crushed her, apparently! But she obviously understood it was part of growing up", "Since when is it NOT immature?", "I hope it’s fake.", "Yes, I really hope some of ‘em are fake.", "it has to be fake. this is just asinine.", "Yeah what adult really say that the terrible fashion sense is just flat shoes with long sleeves."]}