{"id": 32710, "submission_id": "18ev4af", "title": "AITA for being annoyed that my husband let someone in our house unannounced to use the restroom and waking up our sick baby?", "selftext": "My 3 month old son is sick for the first time. It’s 9pm and suddenly my husband gets up and opens the front door and his friend walks in. I asked why there was a person in the house, and he said his friend had to pee. This wouldn’t be an issue if it weren’t for the fact that my boob was out from nursing our sick son to sleep, and we have FOUR DOGS. They, of course, bark and wake the baby up. I gave my husband a look that would’ve knocked him dead if looks could kill, and when his friend left I said “I think it goes without saying, never do that again” as I’m rocking our, now awake, baby. \nMy husband goes “if someone needs to use the restroom I’m going to let them” \nI responded “he literally had to drive farther to get here than he would’ve to stop at a gas station” (based on where we live, no matter where his friend is coming from, this is true) \nHe said “it’s not my fault that the dogs barked”\nI said “but it is your fault there was someone in the house to bark at or at a minimum, that they weren’t outside when that person got here”\nHe just responded with “sounds like a personal problem” and went back to his game. \n\nI was annoyed about my sick baby being woken up, but now I’m sitting here fuming that I could get even an “yeah I’m sorry, that was a bad idea” but maybe I’m the a-hole for being annoyed it happened in the first place. What do yall thing, AITA?", "created_utc": 1702181259, "permalink": "/r/AmItheAsshole/comments/18ev4af/aita_for_being_annoyed_that_my_husband_let/", "score": 277, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole for chastising my husband, he feels am TA for being annoyed when he feels he was trying to do something nice\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "\"Sounds like a personal problem\"\n\nWhat is he, 15 year old?\n\nI'd be handing the crying baby over to him and saying \"THIS is your personal problem. Fix it\".", "[removed]", "NTA. \n\nHe’s also a parent. It’s not a “personal problem” that your son is awake. Your son is just as much his child and his responsibility.", "You definitely should have handed the crying baby to your husband.\n\nNTA.", "NTA hubby sounds like an idiot", "NTA. All of the comments saying YTA have been ignoring the fact that your boob was out and you were exposed while nursing a sick baby when your husband let someone you don't know into your home without a heads up. Next time he wakes the baby, that should be his 'personal problem' until baby is settled and sleeping again. Hope your baby feels better soon :)", ">He just responded with “sounds like a personal problem” and went back to his game.\n\nThere is no coming back from this. Does he often leave you to deal with the baby while he plays video games? Does things with no regard for you or the baby?\n\nBeing a single mother would be easier than this.\n\nNTA, but get a divorce.", "NTA - Do you know this friend?  It sounds kind of shady, like he came over to borrow money, or make a drug deal or something - and \"needing to use the restroom\" was just an excuse to drop by - especially with that over-the-top response your husband gave you.\n\nSorry, I don't mean to make it worse than it is - it's bad enough already - but most men wouldn't drive over to a \"friends\" house to pee - they can pee behind any tree or bush.", "NTA \n\nClearly, your husband cares more about his friends and his game on tv than he does about your sick son and you. \n\nThis situation needs to be talked about before it festers any longer. His priorities need rearranging and he needs to show more respect for you, your son and your marriage because those things are what should come FIRST.", "Definitely NTA. Your baby being woken up is not a \"personal problem.\" \n\nSounds like the kind of guy who loves to show how \"generous\" and \"considerate\" he is, and how many \"sacrifices\" he's making for other people, when the reality is that he just doesn't give a shit what happens to his wife and child, as long as his reputation is good.\n\nAKA, a narcissist.", "I'm a old mom with a  awesome husband who never pulled this  when we had babies . Fathers can support new mothers without coddling dads onto the role", "NTA. Your husband prioritised his friends bladder over his family.", "NTA, but someone dropping over your house to pee is strange.   Did anything exchange hands between the visitor and your husband?   Maybe I’m just suspicious.", "If he had spent ages feeding and rocking a sick baby to sleep and then one of your girlfriends came by to use the bathroom, he’d be pretty pissed. He’s being ignorant and selfish. You’re NTA. Is this a pattern for him?", "I’m sorry but why the fuck would anyone go to a friends house to take a piss.", "NTA. He could have prevented the dog's barking by taking them outside, which would have prevented the baby waking up. He could also have told you someone would be stopping by, so you could have covered your boob. He could also have told the friend it was not a good time. He did none of these, so he could have at least taken the baby to make him fall asleep instead of keep playing videogames. YOUR HUSBAND IS AN INCONSIDERATE AH", "Went back to his game!? Nah I'd unplug that shit. We both have to deal with the crying baby since you think it's ok to just have people over. And you get to sleep on the couch for the next few nights.", "Definitely NTA. Also, and maybe it's just me, but it seems like a weird thing to do. I'm suspicious so read what you want into it but it sounds like a lame excuse to drop or pick something up. \"I'll just tell her you need to use the washroom...\"", "Soooo your husband let his male friend into the house to urnitate…. There are like a million places he could have pee’d\n\nNTA", "Whoa Nelly.  He let someone into the room where you were free breasting? I would have given the gentlemen my sick and crying baby to soothe and gone to bed. \"Honey you and Steve need to help the baby get settled. Talk to you in the morning right after I get over the fact that you let someone in the house while I was free breasting. Right now, I need you to give me some space and some silence. Your behavior isn't defensible so at least stop talking smack at me.\"\n\nomg. I would not have been all Carol Brady about that crap.\n\nHis pal could have peed on the side of the road. Its a personal problem, alright. The person with the problem is *your husband.* WTF?", "NTA you need to hand him the kid and find something else to do whenever that idiotic personal problem line comes out of his mouth.", "Your husbands friend has learned from his mistake, your husband sounds like he hasn’t. \n\nNTA.", "Put the screaming baby in his arms and tell him “now it’s a you problem“ and go take a long hot shower to relax. Seriously- he wakes up the baby he can’t get the baby back to sleep.\n\nA guy can pee on the side of the road. Jeesh", "NTA. its creepy to do that.", "He wants to do stupid things like that?  Not a problem.  He can calm the dogs down, he can calm the baby down.  You can go to the kitchen, get a glass of water or juice or soda (I don't care) and relax in whatever room you choose to relax in until he either gets everyone calmed or apologizes for being a tw\\*t.\n\nI am guessing if you are out, he tells people he is watching the baby for you.  \\*He should be taking care of the baby or being a parent, in case it wasn't clear.\n\nNTA", "Nta", "I'm so furious for you OP. I'd would suggest if possible to start pumping milk to have on hand for the baby. That way the next time he causes the baby to be awakened and says it's a you problem you can make it his problem and have him get the baby back to sleep. What an asshole", "NTA.  I think u should've handed husband sick baby and went to bed!", "NTA.  Your husband is a raging AH.  If this is indicative of how he treats you, I’m baffled as to why you’d even stay with him.", "Your husband is an idiot but it’s not a big deal, maybe it’s seems like a big deal because your baby is sick and this time is stressful. Idiot move but not an asshole.\n\nEveryone in this sub needs to chill, not everyone needs to get a divorce, I can tell most of the commenters are 17 and never been in a relationship.\n\nNTA", "“Sounds like a personal problem” is enough to make me kick him to the curb for the night. Wow. Hell no, my friend. You are NTA. He was stupid and inconsiderate and then doubled down. He owes you an apology.", "NTA. Your husband is being a \"nice guy\" to anybody but you. He seems more concerned with public reputation than giving any thought to you (or the baby!).\n\n“Sounds like a personal problem” means he's given you carte blanche to solve this problem in any way you choose so that he will never repeat this behavior. Get creative and go for it!", "girl NTA. Firstly, sending you good vibes; I hope your son feels better soon. \n\nBut secondly, is your husband like, 12? Who talks to the mother of their child like that? \"Sounds like a personal problem??\" ayfkm? I'm so indignant for you. He's clearly putting himself and his stupid, inconsiderate bro before you and his baby.", "I wanna kick your husband through my screen.", "NTA.  You have a child for a husband.  You will be much happier when he becomes, or is replaced by a man.", "[deleted]", "NAH. It’s an easy thing to not realize. When I read the headline I thought it was gonna be a stranger lol. You’re fine to be annoyed but people get defensive when they get scolded. I woulda waited till I wasn’t mad anymore to talk about it", "While you are entitled to be annoyed that the barking woke your baby, YTA. It is so sad to see the prevalence of “don’t bother me unless you schedule in advance” on this sub.  It is sad that community and fellowship are being erased from the world.", "YTA for not handing the baby to his father to deal with it", "YTA for not making it his problem. He woke the baby, he acts like a parent and gets them back ti sleep. That’s literally the only way this hands-off Dad will get it.", "YTA\n\nYou don't communicate, have unvoiced expectations that are impossible to meet, use your baby as justification for your anger issues, and just sound like an overall insufferable person.", "YTA, honestly sounds like you're being incredibly overbearing. It's his house, he can do what he wants. You should apologize and frankly consider anger management.", "[deleted]", "Yta it is his house to. Hand him the baby and leave next time.", "lmao you are delusional", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy 3 month old son is sick for the first time. It’s 9pm and suddenly my husband gets up and opens the front door and his friend walks in. I asked why there was a person in the house, and he said his friend had to pee. This wouldn’t be an issue if it weren’t for the fact that my boob was out from nursing our sick son to sleep, and we have FOUR DOGS. They, of course, bark and wake the baby up. I gave my husband a look that would’ve knocked him dead if looks could kill, and when his friend left I said “I think it goes without saying, never do that again” as I’m rocking our, now awake, baby. \nMy husband goes “if someone needs to use the restroom I’m going to let them” \nI responded “he literally had to drive farther to get here than he would’ve to stop at a gas station” (based on where we live, no matter where his friend is coming from, this is true) \nHe said “it’s not my fault that the dogs barked”\nI said “but it is your fault there was someone in the house to bark at or at a minimum, that they weren’t outside when that person got here”\nHe just responded with “sounds like a personal problem” and went back to his game. \n\nI was annoyed about my sick baby being woken up, but now I’m sitting here fuming that I could get even an “yeah I’m sorry, that was a bad idea” but maybe I’m the a-hole for being annoyed it happened in the first place. What do yall thing, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA-  sounds like this was a unique mistake but seriously dude?\n\nHe should have had to deal with the awake baby at that point.", "NTA it sounds like tensions are understandably high as one would expect with a sick three month old.", "My BIL turned up on our doorstep one night with a random friend we’d never met before to use the toilet. He interrupted our dinner and random and I were left in the living room feeling incredibly awkward.\nBIL did a massive turd in the toilet and didn’t scrub afterwards.\nThat was years ago and it still annoys me. Add a sick baby to the mix and NTA x 1000!", "NTA. I would be pissed. At the least he could have asked you if the friend could use the bathroom real quick then respected your answer or like a heads up so you could close the door or cover up a bit more. He really didn't consider anybody else when he let the friend in.\n\nAlso if he has people coming over to use the bathroom or something real quick I would look into that a bit more", "The friend didn’t use the bathroom, he was there to drop off something like drugs. \n\nNTA. \n\nThis is fishy as hell.", "NTA in my opinion you should not show up at someone's house after 9 pm unannounced unless there's an emergency. needing to pee is not an emergency when there are plenty of other places to stop and use the bathroom at.", "NTA.  I can't believe he's still breathing after that comment.", "YTA", "NTA. Not to sound gross, but why couldn't he just piss in the yard? Like, one of the many perks of being a man is that we can pee just about anywhere because we don't need to sit down, wipe, etc. My old roommate and I used to pee outside all the time when we were drinking. If my wife was still nursing and the kid was sick *and* we had dogs that were prone to barking any time the front door opened, that's not even a hard decision to make.", "Honestly. Give him the baby and walk away and pop on noise cancelling headphones", "Nta I use to warn people about times my babies slept (twins my first go round). People knew to be scared of me as sleep deprived me is not a nice me", "A male. Needed to use **your** bathroom. Let's ignore the fact that there were gas stations around. **any bush will do**\n\nNTA and I would have handed him the baby. He woke the baby he gets to put the baby back to sleep.", "Dude your partner is an AH. \n\nSick kids, not to mention this is the first time your baby is sick, are so hard to get comfortable let alone to sleep. And I would be pretty furious if I was comfortable in my own home with my tits out and someone randomly waltzed in without being notified they were coming. Like your husband had to have known he was on his way over — he literally could have put the dogs out back or something, told you about it, etc. sounds like he only cared about being considerate for his friend.", "NTA. It shows remarkable restraint that your husband and TV are both intact.", "Most clear cut case of NTA that I’ve seen on here!!!", "This is the simplest answer by Aussiealterego. While he is playing his game or watching one, and the baby starts crying, give the baby to him. Attitude will change even if he gets upset at the moment. Also, any guy can find a place to pee.", "I would have told his friend directly, \"I didn't expect you and you can see how inconvenient this is for me. Please be considerate in the future. My baby is sick and its just not a good time for y'all to have a play date up in here.\"", "Our rule was, \"You wake it, you take it.\" Baby was rarely waken.", "I literally responded “this is absolutely a personal problem and if you wanna hit me w some stupid shit like that again, I’ll make every little thing YOUR personal problem from now on”🥴 I got a little heated", "NTA.  Your husband is a raging AH.  If this is indicative of how he treats you, I’m baffled as to why you’d even stay with him.", "I have the internet box plugged into an outlet with nothing else for this very reason , and it’s marked on the breaker box…\nMy husband KNOWS , I’m the FAFO type… \nFuck around & I’ll turn the internet to this whole house off. \nAnd I control the internet password.. wanna really fuck around I’ll change the password to the modem", "Is like to think he isn’t generally an idiot, but this was certainly not one of his finer moments in my opinion🤣", "To clarify, I do know the friend, I probably would’ve fully freaked out if it was someone I didn’t know to be honest. And thank you :)", "He’s usually pretty involved with and conscious of the baby and his needs. I do think he was being defensive because he thought he was being nice, but that response regardless generated a huge “wtaf” from me", "Lmao how old are you to think it’s logical to jump to divorce? Bffr.", "“Oh no, two adults with a sick newborn that are under a lot of stress had an argument. They need to divorce immediately!”\n\nTell us you’re single, have no kids, and quite possibly have never had a successful relationship why don’t you.", "Yea let’s get a divorce over an argument we had once, lmao get a life.", "Trash advice don’t listen to this op.", "Um, if you think that is something thats considered no coming back from then you shouldn't ever get into a relationship if such a thing is a deal breaker. My wife and I have said far worse foot in mouth comments than that. \n\nI agree with the other poster. This is trash advice", "I do know the friend. He went into the bathroom and then left, so I’m definitely inclined to think that’s genuinely all it was, but going out of your way to come here to do it was definitely weird", "Yeah it’s drugs. Husband hides it in the bathroom then friend leaves cash in its place, friend drives out of his way late at night just to pee? Nah", "This was my very first thought.  How many men drive farther than necessary just to pee in someone’s bathroom?? Almost none.   The friend was dropping off or picking up drugs and your hubby was paying him or selling to him.  .  There is no other rational reason why things went down like they did without including a drug transaction.", "I'm so glad it wasn't just me thinking that!", "He’s generally very conscious of the baby and his needs, which was an added layer of “wtf” from me on this one to be honest", "No, my husband just opened the door and he went to the older kid’s bathroom then left. That was all🤷🏻‍♀️ I also know the friend, so it wasn’t someone totally strange to me", "I wouldn’t say it’s a pattern. He’s usually quite conscious of the baby and his needs, mine as well. He does every once in awhile do things that have me going “…????” But this one had me more pissed off. To be fair, I know my baby was exposed to RSV, so I’ve been extra stressed about him being sick for this reason. Everything that happens regarding my son the last few days has felt like a level 10 emergency even when it’s not", "Okay that’s what I thought🤣 I would go to a store or gas station before asking a friend, personally. I have literally no idea. He lives like 20ish minutes away, I’m not even sure why he was in our area.", "He quite literally walked in, went into the older kid’s bathroom, and left 🤷🏻‍♀️ maybe 3 minutes total. Which is almost weirder to me than potentially some shady dealing, somehow?🤣", "I did go to bed actually haha, but I took the baby with me. He fell back asleep, and has been exposed to RSV which definitely contributes to my stress and probably my reaction; I don’t want to let him out of my sight. I feel like all I’ve done for 2 straight days is watch him to make sure he’s breathing okay, and I’m too scared to entrust that to someone else🥲", "Yeah I always take those with a grain of salt. Definitely not divorce worthy. But certainly annoying🤣", "I agree with you, except the part about OP's boob being out raises the stakes for me.", "He literally told her that the baby being woken by *his* selfish actions was her personal problem then went back to the video game, leaving his wife to struggle with the sick baby. Fuck him.", "Do I react favorably? No. I do, however, go out of my way not to bring unannounced visitors into my home to surprise my family with. Seeing my sick baby needless awakened, it was a knee jerk reaction. Probably not the most kind one, but not really something I had control over in that moment", "I would never talk to my husband like that. I would be frustrated AF, yes, but I’ve learned you have to be softer when bringing up frustration otherwise it never goes good for anyone.\n\nBut her husband REALLY should have consulted her first, especially with FOUR(?!) dogs in the house knowing they’re gonna bark. \n\nBut I empathize with him wanting to help a friend. She could have moved to a different room first or they could have come up with a solution to help make the situation less stressful.\n\nHubby should have apologized too, he sounds like a child.", "I agree.  I just find this post odd.  I get that the friend popping in was an inconvenience that ended up being disruptive, but I don’t think the husband was obligated to not let him in.  \n\nOP’s tone feels very charged and like this is about more than this one incident.  Had he helped get the baby back to sleep that would have helped things.", "Dude. No. I mean, just no. Hubby made a very poor judgment call and then acted like a dick about it.", "How is it impossible to meet the expectation that you don’t let someone in, knowing full well we have dogs that will bark, when your sick child is asleep", "Hahahahaha", "its also her house.", "Tell me you don’t own dogs or know Jack about a pack of dogs, without telling me …", "Because they’re dogs and a strange person came into their home while they were sleeping.", "Explain that one to me. Like I’m 5", "[deleted]", "Good for you!  It sounds to me like he hasn’t made the mental adjustment from game playing guy to attentive dad yet. Maybe he needs some solo parenting time to see how important sleep is for babies (and their caretakers)?", "Your husband’s disrespect of you isn’t okay. He needs to work on that. NTA", "This is the correct response. NTA. Anyone with any sense knows not to wake a sleeping baby.", "This is abusive behavior, definitely not something to be proud of", "Calm down, fellas. She's taken.", "You sound like a controlling tyrant.", "Well don't you sound like a Caring Understanding Nice Tenderhearted kinda person.", "If he ever does it again, what you do is give him the baby and leave. He woke the baby up with his inconsiderate assholerly so he can have the consequences of that. \n\nNTA", "You had your boob out. I would feel violated.", "This story is completely fishy! \n\nIt’s more likely he was dropping off something like drugs. So sorry.", "It was completely disrespectful.", "How is that trash advice. Let him get the baby to sleep and op can go sleep somewhere else until then, aka another room. Let him deal with the consequences", "I'd understand if it were a female friend, let's be honest public bathrooms are gross, but if you can stand and pee you have no reason to intrude on someones home.", "Yeah. This is so shady. Why couldn’t homie pee in the yard?", "He hid something for your husband in the bathroom, something he was dropping off. \n\nI’m so sorry, but you need to get to the bottom of this before your kid starts crawling and finds daddy’s stash, accidentally od’s. I’m entirely serious. \n\nThis is exactly the type of weirdo behavior ppl on drugs think others won’t notice. We noticed.", "Investigate. It is weird.", "I'd understand if it were a female friend, let's be honest public bathrooms are gross, but if you can stand and pee you have no reason to intrude on someones home.", "In this situation, your husband should have given you a heads up that someone is coming in so you could cover up.\n\nNext time, you should hand over the baby to him to calm if it’s his fault that the sleeping infant woke up. NTA", "I’m old like my 60s and I have never popped in to anyone’s house to pee, lol.", "You don’t trust your husband to watch him breathe? I’m so sorry :(", "Yea I feel you, I just wonder where she was with her boob out, like if it’s in front of everyone then I understand but if she was in another room nursing then I don’t think it’s a big deal.", "[deleted]", "So, yeah, you got upset in the moment.  It happens.  And in this specific instance, I *do* think he ought to have been more aware of the situation.  But you seem to have a more general expectation that he run visitors by you in advance, not just because of the situation, and that's definitely something that different households do differently.  Your expectations aren't wrong, but they also aren't right.  Different households do things differently, and the two of you need to agree on how you do things, not look down on each other for doing things differently as both of you seem to have done here.", "[deleted]", "I don’t think I would’ve escalated from annoyed about my baby being woken up to straight up angry if it hadn’t been for his response. \nBut we also have a mutual expectation that there people aren’t invited over without making the other aware, and a general expectation that the baby is not woken when sleeping unless for something necessary like a diaper change. The part that speaks to that is that he knows our dogs bark, and they were all on the couch with my baby and myself, and didn’t do anything to prevent that from happening which I found very frustrating", "Did you express this stupid expectation beforehand?\n\nYou have dogs and a baby.  The dogs are going to bark. The baby is going to wakeup until it becomes used to the dogs.  Did you and your husband agree that you will never have visitors again because you have dogs and a baby? \n\nFfs, grow up.", "You are absolutely correct. If my friend doesn't text me beforehand and randomly shows up on my door at night uninvited and unexpected, _knowing_ that I have a sick kid and four dogs, I ask him to leave. Your husband shit the bed on this one.", "The dogs wouldn't be doing their job if they didn't wake up and bark at a stranger coming into their house.", "[deleted]", "im fairly sure you can train them not to bark to that. or anything else, for that matter.", "i think you have the ability to read?", "He could have peed on a bush outside. The husband inviting him in was the problem.", "He actually has 2 older children, 7 and 9. He spends his weekday off alone with the baby, so he’s not totally clueless which was part of why I was so thrown for a loop I think. He’s typically very conscious of the baby and his needs", "Do you think it’s appropriate to allow people in your home when you know you have a sick baby ?", "To be fair to him, my son’s head was covering the boob for the most part (I think at least lol) and the door is a bit of a distance from the couch where I was laying, though still in the immediate eyeline. Though, I am often fully exposed these days and I don’t even think my husband looked over before just letting his friend in, so it could’ve been a full on show🤦🏻‍♀️", "There is “coming back from this” that’s just bullshit to say otherwise. Being a single mother wouldn’t be “easier than this”, and suggesting divorce over this one incident is laughable. \n\nEvery word said above is trash advice.", "\"Trash advice\" is referring to the comment that says \"get a divorce\".", "Did you know that men actually take shits too?", "I’m honestly not concerned about it. Nothing like that has ever happened before, I know the friend and he’s a good dude. If it became a pattern or there were other red flags in our lives I think I would be inclined to do so, but as it stands it was just a weird one off", "I was in our living room on the couch, which is in direct eye line of the door, though at a bit of a distance. My son was in front of the exposed boob though so that’s good at least, but I’m often hanging out fully exposed these days and I don’t even think he looked over before getting up🫣🤣", "When there’s a sick baby, and a breastfeeding mother, their comfort should be his priority, but his mate needing to take a slash. \n\nBeing upset in that moment is completely reasonable. Snapping was reasonable. Having a mate waltz into the place was not at all reasonable.", "Sure, but you also should be self aware enough (and aware of others enough) not to do something like, in my opinion. And have the decency to acknowledge the thoughtless thing you did was thoughtless", "We have a mutual expectation that we run visitors by the other party in advance", "Been together nearly 15 years. Been a lot of work though to get to where we are today with communication… but worth it.", "We do have the mutual expectation that we don’t have people over without the other person who lives in the home being made aware and also a mutual set expectation not to wake the baby up after his bedtime or times of distress, so yes lol.", "He did text him beforehand which was part of my frustration at my husband. Like sir you had time to prepare and give me a heads up or at least put the dogs out and you just…. Didn’t???", "That’s how I feel. That’s actually a big part of why I got my oldest dog when I was 20", "Tell his friend his sick baby is sleeping and that there is a gas station up the street, or put the dogs outside before letting said friend in", "Apparently you don’t. I read it fine. I’m asking you to elaborate babe.", "For real. I'm a woman and I pee outside, much easier for a dude to do. Really weird that the friend dropped by just to pee. I'm gonna guess he was either hoping to hang out or maybe delivering a bit of weed.", "I don't understand this OP for this reason. Is there some sort of peeing anxiety? \n\nWhat bloke is knocking on a mates door to pee at that time?? Or is it a woman?\n\nEven if it is a woman, I know plenty who would just do the same. \n\nThe whole sick baby etc seems irrelevant to me. I don't get it. \n\nFrom OPs other comments it sounds like they drove past many an appropriate quiet spot to deal with it. \n\nNTA. Even without the extraneous info.", "No, the problem was that the husband didn’t give  OP a heads up so she could cover up and he could put the dogs outside. OP has clarified this in other comments.", "assuming the baby didn't actually need feeding,  I would have given him the baby and made it HIS personal problem.\n\nIf he made the problem why should you need to be the one to fix it?", "Maybe just a bad moment for him. You are still NTA. I hope the little one feels better soon!", "Kids from another woman? Well I can see why she left", "My comment doesn’t mention that at all.\n\n\nI’m just replying to your manipulative actions with the internet", "Ahh ok, yea in that case dumb move.", "Some people can't acknowledge the thoughtless thing they did, in the moment. They need a moment to process all the things they're feeling and thinking.\n\nHe was thoughtless, by not thinking ahead to how to do this more quietly. You were venomous.\n\nYour husband was thinking about his friend, not about the baby. I presume he's smart enough to also know that your house is not the most convenient option, so why did his friend ask to come? Your husband should have told you and you both worked towards this unexpected guest feeling welcome in your house, for any personal emergency they might have. He wasn't wrong to allow his friend to come in. That's what we do for friends especially those willing to go out of their way in order to see one of us.\n\nYou snapped at him, when he was probably still worrying about his friend. His response was uncalled for, but so was yours.", "ah my bad if that was a reading comprehension failure, but imho that like makes it worse? I hope your husband is able to reflect and realize that his buddy's convenience isn't worth the stress this put you and your baby through.", "It sounds like your husband expects you to do everything. Glad you've got your dogs!", "I’m not sure where you live/what time it is, but is the gas station even open?", "so sad :(", "upset, are we? i guess thats what happens when trolls get called out", ">or maybe delivering a bit of weed\n\nbased on absolutely fucking nothing, you pulled this out of your prison pocket", "Exactly this. You think waking my sick, grumpy baby is a \"personal problem\". Welp, you can now consider it YOUR \"personal problem\".", "My comment has to do with the post, and previous commenters comment.\nIf my husband were to have people over when my kids were sleeping and/or talk to me with disrespect while I care for OUR sick kids and be playing video games … ya no. We won’t have internet here.", "Also in regards to your comment that it’s not that big of a deal but seems like it is right now because he’s sick- I concede that that’s probably true. He was exposed to RSV this week and got sick shortly after, so I have been incredibly anxious and stressed. Everything regarding my son the last few days has felt like a level 10 emergency, even if it really isn’t.", "His friend had to pee, you make it sound like he was gravely injured", "Yes. There are also a plethora of backroads on farmland on one side of us and several fast food places still open on the other side. Also would’ve been fine with a heads up and him putting the dogs outside", "Hahahaha oh my god I love Reddit.", "What's a prison pocket?", "Cool cool\n\nThe fun thing about Reddit is you can reply to multiple people, not just OP", "I hope he gets better soon! 🤞", "I hadn't considered injury a possibility. I do know though that when my friends drop by unexpectedly, whether they say they need my bathroom or not, that there's a higher chance that something is going on for them and they're working up to talking about it with someone. And I'm *not* in an inconvenient location.\n\nYou seem determined to imagine that your husband was plain and simply thoughtless while I'm pointing out that he was thinking of his friend.\n\nI understand that you want him to prioritise the baby first, especially while sick, but this isn't how you get your needs and wants met. You're going to need to talk to each other.", "NTA. \n\nI’d be throwing out the game.", "Why didn’t you just say that when you first confronted him about what happened? All you said was: “don’t do that again”. You didn’t tell him which action you were referring to. You guys aren’t arguing about the same thing. He thinks you’re mad because he allowed his friend to come in and use the bathroom. You’re upset because he didn’t give you a heads up so you can prepare for a guest to enter the house. I think your anger interfered with your ability to communicate effectively. Just to be clear, this isn’t a defense of your husband. I’m just pointing out that it’s possible he misunderstood your stance on this issue.", "me too!", "another way of saying ass, yknow, smuggling stuff into prison by sticking it up there. point is, where the hell did you get that this dude bought weed from the uninvited guest lol.", "lmao, this comment had me cracking up", "He walked in, used the restroom, and left. It was in no way deeper than that. There was nothing going on with his friend to be worried about", "No, he absolutely knows I’m upset because our sick, sleeping baby was woken up. I didn’t react until that happened and the next part of that conversation was “our sick child being woken up is 100% your problem as well”", "Honestly he probably doesn’t realize. Like for real. You would think that he does but guarantee he doesn’t. It’s easy to think that people see things as we do but often we are way off", "You’re misunderstanding my point. He thinks you’re saying that he shouldn’t have let his friend come in at all. What you’re saying is he should have given you a heads up so you could ask him to put the dogs outside. You’re arguing over two different aspects of the same situation."]}