{"id": 32732, "submission_id": "18eud86", "title": "AITA for not allowing my stepkids to move in with us?", "selftext": "I am marrying my fiancé a year from now, he is a wonderful man. He has two kids from previous relationship and I get along with them well. They have been living with him and his grandmother for the past few years, and that has been working well, or so I thought. He has been spending more and more time at my place and increasingly pushing for the kids to move in with me. I love him being here, and am fine with him moving in with me down the line, and I let the kids visit, but I am not ready for the kids to be here full time. \n\nFor background, I am autistic and have a learning disability, but I’ve been very successful in life by knowing my limits and knowing what boundaries I need in order to be successful in a world that’s not tailored to my traits. One of those needs is a distraction free / “quiet” room. So when I moved after my med program I made sure to purchase a two bedroom apartment in which one room is the bedroom and the other room is my quiet office and cooldown room. This worked for two years very well. After I got a stable job, I haven’t been using the room as much, though it is still very nice to have, and is filled with my clothing and belongings that don’t fit in the tiny bedroom which contains my fiancés storage bins. To be clear, only my name is on the lease, I’m the only one who pays rent, and this is my apartment. My fiance visits very often and usually stays over at night. Over the past year or so he has been increasingly pushing for the children to move into my apartment. I’m not comfortable with this, as I am not ready to be a full-time step mother yet, my career has just started, I work a very busy medical job that is high stress, and I plan to be a more active parental figure after we are married. However, he insists that I need to empty out my office and make it a children’s bedroom. If I do that, I won’t have anywhere for my belongings or any place to cool down or get away from overstimulation. Since I am the only one paying the rent and it is my name on the lease and I’m not supposed to move anyone else in right now, im not comfortable doing this, and I don’t feel like I owe him that. He says his grandmother is getting increasingly difficult with the kids, so I suggested maybe he get a separate apartment for him and his kids, but he doesn’t have the money to do that, and would rather they all move into mine.\n\nAITA for not turning my office into my stepkids’ room?\n\nEdit: he would be moving in with the kids and without paying rent at my place.\n\nAt the end of 2024 I am changing jobs and we are all moving in together in a bigger space out of state — him, me, the kids, and he will pay rent there. They would just need to be patient until then. ", "created_utc": 1702178556, "permalink": "/r/AmItheAsshole/comments/18eud86/aita_for_not_allowing_my_stepkids_to_move_in_with/", "score": 62, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because I have a perfectly good room in my apartment that I could let them move into. However, this would be a breach of my lease, it would force me to also purchase a storage unit for my belongings, I would have no closet to put my clothes in anymore, and I would have a harder time working my busy high stress job and coming home to taking care of children that live in my house. I think I might not be the asshole because I am the one who is paying all of the rent, I purchased the apartment specifically to have this extra space for myself, and did not plan on the kids moving in.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You two aren’t compatible. You say you wil become more parental after marriage. His kids will and should live with him. Kids are loud. They are disrupting. When you become a stepmother there is no getting away from that unless you continue to live separately. And. It sounds as if he expects you to financially support them too. He can’t even afford an apartment for them. That’s his responsibility. Not yours.", "> I suggested maybe he get a separate apartment for him and his kids, but he doesn’t have the money to do that, and would rather they all move into mine.\n\nThis right here should be a boundary you refuse to cross. Don't live with someone - roommate, intimate partner,  friend,  etc - who cannot pay their own way. And absolutely don't marry someone who cant pay for their own kids and instead expects you to. \n\nThe second boundary absolutely should be your own physical,  mental and emotional well-being. Your fiance has shown he does not understand your needs or see them important,  much less equal to his own wants. Why would you marry someone who doesnt consider your needs? It's especially egregious since he is asking you to sacrifice a room in your own apartment with no indication he is giving you anything in return aside from more stress and responsibility. \n\nNTA,  tell him to kick rocks and support his own kids.", "RED FLAG!! RED FLAG!!  Time to take a serious look at this situation. Please. Marrying this man would be a huge mistake. If he can’t afford his own apartment you will end up miserable and supporting him and his children. He is playing you. Run. Being alone is not the worst thing that can happen to you. This man cares only about himself.", "Keep your own space.", "NTA.  Don't do it.  You'll regret it the first week his kids move in.  End the relationship now and run for the hills.  You'll be doing yourself a huge favor.  Good luck.", "if you're the only one on the lease, you actually could face eviction for having others move in with you if the company ever did an inspection. \n\nI don't know if your lease company does that but, you would have to fill out a new lease just to allow for them to move in. which could trap you into a longer stint and you would have to break the lease to move at the end of 2024. \n\nnow onto the issue, does your fiancé know that he's pushing you too hard for this? \n\ndoes he not remember that you need a calming room to destress yourself?\n\nAs someone that is Autistic you have the right to say what you want. \n\nbut what is the difference between them moving in with you now as opposed to living together after you get married?\n\nyou would need a 4br house in the new town just for you to get a calming room and is he going to let you have that? is he willing to pay towards that?\n\nhe's pushing for his kids to move in before you are ready, but are you really going to be ready even after you marry him?\n\nare you really ready to commit to a man that isn't taking your feelings into consideration, even now?", "NTA. And if he won't pay rent at your place, he won't pay at another place. Don't move in with him. Let him stay with his grandma", "How did you meet this, and how long have you been together? It sounds like he is using you as a meal ticket to move out of his grandmother’s. Why can he pay rent at the house you plan to move to in 2024 but not at your current place? \n\nAre you sure you want to take on the role of breadwinner and step parent? Have you really thought through how your life will change? Have you had in depth conversations around goals and parenting and finances and whatnot?\n\nNTA.", "ESH. You should never try to put yourself before a S.O. kids.  My boyfriend has kids and I would never expect him to choose me over them. If you’re not ready to be a stepmom why are you marrying him. It’s a package deal. At the same time why isn’t he going to pay rent? It shouldn’t be all on you all.", "NTA\nYour fiance sees you as a meal ticket. If he can’t afford to pitch in rent for a 2 bedroom apartment how is he going to pitch in later for a bigger space. You will with a leech for a husband. Don’t let him move in with you and plan your life around him and his kids", "ESH. \n\n- he is making grandma pay and raise the children and will fully expect you to support them financially if he can’t afford his own apartment. Do not be a fool and be his meal ticket and end up forced to care for the children he won’t bother taking care of.\n\n- I am autistic as well but listen. With a 10 yr old and 7 yr old there will never be a quiet room. Especially when your fiance will cleary be handing the kids off onto you. Do not date someone with children or children that young.", "ESH. Don’t marry someone with kids if you don’t want to live with the kids! But he sucks for not being able to have his own place and expecting you to pay to house him and his kids. He needs to work his own life out before you get married. Your place doesn’t sound suitable for all of you anyway. You need to realise you can’t only have him, he comes with kids. You guys do not sound like you’re on the same page at all.", "ESH\n\nDoes your fiance pay the living expenses for himself and his kids at Grandma's?  Or is Grandma helping to provide for their expenses?\n\nAnd who takes care of the kids when Fiance spends the night at your place?\n\nReading between the lines, Grandma is probably taking care of the kids.  And your fiance sounds like he wants to start having you help me make care of them.  If Fiance isn't taking care of his kids' needs and is trying to push his responsibilities into you, that makes him an asshole.\n\nBut if you actually plan to marry this guy, you should really give the living situation a trial run before you tie yourself to him legally.  If you need to get a bigger place together (and split the costs with him) to try things out, first, that would be a good idea.\n\nBut what I'm really hearing is that you aren't going to be ready to live full time with him and his kids any time soon.  In which case, you're an asshole for not being honest with yourself and your fiance about what kind of relationship you truly need.  And it really sounds like the two of you have significant enough incompatibilities that you wouldn't be happy being married or like ving together.", "NTA he needs to find a place for him  and his kids. It’s ok to not be ready to move in together.", "Nobody feels love like a hobosexual looking for a free place to live with free childcare for his kids.", "NTA. I never say this, but I think it is not a good idea to continue the relationship. You are not ready to live with kids and your partner does not care about your feelings, only his convenience. He's pushing your boundaries, and you will end up resenting him if you move together.", "This isn’t going to work. It’s his responsibility to house his kids and if you live with him that means you also live with the kids. If you don’t want that then break up", "NTA honestly. And I think it's a big red flag that he has unilaterally decided that he and his kids will mooch off you.", "Nta dont let him m9ve in at all. This man is a leech", "ESH. Suggesting that your partner leaves their children behind to live with you and children should just \"suck it up for a year\" is a bad one and indicates that you won't be a decent stepparent. However your fiancé is wrong to demand your space from you instead of just renting a place big enough for everyone. You are not compatible.", "I need to make this public service announcement: Stop dating grown men who still live with their parents, ESPECIALLY those with kids.\n\nRule of thumb:\n\n1. Men in their late teens (college age) to early 20s (eg college age) may have multiple roommates\n2. Men in their mid to late 20s (maybe early 30s) maybe have one or two roommates (in a 2 or 3 bedroom apt).\n3. Men that are mid-30s plus NEED TO HAVE THEIR OWN PLACE TO LIVE\n\nDo not date men that can not afford to support themselves.\n\nAdjustments to these rules are as follows:\n\n1. A man at any age with MULTIPLE children should have HIS OWN PLACE TO LIVE\n2. Men that may be living at home to support and / or take care of their elderly parents (you need to think this one through, when you move in together what happens)\n3. People that may travel extensively for work that may be in their residential city 14 or less days a month. These people where possible tend to live at home and / or with roommates.\n\nYou don’t have ages here, but like everyone said, you don’t become “mother like” after marriage. Also, you need to get used to the kids being around you full time BEFORE you marry to make sure it’s something you can handle (not sure if they. Split time with their mom)\n\nESH for me because you’re standing in front of a train that blaring its horn and flashing its lights…", "How old are the kids?", "I wonder what makes you think he will pay rent when you get your next apartment when he isnt/won't now. Sounds like he wants an ATM and someone to dump his kids on. Why isn't he looking after them rather than their grandmother?", "NTA.\n\nYou should live with him and the kids before getting married to him. Kids are a lot of chaos at the best of times and no one wants to discover that you’re baseline incompatible with each other after you get married. \n\nThat he’s not able to provide for and take care of his kids is … concerning. That you expect that you’ll be more maternal at some point in the future is also concerning - developing a step parent relationship is touchy and delicate at best, expecting it to appear after marriage is horribly optimistic. \n\nSo while you should see how the group lives together, you shouldn’t do that in an apartment that is too small for all of you together! Set your family up for success where you all can get what you need! If the kids can share a room, that sounds like needing at least three bedrooms. More of someone works from home or the kids will need their own spaces. (Or if you can find something with a big walk in closet that you can claim as your decompression space or whatever)\n\nBut starting at a baseline that has at least one family member (you!) not getting what you need to navigate life with grace and sanity is Not Okay. \n\nGo very, very slow with this man. Going fast can really screw up the kids and end up with you cornered in a situation that is very difficult to get out of.", "NTA  You both need to be willing to bend to be married successfully.  For you, that means allowing more people into your space,  for him that means waiting till you have more space to share.", "NTA- reading your post, I’m wondering whether the relationship is in your best interest. \n\nSeems that you are a resource to him and he is pushing because he sees an opportunity to deal with financial difficulties and childcare needs. \n\nBe wary that you are not going to be lumbered with full rent and childcare. When you move, ensure the lease is contracted as a in roommate agreement. You part of the rent is legally separated from his and he is the only one liable if he doesn’t pay.", "You would be TA if you don't set him free to be with a woman who would lovingly accept his children into her life. News flash, he and his children are a package deal. If you marry him, you'll also become the children's step mom. And if he has full custody, another news flash...they will live with you. Keeping a man from his children is an AH move. So if you need your cool down room and can't make room for his children then set him free.", "NTA. Don't tie yourself to someone who sees you as a wallet.", "NTA  It's your place, you need the extra room to maintain a good mental balance within himself. I wouldn't count on him paying rent when you move. He's used to not paying it. You're moving for your work but will he even have a job lined up. Sorry to say this but he sounds like a free loader. Doubt he's giving grandma money, he's not giving you any. Does he even work or plan to ever work? Sounds like he's comfortable with you paying for everything for him and the kids.", ">He has been spending more and more time at my place and increasingly pushing for the kids to move in with me.\n\nHe's doing that because it's not going well living with his kids in his grandmother's home.\n\nHe's a hobosexual with \"bonus\" kids trying to weasel himself and his kids into your home where you are solo on the lease, pay all the bills, violate whatever your landlord/lease says about moving in extra people, give up your quiet room...and once he's trained you to doormat in this current situation? Where's the kids' bio Mom in all this?\n\n>At the end of 2024 I am changing jobs and we are all moving in together in a bigger space out of state — him, me, the kids, and he will pay rent there.\n\n\"And he will pay rent there.\" O my sweet summer child...do you \\*actually truly really believe\\* that's gonna happen??\n\nESH.", "Gurl, your BF/fiancé is bullying you because you are a convenience. You have an apartment, he thinks he and his kids are entitled to it. If you get overstimulated, marrying a man with children is not going to be good for you. Children are noisy and chaotic , sometimes messy and unruly. Why do you want this in your future if you get overstimulated? IMHO, I would deny both the BF and kids moving in, and make BF take his belongings out of your apartment so you have room for yours! He’s trying to move in without you realizing it! It’s one thing to have his toothbrush and a couple changes of clothes there; it’s another  having “ bins” there. You are NTA. Seriously reconsider what you are getting yourself into. Who will take the kids if something happens to your BF? Things to think about….", "Nta\nRed flag warning ⚠️ \n\nHe doesn’t contribute and now wants his kids to move in. \n\nHe doesn’t see your needs, only his own.\n\nTread carefully as you want to be able to exit when this goes downhill and your complaint about your boundaries bring over stepped. It’s happening now.\n\nThink about this before committing to a lifetime of it.", "I hope that when you decide to move in together, he will pay rent. Sounds like he wants a momma. How old are his kids. You know you are never going to have quiet time again", "Next demand will be for you to be more active in their day to day care (drive them to soccer practice, cook them their favorite meals, cancel your plans to watch the kids this weekend while “dad” is off scratching somewhere). NTA. Reconsider this marriage.", "YTA do not date men with kids when you don't want to live with kids. In the long term, that is where it goes. If living with kids is no go for you, exclude men with kids from dating pool before they create emotional relationship to you.\n\n\nThis changing in the future is wishful thinking.", "NAH\n\nYou are not compatible as a couple.\n\nYou shouldn’t be even contemplating marriage to somebody who has full custody of his two children to whom you do not wish to be a parent.\n\nCancel the wedding and move on and let him and his children do the same. At least then he may find someone who would love to be a mum to his kids.", "NAH. \n\n\nLook, I’m not certain that his motives aren’t to get an apartment for his kids to live in with him by moving in with you because he can’t afford it by himself but as your fiancé I can see why he’d expect you to help with this. \n\n\nYou are going to be married. His kids are not going anywhere. It would be far better for you and for them to be used to living together *before* the marriage happens so you can make sure it’s working before committing fully to each other. \n\n\nHe wants his children to live with him. He wants to live with you. He sees an empty bedroom and it’s fair for him to think you could try it.\n\n\nProblem is, as someone on the spectrum myself who needs alone time like I need oxygen, you also need that space. It’s overwhelming to think of how much disruption to routine two children will bring…but if you intend to marry this man then you are going to have to take that on. You need to think if you can honestly cope if you don’t have a specific private space to go to. \n\n\nYou haven’t used the room for that purpose for some time so it’s full of junk- that’s why your fiancé thinks it could be a bedroom, because you aren’t using it as a cool-down space. The problem is your brain is freaking out at the thought of taking the room away more permanently and overwhelmed because of having the kids in your space. That’s fair.\n\n\nCould you afford to rent or buy a home where there is a bedroom for the kids and also somewhere to make your private chill out space? A place with a garden or yard could have a chill out area for you if the weather is nice or a nice hut or shed for bad weather, all decorated how you like it and there for you to use when you wished but also the kids can stay. If outside isn’t possible then somewhere with a small office area or third bedroom, a conservatory or attic might work for you. If you and your fiancé pool your money could you afford a place like this? \n\n\nBasically I think this issue will keep coming up and I think you need to try living with the kids before marriage because if you can’t cope with it then that’s a deal breaker and it’s better to know before you get married. If your  lease isn’t up for a while then talk about looking for a home in the meantime and cleaning up your room so that it can be used. Right now it’s full of junk. I know it can be comforting but right now it’s just a junk room, not a chill out space. \n\n\nIf all of this sounds like too much then you need to think if being with someone who has children while working a busy stressful medical job is actually what is best for you and for him. He is a dad and an involved dad at that, this won’t change. You have a stressful job and certain needs in order to maintain good health and mental wellness, that won’t change either. His kids have a right to be comfortable in the home they share with him in who they are living with- you need to try overnights if you are going to stay together. \n\n\nYou are at the crossroads, you need to think hard about what you want and can handle. Talk to your fiancé, be honest and reach a conclusion that suits everyone’s needs. Neither of you is an asshole so far but you really need to work out what you want.", "YTA. Both of you are, you should have discussed this before getting engaged. It is a fair assumption that if post marriage your husband was going to live with you that his children would too and in not flagging your refusal to do this you’ve basically led the guy on. Also if your autism is so significant wouldn’t it be worth doing some sort of trial of seeing how you and the children will all get on together and how you can make it work. You can’t just flip a switch and this stuff work and if the children feel that you have been the source of them being excluded from parts of their fathers life they will resent you immediately.", "YTA - DO NOT MARRY A MAN WITH CHILDREN IF YOU CAN'T HAVE THEM LIVE WITH YOU FULL TIME.\n\nIf anything happens to his grandmother, they will have to move in with him full time any way.  They are a package deal, he will always put them first because that's how it should be.", "You knew he had children who rely on him, right? What did you think was going to happen to his kids when you got married? I don’t think this is compatible once the kids move in, irrespective of the bigger house you have planned. Living with kids 24/7 will change everything and I’m not sure you will cope. Sounds like he relies on his grandmother a lot with the kids. Then this expectation will be passed to you. You need to think if you’ll ever be ready for this change", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am marrying my fiancé a year from now, he is a wonderful man. He has two kids from previous relationship and I get along with them well. They have been living with him and his grandmother for the past few years, and that has been working well, or so I thought. He has been spending more and more time at my place and increasingly pushing for the kids to move in with me. I love him being here, and am fine with him moving in with me down the line, and I let the kids visit, but I am not ready for the kids to be here full time. \n\nFor background, I am autistic and have a learning disability, but I’ve been very successful in life by knowing my limits and knowing what boundaries I need in order to be successful in a world that’s not tailored to my traits. One of those needs is a distraction free / “quiet” room. So when I moved after my med program I made sure to purchase a two bedroom apartment in which one room is the bedroom and the other room is my quiet office and cooldown room. This worked for two years very well. After I got a stable job, I haven’t been using the room as much, though it is still very nice to have, and is filled with my clothing and belongings that don’t fit in the tiny bedroom which contains my fiancés storage bins. To be clear, only my name is on the lease, I’m the only one who pays rent, and this is my apartment. My fiance visits very often and usually stays over at night. Over the past year or so he has been increasingly pushing for the children to move into my apartment. I’m not comfortable with this, as I am not ready to be a full-time step mother yet, my career has just started, I work a very busy medical job that is high stress, and I plan to be a more active parental figure after we are married. However, he insists that I need to empty out my office and make it a children’s bedroom. If I do that, I won’t have anywhere for my belongings or any place to cool down or get away from overstimulation. Since I am the only one paying the rent and it is my name on the lease and I’m not supposed to move anyone else in right now, im not comfortable doing this, and I don’t feel like I owe him that. He says his grandmother is getting increasingly difficult with the kids, so I suggested maybe he get a separate apartment for him and his kids, but he doesn’t have the money to do that, and would rather they all move into mine.\n\nAITA for not turning my office into my stepkids’ room?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, but for the future remember that this guy + kids is a package deal so there is no way for just him (without his children) to move in. Sounds from your edit that you do get that. Keep saying “I’m not ready to move in together, you need to wait until I get my raise.” Tbh, if he is frequently staying over at your place and leaving Grandma to raise his kids, that may be the source of their conflict, and you both may have to face the fact that sleepovers are no longer possible. (Also maybe make sure he isn’t planning on just leaving the kids with you all the time once he doesn’t have grandma around to be instant childcare)", "NTA- DO NOT MOVE THEM IN, not even HIM. Wait until you all move to the Bigger house that HE will be Contributing $$ to.", "NTA.  No, but you need to remove the rose-colored glasses.  Compare his rosy plans with what you know to be true.  Your current living situation is perfect for you, but not for him.  He has said that you all need to live in a bigger, more expensive place.  Honey, if he has to live with his grandma because he cannot afford to live on his own, what makes you think that he is going to be willing to foot the bills when you live together?  Because he says so?  In addition, Grandma has been his unpaid nanny and housekeeper for how long?  Who is going to be expected to take on all of that?  He surely won’t because he isn’t doing it now.  My guess is that Grandma is tired of it all and is telling him that it is time to take the kids and his lazy behind and go.", "He needs to work things out with you & the kids otherwise this isn't going to work. Where is mom BTW? NTA stepparenting is something you need to proceed very carefully with.", "NTA. He is using you for an apartment for his kids. I think your quiet room requirement will never be a priority for him. I don’t think this relationship is a fit.", "Do not rush into marriage or combining finances. He comes with kids that will live with him as they should. They’re his kids and he is responsible for them. Kids are noisy, messy, demanding, fight, slam doors and have other kids over who are the same. At 10 and 7 you are looking at 11 years of it. A bigger place will not change any of that. You really need to be honest with yourself and him if you can handle all that. If you can’t now it’s a huge problem. It’s also not  fair to anyone to move to a new town and house for you to realize you can’t cope with kids being kids.", "NAH - but you should consider if you are compatible in the long run. Knowing your limits and living in a way where you get to accommodate them is really crucial, and for you it takes more than the average person. And the consequences of not going it would be worse for you than for most people.\n\nBut he is a father and his children are part of the package. There really is no way around that. Would it work out for you if you could find a larger apartment so you could still have a room for yourself? If do, that might be the way forward. But if the problem simply is the added stress of living with children, you might not want to move forward together.", "NTA but if he can’t afford to pay rent right now , he shouldn’t be moving his kids into your place. The way he’s being so forceful with you giving them a bedroom is a red flag . \n\nYou should wait until it’s time to move to the ‘bigger’ house before you let him move in . Homeboy is going to move his kids into your current home , and conveniently never be able to pay rent . And conveniently won’t be able to contribute to a bigger place. \n\nGreat plan he has - move the kids in , make sure you know he can’t contribute… he’s all set .\n\nGirl don’t let that man or his kids move into your home until he can contribute appropriately for all three of them . And don’t marry him either until he does so .", "YTA\n\n&#x200B;\n\nDOn't date a dad if you are not ready to make his kids your family.\n\n&#x200B;\n\n\"At the end of 2024 I am changing jobs and we are all moving in together in a bigger space out of state — him, me, the kids, and he will pay rent there. They would just need to be patient until then.\" .. bullshit. If it is that fix, his moving in with you can wait until then. HE needs to live with his kids.", "I'm confused: why do you love him? What for God sake is about to love in such a man.? Why aren't you running?", "Agree. Nobody is the asshole, but OP isn't magically going to overcome these issues based on a status change from engaged to married. It's also not unrealistic for her fiance to want to do a trial run where everyone lives together before they tie the knot to feel out the family dynamics.", "Yep. He should be the provider for all of you. This is upside down.", "I agree. The red flags are flying.", "There is no lease, OP owns the apartment.", "That's the sketchy part to me.  How can a grown man with 2 kids not be able to afford a place to live now but magically will be able to afford a place next year?", "op added an edit, it is the idea of the children in the small apartment she has issues with, not living with them in general. \n\nalso she should run her fiancé seems to be trying to push the children on her when he doesn't live there either!", "> At the end of 2024 I am changing jobs and we are all moving in together in a bigger space out of state — him, me, the kids, and he will pay rent there. They would just need to be patient until then.\n\nThe edit was probably added after you posted", "Strong \"hobosexual\" vibes.", "10 and 7", "I would add that he needs to be self-supporting and supporting his kids.", "He needs to be set free if he isn't paying rent at all for himself and the kids. She doesn't need someone who's getting a free ride. He can find some other sap who will soon be posting about \"I love him, but he has no money. What should I dooo?\"", "LOL none of those are \"news flashes\".  OP lives in a small apartment where the lease doesn't allow additional people to live there.   Her BF and his kids \"live\" with grandma (who apparently pays for the accommodations and does all of the childcare while BF spends the nights at OP's apartment.\n\nNow BF suddenly is \"insisting\" that he move the kids into the small apartment (violating the lease so risking being evicted or a rent increase) and OP pay for everything-- with implications that granny may be tired of being the unpaid nanny.\n\nOP is 100% on board with moving the children in when they get the larger living quarters next year.", "Just like how he’s looking out for them now . Can’t afford to house his own kids so he needs to move himself and his kids into her tiny apartment, all while he can’t afford to contribute to rent . They aren’t his priority, his priority is convincing her to bankroll his and his kids lives and she’ll most probably have to become sole caretaker for them anyway.", "But with OP's edit it actually makes sense: in that future bigger house they can dedicate one quiet room with sound proofing elements to OP so OP has a space to retreat to whenever they need the quiet. Trial run makes sense, but on the other hand it's impossible in the current circumstances (lease and space). We can already tell it would be a failure with four people getting crammed into space OP needs just for themselves.", "There definitely is a lease, OP stated she pays rent, what thread are you reading?", "YTA. I mean how did you think this would pan out with 2 minors? They are his kids and by agreeing to marry him you are taking on that responsibility. Maybe wait until you’re married to move in together if you need more time to consider how you want them in your space or maybe considering getting a bigger place together so that you can have your quiet room and the kids can have rooms of their own then everyone wins. Otherwise if you never want them to live with you then don’t marry a man with kids. You can’t just expect him to move in without his kids, they’re minors.", "*\"I love him but he has no money and doesn't take care of his own kids, just leaves them to his aging grandmother. He also wants to push that responsibility onto me while I'm the only one paying bills\".", "Right in the original post she says she purchased the apartment.", "I didn’t say I never want them in my house, I do, but after we are married and in a bigger space. It’s my apartment not his and he wouldn’t be paying rent even if they all moved in, he says.", "But then she talks about how she has a lease and isn’t meant to move anyone else in. That doesn’t sound like an owner.", "Three sentences later, she talks about rent and the lease. I believe the word purchase is being used a bit unusually by the OP, and that they are in fact a renter.", "How will both of you be able to magically afford a larger space if he can't afford to pay you anything right now?", "Sounds like a freeloader.  You would be foolish to let him move in.  That's not even addressing your valid concerns re his children.   Wise up before you find yourself supporting him and his kids, as his grandmother has been doing.   Hold out for a partner who isn't reliant on others to put a roof over his head.  Or don't,  but be prepared to carry 100% of the financial load.  (Why you'd want to do so is puzzling)", "Does he not understand that it becomes his the moment he and his children move in? Have you discussed finances a d childcare once you are married? I feel like he’s going to make you pay for everything a d be expected to parent his children", "*IF* you were all to move in together, it would need to be into a bigger place than your's. Even with two bedrooms, it is just big enough for you alone. It's going to be jam packed with three more people in there. You are not going to have any space of your own, and if that's something that you need, it's going to be very hard, and very frustrating. Out of sheer, morbid curiosity, how did he settle upon not contributing any rent? Where is his money going? Were you consulted in this process?", "Hey OP NTA. I do have to ask though. Do these kids have a mom? Have you 2 discussed what your role would be like? How you will transition to a family? These are things you NEED to talk about. This is a big transition for all of you & shouldn't be rushed. If you don't work this out I don't think this is going to work."]}