{"id": 32827, "submission_id": "18g0ih6", "title": "AITA for refusing to pay for my sister", "selftext": "Basically, I’m only 19 and I’ve just entered college with a sponsorship and so I get my own salary, since then my parents have not paid for anything for me. My older sister also in Uni does not get her own salary and so my parents still pay for her, however they don’t give her enough money to last her even a week. Therefore, I constantly am paying for my sister whenever we’re out and I don’t get to spend or save my money anymore. Since my parents don’t pay for me anymore, they’re supposed to have more money to spend on my older sister anyways but they always claim they don’t have enough money for her. I still do have enough money to spend on the both of us but I need to save up for a car because I want to be able to depend on myself and now that’s not even possible. Whenever I complain to my parents about my money running out by the end of the month, they say that she’s my sister and I should pay for her as well out of my own kindness. Idk if I’m being an asshole by wanting my own money to be able to spend on myself as even when my parents used to pay for me I was barely given anything and my sister was even more spoiled than I was.\n\nUpdate: thank you everyone for your comments I’ve always felt guilty since whenever I bring it up they would make me feel like I was in the wrong. I’ll make sure to stop paying and I’ve told them so as well :)", "created_utc": 1702319762, "permalink": "/r/AmItheAsshole/comments/18g0ih6/aita_for_refusing_to_pay_for_my_sister/", "score": 88, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be the asshole because not wanting to pay for my own sister feels selfish.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your sister is their child, not yours. You barely have enough money to get by and your parents are not helping you.\n\nDon't complain to your parents anymore though, just tell them that you can't afford to pay for your sister so they can either send her more money or she can get a job. \n\nAlso, let your sister know that you can't afford to pay for her so you will not be paying starting now. Maybe hang out with her doing free things (if you want to) but don't do things with her that will cost money.", "Nope Not the butthole. Tell your sister and your parents you will no longer be supplementing her living costs. as you have Expenses of your own and need to keep them covered.", "NTA. She is not your responsibility.", "Stop paying for your sister.  She can get a job or your parents can pay for her.  She's not your responsibility.  NTA", "ESH\n\nStop going out. My guess is your sister won't go out if you aren't taking her out. If she does, that's her choice, but you don't have to encourage that behavior by paying for it. Stay home, stop paying for her, and you should be able to save enough in no time. More importantly, if you stay home, you probably will have enough money to not only save up for a car, but you could also offer to have your sister eat with you at home.", "NTA\n\nYour sister is not your responsibility.  Your parents need to step or she needs to get a part time job.  \n\nYou need to take care of yourself.", "NTA. I would suggest the following:\n\n Kindly let your parents and your sister know that you are not in a position to keep paying for her, period. After that, do not discuss it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBasically, I’m only 19 and I’ve just entered college with a sponsorship and so I get my own salary, since then my parents have not paid for anything for me. My older sister also in Uni does not get her own salary and so my parents still pay for her, however they don’t give her enough money to last her even a week. Therefore, I constantly am paying for my sister whenever we’re out and I don’t get to spend or save my money anymore. Since my parents don’t pay for me anymore, they’re supposed to have more money to spend on my older sister anyways but they always claim they don’t have enough money for her. I still do have enough money to spend on the both of us but I need to save up for a car because I want to be able to depend on myself and now that’s not even possible. Whenever I complain to my parents about my money running out by the end of the month, they say that she’s my sister and I should pay for her as well out of my own kindness. Idk if I’m being an asshole by wanting my own money to be able to spend on myself as even when my parents used to pay for me I was barely given anything and my sister was even more spoiled than I was.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. \n\nI want you to know wholeheartedly that you are not and should not be responsible for your sister. Your parents should not have put that burden onto you.", "NTA what’s she spending it on that it runs out in a week?", "The magic words right here ☝️☝️", "NTA. I don’t know why an older sibling would expect/ not be ashamed to be paid for by a younger sibling, as an oldest child myself. I get your parents’ POV- any money you spend doesn’t come out of their pocket. But clearly, it is their and her responsibility to sort out her money, not yours, they are just trying to shift it on to you.", "NTA.  It’s more than possible to work and go to school.  I did it for both degrees.  Was nearly feral by the end, but I got through.  Your sister won’t consider any other options until you cut her off.\n\nNext time sis insists you go out, tell her no.  Simple as that.  If she wants a meal, she has to earn it.  Scrubbing your bathroom earns a $20 dinner.  Come up with all sorts of chores and their prices.  When mommy and daddy come wailing, tell them you checked, and that’s the going rate for maid service.  The bank of sister is closed and she’s going to earn every penny she gets from you from now on.  \n\nAnd when the flying monkeys come, thank them profusely and let them know you’ll pass on to sister that they’re going to give her money.  What, they won’t??  But they’re so generous with your money, why can’t you be generous with theirs?\n\nThen you block them.", "Don't complain. Just stop paying. Tell your sister to get a job like most people. The burden shouldn't be yours to bear. NTA", "Why do your parents even know you have money left over. If you are paying for everything for yourself, it really isn’t their business.", "NTA.\n\nShe is your sister, not your daughter. And since I can tell she is smart enough to go to college,  she can work too.\n\nDon't let your parents give you responsibilities you shouldn't have.", "NTA - Say no, if your parents complain say \"They should want to help their own daughter out of the kindness of their hearts.\" Parents should be supporting their child more than a sibling does.", "NTA you need to stop this yesterday or it will be your entire life.", "NTA.  Don't pay for her, just be clear, you work hard for your money, and if she wants extra spending money, she needs to do the same.  Then just stop.  Let her work it out between her and your parents.", "Start lying. You had an unexpected expense that wiped out your account for this month. And it keeps happening from every month from here on out. \n\n>they say that she’s my sister and I should pay for her as well out of my own kindness\n\nThat's their daughter and they should pay for her out of their own kindness", "NTA and your parents are trying to shift responsibility for their daughter onto you. Why can't sis get a job? And if she doesn't/can't, I guess she doesn't get to go out.", "NTA. Your parents, on the other hand, are.", "NTA youre not obligated to take care of your OLDER sister.. maybe sister needs a job", "tell your parents that your sister isn't your responsibility and that they should do their job as parents and support her, otherwise they're failing to both of you.\n\nNTA", "Parentification is abuse", "Nta she isn't entitled to your money", "NTA. Your sister can work while in school.", "Nta.\n\nYour parents aren't giving her more money because they know you'll pay for her so they don't have to. She's an adult let her figure out her money situation on her own.", "NTA. Tell your parents that she is THEIR daughter and should pay for her as well out of THEIR own kindness.", "NTA\n\nSome of these stories remind me of Chinese face-slapping novels, where the protagonist is treated horribly by people who should be better.  The protagonist then gains some ability and a sense of worth and gets their revenge on the bad actors.\n\nYour sister should get her own job and stop mooching off of you and your parents.  And your parents should be embarrassed at themselves for saying the youngest should support the oldest.  Time for face slapping.", "I mean she is indeed your sister, but she is their daughter, she is not your responsibility.\n\nnTA.", "Her **OLDER** sister\n\nwho can get a job.\n\nNTA\n\nSTOP paying for her.\n\nSHE IS NOT YOUR RESPONSIBILITY.", "So OP not only doesn't get to go out but should still be responsible for feeding sister? Uhm, no.", "It's especially bizarre when it's for an older sibling.\n\nThe 19 year old is supposed to look after a 20+ year old why exactly?", "Where did I say she was responsible for her?"]}