{"id": 32863, "submission_id": "18gdz3p", "title": "AITA For not giving my sister back custody of her daughter", "selftext": "My name is Tia 32 and my sister Laila 30 were in and out of foster care growing up. Laila got pregnant at 17 and went to prison at 18 for robbery with her boyfriend. Because I was 19 I was legally allowed to take custody of my niece Ash. The whole time my sister was in prison I would visit her and let my niece go as well, so she could try to build a connection with her mom. But as the years went by Ash started calling me mom and called my sister Lai. Because I was the one that was there day to day taking care of her. Fast forward to 2020 and Laila gets out of prison early due to good behavior and the state trying to reduce the prison population due to Covid 19. Laila is 27 at this time and Ash is 10. By now I have gone to school, gotten a a stable job, bought a house and feel I am doing well for myself and Ash. So of course Laila is paroled to come live with me. At first everything is good. We all start getting acquainted and use to each other. Lai is trying to figure out life as an adult in the free world and of course I am trying to help her as well. After about a year Lai has really started influencing Ash in a negative way. Prior to her coming home Ash was a straight A student. Very well mannered. In school dance and cheer. And making strides towards a positive entry to middle school. Now my sweetie is rude, flunking most of her classes. Cursing and talking back to me. And Lai just laughs it off. I feel like I’m raising 2 teenagers at that point. Lai stayed gone a lot. Trying to invite strange and crazy people over to my home etc. I had enough. She wouldn’t work. Wouldn’t help around the house nothing. Now 2023 Lai finally has a job at Burger King and has a crazy weird boyfriend. A few weeks ago she says she’s moving in with her boyfriend. I told her ok good luck. Then she says she’s taking Ash with her. Oh HELL NO. I’m her parent. I will gladly allow visitation. But you are not taking this child out of my home to go couch surfing with you and your stupid boyfriend. Mind you Lai is still on parole until 2026. Ash walked in on us arguing and says she wants to go with her mom. I explained to her that I have custody and that she cannot go with her. She cried and stomped out the room. My sister then yells at me and says I’m a horrible person for splitting up her and her child. Fist of all I have given up my entire young adult years to raise this child. I gave up a world travel fellowship, a relationship etc just to be here for this child so she would never have to go through what my sister and I did in the foster care system. I am all for letting them visit each other. But I’m not letting her leave. Ash is now 13 and feels she’s is entitled to make her own decisions. But I know how her mom is. It’ll be a disappointment going to live with her. I’ve given her such a stable life and my sister has ruined most it in less than 3 years. AITA?", "created_utc": 1702356743, "permalink": "/r/AmItheAsshole/comments/18gdz3p/aita_for_not_giving_my_sister_back_custody_of_her/", "score": 1378, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I denied my sister access to taking custody of her child. She says I am the asshole for doing this.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You should have kicked her out ages ago. And no you are not the asshole, mum isn't even stable.\n\nAnd I know something about how you feel as  I has parental rights over my neice and she lived with me for 12 years. NTA", "NTA\n\n&#x200B;\n\nLet your sister try to get custody. With her record, that will be an uphill battle. And soon she will loose interest anyway.\n\n&#x200B;\n\nThe hardest part will be: \"*Ash is now 13 and feels she’s is entitled to make her own decisions*.\" At 13, a kid is entitled to be heard. But decisions are still up to the parents. That means you.\n\nOne of the hardest parts of being a parent is, sometimes you can't give your children what they WANT, instead you have to give them what they NEED. And they don't know the difference yet. But parenthood is a marathon, not a sprint. In time, she will see.", "NTA.\n\nYou gave the kid a stable household and now hold parental rights.  Once she turns 18, you can tell Ash she can do what she wants.  She can visit her bio mom as much as she wants, but you need to continue to raise her yourself.", "NTA because you are just trying to do what is best for this child and you are trying to make sure that Ash becomes a productive member of society unlike her mother (no offense to your sister). You are not the Asshole and you legally have custody of her AND Laila is still on parole until 2026 so she still has time to get her mindset and life together so I would start considering when it gets closer to the end of her parole.", "NTA, but if I were you, I’d cut your sister out entirely, even with just visitation she’ll be whispering bullshit into that kiddo’s ear.", "NTA - Your only mistake was letting Laila stay in your house as soon as you noticed ash was going down the wrong path. I get it - family. Hopefully, Ash will realize her mother is a terrible influence. Good luck, OP.", "NTA! You're doing the best thing you can for this little girl! Not to mention the fact that she's still in your custody and if you let her go with her mom and anything happened it would be on you. Frankly I wouldn't even want to let her have visitation but of course that would probably cause more trouble than it would avoid. But I would definitely not let her have visitation outside of your supervision!", "NTA. Letting your sister move in was a huge mistake. Ash needs counseling stat.", "NTA,  but Your mistake was not setting hard boundaries with your sister. She should have been told that she had to get a job and keep it and pay her share of the costs - food, electricity. And buy her own clothes and such. Or she got kicked out. Instead, she got to show Ash that you could be a bum and live off others with few consequences.\n\nDo not ever let your sister move back in. Let Ash see what her mom leading that life leads to - perhaps Ash can be gotten back on track.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy name is Tia 32 and my sister Laila 30 were in and out of foster care growing up. Laila got pregnant at 17 and went to prison at 18 for robbery with her boyfriend. Because I was 19 I was legally allowed to take custody of my niece Ash. The whole time my sister was in prison I would visit her and let my niece go as well, so she could try to build a connection with her mom. But as the years went by Ash started calling me mom and called my sister Lai. Because I was the one that was there day to day taking care of her. Fast forward to 2020 and Laila gets out of prison early due to good behavior and the state trying to reduce the prison population due to Covid 19. Laila is 27 at this time and Ash is 10. By now I have gone to school, gotten a a stable job, bought a house and feel I am doing well for myself and Ash. So of course Laila is paroled to come live with me. At first everything is good. We all start getting acquainted and use to each other. Lai is trying to figure out life as an adult in the free world and of course I am trying to help her as well. After about a year Lai has really started influencing Ash in a negative way. Prior to her coming home Ash was a straight A student. Very well mannered. In school dance and cheer. And making strides towards a positive entry to middle school. Now my sweetie is rude, flunking most of her classes. Cursing and talking back to me. And Lai just laughs it off. I feel like I’m raising 2 teenagers at that point. Lai stayed gone a lot. Trying to invite strange and crazy people over to my home etc. I had enough. She wouldn’t work. Wouldn’t help around the house nothing. Now 2023 Lai finally has a job at Burger King and has a crazy weird boyfriend. A few weeks ago she says she’s moving in with her boyfriend. I told her ok good luck. Then she says she’s taking Ash with her. Oh HELL NO. I’m her parent. I will gladly allow visitation. But you are not taking this child out of my home to go couch surfing with you and your stupid boyfriend. Mind you Lai is still on parole until 2026. Ash walked in on us arguing and says she wants to go with her mom. I explained to her that I have custody and that she cannot go with her. She cried and stomped out the room. My sister then yells at me and says I’m a horrible person for splitting up her and her child. Fist of all I have given up my entire young adult years to raise this child. I gave up a world travel fellowship, a relationship etc just to be here for this child so she would never have to go through what my sister and I did in the foster care system. I am all for letting them visit each other. But I’m not letting her leave. Ash is now 13 and feels she’s is entitled to make her own decisions. But I know how her mom is. It’ll be a disappointment going to live with her. I’ve given her such a stable life and my sister has ruined most it in less than 3 years. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", " NTA you should have kicked your sister out that first year!", "God, hindsight is 20/20, ain't it. You should have never let her move in with you when she got released. I know it's too late for that now and I have zero solution for you. I'm sorry op but you may just have lost her as a daughter (medephoically, not physically)now that bio mom has sunk her claws into her.", "NTA\n\nAs \"Ash's\" custodial and concerned caregiver, you are making a reasonable and responsible decision regarding your niece. You might wish, however, to contact the court and report your concerns about the child's behavior since her mother was released and came to call. Your sister's Parole Officer should also be made aware of her decision to relocate, immediately. Discuss your rights as custodial caregiver with the child advocate who dealt with your case and find out what the legal process might be if the child runs away from your home to be with her mother.", "NTA. But your niece needs therapy, I am sure having her mother live with her has stirred up a lot of complex emotions.", "NTA. You've been her mom for 13 years. You have her best interests at heart. At 13, she does not have the capacity to see how the trajectory of her entire life can be destroyed by following your sister. You are her legal guardian and her parent. My advice would be to get her in with a therapist who can help her work out her feelings, because it sounds like your sister managed to do quite a bit of damage in the time she lived with you. The rebellious phase tends to get worse in the teenage years before it gets better. Hang in there, OP.", "You need to fix your relationship with your child ASAP. This can turn into a very bad nightmare if you let this continue", "NTA. I would honestly let the girl stay with her mother for a trial period. She kinda needs a lesson. She would be coming home crying in no time. But then, I am not emotionally invested in her like you are. There is a risk, though, that she will hold it against you that you separated her from her mother instead of appreciating what you gave her.", "In the future when she grows up I know ash will be grateful for everything you've done, don't let her go, you are her mum now and it sounds like you have done an amazing job at it too. NTA", "NTA whatsoever.\n\nAsh is still a kid - and she's one fortunate enough to have been protected by a loving aunty for as long as she is able to recall. She really doesn't have the bandwidth yet to understand that her mom may not be capable of giving her the kind of stability her life has come to depend on. Stay strong - you are definitely in the right here! No matter how hard this is right now, you know that Ash will thank you one day.", "I 2nd the therapy comment for the kid.", "NTA. Unfortunately, you don't win here. Either Ash blames you or Laila blames you.", "Definitely NTA, YOU need to be mama bear. Your sister is toxic. You need to set clearer boundaries.  Sister should never be allowed to come live with you again, ever! She also should not be allowed visit her daughter but you might have court ordered visitation.  Get the kid back in activities.  Keep her so busy with stuff she doesn't have time to visit her mom. Let her experience a few visitations where the mom do4show up. Which will happen.  You need to have a heart to heart with the kid about the environment her mother would put her in. Talk to her ask her to reflect on how she was before her mom came around and now. Ask her how does she feel about herself now versus before.  Ask her to imagine herself in 5 years. 10 and how she's going to do that. Sometimes kids need to see the big picture then the little picture to understand.  Tell her her safety and wellbeing are your responsibility and you can relie on her mother to put her needs first over her own.", "Not gonna judge. But why does everyone think a 13 year old shouldn’t speak for herself? 🤔\n\nWe were asked at age 5-7 if we wanted to stay with our egg donor or our father.", "YTA    \nIt's not your place to unilaterally make this decision. That's what courts are for. Maybe they will decide in your favour, but you definitely cannot just declare that you're not giving back custody to the literal mother of the child you've been raising.\n\nAsh is Laila's child, not yours. Now that's she's out of prison you have to accept that you can't make decisions on your own anymore.", "NTA \n\nHire a family lawyer and reinforce custody. Adopt your niece if at all possible.", "nta for custody but yta for letting her get paroled to your house in the 1st place", "Format, please. I wanted to read, but a screen full of writing is difficult for some of us to read.", "**NTA**\n\nBut you will be if you don't get hold of this situation for Ash's benefit. She had secure attachment to you and is emotionally not in a position to understand that her biological mother is not capable of meeting her needs. Incarceration is not what was stopping her but a symptom of her being unfit to be the person Ash needs. This will not have changed behind bars. Lai does not know herself and will struggle to find a way to function out of jail. Ash MUST NOT be exposed to this.\n\nOP has worked very hard for years to get herself in a position where she does meet Ash's needs. She IS Ash's mother at this point in every way except biology. She needs to manage to secure the attachment Ash has to her again. With stability, routine and therapy Ash will get back to where and who she was. Sometimes we need to make hard choices for our kids and this is one of those moments. Choices our children might really not agree with. They however don't see the risks. They don't observe the chances and oportunities lost. They require guidenace. Hell I still need guidance. \n\nBio mums assertion that she is just going to take this child out of her environment, school, surroundings and move her in with a new BF shows me she is unfit to be a parent. No decent parent would make such a selfish and chaotic change to their child life independent of whether in a bratty 13 year old moment they wanted it. The only thing I can criticise op for is for allowing Lai to live with them in the first place. It was never going to be in Ash's best interests.", "NTA. It’s time to cut some cords. Get your locks changed so your sister can’t return to your place. Speak to your sisters parole officer and make sure they know sister isn’t staying with you. Cut all visitation unless it’s supervised by you personally. I could easily imagine your sister taking the daughter and not returning with her.\n\nGiven your sister’s track record, I would not allow the child to visit at the boyfriend’s place, as I doubt it’s safe. It’s a pretty good bet that your sister will violate your parole. Not if, but when, and probably soon. \n\nGet your child into therapy and start working on mending the damage your sister has accomplished. I know you want to help your sister, but she isn’t good for your child, and you have a higher duty to your child.", "I would plan a weekend away with Ash so you can speak to her without your sister influencing.  Lay everything out, including examples of how well Ash was doing without her bio mom. Talk to her honestly about why you are legally responsible. I also think Ash needs therapy.", "YTA for allowing your sister to poison your daughter for three years. You watched it happen and did nothing. At this point the daughter may be far too gone. She has imprinted on your sister, mimicked her behavior and given up on everything that was once important to her. \n\nMy guess is your daughter will eventually get her way, move out and fall into the same mistakes your sister did.  Only then will your daughter come crawling back once she has ruined her life. \n\nGood luck, but you take part of the blame in this.", "NTA.", "You are the hero of this story, NTA.", "NTA, but unfortunately, as much as you want to protect Ash, you might have to let your sister crash and burn. Tell her to go ahead and start the custody process. Proving to the courts that she is a fit parent won't happen overnight, and I'm willing to bet she will either lose interest or screw herself over along the way. Ash might have to see the truth about her mother the hard way and when she comes back to you because her mother can't get her shit together than you will still be there when she needs it. It's possible that the more you fight this, the more you will push Ash away, because she won't see the truth if you don't give Laila the chance to fail. \n\nThe thing that would be the most worrisome for me would be watching Ash derail her future in the meantime, given the recent change in her behavior since Laila has been back in the picture. But if she wants to act out she's going to act out, all you can do is try your best to make sure you're there when she needs you. She will need you, once she realizes her mother can't even take care of herself let alone a teenager. Don't let the drama with your sister mess with your head, you said yourself that Ash was doing great before Laila came back in the picture so all you can do is focus on what is best for her and hopefully the trash will see itself out.", "OP you’re NTA at all.\n\nHave you ever heard the saying “those who don’t hear, will feel” ?\n\nI’m not a parent so idk if this would be borderline abuse, but maybe give your daughter/niece a dose of that saying and let her go live with her mother.  From the description you gave of your sister, I don’t think it would be long before your niece came back to you saying she made a mistake, and asking to live with you again.\n\nThis can also backfire in spectacular fashion lol. I’m just a huge advocate of letting people learn from their own mistakes.", "NTA Hopefully Ash matures and forgives you when she is grown. In the meantime I am sorry that she is giving you attitude and cannot see how fortunate she has been.", "First of all, kudos to you for stepping up and providing a stable, loving environment for your niece. It's evident that you've made incredible sacrifices and have shown immense dedication and love. It's tough navigating these waters, especially when it involves family. Remember, your niece’s wellbeing is paramount, and it sounds like you’ve been doing an excellent job at prioritizing that. As someone who has been in a similar situation, I can relate to the challenges and emotional toll it can take. But, seeing your niece grow up in a nurturing environment is a reward in itself. You’re not just her guardian; you’ve become a pivotal figure in her life, shaping her future for the better. Hold onto that, and remember, you’re doing an amazing job. NTA", "Exactly this - OP you need to go no contact, you see the effect it has on your daughter, yes your daughter not hers but you let it happen. Take back control before your daughter goes the same way as your sister. NTA", "Honestly, I'd do whatever I could to keep this person OUT of their daughters life. I might be an asshole and that any parent \"willing\" to try and parent should be allowed to if they didn't beat them or whatever, but this kid is already fucking up their future and they're gonna end up in pregnant or in jail at 17-18 just like dear old mom.\n\nAnd \"mom\" knows it. All she sees is op stole her daughter while she went to jail and she'll do anything to spite op, including ruining her own daughters future and or laughing that she's gonna turn out miserable like her.\n\nOp I know you said you're all for visitation but even this person staying in your daughters life is gonna cause all kinds of shit, I mean kinda too late now but if I was you I would have told the kid they were adopted, hell I would have probaly even told them from who, but I would not have let them had a relationship or visit over the years in jail. \n\nIn 5 years you're gonna be looking at this point either your daughter is glad you stuck it out for her, or she's gonna so something a little after she turns 18 and completely ruin her life.", "OP should ask sister about her goals for Ash and the best environment to achieve them. Try reasoning then go the legal route.", "> At 13, a kid is entitled to be heard. But decisions are still up to the parents.\n\nCant the parents just pretend to think about what the kid said and then still just go with the original decision?\n\nNTA. i agree with you, its just that i have heard this before about the kid being heard, but parents getting the final say, i dont think its wrong, but it seems kinda redundant.", "Wise words indeed.\nMany parents also fail to understand the difference between WANTS and NEEDS.\n\nThere's no way you are anywhere near arsehole territory OP.\n\nQuite clearly, you are doing ALL the hard yards of parenting, and SO much more!\n\nYou deserve nothing but the highest accolades for stepping up and being such an excellent parent to Ash. \n\nPlease don't lose faith in yourself, or what you are doing/have done - you absolutely rock!\n\nPeople like you are impresive beyond words.\n\nNTA", "Do this", "Not trying to be a jerk, but did you mean “metaphorically”? Just trying to understand your comment to OP.", "She could get molested, start drinking, start doing drugs. OP doesn't know this \"boyfriend,\" men search out single moms.  Obviously, the mother doesn't make good decisions. She goes to prison with an infant at home, and immediately after release, she's not trying to better her life for her and her child. Instead, she's a lazy sloff. Moms sacrifice, like OP, has done.", "Learn to read:\n\n>Because I was 19 I was legally allowed to take custody of my niece Ash\n\nYou:\n\n>It's not your place to unilaterally make this decision. That's what courts are for.\n\n\nWhat are you drinking? \n\nThe courts MADE the decision when Op was given LEGAL custody. \n\n\n>Ash is Laila's child, not yours. \n\nWay to thank the mother that was there since Ash was a baby and until now that she's 13.\n\nAgain, legal custody.", "Sometimes the being heard part is also about having the FEELINGS validated without taking on the kiddos CONCLUSIONS. And part of parenting is helping kids to navigate big and confusing feelings. It also gives parents an opportunity to explain their decisions, rather than authoritarian arguments like \"my house my rules\". So for example it could look like Ash explaining how she feels about the situation and her mom and OP saying \"yeah I can tell that you're feeling ____ and it totally makes sense. And I bet after missing all that time with your mom you want to be together. But my job is to take care of you, and that situation isn't safe or healthy for you and that is my priority over anything else because it's my job. Since you feel ______ would _________ help to soothe that?\"", "I really appreciate this sensible and empathetic response. So often adults refuse to consider children’s perspectives. Creating space for them to be heard and understood is so important, even if the outcome isn’t what the child wants.", "NTA> But honestly, as soon as she started to be a negative influence on her, I'd have kicked her out. Yes, teens can suck for a few years due to hormones and stuff, but your sister is clearly not ready to be a mom. And your niece probably sees that she won't have rules with her bio mom.", "NTA \n\nMay I give some advice based on other Reddit stories I've seen about parents that return and start having a bad influence on the lives of the children that were adopted by family members?\n\n•Please get Ash into therapy ASAP.  This gives her a neutral 3rd party that can point out the way she has been changing and not in a good way.  \n\n•Insist that visitation is set up by the courts so everything is properly documented and set in stone so both sides have to obey what is in place.  This keeps down the chances of her saying that you told her X Time/Day/Place and you never showed up.\n\n•Insist on Supervised Visitation with a Court Appointed neutral 3rd party at a neutral location.  This also prevents the whole \"You said Friday at my house, but you never brought her over\".  It also stops her from being able to stir up trouble and claim innocence when she is the one trying to say or do something to make you angry and look like the bad guy.\n\n•ZERO Overnights.  Call me paranoid, but there are too many horror stories of parents that do a Snatch and Run with the child/children.\n\n•Phone calls between you and her are recorded, texts and emails are saved.  This stops the \"I Didn't Say That\" nonsense.", "you're first mistake was letting your sister live with you. you're second was not kicking her out when she started having a negative impact on ash. you have no clue what she has or has not said in the last three years, and you are looking at an uphill battle getting ash back on track. NTA. best of luck", "Your kid can ask. The answer is no. I doubt the court would give her to her mom and it’s probably only a matter of time before your sister is back in jail anyway. Ash doesn’t know it but she needs you to stay strong for her. She’ll thank you when she gets older. I would try to limit their visits and wouldn’t allow overnights at all. Good luck. You sound like an amazing person. NTA", "NTA change the locks and don't allow your sister to come again in your house. You should have evicted her when you saw your daughter (your niece is your daughter after all these years) beginning to change behavior", "NTA...I feel for you. You did the right thing. But there is not much you can do now other than to sit down with Ash and explain the world to her. Your sister has already 'corrupted' her and the only thing you can do at this point is to talk to Ash and explain why you don't want her to go, what kind of life she'll have etc.  TBH, I would suggest letting Lai take her for a month or so...sometimes you just got to let kids make the mistakes in order to learn...", "ESH\n\nYou should've kicked your sister out long ago. She refused to  help, refused to work, and brought weird men over. Of course this would negatively influence your daughter. Can't you realize that your sister is taking you for a ride and doesn't care about you or what you think? Your daughter wouldn't have turned out this way if you had kicked your sister out long ago.", "YTA for letting your sister manipulate your daughter for so long without doing anything to stop it", "The saying you can't polish a turd comes to mind with you trying to help your sister.\n\nNTA", "INFO: What kind of therapy do you have Ash in?", "NTA. Personally, I wouldn't want your sister around Ash AT ALL. She's a bad influence. Tell her to take you to court (I'm betting she wont) and tell it to the judge. Ash will gripe and moan and be a petulant teenager and I don't envy you that, but when she's older she'll realize you did the right thing on her behalf.", "NTA..you need to call her parole office and let her know about her shady behavior. I gaurentee she's doing drugs and drinking with the random people she wants over and let them know she's trying to take your daughter.", "She'll probably pimp this child to her undesirable friends, this just made my blood boil😤", "Nta and sis is gone.  She doesn't have any legal or *moral* backing.  At this point, there would be 0 visitation. She is a bad influence.  Your kid is 13. Yes, it will be a fight. But it's one you HAVE to win.", "NTA. But there isn’t much you can do.  The child is old enough to want to make her own decisions.  Unfortunately she is probably going to go down the same path as her mother and there is nothing you can really do to stop it.  I feel sorry for you for giving up so much and now it is all melting away.  You might have to let go and let her and her mother crash and burn.  If that is the case you probably will have to cut them out and off.  Good luck.", "She can’t move out unless they have a stable home and job. You want her to be safe. She might have to change schools, not be able to have the after school activities and stuff she was used to.", "Is Ash in therapy? She needs to be.", "NTA. I'm surprised that as a parolee she can get away with not having a job for months. Isn't that a requirement? For Ash's protection, it might be good to find out what all the conditions of her parole ll are. Do you know whether there are limits on who she can associate with, for instance? You don't necessarily have to report violations, but you could let her know that if she takes any more actions that undermine Ash's education, safety, or stability then reporting violations will become necessary for Ash's sake. You set the boundary. Your sister is entirely in charge of choosing whether she pushes you so far that she sends herself back to prison.", "NTA however you need to consider two possibilities. A you can get into legal trouble is her mom purses a legal route B even if you don’t get into Legal trouble this can be an uphill battle especially since Ash wants to go with her mom", "NTA", "You are fighting a losing battle.  She wants to be just like Mom.  It's so much easier than being  like you - responsible.  I applaud you for trying.\n\nNTA", "NTA", "NTA.  I shudder to think of the poor decisions 13 year old me would make. But 13 year old me was an unhappy kid. Personally, I would get her into therapy. Your sister has instilled some poor ethics and behavior over the past 3 years that you know about. Who knows what you don’t know that is definitely going on. I wouldn’t keep them away from each other, but monitored contact is best, if that’s even possible with a teenager.", "YTA. Not for not giving back custody, but for not nipping this bad behavior when it first started. You should have kicked Lai out years ago as soon as you noticed her having a negative influence on Ash.", "NTA but imo you fucked up by letting sister move in with you", "NTA. I personally wouldn't have let sister meet her child until I was 1000% sure she was turning her life around and getting her shit together. She just got out and instantly had a net to fall onto whenever she knew she could fuck up by going to live with you and YOUR daughter. You definitely shouldn't have let her live with you or set up a way for her to be on her own . But noe you have to make a choice. Deal with being the bad guy until Ash realizes you did her a huge favor down the line OR let her go and figure out the hard way (even though this decision has risks of its own).", "Eliminating all contact is going to cause that child to run away to her mother so you're not going to stop her from seeing her mom. My recommendation would be supervised visits and setting boundaries on what is acceptable during the visitation.", "NTA, Ash is 13 now she’s at least old enough to comprehend what you and your sister (her mom) went through growing up and want you wanted her to avoid going through. You need to be open and honest to her about how the path she’s going down will affect her as these growing teenage years will be her defining moment of starting adulthood. Tell her what you and your sister went through, tell her what her mom did, just be honest about your feelings and what you went through and did to keep and raise her into a good upbringing. And tbh even if her mom, your sister, is in parole she still would be able to file for custody and get her child back should she work towards it.", "Let’s try this again….\n\nI was the unstable parent. I was the couch surfing drunken mess of a human and never once fought my daughter’s dad for custody. Why? Because I was the trainwreck that everyone watches and under no circumstances was I letting her ride that train. Her being happy, healthy, and in a stable environment was more important. You are a hero in my book and I will fight anyone who says otherwise.\n\nN.T.A.", "NTA-please make sure any visitation is SUPERVISED!", "It's not the same, but my niece went through a very adult/grown up  thing that needed interference if you will when she was 14.\n\nI took her out to a fancy restaurant, let her have a glass of wine with her fancy dinner and told her she was an adult for the night.  She could absolutely speak her mind and I would tell her things the way I would if she was 10 years older.  \n\nIt was actually really productive in getting her to see things as a adult.\n\nSharing in case you think it might help :)", "I am going to make some assumptions. CPS place Ash in your custody and you might get a stipend as a result. Most family placements allow you to take advantage of services offered which include child counselling and parenting classes.\n\nCan you see if there's anything that can help because at 13, your time for intervention is diminishing?\n\nNTA", "Nta  ash needs therapy", "NTA. \n\nGet Ash into therapy as soon as possible. She’s already been “abandoned” once in her life…. Now again because her mom is a shitty person?? \n\nAlso, tell Laila’s PO about what she’s been up to. She will probably reoffend then what? What kind of mess will you have to clean up?", "You should have kicked her out the moment you noticed her negatively influencing Ash", "NTA\nBeing a parent often means protecting kids from themselves, ehich is what you are doing by keeping custody of your neice/daughter. \nI encourage you to go to family therapy because Ash must be feeling a lot of things and is not sure what to do with those feelings. It makes sense that she would want to be with her mother after all that time apart. She probably can't comprehend what it would mean to actually live with her, and she would probably say she doesn't care if it means living in a less favorable situation, but you know how such an environment could affect a young person. If not therapy, at least have a conversation about why it's so important to her to go and why it's so important to you that she stay. \nI suspect eveyone wants to feel connected and wants the best for Ash, but some strong feelings are getting in the way of being able to come to a consensus on how to make that happen.", "Unfortunately,  I have to go with ESH. Ash should have been in therapy a *long* time ago.\n\nLiving with your aunt and visiting your mother *in prison* has to be so fucking hard. Therapy would have helped her to handle that as well as the feelings she was bound to have when your sister got out. I'm sure you knew she'd get out eventually.", "NTA. But if I were you, I'd get Ash some therapy where she can talk about this with someone, and maybe then she'd understand why it's a bad idea for her to go.\n\nShe feels abandoned despite having you, as she has no parents, and the one who popped back into her house/life is no good, but she doesn't want to believe it, because then she thinks she's probably also no good.", "You need to speak with a professional. You need visitation to be supervised. You are an asshole for letting this go on for three years.", "OP I think this would be a really wise time to get some support through counseling. This was tough timing - 13 is already a tough time for parents and kids to navigate, add to it this confusion. An unbiased 3rd party could go a long way in helping your kiddo understand the choice that had to be made here, and processing the feelings that come with it.", "I'm a foster parent and occasionally we get runners. This is a child that runs back to their home whether that be with their parents or other parental figures. So they are running back to the people that they were removed from.  \n\nIn training, they warned us that runners will not come back with things like coats and shoes. No, I'm not joking.  Anything they have on them that can be reused or sold they willingly give away.  I believed my training because I've seen a lot of things, but I didn't really internalize this until I got my first runner.\n\nAsh wasn't brought up in that kind of household. But Ash will probably find herself in a situation where anything she brings to Laila's house that can be reused or resold will be taken, willingly or not, from her.  This will be a huge wake up call for her. Nothing like having your \"mom\" take your laptop, your phone, whatever else you brought that is worth a dollar.\n\nOn a serious note, I would be very concerned about the possibility for physical or sexual a6use in a couchsurfing household. Tia needs to be very concerned about the possibility that Ash will be a55aulted.", "I think it's a safe assumption that Lai will violate parole before three years runs out.", "Yes I admit I should. But being that she is the only family I have I wanted to give her a chance. She had to be paroled somewhere and we are all we have. We were smack in the middle of a pandemic. I was working and Ash was in virtual school and I really thought we could be a family again. My sister is my only biological family Member I have. I love her. And this is so hard. Everything we went through as children, abuse, jumping from foster home to foster home, homelessness for a time. I know prison changed her. But I really thought I could be there to help.", "Keep Laila's parole officer on speed dial.", "THiS needs to be up higher! \nThat poor kid must be so confused!", "And she needs to put a lot of effort into healing the situation with the neice because if op has custody/guardianship rather than adoption then the sister can try to regain custody and the kid is about old enough to make her own decision and the courts may decide to let her live with the bio mom full or part time.", "Yeah, I'm not sure about the YTA, but I tend to think that it maybe a lost battle. 13 yo is way old enough to be making stupid decision and start acting out when things doesn't go their way... And \"acting out\" would be easy as she did get a nice example of how to misbehave during 3 years. \n\nI hope it will resolve otherwise but if the niece was giving me a hard time, I would send her to the big mom, betting that the grass isn't greener in her house and the teenager will get it hopefully soon enough.", "I would lay this put to her: your biomom plans on couch surfing with her bf. Couchsurfing means youre technically homeless. Going with your mom means not having a safe place to sleep. It means having to be wary because you dont know the people your mom hangs around. It means not knowing where your next meal is coming from.", "What everybody is saying (from what I understand) is that 13 years old can speak for themselves, but cannot decide for themselves. They are just not \"world-savy\" enough, and easily manipulated.", "I’m working on that now. But struggling as to what type of therapy she needs. I don’t know if she is traumatized about all of this. Hurt about her mom being gone for so long. Or mad at me for not letting her go with her mom. She is completely shutting me out emotionally now. We used to could talk about any and everything. And now it’s like I’m the villain. My soul is crushed.", "Its possible the court let it slide due to the pandemic.", "Depending on where they live, the parole officers may be so overwhelmed with their workload, they may not be checking in or meeting with the sister as much as they should.   \n\nI do believe that a change in address has to be approved.", "She probably already is.", "Realistically in this situation there are very few obvious right and wrong answers and a vast ocean of grey ones in between.  You're not wrong keeping your daughter in your home.  Letting your sister take her would almost certainly end badly.  Maybe Ash would see the light eventually, but by then what damage is done?\n\nShe might resent you for a very long time for your choice, but yours is a decision guided by the gift of age and experience, neither of which anyone has at 13.  I disagree with going no contact because Ash already has a connection to your sister.  Forcing them to separate completely will backfire.  Just keep being the most stable person available for your daughter and remember it will, for a very long time, be a thankless job.  You will be the safe space for her to rage against. Keep loving her the best you can and be okay with needing to change decisions and boundaries in the future.\n\nGood luck ❤️", "I agree. At that age their bio parent, they believe that mom is still the best despite all the evidence to the contrary. Right now bio mom is the coolest person to them, they can do whatever they want and there will be no consequences, whereas you are providing structure and discipline, and all teens start want that freedom that they perceive adults having. My brother ross was that way with his bio mom and she abused him for 13 years, to the point that went my parents got him he looked like a 7 yr old. His growth was very stunted and even with good nutrition never really recovered. He kept wanting to go back to his mom, despite the courts declaring her unfit. He see it now but as a kid, he thought we were big meanies for not letting him see his mom, it wasnt us, she just never showed for any visits we offered her as she was too busy getting drunk.", "Thanks. To me this screams for a compromise, like letting the daughter stay there for a month to test, and see how it goes. Like if her grades deteriorate further, or she adapts more bad habits, but also she might realise the grass isn’t that much greener at her egg donors side.\n\nRight now I think it just fuels her rebellious impulse, and seems fanatsy land over there. But I bet the rose colored glasses will fade rather quicker than later.", "Yeah possible. But it still would be useful to be aware of when the sister is violating one of her conditions of parole. She seems to have not done enough to rehabilitate yet, and that suggests that a slide back toward prison is pretty likely. That's why I asked about associations. The boyfriend may be on the banned list. Would OP know?", "Ah so she might already be in violation. Interesting.", "NTA, but maybe throw it back into her court with daughter as witness. Sister only cares about herself, so make the reason include her (even if it's not the real reason). \n\nI'd be tempting as reasoning with something like this. \"I'm not trying to keep you guys separated just to be mean, I'm trying to prevent you from losing sister again. The protective services expect me to be caring for you, and they will remove you from my custody if they knew that I'm letting you live with the person they removed you from.\" \n\nThen kind of put sister on the spot \" Sister, I love you and I want to see you guys happy, so let's do this the right way. Ash can move in with you once you have clearance from the services/courts. I know that waiting sucks, but this is our best path forward in getting you guys reunited and you obviously love her so it's a easy dedication.\"\n\nThis will give them a path forward, but is going to take time and ensure some maturity happens.", "NTA. She is a teenager going through the hormone stage so hopefully this will pass.  \n\nYour only error was letting your sister live with you but you did your best.", "All you would have to do is show Ash’s grades for the years before your sister got parole.Then show her grades for the 3yrs your sister lived with you.    \nThen you get her teachers to write about the change in attitude and whatever else they noticed in the last 3 yrs.\n\n**Your sister would have to have a stable home and job (for a period of time, check your state for info), before any court would let Ash live with her full time.**                   I think you can safely assume that she will stay in your care until she turns 18.\n\nAfter that, it’s a toss up as to how Ash’s life will go, because those will be her choices.    \nYou can guide and try to steer her onto the right path, but no matter how much you love her, at the end of the day, they are her choices.\n\nGood Luck.", "NTA. \nShe is a negative influence and is not stable...", "NTA", "You are quite the opposite of the asshole. You are doing what you (and any other sane individual) KNOW is right for the child.", "I'm not a lawyer or a PO, but in my understanding, there's a possibility that moving out of your home could violate the terms of her parole (stable home vs shaking up).  If so, you run the risk that Laila gets hauled back in and Ash might wind up in the system since you allowed her to leave your custody.\n\nI'm not saying you should inform on her, but it would be good to try and find out the terms of her parole.", "NTA but you shouldn’t of let her stay around for 3 years being such a negative influence. Hopefully once she’s out of the house her influence will wear off.", "NTA but you let this go on way too long.", "Absolutely NTA and Ash staying with you in a stable home is what’s best for her. Please put her in some therapy if she isn’t already. Her life has been turned upside with her mom now being in her life. She’s also going through puberty & teenage emotions, on top of your sister’s influence. \n\nTake this thru court mediation as a last resort, if your sister wants visitation. Keep record of everything for both her and Ash. All the behavior changes, communications, etc. \n\nGood luck! Updateme", "NTA!! You should've kicked her out long ago when she first started her shit. Not to sound mean or anything but you really should call her parole officer and tell them what has been going on those 3 years, tell them about the boyfriend and how she is trying to take her daughter who isn't in her custody. As much as that idea sucks it might be the best solution, this woman is a danger to her daughter's life and well being and is an extremely negative influence on her. Tell them it is making things difficult for you. I'm pretty sure legally she can't make the decision to live with her mom considering her age and since they gave you custody. It sucks her mom is back to who she was before when she went to prison. However, 13 is not an age where you can make serious decisions by yourself, she's still a kid and her mom has made it so she would rather have a sad and pathetic life with her than a thriving and loving one with you. You might want to get her out asap and protect that child.", "You are the hero of this piece.  So here is my advice to a heroic woman who from the age of 19 has done nothing but build a good life to take care of others.\n\n1.) You keep Ash.\n\n2.) You and Ash go to therapy together.  (Be sure you don't go to a \"reuinfication at any cost, who cares if the children's lives are destroyed\" social worker for this therapy.) What has happened with Lai's terrible behavior and influence has to be confusing and upsetting for Ash.  Perhaps therapy will help.  Ash might also need individual therapy.  She's been though a lot with Lai in and out of her life, and Lai's behavior when she's there.\n\n3.) Go for monitored visitation only for Lai.  Without a monitor, God only knows what will happen when Ash is with her, what Lai will say about you, and what she'll do in front of her.\n\n4.) Get a good lawyer to make sure your custodial arrangement is what you believe is best for Ash.\n\n5.) Back away from helping out Lai.  Do not let her live in your house again.  Do not allow her unlimited access to your house.  Do not allow her access to Ash beyond the custodial agreement.  Change the locks.  \n\n6.) Trust your judgement, but know that you can't fix Lai.  And for Ash's sake, you need to disentangle yourself from caring for Lai, who sounds like an extremely irresponsible, out-of-control person with poor judgment.  \n\nYou are very much NTA.  I admire you.  Bravo!", "Your best bet might be to compromise by letting Ash stay with Laila for a period of time. (a month or two?) Keep close contact with Ash and let her know that you love her and want the best for her. She can always come back but there are conditions to living under your roof.\n\nAt best, the novelty wears off and she wants stability. At worst, Ash learns some hard lessons from Laila and the boyfriend. Being the safe harbor is the best thing for Ash in the long run and puts Ash in the position of making the choice for herself.  \n\n\nYou should remove all financial support from Laila. Once she realizes that she's going to have to support this kid by herself, she may very well decide that it's too much work.", "You an asshole for letting your sister move in with you, knowing the type of person she is, but you’re NTA for saying no. She’ll get over it. She stays around her mom too much longer, she’s going to end up just like her.", "NTA. Her perspective that you are the one splitting them up is funny. She's the one who was in prison.", "NTA -just getting that out of the way. \n\nI am so sorry that you are going through this. It feels like such a slap in the face when the child you have sacrificed so much to provide for seems to turn on you. I had a very similar situation with my nephew. My sister chose to stay with a man that abused him over her child’s welfare. I stepped in and gave him a safe home with her blessing (at the time).  \n\nI was his safe person. He knew I would always be there, so I got the brunt of his anger about anything that frustrated him. My sister was his queen. He wanted her love and approval, so he was an angel in her presence. \n\nYour daughter knows you aren’t going anywhere, so you’re going to be the punching bag while she seeks bio mom’s affection. \n\nYou are the best parent and provider for her. Please look into family therapy  to help her and you navigate the situation. It may not resolve the issue. But it should give you both some coping tools. The most valuable thing my nephew and I took away was that we couldn’t control my sister’s actions. We could only control how we reacted to them. \n\nHugs and best wishes to you.", "NTA\n\nYou have custody of Ash for a reason, and you are seeing why.\n\nTime to get Ash back in therapy, and then have a serious heart to heart with her.  Remind her of how well she used to do in school, and how she used to do activities.  \n\nRemind her of her hopes and dreams and help her make a plan for success.", "And its not like These aren't parents sharing custody. OP is the mom and this child does not get to make that decision.", ">Cut all visitation unless it’s supervised by you personally. I could easily imagine your sister taking the daughter and not returning with her.\n\nThis right here. The vast majority of kids who are kidnapped are kidnapped by a non-custodial parent. It will get even trickier considering Ash wants to go with her.", "This isn’t a productive response. Telling this mother to give up on her 13 year old, that she’s a lost cause? No, there’s lots that Tia can do, and she’s getting a lot of options in these comments. Will it be harder due to Laila’s influence? Absolutely. But Ash isn’t a lost cause, not as long as she had someone like Tia advocating and fighting for her. It’s going to be hard, especially if she does it in a way that limits more trauma to Ash. But it is possible, and this mother deserves all the support in the world right now.", "I hate those \"THIS!!!\" Posts but seriously OP I hope you read this comment I'm answering to.\n\nNo idea how up to date on sex-ed Ash is, considering you're in the USA.\n(I already had my 1. sex-ed at 11/12 and more in the following years + my parents obviously explained everytime I asked about something, so I knew pretty much everything at that age)\n\nI don't know how you (OP)  handled this, but if you didn't already sit her down, explain boundaries, rape, assault, trust in gut feeling etc. \n\nBe her safe person in case something happens (even if you obviously keep her). \n\nYou never know what could happen", "I am really sorry for all you have gone through being in the foster system. You are wonderful for stepping up and raising Ash despite all of the struggles that came along with it. \n\n>But being that she is the only family I have\n\nFortunately this is unequivocally false. You have Ash. \n\nI know you love your sister and a lot of her mistakes are likely because of her life growing up but you can’t enable her. Especially at the detriment to your daughter. I would highly recommend family therapy for you and Ash and maybe eventually your sister as well. If things don’t work out with this boyfriend you should not let her move back in with you. Look at how much Ash has changed since she came around.", "Look, OP, she has been slowly turning Ash against you. Trust me, your sister cannot be trusted to do the right thing here, and she seems incredibly self-absorbed... meaning she isn't able to put Ash's needs before her own. Please remove her from your life and put this child in therapy. She's going to need it. Thankfully, she has you.", "No she’s not the only bio family you have. You have your niece. You have to put her first!", "I would see if you can find a family therapist for the both of you to see together. Having a neutral person could really help. They might have recommendations for a talk therapist for her as well. You should move forward assuming she is suffering from some type of trauma. \n\nBeing separated from Laila was likely a traumatic event for her and it happening again will be as well. From the moment babies are born they can suffer from Adverse Childhood Experiences (ACEs) and that trauma rewires their brains. Separation from her bio parent(s) is one potential ACE. And she likely suffered from some form of neglect as well which could be another ACE. If your daughter still has a CPS case manager, I would contact them about what is happening they might also have trauma informed resources for you to utilize.", "NTA. But don't parent Ash out of your trauma. \n\nAllowing your sister into your home and to cause such a disturbance says to me that you love your sister (obviously) but haven't worked out how to do so in a healthy way. And that's not your fault, because you were never taught how to do so. \n\nBut, now as an adult, you have the opportunity to learn and move forward in a positive way. \n\nAlso, you're amazing. Just in case no one has told you as much lately.", "I should have put more pressure on her. But again we were in the middle of a pandemic. Most entry programs were shutdown completely or at max social distancing capacity. It took 3 months just to get a parole officer assigned. Everything was backed up and slow. The credentials she needed to even work were in limbo because she’d never been a functioning adult in the free world and everything was pretty much shut down from COVID. I do feel she got a bad deal with her greenery because it was rushed and then again everything was pretty much shut down. It’s not to make an excuse for her at all. But we were all stressed. With her coming home. Ash not fully understanding Covid and why she couldn’t be around her friends. My job was still requiring me to be on site daily as well. I won’t lie in the beginning it was a relief to have her home because 1 I missed my sister. And 2 I had a little help with watching over Ash will I was working.", "> Your mistake was not setting hard boundaries with your sister.\n\nOP cannot control another human being. Much less a hardened criminal who was in jail for 10 years.\n\nOP should not have let her jail bird sister move in to the home with an impressionable teen child.", "> your niece’s wellbeing is paramount, and it sounds like you’ve been doing an excellent job at prioritizing that\n\nOP WAS doing a good job raising her niece. Up until the point in time where she allowed her ex-convict, lazy, rude sister to live with them and influence OP's niece. \n\nIt was a bad, bad, bad idea to invite that rotten apple into the bunch.", ">So often adults refuse to consider children’s perspectives.\n\nThat was my experience, hence why i asked my initial question. Over the years even telling parents that, they would just brush it off and say they have the final say, so as i grew up i just thought it was a reduntant law/rule. i never really thought about this other perspective to it, im an adult now and sure there stuff my parents got right, but also stuff i still as an adult feel like they got wrong or could have done different."]}