{"id": 32919, "submission_id": "18h2opj", "title": "AITA for putting my girls in a room that isn't a legal bedroom", "selftext": "I'm a single mom to 2 girls (10, 8) and a boy (6). We live in a 2 bedroom apartment. \n\nUntil recently, I had all of the kids sharing a bedroom. The girls had a bunk bed, my son had his toddler bed, and most of their stuff was kept in the playroom or hall closet. \n\nThe playroom is our second living area. It's about 9'x20' and is mostly separated from the rest of the house. It isn't a legal bedroom because it doesn't have a door or closet. \n\nThe kids needed some space so I moved the girls into the play area. We installed a sliding barn door to fix the no door issue and got them some Ikea wardrobes to fix the closet issue. They still have their bunk bed but as they get older I plan to get them their own beds and split the room with room dividers so it feels like they have their own rooms. They love having all of the extra space to play and my son is excited to have his own room. \n\nThe problem is my brother visited and saw the barn door on the kids room. He asked about it and I told him that it's the girls' new room. He's upset that I put the girls in there because apparently they'll be safer in a real bedroom with a real door and that one day they'll realize I shoved them into the living room instead of giving up the master. \n\nnow I'm wondering if I shouldn't have put them in the playroom. AITA?", "created_utc": 1702427527, "permalink": "/r/AmItheAsshole/comments/18h2opj/aita_for_putting_my_girls_in_a_room_that_isnt_a/", "score": 2288, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I put my kids in a room that isn't a legal bedroom.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - First of all, \"legal bedroom\" refers to how you can advertise a home. I lived in a home with a \"bonus room\" which was a small room with no closet so the landlord couldn't call it a bedroom, even though that how we used it. \n\nYou came up with a very reasonable solution. You put a door in for privacy, gave the girls more space, and have appropriate furniture for them. Your brother is just a snob.", "INFO: So, the only reason it’s not a legal bedroom is because of the lack of door and closet? It has a window for egress, right? And the barn door gives them some degree of privacy? If so, NTA. Funny that your brother has an opinion! Maybe if he feels so strongly he should finance a new house for you guys that’s huge and has room for everyone and a guest room and God knows what else.\n\nIf the playroom doesn’t have an egress window, I don’t think you’re an AH, but please don’t do that. It’s not safe.", "NTA. the only reason it’s not a bedroom is because realtor guidelines state an official bedroom has to have a closet. At least that’s how it is in my state. It would be more of an ahole move to keep the girls with the brother when they need their privacy. And if the room is bigger then your room mom you did the right thing to give them that room.", "NTA. You're making the most of the space you're in. It has a window, you added the door for privacy and storage.  Seems like your daughters don't have an issue with the space. Children have been sharing rooms for hundreds of years. It's not always possible to have a room for each kid.  I would give them freedom to decorate their side to their own individual style. If your brother has a problem, he's free to give you a generous monetary gift to move you to a 4 bedroom place.", "Does the bedroom have a window for safety? And does the door offer privacy so the space is closed off?", "NTA;  You are a single mom adapting well to your situation and making your daughter's happy in their own space.  The space is physically safe, even with a privacy door.  Your brother can shut up or chip in to affording a nicer place.", "INFO- why does he think it’s less safe? Intruders?", "Sounds more than reasonable. Kudos to you on the creative thinking and working well within your means while giving your children space. Dear brother sounds like a martyr. \n\nNTA, Mama.", "Literally people live in garages, why the hell would a \"playroom\" be unacceptable? That's ridiculous. You're not an asshole, and your kids won't grow up to hate you for this reason. You're Literally taking every concern to heart and figuring it out.", "NTA, and I am not sure why your brother gets a say. You actually turned it into a bedroom because it has a door, closets, and a window. Tell you brother to stop projecting whatever crap he is feeling onto your household. Unless he wants to pay some bills for you, then he might get a say. \n\nThat is a great space for your daughters you created. If they need privacy as they get older, hang a curtain between them.", "NTA\n\nYou have done nothing wrong. You sound like a great Mom. Your brother should keep his opinions to himself.", "NTA. I live in NYC and know you have to make do with what you have.", "NTA. I live in NYC and know you have to make do with what you have.", "I never understood the whole \"is not a bedroom without a closet\" thing.  Bedrooms didn't originally have costs people bought wardrobes, armoires, drawers and chests.  There wasn't such thing as a closet and people really need to get over that in my opinion.  I vote NTA", "I believe that the 'not a bedroom' rule for door and closet is for real estate law.  I believe that the 'live in that space' law is an egress window for safety.", "I know immigrant families where 10 people live in a 3 bedroom, 1 bathroom house.  People put blankets and pillows on carpeted floor to sleep at night and fold everything up in morning.  Several of the family members were students.  Everyone got jobs and later purchased houses of their own - but for 2 years, they lived like this and it was fine.  When I was young, my parents had a 2 bedroom apartment.  I shared a room with my younger brother and baby sister.  It was fine.  Later when we moved to a house, I shared with my younger sister while my brother had his own room. What is the need for each child to have their own room?", "nah you good. it's just a playroom anyways and they have the whole fam for protection so chill brotha", "Pssssstttt a closet is not a legal requirement", "NTA. The kids I know would love a big room! Make it cool, and tell your brother to take a hike", "NTA-my folks did this when I was a kid.  Large playroom, not technically a bedroom.  It actually was second-floor with a banister along the top of the stairwell.  (My dad eventually walled it off for safety reasons.)  My brothers shared the big room and loved having the space.  They were about your kids' ages at the time.  But it's a room.  And it's your room, in your house, so you get to do with it what you want.  If your brother is so upset about it, let him buy you a place with rooms to his standards.", "NTA.\n\nYou are a single mom. Rent is ridiculous. I think this was a fantastic idea getting a barn door and IKEA wardrobe. There is a window for egress. They won’t know or care unless other people make them feel bad. They’re happy they get their own space. It’s a very western thing to have such large homes and bedrooms for each child, and I have lots of friends around the EU and Australia that live in small spaces. It works for now, maybe one day you’ll have more space and I hope that for you. If I was your brother or sister I’d think about how we could support each other to move upwards in life.\n\nThe other options would be you share the master with your son or have the girls in the master but this works.", "NTA there are many countries where older homes don’t have closets they used wardrobes.  Ignore your brother.  Your kids are happy", "I spent a decade living in the tiny room with the house heater thing, they'll be alright.", "NTA- you just sound like a good parent trying to make the best of a small space, heck out of the 9 years I spent  in a room much smaller than this with a tiny useless closet and even smaller window I’d be over the moon with what you did. And yes it was shared 💀", "NTA, although info- does the barndoor lock? it probably isn't an issue now, but I would eventually probably get a barrel lock for it at some point.", "NTA sounds like a great solution!", "Definitely NTA. Amazing job being creative and making what you have work for your family. You’re doing a great job, mom!", "Did your brother support you or kids financially? If not, then what gives him a right to be upset and accuse you because you don’t have enough space?", "NTA. When my family hit a snag in finding a place to live, we ended up in one bedroom apartment. Me and my sister in the “real” bedroom. My step bro on a futon in the living room. And my parents slept in this open area connected to the living room. It didn’t have a door, or proper closet if I remember. They just hung a curtain in the entryway and called it done. We didn’t live there too long so maybe my situation isn’t completely the same", "Sometimes you gotta do what you gotta do. Being a single parent is hard,  trying to support your kids on limited income to afford a roof over your head. I get it. I also am a single parent (kid is now 30). But when he was little all I could afford was a one bedroom. He got the room with the bed and I got the living room with the sleeper sofa. \n\nNTA", "NTA. They have their own space. I don’t see the problem. Is your brother the type to butt into things that aren’t his business.", "Assuming the whole living area has a certificate of occupancy and was built to code with permits, there is absolutely nothing unsafe about it.  Does the lack of a built in closet create a lack of safety?  No.  Does a barn door?  Assuming they're to code where you live, no problem.  Your brother is just being negative and jerky about your very creative solution.  \n\nThe girls won't resent you, they'll appreciate what you did for them.  Assuming your brother doesn't say something untoward to them.  Let him know that doing this would be unacceptable and feel free to accompany this with threats.\n\nNTA", "NTA- your brother sounds like the a-hole. You found a solution using the space you have, don’t let him make you feel bad.", "NTA- You added a door and not every bedroom has a closet. You made those girls happy and because of the window they’re still safe", "NTA - you’re making the space you have work for you now and your brother needs to mind his business.", "As long as the room as a window this isn’t an issue. \n\nHOWEVER, a barn door doesn’t seal as well as a normal door. If there is a house fire, the smoke will EASY enter your kids room at the top of the door. Typically smoke can only go into a room at the bottom of a standard door because of the way the door closes with the jamb. \n\nFor a fire safety, you should put a regular door there.", "Is your brother willing to pay for a larger apartment?  Or is his helpfulness limited to unsolicited advice?", "NTA at all. Do what you have to do. You're doing great.", "NTA", "I loved having cool different rooms growing up. Even as an adult I took the walk-out basement as my master suite because it big enough for the bed, dresser, and an entire living room set. It was like having a mini apartment and my kids had all the upstairs bedrooms. You’re doing great and your brother needs to save his opinions for when you ask for them.", "NTA in time if you are handy you can probably install built in closets and a door.", "You did absolutely the right thing! Give up the primary bedroom!?! What’s wrong with your brother? You’ve already given up your entire life for your kids. You deserve the primary bedroom. The “playroom” is spacious, now it’s private. It’s excellent. I had a brother in the “done” attic and one in the basement. Shared it with a laundry space. As long as they can close themselves in, they’re fine.", "NTA. You do what you can do, and this is probably the best choice you have. Also they won't care what the rooms intended use is. For them it is their bedroom.", "NTA, your bro is the A. \n1. Don’t judge a parent. \n2. Kids are happy and fed, that’s what matters", "NTA. You created a bedroom. See a need fill a need", "NTA. You're making use of your house according to the needs of your household. If someone wants to be upset about the living arrangements, tell them they can buy you a house with more rooms.", "No. Tell your brother to mind his own business.", "As long as it has two egress, at least a door and a window, it's a \"legal\" bedroom \n\nIt's not illegal to sleep in a room without a closet.  Your brother needs to have a coke and a smile, and shut the F up unless he wants to pay for a bigger apartment\n\nDid he take think it was better to have 3 kids in one room?\n\nNTA", "A barn door may not be a fire safe door.  If your house catches fire it can be a serious issue (as would no legal window as a second exit) if not the right materials and up to code.  You’d need an actual inspector to review the set up to be sure.\n\nFortunately, getting a real door or barn door meeting fire code installed is probably not too difficult just has a cost.  But doors aren’t just for privacy.  \n\nNo closet is fine, wardrobes are great.  But don’t mess with fire safety.", "First of all, wtf is a legal bedroom", "NTA. Don’t give children a master suite. They will destroy the bathroom", "Tell your brother to mind his business", "NTA. Bro needs to mind his own business. You’re doing great by your kids.", "NTA you’re just trying to make the best of the space that you have. I don’t see how they would be safer in a different room.", "NTA. What is wrong with the barn door? Those are so cool! Your brother is kinda negative about something that has nothing to do with him. If everyone is happy, that's what counts!!!", "Is there a window?  A door?  Well you are fine.  Make sure a smoke and carbon monoxide detector outside each bedroom.", "NAH. The only thing I would check is fire safety re the door.", "Nta less safe *how*?  A barn door is like,  the slide style, yes? That's a door.", "NTA.   we removed our bedroom door and replaced it with a barn door.  It looks so much better", "[deleted]", "[deleted]", "YTA for keeping the master for yourself. That's not what moms do. And you're just one person, whereas you have three kids. They need more room than you do.\n\nYou can't keep the girls in the playroom unless there's a window for fire safety purposes. I don't believe a door is required, but a door is a fire safety tool as long it can slow the fire from entering the room. If child services is alerted to their living situation, you'll be required to move them. They'll likely add a bunch of other requirements as well, so it's really not worth the risk.", "soft yta ...possibly. \n\nAny reason why you aren't giving up the master bedroom? \n\nSeems kinda messed up that two people have to living room when you can just move there and they could still have space and their own privacy. \n\nyou can use room dividers to make a room in the living room.", "NTA of course not. Be you do need to be aware that the reason it isn't considered a bedroom is because it doesn't have an egress. So a secondary way to exit the room in case of emergency, like a fire. Ultimately, your brother is not wrong that's not as safe as a bedroom, but I highly doubt your kids will be upset about their living space when they get older.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm a single mom to 2 girls (10, 8) and a boy (6). We live in a 2 bedroom apartment. \n\nUntil recently, I had all of the kids sharing a bedroom. The girls had a bunk bed, my son had his toddler bed, and most of their stuff was kept in the playroom or hall closet. \n\nThe playroom is our second living area. It's about 9'x20' and is mostly separated from the rest of the house. It isn't a legal bedroom because it doesn't have a door or closet. \n\nThe kids needed some space so I moved the girls into the play area. We installed a sliding barn door to fix the no door issue and got them some Ikea wardrobes to fix the closet issue. They still have their bunk bed but as they get older I plan to get them their own beds and split the room with room dividers so it feels like they have their own rooms. They love having all of the extra space to play and my son is excited to have his own room. \n\nThe problem is my brother visited and saw the barn door on the kids room. He asked about it and I told him that it's the girls' new room. He's upset that I put the girls in there because apparently they'll be safer in a real bedroom with a real door and that one day they'll realize I shoved them into the living room instead of giving up the master. \n\nnow I'm wondering if I shouldn't have put them in the playroom. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I had the “office” growing up from middle to high-school due to the amount of people in our home🤷🏻‍♀️ no closet just a built in storage space. \nThe window was pretty much blocked by bushes(with no room or space to move) and it was a small window that I barely fit through. \n\nI made just fine. Painted it a god awful teal color 🤣", "At the end of the day all that matters is how your daughters feel about it.", "My bedroom growing up had no heat and a curtain for a door. You’re good.", "NTA. Maybe your brother wants to pay for you to live in a 3 bedroom?", "NTA. It has a door for privacy from the rest of the house and multiple points of egress, which is the important part. It’s probably larger than the master and it sounds good to divide later for each girl.", "Is this apartment the forever plan?", "NTA and tell your brother to shut the fuck up and mind his business. \n\nThis is the dumbest shit in the world.", "NTA. You’re doing a great job, mama.", "Kids love unique bedrooms. When I was a kid I used to beg my parents to finish the basement/attic so I could move in. It sounds like you found an awesome solution to a tight space situation, as long as your kids are happy you’re good! NTA", "Lol i opened this because i thought you were shoving them into a closet. Not that there wasnt a closet. NtA", "NTA!!! As moms we do what we can for our kids and hope it’s enough sometimes. We had to leave our house in October this year unexpectedly, and had no money. It was honestly be homeless with our two kids or literally live anywhere. We were offered the opportunity to rent a tiny little trailer in the yard basically of this lady’s house. One of our kids is sleeping in a room that is a bedroom legally but is the size of a walk in closet. You do your best Mama and show up for your kids and no one with sense can fault you for it.", "When I was a kid we were house sitting a place for one of my parents friends mum that was enormous, that we'd never have been able to afford. It was two story with two bedrooms upstairs and two downstairs. My brother and I were downstairs and constantly having nightmares and were scared being on a different floor and there weren't enough rooms to have us all on the same floor without sharing.. in a 4 bedroom home lol \n\nIt had this massive room with french doors off the kitchen (guessing like formal dining? Idk I've never lived anywhere that size again haha). Mum put up a sheet for privacy and added a bed and it became my brother's room. He was ecstatic.\n\nI don't see an issue with what you're doing. Even if a house with enough bedrooms we ended up with a kid in a 'not' bedroom and he's no worse off for it.\n\nI'm so sad she only had us stay there for a year though. It was such a good house haha", "NTA. And your brother is an idiot.", "We turned our master bathroom into a bedroom for our second child until we moved to a bigger place.\n\nNTA", "No but your brother is TA. \n\nI have a second living area in my house that I use for my office. It doesn’t have a door but does have windows etc. I built it this way so that future occupants of the house could add a sliding door if they want to close that section off. Sounds like what’s at your place? Well FYI, not one builder, architect, town planner or other official opinion giverer had any qualms about this.", "This isnt so much a safety reason. It has egress (escape route) a closet is just a realestate definition.  \nThe girls will love it\n\nNTA", "Sounds like he's projecting. You do the best you can with the space you have. NTA.", "Another safety idea…\n\nPut an old broom/mop handle or a wooden dowel from the hardware store in the track of the patio door.  Keeps it from being jimmed open.\n\nThey are 8 & 10, they are perfectly safe and happy in this room.  Barn door!  Great idea!\n\nNTA.", "NTA. \n\nI love how people who aren't paying your bills try to tell you how to live. Your brother needs to mind his own business.  \n\nUnless he's willing to pay your rent, then he can get you a 3 bedroom apartment or house.", "NTA.  Great job! No reason those kids can’t live in a room without a closet.  That designation is for home sales.  Can’t call it a bedroom.  Still has access in case of fire or something.   I problem.  It’s all good.  If those saying you’re wrong want to put out the money to get a bigger place or build a closet, fine.  If not, tell the. To mind their own business.", "NTA - you’re doing your best as a single parent. If your bother has such an issue then he’s more than welcome to chip in and help you buy a bigger apartment", "NTA\n\nFor generations, we didn't have doors or closets in bedrooms.  You might have a tarp over the door.  Wardrobes instead of closets. \n\nI think your solution is perfect.  You have provided the girls with a room that doesn't include little brother, and you have plans for when they want more privacy from each other.  \n\nTell your brother he is being an AH.", "NTA at their age I would have LOVED a space like that, you doing good momma", "Nta tell your brother to suck on his big toe. His opinion doesn't matter. Keep up the good work mom.", "NTA. I dated a single mother who put her kid in a walk in closet THE SIZE IF MY ACTUAL BEDROOM.  While it didn’t have a window it had ample space for all her kid’s furniture and privacy. Not the route I would go personally but this mom sacrificed her closet so that her kid could have privacy. She ended up using the smaller guest room in her apartment as her personal closet.", "NTA at all…what does he even mean by safer?", "Nta.", "It sounds like you came up with a great solution. Tell brother if he's so bothered by it he's welcome to pay for your new three bedroom apartment or buy/install a latching door in place of the barn door, otherwise he needs to mind his own business.", "NTA. \n\nYour using the space that you have to get creative solutions that work for everyone. It’s nice that your brother is concerned, but the girls sharing with their brother has probably reached the limit as is and you giving up your bedroom for theirs like you’re brother suggested would only work for maybe a year or so before you would need the solution that you already came up with.", "Giving up the master, ha! I’d have laughed him out the front door.\nNTA", "The only safety issue I could think of is a fire issue. Bedrooms are safer because if you close the door at night when you sleep, it contains the fire and smoke long enough for you to wake up and escape. That's why it's always recommended to sleep with your door closed. I wouldn't say your an AH for this because the risk is still relatively low with smoke detectors, but if this was his issue, I would say he's not the AH either", "NTA but your brother is also right when they grow up they will need more privacy ^f^r^o^m ^e^a^c^h ^o^t^h^e^r", "I don't know where you're located, but in California the addition of the wardrobe (even one) makes it a legal bedroom, especially as you added a door already.\n\nNTA. You're doing what you gotta do even beyond the minimum.", "No you are actually rather AWESOME and your kids appreciate all you are doing. The room now has a door sooooo it’s close to a bedroom. I moved around a lot as a kid and not all of my bedrooms had a closet and I never knew I needed a closet for my room to be considered a bedroom. I can tell you I did LOVE going to my bedroom when I was younger to play, be alone and to grow up. It’s nice having your “own space”", "What you've done is just fine. You've created their own space. So long as there is a fire egress (window) and door, you're fine. All your girls are going to know is that they had a decent sized bedroom and that you were smart enough to think outside the box and figure out how to make your space work for your family. Tell your brother if he wants all the kids to have \"appropriate\" bedrooms, he can help you foot the bill for a 3-4 bedroom place. Until he does that, he can keep his opinions to himself.", "Hey former kid who lived in a loft of a 2 bedroom when I had two brothers and my parents.  I didn’t mind it at all.  It sucked having a sheet as my 4th wall but I didn’t get mad.  I was so busy with things in high school I wasn’t really home anyway", "NTA - your brother is beong ridiculous. Since it has windows and now has a door and wardrobs nothing wrong wifh it at all. Sounds lile a great room especially with a balcony.", "As long as they have fire escape access it doesn’t really matter about what kind of door there is. If they are enjoying the space, and it’s safe, there is no reason for argument. NTA", "If you tried to adopt 3 kids to live in the situation you were in, the government would reject you without thinking twice.  But you’ve got to do what you’ve got to do.  Nah", "NTA.\nYou found a practical solution to a potential problem.\nYour family members need to butt out of your business.\nMy comeback to your brother's commentary is....ya know what, if you don't care for the way I set up my house, you can use the door in which you entered MY house and use it to exit MY house..", "NTA", "My father slept me on an air mattress in the laundry room/storage room in the center of the house for almost a year because I needed a place to sleep and it's all he had available. Aside from that he was actually an AH, you're not.", "100,000% NTA! There are people in farrrrr worse situations than this.. Like others have said, if he's so concerned maybe he should help you move to a bigger place AND be pitching in for rent each month🤷🏼‍♀️", "I had a giant extra family room as a bedroom when I was 16 and it was amazing.", "NTA.  If your brother is so concerned, he should be helping with the mortgage/rent on a larger place.", "NTA. The “legal definition” of a bedroom is for realtors/sellers/landlords to meet, not people who own the home and don’t have immediate plans to sell or vacate the home. \n\nIt’s like the myth that you can’t take the tag off your own mattress.", "NTA sounds like you're doing your best for your kids and your brother is an asshole", "NTA. When I was 10 and had to sleep in a room with no doors or a closet. My mother was raising 3 kids, 9, 10, 14. While also dealing with the grief of a passing father. You’re a great mother for doing your best", "NTA!! \n\nWhat a ridiculous notion your brother has! It’s not his family or home & he’s not financially contributing so he gets absolutely no say in how you decide you want to allocate rooms to your kids. \n\nI would do exactly the same in your position - you’re thinking of your kids and you’ve got a practical solution that you and your kids are happy with. End of.", "NTA. Kids need space. I was an only kid, but we had times where we lived in places no bigger than a studio apt. There was a small storage space about 8 feet long and 3 feet wide. My dad made it into a tiny livable room for me, and i was so happy to have a space of my own. Your girls are only going to remember how you went out of your way to give them a place of their own. Don't let your brother give advice when he doesn't have a real stake in things.", "NTA Please provide the law describing a \"legal bedroom\" . I think your solution to the issue of providing privacy and clothing storage is great! Your brother is an idiot.", "Wow you’re an amazing mom. That was such a great idea! Who cares if there’s no closet. It has windows and a door. I don’t understand why this would be considered unsafe. Great job!", "Your brother is nuts. There's nothing wrong with this room at all. Tell him to mind his own business. NTA", "NTA. Your girls... okay people are unpredictable, so I can't promise they won't mind. \n\nBut I've never known a kid who objected to that sort of thing. They tend to view it as \" look at the great room my mom created for us\" rather than object. \n\nKids do not expect they should get the primary bedroom.", "I used to sleep in a closet tell you’re brother to kick rocks or but you a new house. He sounds like a grade a poopoo head.", "There is a grain of truth to bedrooms with standard doors being “safer” because it makes it harder for house fires to spread from room to room. \n\nThe takeaway from that, though, is probably to make sure your smoke detectors are checked regularly and you and your family have a fire escape plan that you practice, not that you should put them in the master bedroom. \n\nNTA.", "Bravo to you. Keep doing what you’re doing to take care of your babies and who gives a shit what he or anyone says. If the kids are happy that’s all that matters.", "What is your brother on? It's pretty presumptuous of him to not like a solution that works for you all. Safety-wise, your brother should appreciate the lack of a door as it will expedite egress /s, they need privacy and barn doors are a vibe. \n\nNTA, pobrecito needs to get over himself.", "NTA. Keep doing a great job mama. Keep your head up. If uncle doesn’t have anything nice to say or support you with then pls don’t pay too much attention to what uncle (ur bro) says.", "NTA. As long as it's safe,which it sounds like it is but I'm not certain about fire codes and barn doors, it's more than appropriate. I think a lot of those \"not a bedroom\" spaces are designed like that so that only a certain septic system needs to be installed or HOA codes met", "What a clever solution, and a win all around!\n\nNTA.", "NTA Per previous comments, it has a window, it has a door. They have wardrobes. It’s now a bedroom.", "NTA. As long as it has windows, smoke alarms, general safety features then it’s a great use of the space. I lived in a house where we converted the dining room into a bedroom. You gotta make do with what you have. It’s nice and generous of you to allow them to have the separate space and privacy. Tell your brother to either start paying your rent for a bigger place or shut up.", "I look forward to an update once you've shown your brother the responses here!\n\nObviously NTA.", "When I was a kid my parents bought a 2 bedroom house with a partially finished basement. It was quite the fixer upper. For the first little bit my sister and i had to share a bed in the second little bedroom while my brother had a crib. Once dad fixed up the main floor he finished the rest of the basement and my sister and i moved down there. After the basement was finished he started working on the attic, installed stairs, put up walls, added wardrobes. Once it was done my sister and i moved up there. It wasn't a legal bedroom but it was my favourite bedroom in all the houses we lived in while i was growing up.", "Tell your brother to fuck off with his Hoytie-toytie high horse from what I’ve seen you say in replies the room is perfectly fine and safe for the girls to sleep in and I sounds like m the room has more then enough space even after they get older", "I thought you were gonna say it was a closet or something. NTA. When I moved into my apartment I was gonna put my boys in the living room because I don’t really entertain to need that much space. The only reason I didn’t was because the first week we were there (before most of the furniture came) they were loud as shit, and the living room shares a wall with my very quiet neighbors. I figured the safest thing would be to give them the bedroom without neighbors so the kids can be loud in their room without bothering anyone. Sometimes I think about switching their room to the living room. And we’ve lived here a few years now. It has a regular sized doorway, I’d just need to install one.", "NTA you are doing the best you  can with what you have. Nothing harmful or unsafe about your set up", "NTA. \n\nMy only concern was a lack of windows in case of fire. They have windows, a real door (not just a hung up sheet), wardrobes, a neat balcony...they'll be just fine.", "Lmao nta. \n\nHere a legal room means a window for fire escape. Closets be damned. Tell him to stuff his cakehole. A balcony is frigging DOPE", "INFO: what does “separated from the rest of the house” mean? Is it it’s whole other building outside? Just confused because of that and the “living room” part makes it sound like two entirely different locations. I would maybe have a different opinion if they were staying in say, a shed-type building outside of the house with barn doors bc they are young and wild animals/robbers ect exist", "Safer how? Kinda weird comment", "NTA. Tell your brother when he buys you a house he can have an opinion and until then he can STFU.", "Eh, you got a room. You put a bed in it. It's a bedroom. Simple as. NTA", "NTA. I put one of my kids in a similar room. It had a door but no closet and was also being used as a play room. My girls needed there own space and it was the only place I could move one of them. It worked out great and my daughters actually fought over who got to move into that room because it was bigger than their room.", "NTAH. I applaud your ingenuity. Your brother seems stuck with conventional thinking --\"things have to be this way.\" Your kids are lucky to have a mom who's adapting and making things work better.", "I used to sleep in a converted attic corner over the stairs. NTA, you are simply being frugal.", "NTA. You're doing a good job giving your children the space and privacy they need! It sounds like they're safe and have their needs met, and that's all that really matters IMO. I don't think your brother gets an opinion unless he's willing to pay for y'all to have a bigger living space. Otherwise, he's just being judgmental for no reason.", "Uhm yeah i live in Europe, we don’t have closets at all. Some rich people have them in newer houses but it’s not common. Your brother is being ridiculous.", "He would have hated what I did in my 2 Br apartment. \n\nI sectioned off the dining portion of the kitchen with shower curtains as the living room entrance and in between his shelves and the wardrobe. \n\nHe had his own window. We just never ate in that dining area. He had a raised IKEA bed, so he had a play area underneath complete with his own tv. His desk fit perfectly with a chair. And we put up his Star Wars posters on the wall. He loved it. \n\nSeriously, you do what you gotta do in this day and age. If we were still living there, I would have given up our bedroom and outfitted the living room with a Murphy Bed and we would have stayed out there so the kids could each have their own room. \n\nNTA.", "Give me a break.  NTA.", "I turned my dining room into my bedroom because it’s bigger than the bedrooms I have and it’s cozier than my bedrooms. It has windows, I live alone so the no doors thing doesn’t matter to me.", "Nta- you’re a good mom. You created space out of nothing for your kids. I think it’s really sweet", "NTA. you’re making it work, and if the kids are happy with it, that’s what matters. tell your brother he can pay for a bigger house for you if he’s that worried 🙄", "NTA-I had a friend who was a single mom with a 6 year old living in a one bedroom apartment. The kid’s bedroom was the open dining room area. He had a bed, his toy box, chest of drawers, and his drawings pinned to the wall in there. They did the best they could with the space they had. Nothing wrong with that at all. Your brother needs to mind his own business.", "I’m a single mom and I put my two boys in the master with a bunk bed. I didn’t need the space anyway. They played in the room, I didn’t go in my room except to sleep. When they got older, my oldest son got the smaller bedroom and I shared with my younger son. (8yr gap) I’ve seen moms take part of the living room as their room and the kids got the only bedroom, I’ve seen a walk in closet turned into a toddler bedroom that was only for sleeping. Do what is beds for everyone involved. If the kids are fine in the play area, let it be for a little bit and if it needs to be swapped around, change it. Don’t let anyone that doesn’t live with you dictate how you run your household.", "Reading that the room has a window along with the door and cupboards you put in, NTA OP. The girls will love it and your brother can take a hike. It's their space now, and they'll be so happy having that.", "NTA. I often rent out apartments that are 2 bedrooms + den. The den isn't a technical bedroom because of the closet, but I always tell people that they can certainly make it a third bedroom and I try to show them all the ways that space can be used. What you did was smart and you're an awesome mom for doing this for your girls! Don't listen to your brother, he doesn't know anything.", "NTA for sure", "NTA, your brother can get over as there's a exit for safety and there's privacy. It's better they're not stuck cramped in together.", "Not at all. Giving your daughters more of their own space, privacy, and a balcony sounds awesome. You gave them a door, and a wardrobe works just as well as an in wall closet. \n\nI grew up in half of a room that was not intended to be a bedroom, with a curtain separating my space from everyone else's. I didn't have a closet or wardrobe, I kept all my things in plastic drawers. Your kids room sounds awesome to me, safe and dignified.", "If the kids are happy and you are happy I really don't see the problem.\n\nIf you're still living in that apartment when the kids are old enough to realize that the master bedroom is bigger than the playroom, consider swapping with your girls then. Right now it sounds like they don't care and don't need that extra space.\n\nNTA. Your brother can venture an opinion when he's willing to pay your rent on a bigger place.", "NTA. Worst case scenario is you could install a real door if there is ever any fire safety concerns because having a closed bedroom door is safer in those situations. Unless you are worried about the possibility of a tornado a closet probably doesn't matter either. They have windows and honestly, you'd likely immediately grab your kids in the case of an emergency. Make sure they have some emergency preparedness and they'll be fine.", "Tell your brother to go pound sand. Tf. THE BABIES ARE HAPPY! That’s all that matters!! Good idea btw, mama!!", "My 18 year special needs son's room is what used to be the dining room because he is unable to climb the stairs and we can't safely assist him anymore. Due to his conditions and need to access his room quickly in a medical emergency, we hung blackout curtains to give him privacy in lieu of the original pocket doors. \n\nWe work with what we have NTA", "Almost no states require a bedroom to have a closet.", "NTA, since it has windows, wardrobes and a door it sounds like a perfectly acceptable room to me. as long as the girls are comfortable and happy i don’t see any issue with it", "Your brother is not very nice , let your kids enjoy  their new room  sounds like you have done well", "Not asshole \n\nThe bedroom is a room with a bed, your brother's being extra.", "NTA It is practical and gives all the kids more room and privacy. My oldest son’s first bedroom was a large closet. My youngest son’s bedroom ages 9 to 18 was a corner of the finished basement, cordoned off with tall bookcases for privacy. As his older brothers moved out, I offered him their bedrooms but he chose to stay in his alcove. No one criticized me for any of it but if they did, I’d point out the safety precautions I took and note that my kids liked their spaces.😀", "NTA.  My childhood bedroom was smaller than the bathroom and had a door to the outside because it was an entryway.  The room is a bedroom now, your brother is being dramatic.", "From a life safety perspective, the window is the main thing that matters, as a second form of egress.", "NTA; it’s big room all to themselves. If your brother is soooo concerned then he can buy you a new place. Also your girls are going to remember that you provided a safe, happy home for them.", "I live in the UK where having a closet is the height of luxury. Even new builds don’t usually have them (unless they are huge), we buy freestanding wardrobes. That’s fine. \n\nI would definitely make sure the door meets fire regulations though. Typically they have to be of a certain thickness and/or materials to slow down the progress of fire by a specified amount. So yeah, do that. But otherwise as long as the room has a window, you’re good.", "I'm from the Netherlands and I think the requirements for bedroom here are: room that has a door and a window. Maybe not even a door lol. From what I've read, the new bedroom has a window, and you put in a door and wardrobes (which by the way is _really_ common in the Netherlands, built in closets are quite rare). It sounds like a nice bedroom and a perfect solution. Absolutely NTA. It sounds like you are happy with it, your children are happy with it, and it's all safe. You did a good thinf! <3", "NTA! I'm of the opinion that unless someone is helping you pay your bills, they don't get to have a say in the matter unless there's an actual safety issue. And there is not. When I was married to my first husband and our son was young, we initially had him in our bedroom and then eventually felt like he needed his own space. Off of the kitchen we had a corner area that was considered the living room. We turned that into his bedroom and he loved having his own space. I will say, since you have two girls and only one boy, the two girls should probably have been given the second bedroom and your son put in this extra space. Unless the extra space is a lot bigger, in which case then it makes sense to put the girls there. Whichever space is larger should be where the girls should be since there are two of them sharing that space. What you describe is something that many people do and not unusual at all. If your brother has an issue with it, let him step up and contribute money each month for you to be in a bigger space. Unless that's happening, he has no right to say anything and he's being a judgmental prick. What's important is that is that the kids are loved and taken care of and it sounds like you've got that covered. Please don't let him make you feel bad.", "NTA. do what you gotta do. Which sounds like a really good solution. Don’t people convert rooms all the time? There are many places that don’t even have closets and you have to get a wardrobe.\n\nWhat does he want you to do? Pull money out your butt for a home with enough big bedrooms? Does he wanna give you the money for a bigger home or renovations? Should you force them to stay in the bedroom with their toddler brother when you clearly put in a lot of effort to find a solution to give them their own space? I seen a lady put her toddler in her walk in closet in a 1bd apartment. She just put a curtain as a door for safety and privacy. You were creative and resourceful like heck yeah.", "NTA. Ask your brother if he's going to pay for your new house. If he says no, then tell him he can keep his opinions to himself.", "NTA Your brother is a moron... Im so sorry for this diagnosis. It's probably not terminal. However, this debilitating condition will persist for the rest of his life...", "Just chiming in to say, as former girl child and present mom, your solution sounds perfect to me. Sounds like three happy kids and that’s the best thing ever. My brother was a builder and very up to date on codes (he and I grew up in various California hippie situations, including living in a tree one summer, so he had some experience with safety issues) and I can’t imagine him objecting to your arrangement! Also I wouldn’t worry about doors keeping out smoke—that only works when they’re shut, anyway—but rather focus on having good working smoke detectors.", "I thought you were going to say that you made them sleep in the closet under the stairs…", "tbh why have 3 kids if you cant finance them", "\"Legal bedroom\" also refers to it having a window, which is a major fire safety thing.", "Agree it’s giving Rachel’s sister asking to take her call upstairs in her one floor apartment", "I have a ‘bonus room’ in my house that couldn’t advertise as a bedroom even though it has a door, a closet and an egress window because the previous owner added a wall that doesn’t have outlets on it. 3 of the 4 walls have outlets but apparently it doesn’t count because of building code.", "It has windows and a door to the balcony.", "It’s funny because the people I work for right now remodelled their attic into the master suite which means they got some say in the layout but technically, they don’t have a bedroom either. Their door is a sliding barn door and their giant walk in closet is technically in the hallway. Bottom line is if it works for you, technicalities for taxation don’t matter.", "There is no requirement to have a window,  just that If it does, then yes,  egress window only.", "Would it not be considered a “non conforming” bedroom, instead of an illegal bedroom?", "I own a house on an island.   Most of the houses are over 100 years old and none of the bedrooms have closets.  People just buy wardrobes.  I wonder where your brother thinks we should sleep.", "I'm not familiar with all building codes, but a window is a requirement for a bedroom in Ontario (Canada).\n\nOP's intentions are good, so I'll go with NAH, but they should give up the master and move into the 'play room'.\n\n&#x200B;\n\nEDIT: Saw that OP stated there is a window for the girl's here. NAH. OP is making the best of a situation.", ">You're making the most of the space you're in\n\nBy putting two of the kids in the living room and keeping the master for herself.", "Yes", "Fire, probably. Then again, given how many doors and ‘walls’ are unsafe, I don’t think it makes too much of a difference- they can get out into the balcony and OP can have alarms and extinguishers and safe furniture and all that.", "He didn't clarify", "Yeah, that bothered me. The girls are in their home, they’re already safe. Unless he’s the kind of ah that’s implying she’s bringing random/dangerous people to her place.", "Jumping on board to say way to work with what you have!\n\nMany redditors jump to snide \"why are you having more kids than you can afford\" type comments that are unhelpful and imo, unwelcome. Imagine any other context where calling someone an AH because of what they can (or can't) afford was accepted. You have 3 kids and are managing to pay for a 2 bedroom place on your own. You are doing your best to give each kid space, privacy, and storage even. NTA.", "My friend's first room in NYC was technically a hallway", "Correct\n\nhttps://www.realtor.com/advice/sell/what-is-a-bedroom-features/", "There are many countrys where even in new homes closets are very unusual", "In the 70s my brother had a walk in closet/luggage room as his bedroom. He loved it because he didn’t have to share with the girls anymore. It was not legal but it was what my parents had to do in base housing back in the day. Two bedrooms for three kids back then. Same situation but two girls got the bedroom he got a closet with louver doors. Rules have changed over the years but parents do the best they can. When my next sister came along she slept in a dresser drawer the first couple months. I was #5 by then they were in a 4 bedroom thank goodness.", "It depends on the location really, but usually it has to be a minimum size, and with two points of egress (door and window usually). Some places require closets, some don’t, it depends on the local laws. I’d consider that a nice bedroom personally.", "In real estate you can only call a room a bedroom if it has a closet. Anything else is a den or bonus room or whatever. It’s really only important when you list a house for sale. For instance OP couldn’t claim her house is a 3-bdrm house just because she’s using the family room as a bedroom. It’s still “legally” a 2-bdrm house.", "It's because normal doors can help keep fire on the other side of the door, a barn door closes differently so the fire will burn differently\n\nBut in my opinion it doesn't matter, plenty of people sleep with the door open for comfort anyway", "This.  \n\n\nCFS do not allow sharing bedrooms. Knew a woman, had a 14 YO daughter, had a baby girl, going to put two in the same room. CFS said no. Mind you, this woman was on public support.   \n\n\nBe very careful what you do. Be very careful whom you tell.", "We've been here for years and are in an area with rent control. We can't get shit for what we're currently paying.", "Oh. So you think they should share a smaller room?", "Op said there was a window and a balcony in the room. The room has privacy and space. The room also has a door.", "Because the room the girls are in is much bigger than the master bedroom. In a few years I can divide it down the middle and they can each have a decently sized space.", "I think a parent, who's doing their best to provide, deserves the master bedroom 🤷🏻‍♀️ kids are young and adaptable and have reasonable accommodations. They'll be fine.", "Wasn't in OP but she mentioned in comments it does have access to a balcony. So emergency escape via balcony is just as viable an option.", "Haha I got to change my room color in my early teens and I went with this medium electric blue shade (think Lisa Frank vibes.)  It was like this blue cave, I loved it!!", "lol this is what I thought too in the 70s my brother literally had a closet for a bedroom.", "She says it has a window and a door to a balcony.", "So it’s just…these rooms?", "Well then my apartment has no bedrooms. I live in an old house, each bedroom has only 3 walls with outlets.", "NTA- those girls are going to love the balcony once they’re older. A balcony off the bedroom is very “Disney channel teenage girl room dreams” lol", "Definitely recommend getting mesh for the balcony for safety!", "Then you’re fine. The door into the hallway is about privacy, not safety. The windows and the door to the balcony is about safety and egress.", "I never knew there was issues with ‘legal’ bedrooms or not. But you are a single mother providing shelter and care for your children. There are people in far worse situations sharing even more of a cramped areas. If your brother is so concerned maybe he should get you a 3 bedroom", "In that case, 100% NTA. Ignore your brother; he sounds very judgmental!", "So what exactly are they less safe from? Monsters?", "As long as there’s a winDow for fire safety it’s fine! NTA", "Do you have an emergency rope ladder for fires? (Assuming balconies aren't on the ground floor but I'm not an architect lol) or another way down from every window that's not safe to jump out of?\n\nYou're good OP. Barn doors are fine. Partitions for more privacy later is awesome.", "Hi OP! In Australia, a bedroom must have a smoke alarm inside. Other rooms have different rules. Does the girls' room have one? Might be worth installing if not 😊", "I'd say make sure they have some quality blackout curtains and making sure the balcony door has a lock. People don't realize how easy it is to see into lit homes when it's dark out and your girls deserve privacy and security.", "NTA- Have you always known your brother is an idiot or did this confirm it?", "I grew up in a very small 2 br house. When I hit 8th grade I could not share a room with my older (like 14 year older) sister anymore. Me in that room and in highschool would have resulted in someone's death (probably not mine). \n\nSo I picked up and moved into the basement. It was a split level so there was a door to the kitchen but if you wanted to go into the laundry or utility room, you went right through my room. That was still better than sharing a room with her (I was the nightmare not her). \n\nMama - you did great. Also the closet is required for it to be a legal bedroom is actually not true in many states.", "Just make sure you can secure the doors so they don’t climb out there and fall - 10 and 8 is big enough to be trusted but young enough to make impulsive, daring choices.", "You need to get a fire inspection, to find out whether your daughters' door will protect them long enough for them to escape in case of fire.", "When I was a child in elementary school, we used to do all kinds of activities for Fire Prevention Week\nOne of the fire Marshalls in our town would do presentations on fire awareness and safety\nMarshall would recommend a type of rope ladder in each room for egress in case fire blocked the exterior doorways.", "Is there an access (egress) to a path away from the structure?  Or a way down from the balcony.  Look at your states fire code or consultant inspector from your fire dept, please", "And it has heating/cooling like other parts of the house?", "They have a balcony? Girl you will not be able to dislodged them from that room even with dynamite 🤣", "This sounds like a beautiful room! My sister and I would have loved to share it growing up!", "Don't know where you live but, where I live a bedroom \"must be at least 70 square feet with no dimension less than 7 feet. (So a long hallway doesn't count)Must have a window that opens for light, ventilation and fire escape. A portable closet is acceptable.  Must have a smoke detector in the room.\"", "Required or not, no one should use a room without an egress window as a regular bedroom. That’s just not smart.", "Many places have a requirement for a certain amount of natural light, which is why shoebox condos use the frosted glass doors on bedrooms.", "In NYC, you can’t have a bedroom without a window.", "Oh, yeah. Definitely. It’s not like a crime to have a non-traditional bedroom or anything.", "Yes, lack of closets isn’t unusual in old homes that haven’t been completely remodeled.  When I was house shopping in Baltimore where most of the homes were 90+ years old, I ran across several that lacked closets.  People still lived comfortably and found work arounds, it’s no big deal.", "Right? Most of the bedrooms in the houses in the UK have either built-in or free standing wardrobes instead of closets.", "Yeah here in the UK built in closets are virtually unheard of.", "It’s a stupid guideline, I agree but the poster was saying why it may have been designated as not a bedroom.", "Are you in WA state?", "Canada too, window large enough to egress and a door are the ONLY requirements here.  Most of the places we've lived usually had at least one bedroom with no closet.\n\nEdit:  My part of Canada, apologies if it came across as Canada over all.", "One of the living rooms, not *the* living room. OP says it's separate from the rest of the house and the only reason it isn't considered a bedroom is the lack of a door (easily fixed) and lack of an inbuilt closet (easily fixed).", "At 9 x 20 that room is likely bigger than her room, or at least easier to adapt to 2 people", "NTA. It sounds like you’re making your space work for your family while also keeping everyone’s safety and health in mind :) brother sounds judgey maybe ask him to pay for an extension ?", "NTA at all. I cannot think of any valid arguments for a ‘real’ bedroom being safer.", "They have a point. If you can't afford em dont have em. This is why I'm 40 and my wife and I have given up on lids", "Must be an american thing, thanks for explaining", "Please show me the laws that say siblings can't share rooms. There's absolutely nothing wrong with same gendered siblings 2 years apart sharing a room.", "What nonsense.", "That rule applies to foster children, not to a mother raising her own biokids.", "[deleted]", "No, OP should have the smaller room. The kids should share the master.\n\nOr if she's going to convert the playroom, she needs to fully convert it with real doors and alarms to alert her if the kids go out on the balcony unsupervised.", "ah okay. \n\nyeah i don't think there is an ideal situation here and you're doing the best you can with limited space- when the girls are older they'll have more opinions etc so it's not as if this is set in stone. \n\nrent control is rent control- wouldn't ever give that up either!", "Ah, good to know!", "[deleted]", "I thought you were a doctor?", "I’m the youngest of four kids by a good margin (4 years to my sibling closest in age) so at 16 I got the entire 3rd floor of the family house to myself. \n\nMy brothers used to have their bedrooms up there but I took it over, painted my bedroom hot pink and had a California king sized bed with matching pink sheets and a zebra print duvet/furniture. \n\nI had my own bathroom, guest room, common area and staircase into the kitchen; originally the stairs/3rd floor quarters were for live in servants when that was a thing (the house was built in 1888). My staircase had a little door to my parent’s dressing room so back when the house had staff they could move through the entire house without being seen.\n\nMy family used to joke it was my ‘pink princess tower’ in the family ‘castle’. I had the only east facing bedroom window and woke up with the sun most days, plus that window opened to the roof of the sunroom (previously a tuberculosis room, woohoo! That house is haunted as fuck with old people and children, but I digress) which was flat on top.\n\nI could go out there and read or listen to music when I felt like it. Of course, as I got older I used that space sometimes to smoke weed or tan. I have many fond memories of my whole little set up and the privacy I was allowed at a very young age. \n\nApologies for the tangent, but the real sentiment is that you’re completely correct! My teenage bedroom was very fanciful and magical, it’s a nice bit of nostalgia for me and it surely will be for OP’s children as well.", "Their climbing boyfriends will love it even more ! Edit - and, NTA.,", "As a Disney channel kid who got thrown in the living room with a patio, i have to disagree with this. I had this exact set up. The lack of privacy without a true wall was horrible. I cried when I found out that my partner’s parents actually put their kids in the bedroom and slept in the living room when they were in a similar situation.", "The oldest is 10 already. OP probably won't be able to dislodge her from that room even if she tried.", "My understanding is that doors are also a fire safety issue. Idk if a \"sliding barn door\" gives the same safety ad a normal door, it might not if it lets more air (smoke) through, but I'm no expert.\n\nETA a whole lotta people don't seem to know the difference between fire and smoke", "I’ve heard of it being a requirement for child placement (adoption, CPS, etc.) but never for children of whom they have custody. Generally walled off with a certain amount of square footage per occupant, and two points of egress (door and window).", "In my area, at least, to legally list a room as a bedroom in real estate it needs to have a closing door, an egress point, and a closet.  Otherwise it's listed as a \"bonus room\" or \"home office.\"", "Does any 2 story house have rope ladders for fires? I've never seen one.", "Do you have a link for this? I'm Australian and none of the bedrooms I've lived in have had a smoke alarm so I'msuper curious. Could it be a state thing? There's always been one in the house, but usually in the hall.", "All the closets in my home (1910) were additions. Lack of closets are first world problems for sure. As long as they have a place for their clothing, it's fair in this regard.", "Hell, my old bedroom at my mum’s was the *size* of a closet in itself! 😆", "BC here, closet is required to legally be considered a bedroom. However there are many listings (for sale and rent) that overcount bedrooms.", "Here is how a traditional door is safer. It reduces smoke inhalation and fire risk overall, buying occupants time in a house fire. A traditional door stops air circulation on 3 sides, If a door is left cracked or there is a decent air gap then this benefit is nonexistent and the door is essentially ‘open’. https://fsri.org/programs/close-before-you-doze#:~:text=Top%20takeaways%20from%20fire%20safety%20research.&text=Using%20thermal%20imaging%20cameras%2C%20researchers,in%20the%20open%2Ddoor%20rooms.", "Sure, but that only applies to some situations.\nMaybe when she had the children, she had a higher paying job or second income from a partner. We don't know. My point is, what good does it do to tell someone with a 10, 8, and 6 year old that they shouldn't have had them?\n\nWe don't have the background to determine that her choice to have the kids makes her an AH.", "But life circumstances can change.", "Nah, there are plenty of cities in America with older housing and bedrooms that don’t have closets.  Like everything in the US, it’s location specific.", "Where I’m at they can share. When they’re foster kids they can’t if they’re not the same gender and if they are the same gender and have to share, they have to have their own bed.", "Are you going to give OP an extra 1k to be able to move into a better home? The kids are being fed and loved and have a home. Making a big deal out of nothing, they have beds-  they’re fine.", "I'm not sleeping on the couch so they can have their own rooms. If some agency has a problem with the girls being in that room, I will switch with them but it will mean they will get a drastically smaller room.", "Lots of people live a longer time in smaller homes with more people.", "The master IS the smaller room.\n\nAlso it’s an apartment. She can’t do anything to it other than the alarms. I’m sure she’s already thought about the locks and curtains.", "The good news is that your opinion has no effect on this woman's life.", "They're 10 and 8, not fucking toddlers.", "It rubs me the wrong wah that you think people have a choice on where they live because like you say, they can't afford it. Dick.", "Not sure where you’re getting that OP “can’t afford” her children, but your judgement is way out of line.", "All children who aren't being imprisoned can go outside of their houses, it's called the front door.", "They make keyed locks for every kind of door.", "You do know they make different kinds of locks, right?  One of my 12 year olds is in a room almost exactly like OP put her child in, except it’s our front porch instead of a balcony. It is technically a living room. No closet, etc. It does have a “real” door, however. He uses a spare hallway for a closet. He LOVES it. Kids don’t need a huge bedroom, and it seems like once they started needing more space, she provided it.", "There’s plenty of options to block a door without causing any damage. And the girls are 10 and 8 not two.", "Any kid can run outside whenever they want if they have a window. What's the big deal here?", "Stop acting like parents aren't human beings with needs anymore just because they have children. \n\nAnd how do you know she can't afford her children? Just because they don't have their own rooms? How fucking privileged is that? Do you think only wealthy people should have kids?\n\nThis woman came up with a creative and fun way to divide up her space. There's no need to be so judgmental.", "There’s no indication that she can’t afford three children. What??", "You lived every millennial girls dream💙 even the emo ones- we just all wanted our little enclave’s", "I really want to hear about the hauntings.", "This is absolutely amazing!! I would love a tour of that house, it sounds incredible", "My teen girl self is so jealous of you right now lol", "What’s a tuberculosis room?", "You know I was explicitly thinking of Gabriella’s room from High School Musical. The scene where Troy scales the trellis to her balcony and she opens her double French doors to reveal a FIREPLACE in her room. Disney was HGTV before there was an HGTV. Single mom raising a kid in New Mexico, of course they have a McMansion that looks like a modern farmhouse lol.", "The family living room is very different from OPs set up. They have a proper massive room with a door, window and balcony. With individual storage for their clothes and personal items along with their own bed. I’m sorry you dealt with that growing up but this is apples and oranges.", "Never heard of curtains?", "Clear things up for us, is the lack of privacy co.ing from another room of the house? Or is it because of the patio opening.", "So the very young children should have privacy but the adult parents should not?", "My son had his bedroom taken off and a sliding barn door fitted by our local council when we needed more access due to his wheelchair needs. He has a patio door to the outside on the far wall. \nWe had a fire officer come to our house to do a safety check (due to o2 being piped throughout) and they said that the door is absolutely fine. We are in the UK (England) though and other places may have different rules.", "You should ideally always sleep with bedroom doors closed because in the event of a fire it massively increases your chances of getting out safely, both stopping smoke and also slowing fire spread (smoke is fuel). If they have a door from the kitchen/dryer/places more likely for fires to start then it’s the same thing. At the end of the day you’ve made them a nice space and they’re happy. By far the most important fire safety thing is having working smoke alarms and in most places the local fire department can help you with those if cost is an issue. \n\nIn this case it sounds like the room has very easy escape access to the balcony at least, so they would very easily be able to get out to fresh air. Depending how many storeys up you are, you could consider an escape ladder for the balcony. \n\nDon’t leave candles burning, don’t leave things charging overnight (iPhones are fine, but other devices, especially cheaper ones we always charge in the day when there’s someone home.) don’t plug too many things into the same outlet and if at all possible buy socket adaptors and really anything you plug in from a store in your country that would comply with your electrical safety standards", "If thats the case, then they would require the door to bedrooms to be closed as well. I know many people whose kids (and the adults) sleep with the door open.", "You’re talking about fire rated doors. I don’t know what the laws are in other places but in Sydney (very much a nanny state) only doors that lead to common areas need to be fire rated.", "Me googling building codes for an answer here.\n\n\"The International Building Code (IBC) requires swinging doors for most egress routes, but the code includes nine exceptions where other types of doors are allowed.  Manually-operated horizontal sliding doors are permitted in a means of egress that serves an area with a calculated occupant load of ten people or less, except in high hazard occupancies.  NFPA 101 – Life Safety Code allows horizontal-sliding doors unless prohibited by the occupancy chapters, as long as the door is not serving an area with a calculated occupant load of 10 people or more. \"\n\nSo for a bedroom with 2 occupants, a sliding door would be fine.", "I came here to say this", "It is safer to sleep with one's bedroom door closed, we used to teach the little kids that in fire prevention week classes. However, in practice a lot of people leave their bedroom doors open or at least cracked for various reasons (air flow, pets), that it's not going to make a huge difference not having one. Keep your smoke detectors tested and working and everyone will have time to escape or get to a safe room with a door. NTA", "Yes but those are rules to prevent real estate fraud, since the number of bedrooms is tied to monetary value. But as far as safety goes a bonus room is as safe as a “bedroom.”", "We had collapsible fire ladders for the second and third floor bedrooms. They have brackets that slide over the bottom window frame. Metal and plastic, not rope", "We never had them but our second story windows went to the roof & our Dad would discuss routes on how to get out of the house safely in emergencies. He just wanted us to be prepared for things. He'd always make us demonstrate putting on the spare tire & checking the oil when we'd first drive a new vehicle. Definitely came in handy 😆", "I just saw one on the side of a house the other night when I was walking home from the bar,I assumed a kid had used it to sneak out of the house because I had never seen it on the house before", "I had to look it up as my info came from the guy who did our occupancy cert back in 2018. It looks like it's an in progress thing, currently applied to new builds but will be a requirement for all homes in 2027: https://www.qfes.qld.gov.au/prepare/fire/smoke-alarms/existing-properties\n\n\nFrom 1 January 2027\nAll existing private homes, townhouses and units will require photoelectric interconnected smoke alarms. These must be either a hardwired (eg. 240v) or non-removable 10 year battery powered type alarm.\n\nThe legislation requires smoke alarms must be installed in the following locations:\n\non each storey\n\nin each bedroom\n\nin hallways that connect bedrooms and the rest of the dwelling\n\nif there is no hallway, between the bedroom and other parts of the storey; and\n\nif there are no bedrooms on a storey, at least one smoke alarm must be installed in the most likely path of travel to exit the dwelling.", "I'm in trouble then. \n\nIn my 60 years, I've never slept with my bedroom door closed. The air gets too stuffy overnight, I wanted to hear if the kids woke up in the night, etc.", "I agree it's too late now to try telling her that, but any more then 3 kids and I'd be saying she has too many kids in general.", "Thank you. The concept of an individual having an entire area dedicated to them in the home is soooo privileged American. Whole families are facing homelessness but OP sucks because she’s managing her household as efficient as possible. Some people really don’t comprehend the reality of the world we live in.", "Cps will not have a problem with this. \n\nThey have adequate space and have a window. \n\nDon't let people scare you", "[deleted]", "The master is the largest bedroom. That's what a master bedroom is.", "But her poor choices do have an effect on her children's.", "That's not what he is saying at all. As a parent. This woman should have given all three the master and she had the smaller room. Or now with how the situation has changed. \n\nThe girl's should have the master and the son in the spare room, and she should have the living room.\n\n As the parent in this situation. She should be getting the living room and not the kids. Which is what the Op's brother thinks too.", "I'm not sure what you're talking about. I never said she had a choice on where she lived. I just find it shitty she took the best room for herself and put her three kids in the smaller room, and now in a playroom she make-shifted into a bedroom.", "She has nowhere to even put them. She can't afford them.", "Do people not have alarms on their front doors?", "Usually unlocks from the inside. No evidence OP has changed the locks on the balcony to work differently.", "The door should not be blocked. That's a fire safety issue. They need to be able to open it to escape fire, but there also needs to be an alarm in case they leave.", "Not a girl, but I was a kid obsessed with horror and mystery, and when I was 9 my parents were looking at houses. One of the many we visited was looking pretty ideal - they loved the layout, the hardwood floors, the kitchen, the size of the master bedroom and attached full bathroom, etc - whispering excitedly to each other the moment the seller wasn't in the room. They adored the place.   \n\n\nThen we saw the 'kids' room' which was still (well) furnished to give a great idea of how the space could be used. It was a little small, but got great natural light, and had a nice view. They had a sweet bunk bed, desk/work table set up with models all around, a wardrobe -   \n\n\nParents asked about the wardrobe, moving towards the closet. They were concerned about me having room for clothes. Seller was giddy to reveal that the door wasn't to a closet at all, which was why their boys had used a wardrobe and a dresser; it actually had a narrow attic access staircase through what *looked* like the small closet. They had walled off half the attic (the other half used for storage, accessible through a typical pulldown ladder on the other side of the house) and the section connected to the bedroom had been finished and turned into a little getaway area. They'd already cleared everything out, but they pointed to where their boys had had their gaming setup, the shelf for their books, a minifridge...  \n\n\nParents went from hot on that house to immediately turned off. I was disappointed in the car and asked why they lost interest so visibly. Mom just gave me a stern side-eye and said she didn't like the idea of me having such a private space for myself, stepdad agreed that it wasn't safe for me. What if I got hurt and they couldn't hear me calling?   \n\n\nWe ended up not moving for another decade anyway thanks to shit credit and gambling addiction (which caused the shit credit), but ahh... now and then I still think about how fuckin' *sweet* it woulda been to have my own little gremlin hidey-hole for reading books in and looking out that archetypal 'round attic window' with a shelf seat and everything built in front of it. It definitely factored into how I felt about my parents growing up, knowing that the idea of me having privacy was a big enough turn-off that they wrote off a house that they loved every other detail about.", "Same. You know a place like that has to have some stories.", "Happy to explain! \n\nThere was a thought when consumption (tuberculosis) was truly out of control that clear mountain air was a cure. So near every house in my home neighborhood was built with a tuberculosis room included. \n\nThe rooms themselves vary in location in the house (my childhood home actually had two, one downstairs that served as my mom’s office and the one under my window which was a yoga/work out room) but all were as close to all windows as you could get while ensuring some level of insulation. \n\nThey would be filled with beds and tuberculosis sufferers would live in said rooms breathing in as much mountain air as possible. I suppose they’re a bit creepy to many people but I grew up with every home around me including one so it never bothered me. \n\nIn all honesty they’re awesome places to hang out! My mom used to be a yoga teacher so for a long time the upstairs one was fully equipped with yoga supplies and we could practice whenever we wanted. Very nice in summer, we always had a little couch so we could have a summer cocktail and enjoy the sun and breeze!", "Curtains are not a true wall", "I remember having to practice getting the screen out and getting out onto the roof and how I would get down from there. We practiced it twice a year, once in either rain or snow, and Dad wouldn’t say when it was coming.", "LOL I feel that, for me my cat would freak out so we just leave it open", "It’s literally sad that I have to explain it too🤦🏻‍♀️ makes me upset. Some kids have to share beds with multiple others, and some people can afford rent but nothing else including furniture or food in their homes. People judge way too much - and have no sympathy for others. I grew up sharing a room with my sister and at some point my younger sister too until I was able to have my own room. We were happy and had full stomachs.", "The largest bedroom. Not the largest room.", "I disagree. I think she made the absolute best out of the situation. They have a bigger area. She made a bedroom. They have their own space.", "Is your hobby/kink getting massively downvoted from bad takes 😂", "Maybe it wasn't? Assuming shit actually.", "And those are her decisions to make, ahhh, the joys of being a parent. Like how you take care or your dog and tell your family it’s their pupper cousin", "I'm a dad of 2 little girls as well, I 100% can assure you if I gave my kids the option of being in that \"makeshift bedroom\" they would LOVE it. Tell me you wouldn't as a pre teen/teenager. Sounds like a \"disney channel bedroom\" as stated before", "How do you know she’s in the best room? Not every “master” is a bloody huge suite.", "The play room with a door that closes, windows, a balcony and is probably 2 times the size of the master? Oh what a bad mom/s", "They’ll be fine. They are kids.", "Where does it say their room was smaller than hers?", "Okay, and…? What exactly do you think she should do about it? Dump them in front of an orphanage?\n\nYou are judging her for having children “she can’t afford,” apparently having assumed that not only can she not afford it, but that she couldn’t afford it at the time she had them. Did it ever occur to you that someone’s financial situation could *change* sometime in the eighteen years after a child is born? You know, like as a result of getting divorced or being widowed?", "She should probably have them put to sleep, or sell them on Facebook marketplace. It would be the financially responsible thing to do ☝️🤓", "Well she can't rightly put them back, now can she? Or what? Should have aborted or give them up for adoption? See how dumb that sounds?", "> She has nowhere to even put them.\n\nExcept apparently she does, because each child has their own bed.", "Lol no, and you're telling us all you come from a privileged background with the amount of judgement your slinging around in this post.", "Lots of people don’t have alarms on any of the doors in their home. Myself included. 🤷🏼‍♀️", "Get over yourself already, there’s no need for OP to mention anything about balcony door locks in this post. They’re well aware of the fact that the door goes to a balcony without you whining about it.", "Considering it was already the playroom for the children, and I doubt an 8 and 10 yr old are supervised playing 24/7, what makes you think there isn't already locks on the balcony or that the balcony is one that isn't safe for children?", "There are also windows. Plural. Plenty of other points of egress if OP finds it necessary to block the balcony doors.", "> That's a fire safety issue. \n\nNot unless there's no other egress. Most bedrooms don't have balconies, and somehow they're not extra unsafe in fire.", "You really really want to be right about being mad at this single mom don't you?", "This makes me genuinely sad, I'm sorry man. I would have loved something like that as a kid, and now I'd love to do something like that for my son. The best we could manage for him was expanding his room into the space under the stairs, so it has this cozy little reading nook. It's no badass attic goblin cave, but he's pretty stoked about it.", "And you can’t just casually drop that in parentheses without any explanation.", "It sounds absolutely dreamy! Do your parents still live in that house? And chance you have some pictures of it to share? I'm super curious what it looks like!", "You're right about that. But what's your point. He has walls already, he wants privacy regarding his patio door, You think he drywalled over his windows? I've got the same thing, living in a loving room with a sliding glass door to the patio, I got curtains and a big ass tv in front of it, I move the TV over a bit in the summer so I can get out to the patio. No interest in using a patio in canada winter so it's blocked now. I have more of a privacy issue with thin ceilings/floors than I do this giant window nobody can see in or out of 9 months a year", "There would be yowling and scratching for sure at my house!", "Same- shared a Cali king with two sisters until we were 9, 7 and 5 years old. And then we had bunks and always shared a room. I didn’t get my own room until I moved into my own apartment. And we’re all just fine. If anything, we have close bonds to each other and don’t get weird hang ups over “this is my personal belonging” and naturally share and think of each other. If I’m making myself a sandwich I’ll ask whoever else is home if they want one. If my sister wants to use something of mine or wear my clothes it’s almost always ok. I’m blessed I was raised without too much individuality, because I know how to cooperate successfully with the others.", "?", "Now, I don't disagree with any of that and personally don't see anything wrong with it either. Heck, I grew up super poor and spent most of my childhood and teen years on my grandma's couch, never having a room. I am just saying that the commentator wasn't blasting OP for being poor and only being able to afford two bedroom apartment. He was just saying that she should have never had 3 kids in a small bedroom when she could have taken that option and gave them more space with a master. It was a pretty selfish decision not to give the three when they were all sharing the one room, the bigger room. Which part of me really agrees with. With how it stands now with the girls having a new room with the sliding barn door and everybody is happy.  I see nothing wrong. I was only pointing out the commenter wasn't blasting OP for being poor but that they believed the op was being a selfish parent from the beginning so he doesn't trust that the situation isn't as fine as the OP is leading us to believe.", "As I've said in other comments, she should either give up the master, or convert the playroom by putting on a door for fire safety and alarms for the balcony.", "Uhh...alarms are dirt cheap. You can pick them up for twenty bucks. If you have kids, you should have alarms. It's like socket covers or car seats. It's shit you gotta have to ensure your home is safe.", "I’ve actually never heard of people putting alarms on their front doors.", "That's concerning. Hopefully those people don't have kids.", "Locks would be unsafe for fire purposes if they're sleeping there. It would need to be an alarm system instead. If OP has already set up an alarm system, then I'll change my judgement as long as she has plans for an actual door in the works.", "I was assuming that the “without a true wall” was saying that the living room was just open into the rest of the house, not that one of the walls was a sliding glass door. Like my living has only 3 full walls including the sliding glass door. Curtains won’t fix that.", "I'm pretty sure the \"without a true wall\" bit wasn't because of the patio door, but rather that the living room was likely a more open floorplan  possibly connected to the kitchen without a wall. This is just my take on it, and I could be wrong, but that was my first thought upon reading their comment. Not all living rooms are closed off to the rest of the common living areas.", "What don’t you understand? \n\nThe second living quarters isn’t classified as a bedroom. So it wouldn’t be considered a master even though it’s bigger. \n\nGive it up already, they got the bigger room. If you don’t like it go find her a better place and pay for it", "Where tf does it say she’s living it up in some huge master bedroom? I live in a 2 bedroom house and the ‘master’ is only a tiny bit bigger than the 2nd bedroom. And it’s been the same with the apartments I’ve lived in. It’s possible her own bedroom is still small, and she saw an opportunity to give her two daughters a huge space that she plans to put a dividing wall up in down the line.", "At one point me (10) and my sister (7) and brother (6) all shared the upper loft of our house, with my parents downstairs in the living room, there were no walls (only a banister/railing) on one side, and we had curtain dividers between us to give us our own separate rooms, and my parents had a corner with some like panels to surround their 'room' for privacy. None of us kids were bothered by it, we had privacy, and it felt like a big sleepover. Parents make due with what they have at the time, and OP is doing great so maybe you should be a little more compassionate. Ultimately the mom is going to need more space and privacy than a kid anyway, and their setup is the best she can do at the moment", "Man you're embarassing yourself...plenty of people don't have alarms or socket covers. When I was a kid, our car seats came out of someone else's garbage bins. If it bothers you so much, consider donating to a reputable charity this Christmas. Even twenty bucks helps.", "The only local friend I can think of that does have alarms lives in the city, not out in the burbs like the rest of us. And she’s also the only one of us without kids. 😂 It’s just not a necessity around here.", "What's wrong with the sliding barn door? It gives you extra usable space.", "Before that, she had her three kids crammed into the small room while she took the bigger one for herself.", "That is probably true and is an assumption that the commentator is making. What I said still stands. He wasn't blasting her for being poor living in a two bedroom but for not giving the master to the kids. Maybe she did have a good reason, and her master isn't any bigger. I'm not here putting down the OP at all. I know what it's like to not have money or space.", "At one point my husband, our three kids, and I lived in a one bedroom “pool house”. It had a back bedroom the kids shared, and the old changing rooms had been converted into a kitchen and bathroom. My husband and I had our bed in the living room. After 3 years, we saved enough to move to a bigger house. You do what you gotta do sometimes.", "It's not necessarily about the safety of the area. It's also concern for the kids getting out. Sleepwalking is common in children, toddlers get out and walk off, etc. \n\nIt's not super common, but neither is SIDS or electrocution or any of the other dangers out there that responsible parents are accounting for. It's *always* a necessity to have alarms.", "Because the biggest room was a play room\n\nIf i understand correctly it's play room biggest, then the kids room then hers as the smallest", "You’re absolutely nuts. Get a life", "And the kids seem to have been perfectly happy with this arrangement. If they were happy, why do you care?", "NTA. When my parents got divorced my mum rented a tiny flat where my sister and I (18 &16) shared one room, my mum had the second and my brother (12) slept in the walk in robe she converted to a \"bedroom\"! We're all well adjusted and don't think twice about it! Do what you have to do as long as everyone is safe", "Weird that your brother expressed concern for safety because they'd be safer with a \"real door\" but no mention of the patio door that leads into their bedroom. That would be my only concern. Either way, NTA. You're making the space you have work for your family. Not everyone can just renovate or buy a new home every time they want to switch things up.", "Also you sound like a great mom working with what you have. If they are happy and safe your brothers opinion is irrelevant unless he plans to donate to a bigger apartment fund", "NTA. So it's illegal to have a bedroom without doors? Your brother is ridiculous, if he doesn't like it he can add a couple hundred a month to rent.", "Definitely don’t think u have done anything wrong.  Ur doing ur best for ur kids and it sounds like they r happy with their new room.  As long as there is no safety issue, I think this is perfectly fine.", " I just bought a 2-bedroom house, but I think I get to decide how many bedrooms there are, don't you? \n\"Fuck you, real estate lady! This bedroom has an oven in it! This bedroom's got a lot of people sitting around watching TV. This bedroom's over in that guy's house! Sir, you have one of my bedrooms, are you aware? Don't decorate it!\"", "NTA. Or if you’re one then so am I. For a long while one of our kids lived in a section of our living room walled off by bookshelves. We didn’t have another room. You do what you need to do.", "NTA since it has a window", "I was “shoved into the living room”, which had like a privacy partition for my bedroom as a kid, and I LOVED IT. Don’t worry about your brother, I thought my special room was great. NTA.", "Parents just trying to make it work aren’t assholes.  Only asshole is your brother.", "NTA Any room can be a bedroom.  \n\nOnly thing that room needed was a door.", "NTA", "NTA I lived in the living room at my moms house growing up and it was kind of annoying cus I didn’t have privacy but I accepted it and didn’t care that much. If you have the means for everyone to have their own bedroom it’s better obviously, but if you have to make it work this sounds like a great solution and your kids will understand", "Umm, just stand your ground. It’s not really an issue. You were trying to give children privacy. good.\nI lived in Denver in a 3 bedroom house. Same house next door had 14 South Americans living in it.\nPeople in Gaza don’t have anywhere to live. In india there are 8-10 per 200sg. Ft.\nThere is no legal room defined by area. Times are tough, stop procreating, and feel good about you security.", "The only concern I would have is in case of a fire. Would the barn door stop a fire as efficiently as a traditional one? Otherwise, if everyone is happy, and the room is large enough for two, NTA.", "NTA\n\nIf my brother had said something like that, I'd tell him to mind his busines. That or he can foot the bill to buy a bigger place.", "NTA you’re just doing what you have to I don’t see this as a problem.", "“Safer with a real door” is… baffling. It sounds great to me! NTA", "NTA\n\nYou've provided wardrobe closets.  You've provided a door.  Yeah, it's converted to a bedroom now.  And, importantly you mention in the comments that there *is* external egress for emergencies - that's the big one.  It's possible that at some point you'll want to upgrade to a more substantial door (and one might be required if you were, say, fostering or something, but you're not), but for now this arrangement seems fine.", "NTA tell your brother if he wants to have an opinion he can contribute financially to a bigger home.", "Please make sure the door can push outward instead of inward or sliding. \n\nPush doors are crucial for emergency egress", "I would have given the girls the bedroom and gone into the “playroom” myself. It has a balcony door so even more of a reason why I wouldn’t want my kids to sleep in that room while small since intruders * but that’s a slim chance. But overall NTa", "Blows my mind that a room has to have a closet to be called a bedroom- I don't think I've ever lived in a house with built in closets, so I wonder if all my bedrooms haven't legally been bedrooms?! \nNTA and you're definitely doing the right thing for your kids by giving them more space.", "Nta. Ignore your brother", "Nta. Brother should bugger off", "I (f) have a two year older brother and we shared a big bedroom till he hit puberty at 13 (me 11) and my parents wanted to give us each more privacy. My parents are working class so it took almost 2 years to find an affordable appartement with 3 bedrooms. \nMeanwhile I slept in the livingroom. My bed was against the wall, on one side a big wardrobe, and on the other side some bigger furniture, my desk with a larger wood panel behind and I had a curtain, no door. \nThe upper part between furniture and ceiling was open though, about 30cm.\nThey found the best possible solution they could and I didnt mind. \nNTA", "The kids are loved, safe and happy. You're making the most of what you have available, and is a much better solution especially as they get older. Your brother can fuck right off", "Just make sure the balcony is secured and they know it needs to stay locked at night", "But plenty of older homes don’t have built in wardrobes/closets and they’re considered bedrooms. Also I know of plenty of houses with sliding doors (I’m assuming that’s what a barn door is) on the bedrooms and again those rooms are considered bedrooms.\n\nNTA what you have described is a bedroom in my book. Also all it’s fine for your brother to complain - as far as you’ve said in your post he doesn’t live there. The playroom is fine for you but not your daughters?", "NTA your daughters are happy and that’s all that matters. It sounds like you did give them privacy so there seems to be no issue. They have a window and even a balcony? They now have a door? Well amazing news you are doing nothing wrong. Your brother can go complain into the void while you make your family happy!", "Brother is opinionated with no solutions. Why would you give up master bedroom if you are an adult and you need more space than 2 girls. Plus, you already planning on adjusting the room to give the girls more space. If brother is so bothered, he can give you some money to buy a new house or renovate it. They’re his nieces after all", "NTA. That’s kind of how my bedroom was in my childhood home. My dad added a door and eventually a closet when I was old enough to need it. \n\n\nYou’re fine as long as there’s at least one window in case of an emergency. Also make sure the wardrobes are attached to the wall so they can’t fall over.", "NTA\n\nSounds like a great solution.", "NTA\n\nGrowing up poor myself, we had people sleeping all over the place. Basically if there was an empty spot anywhere, that was your space for the night.\n\nYou did a great job giving your kids space. If you’re brother is so concerned about it, tell him to rent you a bigger space.", "You are doing the best you can with the space available which is great. Unless your brother is paying you child support or rent, don’t let him come in and piss on your chips", "Sparky here  Beyond closets, doors, and windows for egress, you need a smoke alarm.  There should be one in and outside every bedroom.  Legally-defined bedroom or not, please make sure there are smoke alarms in and just outside the room for their safety.", "NTA, I lived in several living room \"bedrooms\" like that I my mid-20s when we squeezed another room into a share space to save money. I loved it! I frequently miss my boarded up fireplace for candles and books, and had bay windows because it was always a front room. One had a very janky folding door, and the other had an actual door. It feels like a normal thing for people to do imo. I think the door to the balcony could be unsafe for them depending on height, safety features, etc. (unsupervised play) but you know the space best.", "I’m guessing you’re not in the U.K. cos this wouldnt even be a problem, more like an actual luxury for a lot of people! My husband actually lived IN A CLOSET at his parent’s house!\n\nNTA, your brother needs to wind his neck in", "NTA. It sounds like you have done the best thing for you family.", "NTA tell him to mind his own business", "NTA. I thought it was a closet under the stairs or something first. The only thing I would check would be that it has enough ventilation, but that is probably not an issue since it has a window?  \n\n\nAre they happy? That's the important thing :D", "So what? In Europe no bedroom comes with an installed closet, and the barn door is nice for the kids. When they're teenagers you can still install a real door. What even is this question", "NTA. They are gonna LOVE having a whole entire balcony off of their own room; the door gives privacy, and dressers exist for a reason.\n\nYou're making the most out of a tight situation and I'm proud of you, momma bear!!!", "NTA.\nI live in germany and here almost no house have closets. Everyone buys wardrobes cupboards and even a full kitchen for their rented Appartement or house. I myswlf lived in 3x4m Room. If the room is big enough for 2 kids to live comfortable then it is ok.", "Info: why would they be safer in a room with a pivoting door than a sliding door? \n\nPlease ask your brother for me because I'm genuinely curious", "NTA. How would having a closet make them safer? That's weird. The United States is one of the few places in the world where it's typical to have built in closets in the bedrooms. Many homes in Europe for example, don't have them. People use freestanding wardrobes to store their clothes. There's a window in the room to escape in the case of a fire, and you installed a door for privacy. He's being rediculos. Housing is crazy expensive right now, and you've found a suitable solution. We (me, husband, and - year old daughter) live in a one bedroom apartment right now. She sleeps in a twin bed in the corner of our bedroom. She keeps her toys and clothes in the living room. It is what it is. Your brother would flip out.", "NTA\nWoah, it sounds like your brother is a mansplaining asshole.", "You have legal and illegal bedrooms?!", "Kids sleep on the couch in the living room because their parents can’t fathom making room for them. Me. I was that kid. Fuck your brother and I’m happy your kids have you. NTA", "If you don’t pay my bills then you don’t get an opinion on how I live my life. \nWhat did your brother suggest as alternative?\nIs he paying for anything?\nYou are not the asshole.", "Info why do 2 girls get a \"non room\" while a boy gets a full actual bedroom? I'd be weird about that. Otherwise I think it's a good idea to split them up like that because it allows some semblance of privacy", "NTA. Your brother just wanted to complain", "INFO: will your place pass a fire code  inspection? I highly recommend asking your local fire department to stop by and check it out if you don’t know. The local fire code will vary, so it’s best to ask.\n\nYour brother could be right about the door, because a real door with a door jam will give your kids more precious seconds to escape in the event of a fire - as long as it’s closed. If it’s not closed it can’t protect them.  The fire fighters will know if it’ll pass code or not.", "Tell him to fuck off. They are perfectly fine in that room and a sliding barn door isn't any different from a regular door. \n\nSafer actually because it would be much harder to block them in. \n\nSome people just want to start shit.\n\nYou're doing a fine job, mom.", "Nta I grew up in a similar way with 2 brothers and a single mum but my living room was plenty of space for us", "Do u", "I loved when my dad converted the den into my own bedroom (my 5 and 3 year old brother had a room and he and his wife had the other) I hated sharing with my little siblings (I was 14). We also did barn doors and I also had French doors that led to the back patio. It was a teenager's dream.", "Nta. Everyone is struggling financially and you made a good decision for your kids for the situation you're in. Your brother can mind his own.", "NTA. Your brother is an opinionated idiot, sorry to tell you.", "If your brother would like to buy you a new house with a third bedroom,  he's welcome to an opinion.  If not,  the plan you have is perfect, and all your children are happy with it.  Uncle Bob gets no say in the decision.  NTA.", "NTA, I lived in a \"not legally a bedroom\" most of my life, its fine as long as it has storage. But I will say, if you ever tell them to go to their room. They could rightfully respond \"I have a room!\". So keep that in mind.", "Sounds like a fantastic solution to me. No point in that wasted space if they need it and you've made it private for them and set it up like a bedroom. We'll done you!", "NTA If there's a bed in there it's a bedroom and if your family is happy that's perfect.", "Unless your brother is willing to pay to expand your house or even buy you a new house then he has no place to be complaining and making you feel like you're doing something wrong. You're doing what you can in your home and it sounds like you've given them more space than they would have had cooped up in a smaller room. You're doing a good thing NTA", "Sounds to me like you did right by your kids. Your brother should shut his face. \n\nNTA.", "As a kid, my sister and I shared a bed in what was basically a nook in a hallway. It had a closet, but that was it. Our toys were out in the shed. Anyone walking down the hallway basically walked through our room. \n\nYour daughter’s setup sounds amazing. I would have loved that growing up!", "Grew up in a family with 6 kids in a house with 3 rooms. I got shoved into the detached garage. Not one of those nice modern garages....the old ones you can see the wooden frames, not insulated and floods when it rains.", "You solved all the “issues” of making it a room. The us is unique with the whole closet thing and I actually prefer having a wardrobe! As you mentioned there is now a door and it has windows. So easily NTA.", "NTA. WTF? A room is a 'legal' bedroom the moment you put a bed in it. And why would that room be unsafe? What utter nonsense is this? We are not speaking about babies or toddlers, but girls of 8 and 10, who know how to use a door, whatever kind of door that is. You don't have any more space, if brother is so concerned, he could buy you a larger house.\n\nI grew up in a tiny house. My parents slept in the living room and my bedroom had no door, but a curtain. Did this make me ill? Or unhappy? Or bad? No, I was a happy child and grew up to function to a normal adult.\n\nBrother is out of his mind.", "Built in closets are rather new in terms of housing design. For centuries, people used freestanding wardrobes.", "This is such a non issue. Like seriously? Oh my it has a sliding door. Oh noes, it’s not classified as a bedroom. I’ve had to share the same room with multiple brothers my whole childhood. Your brother needs to chill\n\nNta", "wtf is a “legal bedroom”? This had me laughing…\n\nAs long as they’re happy and they can have their privacy and fresh air then it’s all good right? “Safer with a real door” lol! from what exactly? \n\nYour brother is some piece of work. It sounds like you made an awesome room for the girls with access to a balcony no less. \n\nNTA", "NTA. If it has hs door that’s the most important part due to fire safety. That’s probably why it was not listed as a legal bed room.", "Nta, as long as they have a safe way to exit in case of fire, and there is now a door, I don't see a problem if it's big enough for both girls.", "The difference between bedroom and normal room is just where the bed is.\n\nNTA.", "NTA. Only thing i would consider is if the door gives them any privacy soundwise. When they are older they might not always go sleep same time so when the room is separated something to help muffle sound might be needed. \n\nSeparating one room from living room with closet and curtains is really common atleast here.", "NTA\n\nWhat goes on in your house that an installed door isn’t safe enough to have your kids behind it? Seriously. Why would he bring safety into this? What kind of house are you running?", "Where I live (mid sized European country) built-in wardrobes aren’t really a thing unless you live in a large house. You can get custom built wardrobes that are attached to the wall but they’re not usually a part of the house/apartment structure. If safety is an issue (little kids climbing on furniture) then you make sure that your furniture is securely attached to the wall. \n\nApart from that, houses and apartments are sold or rented with the number of rooms as a description. No one mentions bedrooms (I found that really weird at first but it’s normal here). So if you have a living room, office and two bedrooms, then it would be advertised as having 4 rooms and you do with them what you like.  Bathrooms and kitchens aren’t counted as part of the number of rooms.", "When I was first born my brother had to live in the dining room. Which had no doors and was between the living room and kitchen. No wonder he moved out so quickly. (He was 18 when I was born) \n\nLike I could understand the distain in a situation like that cause his privacy was taken away. Your situation sounds completely different they have a door for privacy and wardrobes for storage. Sometimes you have to make do with what you have!", "Nta\n\nMy 2 yr old literally has a \"room\" in my closet. \n\nBeing a single parents suuuuucks and you do what you gotta do. \n\nTell your brother to eff off", "If a built in closet is required many of the older houses in my city would not technically have any bedrooms. A lot of them don't have any closets at all because people used armoires. The barn door certainly qualifies as long as it could potentially be locked even if you don't have have lock on it.", "NTA. you work with what you've got infront of you and you gave the room has everything it needs to be usable. Well done. 👍", "Did you put your girls in that room to benefit them? From what you stated in your post it seems like you did. Unless your daughters specifically argued against this move and made logical points that you refused to listen to, you aren’t an asshole.\n\nEveryone is going to have an opinion on what you do (including your brother) without knowing the intimate details of your situation. You should also consider that his reasoning about “their safety” is dumb as fuck. Would anyone that is willing to break into your house and assault your daughters really be deterred from doing that if they were sharing a room with a 6 year old boy?\n\nYou’re a single mom working with what you’ve got. As long as you’re making these decisions for the benefit of your children then everyone else can fuck off. NTA", "unless your brother is going to buy you a house he should stfu", "The definition of legal bedroom depends on the country. Nta, but it just my opinion", "NTA. We were nine people in a three bedroom house. The youngest was in the \"den\". No closet. Dad built a bump out into the attic and put a wardrobe in there. Two boys got the basement (finished). The other two boys in one bedroom, two girls in another and parents in the master.", "The funny thing is that in the UK, that type of room is readily considered a bedroom.\n\nCan you fit a single bed in the room? Yes. Then it is a bedroom.\n\nDoes it have wardrobes? No. That's fine it's still a bedroom.\n\nWe have bedrooms as small as 2m x 2m over here and it's still considered fine", "Shocker, over here there's no \"Bed\"rooms to rent. You get rooms. We also almost never have built in closets.", "Or maybe they should be able to afford a house that has enough BEDrooms for everyone?", "We were selling my grandma’s house earlier this year and the realtor told us two of the three bathrooms couldn’t be considered “full bathrooms” because they didn’t have an actual bathtub, only a shower. Even though the showers were massive. Stupid realtor guidelines 🙄", "Until this post, I genuinely thought a closet was a wardrobe in US speak.", "I learnt in this post there was a difference 😂😂\nStill not sure I understand it but I guess everyone here uses wardrobes...\nOr at least the difference doesn't matter. Any proper and sufficient space to store clothes would be considered fair game. Toddlers sometimes only have drawers because they don't need much space...", "Yep. Both legal landlord wise and council housing solutions ‘what is overcrowding’ wise.     \n     \nFit a bed in it? It’s a bedroom.     \nCan’t also fit a standing person in there? Climb over the bed, still a bedroom. No wardrobe/drawers/shelves? Hang stuff from the ceiling, still a bedroom. Only living/reception type room in the house? Put a bed in it, now it’s a bedroom - you’ve got a kitchen and a bathroom, another non-bed room is just excessive!     \n           \nI’ve seen families happily (as in the LA are happy, they might not be…) housed with no bedroom for the parents, just a sofa bed to covert the living room every night. Considered a totally acceptable arrangement.", "And a working smoke detector :D *dead smoke alarm beep*", "I never knew there were such things as closets as a kid growing up in England.  We had wardrobes.  Never saw a closet until we moved to the US.", "I live in Europe, I'd say most of the rooms don't have build in closets, but everyone has wardrobes.", "It's a den.  It's secondary to the living room and now that it has a door it *can be closed off from* the rest of the house.  You know, like a bedroom.", "she put beds in a room\n\nits a bedroom now\n\n\"playrooms\" and built in wardrobes\" are a very american phenomenon i feel, for us (me, my siblings and all my friends) the childs bedroom was also its main play area", "I gotta say kudos to you adding a barn door instead of  hanging up a sheet like a lot of people might resort to. I think you’ve done the best you can do here. If the girls are still sharing a room when they’re older you could look into some dividing walls for them\n\nEdit: my sister was put into an unfinished room in the basement when she was a teen so my brother and I could have separate rooms. She *loved* it. More room, more privacy, zero care that it was unfinished. Kids don’t care about those nuances like adults do. Your kids will appreciate this so much more than sharing a finished room with their brother.", "That's what I thought as well. My bedroom growing up didn't have a closet or a wardrobe because it was too small. I had a wardrobe in the hallway and it was never an issue for me. Definitely NTA, this arrangement sounds fine.", "[Cries in UK tenement flat]", "That’s highly locality dependent. I Definitely recommend one in each bedroom though.", "Fuck, I’m 27 and I would want a balcony attached to my room NOW.", "I had a balcony off my room as a teenager. Ir was exactly as awesome as it sounds lol", "If any fixes were done to make it legal, you better be able to get copies or receipts of the permits.", "There's also removable window film that gives a ton of extra privacy while letting in light when you want it 🤙 got it for my kids room, it even makes little rainbows when it's sunny ☺️", "OP: I'm worried about finding enough space for my three kids in our two bedroom apartment\n\nYou: OMG I can totally relate to their balcony because my family home is enormous and I had an entire floor to myself as a kid\n\nRich people, try not to be tone deaf for one day. Please. I'm so tired.", "Tell me haunted stories!!!", "That sounds amazing!", "My sister does and I do, but she's a firefighter, so.... Also a kid I babysat for had one in a box seat by the window of his third floor playroom. It really is a smart thing and not that expensive. (As the other commenter says, though, they're not rope.)", "No no, windows are *magical things* which prevent things like my brother climbing out a 2nd floor window onto the roof just below.  Yep, definitely not possible for a kid to get out through a window.\n\nGranted, he didn't even think to do it until he saw *Dad* do it to dig us and our neighbor out of our snowed in duplex after the Blizzard of '93 in New York state, but still.  Yeah, the doors of course opened inward and it...it didn't matter.  That snow was higher than I was tall, though I was admittedly small for a 4th grader.  The only way to get out without water damaging the interior of our rental was for Dad to drop down outside from the 2nd floor.", "Us teen emos wouldn’t admit we wanted the Disney room but in black with MCR posters 😂", "Continued:\n\nThe children were on the third floor. After I moved into what would be my last bedroom in that house it was quiet for a good while, I’d say 3-4 months. Then the tapping began. \n\nIt started in my closet; I suspect it actually began at the other end of the crawl space that curved around into my closet. The entrance was on its own landing at the top of my stairs, like a cutout with carpeting and all, and a little square white door with a brass knob. \n\nI thought at first rats, maybe raccoons or squirrels; it was an old house after all, we can’t be sure there isn’t a hidden hole in the roof. We called an exterminator but there was nothing nesting in the crawl space *or* the roof. \n\nIn fact, the people that came by said they were surprised at how well organized the crawl space was (thank you borderline OCD but already severe mother) and that the previous roofers’d done a good job because there weren’t any openings that they could find despite the age of the house and how much of the original architecture still stood. \n\nAnyway, the tapping increased. It was always at night, and it would start in the closet but then it would skitter behind my bed and tap almost like in Morse code. Like it was trying to play in a way. It wasn’t rhythmic, not a song. It was a series of taps in mostly 2s and 3s, but I never got a sense of if there was some sort of reference that would mean it was some sort of communication. \n\nSometimes I would tap back, but I didn’t like doing that much because the taps would become more insistent and loud when I did. That was when I started to suspect that the spirits in the attic might be young. They didn’t have a sense of boundaries, if I tapped back that meant playtime and they were insistent on ‘playing’ until *they* were done, not me. \n\nI noticed that the more I engaged with the upstairs spirits the more bold they’d get; they began playing pranks. Their favorite was waiting until around 3 am and then whisper shouting my name in my mother’s voice in my ear. \n\nI’d shoot up in bed thinking something terrible was happening (fire, murder, biologically enhanced centipedes roaming the streets, you get it) only to find a completely dark, quiet house and no mom calling me after I didn’t respond. That’s how I knew it wasn’t her; if my mom called up the stairs for me and I didn’t respond in time, meaning .02 seconds, she would call again. \n\nBeyond that the 3rd floor kids were fairly chill, sometimes they’d move my things but they only seemingly had access to items already out. Meaning all my little tchotchkes, any hair or face products in my bathroom, pictures on my nightstand were all fair game. I didn’t mind that much, but I did get a bit frustrated when they messed with pictures of my grandma after she died. I had a bit of a telling off with them in a moment of mild hysteria and they actually did lay off. I found that surprising but quite kind. \n\nTo come back to the ghost on the second floor: when I grew up and broached the subject of the house being haunted again with my mother, she finally fessed up. It revealed a lot of why the old woman didn’t visit consistently.\n\nTurns out, that same spirit would visit my mother as well, but for her afternoon naps. My mom has a well documented history of 1-1:30 pm naps and that didn’t change when we moved. What we figured out was most of the days I didn’t get sleep paralysis were days my mom felt the presence instead during her nap. \n\nWe both agreed that while it wasn’t an altogether unpleasant experience, it felt cloying and needy. Neither of us ever figured out what that spirit in particular wanted, so the new owners as of roughly 2 years ago inherited some rather otherworldly roommates. \n\nBeyond that, the only other thing I always felt in that house was an overwhelming sense of being watched as I walked down the front path. I could never tell which of the sunrooms the feeling was coming from (I mentioned in another comment that we actually had 2, one was on the ground floor and functioned as my mom’s office). All I know is you can’t turn your back on that house without feeling eyes on you. \n\nIt’s creepy, but I loved that house. I grieved heavily when my parents sold it. It had so much personality, and it knew who it wanted to own it. Would always act up when flaky buyers came by for a viewing; weird sounds, the old intercom system would go off intermittently (it’s been disconnected since the 80s), and the same tapping I used to hear as a teenager.\n\nThe family that finally clicked has four little girls and the house seems to like the whole family. I think because there are so many unfinished lives and stories amongst long dead grandparents and children, the house itself longs for youth and innocence. It wants a big family to fill its rooms with laughter and stories. \n\nThat house may have been and still is haunted as all hell, but I’m glad it got another family to love and helped grow. It treated us right despite being a bit unique, and none of us ever experienced any actual physical harm in that house. What was scary in the moment I look back on as mostly miscommunication and japes. Just got a bit lost in translation.", "Apologies, I took myself to a movie date, just seeing this now. \n\nIt took until adulthood for my mother to admit that I was always right about the second floor in particular being haunted. She never wanted to admit it when I was little because she didn’t want to scare me. Joke’s on her, would’ve been better if she told me she was experiencing the same things. I grew up for a long time thinking I was the only one. \n\nAnyway, the first ‘incident’ I suppose you could say took place in the bathroom connected to the second floor sunroom. I was maybe 8 years old, about a year after we’d moved into that house.\n\nI had the bathroom door shut and latched, and I can be sure of that even now because every house I’d lived in to that point was within a 3 block radius and were all built roughly within the same decade. \n\nAll the doors between the three houses I’d lived in were oddly sized, original metal work and required some finagling to get them completely latched. You had to fight for that ‘click’ and I know I heard it in the bathroom door connected to the landing. Meanwhile I had the sunroom door open, but all windows in there were shut and latched. Easy to check, as they had old school cast iron turn locks at that point. \n\nI was doing kid things, messing around with my sister’s things despite being told not to. I’d been in the bathroom ~15 minutes just mucking about when out of nowhere the bathroom doorknob *turned* and the door slammed open to reveal an empty landing, then with just as much force the sunroom door slammed shut *and the knob latched into place*. \n\nI ran out of there before I could even fully register what happened. I was hysterically crying and screaming for my mom. When she came over and I told her what happened she tried to tell me she’d just closed the window on the landing below and the air current’d pushed both doors to open and shut respectively. \n\nI knew that wasn’t right, because true to my kid hijinks I’d made sure the door was latched so I would have forewarning if someone, notably my sister, was coming in. I may have been 8 but I wasn’t stupid when it came to my doing things I wasn’t allowed. \n\nAfter that I avoided that bathroom for about two weeks, preferring to do my showering upstairs in my older brother’s shower (that says how scared I was) and my teeth brushing in my parent’s room until I was eventually shuttled back into the second floor bathroom. \n\nNever had another experience like that in that bathroom but never felt right being alone in either room for extended periods. One of the reasons I moved to the 3rd floor when my parents offered to renovate for me. \n\nAnother was the extreme sleep paralysis I experienced in my second floor bedroom from age 7-15/16 when I finally moved upstairs. It wasn’t every night, but it happened often enough that I was terrified to sleep in that room. \n\nI understand that sleep paralysis can happen to anyone, anytime and is for all intents and purposes medically related. I also believe that mine was paranormal related because since moving out of *that* room I haven’t had any sleep paralysis. It’s been 15 years and I can confidently say that room and the spirits/souls caught within were the cause. \n\nIt wasn’t that the apparition (yes, just one) was scary in appearance per se, it was more a suffocating presence that sat on the end of my bed, often on my feet and always in the middle of the night (between midnight and 2am). The apparition was an older woman, I can’t describe her clothing or her face even, I just *know* she was elderly, lonely, and benign. It wasn’t that she was a figure in front of me, it was more that she invaded my dreams in a way. I only remember a kindly sort of demeanor and long salt and pepper hair, left wild mostly but sometimes it was half tied back. \n\nI suspect she or someone she loved died in that room, or both. She came to me sporadically. There were weeks that I’d sleep soundly (I later found out why) and others she would come 2 or 3x a week. Some months were particularly bad, I remember winter being a significant uptick. \n\n(Continued in another comment because I am way too verbose)", "This really does seem like an \"oh boy, time to tell everyone how amazing my rich kid childhood was\" but I'm going to chalk it up to a \"they have a balcony? Omg *I* had a balcony!\" rant heh", "Yeah this is different because she's a single mom and she's trying her hardest", "Yep.  My oldass house doesn't have central heating, just a standing gas furnace in the living room.  Not only would closing our door at night really upset the cats, but that room gets *real cold* and *real quick* when we do close it off.", "the youngest is 6, she's a single mom, a lot can happen in six years, hating on poor ppl won't resolve your problems", "This is so wholesome. Kind of creepy, but still wholesome. 💕", "I finally was able to respond (in two parts because my god the stories)!", "My cat has learned how to unlock the door. So we just leave it open. We have smoke alarms throughout the house and they are hard-wired.", "Ah. That describes our new house. It's so cold at night that we've installed a split aircon/heat pump in the bedroom, and now we do close the door.\nPrevious house was a different climate. Summer meant ceiling fan, sheet only on the bed, and sweating, so door open, windows open.", "Sorry for the delay! [Here](https://www.reddit.com/r/AmItheAsshole/s/ebgp74WQjB) is part 1, and [this](https://www.reddit.com/r/AmItheAsshole/s/Oq6z32CrP3) is part 2. Apologies for the ridiculously long comment, I can’t help sharing a lot when people ask about the hauntings in that house. Enjoy!", "umm no, it's quite literally not something you gotta have. i know quite a few people who've either fostered, adopted or had in home daycare and while CPS told them a bunch of shit they *had* to have, they never once told them an alarm system was a requirement.", "From what I know from house buying, the door and closet thing isn't a legal requirement for a bedroom, it's so you can count it as a bedroom when buying/selling a house. What's legally necessary for it to be a bedroom is an accessable window to escape from if there's a fire.\nWe refinanced my house a couple years ago and the appraiser who was coming through counted a room that previously didn't count as a bedroom simply because it had some shelves and rods put on the wall to act as a closet, even though it wasn't enclosed. Turned our 4 bedroom 2 bath into a 5 bedroom 2 bath and got us so much more equity for that little difference in technicality. OP should be just fine as long as there's a window to get out of in case of an emergency.", "NTA. Seems to me your kids have a nice place to sleep within your means? Why would that be bad? My daughter as a kid was in a den with a curtain blocking her from the rest of the house 🤷🏻‍♀️ up until a few years ago she shared a room with her brother and room dividers split up the space for privacy until we moved into a house when they were 11/8", "NTA - for me there’s no such thing as “legal room” do they have their own room? Do they like it? If so, done!", "If it has a window,  NTA.  He needs to chill.", "I would have loved this as a kid. NTA", "NTA - It was a creative way to improve your kid's situation.", "NTA. You and your children are safe and happy. That's all that matters, and your brother is overly judgemental. Maybe limit his access to your lives.", "NTA. There are windows and two doors to remove the fire hazard. I'd just make sure there's a proper seal for the barn door.  Your brother's privilege is truly glowing. Wait til he finds out that people live in studio apartments where there's no wall at all between the living room and bedroom.", "NTA.  When I was a kid I moved into a literal closet for a couple months, parents never asked me to I just thought it would be fun.  Sounds like you've given them a space with exits for fire safety and a reasonable amount of privacy so I dont really see a problem.  I'm frankly not sure why your brother thinks this is any of his business anyways.", "NTA. Speaking as a former kid, your brother is a jerk. Your daughters now have their own room and I'm sure they are very happy about that.  He doesn't know what he's talking about.", "Nta. You did what you had to for the girls. If they’re happy with it, where’s the problem?", "No definitely not the ass hole", "NTA. It's a room and it is whatever you make it and title it. My first bedroom was an old kitchen in  a former duplex that my parents bought. It didn't have the appliances but the cupboards and kitchen sink were still in he room. I used to make forts in the old kitchen cupboards. Kids don't know any different as long as they are comfortable.", "Just tell your brother you understand his concern. Then proceed to do what’s best for your family.  It sounds like you have figured it out. As long as it has a window and another way to escape it is safe.", "A room is a room is a room. A barn door is a real door. Look at how many homes have sliding pocket doors! It has a windows, walls and a door, and people sleep in it. It’s a bedroom. Your brother is being a jerk!", "NTA. It's a legal bedroom per se as long as there's an egress. Unless uncle is helping with the kids' living expenses, his opinion can just stay as that...\n\nYou're fine OP, you're making do with what you have.", "* confused in European *\n\nSoooo, a room is not a bedroom if it doesn't have a built in closet? I guess there are virtually no bedrooms in the Netherlands 😅 and isn't that what wardrobes are for?", "Home I grew up in was only a 3 bedroom because the utility room off the kitchen had a \"closet\" built around the water heater and a window cut out for it.  It was tiny and I loved it.  Mostly because if I sat just right I could see the TV in the living room even though I was supposed to be sleeping, \n\nThat's when I first saw Dracula, Prince of Darkness and became convinced my parents were vampires.\n\nNever mind they actually went outside during the day literally everyday of my life.", "The only thing he may be thinking of is safety.  Technically bedrooms need two points of egress because if a fire should happen you need a window or a second door to go out of.  Still NTA because you’re doing the best you can with what you have to work with.  But he may not be a snob so much as worrying about safety.", "I pray that brother will never ever go to Europe. The lack of build-in closets here will probably give him an aneurysm 🥺", "Closets aren’t even required for legal bedrooms in most states. Most people think they are though.", "The only possible issue I see here is that maybe the barn door isn't as effective as a fire break as a traditional door.\n\nBut, honestly, unless OP's brother wants to pay for them to rent a bigger place, then he should shut up", "Exactly. A closet is feature people expect in a bedroom, but it is not a legal requirement (where I am). Older homes frequently lack them.\n\nThere are generally size requirements and egress requirements", "It is a legal room, but, bedroom as a legal term has a closet and a door. There is nothing wrong with this room, it is a legal room. Just not for real estate listing. \n\nMy daughter's bedroom was the \"den\" with a small closet and a folding door.", ">Funny that your brother has an opinion!   \n>  \n>Maybe if he feels so strongly he should finance a new house for you guys that’s huge and has room for everyone and a guest room and God knows what else.\n\nLol what? \n\nIF OP was feeding her children garbage every day and the brother was like \"maybe you should try giving them a vegetable\", would your reaction be \n\n\"You should buy ALL the groceries for the WHOLE family and until then I *lalalala can't hear your valid concerns\"*", "We love in Denmark, none of the rooms in our house has a closet, it's all wardrobes....", "Yup. We rent our house and our landlord told us that technically it’s a two bedroom because the third room doesn’t have a closet. The third room is a small room, but has a door, window, lights, outlets - all that jazz. We used it as an office until I had our second child last year. I actually asked CPS and our local police (very small town) and they all said it absolutely can be used as her bedroom. Technically the door itself isn’t a requirement either, only the window. They have to have a way to escape in case of an emergency.", "That's really interesting about the barn doors. I never thought of that. Good info.", "We have an addition above the garage 8mx4m that doesnt count as a bedroom either. Because its over what can still be used as a garage.", "Drill a hole for a socket. Add the socket. Never connect the socket.", "Where are you, because as an electrician I can tell ya that’s bullshit right from the get go anywhere in Canada. They would consider the house not fully code compliant but an existing build is grandfathered in. And also depending on location of plugs and doorways it’s entirely possible to end up with a wall with no plugs when going by minimum code standards", "As a Canadian that is also weird to me. \nBut also, wardrobes just aren’t as common in North American. You can definitely buy them because there are lots of old homes without closets, but I’ve never owned a wardrobe.", "Yeah idk where it came from but from the legal code standpoint in the US, you can’t advertise a room as a bedroom, unless it has a built-in closet. You could still use it as one tho as long as there’s a window (emergency egress).", "Yeah, where I'm at (NYS), for a bedroom to be a bedroom, it must be at least 60 square feet, with a door and a window. That's it. That's the requirements.\n\nAccording to the brother's standards, I've lived in apartments with *no* bedrooms, since they didn't have closets in the rooms themselves.\n\nIt sounds like this mom is just doing the best she can, and she *is* making sure her kids have the space they need...and the brother just thinks he's better than her.", "Come to London, where that 2m x 2m room is your bedroom, kitchen, lounge, dining room and bathroom!", "Yeah we also don’t tend to have windows that open far enough for people to climb out of. According to Redditors in this post that’s dangerous and unliveable.", "Not just any window. An egress window. You need to be able to easily exit out of it.", "You need a legal door. Period? YTA.", "It would be illegal in some US states/cities for a landlord to rent it out as a bedroom. But AFAIK it's not illegal to use a room in your own house as a bedroom.", "If OP was failing to feed her kids, that would be a huge issue, obviously. As it is, she’s meeting all their needs for shelter, they just don’t have their own rooms. Which is fine. The comparison of “not having your own room”—especially when it’s just two same-sex siblings together!—and “not having food” is absurd. One is a luxury that’s nice to have. One is a necessity for survival.", "Wow, look at you. A person has two kids in a large shared room and somehow that’s not good enough!", "This is interesting :) In my country it is exactly the other way around: old houses have closets and the new ones do not (mostly).", "Your house is unsafe!!! Run away!!! Do you even have doors?!\n\nOP’s brother is some kind of special.", "I see way worse on this sub. People seem to come here to feel better about their shitty lives than giving genuine advice. Definitely a turn off.", "In the UK, a wardrobe is freestanding. But a built in one is a \"fitted wardrobe\", or \"built in wardrobe\", never a closet.", "“In most states”. \n\n\nWhere I live, it actually is a legal requirement.", "Inspectors will actually test each outlet and you will get a mark on the inspection for it. \n\nIt might be worth it to run wires if they ever sell the house.", "I’m in the US in Colorado. \nThe room is the basement. I have made it into a guest room, it’s right next to a half bath. I really didn’t understand why it couldn’t be classified as a bedroom, I sure use it as one for friends and family.", "Fellow Canadian here.  I just bought a wardrobe because my bedroom closet is so big, I’m turning it into an office / studio!  My bedroom is also massive and has plenty of space for a big wardrobe.  I am a bit of a minimalist, and definitely underutilized the closet.", "Based on what I've seen online...... \n\nDoes the room have a bed *and* a shower unit?  Still a bedroom....", "What's the LA", "And they have that and a door to a balcony", "It's all fun and games until boys from rival houses use the balcony to court them.", "Absolutely. As a teenager, when I'd watch any CW show there was always the lead teenage girls room that had a huge fluffy queen sized bed, either a balcony or a window seat and key, was fairy lights around the room 🤣\n\nI could not have been *more* jealous.", "My childhood bedroom had exterior facing French doors that led to a 15’ drop to concrete. The previous owners installed the French doors and intended to build a balcony or deck and just never got around to it. 🙃\n\nMy mom guarded me like a hawk as a child to make sure I didn’t open the doors and step out to death. Your comment is the first time I realized that my mom really should have installed a mesh barrier 😂", "Yeah that's mostly for real estate listing purposes, so a room without a closet is something other than a bedroom for purposes of the number of bedrooms a house is considered to have when on the market.  But a bonus room fitted with a standing wardrobe closet serves just fine.", "It's not. But to each their own standards.\nMy house has 4 bedrooms, five if you count the little cottage in the yard. It's nice now, wait until these kids grow up! Not saying OP is the asshole though.", "When my sisters moved into the basement “bedroom” there was a tall, wide bookcase as one wall and a curtain on a rod as the door. Eventually my dad built a wall and put in a door but it was a quick solution to give them their own space. Eventually as we each moved out the oldest kid would move downstairs allowing the others to not have to share anymore. \n\nIt already had a closet but did not have a window large enough to count for egress. If the new owners put one in it would be a legal bedroom.", "When you have a kid there are different things you put priority to paying for. We have a bigger house, but in a less desirable location. We could still have kids in a nicer area, but in a smaller house. There’s no wrong decision in that. It’s different for different people. Having two kids close in age share a room that’s been modified into a bedroom doesn’t mean you can’t afford different, it means you’ve made a choice about your lifestyle.", "The only thing that should affect its ability to be called a bedroom is an egress window and a door by Canadian standards. Also to be code compliant for electrical NEC is the same as CEC, starting at the latch side of the door, must measure less than 6 ft until you hit the first plug. Measured along the face of the wall. Then between plugs, can’t exceed more than 12ft measured along the wall. And the then 6 or less from the last plug to the last available section of wall that’s unobscured when the door is fully open. Any space covered by the door when it’s open, is considered unusable wall and doesn’t apply to the rul", "Local Authority.", "A whole floor which is basically an apartment is completely different from a room with a balcony.", "Where I live it's not about children, it's either a legal bedroom or it's not, and that means it has to have egress (which generally means windows, but I suppose a second door would work, just has to be accessible to the outside in case of emergency.)", "This would be listable as a bedroom in San Francisco assuming the door closes. You don’t need a closet. (You don’t even need two points of egress if you have active fire suppression, but that’s a new construction thing really.)", "So then my house is 2 bedrooms instead of 4? We have 2 built in closets in the master and 1 built in closet in my bedroom, yet the other 2 rooms haven't got a wardrobe unless you put a stand alone one", "I have a condo on the 23rd floor. My son has a room adjacent to the balcony as well. I paid for the mesh to get installed because god forbid my son who’s a busy body climbs onto the balcony unattended!! — 11 months later still in great condition!", "Absolutely agree, hopefully this will help her counter her brothers ridiculous comments though.", "LITERALLLYYYYYY. I just died. I almost bought a house once solely because it had a secret passageway to a massive side attic through a skinny door in one of the closets. The big girl side of me had to talk myself out of it because the house’s layout was horrendous (for what I wanted). 🫠", "I lived in a nearly 4000 sq foot house built in 1825 on an acres of property surrounded by woods. We were not rich. We rented & it was $1500 a month. Just because a house sounds amazing doesn’t mean it was a rich person’s house. 🙄", "God I'm glad I wasn't the only one... like a small room is completely different than a whole fucking floor which is basically an apartment. She's not rich for living in a 3 floor home, but jfc girl stfu. Wrote 3 essays.", "Some of the issues are about safety.  Like the egress….", "\"Real Bedrooms\" actually are more safe than bonus rooms, they need a closing door, smoke detectors (one inside the bedroom and one right outside it) , and 2 egress points.\n\nThese are all for fire safety. Bonus rooms are not required, and thus do not generally have these things.\n\nETA: The egress point for bedrooms is generally a window which has size requirements in both height from ground as well as width, which would not necessarily be present in a bonus room.", "I have pets, I can't even pee with the door shut", "We will also be leaving our door open- I need to hear if our kids need us in the middle of the night.", "I've moved about 20 times in my life... In that time, not a single home has had an alarm.", "No, generally not in most areas.", "Omg I don’t have kids but it is my absolute dream to give them cool spaces they can call their own. My parents rule was it couldn’t be unhygienic or permanently damaging the house but otherwise anything goes. For a long time I had neon pink walls with one white wall that all my friends would write on and leave messages. I loved it. I love the idea of giving kids that freedom and creating cool little spaces for them to explore.", "That would have been so awesome 🙁", "Man, that sounds so fucking cool. I would have been devastated too. I've got little kids now and one of their rooms has a weird 3'x4'x3' alcove halfway up the wall. No idea what it was supposed to be for. There was no electrical or cable wired to it for built-in media. There was no door attached. Just a wide open hole with detail trim around it and carpeting on the floor of it. My partner built a ladder to the opening and I painted the interior and made a cushion to cover the entire bottom of the alcove. Hung up those narrow picture rails and covered them in the kids' books. So now it's a book nook and they love that no one else has something like that.", "We put up a wall in our below ground basement, and my parents got basically a suite set up.. half bath, sitting room with a wood stove and a bedroom.  \n\nWhen I was a teenager I got to have this space once all the siblings left the house and painted one wall blood red and was able to live my vampire dream without sunlight. \n\nI will never sleep as well as I did in that cool, no window basement.", "You need to mail the current people living there & ask.", "Your a good story teller. Thanks for the read enjoyed it\n.", "Ha! You were getting up to shenanigans and she was like \"STOP THAT THIS INSTANT.\"", "Living in a 3 floor home doesn't mean your rich or even close to it, lol.\n\nBut yeah that shit was annoying. Terrible comparison.", "... and ghosts ...", "Agreed, but like.... terrible comparison. A room with a balcony isn't even close to having a whole damn apartment to yourself.", "The bonus room in question does have an exit point of a size requirement that would count (it's got a whole balcony!) I've never heard of real bedrooms requiring smoke detectors inside the room as well as outside, though.\n\nFrankly? Even without a door I'd say a bonus room with a balcony is safer in case of fire than a room with a closing door and a window you'd actually have to kick through the screen and climb through the window.", "Yeah a 9’x20’ playroom with a barn door and a balcony sounds like a fuckin sweet bedroom.", "I chortled", "I actually drop off holiday cookies to both that family and the family that lives in my grandmother’s old house about a block over. I wouldn’t say we’re friends, but we’re friendly acquaintances and I enjoy knowing they are happy in both houses and plan to stay for the foreseeable future.", "The house was big enough to have it's own servant's quarters and \"keep the peasants out of sight\" passageways. Yeah, they're likely at the very least upper middle class. Especially if the third floor has it's own \"common area\" ie living room. And a tuberculosis room? This is likely the former mountain estate of some aristocrat", "My son currently has the whole second floor to himself when his sister moved out. It’s one bedroom up there, a private bathroom, & living space with a kitchenette. It has its own HVAC system. It has a locking door downstairs. It is practically its own apartment if it had its own separate entry but it doesn’t. Only thing it doesn’t have is a balcony. \n\nAgain, we’re not rich. Hardly but this place is a lovely rental. It’s not the 1825 house we lived at. I loved & hated that house ($10,000+ gas & electric bill for the winter of 2014-2015 due to 11 blizzards that winter resulting in like 116” of snow that didn’t fully melt until July).", "Me too!", "International Residential Code IRC R314 details where smoke alarms are to be placed.\n\n[https://buildingcodetrainer.com/smoke-alarm-locations/](https://buildingcodetrainer.com/smoke-alarm-locations/)\n\n[https://codes.iccsafe.org/content/IRC2021P2/chapter-3-building-planning#IRC2021P2\\_Pt03\\_Ch03\\_SecR314](https://codes.iccsafe.org/content/IRC2021P2/chapter-3-building-planning#IRC2021P2_Pt03_Ch03_SecR314)\n\nLook, I personally believe that the bonus room is totally fine for children but the fact remains that bonus rooms are not as safe as an actual bedroom when it comes to fire safety. It could be easily modified to make it pretty close to the same level of safety.", "You're assuming they aren't *already* in the larger space. I have three girls. We moved into a place with three bedrooms...but no closets in the rooms. One room had a closet *rod* built in, the length of the (small!) room, though.\n\nI put all three in the largest room, then took one that was half the size (legal minimum size, in fact), then used the last room as a closet for us all, since we had no space for it. Later, when my oldest grew too old to actually share the room with her little sisters, I moved her into that room.\n\nIn my current apartment, with my fiancé, myself, and my younger two daughters (oldest has her own place)...I very deliberately chose the slightly smaller room for myself, even though I have a full-size bed and they have a twin bunk. I can barely turn around in my own room, with my bed and two dressers (myself and my fiancé), while my girls have space for their bed, two dressers, a desk, *and* the closet.\n\nThere is *nothing* to indicate that she's big already in the smaller room, nor that the place even *has* a \"master,\" which actually implies a bedroom with a bathroom...*not* simply the largest room!", "Yeah, but that was then. Comparing wealth and how property was used from eons ago is a bit pointless. I'm just saying I know families who have 3 story homes (they rent out the top 2) and aren't anywhere close to being rich.", "I know, I said above to others that living in a home, three story or not, dos not make someone rich or even close to it. I'm saying the girl they're replying too is foolish for comparing her whole floor to sharing a room with a balcony.", "Is this where we line up for open-cricket6994 to buy us a new house with large rooms for all?", "I know folks like that too. But I'm not speculating off of people I know, only off of the information given, and considering the size, scale, location, and age of the house, I'm assuming they're again, at least upper middle class."]}