{"id": 33139, "submission_id": "18jr3lv", "title": "WIBTA for suing my friend after she wrote a book about me?", "selftext": "\nI (29f) have a friend called “Maya”. Maya and I have been friends for nine years, after meeting at university. \n\nMaya went through a lot of mental health issues in her early-mid 20s which impacted her career prospects, but a couple of years ago she found an outlet in writing, and now writes and publishes her stories online. They are of the “spicy romance” variety. I’ve never read any of them because they’re just not my thing but I know she has a lot of regular readers. \n\nRecently, Maya shared that she had been contacted by a small publishing company which publishes ebooks who were interested in publishing one of the stories she had been sharing online. I was ecstatic for her, as it is a move towards making writing a profession, which is what she really wants. \n\nAbout three weeks ago, a mutual friend of ours “Amy”, contacted me and asked if I had read any of Maya’s current story as she had looked it up online and she thought it had some eerie similarities to my life. I looked it up and read a big chunk of it, and it was more than just similarities, it was basically a melodramatic reimagining of my life, specifically about my relationship with my fiancé, and my complicated relationship with my father. Idk how relevant this is but she also altered their characters and certain situations to make the “plot” pretty toxic. \n\nI was devastated and disgusted to say the least. I met up with Maya and asked how she could do this to me. Her explanation was that she was so inspired by my life and the things I’d told her that the ideas just came to her. I kept saying they weren’t her ideas, they were sensationalised details of my real life, she didn’t have a single original thought in the whole story. Maya apologised profusely for hurting me and that she was embarrassed by how much she had taken from life but she really loved writing the book. I told her I wasn’t comfortable having my private life aired like that. Maya said nothing in the book was identifiable as me so it wasn’t like she’d done anything illegal, and I said, well we’ll see about that.\n\nI’ve contacted lawyers and they’ve said suing her would be largely pointless in terms of stopping the book being published, but starting legal proceedings might scare a small publishing company enough to drop her as an author. I am seriously considering doing this. Worst case, I can’t do anything to stop the book going ahead but I’ve caused her an iota of the stress and hurt she’s caused me. Best case, this creepy project never sees the light of day.\n\nA couple of my friends are saying I shouldn’t sue her, because at the end of the day this is her work and an opportunity for her to make a career for herself and take her of her child, after all she’s been through. I know this could ruin things for her and I might be acting out of anger but I really think it’s justified after she betrayed my trust like this. WIBTA to go ahead with suing?", "created_utc": 1702732889, "permalink": "/r/AmItheAsshole/comments/18jr3lv/wibta_for_suing_my_friend_after_she_wrote_a_book/", "score": 283, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because by doing this, I could ruin Maya’s chance to be a published author. Also, she is struggling financially and doing this would enable her to provide for herself and her kid, after all her mental health issues. Writing has also saved her mental health and I might be ruining that for her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You're not an ah for being mad, but don't waste your time and,  more importantly, your money, on a lawsuit. \n\nYou can tell her that if she publishes the book, then she loses her friend. Also make it clear you will tell any shared friends that she will steal *their* lives to write her stories, and profit off them without ever giving them a dime. \n\nThe lawyers are half right, suing her would be pointless, I think they know a pointless lawsuit won't stop a publisher though, the lawyers just want a paycheck.", "YWBTA, but not for the reason you think. You seem so revenge-focused that you are not thinking about additional long-term damage that you may recklessly cause to yourself.\n\nThe lawyers are correct that you don't really have a case, but the threat of legal action could dissuade a small publisher from going forward. This is, however, a double-edged sword since the author and publisher can use legal action as free publicity. Also, keep in mind that filing a lawsuit is a matter of public record. A lawsuit can forever attach this book to you since Googling you will probably result in finding out that there is a trashy novel that you say is based on your life story. In all likelihood, this book won't be a hit and will pretty much just die on the vine and the most it will become will be a great conversation piece when you're older and talking about the strangest things that ever happened in your life.", "Could you contact the publishing company before taking legal action and explain the situation to them? They may hopefully suggest that she changes enough of the details so that the book no longer reflects your life.", "Streisand Effect gonna getcha. YWBTA", "YTA\n\nI wouldn't sue over this. Unless she used your name, the fact that she used your life as inspiration for fictionalized stories is fine, and you've been told you don't have a case. I understand why you don't like it. What you are considering is called a bad faith claim, where you sue in an attempt to harass, punish, or hurt someone. Just let it go.", "NTA\n\nI really don't get the bumhole votes here. \n\nIt's not her story to tell. Your other friend clear saw that the book was about you, so it's not like Maya has hidn't it that well. Chances are that others will too. \n\nWhat a major AH to expose a friend. Expose their lifestory, vulnerabilities and secrets. She knew what she was doing by not telling you in the first place.\n\nI don't know if it's the best idea to sue her, it will just attach the book more to your name and can be used as a PR.", "YWBTA for reasons everyone has laid out and it would likely backfire. I think the best way forward is to cut this friend off completely, zero details about your life. That way she won’t be able to write more about you.", "NTA but can see how some think you can be. You shouldn’t sue, but your friend shouldn’t publish this book either. All those saying oh artist take from life don’t understand that this is just straight up violating. Just imagine your personal life being broadcasted to the world and having it skewed for drama. Being that one friend already brought it up its almost guaranteed that the rest of your close friends and even family will read this book and they will know exactly who it’s about. It would be one thing if it was one life event that she used or even a few, but the fact that it’s only changing your name and is written to stir up drama to “fictionalize” is not enough. You might not have a case, but this friend is messed up for writing this book and thinking it’s ok for her to get it published.", "No judgment from me. Just wanted to say that I think it'd be a mistake to sue. No one outside a small group of people who know both of you is going to connect you to the book. If you make a big deal out of it, you will be publicly connecting yourself to the book. Sounds like the opposite of what you want.", "YTA. She should have been more upfront, but you’re literally admitting that she didn’t identify you and changed the story away from real life. Lots of writers write things based on real life and change bits. You have every right to be annoyed about it, but spending money on lawyers for something you’re not going to win, just to cause some hurt on someone isn’t worth it.\nHow many people are going to read this? Probably very few? How many people are going to know it’s about you? Probably none, or some very close friends", "The best way to let the entire world know that the book is about you is to sue her. Then everybody will believe the story is 100% true as told. in the unlikely event that the book takes off, through the magic of Google, you will be (in)famous.\n\nIf that’s what you want, then you should sue her.", "I’d ask for royalties - not sue.", "Not judging on the suing, but you should let Maya know that it is easy enough to identify that you heard about it from someone else. \n\nYou didn't read her book and come to that conclusion on your own. A 3rd party read it and knew it was about you. Maybe if she realizes you CAN and actually have been identified, she may back off.", "YTA. It’s not an “unauthorized biography,” it’s not even fan fiction (if ever there was *maybe* a legitimate legal gripe). The Twilight author sure as heck couldn’t sue the 50 Shades writer for her “erotic reimagining,” and Harry Styles hasn’t done anything about the After series. Be annoyed, but I’d say that’s really all you have.", "She would be profiting off your life. Taken from your own words to her about it. That’s incredibly wrong. And worse, sensationalizing the bad parts of your life. Using your fiance as inspiration also and making him more toxic?! Ugh. \n\nAnother friend contacting you after reading her work & recognizing it was modeled on you shows other people would too. Also shows the writer went way too deeply into your personal life. It’s creepy and invasive. \n\nHer making a profit off your life is despicable. Definitely sue. Your other friends are okay with your life being hijacked & your fiance being portrayed badly to profit her, but I doubt they’d feel that way if it was theirs!\n\nNTA.", "NTA, but I think it could backfire pretty easily, your name would be attached to the story and become public forever. Then again she's not a well known author so it could be a small news blip not many care about.", "NTA. \n\nAbsolutely persue legal action if for no other reason than to stop her doing this to everyone who confides in her.", "The fact that someone contacted you because they recognized your story means that she didn’t change enough. \n\nI highly doubt you can sue her for that but I definitely wouldn’t stay friends with her.", "ESH - Maya sucks for so many obvious reasons. Your friends suck for thinking what she did was remotely okay. You suck for trying to go nuclear and sue instantly- that's why people are thinking you're from the US lol. Best to remove her entirely from your life- or maybe you should take up writing and become suddenly inspired by Mayas life.... So inspired you have to write a book.", "YTA - the embodiments and exaggeration that you talk about are writing. Writers are regularly inspired by the people around them. Ruining her career would be a huge AH move.", "Write a dramatized version of her life and post it all over and she how she feels about your side of the situation then. She might suddenly develop some empathy if you paint her/her loved ones in a terrible light, or she’ll get really butthurt and throw a fit. Either way she gets a taste of her own medicine and you don’t Streisand effect yourself in the process", "YTA. You don't have a case, but drop her as a friend. You'll be an asshole to yourself and the legal system for pursuing this.", "YWBTA\n\nShould she have been more upfront and spoken to you? yes\n\nShould you sue her? No\n\nShe didn’t write a book about you, it’s not a biography, she was inspired by the lives of those around her.\n\nWhat will you gain by doing so, by suing her? Some money? Maybe. Is it worth it?", "YWBTA. She may have had inspiration from your life, but come on now. A complicated relationship with your fiancé and father? These are not unique to you lol. And you admit it’s altered…so like..fiction. JFC Your life isn’t that special.", "NTA and this person isn't your friend. Proceed with a lawsuit and hopefully she gets dropped by the publisher and scares off any future ones", "Have you heard the saying that there is no such thing as an original story? Writers can - and will - draw inspiration from everything that happens around them. So do artists. And musicians. Any artistic expression is a reinterpretation of something or the other through the artist's perspective. You're allowed to be angry and have feelings about this, but your friend did *not* write a book about you. She took a real life event that she had knowledge of, put an exaggerated spin on it and created a fictional plot around fictional characters. You're too close to this. Chances are, if she had done this with someone else, you might feel differently. YTA", "YWBTA\n\nHow did she betray your trust exactly? She drew on parts of your life, yes but literally changed the names and intensified the plot.\n\nAlso, why throw money away to scare her? That is so spiteful and unnecessary. \n\nSheesh you're 29. Grow up and deal with it instead of getting petty revenge.", "At the very least your owed some of the money", "She did what authors do - create characters and storylines from the people and places around them, as well as their own life. Your friends may know it was you because they know specifics about your life, but unless she has written an actual biography of your life without giving you credit, she hasn’t done anything illegal. By enhancing the story and characters and removing identifiable information, she was creating a work of fiction and you were just her muse.\n\nI’m not saying it was awesome of her or that you shouldn’t be offended or weirded out… but, take a step back and think about whether you want to ruin your friend’s dreams over this. I don’t have a judgment here because it is so very complex. You’d think lawyers could have a compromise in mind like you receiving a portion of the sales price for it being somewhat about you.", "YTA.  You want to hurt her, that’s pathetic and it makes me think that the book isn’t as embellished as you want us to believe.  That’s beyond toxic.  Beyond that, you’ve been told you don’t have a case and want to scare the publisher into ruining her career.  Double toxic.", "NAH. You're both in the wrong basically. I would come to some sort of agreement with her that she use different names, places, etc. to help with keeping some anonymity. However, art is usually derived from real life. Sometimes good, sometimes bad. And if this is truly her passion, who are you to squat and take a big dump on it because your life story is entertaining?", "Nta,\n\nShe should at least offer to give you 50% of all takings for providing the story!", "INFO: Are you one hundred percent confident it’s about you?", "YWBTA, mostly because you seem to be motivated by revenge based on…something. What difference does it make if your friend has no original thoughts? Also…Streisand effect is real", "I think suing her just to destroy her career would be an AH move. Though I do understand your feelings of hurt and betrayal.\nPlease try to talk to her again. Explain to her that she really should have told you about it and should have shown you some of her stories before publishing them. If one of your friends can identify you in her writing, who else will do? Coworkers, former teachers,... your father? Taking this any further could actually affect your life and cause trouble! \nYou could go through some of her stories and underline the parts that are too close to your life. Just give her some examples and ask her to change them. Maybe this could help her understand your feelings.\nIf she refuses to change anything, this friendship has obviously ended.", "NTA. If the lawyer things it might derail publication, and you can pay for it, there’s nothing wrong with trying. GL.", "Yta.\n\nAre you familiar with the Streisand Effect?", "YTA", "lol ego much????", "You're not the asshole for being angry, but this plan probably isn't going to help the situation, and risks making it worse for yourself.", "NTA", "YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI (29f) have a friend called “Maya”. Maya and I have been friends for nine years, after meeting at university. \n\nMaya went through a lot of mental health issues in her early-mid 20s which impacted her career prospects, but a couple of years ago she found an outlet in writing, and now writes and publishes her stories online. They are of the “spicy romance” variety. I’ve never read any of them because they’re just not my thing but I know she has a lot of regular readers. \n\nRecently, Maya shared that she had been contacted by a small publishing company which publishes ebooks who were interested in publishing one of the stories she had been sharing online. I was ecstatic for her, as it is a move towards making writing a profession, which is what she really wants. \n\nAbout three weeks ago, a mutual friend of ours “Amy”, contacted me and asked if I had read any of Maya’s current story as she had looked it up online and she thought it had some eerie similarities to my life. I looked it up and read a big chunk of it, and it was more than just similarities, it was basically a melodramatic reimagining of my life, specifically about my relationship with my fiancé, and my complicated relationship with my father. Idk how relevant this is but she also altered their characters and certain situations to make the “plot” pretty toxic. \n\nI was devastated and disgusted to say the least. I met up with Maya and asked how she could do this to me. Her explanation was that she was so inspired by my life and the things I’d told her that the ideas just came to her. I kept saying they weren’t her ideas, they were sensationalised details of my real life, she didn’t have a single original thought in the whole story. Maya apologised profusely for hurting me and that she was embarrassed by how much she had taken from life but she really loved writing the book. I told her I wasn’t comfortable having my private life aired like that. Maya said nothing in the book was identifiable as me so it wasn’t like she’d done anything illegal, and I said, well we’ll see about that.\n\nI’ve contacted lawyers and they’ve said suing her would be largely pointless in terms of stopping the book being published, but starting legal proceedings might scare a small publishing company enough to drop her as an author. I am seriously considering doing this. Worst case, I can’t do anything to stop the book going ahead but I’ve caused her an iota of the stress and hurt she’s caused me. Best case, this creepy project never sees the light of day.\n\nA couple of my friends are saying I shouldn’t sue her, because at the end of the day this is her work and an opportunity for her to make a career for herself and take her of her child, after all she’s been through. I know this could ruin things for her and I might be acting out of anger but I really think it’s justified after she betrayed my trust like this. WIBTA to go ahead with suing?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA", "NTA and personally i would raise hell if one of “friends” did that to me. Yeah fuck her career up !", "YWNBTA\nyou won't win this in court", "YTA.", "Have you ever heard of the Barbara Streisand effect?  YTA. And a dumb one too.", "YWBTA I feel this because I'm putting myself in everyone's shoes right now. See, yes suing is an option in this situation, but that doesn't mean it's the best option. It seems to be way to much and crossing the line! I feel as if you guys should talk it out, or at worst end the friendship. Try and get her to, if possible, unpublish the book and take it down. Maybe even review it with her and change details so it's not all about your life! And put up an agreement about it and how much personal life of yours is in it.", "NTA, although it may get you nowhere and lead to more issues for yourself.\n\nHonestly, I would just completely remove Maya from your life. Block her on everything and let any common friends know she is not to be told anything about you. People who cannot respect this can be blocked as well.", "I’d let her publish it then sue for half the royalties since it’s based on your life.", "I guess I'm stupid, I don't really understand the YTA responses.. while I agree suing will be pointless, you're NTA to take action. she took your personal life, stuff you said in confidence to her and wrote it for the world to see. and while not everyone will know it's you, your friends and family will. there's a chance this completely broke your trust. I don't know what you can do in this situation, I guess I'm petty, but I would try tell your friend circle what she did, and that she'll take from their life too... if she can't find inspiration and just use it as inspiration, then how is she going to be a writer?", "OP, I'm an author, and no smart author would ever do this for this reason alone. I think you're NTA for being so upset about this, but I do thing you need to look at this from all angles before going forward. Ask your legal counsel.\n\nCan you just contact the publisher and discourage them from buying the book?\n\nCan you flag the stories on wherever she's publishing and have them pulled down? I know with Amazon, they take this stuff super seriously. If your lawyer sent them an email, chances are the stories would be down within a few days. You wouldn't even need to try to sue her. You could possibly just send out emails.\n\nJust see what would be the smartest option.", "NTA.  Maya is TA, but probably isn't doing anything illegal if the main character can't be ID'd as you (I'm not a lawyer). But you may undo any anonymity currently present if you call attention to her story. Better to drop her and give your energy to something joyful that is good for you.", "YTA, artists take inspiration from the real world, including real people. You likely have no legal standing and not really any ethical standing either. If you don't want to be friends with her though, that's certainly fine.", "Agree to sign the waiver for a chunk of the royalties?  I would.", "NTA", "Agreed not to mention the publisher has more money and they can drag things out in court. If OP loses she can potentially be responsible for the legal fees of the winning side. OP needs to decide if this is the right gamble for her.", "This is known as the Streisand Effect", "Yeah, it clearly doesn't identify her and she wants to file a public lawsuit claiming it is about her. And there's no legal case.", "I’m not from the US, court records here are not easily accessible. It isn’t easy to find the information and you also have to know what you’re looking for. \n\nBut yes I admit suing might be a boneheaded move and I may need to leave the legal route alone", "This!\n\nTry to stop her without having to go through with it.\n\nTell her you contacted a lawyer. Her reputation will be tarnished and she likely will be dropped as an author.\n\nTell her you'll stop suing her if she withdraws the book.\n\nTell her to be original and create her own stories instead of parasiting on other people's life experiences.\n\nNTA", "I don’t know why they would if there was no incentive but yes, I could try doing that and will look into it. Thanks!", "Hmm I don't agree that what she did was fine, or that this is a bad faith claim. There is precedent for suing an author for basing a work of fiction off of someone's real life. Memoirs of a Geisha is an example of this. It was settled out of court so I don't know the result. But it's really not fine to take someone's entire life story and publish it as fiction of your own creation.", "She didn't use for inspiration tho, she copied OP's life and wrote it in a more dramatic way", "i think this could be fought in court. Considering I’m sure she shared these details with her in confidence and she wrote about them publicly, is there realy NOTHING that can be done because scaring off a publishing company possibly?", "This is 100% what I would think if I knew OP - I would think that the only reason OP is mad enough to bring legal action is because the details are true. \n\nOP has a right to be mad, but suing brings an air or perception of legitimacy to the details.", "Twilight isn’t based on real life though nor is fifty shades of gray a twilight erotic reimagining. It’s not about what the world thinks it’s about her friends and family. Imagine your personal life being put out for those people to read. It’s apparently obvious it’s about her when a friend could tell. It’s just violating. I don’t think she should sue, but her friend shouldn’t publish the book.", "This is a shockingly blasé response, and I’m sure you wouldn’t be so cavalier about it, if it were you. Imagine finding out that someone you considered a long-term friend was your ‘shoulder to cry on’ *to your face,* but was sharing all the darker details of your life with an actual audience of fans behind your back. It’s nothing more than a dirty form of gossiping, and it’s creepy that she would spend so much time obsessing over someone else’s life… and then try to make **money** off of it.\n\nOP, YWBTA for suing as it wouldn’t help anyone in the long run. You should contact the publishing company about the situation and stress that you do NOT consent to having this material about you published.", "I think that they’ve already learned this lesson without the lawsuit. The problem is that right now OP has anonymity outside of her friend group, if OP sues, there is going to be a distinct publicity available record of this incident and OP will be forever connecting the dots of the fact this is their life for anyone who googles their name. Let alone the fact that the publisher won’t care and Maya will probably end up making more money because people will want to see what the controversy is all about. Sure, Maya absolutely is an asshole here, but OP needs to REALLY think about what they potentially have to gain or lose by suing. The best course of action in my opinion would be to just let this go and not publicly connect themselves to it, tell all of their mutual friends with Maya what happened and how bullshit the story is and then completely cut Maya out of their life. All of Maya and OP’s mutual friends will know what happened and how Maya can’t be trusted so telling them that she contorted and dramatized the smallest detail of OPs life would also provide air cover for OP about her actual life and situation because they can just Deny everything and say it was completely taken out of context.\n\nOP WNBTA to sue if they want to, but probably has a lot more to lose by suing in a petty act of revenge than just removing Maya from their life.", "Using someone else’s story without consent and dramatizing it for profit is an AH move.", "I don’t want money. I want the publishing company to back out of publishing it so that she can’t make a living off writing a pred*tory and sexualised retelling of my life and things I told her in confidence. \n\nI understand that’s not necessarily what will happen but it feels worth a try. But I don’t know if I’m acting too much on emotion considering this could have implications for her financial stability", "The book is about her😂", "Have you heard about how your friends and family get to read about your personal life and question if what’s in the book is true or not? It’s not drawing inspiration if you write about every life event and change it up abit for drama. If OP had read a story about another one of her friends I bet she would call that friend to let her know, just like her friend did.", "It’s about the people they are around. Imagine your personal business being out there for any of your friends or family to read. I get the inspiration thing, but it’s not usually multiple life events.", "Maybe I just have my back up because *what* she derived was really offensive. Apart from the fact that she is using a variant of my actual name, she wrote a fictionalised version of my relationship in an exceedingly toxic way, using details I told her in confidence to make it sordid and gross. She wrote from my “fiancé’s” perspective and turned him into a pred*tory weirdo. This man literally paid for her to come on vacation with us because she’s my friend and she turns around and does that? And then writes about our s*x life? I feel SO vi*lated. \n\nI don’t understand how her “passion” can be writing a very f*cked up version of MY life.", "She admitted it’s about me", "lol \"revenge\"", "Luckily my father has passed away. But I would be devastated if anyone were able to identify my fiancé, whose “character” in the book is written as very pred*tory and extremely toxic.\n\nI don’t know many people who read that sort of stuff luckily but you’re right, I have no idea who could recognise me", "Not everyone is a doormat.", "She literally said the book was about her, read the post correctly dumbo", "https://en.wikipedia.org/wiki/Streisand\\_effect", "Now I wanna know what this book.", "It identified her enough that a mutual friend knew exactly who it was about.", "I think your best bet here is to drop her as a friend.\n\nThis has the effect of showing her how truly hurt you are by removing yourself from her life, and she won't be able to get any more material from you. You could also \"joke\" with  friends who know you both about how they should be careful or she might use *their* life stories for her next project.", "It could very easily become publicly available information if the person you're threatening decides to take it public. You're not the only person involved in this or the only person who would be privy to any potential legal filings.", "There is something else for you to consider. Once it becomes a court case your reason for suing will come out so then your privacy in terms of the details of the books details will be gone. Is it really going to be worth it?", "Anything can be fought in court, it doesn't mean you have even the slightest chance of winning that fight.", "You can fight anything, but you should take a lawyers advice about the validity of the legal merits of your case.", "If the court figures out you do it in order to scare the other side from doing what is entirely legal, you may end up paying their legal fees and their layers.\n\nPlus, in some court systems, looser pays even without that.", "I get what’s not to like about it, and I wouldn’t begrudge anyone ending a friendship over it. I just also happen to have a solid grasp of artistic license and a respect for the creative process to understand that thinly veiled fiction is not illegal.", "Tv and movies does this all the time - I doubt anyone got written consent from the royal family to make “the crown” and I’m pretty sure none of the profits go to the royal family either……even though it’s based on their lives.  Dramatic retelling is “fiction”…….", "Not compared to filing a bs lawsuit to ruin someone's career.", "Not really, it's quite common to take inspiration. It's not an exact copy-paste, what's the problem?", "Is it worth the risk of a larger audience now *knowing* that this book was based on your life?\n\nBecause if that happens, even if the publisher backs out, it could generate enough buzz to prompt your “friend” to self-publish, or even catch the attention of a larger and less fearful publisher who sees dollar signs in the controversy. Dark Romance is a hot category right now and all publicity is good publicity in a hypercompetitive market. \n\nRight now, the only people who can identify you in this story are people who know you intimately. Bringing this matter to a judge might change that in ways that will not please you. Think very, very carefully.", "So did she name you? If not, I can’t see what grounds you have for this at all.", "The details have been exaggerated and fictionalised, as per OP's own post. It is, by definition drawing inspiration. We can argue about the ethics of using someone else's life for your own artistic inspiration, but by that logic you're going to have to put pretty much every author on trial including Dante, Shakespeare, CS Lewis and Harper Lee. This is what writers do. Sure, OP can feel bad about it, that's their right - up to ending the friendship if they feel like it. But that's pretty much all they can do.", ">She wrote from my “fiancé’s” perspective and turned him into a pred*tory weirdo.\n\nDid you ever stop to think that this isn't how she sees things in reality, and she is in fact writing a piece of fiction? Writers often take experiences from real life and twist and warp them into something darker for their story.", "I mean, I do. She clearly thinks your life contains some juicy drama and juicy drama is fun to retell and embellish. People do this all the time - they just don’t usually *publish* their creative retellings of other people’s business.", "I'm sure you do feel violated. But unfortunately, like I said, art is derived from real life quite often. Your story inspired her to write. Yes it was not a pretty picture, but it was inspiring. So again, I think that neither of you are AH's. I do believe that there is a middle ground, where details could be altered to make it so you could still have some anonymity.", "Gotcha. Think you’re NTA, but please think of the consequences.", "Have you talked to your fiance about it? You should do it before someone else does.\nYou are not to blame for how she portrayed your relationship. But be the first to tell your fiance about this issue.", "Yes. It will be bad for her own circle, who might read the book and know that she’s connected to Maya. But take it from someone who’s got a family member whose name is attached to a publicly available case, which is on the first page that comes up when you google her: that is objectively a lot worse. She can tell her friends and acquaintances that Maya was ‘inspired’ by her life story and wrote a book bastardizing a bunch of her experiences (and especially if it’s a steamy book, I think a lot of people would rightfully side with OP that this is weird and inappropriate to base a smutty book off of a friend without their consent). But a court case? Future employers can find that. Neighbors. Distant family members. This shit can be life-ruining in different ways.", "Exactly. She doesn't have access to you therefore she loses her writing material. The best thing for you would be to drop her as a friend and let her wallow trying to actually be creative.", "You stole my line.", "That’s what I’m asking is, shouldn’t there be atleast SOMETHING you can get it for. Did she specify “this isn’t about real people” if she didn’t this may be grounds for a suing", "But there’s a difference between public and private figures. Celebrities are continually in the public eye, often benefit monetarily from their status, and there’s a preexisting understanding of who they are, so if something damning comes up about them, that’s not the only fact that people know about them. By being public figures, their actions are a matter of public concern. That’s why there’s a difference between defamation of a public figure and a private one in tort law. \n\nI’m not saying that this is necessarily defamatory; we only have OP’s perspective on how recognizable it is. I just want to point out that the royal family are punching in a whole different weight class than a random person when it comes to dramatic retellings of events.", "Its not BS, and they ruined their own career.", "Maya straight up admitted it’s OPs story she dramatized to sell books so that doesn’t hold water at all", "She used a variant of my name. But as i said, if I went ahead with taking it to court I probably wouldn’t win, but small publishers a lot of times don’t want to pay the legal fees of a court process and would rather drop the project", "It’s not about world wide anonymity it’s about your close friends and family. Her friend legit knew it was her based off the story. Could you imagine your personal life being out there for your friends and family to read and it be reimagined to be more dramatic, but your friends and family won’t know what’s true or not.", "Using the “art is derived from life” line is such bullshit. Maya stole OPs story for profit and then fictionalized it to make it sell more books.\n\nMaya is absolutely the asshole here.", "He knows.", "That's not how the world works", "They wouldn't need to pay a lot in fees because it's most likely an easy case to win, and the rumor that it's based on a true story that your lawsuit world be confirming would actually *help* sales.", "You aren't identified in the book but you're going to file a public lawsuit claiming the story is about you", "I think perhaps I don’t have a handle on what the issue is here. \n\nShe can’t be that good of a fiend to write about your life and not tell you she is, or even after she has.\n\nI’m also still not sure exactly what makes you think the book is about you? Lots of people have sex, and difficult relationships with their fathers. \n\nI don’t think you any grounds to sue, at all, but try if you want.", "You can push to have the character’s name changed to look less like yours. That’s a specific goal. \n\nI know people here are saying you aren’t identifiable, but if a friend contacted you to let you know it looks like you, it sounds identifiable", "Which is why I suggested they change the appropriate details. Again, I did not vote that OP was the AH. Maya should have spoke with OP before writing her work. But sueing her over it is extreme.", "How is it bullshit? That's an assumption she's doing it for money, even when OP explained she began to write as a coping mechanism. I also did not vote that OP was the AH. Yes I believe Maya should have spoke with OP beforehand when beginning her writing, but sueing her is also out of line.", "That's good. If he has a bad feeling about it too you need to tell Maya. This could affect not only your life but him as well. I guess she really doesn't think it would.\nThe problem is: When you make a big deal about it, even more people will get curious and read it. Whatever you do, you will lose.  You can only try to convince Maya, that you seem to be more recognizable than she thinks you are.", "Notice how she hasn’t answers any questions regarding the risk of this blowing up in her face like this?", "Not every lawsuit is front page news.", "Evidently she isn’t a good friend, but we were close for a number of years when the things in my life were going on that she later chose to write about. \n\nIt’s definitely about me, she admitted it, but even if she hadn’t it’s obvious. Everything, from the age gap in my relationship, to how and why we got together, to money/legal issues I told her about before and after my dad passed…all the same.", "OP has. OP says they don't live in the U.S. and court records are harder to access.", "She seems very toxic and petty and I think the real issue is she doesn’t like seeing that part of herself.", "Authors write about real life.\n\nNo one is forcing you to read the book.\n \nIt’s a small publisher, it’s hardly going to get a live deal.", "But your name isn't mentioned so why go through all this hassle. \n\nWhy can't you just let this go?\n\nIt's going to take time and money away from more productive things in life.", "So you'd be cool with someone writing a sexualized and dramatized version of real bad events of your life? You would eenjoy seeing that part of yourself?", "But her friends will and possibly her family and they will all know it’s about her that’s the problem.", "It hasn't even been published and someone from her life has already managed to directly link her to the book. It's not about OP reading the book, it's about everyone else. Her friends, her family, her partners friends and family. Someone at her job could read it. The entire point is that the content is not different enough to be unrecognizable.", "Well first off, I don’t have things like that in my life.  Second, nobody is going to know it was my life.  OP clearly indicates that it’s based on her life but the names are different.", "The name is one close enough that someone in her life picked out that the book was about her. It's not different enough nor are the details different enough to make this anything but a direct violation of trust and a perversion of this persons life."]}