{"id": 33152, "submission_id": "18jx7b8", "title": "WIBTA if I proposed to my girlfriend as my brother is going through a divorce?", "selftext": "So, I’ve been in planning to propose to my girlfriend on New Year’s Day in a couple weeks. I have the ring and am finalizing the when and where. My idea is with fireworks going off in the background. We’ve talked about marriage a ton and it’s more a formality at this point, we both want to get married already. Anyways, last night my brother told us that his wife told him she doesn’t love him anymore and has hated him for years. They’ve had a rocky relationship for 10 years at least so we’ve all seen this coming. So he’s moving out, getting a lawyer, and starting the process of getting a divorce. WIBTA if I went through with my plans?", "created_utc": 1702750906, "permalink": "/r/AmItheAsshole/comments/18jx7b8/wibta_if_i_proposed_to_my_girlfriend_as_my/", "score": 12, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be the asshole because I’m outshining my brothers negative situation with my happy one and it might seem like I’m rubbing my happiness in his face\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: Will you propose in front of him? \n\nBecause that could be insensitive otherwise  there is no need to delay your plans.", "ywnbta/ nah your brother getting divorced has nothing to do with you proposing, besides you’ve had these plans before he started going through a divorce.", "NTA.", "Life moves forward. So, NTA for wanting to get married in the midst of someone else having a dissolution. Your proposal won't have the entire family as an audience, likely, anyway? NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, I’ve been in planning to propose to my girlfriend on New Year’s Day in a couple weeks. I have the ring and am finalizing the when and where. My idea is with fireworks going off in the background. We’ve talked about marriage a ton and it’s more a formality at this point, we both want to get married already. Anyways, last night my brother told us that his wife told him she doesn’t love him anymore and has hated him for years. They’ve had a rocky relationship for 10 years at least so we’ve all seen this coming. So he’s moving out, getting a lawyer, and starting the process of getting a divorce. WIBTA if I went through with my plans?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, go ahead and get engaged. your brother's crumbling marriage has nothing to do with you and is 100% his problem to deal with.\n\ngood luck!", "NTA but i might give your brother a heads up so he can process his emotions privately if the expectation is he would learn about it in a larger group. \n\nJust a suggestion on how you could be more considerate but his life shouldn’t stop you from living yours. \n\nI see this type of thing often when it comes to siblings where one has fertility issues and the other is also family planning. It will be hard because obviously your brother is dealing with alot but that shouldn’t take away from your joy.\n\nEDIT: And should have included congrats 🎉wishing you an awesome new year!", "NAH. Life's rocky and I feel for your brother but that should not change your plans at all. Hopefully your brother will find in himself to be able happy for you despite his situation.", "NTA. If you want to give your brother a head’s up, that might be nice but not at all necessary. And congratulations!!! That sounds like a very romantic way to propose!!", "YWNBTA. Your life doesn’t revolve around your brother’s life! You proposing to your girlfriend shouldn’t have anything to do with him. You can give him a heads up if you feel the need to, especially if he’ll be attending this proposal, but you shouldn’t put your plans on hold because of what’s going on in his marriage/life. \n\nGood luck! I hope she says yes!!", "Nah you're chill. Hope she says yes!", "NTA\n\nJust take the time maybe to mention it to him and that you had this all planned out.", "NTA,\n\n\nCongratulations! Also, congratulations on having your guest list reduced by one.", "NAH\n\nNobody is asking you to stop living. Your bro gave you a heads up. Return the courtesy, but live your life.", "Life goes on. Nta-that said, it might be something think about as to what you plan around your bro (like you can’t blame him for being a downer if you make him best man or MC, or along those lines). I would check with him to see how he would like to be included for wedding stuff (ya never know, maybe he’ll handle it like a champ)", "Being a good bro is being aware and sensitive to what your bother’s going through right now.  How would you feel if the roles were reversed and you were the one going through the divorce?", "You wouldn't if you have been planing this then you should! You shouldn't let your brother pull you down from marring someone you really do love.", "The divorce, as sad as that is, is your brother's life. Not yours. Propose to her if you're ready for that step in the relationship. YWNBTA", "YWNBTA, but maybe consider giving him a heads up ahead of time?", "YWNBTA\n\nYou can’t stop living your life bc of things going on with other people.\n\nCongrats!", "Being a good bro is being aware and sensitive to what your bother’s going through right now.  How would you feel if the roles were reversed and you were the one going through the divorce?", "YWNBTAH. However, as a brother, I would give him a heads up. Don't need to ask him permission, but if you give him the courtesy of letting him know personally ahead of time, he can react graciously in front of the rest of the family.", "Life keeps happening no matter what is going on in your life, or anybody else's life. You can't put yours on hold to make others happy. Have your proposal and enjoy the moment. NTA", "Have you asked him if he'd have a problem with it? You're NTA either way but giving him a heads up would be kind, especially if he's going to be there too.", "NTA. I don't even understand what one thing has to do with the other.", "ywnbta at all! you can't put your life on hold , every time there will be some else in someone else's life going on. you gotta live your own life! Congrats!", "This ☝️\n\nGreat response", "This is the answer\n\nNTA", "🤣 thanks"]}