{"id": 33193, "submission_id": "18kavhi", "title": "AITA for telling my brother ‘He’s your son, not one of your history students’?", "selftext": "My brother is a History professor at one of the best universities in our country, specialized in Chinese history. He recently went on a two week long holiday with my SIL. My nephew is 19 already but two weeks alone can get quite dull so he came over and stayed at my place.\n\nDuring that time we went to the bookstore together. I bought him a copy of Frank Dikotter’s ‘Mao’s Great Famine’ after he asked me to.\n\nLater, my brother and SIL returned from their trip. My brother frowned when he saw the book. I asked him what’s wrong and he asked me why I bought his son ‘that misleading, inaccurate crap.’ I didn’t know the book was widely criticized by other historians until my brother told me so. \n\nHe was glaring at me so I got defensive. I said ‘What’s the big deal? He’s your son, not one of your students. He’s only reading history as a hobby.’ \n\nMy brother is was even more upset by the ‘what’s the big deal’ part. He said he took it as me being dismissive of him as he takes his career is a significant part of his identity.\n\nUPDATE : Just talked to my brother about it. I told him I did not intend to dismiss his career and said that I’m sorry for how I spoke to him. Told him I truly had no idea the book I bought for my nephew is controversial and was only feeling defensive. He, meanwhile, said that his initial reaction was a little bit much. So we’re good now.", "created_utc": 1702793710, "permalink": "/r/AmItheAsshole/comments/18kavhi/aita_for_telling_my_brother_hes_your_son_not_one/", "score": 487, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole for what I said to him since it came across as being dismissive of who he is.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA... at 19, nephew can read whatever books he wants, and if he likes dad can point out the inaccuracies and steer him towards some better-regarded sources.  I woud honestly think dad would enjoy talking about his subject of interest if his son is interested enough to want to read about it!", "ESH You weren't to know that the book is inaccurate (I'm assuming your brother is right), he was a bit of asshole for criticizing you about it.\n\nHowever, your comment makes no sense. Even if he is only doing it as a hobby, you still want your non-fiction books to be correct. It is a big deal if history is falsified or misrepresented. It is wrong to be dismissive. \n\nI get that you were caught off guard but you could have said other things.", "NTA and you were helping take care of his son while he took a two-week vacation.  No time to get on his pedantic high horse.  He could have taken it as a teaching opportunity with his son, discussing the book (something I'd have loved to do with my child about my field!) without saying one bad word to or about you.", "NTA.Academia is filled with people who are fragile and hypersensitive about their ideas, theories and perspectives. Many of them are irrationally wedded to their ideas to the point where it comes across as some form of zealotry. You seem to have stumbed upon your brother's fragile academic side for the first time. \n\nYour nephew is 19 and is fully capable of forming his own ideas and opinions. He does not need his daddy to be his intellectual gatekeeper. If this is how he treats his son for simply accessing ideas he is not comfortable with, imagine what he puts his students through...\n\nGood on you for standing up for your nephew's right to use his own brain.", "NTA- how were you supposed to know about the books credibility? It's not like they put it on the cover or anything. It was a nice gesture and didn't deserve for you to get talked down to x", "NTA\n\nOkay, any history teacher (or professor) who can't use an inaccurate or fabulist account of a historical event as a starting point for discussions on biases, propaganda, history as entertainment medi and greatman history and all the rest should really get more practice.  Facts are what happened.  History is how it's recorded.  Why it's recorded the way it is is important, and your brother squandered the opportunity.", "NAH \n\nEveryone is a little at fault, but there are no assholes here. \n\nYour brother's reaction was rude at best. You're not a historian, so he could have explained the problem without getting all irritated at you for not already knowing what other historians were saying about the book. \n\nYour response was a little dismissive, but it's pretty obvious that you were feeling defensive and just striking back at him after what felt like an attack on you. \n\nIn being a concerned father, he failed to appreciate your contributions as a loving aunt. In defending your contributions, you failed to respect his professional expertise.\n\nBut you both clearly love your nephew and want what's best for him, and if you didn't also love each other, you couldn't get to each other the way you did. \n\nIf this feels serious to both of you--or even just you--maybe you and your brother could have a conversation about working together to improve the way you communicate with each other? \n\nBut unless it does feel like part of an ongoing problem, then from here, this looks like two good people snapping at each other on a bad day.", "NTA your brother needs to get over himself. Theres a reason you didnt say your nephew was reading any books his father gave him.", "NTA.\n\nDikotter’s book is a fine one and accessible to everyone. It’s not exactly an academic work but it translates academic writing into something accessible.  As for the content, you don’t get to be Chair of the Humanities Department specializing in modern Chinese history at University of Hong Kong for putting out trash on the subject. \n\nYour brother doesn’t have to agree with every point made in the book but being dismissive of it says more about him than anyone else. The trait of dismissing everyone else’s work but those in your academic lineage used to be common and pervasive throughout academia. Far from promoting the idea of independent thought, it was a terribly close minded trait that is thankfully dying out.", "NtA Who picked it?", "You did inadvertently feed his son inaccurate facts. You probably wouldn’t brush off an MD who was angry that you gave his son a phrenology textbook because “he only studies medicine as a hobby”. You did nothing wrong in getting the book, because you didn’t know, but you should apologise to him, because what he heard was “historical research and rigour isn’t important for ordinary people, the thing you devoted your life to isn’t important”. If you understand why people shouldn’t read debunked science as fact, whether it’s a hobby or not, then you should understand history is the same.", "YTA, I also just read history as a hobby but reading falsified history is dangerous, regardless of the reason one is reading it for.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy brother is a History professor at one of the best universities in our country. He recently went on a two week long holiday with my SIL. My nephew is 19 already but two weeks alone can get quite dull so he came over and stayed at my place.\n\nDuring that time we went to the bookstore together. I bought him a copy of Frank Dikotter’s ‘Mao’s Great Famine.’\n\nLater, my brother and SIL returned from their trip. My brother frowned when he saw the book. I asked him what’s wrong and he asked me why I bought his son ‘that misleading, inaccurate crap.’ I didn’t know the book was widely criticized by other historians until my brother told me so. \n\nHe was glaring at me so I got defensive. I said ‘What’s the big deal? He’s your son, not one of your students. He’s only reading history as a hobby.’ \n\nMy brother is was even more upset by the ‘what’s the big deal’ part. He said he took it as me being dismissive of him as he takes his career is a significant part of his identity.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta\n\nYour brother seems to be under the influence of pro-chinese/ccp propaganda and exposing your nephew to other viewpoints will be good for his critical thinking skills", "YTA\n\nI'm a history major, and Dikotters work is extraordinarily biased. \n\nAnd the fact that your brother is a history professor who specialises in Chinese history, and you just happened to buy a book for your nephew that is a extremely biased piece of anti-chinese literature seems awfully convenient to me.", "YTA and calling bullshit on this. Your nephew takes an interest in the very subject his father teaches and, while staying with you because he is supposedly bored, you buy him a book known to be problematic and dismissed by most in the field. And we are supposed to believe 1) a 19 year old was getting bored while his parents were away and 2) he innocently chose this book and you were none the wiser about its content? This isn't passing the smell test.", "Eeeh... On the one hand, at 19 I'd assume the kid has critical thinking and he can read what be wants and be critical of it on his own, but on the other saying \"what's the big deal?\" about a book your brother told you was inaccurate and misleading _is_ not only incredibly dismissive but can almost sound alarm bells for someone who really cares about history. You wouldn't say \"what's the big deal?\" about a book that claimed the holocaust didn't happen. Extreme example, sure, but it can feel like that.", "NTA.  It sounds like your brother is a bit of a jerk who has never heard the phrase 'teachable moment'.  My degrees are in history (BA/MA), and I had more than one professor who assigned flawed books (Guns, Germs and Steel, anyone?) because it's a useful pedagogical exercise.  Learning how to evaluate your sources is an important part of any education, but instead of turning this book into a conversation with his kid, he turned it into a fight.", "YTA\n\nYou said \"what's the big deal\" about distributing misinformation to a historian and wonder why he gets mad.... clearly you need to study history some more", "ESH. Everyone dogpiling on OP for trying to feed his nephew anti- Communist propaganda (which some are inferring to be anti-Chinese, because obviously both are exactly the same) should notice *the nephew picked up the book out of their own volition*. OP acted defensively but he was being called out for something he never did.\n\nThat being said, the retort was hurtful, if spontaneous. Both brothers should try to find a common ground with each other after the fight.", "NTA. You weren't commenting on his career, you were commenting on his son reading a book you thought he might like. Everything isn't about him.", "ESH. You werent to know the reputation of Dikotter and the book. So your brother shouldnt have had a go. But your statement about reading history as a hobby and calling it not a big deal will have rightly pissed him off too. \n\nNone of this is the end of the world though tbh", "as a historian it can be incredibly frustrating when you care so much about exploring the truth and sharing it with others to see them latch onto something inaccurate or sensationalised \n\nI feel for your brother but I do think he went about it the wrong way\n\nI also think you were wrong in your dismissivneess. Even as a hobby it's important to try and consume accurate sources\n\nYour brother would've been better off offering to provide his son with some better books or suggesting a follow up book to contrast the book he takes issue with\n\nESH", "NTA. People buy books as gifts often in my family. Seeing as he is questioning the content of the book, he as a history professor should bd able to talk to his son and give him context, sources and suggestions of further reading if his son is interested in it.", "YTA - You bought your nephew a book about a contentious area of history without checking reviews or with your brother, an expert in that area. Even though your nephew isn't a history student, it's still important that he's not mislead. It's not surprising that your brother thinks that misleading people about history is bad, and it was rude to be dismissive about this. Parents want to protect their kids from misleading information, and by giving your nephew the book without reading reviews or asking you lost the best opportunity to check it was okay.\n\nThe thing that tips this over into asshole territory is that you seem to think your brother's interest in history is purely for his job, and that this makes it unimportant. Anyone who's achieved a position like his will have dedicated his life to studying history, because he believes an accurate understanding of history is important (not an unreasonable position at all). Your actions not only risked harm to his son, but also disrespected your brother's values.", "YTA, reading history as a hobby doesn't mean you should read inaccurate texts. I personally Google books before gifting them to people to know if there's anything like that that I should be aware of", "YTA, simply because there is so much missing information.", "NTA, but also YTA, so he shouldn't have come at you like that, but your response to him pointing out its inaccurate and bad history was stupid.", "That professor seems to be the stick up the butt kind.. Im sorry for his actual students", "NAH, seems like the situation was resolved through normal communication.\n\nThat said, it’s generally a good rule of thumb not to buy gifts from someone else’s hobby. And this is sort of a similar situation. It’s just too hard to guess what makes sense when the recipient (or here, their dad) has so much specialized knowledge.", "YTA for spreading misinformation. \"Being unaware\" is exactly the problem.", "19 and no parents for 2 weeks..and he comes to you because its dull. something is wrong with him 😂😃", "An arse isn’t right. \n\nYou’re an idiot. \n\nYou’ve got an expert in his field teaching you something, and your reaction “Yeah, who cares. I’m right as long as I think I’m right.”.\n\nLet me guess, your favorite cap is a red one?", "YTA.\n\nThe kid isn't reading history. He's reading revisionist nonsense. You're pissy because your gift (through no fault of yours) is a poor one. You are in fact being dismissive of his expertise. I don't know what the whole \"he's not your student\" has to do with anything. Are you saying he should encourage the kid to teach himself bullshit?", "Cn I ask a bit of a fucky question please? What nationality is he? From what I can see the book is accurate although not a solid argument against hat happend. It's got some good anecdotes about maos crimes.", "Neither. Your brother shouldn't have gotten so hissy, but I also understand that you wouldn't want your child to read misleading books", "NTA. If it was actually important to your Brother that his son have a balanced knowledge of Chinese History, rather than Just using IT as a Hook to make Drama, He would have a) noticed YEARS earlier that the Boy has an interest in Reading about History for fun, and b) taught him, even without any particular interest, the Basic Milestones of History and how Propaganda/\"misleading\"ness in popular books, tends to Work.", "Yeah, this is an opportunity for the dad to nurture the interest in the subject. It’s a chance for them to talk and share in the interest. It doesn’t have to be done in a way that shits all over him for “doing it wrong”.", "What kind of weird family goes and buys a Chinese history book without asking their Chinese history professor uncle what the best book to buy is?", "That is true. I should have said something else. I’ll talk to him and apologize.", "It’s not incorrect though. The brother is the AH. This is an academic squabble spilled over into real life.\n\nDikotter is a well known and well respected historian with expertise on modern Chinese history.", "Being mad at someone for giving a teenager an inaccurate history book is not pedantic, teaching people false history is bad. I feel like the tone of this thread would be very different if he gave the kid a book on creationism for example.", "That book is extremely biased. The brother's reaction is not fragility, it's acadmic objectivity.", ">Your nephew is 19 and is fully capable of forming his own ideas and opinions\n\nBut does OP really need to propagate the intellectual fight from the brother office to the brother dinner table? Why not choose another subject?", ">Academia is filled with people who are fragile and hypersensitive about their ideas, theories and perspectives. Many of them are irrationally wedded to their ideas to the point where it comes across as some form of zealotry. \n\nBy the way, the Kurt Cobain episode in the Simpson is very good at showing the disconnect between academia and regular people. It foreshadows very well the anti-intellectual part of Trumpism.", "I can tell you something about this book, only people who criticize it are communists in academia. It's rare to find any real criticism of this book that doesn't boil down to \"I don't want people to think badly about ideology I blindly believe in\"", "My nephew.", "This is only if you take OPs brothers word as truth that this is inaccurate.", "I think this is more ESH. OP wouldn't have pushed back so defensively if their brother hadn't shocked them by going straight for the attack. \n\n\"Interesting subject, but unfortunately that particular book is heavily biased and inaccurate in a lot of key areas - I can recommend some better ones if you like\" would likely have gone down a whole lot better than \"Why did you buy that misleading, inaccurate crap?!\"\n\nBecause it's not like OP bought the book *knowing* it was bad. And they also can't check with brother every single time they buy a book. \n\nThe immediate interrogation and blame is futile - and pretty damn ungrateful, given that they've looked after his son while he was away.", "You’re right. I should have thought more before making my response.", "Accept it's not falsified history, just commies don't like hearing about atrocities people with the same ideology committed", "I’m unsure how I feel about your comment. The book can be accused of making an overly aggressive (and exaggerated case) against Mao, but being anti mao is not the same thing as being anti China", "If he wrote that Mao was a dumbf\\*ck who implemented policies that caused massive famine and untold deaths, then it is right on point.", "A better response would be to take this as an example of whether or not brother has encouraged critical thinking. \n\nIt's okay to read something, listen to others' opinions and then fuck off and form your own opinion.", "Biased how? Many would argue that opposition to Dikotters has more to do with political groupthink in academia and apologism for a certain ideology than anything else.", "glow harder baizuo", "Just admit you're pro-commie and that's why you don't like it lmao", "I don't know. I was a profoundly boring and nerdy 19 year old who would absolutely 100% get bored at her aunt's or uncle's house. Also, the kid might be familiar with the subject but it sounds like OP isn't. It's also possible they just saw something that looked like it was about China and grabbed it. It seems plausible to me.", "None of this sounds unusual to me. I'm not even sure what you're insinuating.", ">the nephew picked up the book out of their own volition\n\nWhich has nothing to do with a will to cause trouble after being shunned from a vacation. It is just a coincidence. Promised.", "It's not contentious. Only people who criticize it are communists who don't want to admit people with the same ideology committed awful crimes against humanity.", "It's not inaccurate. Only people who don't like it are communists who don't want to admit Mao committed atrocities", "It's not inaccurate though, OP's brother is just a commie who doesn't like a book criticising Mao's regime", "Nothing’s wrong with him. He doesn’t party or anything like that and just gets lonely. That’s all.", "It's not inaccurate. Only people who don't like it are communists who don't want to admit Mao committed atrocities. If you look into any criticism regarding this book it's \"pls don't read about things people with same ideology as me did, I swear it's not true, pinky promise\"", "Plus I’ve found that not particularly accurate books are sometimes the best jumping off point. Horrible histories is a great example because they aren’t always the most accurate but they give you a good starting point and are engaging enough to spark your interest in the subject enough to go and find out what they got wrong", "That book is amazing.  This was his first book in The Peoples’ Trilogy, it is the easiest one to read and it brings that period to life and the horror and incompetence that took place.  I’m sorry but I bet Frank  Dikotter has more awards and is a more respected historian and teacher than your BIL.  Plus he was granted access to survivor’s of the Great Famine and  a lot of documents kept by the Chinese Government.  At that time he was the only Western historian granted access to those documents.", "Why wouldn't they ask an expert on the subject what book to buy? How many people have an uncle who is an expert on Chinese history? Something is very off here.", "The one who knows said professor uncle is away on vacation, potentially in a completely different time zone, and probably doesn’t want to talk about work?", "hang on because frank dikottir is a well respected scholar in the field and the book is excellent, though it's a harrowing topic. you likely touched a nerve of professional jealousy or at best, political propaganda. the CCP is very active to this day in academia all over the world trying to whitewash china's past.\n\nI think you should buy a copy for your brother too, perhaps he could act like a history teacher about it?\n\nNTA", "This book is far from inaccurate.  The research was meticulous and he had access to documents that no other Western historian had.  Plus everyone knows how corrupt the Chinese government is and how writers tow the party line.", "Yup. Fragile professors showing their true colors.", "Sorry, I teach history of a region that a ridiculous amount of propaganda and fake history is published about, so I just kind of expect that to be in the misinformation stream.  Creationism isn't quite the same since anyone who pays attention and has a brain knows it's nonsense, but East Asian history is not as widely known outside of East Asia.  My field is one where people think they know what's going on because it's always in the news, but as we all know, news is not exactly a reliable or accurate and unbiased source of information. Going to a bookstore or looking at bookstore websites is a series of nope, nope, nope, nope 20 times over and then one yep and then back to the nopes series. Being at dinners or parties where current events are being discussed are another series of nopes and even fewer yeps that I usually keep to myself unless directly asked, and even when asked, I don't lord my expertise over people like that. I'd never rebuke someone outside the ivory tower who doesn't know my field, which like OP's brother's also requires time overseas and study of languages most people in my country don't know, for not knowing which book is good history and which one is bad history.  But then, I'm not too fond of the general pomposity of the ivory tower esp. after being trained and courted for jobs at the kind of university where he teaches, so the brother is just the type to get on my last nerve for being so condescending and nasty about it.  I'd never speak to my sister like that about anything.  There were so many other ways to handle the situation that didn't involve dissing his sister.  He's the father after all, and will have ample chances to discuss what's wrong with the book with his son outside the hearing of his sister.", "This is a book that was written by a well respected historian and where some historians disagree with some of his conclusions.\n\nThis happens with almost any publication by an academic. \n\nTo liken it to creationism is hilariously naive.", ">an inaccurate history book\n\nIt seems that the book is so much inaccurate as it is the subject of a fight between different schools of thought.\n\nBut OP was TA for obviously stepping on her brother toes. I am pretty sure that the son chose that book as a way to pick on his father, btw\n\nAnd the brother is an AH for going vacation without his son. He is just not TA in the precise situation we are judging here.", "I have a PhD from an Ivy League university and I know a thing or two about \"academic objectivity\" and how it is being misused. Let's just agree to disagree here.", "It's fragility about academic objectivity. And mostly about molding his son into his ideas with no external opinions to confront his.\n\nI don't know the first thing about China's History or this book. So my opinion isn't directed by anything other than the principle here.\n\nComing across a book that's full of shit, even if it truly is, isn't a big deal. The dude's 19. His dad is a History professor. He can form his own opinion about it and consult other sources of knowledge. Dad's just pissy that he had mere *access* to an idea he doesn't approve of and wasn't in control of. That's fragility about academic objectivity, about his own perception/opinions, AND about raising and controlling his son.", "Why are you telling me this? It's not relevant to the conversation as a whole and definitely not to what I said. \n\nOP's brother may or may not be a communist, but that had no bearing on whether he's a concerned father or whether it was reasonable for him to expect OP to know about the criticism of the book within academia.\n\nOr am I just supposed to clutch my pearls and say, \"Oh, no! A communist! He must be evil!\"?", "Your hands are clean.", "Dikotter has a very bad reputation, I'm not taking OP's brother's word I'm taking the word of many experts.", ">Because it's not like OP bought the book knowing  it was bad. And they also can't check with brother every single time they buy a book.\n\nI mean, maybe avoid the brother area of expertise?", "A fair point, but I'd say that a man who has spent his entire career writing grossly inaccurate \"histories\" of China may have a bit of a chip on his shoulder", "That’s exactly what he wrote.", "This is a fair point, but sometimes there isn't any value to be gleaned from a book. Sometimes a shit book is a shit book. But regardless, I think the most important part here is that OP went out with his nephew and specifically bought a history book on the exact same field of study his brother specialises in, and the book just so happened to be one that is well known to be very biased. That's too much coincidence to me.", ">I'm not even sure what you're insinuating.\n\nThe nephew was mad about not being invited to the vacation and triggered his father by buying the very book his father keep rambling about on the dinner table?\n\nI mean, if my sister was an expert about COVID-19, I would not buy her son a random book that seems to have a strong opinion on COVID-19, I would let her handle that subject...", "Unless we get any extra information from OP, I am only basing my comment on what we have, not what I suspect or wish that happened. Promised.", " He's the father after all, and will have ample chances to discuss what's wrong with the book with his son outside the hearing of his sister.", "Because they were in a book store and saw a book that looked interesting. It’s not complicated. It’s not like book stores keep experts in every subject on staff, and they probably didn’t want to bother texting him to ask. \n\nAlso, it’s not the uncle who is the expert, it’s the father, so what’s very off is your reading comprehension.", "Nah the sister was trying to pull some shit. She knew exactly what book she bought.", "The book is legitimately controversial among academics and attracted a lot of fair criticism.", "And yet, a quick scan of peer reviewed publications where there are reviews of it show there is \"controversy\" in the non-dramatic academic sense.", "One of the top comments in the thread says contrary to you…. So sounds like this is a matter of bias than pure false history. Sure, it’s a controversial book but Someone else equated this to spreading books about creationism. I wholeheartedly disagree if the guy has a degree in the field and taught Chinese history at university of London; he isn’t some unqualified right wing pundit writing books (ie Ben Shapiro). There are other Chinese authors who have claimed similar amounts of read as this one, so this really seems to be more a historical biased analysis than complete “fake news”", "He has really good reputation, what the fk are you talking about. Only people criticizing him are communists.", "Maybe, but on the other hand, if your nephew suddenly starts wanting to take an interest in his dad's work, you encourage that, right? You don't say \"we'll wait another two weeks until your dad gets home and then we'll check if it's an okay book\" - not when the nephew is for all intents and purposes an adult.", "So he was spot on with the truth.", "Another iteration of the \"cheap speech\" argument against ideas and perspectives that one disagrees with. Funny how postmodernists suddenly claim the mantle of objectivity when it suits their interests. Biased this biased that. Smh.", "It just seems like too\nMuch coincidence that, a person who doesn’t know much about history bought the wrong book? And they’re TA despite very adamantly letting us all know that they did make a mistake in the comments. Now I’m seeing that other harmless comments made you angry enough to argue", "Would you mind pointing towards a review or source that describes the controversy?", "I wonder if a book about the worlds' second most controversial country's many historical mass killings would be controversial. hmmmm...", "Sounds Like Brother perceives it as the worst possible books a layperson could read as a introduction to the subject, but If he feels that strongly about it, He could, and SHOULD, have told both his teen son and his middle-aged sibling THAT He disapproves of it and a very short/simple explanation of WHY, BEFORE it came Up.", "Are you a chinese historian? Aren't you curious why one Chinese historian might think another's work is inaccurate?", "Nice word salad analysis bud, but I am far from the only one who critices Dikotters impartiality. \n\nI'm also not a post-modernist, so go off king.", "Not in a single place. By legitimately controversial I simply meant that qualified people will disagree, not necessarily that there has been a dramatic public controversy about it. There are journal reviews out by Felix Wemheuer, Cormac Ó Gráda and Timothy Cheek that I think taken together will give you a pretty good idea of its strengths and weaknesses.", "You are the one imputing ulterior motives to an academic who doesn't think much of the book, now you're saying the book is obviously controversial. What's your point here?", "Because a Chinese historian is going to tow the party line otherwise that historian would be arrested.", "Jump straight to ad hominem insults, eh? Proving your fragility again and again. Btw, using \"word salad\" as an insult is offensive to those with mental illnesses. Have you been skipping your sensitivity training sessions?", "Cheers, I'll have a look.", "10/10 wholesome af reddit exchange.", "my point is that OP is not an asshole.", "Ad Hominem, hey? Which did you find more insulting? Was it \"bud\" or \"king?\"\n\nAd hominem would be telling you to fuck off back to reddit with your debate bro ass response, but since I'm here too, I'll have to give that one a miss.", "They are not using ad hominem to make their point. That would imply they were rejecting a point you made. \n\nYou made no point but nonsense.\n\nThey are just laughing at you. There's a difference.", "You might want to consult a dictionary about what \"ad hominem\" actually means. And no, I am not insulted. Rather, I am just amused by your inability to defend your position in a rational and reasonable manner. But hey, I've seen this fragility too many times.", "May I suggest consulting a dictionary about what ad hominem means? Thank you for the lecture, but no thanks. Going to drop your course.", "Don't waste your time arguing with someone who openly defends communist propaganda, it's a waste of time"]}