{"id": 33201, "submission_id": "18kenw8", "title": "AITA for not wanting my husband to drink anymore after he ruined vacation", "selftext": "My (f30) husbands (m27) drinking ruined our vacation\n\nTLDR Husbands (m27) drinking ruined our vacation \n\nHusband and I (both almost 30) went on our first vacation together in 5 years. Wed been saving to buy a house the past 5 years and haven’t had extra money. We’re staying in an uoscale resort. \n\nHusband wanted to get a drink or two at the hotel bar. Husband wouldn’t stop drinking when I told him he was drinking too much. Some guy got upset with the bartender (nothing to do with us) husband drunk and stupid for mad and wanted to fight the guy. We had to leave the bar. We went back to our room and he went on the balcony to smoke a cigarettes (which you’re not allowed to smoke on the balcony or in room of course) it’s midnight and he’s yelling and being completely belligerent wanting to go back to the bar and fight. I repeatedly tell him he can not be outside yelling and loud because other people are sleeping. He yells he doesn’t give a f and to f all these people. I get him back in the room after almost 30 mins. He’s still loud and raising his voice in the room. Again I tell him other people are sleeping and we can get kicked out for being loud. He tells me he doesn’t care and we can just sleep in our car. He also tried to leave the room to go to the bar to fight and kept treating to drive. Then proceeded to get mad at me because I had enough of his behavior and called his parents to talk him down. After another hour he finally went to bed after being rude to me.  \nHe woke me up at 4am because he was throwing up sick and too hot. Pacing around the room and going on the balcony. He’s been throwing up for the past hour and now passed out on the bathroom floor. This has completely ruined our vacation and before this all he wanted to do is get alcohol. He even stated the only fun he’s had on the trip was going to the bar. Ive tried to talk to him before about him having a drinking problem and he is in complete denial.", "created_utc": 1702809479, "permalink": "/r/AmItheAsshole/comments/18kenw8/aita_for_not_wanting_my_husband_to_drink_anymore/", "score": 248, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I want my husband to stop drinking because his drinking ruined our vacation and it could be perceived as being an asshole for wanting a grown adult to quit drinking.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. I have a huge pet peeve with people who inconvenience others with their drinking. I too would request that there be no more drinking after that incident and have a real talk about the need to drink that much, why he was acting that way, and why he thinks that's okay.", "Does he typically drink himself to this point?\n\nNTA", "Nta.\n\nYou need alcoholics anonymous to learn how to disentangle yourself from his addiction. \n\nI'd put a hold on buying that house. Money in the bank can theoretically be drunk away but defaulting on a mortgage (if this continues to spiral and he then loses his job or something) will ruin you in the long run.\n\nYou should also give serious thought to the questions \"if he refuses to address this, can I stay?\" And \"if I need to leave, what is the safest method for me to do so?\"\n\nDon't be afraid to consult a lawyer or two in your local area about what divorce would look like for you. Many have free or reduced cost first consults, there is no obligation to go any further and it is better to be informed about the reality of your options than fumble around in the dark.", "He's an alcoholic based on your comments. You say he freaks out if he can't drink - this is too big of a problem to solve by you asking him not to drink. It's already disrupting your life and it's just going to get worse if he doesn't get help. Obviously NTA but you need to open your eyes for your own sake. You are married to an alcoholic, who at this point, does not want to change. What are you going to do about it? \nAt this point he doesn't believe he has a problem. But you know better.", "is this the first time that this has happened? does he often display violent & aggresive behavior? he sounds like an alchoholic. you would not be the asshole if you asked him to never drink again after that experience.", "This drinking is a big problem. Drinking ANY amount on a regular basis is a problem. Relying on drinks \"for fun\" is a problem.\n\nI personally witnessed how much of a slippery slope it is, and how drinking destroys families.\n\nGet your husband out of this habit, whatever you have to do to achieve that.\n\nNTA", "NTA. Unfortunately, he may be an alcoholic. Alcoholics often deny they have a problem. They lie, they manipulate, and they do whatever they can to keep drinking. You cannot reason with them. You cannot make them get help. You can only look out for you. You should seek some support from a group like Alanon.", "NTA If he continues to drink, I wouldn't stay there.", "Holy wow, this is NOT stable. I would think twice about buying a house with somebody who exhibits this type of behavior, drunk or not. I personally wouldn’t feel safe in a situation like this.", "I've been with two alcoholics. One was completely dysfunctional, the other would be considered \"functional\" because he still paid his taxes and went to work on time. NEVER AGAIN! Alcoholics of any type are energy sucks. They drink to avoid dealing with their problems and it always ends up falling on the sober person to manage their shit for them. DO NOT reproduce with this guy until he deals with his addiction and the personal problems this stems from.", "Nta. \n\nHold off on buying that house with him. He's gonna blow up his life. It's surely inevitable. Do you want him to blow up your life, too? Is being with him worth years of the multifaceted misery of marrying a belligerent alcoholic in denial?\n\n-daughter of a belligerent alcoholic in denial.", "NTA, anyone who gets belligerent when they drink should never drink because that’s probably one of the ugliest personalities one can have.\n\nAlso, sounds like an alcoholic.", "NTA. Even just the part where he wanted to fight some guy in the bar is unacceptable. Based on the story, and your other comments, your husband sounds like an alcoholic.\n\nSo yeah, telling him he shouldn't drink at all anymore is the right thing to do. The issue, as you well know, is getting him to see that he has a problem.\n\nThe solution might have to be as harsh as saying \"if you can't see that there's a problem, then we need to take a break.\" But don't listen to me, go get professional advice.\n\nAnd good lord, I can only imagine how it felt to hear that the only fun he had was at the bar. I'm so sorry you have to deal with this.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (f30) husbands (m27) drinking ruined our vacation\n\nTLDR Husbands (m27) drinking ruined our vacation \n\nHusband and I (both almost 30) went on our first vacation together in 5 years. Wed been saving to buy a house the past 5 years and haven’t had extra money. We’re staying in an uoscale resort. \n\nHusband wanted to get a drink or two at the hotel bar. Husband wouldn’t stop drinking when I told him he was drinking too much. Some guy got upset with the bartender (nothing to do with us) husband drunk and stupid for mad and wanted to fight the guy. We had to leave the bar. We went back to our room and he went on the balcony to smoke a cigarettes (which you’re not allowed to smoke on the balcony or in room of course) it’s midnight and he’s yelling and being completely belligerent wanting to go back to the bar and fight. I repeatedly tell him he can not be outside yelling and loud because other people are sleeping. He yells he doesn’t give a f and to f all these people. I get him back in the room after almost 30 mins. He’s still loud and raising his voice in the room. Again I tell him other people are sleeping and we can get kicked out for being loud. He tells me he doesn’t care and we can just sleep in our car. He also tried to leave the room to go to the bar to fight and kept treating to drive. Then proceeded to get mad at me because I had enough of his behavior and called his parents to talk him down. After another hour he finally went to bed after being rude to me.  \nHe woke me up at 4am because he was throwing up sick and too hot. Pacing around the room and going on the balcony. He’s been throwing up for the past hour and now passed out on the bathroom floor. This has completely ruined our vacation and before this all he wanted to do is get alcohol. He even stated the only fun he’s had on the trip was going to the bar. Ive tried to talk to him before about him having a drinking problem and he is in complete denial.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "nta. ~~potential compromise is maybe a hard limit~~ (unless this is a pattern) but yeah i think he blew his chance to show he can handle his alcohol and show self control. at the end of the day he put you in a stressful situation and embarrassed you in public. if he had fun at the bar it was at your expense.\n\nedit: from other comments it looks like it’s a pattern, although this time this it was much more public it seems? i think in that case it’s more than fair to not want him to drink at all anymore. it’s so tough, stressful, and irritating having to be responsible for helping someone when they drink themselves to that point.", "The fact he behaved in a way that made you uncomfortable and sad means you are NTA for telling him his behaviour is unacceptable when drunk and he therefore shouldn't drink.\nYou describe a person with an unhealthy relationship with alcohol and giving it up might be the only solution. Good luck.", "NTA. Sounds like your husband needs to put down the bottle and pick up a clue. You deserve a better vacation than what he gave you, that's for sure.", "And so it goes, alcohol destroying more lives. SMH", "Get out before you have kids with him.\n\nHe’s an alcoholic. He’s not going to change as long as he doesn’t need a reason to change, and you can’t make him, he needs to want to do that himself.\n\nSo you can suggest he does Alcoholics Anonymous or other counselling about it but you’re never going to be able to make him go. You could try Al Anon for family of addicts but I think you already know it’s a major problem.\n\nYou deserve better than this.", "Good lord NtA. If I got told I behaved this way after drink I’d be mortified and stop immediately. But then…. Someone with a drink problem wouldn’t so this is a deeper issue. I think it’s time to dish out the harsh truths and prepare yourself to leave if necessary.", "YTA  dudes rock.", "Gosh that sounds like an awful day and night of vacation. Sure get drunk with a few drinks since it’s vacation, but what he did was get plastered and belligerent. NTA for telling him no more drinks on vacation since he can’t handle his liquor.", "Involve his family as well if they have had luck in ‘talking him down’. The more people that tell him he has a problem, the better.", "NTA, but...\n\nYour husband is loud and aggressive when drunk. And he wants to be drunk. Often.\n\nYou have much bigger problems than a ruined vacation. Is this what you want for the rest of your life? How long before he starts beating YOU instead of strangers in bars? If you have children, is this what you want them to see everyday?\n\nThink long and hard.\n\nAnd keep in mind - you cannot talk him out of this.", "NTA and you don’t need reddit to tell you what you need to do. But I am going to say it anyway just in case:\n\nHe needs to get a handle on his drinking or you need to cut your losses and move on. You deserve better. \n\nDo not even consider purchasing a home together and please no children. Please.", "As a 10 year sober person the best advice I can give to you is to make sure you aren’t in denial (drunks are always in denial) about your role in this drinking drama. You cannot save him or talk him out of drinking. You have to get educated about alcoholics and how to be the family member of an active alcoholic. Al-anon can be helpful and you can find support there with others in the same situation (you can also do this online). He’s gotta hit his bottom and you have to LET HIM CRASH. This is so difficult for family members. It is a family disease that touches everyone…family, career and eventually the law (cops could have been called at your resort so you dodged a bullet there). Save yourself first, so when he is ready you are prepared for the rebuilding of a life with the sober person (harder than you may think). Encourage his parents to get educated.  You likely will see patterns and ways he has been enabled to continue without severe consequences. Start counseling if you can. I cannot stress this enough…it is imperative that you understand clearly the dynamics of this disease and how to take care of yourself. It absolutely is possible for all to overcome this but you need tools, support and a strong resolve to set boundaries (parents, siblings, friends included) and hold the line.  Best of luck.", "nta. take video/pics of how he's acting. show them to him and maybe  he can see how big of a dumb fuck he has been. \n\nif he denies his drinking problem, then what else can you do?\n\nmaybe he doesn't realize how aweful he is and should be shown?\n\n(also will be good evidence for what is to come if he is not going to change his drinking habits)", "Your husband is an alcoholic. This is not going to get better unless he completely quits drinking, forever. You need to give him an ultimatum: you or drinking. And stick to it.", "NTA\n\nI see from one of your responses that he drinks every day & 'freaks out' if he doesn't have alcohol.\n\nYour husband needs to admit he has a problem & get help.\n\nIf he doesn't you need to reconsider the relationship because ime the future could become pretty bleak. Plus he isn't likely to be any kind of decent Dad if you want kids in the future.", "No, this is completely unacceptable. \n\nAnd I think that if you're staying in this marriage with the negative impact of his alcoholism on your life, you might also be in a little bit of denial.  \n\nDo you really want to be in a relationship with someone who has to drink a hefty amount to get through each evening, and then every couple of months becomes so drunk that he goes completely out of control?  What will the rest of your life look like if you stay with him? \n\nAsk yourself:  Do you have any reason to believe he'll change?  Does he even want  to change?  If getting drunk is the only fun he says he has even on a snazzy vacation, is this the kind of person you want as your partner?\n\nYou deserve better.  Run.\n\nNTA", "NTA. Based on the fact that he drinks multiple drinks every day, he’s an alcoholic. My late husband was also an alcoholic (died at 47 years old), and so is my mom.\n\nUnless you want to live the rest of your life like this, it’s time to leave. There’s a chance he will change, but it’s far more likely that he won’t.\n\nMy husband died with a BAC of 0.346. He was smashed under a semi truck, and took several minutes to expire (bled out and slowly suffocated). I will live the rest of my life with the image of him in that state,  imagining his final tortured moments and knowing he chose the alcohol over me. Do you want to do that? Wish I didn’t have to…", "I don’t drink (drank a lot and partied when I was underage and 21 - 22 and don’t have any desire to drink) and it makes me wonder if me being sober makes his actions/drinking seem worse than it is.", "He drinks everyday. Usually a few beers or mixed drinks and then every few months drinks to this point. Says drinking everyday isn’t a problem because it’s “only a few” but freaks out if he doesn’t have alcohol / beer every night.", "On multiple occasions.", "You're a real comedic fucking genius, aren't you?", "I understand this perspective - the “maybe I am\njust less tolerant and most people would think this is OK” point of view. \n\nI’m here to tell you it’s not you, it’s him, and the only way he changes is if he decides to. \n\nThis would be my cue to leave. I stayed, had children, and a miserable divorce that left deep marks on all of us.", "I don't drink either but find most people who drink to be just fine as long as they're not being belligerent or making everyone around them babysit their drunk ass. In my personal experience, alcohol brings out honesty, and if their honest self is that way, a whole lot is going on under the surface.", "Your partner's dri king is a problem, thus he HAS A DRINKING PROBLEM! This could likely be your life forever if you do not put your foot down now. Since your idea of fun and his are very different you may want to reconsider things, forever is a loooong time!", "Having a beer or even two each night isn't a problem.\n\nFreaking out when it doesn't happen is.", "Leave him. You waste your time with this alcoholic. Speaking from experience. He will not change.", "NTA speaking from personal experience.  Nothing good will come from this.\n\nThe fact you see and know what his behavior is now can allow you to not make a mistake.\n\nI spent 20 years with a man who was like this, sort of.  But I didn’t know it in advance.  He hid it well, for a long time; only a few points I was like dude why are you drinking.\n\nThen things started falling into (or out of) found hidden empty beer cans all through the basement; went to make myself a mixed drink and he had replaced all the vodka with water in the bottle; he was going to work one morning and I heard cans and looked out the window he had an armful of empty beer cans he dropped in the driveway that he was trying to hide from me, started figuring out he was drinking 3-4 cases of beer a week…..himself….… it just went on and on and on.\n\nWe tried to work through things (supposedly) he would say he would stop….but he didn’t or couldn’t or simply just wouldn’t. \n\nIt will only get worse if he doesn’t admit he has a problem.  Mine never did.  That’s why he’s an ex husband.  \n\nSorry to ramble about my past but just making a point.  He is an alcoholic.  Seems to be what they call or used to call high functioning; but at the end of the day he has a problem.  \n\nYou also run the risk of his rudeness turning physical against you.  Don’t say it would never happen…….because I can happen.  It really can. \n\nPlease keep yourself safe, physically and mentally.  Dealing with the mental impact of living with an alcoholic is really hard; and will leave you with baggage that you don’t deserve.", "His dependency to drink daily may be psychological, but that's just as dangerous as a physical addiction.", "Denial is common in these situations, and stopping enabling his behavior is one way to help. It's good you've already attempted to talk to him about his problem with alcohol. Approach these discussions with openness, empathy, and try to reflect on his answers rather than argue against them. Be sure to take care of yourself, too. You can encourage him to seek professional help, but people rarely help themselves unless they are ready.", "u/Schrecmd -except for the ex part, I’d think we were the same person.  I’m so glad you finally took a moment to think of yourself after spending all of that time minding him.  While the human in me hopes he got better, the majority of my heart goes out to you.  My wish for you is as much of an AlkaSeltzer-free life for your remaining years because you’ve already been in the trenches.  🤟🏻", "Only alcoholics wonder when they get to drink again. Normal drinkers don’t think about when they will get to drink. No one here knows him, but the ones who are saying he IS an alcoholic have seen or experienced alcoholism, and know all too well the behavior of an alcoholic. \n\nThe truth is simple, but hard to accept. He either stops drinking, and starts going to meetings and gets help, or you leave.\n\nYou can’t change someone who doesn’t see they have a problem, but you can do right for yourself, and walk away.", "NTA\n\nI’m very, very sorry you’re married to someone with a severe drinking problem.  Someone who is either in denial or wishes *you* were in denial so you’ll get off his back.  Yeah, no.  \n\nMine has been a lousy drunk for years.  I stayed because I thought I should.  Because I loved him and married him soooooo many years ago.  Is it a matter of upholding the vows I made?  Love?  Concern for his wellbeing?  Sunk cost fallacy?  Embarrassment?  The fact that he’s also a compulsive liar and has burned 99% of his bridges and would therefore have no one without me?\n\nHis drinking, the denial and insistence that he doesn’t drink every day (as if that excuses everything) has gotten us to this point; he has lost multiple jobs (“I wasn’t fired, I quit!” -without another job lined up.  “I wasn’t fired, I was laid off; work is slow right now!”) including one that had him sitting there, drinking for a few months all while claiming he was looking for work (hint:  he wasn’t).  Years of this led to us losing our home.  It led to him getting into a situation where he spent over a week in the hospital recently.  It led to me sitting here, waiting for word I can go back and see him because for the time being, the hospital staff won’t allow anyone in until he’s no longer intoxicated.\n\nLook, a lot of us had our party days, but took care of our responsibilities.  Some of us gave it up or curtailed it in favor of living a responsible life.  Some had a wake up call.  \n\nOthers, like the ones some of us described here don’t have a problem, you’re just making it up because you don’t know how to have a good time.  You don’t know what you’re talking about, they don’t drink *every* day.  Oh, so now you’re watching them?  Great, now you know EVERYthing, don’t you?!  Like you’re some saint.  I can hold my liquor.  That guy was asking for it.  Didn’t you *hear* him???  /s\n\nAnyone who pulls the garbage your husband did and then denies they have a problem…has a problem.  The only question here is not whether or not you’re the chocolate starfish, it’s how you respond to their starfishedness.  Me?  I’d suggest you get out now, before your life becomes like mine.  It’s not you.  It’s not your fault.  Some in your world might give you grief for what they consider your ignoring the ‘better or worse’ & ‘sickness and health’ part.  Until he acknowledges what he did, the fact that no he *can’t* hold his liquor and that he has a problem…then he’s not holding to his vows either.  You didn’t sign up to be a punching bag, literally or figuratively.  \n\nThink very hard about what kind of life you want.  He’s shown you a vision of what life with him will be like.", "NTA\n\nguy seems to be an alcoholic who can't handle his drink\n\nand by drinking every day nor can his liver either", "NTA.  And I'd also be concerned that he could turn violent towards his family.", "Mistakes happen, but you should be BIG mad at him. He’s too old for that.\nEdit - Does he have trouble over drinking at other times? You might have a problem child on your hands.", "YTA for enabling him. Let him go to the bar and get his ass kicked. Let him get thrown out or arrested at the hotel. Let him lie in his own puke.   \n\n\nhe won’t stop because it’s your problem. Make it all his problem.", " NTA...however I do think there was more than drinking involved. You don't wake up angry after being shit faced the night prior. If he was that drunk, he wouldn't remember anything. Talk to your man's. It ain't just alcohol that's the problem is my opinion. It also sounds like he has some issues with alcohol dependence.", "NTA and you might consider joining alanon. It is a support group for friends and family of alcoholics.", "NTA\n\nWow, did this bring back some memories when I was dating an alcoholic. It sounds like your husband is a terrible drunk. I agree with you that you need to have a talk, but I also caution you that he may deny deny deny that he has a problem. Or if he does agree, he might not actually take any action towards improving himself and just say that to appease you. Good luck, it's a long journey.", "Offer another drink while he's in the middle of puking", "NTA. You should have filmed him though to show him how ridiculous he was being. \n\nMy husband was mortified with how he behaved when he was two sheets to the wind and immediately curbed his drinking to almost nothing for years. \n\nYour husband definitely has a problem. Just because it’s an all-inclusive, doesn’t mean he *has to drink as much as possible to get his money’s worth.*\n\nAlso, the bartender shouldn’t be over serving him.", "Get rid of him,if he drinks and acts like that now, he'll be a bigger ass as he gets older", "Your husband is an alcoholic. He tried to fight a total stranger. It’s only a matter of time before he rages against you then what? Leave now.", "NTA- my mom stayed married to my dad who would pull shit like this for NINETEEN YEARS.  I hope you have the sense to leave sooner.  It won't get better cause he doesn't see it as a problem.", "NTA, you need to put your foot down and allow him to comprehend the gravity of the situation.  If he can't address this now, then when?  Will he ever?", "Grounds for divorce. He doesn’t respect you, why are you with him?", "Something needs to change and I don’t expect him to do it.", "Nope NTA. It is not “normal” to have that kind of behavior change while drinking and is indicative that he has a pretty serious problem. Honestly, unless he’s willing to get help, and cut out the booze, you should plan for your exit. I’m not regularly someone who recommends bailing, but this will not get better unless he recognizes he has a problem and is ready to address it.", "Sound like your husband is a loud. sloppy drunk. That doesn't know when its time to stop drinking and has no self control once he starts drinking.  \n\nIm assuming you knew this about him prior to the marriage and prior to this vacation, its not like this is the first time he has gotten drunk around you. \n\nPeople like that don't change. \n\n\nNext time you/he wants a vacation.  Tell him you want him to be sober on the vacation(limit 3 drinks per day). or you don't want to go on vacation with him. and he can stay home with a bottle of booze while you go on vacation.", "NTA  \n\n\nI (67m) was married to a woman with addiction disease. She basically drank herself to death. The disease is incurable.  \n\n\nSince he does not want to acknowledge, your best first step is you going to AA. They can supply the tools, that you need, to navigate all of this.  \n\n\nYou have the right to an alcohol free life.", "It’s quite obvious who TA is in this scenario, and it’s damn sure not you, OP.", "Nta. But it sounds like your husband has a drinking problem. Unless you're willing to out an ultimatum upon him, he will continue to drink. Don't enable his bad behaviors and don't excuse any of his actions. You have to let him hit rock bottom without you stopping it. Actions have consequences.", "Nta. You aren't his keeper. Why are you taking on this role? You called his parents? What the heck are they going to do? He's an adult. Let him behave like an asshole. If you have to sleep in the car, so be it. He needs some consequences, not a wife who mommies him.", "NTA. Save Yourself. Get Out Now", "dont get mad at me,some people are not good at drinking.tell him to slow down a bit.", "NTA obviously.\nI drink myself and have a tendency to drink to much to point where I make stupid decisions.\nMy wife reigned me in with this quite a bit.\nBut to add to why his drinking is problematic is that he’s an aggressive drunk.\n\nAny bad decision I ever made basically just hurt myself. I get jovial, talkative than tired  then obnoxious then sick when drinking.\n \nPeople who get aggressive when drinking need to realize that and either cut out what makes them aggressive ( hard liquors for some of my friends) or quit altogether.\n  Being a nuisance is one thing being a threat to others safety is a whole other thing.", "NTA\n\nShould ultimately tell him.pick one, family or alcohol.\n\nI don't pretend to have the right answers, but have you ever filmed him during these states.\n\nAllow him to watch the utter embarrassment he has become?", "NTA but unless he is willing to admit he has a problem and goes to AA or rehab NOW, if I were you, I would seriously consider divorce. You'll save yourself a lifetime of misery. My grandpa was an alcoholic and my grandma was so miserable as a result, I think it was a huge contributor towards her agonizing illness and death.", "NTA\n\nClearly he has a problem. You decided to marry this guy so I hope he has many other redeeming qualities. If he's an alcoholic then welcome to a life of added stress.", "NTA. Go to Alanon", "It depends if it happens often or this is an isolated incident. If it isn't a common issue, id say you're overreacting", "NTA, what a timebomb. How many red flags do you need?", "My father was an alcoholic before my parents got married. I say this with a lot of love for my dad but I really wish my mom knew to run before she started laying down roots with him. He sounds very similar to your husband, drinks a few daily with occasional out of control binge drinking, which at times got more out of control/frequent. Although he may be functioning, his alcoholism seriously affected us all really negatively. You have a whole life ahead of you, don’t start putting down roots, buying a house, god forbid having children with someone who will not even acknowledge his drinking problem.", "NTA. It definitely sounds like your husband has some alcohol dependency issues. There is nothing wrong with drinking. Me and my wife just had our longest trip away since our toddler was born (4 whole days!) for our anniversary. We both drank every night and a little during the day. It was fun and we definitely both got lit. We also didn’t have to work or wake up to the toddler tornado. BUT we stayed within our limits, had fun, and were responsible, taking Ubers or drinking at our resort. That is normal and safe vacationing. What your husband did is frat boy level stupidity.", "Best answer. If he does not first admit the problem, there is nothing you can do.", "Yes. Every few months.", "As for ruining the whole vacation, That seems excessive.  He clearly ruined one night and the possibly the next morning.  Dont let that ruin your whole vacation though.\n\nIf need be,  Leave him in the room with the hangover in the morning, and you alone Go for a walk,  enjoy the weather and the resort, eat some breakfast, find something to do at the resort & enjoy yourself.\n\nCheck in on him around noon and ask if he wants lunch or if he wants to lay around and recover till dinner time.\n\nI have a couple friends like that. \nWhen they plan vacations its either a \"get drunk & day drinking vacation\" or a \"mostly sober and do stuff vacation\"\nIts discussed before they make any plans or pay for anything, about half of the time when it's a \"mostly sober and do stuff vacation\" he chooses to stay home and she goes on the vacation with a friend or family member. \nSometime they do a drinking vacation,  but will pick one day to do something,  so the evening before is a stay sober and limit your drinking evening because we have to be awake and on the move early in the morning.\n\nThe key is to openly and honestly discuss it with each other. Yalk about what each person wants out of the vacation,  because what you want from it, might be very different from what he wants from it.\n\nIf all he wants from a vacation is: to get drunk and have No responsibilities for a couple days, great. That's an easy and cheap vacation.  he can do that at home with a bottle of booze and a few frozen pizzas.\n\nBut you need to openly discuss it with him. \n\nHave a different couple of friends.  They're ideal vacation was: no work, no responsibilities, no kids, just spending quality time together. \n\nThey sent the kids to grandparents for 4 days,  rented an nice hotel room in the same town they live in, and went to the local attractions, museums, music, diffrent resturants they havent been to.  Basically they just wanted to be together as an couple and find adult things to do without having to cater to their elementary age kids.", "Nope.\n\nI’m a moderate drinker who once dated a guy who behaved almost exactly like this when he’d binge. It was *awful*, and I’m still stunned that I put up with it for as long as I did. He’d get belligerent and nonsensical and there’d just be nothing going on behind his eyes while he raged and cried and sulked and repeated the same sentences over and over. In addition to being embarrassing and inconvenient, it was *unsettling* when he disappeared like that. It was like a hostage negotiation with an angry sleepwalker who may or may not even be aware of who they’re speaking to. \n\nYour husband is an alcoholic. You’re *both* in denial - he’s just deeper in his denial than you are in yours. You’ve hit the “he’s a problematic drinker” stage, but you’re still convinced he can be reasoned with and that it won’t be that bad if he just *listens* to you. There’s a magic turn of phrase that will get through to him, you’re sure of it, you just have to figure out what it is. \n\nThere ain’t. Nothing you say is going to make him forget how good it feels when he lets himself get drunk. Feels better than anything else. Better than lying in a breezy cabana with his wife, better than a delicious gourmet meal, better than *anything* that you or this vacation could offer him. That’s his favorite activity, and it doesn’t especially matter whether or not you participate. At this point, you could say “stop drinking or I will divorce you,” and his very first thought will be “wow, well now I *really* want to hit the bar.” That’s where his head is at. \n\nYour choices are to either stick it out in the hopes that *maybe* one day, he’ll have an epiphany and realize that he needs to stop drinking all on his own (and ideally, commit to repairing the damage he’s done to his relationships as well), or decide you’ve had enough and it’s now or never. With the understanding that his answer might be “never.”", "You being sober doesn’t make his actions seem worse, you can see them as they clearly are. \n\nIf you were drunk then you would likely miss some stuff and also be more tolerant. The actions would still be bad. \n\nDon’t let him use that one against you.", ">Ive tried to talk to him before about him having a drinking problem and he is in complete denial.\n\nHe has a drinking problem.  Go to /r/alanon.", "I’ve been in your position (but as your husband) and I ruined one too many holidays/vacations/nights in with my ex-wife because I couldn’t/wouldn’t stop drinking to the point of blacking out and being aggressive. Just like your husband, I thought I was just “enjoying myself” and wanted her to leave me alone to act like an asshole. And just like you, she made excuses on my behalf and thought my drinking “1-3 beers or a few cocktails” after work everyday was normal and saved the black outs for the weekend. No. All of that is a dependency on alcohol. None of it is okay. It took her leaving me and filing for divorce before I finally stopped drinking completely. I’m 10 months sober now and it took maybe the first 6 months of sobriety before I even recognized that what I was exhibiting was alcoholism. You need to put your foot down with your husband that he either stops drinking, or you need to leave. It is only going to get worse from here and he clearly has no intentions of letting up. I know it’s not what you want to hear, but he will start gaslighting you that you’re making it all up in your head and that you’re just sensitive because you don’t drink. None of that is true and he has a massive problem. I hope you do what’s best for you! You need to protect yourself.", "Nope he sounds like a movie cliche drunk. I stopped drinking around his age entirely. I never was a bad drunk (did it for health). Objectively he sounds like a really bad drunk and would be well served to become a teetotaler like you are.", "He\\`s a violent drunk who consumes to the point of coughing up his liver.  In no sane world could you make it seem \"worse\".\n\nI don't drink hard liquor much.  Most of my consumption is a beer of an evening.  But I've binged at the odd Jewish wedding--open bar, ho!--and when I want to do some self celebration at a tiki bar in my city.  But I've learned to respect my limits and pace myself with water in between each shot or cocktail.  I am also fortunately a \"happy drunk\".  Even so, I am always aware even when I'm a few sheets to the wind that I'm non compos mentis and to try to compensate (likely to the amusement of the world around me) for that.\n\nYour husband is the worst sort of lush when he indulges.  And should be criticized accordingly.", "Hi I'm here to tell you you are married to an alcoholic.  Been there done that have the scars to prove it. \n\n\nWhen their thoughts are consumed with drinking ans they can't control their behavior afterwards they have a major problem.  \n\nNow how you handle this is up to you. \n\nMy experience they won't learn til they have hit rock bottom. And for your sanity and health exiting that situation would be best. \n\nBut that is my experience not everyone elses.", "His behavior is not your fault. His behavior is his to control. You can't do that for him nor should you try.", "That's not it. What you described here is pretty bad and you are right to be concerned.", "I don't think not drinking is making his actions seem worse.\n\nIt's just since you're not drinking his action seem less acceptable because your judgment is not clouded by alcohol.\n\nYou just described a major drinking problem.\n\nSounds like your husband came really close to being arrested had he gone and fought. \n\nI would never suggest this, but as it seems like he's not listening to you when you've described as being a problem, you might need to take a recording.\n\nTell him you are worried about him.  He was out on a freaking balcony and yelling and stuff. I would have been worried he'd fall.\nArrested kicked out of the hotel. You name it.\n\nAsk him if he reaches this point again. What he wants you to do.", "Nope, none of his actions are acceptable, drunk or sober.  Don't let anyone tell you that you are seeing his actions worse than they actually are.", "I drink maybe 3-5 times a year, and when I do, I definitely get drunk. But I never get belligerent, irrational, or cruel. Your perception is not flawed.\n\n\nA normal response on his part would be to believe you when you give a recollection of the nights events, and acknowledge that isn't the kind of person he meant to be, and going forward he would do whatever it takes to severely limit his consumption so he doesn't lose control and nearly get you kicked out of a hotel again, or worse. \n\nHas he even reflected on the fact that he likely would he sitting in jail with, or even the equivalent to, an assault charge/drunk + disorderly if you weren't stopping him each time he tried to leave for a \"fight?\" \n\n\nI can honestly say, if he continues to be ignorant about this, it will absolutely destroy you mentally if you don't get out. So I really hope he can recognize he has a problem.", "No.  It makes you SEE his actions for exactly what they are.  He needs to see a video of himself acting that way, tbh.   Keep in mind that an alcoholic is never going to change because you ask them to.  I was in a relationship with an addict and barely got out before he took me down with him.  NTA, but this is bigger than just him ruining vacation.", "Whether you drink or not his actions are really disrespectful and devaluing towards you. Look I’m sure plenty of people in recovery turn around and become lovely people, but even if not drunk how what does this attitude mean for how he’s react to a newborn at 2am, or a junior sport sideline dispute? How much of his trauma and poor mental health are you going to have to shoulder if he doesn’t seek treatment and support?", "NTA If your best friend, a complete stranger at the salon, your neighbors, if ANYONE ELSE told you this exact same story, what would you think?\n\nIt’s not normal, and you don’t want it to be your normal, you don’t have to. I divorced my ex for many reasons. The push was when he pulled this stunt on a joint trip to see my friend who lives abroad for the first time in 6 years. As I was telling security he needed to book another room as I was divorcing him for this, he started drunkenly howling that he didn’t understand why.\n\nBless the security guard who stood him up and said “this, and probably a lot else, is why. We’ll send you a copy of the tape tomorrow”.\n\nDon’t wait until he turns joyful events in your life into episodes of Jerry Springer. He doesn’t love himself enough rn to be in a relationship. You will be fine.", "My father behaved this way. He is now sober but has cirrhosis. My Mother (doesn't drink) has spent the greater part of her life crying, begging, hiding liquor, dumping liquor, hospital visits. It's a slippery slope. He will ruin your life.", "Hi, I'm an alcoholic (sober for 4 years). So is your husband, I'm sorry to tell you. Drinking multiple drinks every day isn't normal or healthy, and is considered alcoholism. Compounded with his binge drinking every few months, I'd say he's in the beginning stages of something worse. \n\nI've been there. It will get worse.\n\nYou're NTA for not wanting to put up with his terrible behavior regarding his addiction.", "He is an alcoholic. Leave him, otherwise this is what your life be forever, forever is a long time", "He’s an alcoholic and in denial. Leave him if he won’t get help. You’re still young. NTA.", "He's an alcoholic. There's nothing you can do to change that. He has to want to change for himself, and he doesn't.\n\nDrinking is more important to him than you. Than anything else, in fact.\n\nAl-Anon is the traditional resource for loved ones of alcoholics. But you don't seem to have kids with him - a lot of people who have been in your situation would tell you to GTFO ASAP. Don't entangle your lives further.\n\n\"But I love him.\"\n\nOk, but he lives alcohol more than he loves you. You can almost think of it as if he's cheating on you with alcohol, if that helps.", "Your husband is an alcoholic. He must address his alcoholism. This is beyond vacationing.", "It’s not going to get better. He has a disease and he doesn’t see his drinking as a problem. \n\nCheck out /r/stopdrinking to see how difficult it was for those people to finally admit they had a problem and try to stop. Usually it was after they lost everything (divorce, job loss, DUI with someone injured) and hit rock bottom before they made a commitment to change. You sticking around just enables them.", "I call people like that responsible alcoholics.\n\nThey are responsible because they are sober at work, when driving,  and when they Need to be.\nThey have a few drinks every night because they need to,  but also only have a few because they know they have to be sober and functioning in the AM.\n\nWhen they have no responsibilities the next day,  they might get totally black out drunk. \n\nIf you want to have him with you on a sober vacation, you need to explain that to him when he is sober. \nWhile you will probably have a great vacation,  he will probably feel like it was not a vacation because he had to be responsible and stay mostly sober.", "He's an alcoholic. 100%. Take a break from him and go to Al-Anon", "Drinking every day is a concern, but freaking out about NOT drinking is blatant alcoholism. Please provide him with resources, and leave if he does not take it seriously and turn his life around. Alcoholism is a downward spiral, and you don't need to go with him.", "That kind of dependency is addiction, and hindering your ability to save up for a house too (and indeed affording holidays).", "Ooof, this describes my and my ex-husband's dynamic so well. Still going through the divorce, and damn this hits home.", "Please OP, attend an alanon meeting. \n\nI can tell you from experience, it's not you. He is belligerent, wants to drink and drive, and doesn't care to change. Even if he did change, he will *always* be an alcoholic. You can be sober, but he has to want that, and he clearly doesn't. Do not even think about bringing kids into this.\n\nYour husband is severely dependent on alcohol. I wish someone had warned me.", "Thank you for your reply. It’s interesting to see a reply from someone that was previously in his shoes. You described our situation to a T, especially saving black outs for the weekend.", "alcohol is one area where some people absolutely *do* change.\n\nBut, most won’t; a guy who drinks every day is already a red flag, and if he becomes “I’m calling the cops now” drunk a few times a year he’s not somebody to share a life with.\n\nPresently her husband is absolutely an alcoholic.", "NTA Next time he gets drunk and acts like a jerk, use your phone to take some videos. Then, when he's sober you can show him how he's acting. Heavy drinkers forget how obnoxious they are.", "Sounds like he had a rough one. It was one night though.. Lots of people have one offs. Your entire vacation isn't ruined. Maybe stop exagerating and be supportive. He's gonna be hungover AF, take good care of him.", "Think of a safe and constructive way of discussing this and your boundaries with him.\n\nIf you wanted kids, etc, you could say you were thinking about how you would like him to work on his behavior when he drinks because you don't want your kids to think that's okay behavior. \n\nIf you have a personal example such as violent or alcoholic parent or relative, use that.", "[removed]", "Wow you have an alcoholic husband. End the vacation and get him into alcohol therapy (which he will not want to do).  Good luck.", "My ex was like this and I stayed with him for 6 years and wasted all of my youth. I still regret staying with him, I should have left him in the beginning. If this happens again, leave him. It won't get any better because he's an alcoholic.", "NTA\nI was how your husband is. Started drinking at 14, quit once for 8 months, started again… I was a complete ass and my wife should have left before we had a beautiful child. After he was born I was better but dived right back in shortly after. I was still an ass… hit rock bottom after a “great” drinking day (for me, no one else), she kicked me out and had zero clue I was drunk. Went out and drank whiskey which I hadn’t drank in years became it makes me more of an ass… called her and asked to sleep on the couch, she agreed (I was told the next day because I was blacked out at this point) and slept on the couch. Woke up the next morning with a very well deserved hangover. \nI didn’t want to lose my family and everything we have worked for. That was just over 3 years ago, haven’t looked back. \nHe needed to hit rock bottom and he has to want to quit for himself or in my experience, it won’t work.\nI wish you the best of luck.", "Your husband appears to be an alcoholic.  Alcoholism is a family disease.  Please get yourself to an AL Anon meeting.  They will help you realize you can't change him and will assist you in deciding your next steps.", "NTA\nAs others have said, nothing will change until he decides to change it.\n\nYou can’t reason with someone under the influence… Any conversation about this issue needs to happen when he’s sober.  You need to be clear with him and with yourself that yelling and fighting and belligerence are not acceptable and will no longer be tolerated.  He likely doesn’t possess the ability to stop, once he starts.  Either he commits to giving up alcohol altogether or he commits to being willing to quit when someone points out it’s time to stop.", "Just run. Don't buy that house. Take your money and go. \nYou'll meet someone else, don't stay because of the sunk cost fallacy. if you stay more he will bury you in his own self destruction. \n\nAlso the belligerence and contempt he exhibits towards you is worrying. Has he ever been violent ? Alcoholism is a big accelerator for abusive and violent behavior.", "NTA. Your husband is an alcoholic. Alcoholics don’t have to drink every day to be alcoholics. The fact that he said it’s all he wants to do is the answer right there. He is violent and abusive and literally toxic - pouring toxins into his body until you have to deal with the mess - his spew, his collapse, his behavior, etc. I have been with an alcoholic more than once. Sad thing is they come in different forms with different habits and behaviors but in the end if you are trying to “manage” an evening for your safety and everyone’s reputation you have a problem. I now have no patience for it. He gets therapy. I hope for your sake that you didn’t buy that house yet. Life is too short and don’t forget to not give up on yourself when everyone else says not to give up on someone. He has massive issues. You don’t have to fix them and frankly you can’t if he doesn’t want to. \n\nNTA, please get out of this trip, this house, this marriage.", "Nta get a divorce", "Oof. NTA I drink more than I should sometimes. But I’ve never, even when I am almost blackout tried to fight anyone. Never crossed my mind. Some people are just means drunks that shouldn’t have a drink to begin with. Sounds like he needs to majorly cut back and figure out to have fun without a drink. Go for a hike go explore historic spots dude needs help.", "NTA, your husband has a serious problem.", "I stayed with my ex for far too long telling myself that I signed up for “in sickness and in health” and alcoholism is a sickness… I hope for your sake that he recognizes the issue and wants to address it.", "His behavior is unhinged.  You are on vacation FFS, this is the most relaxed he should be.  Sounds like he needs to run across this thread so he can see what an ass he’s being.  🤨", "NTA and you’re still so young, you don’t have to deal with this shit and have tons of time left to enjoy your life.", "That's a crazy situation. It might be hard but I would tell him to go to rehab and therapy or leave. Alcoholics are addicts like any other addict. \n\nHe might say he will cut back. The first time he takes a drink he's out of control again. An alcoholic doesn't have one drink only. Then you're back to the cycle.\n\nI would get out if I could. It might get worse from here.", "Sadly this sounds like he needs to go to rehab. And I'm pretty sure you already know it. Get him help. If he doesn't want help, then you know where you go from there. Because a person needs to want to recover and if they don't you are wasting your breath. NTA", "NTA Leave him. Sooner or later a violent drunk will turn on you. Don’t wait around for that to happen.", "You're NTA.\n\nHowever, you cannot force your husband to quit drinking. It doesn't matter that you're in the right, this is not something you are going to be able to do. You may have to make some choices soon. I strongly recommend therapy. If you cannot afford or find therapy, consider a support group such as al-anon.", "NTA Your husband has an alcohol problem. Does he seem like he's self medicating for mental health issues? This sounds a lot like a manic episode for a bipolar person.", "It’s up to you what you decide to do but the first stages are for him to admit he’s drinking too much then you can support him when he gets help with it or cuts down.\n\nmy ex who I dated, he binged drank all day and all night at a function and I had to guide him, hold him up, stop him from falling etc and it ruined my time to be fair which he just couldn’t understand so I understand how you feel.\n\nI don’t know if this would work but maybe you could inform his family of your concerns and his friends and hold an intervention? \n\nOr talk to him alone calmly when he is sober and display your concern and show its coming from a loving caring place? \n\nIf none works then I would if I was in your shoes be asking me if this is what I want for the rest of my life? \n\nHope it works out for you.", "ex alcoholic here. if he doesn't want to get help run!! it will not get better.\nI refused to get help.\ntill I lost my marriage by then it was to late. 15yrs sober now", "Nta - holy moly, is this new behaviour? I mean, he sounds like an alcoholic, but you would know better than anyone here.", "NTA. You had to call his folks? Do they take returns? How embarrassing.", "My ex was like this. In our early 20’s drinking and partying was fun. In our mid-20’s I grew up and he still hadn’t. He got so angry bc he wanted to have a baby and I said no, not until you can be a dad and not drunk all weekend. He found someone else who would party with him so we divorced. Now’s he’s on his third marriage, third DUI, and two baby moms. Unless they figure out they’re the problem it’s going to keep happening.", "NTA. My uncle was an alcoholic. My dad, his brother, once told me that if my drinking ever bothered someone that was a huge red flag and I should consider giving it up. \n\nMy uncle destroyed his family and ruined his own life economically.  His wife paid the price too.", "Get used to it.  He’s a belligerent drunk.   Lay down the law.  Either he checks into rehab or you check into a hotel and call a lawyer.   He’s headed for a fall, don’t be dragged down with him.", "your husband is an alcoholic \ndemand he goes to counciling or you are out period. don’t talk to drunks, don’t reason with drunks …. just leave", "ESH", "Is this the first time his drinking has been maladaptive?", "I simply wouldn’t put up with this. It’s not going away. Sell the house wish him best in life and move on. The booze is more important than you.", "I hope you do not have children with him. My father is like this. I was the oldest and my mum and me were his punching bags when he got drunk enough. He had to go to jail to stop  drinking and even now he comments sometimes about how \"he'd kill for a drink\". Likes it normal. I have SEVERE PTSD from his actions. You're a victim of his vice and need to put yourself, and your mental health, first. Good luck.", "Al-anon is the one for family members right?", "Correcting you to say OP needs Al-anon, but yes - you're right on. Source: family ravaged by addiction with some in long-term recovery and some dead", "🫂 he chose the booze over everything, not just you, if that helps at all. he let it be the single most important thing in his life. \n\ni’m sorry you had to experience that, i hope you’re doing better.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I'm an enthusiastic drinker and have a home bar that handily beats some of my local bars. I love drinking and I love alcohol.\n\nThis is not healthy behavior, and your husband needs to get help.\n\nWhat if he had fallen off the balcony or drowned in his vomit while he was passed out? What if he had driven while drunk or started a fight and got arrested? What if his actions got someone else killed? He needs to talk to a professional to either get his drinking under control or work towards giving it up completely.", "I think you might be making excuses for him. His actions while drunk were getting violent and causing trouble. You might love him. But sometimes it's not healthy to stay. He just needs help.", "I stayed for 10 years hun. Continued dealing with him for another 3 years because we have a child together. Best thing I have ever done for myself is telling him: “I’m done with the bs, don’t call me again unless it’s from rehab”.", "[Almost nobody in the USA drinks every day, certainly not *more than one drink*.](https://www.inc.com/jeff-haden/the-top-10-percent-drink-way-more-than-you-think.html)\n\n40% of Americans drink virtually *nothing*, perhaps one or two alcoholic beverages during the entire year.\n\nAnother 20% drinks about one to three drinks a month.\n\nYour husband has deluded himself into thinking that his drinking is normal. It's not. He is quite a heavy drinker, and he's clearly *reliant* on drinking.", "As someone who has struggled with alcohol due to depression myself, not getting drunk every time or even that often but drinking a few beers or wine glasses every day can still cause cirrhosis of the liver and heart issues. \nHe has a problem. And the only thing that's been slightly helping me is therapy. I've been learning to hate booze and have a long road myself. But there might be something more deeply emotional there that's causing him to turn to alcohol.\nBut I'll tell you this. He's not going to quit for you. Be prepared to leave the relationship. He will choose alcohol over you. If for some reason he doesn't, and he chooses to seek help, I think it's worth fighting for unless he goes off the major deep end again.", "The *quantity* of his consumption is not the issue.  If alcohol use is damaging your job, health, *relationships*, etc., then you have an alcohol problem.", "Do you know what happens when my husband gets drunk? He tells everyone he loves them. On the rare occasion he would get sick, he would apologize profusely for the trouble. Your husbands drinking is a problem by itself. But his behavior while drinking is an even bigger red flag.", "Spot on.  Hopefully OP takes this to heart and doesn't waste any more time.", "I’ve been here. Thankfully not married. You are so right.", "Yeah same, I used to go out drinking a lot at uni, I drink maybe 1 or 2 times a year now. I don’t mind being sober around my drunk friends because they’re happy and chilled, if anything it’s pretty fun. If someone acted like OPs husband I’d have a serious talk with them/dial back the relationship", "How did he hide 72 beers (3 cases) a week? Does he have a workshop or something else where he's away from you during his off work time?", "I also drank 2-3 beers every day for nearly a decade. \n\nStopped because I felt it ruined my health and enabled me to not face my problems.\n\nNow drinking 2-3 beers every other week - works well for quite some years now - including times of emotional hardship.\n\nYou just need to know why and how to change something - but your right in so far that pressure from outside might not do the trick.", "He might - but he almost certainly won't change if nothing forces him to admit he needs to change.", "My wife drinks about a half a white claw a night and the biggest issue is her leaving the can out when she goes to bed lol.", "> Having a beer or even two each night isn't a problem.\n\nIt's not a problem in and of itself, no - but it's also not normal. Having a six or more drinks a week puts you in the 80th percentile for alcohol consumption in the USA.", "Yes, he's freaking out about not drinking because he knows he'll have profuse sweating and shaky hands and will have these adverse effects at work tomorrow.", "Just so you see this: another commenter and I strongly recommend al-anon to help you navigate whatever choices you make. It's a life saver", "This is what I've been doing. I've never been an angry drunk like OPs man, but my liver is starting to struggle. Even though I cut down massively, it's getting to the point I can't have any booze. It's a struggle for sure. It sounds like you cut down early on so I'm happy for you! Have one for me. 😆", "I'd be annoyed about the wasted half each night!", "She definitely gets annoyed when I used my dad voice and say things like “let’s remember to clean up after ourselves.” Or stick it in the fridge and tell her we shouldn’t be wasteful and to drink that before she opens a new one."]}