{"id": 3320, "submission_id": "z5m8c7", "title": "AITA for telling my daughter her anxiety is not an excuse to lie constantly?", "selftext": "So, my (f44) adult daughter, “Joy” (f24) is self-diagnosed with anxiety. I have offered to pay for a therapist, and she says yes, but she then misses appointments and won’t bother to reschedule. \n\nThe problem arises when she might have to tell literally anyone something that she thinks might upset them in any way. For example, her father (my amicable ex, m53) will ask her if she’s coming to his house for dinner. She will KNOW she doesn’t want to go, and ISN’T going to go. She will tell him yes, then just not show up and refuse to answer texts or calls to check on her whereabouts.\n\nIt boiled over this morning. She has always had issues with being chronically late to everything from social commitments to her (frequently changed) jobs. As a result, she gets written up and fired quickly. A few days ago, she asked me to borrow some grocery money to tide her over until she finished training at her new serving job and could start making tips. She promised to pay me back in a few days. Today, while I was on FaceTime with her, her roommate, “Violet” (f24), popped into the frame and said “thanks for the groceries, Mama! I wish my Mom helped me like you help Joy when she’s between jobs!” Joy’s face froze.\n\nI smiled at Violet and said you’re welcome, and then asked Joy for some privacy so we could talk. Before I could say a word, Joy starting getting aggressive, calling me unsupportive of her anxiety, and saying that if she told me she’d already been fired, I would have “thrown it in her face” and not “given” her food money. I asked her how I “throw it in her face,” when all I do is tell her she needs to get a doctor/therapist and get a diagnosis, maybe learn some techniques for managing her anxiety or get medication if she needs it? I even offer to pay!\n\nShe said that confronting her over her “coping mechanism” (lying to avoid disapproval or confrontation) is just making her worse. I snapped. I told her that her anxiety is not an excuse to lie constantly to everyone she knows, especially when she has someone willing to pay to get her help. She called me a gaslighter and hung up on me. AITA?", "created_utc": 1669507933, "permalink": "/r/AmItheAsshole/comments/z5m8c7/aita_for_telling_my_daughter_her_anxiety_is_not/", "score": 98, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I said she was using her anxiety as an excuse to lie.\n\n**[Check out our upcoming Reddit Talk with Iliza Shlesinger on Nov. 28th!](https://redd.it/z29rfu)** \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. As someone who had crippling anxiety (diagnosed) for most of my life early life, I have two pieces of advice. 1) get her diagnosed and medicated (I know you've tried, but my meds saved my life) and 2) stop providing her a crutch. What made me finally learn coping skills was when the people I loved backed off from me and supported from a distance instead of immediately fixing my problems when I started to have a panic attack. \n\nI know it's hard to see someone you love struggling, good luck and I hope she figures herself out soon", "NTA, as someone with clinically diagnosed anxiety: something being a coping mechanism isn't a get-out-of-jail-free card for wrongdoing. And lying to and manipulating people for money is wrong, no matter your mental health diagnosis.", "NTA\n\nAt this point, lending her money when she’s always losing her job and putting up with her lies, are enabling her putting off getting help.  She needs to see a doctor, she needs to get a diagnosis and help managing her struggles.", "I know many will disagree but NTA. This self-diagnosed crap that is going on today and why people can’t do this or that is junk. People with legitimate diagnosed illnesses are fine but half the posts on Reddit these days are “undiagnosed” or “self-diagnosed”.  Also lots of people have anxiety and function you have to have some extreme anxiety to not be able to function. And she has already proven to you that she lies/exaggerates with the dinner with your ex examples.\n\nFrankly it’s good you let her experience the reality that the world isn’t fair and it’s not your job to handhold her every step of the way. At some point she knows to grow up.", "NTA \n It's an explanation but does not excuse the behavior. She is failing to address the problems she has.", "NTA. While she certainly sounds like she has anxiety, that doesn't give anyone justification for acting like this.", "Lying is a coping mechanism. It makes her feel better. Same can be said of drugs and alcohol. It's not good for her. I highly recommend family therapy and individual therapy for her.  Family therapy will ensure she doesn't miss her appointments because you can pick her up for it. Anxiety isn't an excuse to lie but it seems like there's some serious issues like lack of trust from one side at least. Let her know using \"I feel...\" statements how her constant lying is eroding trust you have in her and the fact she isn't seeing a therapist means she doesn't want to change. Eventually her lies will have even worse consequences like a permanently fractured relationship with her parents and no one to bail her out.", "I know you mean well, but what you have been doing (whatever that might be) is obviously not helping. You got a book recommendation on AVPD, that’s a good start, because, without understanding of the problem, any solution you’d offer will be lacking.", "NTA. Your daughter is letting her mental illness become her whole personality. Pathological lying is not a good coping mechanism and she definitely needs professional help.", "NTA\n\nFully agree with others that you’re being gaslit and manipulated by her self-diagnosis. Seeing a therapist yourself would help you navigate and have a sounding board on the best way to help your daughter, while also protecting your boundaries.", "NTA. Time for tough love, mom. Your daughter is using her \"anxiety\" (put in quotes since  you've stated this is not an official diagnosis) as a crutch and excuse to avoid achieving or trying anything in life. At 24 years old she can't hold a job, can't pay her bills and constantly destroys relationships with deceptive and petty behavior -- time for her to start taking ownership of her life. That's difficult and scary and uncomfortable, but if she doesn't, this will always be her life.", "NTA but you are in a situation of your own making that can easily be fixed. Stop giving her money and tell her have the therapist bill you directly if she ever decides to go. You know she lies, so this way it doesn't impact you and you'll be available to provide support if it's ever welcome.", "It sounds like she has anxiety around confrontation, and tries to avoid it by giving everybody answers they want to hear.\n\nShe definitely needs therapy, but I don't think you are going to be the one she'll take that suggestion from.", "Hi there! I’ve been formally diagnosed with depression, anxiety, and PTSD. Occasionally in the past, I lied about things because of high anxiety. \n\nIt’s not a coping mechanism, and it doesn’t help. It only makes things worse. There are things out there that do help — therapy and medication are two of the big ones, but not the only ones. There are also cognitive behavioral therapy workbooks, MoodGym or eCouch, etc. \n\nYou are NTA, and only your daughter can fix your daughter. If you’re in the US, check out your local chapter of NAMI; they often have resources for family members of people with mental illness. Best of luck to you.", "I get she lies out of fear but you're tight it isn't an excuse nta. Maybe she'd be better working a remote job", "NTA\n\nAll I needed to read was \"self-diagnosed\" and it was sealed. It's fine to say \"I think I have depression/anxiety/OCD\". It is NOT fine to fail to seek help for those ailments. If your daughter wants to drive herself into an early grave by not taking care of her mental health issues, that's her choice, but she's going to quickly find out that the world doesn't give a single shit about a self-diagnosis. \n\nShe will never get accommodations without a real diagnosis, and you should stop accommodating her.", "I have a sibling with Avoidant Personality Disorder and this is how they behave. It is a very difficult thing to navigate. It is okay to not want to enable them and to encourage them to get help. Snapping at them is definitely counter-productive and can send them into terrible guilt spirals or even into suicide. Be cautious with your approach.\n\nNAH.", "NTA: you’re being manipulated. Has she threatened to “cut you off” whenever you set boundaries?\n\nHas she gotten violent with you?\n\nMoms aren’t perfect. (I don’t need to know what conspired to make her so angry). We make mistakes. Whatever you feel guilty about, apologize to her, offer the therapy and then take a break from her. \n\nShe’s abusing you. \n\nThis will only get worse and she won’t grow out of it. It’s not a phase. Give yourself a break.", "NTA. Anxiety is one thing, being a liar is another. Lots of people with anxiety manage to stay truthful people, and anxiety is certainly no excuse to deceive other people. I am sorry your daughter has developed like this, and I wouldn't give her any more money, unless she changes her ways.\n\nETA: Even if lying can be part of certain personality disorders, like certain types of Borderline for instance, it doesn't mean that the rest of the world should accept it. With proper therapy, the person can learn to cope without lying to your face, and they should!", "ABSOLUTELY NTA, and I'm sorry for saying that about your daughter, but she's TA. I have anxiety and never had lied nor doing things with the excuse of having anxiety to back me up. Sounds like she uses anxiety as a tool to make things for her benefit and not having to deal with the consequences afterwards.", "NTA\n\nHonestly, as someone with anxiety, her approach is unhealthy and unsustainable. I hate confrontation and conflict, and I used to be a really bad people pleaser. But the solution isn't to avoid and lie. You have to address why you avoid confrontation of any sort with a therapist.\n\nShe is being manipulative by insisting that her method of \"coping\" is valid and can't be questioned. I think you have to make some firm boundaries. You can say, \"I love you, and I see that you are struggling right now. But I can't keep helping you avoid confrontation and face no consequences from that. I want to support you, which I why I will help you to see a therapist, but I can't enable your current method of dealing with your anxiety.\"", "NTA I’m right around her age and I used to be extremely forgetful about things, still can be, but I learned to stop running from my wrongs. She doesn’t even need to magically become “fixed and healed” but just needs to start approaching situations differently (for example, texting something like “I don’t know if I want to do it this Friday, how about next week?”) instead of flat-out lying. It’s kind of trendy these days to blame everything on anxiety, so she really needs some new inspiration. If she’s on social media a lot it’s probably what’s reinforcing her beliefs that her anxiety is debilitating, to the point of being an excuse for absolutely everything - like I said, social media these days targeted at young women is going through a phase of making anxiety seem like its a serious mental impairment. Granted, it can be, but that’s exactly what therapy is for. You’re literally offering it for free to her. I just don’t understand how she could pass that up while still using her anxiety as a scapegoat.", "NTA. For one thing, people these days need to STOP with all the self-diagnosing. More often than not, they end up finding out they're wrong about said self-diagnosis. \n\nAnd for another thing, anxiety, or any other mental health issue, isn't an excuse to act crappy.", "NTA. She doesn't want to go to therapy and get help. She's comfortable as she is. You're just going to have to stop helping her.", "NTA. I’m not saying she does or does not have anxiety, but it still doesn’t give her the right to act like this.", "NTA- you said it perfectly OP. Anxiety is not an excuse to lie to everybody about everything. Cut her off. The world doesn't put up with her shit, neither should you.", "NTA. As someone who also has self-diagnosed anxiety (along with a myriad of professionally diagnosed mental issues lol), it seems that your daughter has latched onto some extremely unhealthy coping mechanisms and would definitely benefit from consistently seeing a professional.  Sadly, your support can only do so much; someone needs to *want* to change in order to do so.", "NTA. After a traumatising event happened to me, I had severe, severe anxiety to the point I became agoraphobic. I tried to hide it from friends and family and work because I was so ashamed. I was moody, temperamental and most of my relationships broke down around me. This continued until I snapped under the pressure. Once it came out into the open, my support system rallied back round and I was properly medicated. It is horrific but your daughter may need to hit rock bottom before she is willing to accept help. That was my trigger. Don’t give up on your daughter. My mother was in the same boat with me and she hadn’t known something horrible had happened to me. She just thought I was screwing up. Which I was. But also don’t let her internalise everything to the point where she goes too far. Support her from a distance and let her know you are there when she needs to talk. It’s a good sign she hasn’t cut contact with you. Keep the link.", "NTA but it's time to stop swooping in for the save.  She's an adult and she has to learn how to deal with her situation if it indeed is legit.", "NTA. She is just ruining her relationships because she os anxious about therapy. It happens, I know. Tell her you will be there when she is ready to get help, but that you will not support her anymore if all she does is lie.", "NTA - there is being supportive and there is enabling.  As a parent, I find it mortifying that she won’t reply to attempts to communicate when she doesn’t show up where she is expected to be.", "NTA. Sounds like more than anxiety... maybe a personality disorder? Either way, setting boundaries for yourself and holding her accountable are both good approaches. You did nothing wrong.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, my (f44) adult daughter, “Joy” (f24) is self-diagnosed with anxiety. I have offered to pay for a therapist, and she says yes, but she then misses appointments and won’t bother to reschedule. \n\nThe problem arises when she might have to tell literally anyone something that she thinks might upset them in any way. For example, her father (my amicable ex, m53) will ask her if she’s coming to his house for dinner. She will KNOW she doesn’t want to go, and ISN’T going to go. She will tell him yes, then just not show up and refuse to answer texts or calls to check on her whereabouts.\n\nIt boiled over this morning. She has always had issues with being chronically late to everything from social commitments to her (frequently changed) jobs. As a result, she gets written up and fired quickly. A few days ago, she asked me to borrow some grocery money to tide her over until she finished training at her new serving job and could start making tips. She promised to pay me back in a few days. Today, while I was on FaceTime with her, her roommate, “Violet” (f24), popped into the frame and said “thanks for the groceries, Mama! I wish my Mom helped me like you help Joy when she’s between jobs!” Joy’s face froze.\n\nI smiled at Violet and said you’re welcome, and then asked Joy for some privacy so we could talk. Before I could say a word, Joy starting getting aggressive, calling me unsupportive of her anxiety, and saying that if she told me she’d already been fired, I would have “thrown it in her face” and not “given” her food money. I asked her how I “throw it in her face,” when all I do is tell her she needs to get a doctor/therapist and get a diagnosis, maybe learn some techniques for managing her anxiety or get medication if she needs it? I even offer to pay!\n\nShe said that confronting her over her “coping mechanism” (lying to avoid disapproval or confrontation) is just making her worse. I snapped. I told her that her anxiety is not an excuse to lie constantly to everyone she knows, especially when she has someone willing to pay to get her help. She called me a gaslighter and hung up on me. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You need to stop enabling her by giving her money. She may not even have anxiety.", "> My daughter lies constantly....The problem arises when she might have to tell literally anyone something that she thinks might upset them in any way.\n\nINFO: Is this the result of being raised by a very angry and controlling mother who disapproved of her feelings if they weren't positive?\n\nDid Joy's mother fly off the handle if Joy wasn't being joyful 24/7 and stoking her parents ego?", "ESH. What daughter us doing is manipulative, yes. However I think YOU could benefit from a few therapy sessions. Learn how to be supportive in a way that will benefit both of you while darling daughter figures out her \"anxiety.\" You can't change her behavior, only she can do that, but you can change how you react to her shenanigans.", "NTA\n\nI can see you're doing your best to be a supportive mom, but at this point you're enabling her and she's manipulating you. Furthermore, she turned on you in a heartbeat when you caught her in a lie and got very aggressive with you. \n\nI had a friend who had an avoidant personality and we are no longer friends. She constantly lied to me, manipulated situations and finally got very nasty with me when I called her out on her lies. I learned later from her brother that she has no long-term friendships and has lost many business relationships because she engaged in the same pattern of behavior over and over. \n\nYour daughter sounds like she has a similar pattern of behavior.", "Nta", "NTA. She was petty and rude lying to her roommate making you look bad when you were literally helping her with food.\n\nNot an excuse to be an AH and act entitled.", "NTA! Her constant lying is a huge problem and people need to start calling her out on it and not putting up with her at all\n\nI have seen people use their disabilities to condone crappy behavior. It's disgusting", "NTA. \n\nI’m so sick of people using MH issues as an excuse for shitty behaviour. It might go some way to explain, but she also knows what the hell she’s doing.", "NTA she's a grown woman who needs to get her life in order.  It's hard to do but you'll have to cut yer off because she's using you as a lifeline.  She needs to run out of support in order to fave her situation", "Thank you. You’re right. It is hard to watch her destroy relationships and wreck her life… I certainly didn’t mean to make it worse, but I can see where my “help” has just been helping her avoid consequences.", "The worst part is that she admits that she knows I wouldn’t have let her starve even if she’d told me she’d been fired! She just “didn’t want me to start on her” about therapy again.", "There’s also such a thing as a bad coping mechanism. Alcoholism is a coping mechanism. Dermatillomania (picking at your skin) is a coping mechanism. Brushing everything off is a coping mechanism. I had one for a while where I would start acting/talking more childlike when anxious. Just because something makes the anxiety a little better doesn’t make it a healthy behavior, and therapy is where you learn to tease out the unhealthy and develop the healthy.", "I generally disagree with this idea, people may self diagnose if they don't have the resources to get professionally diagnosed. Finding a good doctor is hard, the tests are expensive, etc. Eventually it's best they get professionally diagnosed and helped but self diagnosing allows them to reach out to others for support in the meantime.\n\nHowever.\nThis is NOT the case with your daughter. You are paying for a therapist and she refuses to go. You offer to pay for everything, there are no barriers for her to get diagnosed. This is on her. She can't hide behind anxiety as an excuse for being bad at communicating and purposely lying to people. I was expecting her to be a teenager but a 24 year old should know better. You can lead a horse to water but you can't make them drink. Stop enabling her but still offer to pay if she actually goes to the appointment. Maybe tell her that if she doesn't go she has to pay for the late/no show fees. No more financial help until she pays you back. It pisses me off that she's demanding you let her continue to lie to people because it's her precious coping mechanism.\n\nI would however recommend she sees a psychiatrist. Therapists don't usually handle meds.  They handle building up healthy coping skills and stuff like that. \n\n(I have been diagnosed with a few mental illnesses and disorders and am lucky my parents paid for the appointments)", "I agree with this completely. Daughter just sounds lazy and immature to me, and just doesn’t want to deal with confrontation in order to have an easy life.\n\nSurely if she genuinely had crippling anxiety then she would want to get it diagnosed so she can get some help", "That sounds like good advice.", "Thank you.", "Can you recommend any good resources for me to learn more about Avoidant Personality? My therapist says that she can’t offer me a diagnosis of Joy based on my descriptions, but I’d like to read up on that.", "Dude, telling a mother she's going to make her child commit suicide over a little understandable frustration is NOT ok.     You can't diagnose a third party with a personality disorder over reddit.", "I really hope that her anxiety isn’t another lie…", "I’m not going to claim to be the perfect parent, but I feel like you’re projecting your own experiences onto me a bit, here. I’ve done everything I can, including going to therapy myself to determine if I might have contributed to Joy’s issues and how I can best help her since she won’t go to therapy herself… Have I reacted angrily when I’ve discovered that I’ve been lied to? Sure. Wouldn’t you? As far as expectations of ego stroking, I’m not sure AT ALL where you got that impression from my post. Again, this seems like a lot of projection.", "I am in therapy (due to my own CSA trauma) and I have discussed Joy’s situation with my therapist. Thank you.", "Don't beat yourself up. My family, especially my mom, did exactly the same because they hated seeing me scared and in pain. I love them so much for how they tried to protect me, it just got to the point where we all had to realize they wouldn't always be right there and I needed to learn how to take care of myself", "I've had similar thought and behavioral patterns to your daughter (although not as severe, and partially tied to a sleep disorder making my anxiety way worse), and the way I see it you've got two main options for how to deal with her (although I don't know which if either will work, and you're really not obligated to follow my advice, lol):\n\n1.) Tie any future monetary support to her attending therapy, and physically drive her to the appointments yourself, watch her get checked in, and wait in the waiting room for her to leave to know she's actually attending the full appointment. \n\n2.) Cut support entirely and see if that forces her to figure things out for herself. Push the baby bird out of the nest, as it were. \n\nWhen I would get into those thought spirals about my own failures (I failed out of college twice), having someone else *know* about those failures, even if they were understanding and loving while acknowledging the reality of the situation, was so shameful it felt like being in physical pain. *I* knew what a failure I was, I didn't need anyone else to remind me of it. \n\nIt sucks on her end, but her coping mechanisms are also wildly unfair to you, her dad, and all of the other people in her life. I will say, anti-anxiety medication is a godsend that makes things feel less catastrophic.", "And I get that to a point…. But it’s gotten to the point that it’s become a catch all for why people can’t do things anymore. Do some have very obvious issues? Absolutely. But even the examples in the OP (common to what we see posted on Reddit all the time) are just examples of somebody lacking responsibility.", "Avoidant Personality Disorder: The Ultimate Guide to Symptoms, Treatment, and Prevention is sort of like AVPD 101, very basic stuff. .\n\nWhen you've graduated from that, \"Distancing\" is a much deeper dive. It's designed for practitioners but you can learn a lot from it.\n\nThere is also an avpd sub: /r/avpd", "I hope so! Maybe you could take her to a therapist and see about her mental health! And also, I suggest you to not loan her alot of money, since she's an adult and maybe is doing all of this because she knows that you're a mom thats gonna help her because she loves her. I wish you the best luck!", "This hasn't been my experience with my own parents and I tend to be pretty honest with how I feel, although I have had a babysitter who I didn't lie to but I did know better than to share any negative emotions with if it pertained to how she treated me because she was very angry and aggressive behind closed doors as well as emotionally/psychologically abusive. \n\nIt was more a question out of curiosity because I noticed you are minimizing her anxiety by saying it's self-diagnosed (when anxiety can relate to an overall feeling), you seem to overlook that lying is a coping mechanism often related to childhood trauma, you haven't mentioned anything to do with how you or her father treated her, and you mentioned you snapped (and she mentioned you gaslighting her).\n\nI'm not saying that lying is healthy nor that you don't have a reason to be angry or feel manipulated, and I was admittedly asking in an assholish way...but it was a question I was curious about and wanted to ask before giving my judgement.\n\nIf she won't go to therapy, maybe see if she is willing to go to family therapy since this does impact your relationship and if you or your husband are expecting more honesty then she probably needs to see that it's safe to be honest with you guys. Also, accept that she might not be willing to do any type of therapy because she benefits from her lies and in that case you'll need to set your own personal boundaries for yourself and what you are willing to tolerate.", "Oh, my. I think I will give her a few days to calm down and then offer her help but make it conditional on my taking her to therapy.", "I guess I've personally known more people who had to self diagnose cause they couldn't afford professional diagnosis than people doing it for attention. In middle school it was common to do it for clout (those people did end up having mental issues but not the ones they claimed they had) which is why I was shocked that her kid is 24 and doing it. I've had a ton of issues with the medical institution and sympathize with those who struggle with it even more than me. Some illnesses are invisible and not obvious to anyone but the person dealing with them (I have fibromyalgia and no one can tell unless I'm using my wheelchair) so it's more about the reasons someone self diagnoses rather than about the diagnosis itself. I don't go on TikTok but I've heard it's become common there to do it for clout. But it's mostly teenagers doing it I think", "Thank you!", "I didn’t mean to minimize it, honestly. I just wanted it to be clear that she doesn’t have a diagnosis (and I feel that the lack of diagnosis is impeding her recovery/treatment). I’m so sorry you went through that with an adult in your life.", "Thank you, and I apologize for being an asshole and accusatory in my approach.", "It’s okay. We all paint the world with our own experiences."]}