{"id": 33351, "submission_id": "18m29c4", "title": "AITA for not inviting my boyfriend to come on a trip that is significant to my family history and going with my friend who shared that history?", "selftext": "EDIT: for everyone asking, we’ve been officially together for 3 months. We were *very* casually saying for five months before that but I don’t count that as us being “together” because he was dating other people \n\nMy friend “Alek” and I have known each other forever because our grandfathers were friends. They became friends as a result of the Holocaust. They grew up in the same area, and my great aunt saved Alek’s grandfather’s life. They survived, and emigrated to the same country where they remained friends their whole lives. Our families are very connected. Last month, on the anniversary of my grandfather’s death, Alek and I began discussing taking a trip to my grandfather’s birth country, and other places associated with their lives. We decided to take the trip for three weeks early next year. \n\nMy boyfriend “Ezra” is mad that I didn’t invite him. I told him this was a trip about my and Alek’s family history, and something we wanted to do together to connect with our heritage, it’s not a resort vacation. He said he is hurt that I don’t want to share this with him. I keep telling him this isn’t chicken nuggets and I don’t want to share, this is something that just patently doesn’t include him and something I just want to do with Alek, and he’s being irrationally jealous. \n\nFriends I’ve spoken to say I absolutely have the right to go, but they don’t blame him for being hurt that I want to go travelling with another guy. They say I should maybe invite him for a few days if the trip and if I don’t want him to come to specific places that’s fine but I should find a way to include him on the trip. I don’t think I should have to invite him just to pander to his jealousy and fomo. \n\nAITA for not inviting him?\n", "created_utc": 1702993596, "permalink": "/r/AmItheAsshole/comments/18m29c4/aita_for_not_inviting_my_boyfriend_to_come_on_a/", "score": 1289, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because my friends say I should be more considerate of his worries and that it’s not a bad thing that he’s interested in my family history\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Ezra is barely your boyfriend. He may not even *be* your boyfriend by the time you go on this trip. Alek is a lifelong friend who is going to be around way after Ezra. \n\nEven if this was a more long-term partner, I still don't think you would be an AH for wanting to take what is going to be a very special, and probably very emotionally charged, trip with a friend who has a similar background and is going to under stand what you're going through. The very short term nature of the relationship is just icing on the cake. Also, you call your boyfriend \"Ezra\" which is a Hebrew name, but is Ezra Jewish (religiously or ethnically)? Because if Ezra is also not Jewish, this trip is not going to have the same meaning to him.", "Edit to add judgment since she provided the info NTA. I don't see the relationship lasting but they've only been together 3 months so nbd right. I would have called her the AH if she'd been this dismissive in a 2 or 3 year relationship. \n\nInfo : how long have you been dating Ezra?\n\nEta reason for asking is if it's been a couple months of dating and not really serious I could understand him not coming. But if it's a serious relationship, and prospects of a future together saying that it's not his business or family could look bad.", "Yeah very NTA - you’ve been with him for 3 months, you have no idea if you travel well together and if they’re compatible for this. Especially with international travel involved, you don’t plan that with 3 mo long relationship. \n\n3mo is still in the “considering what a life could maybe look like stage” it’s definitely not the “practically married” stage. But also, it wouldn’t really matter, even if you were married to him, that doesn’t stop you from being your own person with your own friends and interests and yes even sometimes your own trips. \n\nAlso, as someone with a similarly blended family of generations (different shared experiences to form it) that’s like planning a trip with a sibling or a cousin. But also, I’m sorry, fellow commenters what is so magical about the male gender that dating one completely destroys your ability to have any other relationship with any other??? No one in the world has ever suggested that my girlfriend was going to be jealous when I planned a trip with a group of women. So that’s just weird and gross. \n\nAlso this trip is more akin to a pilgrimage then a vacation - it’s not about joy and it’s not about teaching some new guy that may or may not be in it for life, it’s about returning to a very traumatic place and walking the steps their ancestors were forced to walk. That’s brutal heavy stuff, that’s not a moment or a place to try to bring some new fellow “into your culture”", "NTA, but just be aware that you will definitely be single by the time you get back from your trip. \n\n3 months is too early to be inviting him on a trip of such significance, but he also has every right to be upset that you’re going on a trip  for 3 weeks by yourself with another man, regardless of the circumstances. But it doesn’t sound like this will really bother you, your tone about him through the whole description says that you’ve already checked out of the relationship.", "He's barely been official 3 months and wanna strong arm his way onto your highly personal trip?\n\nNTA.\n\nAnd to whomever saying \"Oh but it's understandable that he's jealous you're travelling with some guy\" I'd say \"Well he wants to include the time he spent /dating other people/ as time he has been /dating me/. So I call BS.\"\n\nETA, I was under the mistaken impression Ezra thought their relationship was 5 months long. He thinks they've been dating for 8, just that 5 of them were super casual and he was seeing others.", "NTA\n\nThe edit makes this pretty simple in my eyes. You have been together for 3 months... When you started planning the trip it was 2 months. NO ONE should be expecting to go on a trip like this when you literally JUST started dating. Look at his jealousy and consider if you want to deal with this in the future.\n\nI hope you have a fantastic trip with your friend!!!!!!", "3 weeks is a LOOOOONG time to be traveling with someone you’ve only been with for a few months. Adding a 3rd party to that is the recipe for disaster and will surely take away from the experience you are going for. It definitely wouldn’t be fair to Alex.  As a side note though, there’s a tone in your post I can’t quite put my finger on, but I get vibes that you don’t even really like Ezra all the much.", "I think you are completely in the right to not invite him. However he is in the right to feel upset. I am not sure how you communicated this with him. However if you explained clearly the significance of this trip and reasons why then it is what it is. He'll have to learn to deal with it. You don't always have to do things together, and I wonder if he'll be reacting this way if Alek was female.   \n\n\nI know others have asked but depending on how long you've been together might also factor in on also why be upset. He might interpret you not wanting to share this with him as something more. But again, there are things/experiences that you do not have to share. Friends have things that they want to do solely together and this is clearly something that is one of them. Especially since it is something that Alek and you have wanted to do for a very long time and prior to you dating your bf.", "NTA- 3 Months is nothing. Hell, you've probably been planning this trip longer than you two have been together. Yes, you are being a little crass, BUT also this is your first time visit to something that has a deep historical context for you and your friends family. \n\nIf he is being jealous now of a lifelong friend going on a trip about shared family history. Not going to the beach and having drinks. Imagine how he'll be in 6 months. A year.", "NAH.  It's just a question of different commitment levels.  Your boyfriend is serious about you, and you're not serious about him.  You have indicated that to him by making this decision, which is why he's upset.  Go ahead and end this relationship, it's unkind to string him along.", "Your NTA, but neither is your boyfriend, If you dont like him enough to have given him a heads up or ask about it, you probably dont like him enough to date him. Thats totally fine, and not a slight on your part at all, but its just a sign that you and this Ezra guy probably arent compatible. If you have known him for 8 months and he doesnt feel confident about you going on a trip with another dude, and you didnt feel the need to give him a heads up in planning it or invite him along, then it seems like its just not the best relationship for either of you", "NTA.  Like you’ve tried to explain to him, this isn’t a trip to Disneyland, it’s more like a pilgrimage for you and your friend, you don’t want some guy you’ve been with for a few months whinging and whining about what he wants to do and not “getting” what you’re both trying to achieve.\n\nLike everyone M has said he has a right to feel left out and sad to be left for 3 weeks, but surely he’s a big boy and can accept that sometimes people have to leave town for a bit.  Would he still be insufferable if you had to leave for 3 weeks to look after an ill relative?", "This sounds like less of a 'I want to know your background and heritage, teach me' and more of a \"I don't like you travelling with another guy\". If you're expected to bring him BUT HE DOESN'T EVEN GO WITH YOU TO THINGS LIKE MUSEUMS AND THE THINGS YOU TWO ARE DOING THEN WHAT'S THE POINT? Something like this is an all or mothing kind of thing. It's not like the two of you are going skiiing or anything. You're literally going to see your history. And if he just wants to \"be there to be there\" then that's not celebrating you or your heritage or history. That's literally just being a baby till he gets what he wants.\n\nHe can either trust you, or sulk like a baby till you get back.", "Just another thing to add, I was dating a girl and things had been going similiar to what you and your boyfriend have been (couple months of not really being together, and then a couple of months of dating). While we were dating she told me that she had booked tickets to go visit family in europe with one of her friends (they also had been close family friends for quite a while) I knew that her family history meant a lot to her, and I was totally fine with her going, but was a little hurt that she planned a 1 month trip with another guy and didnt tell me anything about it. I voiced this to her and we had a great conversation about how she understood and she didnt mean to be dismissive towards me or anything. It really helped me feel better and I didnt have to feel like I was just a afterthought. She went on the trip and had a great time with her childhood friend.and I didnt have to worry. Anyways after the month in italy, she came back home, broke up with me 2 days later, and moved in with her childhood friend.", "Of course, I recognize the connection and emotional bond you and your friend share. This isn’t a beach holiday. But take a moment to consider how you would feel if your SO went on a 3 week trip somewhere and didn’t want you to come along. I also would be jealous and I think if you’re honest with yourself you would be also, no matter the circumstances. NTA, you aren’t obligated at all, but don’t dismiss his emotions as petty.", "Why not just break up with him? From all that I’ve read from your post and a few comments you’ve made, it doesn’t even seem like you really like him. I can tell you what’s most likely going to happen if you don’t dump him before this trip. He’s going to annoy the shit out of you during your whole 3 week trip. He’s going to bombard you with text/call/FaceTime, which will inevitably lead to fighting, and more than likely an overly dramatic break up. Which then you will be TA, because you’ve unnecessarily brought relationship drama on a trip and ruined the trip for Alek.", "NTA because you’ve only been together 3 months. If you had been together a year or more or if he had perhaps met your grandfather, I would vote differently. It’s pretty crazy of him in my opinion to expect to be invited to a THREE WEEK LONG vacation after being together for such a short time. I’ve been dating my boyfriend around the same amount of time and he also just went on a 3 week international trip (alone). I would have felt truly insane and overstepping so ridiculously hard to be like hi :) i want to come too :)", "NTA\n\n3 months is nothing. \n\nGo on your trip with your friend.", "NTA. Your trip is incredibly personal and meaningful and I think you have every right not to invite someone not connected to the people & places you intend to visit. As well intentioned as Ezra may be, this doesn’t seem like a trip for him if that’s your preference. I personally would not like to go on this sort of trip with someone I didn’t have a serious commitment to. If you break up, your memories of this very meaningful trip will include an ex boyfriend!", "NTA. Is your boyfriend truly going to want to be on a trip with you that has nothing to do with vacation spots or romance? No. This is not some fun, exciting adventure. This will be you retracing roots and a dark time in your family history. If you are still a couple years in the future, you can do the trip again as a family.", "You've been together for 3 months & he wants to go on holiday with you?\nTBH - I wouldn't want to go on holiday with someone I'd been going out with fir 3 months, no matter where the trip was!\n   \nI think NTA, for me, like I said, too soon, especially since, like you said, it's not a vacation type of trip. Its likely to get emotional, for both you & Alek, and your bf would be a spare wheel.\n  \nI can understand him being upset that you're going without him, but he needs to put his big boy pants on & deal with it. If you & Alek were more than friends, I'm sure something would've happened before now.\n  \nI also understand him wanting to share the experience with you, but there's plenty of time for the two of you to do a similar trip, when you've been together longer.\n  \nTell your bf that you understand his concern & reassure him that the 2 of you are just fine & that you'll go there with him at a suitable time. Tell him stories of you grandfather & family when you can. Stay in touch while you are away. Make sure you notice how you feel about bfs behaviour, imparticular any uncomfortable feeling & don't ignore them!\n   \nTake the trip with Alek, find your history & heritage, connect to the events of the past. Have a wonderful time & bring back amazing memories & photos you can share with bf & anyone else whose interested.", "INFO: How serious it your relationship with Ezra how long you been together?\nEdit: after reading comments I say NTA. He wouldn’t appreciate the meaning at all.", "Sounds like you don't intend for him to be in your life long-term because if you did this would be a good bounding experience so he understands your family history.\nMy daughter did a similar trip with a friend from school and they still talk about it 20 years later. \nYour boyfriend will never have this bond because you didn't include him.\nMaybe you don't see a future with him.", "This is something you have to do with your friend. Ezra has to understand that he’s your SO but he’s not someone who needs to accompany you on this specific trip. You can take a trip with him at another time.", "NTA, this is a deeply personal trip for you and your friend. While I get your bf wants to join you, they should respect your need for privacy and to maybe not have to share this experience with someone who hasn’t been directly affected as well.\n\nI wish you and your friend both the best for your trip!", "The biggest NTA I’ve ever read.", "NTA. Your bf need to a) respect your wish and understand the trip isn’t spring break holiday, it’s an important pilgrimage to yours and Alex’s grandfathers’ home country, and b) he need to deal with his own jealousy and trust you. \n\nYou do not need to invite him, period.  If he doesn’t understand the significance of the trip for you and Alex, then he have some growing up to do. And you are correct, you don’t pander to a partner’s jealousy.", "NAH .  You have every right wanting to go with your friend but agree with your friends that it’s reasonable for your bf to be upset you want to take an emotional trip with another man, especially since he doesn’t understand the bond you have.  It’s ultimately your choice and something you and your bf will have to work through together.", "NTA. You've dated for 3 months? I wouldn't bring him either. You've known him for 5 months? Okay? You barely know the guy, lmao. \n\nI can understand the jealousy of going on a 3 week trip with another guy instead of your boyfriend, but jfc you've been dating 3 months. It would make sense if you guys were in a serious relationship. \n\nJust reassure him that your friend is only a friend, you guys have had this planned for long before you got together, and just stay in contact with him, ofc. \n\nLikely your boyfriend is afraid you will cheat on him or have something going on with the other guy, but that's because he's the new one coming into this. He doesn't understand the family type connection/bond whatever, which isn't necessarily his fault but you try to get him to understand. \n\nWhat I would do is this: do the trip as originally planned. Stay in contact, assure him nothing funny is going on. \nPromise him just the two of you, will make a similar trip soon enough so you can explain, educate, whatever else the stuff to him. \n\nI don't mean to sound crude here, but simply put, you have been dating for 3 months, known each other for 5 months. You don't owe him anything. \n\nIt'll be hard on the bf to get over it, but he will once you're back.", "NTA\n\nThis man is barely your BF and he's throwing tantrums like this? I highly doubt you will be together by the time this wonderful trip takes place if this is how he's behaving so early on in the relationship. Ignore him and have a wonderful time!", "NAH. Neither of you is wrong for feeling the way you do. 3 months isn’t very long but you are a couple, after all (and have known each other and been seeing each other casually for longer; you didn’t just meet 3 months ago). 3 months is long enough to feel invested in building a deeper bond with someone. If you can see the relationship having longevity, it’s reasonable to want to go on a trip with someone even that early. \n\nI do think it would be important to emphasise that this is about family history, not a romantic trip, and you absolutely don’t want Alek to feel like a third wheel, so it won’t be super couply-couply and might be a tad awkward at times with a third person around and therefore Ezra might not prefer it and you won’t be tolerating behaviour that makes Alek feel excluded. There might be a few excursions that you’d rather go with just Alek too. You can try and have some couple time too but only when Alek has other things to do, so you might pick out things he would enjoy and you two wouldn’t so each of you can get some ‘you’ time.", "NTA \nI brought my boyfriend of two years on a big family trip (once-in-lifetime thing, although not significant in the way OP trip is) and we broke up 2 years later. I kind of regret it, with him being in all the pictures and I felt during the trip I had to take care of him and couldn’t fully enjoy the family time that should have been associated to the trip.\nWith the goal of the trip, I understand you not wanting your fairly recent boyfriend to come along. And although I get why he could feel insecure regarding you going with a male friend, if he trusts you it shouldn’t bother him that much.\nAll that said, communication is important and how you presented things clearly makes a big difference.", "NTA.\n\nA 3-month boyfriend throwing a jealousy fit over a trip like this is a red flag. Especially since he's the one who was seeing other people during your casual phase. Talk about projection.", "NTA i think in the context you described you are not an AH. I assume there is no romantic history with Alek. I dont think its that unusual to sometimes take trips with friends without an SO and the purpose of the trip you describe is really specific and explains why its a trip you want to specifically do with Alek. \n\nI can understand Ezra feeling sad and wanting to go. But i dont think that makes you an asshole.", "If you had been in a long term relationship with him I would have said take him and let him share your family memories. As you've only been with him 3 months ( I've had bar crawls last longer) I would say no you are not the ahole as your relationship is still in very early stages and your friendship with Alek the strongest factor in all of this. Don't give in to him as for a 3 month relationship he's being very clingy and demanding. Red flag alert", "I agree with your friends—NTA for wanting to go on a trip with your close friend. But sounds like you’re being dismissive of Ezra’s feelings.", "NTA, but don’t be surprised if boyfriend leaves you.  I’d break up with my girlfriend the day she left to go on a trip with another man this early in a relationship.  Life is too short to deal with stuff like this even with nuanced circumstances.  So NTA, but naive if you expect this relationship to last.", "I mean I think it'd be worse to invite him but then tell him \"stay in the hotel for now because I want to do this with Alek.\" \n\nESH\n\nCome on, OP. \n\nYou're going to be gone for almost a month. \n\nYou basically said \"it's none of your business\" - of course that's hurtful. \n\nI also think it's kind of insensitive of you to brush him off with \"stop being irrationally jealous.\"\n\nUhhhh it's not irrational? \n\nYou told him to his face that he can't be apart of your trip because \"you're not one of us.\" \n\nI'd be like \"well damn\" too lol.\n\nHowever, y'all are a baby couple lol. It is BOLD of him to insist he be invited on a trip that predates him even being in the picture. \n\nAnd to be truthful - I think it'd be rude to Alek to all of a sudden be like \"and my bf is coming so buckle up.\" \n\n**What I would do**: \n\nI'd tell him that if he really wants to learn more about you and your grandfather then maybe you two could go together in a few months in your own separate trip. \n\nI'd also offer to help brainstorm a completely separate trip for just you and him that has nothing to do with either of your heritages. .", "NTA - If you'd been dating for a year or more you'd probably feel differently about including him but after only 3 months his entitlement may be a red flag. Have an amazing trip with your BFF. Be honest with yourself if there is something \"more\" going on with your guy friend Alek. Not for Ezra's sake but just for your own awareness.", "NTA, you're trying to heal deep family trauma. That's not something you take your newest love interest to. You'd have to fill him in on every family story the entire time, nulling the point of the trip, which is to understand your grandfather and his struggle better. \n\nHonestly I'd dump him so you don't have to deal with that drama during this very important trip. \n\nBare in mind that healing trauma like this will likely draw you closer to your family friend, and may eventually result in evolving your relationship. This could eventually result in romance which might not be a bad thing. \n\nI wish you all the best on your trip. I know it will be hard. Update us later on please", "Here's what i'm getting from all the comments.\n\n3 months is nothing for a new relationship! do what you like! \n\nAnd\n\nHe should trust you, and if he can't he's just insecure and jealous! \n\nSo the length of the relationship is short enough that she shouldn't care about his feelings on the matter, but he should trust her without question? This is OP half arsing the relationship because it's new and getting annoyed because he isn't.\n\n&#x200B;\n\nEzra's problem is definitely more to do with going alone with a male friend than anything else, but he probably knows he can't say that as you're already treating his feelings like they mean absolutely nothing to you.\n\n&#x200B;\n\nPeople who are talking about trust like it starts at 100% and should never fall below it are insane. Trust isn't something you should expect regardless of your actions. Trust is built over time and constantly reinforced through your actions. Once you're in a committed relationship you should honestly stop spending ( with some exceptions) 1 on 1 time with \"friends\" of the opposite sex out of respect for your relationship. That's how trust is built. Acting like you can do whatever you want and expect to be trusted no matter what you do is a shaming tactic used by a lot of people who are up to no good. Do people really believe it's respectful to organize a trip with a member of the opposite sex for 3 weeks without discussing it with their partner first? Only being with someone for 3 months is a disgusting excuse to disregard the feelings of your partner.\n\n&#x200B;\n\nWanting to do this trip with Alek isn't the problem. It clearly had meaning for both of you. It's the attitude you have with regards to how Ezra will naturally feel about it. You don't consider his feelings to be important or valid, and for that YTA. And if you have any kind of history with Alek AT ALL, you absolutely shouldn't be going alone with him while in a relationship without it being discussed with your SO before anything has been decided.", "NTA.  3 / 5 months is still a very new relationship.  It could end any time and then this guy is going to be in all of your memories / photos of this trip.  If this is the straw that ends the relationship, so be it.  He's not mature enough to understand why this is not the trip for him to join.", "You are going on a 3 week long trip with ANOTHER guy to a different country, just the 2 of you. You don't see the issue with that? It doesn't matter what the reason is. That would be a deal breaker for me. \n\nWould you be comfortable with him going on a trip with another woman for 3 weeks? \n\nI would not be surprised to see a post saying Alek hit on you, you cheated on Ezra with Alek, or you and Alek are a couple after the trip \n\nYes, I think YTA", "Ezra has a boundary. He has every right to have a boundary. He has to decide what he wants to do with that. This is an \"asshole\" story that is lacking an asshole. My opinion.", "It is clear you guys haven't been together very long and are still trying to figure out rather you both are ready for relationships at this point. I'm 37 and I remember a time were couples use to date with the intent of marriage. Relationships we're built with love, patience, understanding, permanence. This new age quasi relationship doesn't leave much room for understanding. \n\nNo man or woman has ever been ok with their significant other going away for prolonged periods of time, especially in the infancy of their relationship. At that point you guys should be still ga ga over one another and wanting to spend every waking moment together. The fact this isn't the case makes me wonder if something else happened and you are just viewing this relationship as a time passer or not.\n\nLastly, it is jealousy, it is not controlling it's more of a matter of respect for one another. This generation get that confused a lot.", "NTA he’s gotta put more work into the relationship to get the honor of being considered", "Three months?  Tell him to stop being a baby, that this doesn’t concern him.  Three months…….\n\nNTA", "I take it this is a new relationship that you don't really see going anywhere and that Erza isn't Jewish.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy friend “Alek” and I have known each other forever because our grandfathers were friends. They became friends as a result of the Holocaust. They grew up in the same area, and my great aunt saved Alek’s grandfather’s life. They survived, and emigrated to the same country where they remained friends their whole lives. Our families are very connected. Last month, on the anniversary of my grandfather’s death, Alek and I began discussing taking a trip to my grandfather’s birth country, and other places associated with their lives. We decided to take the trip for three weeks early next year. \n\nMy boyfriend “Ezra” is mad that I didn’t invite him. I told him this was a trip about my and Alek’s family history, and something we wanted to do together to connect with our heritage, it’s not a resort vacation. He said he is hurt that I don’t want to share this with him. I keep telling him this isn’t chicken nuggets and I don’t want to share, this is something that just patently doesn’t include him and something I just want to do with Alek, and he’s being irrationally jealous. \n\nFriends I’ve spoken to say I absolutely have the right to go, but they don’t blame him for being hurt that I want to go travelling with another guy. They say I should maybe invite him for a few days if the trip and if I don’t want him to come to specific places that’s fine but I should find a way to include him on the trip. I don’t think I should have to invite him just to pander to his jealousy and fomo. \n\nAITA for not inviting him?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "well im israeli, i already did the high school trip to poland, so most israelies have dont the holocaust trip. but even if i havent, i would still prefer to have my boyfriend there.\n\nmy boyfriend is korean, he doesnt know as much about my culture obviously, so personally i would like to share important things like that, so he can also understand me and my people better, just like i enjoy indulging with his culture.\n\nim personally dont believe in having close friendships when dating, but if you are the type of person who keeps close guy friends, regardless, your partner should be above, your friends shouldnt be equal to your partner. if i told my boyfriend hey, if you dont accept my guy friends we wont date, im basically saying hes on the same level as my guy friends.\n\ni used to have guy friends when i was younger, but im sorry, no matter how close i was to them and cared for them as people, i would never choose them above my partner. my partner is someone i would built my future with and a family, not my friends. and my friends will find their important person as well. so to me its amusing how people can put their friends on the same level as a person who supposed to be the closest to you. \n\nwith time, uni, going abroad, me and my guys friends, we all got into our own relationships, and we naturally put distance and slowly stop talking as often. it wasnt personal from any side, just the natural thing to do.\n\ni think what i was doing with my guy friends at age 16-18 was normal, because we were young, we didnt have any responsibility in life, we always hung out because we had time, we werent building our life yet. so i think it was appropriate at that age. \n\nbut if im thinking about my mom, if she one day goes on a trip with some man, that would be weird, not appropriate.\n\nso i naturally with life, kept distance with so called guy friends, and we have our own life. \n\nand to me i will find it inappropriate to go on a trip with a guy. \n\nluckily, me and my boyfriend think the same and have the same boundries so we didnt have any issues.\n\nbut what i would like to say is, regardless of your own boundary, just because someone isnt comfortable with the idea of their partner going on a trip or anything in a similar fashion, doesnt mean they're insecure, the opposite, they have enough intelligence to read a situation and articulate theyre feeling directly instead of keeping to themselves and being passive, and putting their own boundaries. \n\nnow obviously, you dont have to agree to his boundaries, but hes not wrong to have them nor is he insecure. \n\ni have been in situations in the past when i had still close guy friends, situations where it affected my relationship and cause bad feelings, and i had to think to myself whats worth it, is it worth to make my boyfriend feel uncomfortable or give my boyfriend any reason of doubt , or any reason to distrust?\n\ndo i really need those guy friends, what do they actually add to my life, are they more important than my relationship moving forward in the future?\n\ni did my own thinking and to me it was an easy answer, that no, its not worth getting into stick situations, the pros dont outweigh the cons for me.\n\nso i never had situations with my current boyfriend, i never have put another man above him.\n\nbut when i was younger, with my first boyfriend ever, i have treated him like my guy friends, and didnt always put him first, and he also did the same with his female friends, and after a few years the whole friend thing blew up in our face, when we were planning traveling abroad for many countries, were people who travel often, not just a one time thing.\n\nso it blew up, and it wasnt the type of relationship i wanted where i need to guess my place among those other women he had in his life. and same for him.\n\nso i think at this point, you guys as a couple should have a general talk, what is your stance about opposite gender friends, what youre fine with doing and what not, what is your guys actual standart, can you even agree on something? \n\nbecause if you dont come to an agreement or some boundary you both accept, more situations like these will arise, and it will affect your relationship and the way you feel about each other. \n\nso hear him out, hear his reasoning, and come to an agreement, and if you truly cant, maybe youre both in the wrong relationship.", "NTA\n\n💯% get why you’d want to take such a personal and emotional journey with Alek. Go for it and don’t give a second thought about not inviting Ezra as this trip sounds way more important to you as a person than Ezra - who most definitely would change the entire vibe of the trip. \n\nYou’ve made that choice - and it sounds like the right choice for you right now. Just realize that you’re effectively breaking up with Ezra with this decision. And that’s ok. This trip is clearly more important to you than pandering to Ezra’s feelings.\n\nOf course Ezra is upset. Partly because you’re traveling for 3 weeks with another guy. While understandable, this points more to pure jealousy and lack of trust in you and your relationship. MANY relationships would not withstand this - especially new ones. (I personally think that’s BS and unfounded jealousy is extremely toxic, but that’s pretty outside the norm).\n\nMore importantly, you’re going on a the most meaningful personal and emotional quest in your life and you’re explicitly excluding your bf. While I completely understand and support your reasoning, of course Erza wants to be there with you. It would be an incredibly bonding experience and the two of you would likely emerge closer than ever before. But you don’t want that. With him. You want that with Alek. \n\nEzra knows the emotional connection you’re deliberately excluding him from and feels awful to be excluded from that. That’s quite understandable.\n\nBut it’s also understandable why you want to experience that with Alek instead of Ezra. And that’s ok. But in choosing to share this deeply intimate experience with Alek instead of Ezra, you’re effectively choosing Alek over Ezra, so don’t expect him to be there when you get back. \n\nIn fact, given your mindset and his reaction, it may be better to just break up or put your relationship on hold until you can reevaluate it after this trip. This might even open up the possibility of potentially rethinking your relationship with Alek after just an intensely, emotionally bonding journey if that could be an option.", "Idk abt y’all, but i wouldn’t be okay with my S/O going on a 3 week vacation with someone of the opposite gender, alone. Just because y’all have only been dating for 3 months doesn’t mean he should be okay with that", "NTA, and you're right about everything you said in your post.\n\nThe only thing I'll point out is you don't seem to have any real understanding of his feelings and seem completely dismissive.  Even if you are partially insulted he would insinuate something would happen between you and Alek (he just started dating you and you're going away for three weeks for a man you've known a lot longer than him, for an emotional journey), do you at least understand where his irrationality is coming from?\n\nIf so, and you're simply not including that in your post and comments, all good.  But if you haven't, you sound pretty apathetic about his feelings, and I'm wondering if you actually want to be in a relationship with him.", "NTA you have known him for not half a year and he wants to go to an important family heritage event he’s basically a stranger", "Take the trip. Dump the bf.\nNta", "Given how you've been talking about him,I would suggest breaking up because you two are clearly are incompatible.", "NTA! Something about best friends romantic partners especially early on need to learn. The best friend Is already going apart of any wedding you have and the romantic partner especially early on... well their place is less than guarenteed and your bf seems to be self removing himself as this is progressing.", "NTA. Three months may not be long enough for you to be ready to share something that's obviously very heavy and extremely meaningful to you. Anyone who says that you should have let him come don't seem to realize that three months is NOTHING when you need time to come to terms with sharing.", "I’ve been married 16 years, we have children, and I think you’re right. If my spouse wanted to take such a trip, I’d understand. I’d go if it was important TO THEM that I do so, but I think it would be disrespectful to insert myself into something to which I really have no visceral connection. \n\nNTA", "NTA at all and honestly, I think your friends were wrong in saying they don't blame your bf for feeling hurt. If had any empathy or just understood the purpose of this trip, he wouldn't act that way.", "Nta girl you’re barely past the 3 month rule and he is doing this? I don’t think this relationship is going to last or that it should last. Don’t destroy a life long friendship over a 3 month relationship that is probably going to not past that much longer. Also I doubt he is even wanting to go because of what the trip is, he wants to go because he doesn’t trust you with your life long friend. This already doesn’t seem healthy to me. But if he wants to go to learn more about the holocaust then I don’t see a reason for why he can’t maybe he just wants to learn more. But who knows, you should ask him more in depth about why he wants to go.", "NTA you're together for 3 months, you're basically strangers to each other lmao", "NTA. But this relationship is over. Just go on the trip with the friend.", "NTA but also don’t expect this relationship to last", "NTA your bf trying to count 5 additional months were he was having sex with other people is gross and manipulative. I doubt this relationship will survive him staying home OR going.", "NTA. \nThis whole convo should be free information about this dude and your future together. \nDump this chump and the drama that goes with him.", "NTA, I could understand right up until i saw how long you guys have been together. It would be reasonable (albeit something to be broached gently by him, given the subject matter) if you guys had been dating like 6 years and were planning marraige and he wanted to understand your family history better, but at a few months its absoloutely none of his business and honestly sounds more like he's jealous of you going on what he percieves to be a holiday (obviously its more serious than a holiday, but i'm getting the vibe that thats how he's acting towards it) with another guy", "NTA you guys are casually dating and you are NOT engaged, in a long-term relationship or married.   You're right, you don't have to pander to his jealousy.", "NTA- you guys haven't even been together for half a year yet.  I wouldn't call 3 months a \"serious relationship\" yet.  I wouldn't ever imagine going on a 3 week vacation with someone I've been dating for 3 months, much less a trip like this one that is really about family.", "Nta. You have not been together long enough for him to have the right to have issues. If he is hurt that is 100% on him. It is a red flag he wants you to bend for him already", "NTA. He has the right to be hurt, it makes sense. You *do* want to go on a trip with another guy, but who cares? It's been three months, you're not married to him. Don't feel like you have to include him if you don't want to. If he doesn't understand then just let it run its course.", "Nta\nWhy would he need to go? Just feels insecure, he wants to go because your literal life long best friend is a guy. Like if you guys wanted to be dating you would have. This is a sad n emotional trip about your culture and family. \nIts nice if he wants to learn but this trip is not the time. Thats incredibly selfish and insecure. \nThree months is no time at all, and saying if you wanna think about the long term with him, like no. Theres other ways to bond. Everyone that thinks otherwise this is the same as him wanting to be invited to her grandpas funeral. Are you bringing a stranger to your grandpas funeral???? No.", "Does Ezra ask to go on business trips with you? My guess is no. Your trip with Alek is a business trip, family business. This isn't a quick trip to Capri for shopping. This trip is going to be emotional with remembrances and heavy with history. Thank you for not forgetting your history and remembering the struggles of your forebears.", "NTA. You haven't even been dating that long. Even if you had been, it's okay to have areas of your life separate from him. You're allowed to take trips with friends who are not him. I would suggest talking it out with him and asking why he's so jealous/upset over this. Is it purely jealousy and him being insecure over your relationship (possibly due to past experiences, or ingrained beliefs that he's unlovable and thus you won't stay?)? Does he feel unappreciated in the relationship and it came out in an unfortunately charged way when a big event triggered those feelings for him? If he can communicate with you why he's acting this way, you can figure out compromises (ex. a date night or a specific activity to do with him) and reassure him of his worth to you that being said, a long term friend with such history should be worth more than a new boyfriend, and if he can't accept that, he has problems he needs to sort out. If he can't even address and express why he is feeling this way or understand why it's irrational, I personally wouldn't be able to stay in this relationship if I was in your shoes. If my partner ever stopped trusting me around other guys (provided I'm not flirting/cheating/etc. - that would justify it), I'd break up with him and question why he's even dating me if he thinks I can't be trusted.", "NAH. I think it's totally fair to do this trip with a longtime friend versus a recent boyfriend. But I also think it's fair to be unhappy that your significant other is going on a trip with someone of the opposite gender and specifically doesn't want to involve you in this emotionally.\n\nAgain, fair that you don't want to involve him, but not surprising that he would be a little hurt or at least concerned. It's reasonable for it hurt to find out that you want to be more involved in your partner's life than they want you to be. And it doesn't sound like he responded with unnecessary anger, so I wouldn't call him an AH for those feelings.", "NAH -\n\nYou  have an extended, shared familial history with Alek and the place(s) you want to visit are going to be a shared connection between the both of you. It will be a meaningful trip that you'll remember forever.\n\nEzra does not know Alek. He does not have a relationship with Alek. He has a relationship with you. You do not want to travel with Ezra - you want to travel with Alek. Ezra does not share the connection with the place. His jealousy is not irrational.\n\nIt is obvious why Ezra is going to be jealous and you're absolutely uncaring of why. You want to take the meaningful trip with someone who it will also have deep meaning for. Ezra needs to spend a little more time working to understand why you might now want to go. Everyone involved has reasonable opinions. No one is specifically being an asshole and you're literally navigating being in a relationship. It really would not be surprising if when you return from your trip, you’ll have learned and experienced a lot with Alek - but you will be single. It’s not a bad thing necessarily, just timing is a major piece of a relationship. Timing may be off so things don’t work out through not major fault of anyone involved.", "These comments are very shocking to me! NTA (it’s been 3 damn months!? Like, chill you guys).\n\nEdit ✍🏻 I love OP\n\n>Genuinely, yes. Because you know what, if a girl can take him she can keep him, and if he wants to cheat, it won’t take a three week vacation. Men can cheat in three minutes even if you have their location. If he’s that guy he’s going to be that guy regardless of the energy I waste worrying.", "INFO: Have you and Alek ever had anything romantic or sexual happen between you?", "Look, your not the AH for the trip, you are for dismissing Ezra's feelings as petty jealousy. You're going on a 3 week trip with another guy, one who you share a bond that you will never share with Ezra. Of course he is going to feel left out and jealous. There is nothing irrational about feeling jealous here, and to be so dismissive of his feelings will only make it worse. I don't have an answer for you, I wish I did, but you need to somehow reassure him of his place in your life, or accept that this relationship won't last.", "Don’t invite him, and consider if this crybaby behavior and inability to accept that people (read: YOU) can do things without him is something you want to deal with for another 3 months. It’s not “dump him” material for me quite yet, but if he really doesn’t understand the difference between this and like a pals’ night out, it’d get there quick. NTA", "NAH. You can go and travel with or without anyone you want, but if you are serious with your boyfriend he may become someday part of your family, and in such case, it's perfectly understandable that he wants to come with you - not because the trip is a holiday, but because he wants to share his life with you, and consequently be part of your life, for the good and the bad.", "NTA. It’s only been 3 months - he needs to get a grip\nThere needs to be space and boundaries in a relationship, you should not do absolutely everything together. You can tell him all about it when you get back", "NTA but don’t expect the BF to wait for you. I wouldn’t, I would share deeply personal things with my SO. You are treating Ezra as just a FWB, not important enough to see the personal stuff. I’d be gone.", "My thinking on this is that you aren’t committing to the relationship. Your boyfriend isn’t Mr. Right, he’s Mr. Right now. I know it’s early but think about if you want a future with him. If you stay together this will always be something between you. In a relationship you are supposed to share things. If you can’t share things what’s the point of the relationship?\n   Anyway, that’s my thinking on the subject.\n   And just so we are clear, my opinion has nothing to do with your boyfriend’s jealousy. That’s just something he has to work out for himself because he’s being an idiot. The trip itself, though, you have to ask yourself why you don’t wanna share this with someone that you wanna have a relationship with?", "NTA. however, your BF is free to view this as an indication as to how you view his role in your life.", "It's weird that you have such intense animosity toward someone you're dating. Do you even like him?", "Nta- I was thinking you were together longer. You’ve not been together hardly anytime, don’t let him spoil your trip.", "NTA.\n\nTons of petty, jealous, crazy people in the comments, as usual. \n\nIt's absolutely *not* reasonable for him to expect to be a part of this most significant event in your life after dating you for three to five months. If we were talking years, and you guys were planning marriage, sure. But at this point in your relationship, it's absolute crazy town. You gave him an explanation, he can't accept it. Dump this guy, he's just going to get more controlling as time goes on.", "Well I guess youre NTA for not inviting him. But as your friends said, your boyfriend getting hurt over you going on a 3 week trip with another guy is totally valid. You just have to be ready for the consequences 🤷🏻‍♀️", "NTA technically I guess.\n\nBut if I was your boyfriend I would take this as a sign that the relationship is definitely not going to last.\n\nI can't imagine not wanting to share my family history with my girlfriend, but I also plan to marry her and spend my life with her, so it would become our family history anyway.\n\nSo if you're not that serious with your boyfriend anyway then I can see how it's not a big deal to you.", "NTA \n\nI don't think the length of the relationship with Ezra matters here. This a trip you wanna take with your friend. Ezra needs to suck it up and stop acting like a baby.", "\"Hes in the right to be upset\" no hes not. I get you cant stop emotions but this is actually ridiculous on his part. He should've kept his feelings on this to himself. Theyve barely been dating and they're visiting places that are emotionally hard on his gf and her family and family friends. Hes being a huge and entitled,  selfish dick rn by bringing up his \"feelings\" on not being able to go.", "YTA/ESH. \"Yeah, we just started dating but i'm planning this 3 week trip alone with another guy.\"", "I really want to rationally say NTA but I know damn well if my husband went on a three week trip with another woman for any reason and refused to let me come, I’d feel a very certain type of way about it, lol. I definitely get where you’re coming from but also, enjoy being single by the time you get back 😂🤷🏻‍♀️", "NTA; 3 months is irrelevant.\n\nIf it was 3 years then you’d be a soft YTA.", "NTA for excluding him from the trip. It is important for you and something you want to share with someone who understands and don't need constant information about what happened or so. \n\nBut I also get your boyfriends point of view. It hurts when the special someone doesn't want to spend their vacation time with you. So maybe try to compromise, like booking another vacation with your boyfriend and make this also special for the two of you. Just to show effort and that you like spending time with him as well.", "“ I don’t think I should have to invite him just to pander to his jealousy and fomo.”\n\nYTA.\n\nHe has the right to be upset and you have the right to not invite him. But you definitely seem like an asshole from that statement.", "NAH, I don't think you're wrong to not want to invite him as it seems more like you want to solely share this experience with Alek who is a part of your history. But I do think you're dismissing your partner's feelings here - it sounds like he wants to be there for you and you're assuming he's gonna treat it like a tourist holiday. Have a further talk with your partner but be more open to inviting him, acknowledge that you know he wants to be there for you and go from there. He doesn't have to come along to everything you and Alek are when you're there but if this is a partner you see yourself being with for a long time I'd consider opening up. \n\nIf you still decide to go without him, I don't think it's unreasonable of him to feel hurt. Doesn't mean you're in the wrong either but sometimes two things can be true. Just be mindful, it may not be his history  but that doesn't mean he won't feel the weight of it too. You're allowed your own space to deal and process but don't be surprised if excluding him pushes your partner away a little bit. If he truly just wants to be there for you it's probably hard to trust that you ever will open up enough to let him, so reassure him. But don't expect everything to just be okay because it's not his culture/history.\n\nOf course, if your partner is just looking for a piss up vacay and is jealous you're going with another guy then yeah, being dismissive is warranted.", "Just dump the dude. Sounds like a crybaby.", "NTA, you are not together for long, If he reacts that way after only 3 months, I think he is showing an abusive behavior... You had absolutly no reason to propose him to come as you don't know how he could be for such a long time with you, or your family and friend. And if you do invite him, I think your family could think you don't show respect for them to invite a stranger to such an emotional trip. \n\nGood luck with him", "What are the lodging accommodations on the trip? Separate rooms?", "NTA, you haven't been with this guy long enough to take him on this kind of trip. If he's upset about it that's a huge red flag.", "NAH\n\nYour boyfriend's very new and you don't need to take a large trip with him\n\nHe is right to be concerned about you going on an emotionally laden trip with another man, Even if there's nothing going on now, this trip is likely to stir feelings in both of you\n\nWithout strong boundaries on both of your parts things are likely to escalate\n\nRegardless of whose idea it is, you should go on this trip as a \"single\" person\n\nIt's almost certain you're going to be sharing rooms anyway\n\nSayonara! Later!", "Definitely NTAH no matter what. I’m hoping he’s just acting like a ‘lost puppy’ currently, but if not…\nLet me ask you. In the past 8 months that youve been talking to your bf, has he tried to or shown any interest in learning about your family, heritage or culture, or tried sharing his with you? If not, then I feel like he’s definitely just wanting to go ‘just incase’ due to you going with a friend. Then even if he were to go he’d probably get upset that he’ll feel like the third wheel since he’ll have zero connection or even reference to the places you’ll visit OR he might ruin the trip by trying to force it to become a couples trip instead of what you and Alek have planned.  \nTrusting can be hard but it’s required. You can’t be there to monitor your partner 24/7 nor should you want to. \n \nIt’s only been THREE MONTHS officially!!!! IMO his reaction is a 🚩 you two realistically don’t know whether you’ll be together by the time the trip comes around. \nPlus to get the best deals typically you want to book as early as possible, so either he’s going to ask you to risk your $ or he’s going to risk loosing $ if you do break up beforehand.", "Light YTA - not for the fact that you want to go on this trip alone, but because of your lack of empathy for your boyfriend. He has the right to feel hurt. I mean, ffs, you're going on a trip alone with another guy (and more importantly sharing something precious) - I wouldn't be jumping from joy either.", "NTA, but you should understand that you going on a 3 week solo trip with another man will make a high percentage of partners uncomfortable. Even though this is a trip about remembering your heritage and sharing it with a close family friend. \n\nYou should not change your plans for someone who you’ve known for a couple months. But you should expect the end of this relationship.", "NTA only three months dating and I wouldn’t be planning a casual fun trip together, much less something more personally significant. He’s not been around long enough to have any business objecting to this trip and him getting jealous over someone you’ve been friends with your whole life is a pretty big red flag.", "NTA", "NTA.  If he keeps pushing to go I would break up asap.  Thinking he belongs on a trip with you to navigate two families decade long connection that includes THE HOLOCAUST is absolutely crazy.  You don't double down trying to involve yourself in anything that involves anyone's connection to something like the holocaust.  It's fucking insane.", "These comments are blowing my mind. OP you seem like a very level headed person and this trip is really personal and you shouldn't have to play four guide, to your bf of 3 months, while trying to process your own emotions. I'd Ezra can't understand that maybe that says more about him than you.", "Yes, YTA. You did not take your boyfriend, but took another guy on the trip. Honestly, don't be surprised if you become single the day you step on that plane.", "I think that NAH fits it well.\n\nI understand your boyfriend, you are going for a long trip with another guy, he has right to be jealous for Alek, even if he knows that you are just friends, and for not including him in the trip, and that comment that you don't want to share this with him is kind of rude.\n\nFrom the other hand, I understand that this is really important thing for you.\n\nMaybe, try to gently explain to him, that this is very important, and maybe sometime in the future you will take him to do something like this in the future, but these plans you made are made for your families, not including him, because of lack of bond with family that will be built over time.", "NTA really \n\nbut it sounds like you don't see your relationship lasting with your boyfriend if you don't want to share something this important to you with him. You dont really seem to care about his feelings at all", "NAH... \n\nThis isn't a right or wrong thing. You feel like you can't be comfortable opening up and sharing with him. He feels like he would be with you and is hurt that feeling isn't shared. \n\nNot everything emotional is right or wrong. Sometimes, you are both just at different ends of a spectrum. You aren't wrong to go. However, he wouldn't be wrong to be hurt and reevaluate how he feels about you based on that. His feelings are just as valid as yours.", "You don't have to travel with anyone you don't want to, but you sound like you have the emotional maturity of a 12yo. \"This isn't chicken nuggets and I don't want to share?\" Yeah, YTA.", "I don't know if this was answered here so apologies.\n\nI would only say YTA if you never mentioned it to him and planned the entire holiday and then just sprung it on him.\n\nYou are NTA for not inviting him, he does not need to do everything you do and vice versa.", "YTA(depending on age of relationship)\n\nThis doesn’t read as jealousy, unless there is missing context. Have you stopped to think that maybe your boyfriend would benefit from a deeper understanding of your heritage? Bringing him along would give him the opportunity to have a more intimate understanding and connection with not only you, but also your family. \n\nHonestly, to me this reads as you have a thing for your friend and you don’t want your BF to come because of that. You might want to sit and have a long think about where your priorities lie. Because I genuinely cannot think of a good reason for excluding your BF unless y’all are a new item and you don’t see a future with this person.", "Like some one else said: \n\nIs this a 1) “I don’t want you to travel with other guy” issue? Or a 2)”I want to understand your family history and be part of your life” issue? \n\nI’m shocked to see so many Y T A attributed to 1). I think for him to get upset just because you are going with another guy shows lack of trust. If this was the case, I don’t think you should bring him on such a special trip just to make him trust you. \n\nOn the other hand, if 2) Is the case, your boyfriend’s feelings are very valid and you should consider some form of compromise, where he gets to understand your background and family history but where you don’t necessarily have to turn into a tourist guide.", "A lot of people here glossing over the \"of 3 months\" part. You don't take a long distance, long trip, with someone you've only been seeing for \"months.\" At this point the trip is 1/4 of their entire relationship in duration. \n\nHomebrew showing jealousy this early is a bad sign to me. You're NTA. You're absolutely right that you are under 0 obligation to share something so emotional and crucial to your family history with someone just because they demand it.", "You aren’t an AH for this. But your bf is well within his right to set a boundary as well. I don’t think a “we don’t travel alone with people of the opposite gender” is an outlandish boundary. This could very well end your relationship - only you can decide if you’re ok with that or not.", "YTA and my reasoning is that if this is an important part of your heritage and history then you should include your boyfriend in this. You don't have to play tour guide and you can set clear boundaries and expectations for the trip and his involvement, but if this is as important part of your life as you make it out to be and you also want your boyfriend to be invested in you, your life and your heritage than you would be the AH and quite frankly not very smart to exclude him from this.", "After seeing some of OP's comments, YTA. \n\nMy gut reaction when I first read this was OP is NTA because I can't pretend to understand the kind of trauma that comes with surviving the Holocaust and the generational trauma that family members inherit. OP's and Alek's family share an incredible bond no doubt and it's going to be a personal and emotional trip for the two of them to take. I don't think OP should have to explain everything to Ezra if he were to go on the trip as that would take away from the experience for OP and Alek. \n\nDespite that, it is understandable that Ezra would feel left out and insecure, not necessarily because he's jealous of Alek, but because he's not in a place yet in his relationship where they can share this level of emotional intimacy, and probably feels that his SO has better emotional intimacy with Alek. I think downgrading that to just some kind of possessive jealousy is unfair.\n\nSeeing what OP has been saying in comments has kind of sealed the deal for me. They seem to not care how Ezra feels and the worst part is, doesn't think he's entitled to his emotions. How OP is treating him is probably making him get more insecure and be more childish about the situation, because OP won't even acknowledge that this could be difficult for him. \n\nOP should be able to take this trip without he BF but doesn't get to dismiss his feelings about it. I'm guessing OP started planning this trip without even talking to Ezra, not to ask his permission but to be up front and honest so he feels somewhat in the loop. OP doesn't have to be ready to share their family trauma with their BF, but they can still be considerate of his feelings, especially if they someday want to be able to share this stuff with him. Sounds to me like that isn't going to happen because OP was asked repeatedly the length of the relationship and if they saw a future but never saw any responses on that from OP yet, probably because the answer isn't a truth OP is ready to face. It would still be nice to know for context the length of the relationship but honestly, at any stage, you have to communicate and be considerate of your SO's feelings, it's just that the longer the relationship is, the worse the OP seems.\n\nEdit: Saw that OP added how long they've been dating. Doesn't change the fact that I think OP does not and should not have to invite BF, but should have acknowledged his feelings from the start.", "YTA you don’t have to take him alone, but planning this trip without discussing it with him and how he would feel about being excluded in such an emotional experience for you is a AH move. You aren’t an AH for not wanting him to join, but your attitude about him is!", "NTA. You've barely been together and this isn't some beach vacation. Go on your shared trip with your family friend and if your boyfriend of a few months is jealous of you going to a place to honor your grandmother, that's his problem, not yours. You shouldn't have to include someone you've barely been with in something that holds deep meaning and is very important to you and your friend.", "NTA. You aren't obligated to invite a new bf on a deeply personal trip.", "You want to spend 3 weeks traveling with another guy, and you expect your boyfriend to just accept that?\n\nYTA.", "INFO: How long have you been together with your bf?", "NTA, drop this clown", "NTA. Would you be able to let him go on a similar trip? Then you can say with no hypocrisy that this is not a trip you feel comfortable sharing just now. Do acknowledge his feelings if he genuinely wants to join to get to know you, and not just because of some element of jealousy.\n\nBut this is your trip, and this is super early. I'd probably consider it a bit high risk to bring a super fresh BF on a trip that has this kind of significance.\n\nThe people saying YTA because you obviously wouldn't be comfortable in the reverse situation need to understand the difference between indifference and actually trusting your partner, while also accepting that if they cheat, then it wasn't meant to be either way.\n\nGood luck.", "NTA\n\nThis is a new relationship.\n\nAnd this isn't even a vacation.\n\nThis is a trip where you're literally touring places where horrible shit happened to your family, and your boyfriend is acting like it's some romantic getaway?????\n\nNah fam, you need to cut this one loose.\n\nHe's literally jealous you're taking another man on a Holocaust memorial trip, like, the bar is low but damn it's he burying it.", "NTA\nIf he's this irrational and entitled after 3 months, it's a bouquet of red flags and you should ditch the dead weight. Enjoy your trip!", "Everyone in these comments arguing about you going on a trip with \"another guy\" making Ezra's jealousy valid. It sounds to me like that \"other guy\" though is seen as a brother. It's a family trip to experience and connect with deeply traumatic emotional history. A boyfriend of 3 months simply doesn't belong there.", "NTA. If he’s causing this much drama *before* the trip, imagine how much drama he would cause *on* the trip.", "NTA. The fucking audacity to make a trip like that about him.", "You're gonna come home single. Just because a dude gets angry that you're intentionally cutting him out of an activity specifically to spend time alone with another guy does not make him irrationally jealous. Any rational person would conclude that he's right to take this at face value and assume that you will continue to cut him out of important events in the future. It's gonna be open season while you're gone.", "YTA. You don't need to bring him but the lack of empathy towards the guy for wanting to understand that part of you is appalling. I can't blame him for being hurt by it. There were many better ways for you to have dealt with this like allowing him to go to a few spots with you.", "Op as a dude you have a good head on your shoulders. You're playing this right. It's a lifetime special occasion compared to a 3mo relationship. He's dumb to not understand to f off a bit. It's not about him or you or your friend, it's about the trip itself. If you were my so I'd have no problem. \n\nSure, going with another guy may bring up a bit of jealousy. But you explained the situation. And without trust the relationship is already dead anyway. I like the way you put it, if either of you wanted to cheat it wouldn't require this trip anyway so why be jealous it's clearly for the trip", "NTA at all. Listen, there is absolutely no part of me that can ever fully understand what both your and Aleks families have suffered and experienced, and there is no part of me that can ever fully understand the emotional rollercoaster that I am sure you are going to be on for this trip. But I *DO* understand that this is not an experience that you invite just anybody along to. It's deeply personal to you both in ways that nobody but you and your families can understand and Ezra's deranged insistence about being included in this is seriously off putting. It isn't about him at all and you do not need to cater to his whims just because he's a jealous baby that doesn't like not being the center of attention.\n\nHonestly if he can't let it go, I'd let the relationship as a whole go. What a weird thing to get hung up on. He needs to grow up.", "YTA", "No one sucks here.  You have the right to go on this trip that means so much to you.  But you can’t be that surprised at his reaction.  I don’t know of any guy who would be ok with his gf going on a 3 week trip with another guy, no matter what the purpose of the trip was.  I mean be honest.  Would you be happy if he was off on a 3 week trip with another girl?\n\nFrankly if you knew this trip was coming and you intended to travel with your friend, then you probably shouldn’t have gotten into a relationship until after the trip.  At best you should’ve warned your bf about the trip early on.\n\nAnyway by all means stick to your guns and go on the trip.  I hope you get what you expect out of it.  But don’t be surprised if you’re not in a relationship when you return.", "NTA. he’s barely your bf and this is a significant trip based on you and your friends shared family trauma", "NTA. You have only been dating for 3 months. Your boyfriend needs to put on his big boy pants and get over it.", "Before finding out about your pilgrimage, did ‘Ezra’ ever show any interest in understanding your and/or your family’s history? Would he be ok if Alex was a chick? \n\nThe last one’s a trick question - it sounds like he’d insert himself into the trip ‘to keep you gurls safe, doncha know it’s dangerous fer a cupla cutie patooties out in the big scary world without a man to perteckt them!’ \n\nI will say this to you from experience. The ones insisting that you cannot go on a trip with a member of the the gender you are inclined to find intriguing (even though you are in a relationship and not attracted to the travel partner) are the ones who will cheat on you. Because this projection is them showing their true colors. What they are really saying is that They wouldn’t be able to resist attempting to turn a pilgrimage into a bangfest. He’s telling you who he really is. Believe him.", "I can’t see the point why u are still with ur bf. It definitely seems that u don’t like him at all.", "Information required: are you keeping seperate hotel rooms for every night of your 3 week trip?\n\nOf course your NTA for wanting to do this with a family friend, but your boyfriend is not wrong for feeling uncomfortable that his girlfriend is spending 3 weeks traveling with another man - there are not many men out there that would be okay with that idea.", "NTA\nIMHO it’s early in your relationship to take that long of a trip together. You don’t know how well you get along with that kind of togetherness. What if in a couple days it goes sideways and he’s a jerk?  You’re sort of stuck with him. \n\nNow even if you were married for years, you don’t have to vacation together. Many couples take separate vacations for various reasons.\n\nBeing in a relationship  doesn’t mean giving up your sense of self. If he’s expecting for you to be attached to him all the time, you might want to rethink the relationship.", "NTA. This is not a vacation and his unfounded jealousy issues are HIS to deal with. He should be supporting you as you prepare to embark on this very heavy trip, not whining like a baby because he’s jealous he isn’t invited to participate in something he does NOT belong in as your non-Jewish bf.", "NTA he’s going to make the trip about himself", "NAH. Everyone seems to be jumping on \"Ezra\" being an AH, but if OP wanted \"Ezra\" to go and he said he didn't because he had no connection to the place than I suspect people would also say he is an AH.\n\nOP is right that he has no connection to this place but he is not AH for wanting to be with OP when she is going through something meaningful, share that with her and make a connection with a place that is important to her. OP is chalking it up to FOMO and jealousy, but he could just be trying to be a good bf trying to build their relationship.\n\nAnd yes people are right to point out their relationship is very new, but I suspect it won't last much longer and I think OP doesn't really see a long-term future with Ezra. \n\nI hope you have a great trip and send us an update when you start dating Alex.", "YTA. \n\nNot because you want personal space. Because you act like he can't emphasize and have an experience just because those events didn't happen in his family. It's not for you to say whether it has \"nothing to do with him\" or not. Jews are not the only people that suffered from WW2, whole world suffered. And frankly you are in the same boat as him, it has nothing to do with you since you didn't even exist at the time, your parents didn't didn't exist at the time either, you care simply because you decided to care. \n\nMoreover, going with another guy anywhere for 3 weeks, when you are in a relationship is a breach of boundaries. Yes, you don't plan anything, yet, there are countless occurrences of unplanned romances spawned out of emotionally charged trips.", "\nNTA but b forwarded your relationship will likely be over because of this trip.", "Do you hate your BF? Is he usually a jerk? I mean he must be for your to categorize his feelings as just jealousy and fomo and for you to think that he thinks that it's just an ordinary vacation.\n\nDoes thinking that he wants to be there to comfort you not even cross your mind? That maybe he wants to be there because he knows it would be an emotionally exhausting trip and want to be there for you? Is this how little you think of him?\n\nI mean I get not wanting him there.\nThe relationship is too new. This is too special. It's difficult to let someone new in it. Etc.\n\nBut the way to talk about your bf is... concerning.", "As someone who grew up around Holocaust survivors who survived Auschwitz (friends and family) - my family is from Greece - and who also has an uncle who liberated Dachau, I really don’t understand not wanting to share your family history with your boyfriend. Why do you not want him to see where your family is from, both the good and bad?", "YTA, \n\n>My boyfriend “Ezra” is mad that I didn’t invite him. I told him this was a trip about my and Alek’s family history, and something we wanted to do together to connect with our heritage, it’s not a resort vacation. He said he is hurt that I don’t want to share this with him.\n\nHow weird that he is hurt you don't want to share something personal/special with him.", "Info: I'm how long have you two been a couple and do you see a future together?", "YTA I’m sorry but that is quite cold.", "Why don't you want to educate him on your history? He is your boyfriend he should be the person that you want with you for emotional support\nYTA\nYou sound like you don't love him and he is just à annoying pest...\nAnd if I follow your resoning nobody should visit historic place if this don't a link with their familly which is frankly bullshit", "your not an asshole for not inviting him, you are one for how youre going about his feelings, you dont want him to come he doesnt have to but you should also not be calling him “irrationally jealous” and saying it in a way that makes it sound unreasonable he could even think of being offended that youre going somewhere for 3 weeks without him, bring him? No, treat his emotions with respect? YES", "Normally I’d say YTA. But as someone who has grown up with intergenerational trauma from that same period, I can sympathize. I wouldn’t take my wife to a specific place of similar significance to my family. Only my brother or someone who has grown up with me and understands the gravity, especially the for the first visit. So I hear you. NTA.\n\nIt is nice that he cares though. Be gentle with him.\nSome partners wouldn’t give a shit.", "NTA\nNot a good trip to go on with a new partner.\nOK to say you’d rather he didn’t come.\n\nIt’s his problem if he can’t trust you to travel with another male friend unless he is there, or cares more about what it “looks like” to other people than what you need from this trip.\n\nYour boundary is fine: he can respect it or not, but you have made it clear you don’t want him to go on this particular trip, at this particular stage in your relationship, which is absolutely 100% an acceptable decision.", "Omg, NTA. \n\n1. First off, you and Ezra have been together for the equivalent of a US school semester. Like…? You’re still basically strangers. More importantly, traveling with someone for the first time can be an extremely stressful and unpleasant experience even in casual circumstances. Going with him on a deeply personal, likely very emotional, three week trip where you won’t have petty distractions from travel stressors like snorkeling or whatever is a TERRIBLE IDEA. I can already envision him getting bored, whining, and ruining the experience for you. \n\n2. I’m like you and think that if people want to cheat, then they will, regardless of who they’re with or where they are. I might feel a twinge of jealousy/disappointment about being left out of the trip sounds interesting but my partner and I regularly travel separately from each other with mixed groups of friends and the fear of one of us cheating is nonexistent. If you really can’t trust your partner to exist in the world without cheating on you, then you shouldn’t be together.", "YTA. Honestly there’s a lot going on here. Three months in is a little soon to be included on intense family history that you will remember forever. However, I do understand why it would be weird for him and the fact that you are talking down about him so much is kinda gross. \n\nI want to be clear. This could have been N-A-H if you weren’t so dismissive and disrespectful of his feelings", "NTA, if the bf is jealous, the bf needs to reflect on why op didn't invite them on such an emotionally charged family event. The relationship is clearly in the early stages of development. If op is not ready to share this family history yet with their bf, that is their right. Bf is not entitled to it and perhaps bf has not demonstrated emotional empathy for op to feel safe enough to share. If bf is only upset because another is going, then yes it is petty jealousy and looks badly on bf's emotional maturity.", "I stopped at “we’ve been dating for 3 months.”\n\nDidn’t even need to read the rest. NTA.", "question from me... \nif your fella told you he was going abroad with a girl, to connect over their shared ancestry. would You be ok with it? something that patently doesn't include him?\nif you'd be fine.. then nta. \nif you wouldn't (I wouldn't btw) then yta, majorly", "YTA, If you plan a life with your current bf and become a family. N.TA if you aren't serious about the relationship at all.", "NAH here", "Not an asshole, just stupid\n\nIf I was that boyfriend I would be pretty annoyed, too.", "NAH, but your responses to the comments are worrying. You're not making any effort whatsoever to see things from your partner's perspective and have zero respect for how he feels. That's not a sign of a healthy relationship", "YTA. So you want to go alone on a trip with another man while you have a bf?  Of course you're free to do it, and your bf is free to be hurt by that and dump you. \n\nYou not including your bf in something this deep and important for you, to him that sounds like \"Our relationship means nothing to me, Alek is more important than you, deal with it\"", "NTA\n\nHe doesn't belong on this trip. This is a family thing, your and Aleks family. Your bf of 3 months isn't family.", "Ezra needs to get over himself.", "YTA, so you don't want to share your family history with your bf? Are you sure he's your bf and not your fucktoy?\n\nHope your bf finds someone better soon.", "NTA because you've only been dating 3 months. But 3 weeks away when you have been together such a short time likely means your relationship is over.\n\nIt may not be chicken nuggets but it is an.opportunity to teach a partner about yoirself and your heritage. It would be a learning trip.\n\nWhy don't you think if would be good for your bf to learn about your heritage.\n\nIf you \"don't want to share\" that is absolutely fine. This is personal and 'teaching him' may be disruptive of your trip. It may be problematic. \n\nIt is okay not to include him.\n\nHOWEVER, don't travel into war zones right now. They have enough to handle in fraught areas without having tourists underfoot. Oblivious tourists have literally been shot for 'visiting' while people around them are dealing with death and distruption of their whole worlds and families.  \n\nYour timing is poor to deadly.", "YTA", "INFO: It may be that you are using the term \"boyfriend\" wrong. If he is someone who can be a big part of your life (this is what most people understand as \"boyfriend\"), then you are the asshole. If he is just a fuckbuddy, then no problem, who cares?\n\nEDIT: NTA", "Why are you not dating Alek?", "ESH.  Oof, i'm sure he thinks you're fucking Alek, and your refusal to include him probably doesn't help the situation.  However, 3 months isn't a long time and he is overstepping a bit.  If you truly want to make things work then you need to find a compromise.  I'll be honest, if my girl went on a trip with another man and vehemently refused to let me go along I'd probably just drop her. That's shady behavior.", "Yep", "It’s not his real name, but no he’s not Jewish. Honestly even if he was, he’s not from that town, he didn’t have family murdered at that site, he’s not going to have any connection to going to see their old house etc. \n\nI would kind of get it if we were going take a tour of Auschwitz or something similar (we are going to two other camps where we had family), but it’s not like we’re taking a one day tour or something. Idk why he thinks going to small towns in Eastern Europe needs to be about *him*.", "I would go so far as to say that Alek isn’t just a lifelong friend, he’s family.", "OP didn't say its \"not his business\" \n\nDoesnt matter how long they've been dating. OP can choose who they travel with. This is a personal trip and Ezra would naturally be distant from OP and friend here because he's simply not involved. Ezra needs to grow up", "Oh yeah, imagine the stresses of travel got to them, I'm sure he would ruin it. Just not a good idea he's being very selfish. NTA", "it doesnt matter how long they dated. each person has their own boundaries in a relationship, it doesnt matter if its new or old.\n\nthe time is irrelevant to the core issue they have", "Oooo yes I very much agree with this. How dare he", "Agree. I really wonder if OP is just frustrated with it all or if they genuinely don't like Ezra all that much. It feels like - just by the tone of the post - OP would be better off just ending the relationship. Regardless of who's right, I don't think the relationship will heal from it.", "They've been 3 months. Though he apparently claims 5. The 2 contested months is a period where he was dating other people. And now he wants to force himself in on a trip that holds deep familial and historical meaning for the two going on it and to act hurt that she's basically going with a family friend when he wants to count him actively dating other people as having been a period where he was dating OP.", "Plus, Ezra feels they've been together 5 months. OP feels it's 3 months since she doesn't wanna count the months where he was seeing/dating other people.", "I’m pretty much sure this will happen to OP and her bf", "It's more of a pilgrimage than a trip - and you don't do a pilgrimage with someone who doesn't seem to share an emotional connection to the place or fully understand its moral significance. Don't know where OP is going, but Auschwitz isn't exactly a beach resort.", "Not sure I would call OP’s boyfriend of 3 months an SO. To me this sounds like a preview. OP’s bf is showing her who he is. She should believe him.", "Not sure - my partner and I travel often together, but often solo or with other friends.  I think in healthy relationships you can just be happy for the other person, rather than jealous.", "I patently disagree with you. The purpose of this trip is beyond the scope of anything an SO of only *3 months* should feel entitled to. I agree that some lingering feelings of hurt or jealousy are a somewhat reasonable response, but of we take what OP has said at fave value, they have been quite clear with Ezra the reasons for \"excluding\" him. It has nothing to do with him and he really should respect that and understand that.", "This is not a great remark. They’ve been dating like three months. My boyfriend went on a trip that was three months very early on to Mexico. We’d been dating for about the time as Ezra and OP. Was I meant to hee and haw about it? Was I supposed to be offended? Because I didn’t see a point.\n\nNAH.", "That's his problem though, his jealousy is irrational and it's his to handle.", "I might be, but I don’t think that would make me want to go on the trip, knowing the circumstances", "Or your bf who maybe cares about you a lot being hurt that he’s not being included so that he can understand you better and feel like he’s special enough to become a part of your world. \n\nI’m absolutely not saying that’s what’s happening, but it’s either that or the other worst case scenario. I don’t think there’s a middle ground.", "After only three months how are they a SO? Even OP doesn't refer to him as a SO.", "What?? That is a really unhealthy perspective about partnerships. When you're dating or even married you don't become one person. Sometimes you take trips or do important things separately. Sure OPs boyfriend (of 3 months here!! but even if it was longer) can be sad or miss OP, but to try to encroach or change the trip is very controlling. I can't imagine being in a relationship where 3 weeks apart would seriously disrupt it.", "Seriously, everyone here would have been asking why you are too emotionally immature and insecure that you have to force yourself on your new boyfriend's vacation.  It's a red flag to me that he thinks she can't go without him.", "From other comments just 3 months", "Dunno if you saw the edit but this relationship has been 3 months long (2 months when the trip idea first came up). Ezra sees it as 5 though because he wants to include the 2 months where he was seeing/dating other people.Timeline \n\nOP and friend: know each other their whole lives\n\n5 months ago - Is when Ezra says they started dating\n\n3 months ago - is when OP counts them as having started dating because Ezra was dating others too during the \"first\" 2 months Ezra is including\n\n1 month ago - OP and her friend, on the anniversary for her Grandfather's death, talk about going on a significantly meaningful trip they both have deep ties to.", "They have been together 3 months.", "Ezra might be feeling like this makes his claim that they've been dating 5 months less valid, and instead gives more credibility to OPs stance that the \"first 2\" months where he was seeing/dating others don't count and so they've only been together 3 months.", "I see everyone keep saying 3 months, but if everyone acted like this 3 months in, won't most of those 3 months relationships never convert to something longer or serious ?", "3 months according to OP, 5 months according to Ezra because he wants to include the 2 months before then where he was seeing/dating others\n\nETA: 3 months exclusive, 5 months \"super casual\" for 8 months total.", "He was my first kiss when I was 14 (I’m 24 now). But it definitely *wasn’t* romantic, it was as part of a game at school 😂\n\nSo, no.", "I’m sorry, but a three month relationship isn’t enough to be this entitled to such a connection that HE WILL NEVER UNDERSTAND", "\"Ezra\" also feels that they have been together for 5 months instead of 3, OP disagrees because Ezra was dating other people during the first 2. So they had been together for 2 months when OP and her friend talked about going on this deeply personal trip and now her BF wants in on it despite only having 3 months and wanting to feel hurt she's going with someone she's known for ages while he basically also wants to go around saying that it's no big deal that according to his own math he dated other people while also dating OP.\n\nThat is not the kind of guy I'd want to invite along on a meaningful trip rooted in my family history.", "Being jealous of generational trauma and a history of genocide, what an awesome boyfriend /s", "A \"deeply emotional\" trip for 3 weeks with another guy\n\nEdit: I can see the women who don't like men's boundaries and the men who fold for them found my comment 😂", "of course one day. But not after 5 months, while he dated others girls for 2 months before he became exclusive to her...The relationship seems a bit fragile for the moment...", "Dunno if you saw the edit but this relationship has been 3 months long (2 months when the trip idea first came up). Ezra sees it as 5 though because he wants to include the 2 months where he was seeing/dating other people.", "It’s not just “a three week trip with another guy” and dudes been with OP for only three months", "They've been dating just a few months", "Dunno if you saw the edit but this relationship has been 3 months long (2 months when the trip idea first came up). Ezra sees it as 5 though because he wants to include the 2 months where he was seeing/dating other people.", "They’ve only been together a few months, and for most of that time, he was also dating other people. This is not a serious, long-term relationship where she is telling her fiancé or partner, or a person who’s given any indication that he sees himself spending his whole life with her, a brush off. I would absolutely not ever bring a partner of a couple of months on a trip where the entire purpose of the trip was to explore my family trauma with a friend who shares in that trauma.", "Exactly this. I can see him being hurt; if she doesn't feel like sharing her family history with him, the relationship is probably not going to last.", "I feel like this isn't a fair comparison. That's your husband that you have a long term commitment with. This is her bf of 3 months. I woudn't say the connection levels are the same.", "It's not a vacation!", "Based on the edit I'd say the most important compromise here is that OP considers their relationship 3 months long but Ezra wants to count the 2 additional months before then too, which OP doesn't agree with because he was seeing/dating others too during that time.", "Timeline \n\nOP and friend: know each other their whole lives\n\n5 months ago - Is when Ezra says they started dating\n\n3 months ago - is when OP counts them as having started dating because Ezra was dating others too at that time\n\n1 month ago - OP and her friend, on the anniversary for her Grandfather's death, talk about going on a significantly meaningful trip they both have deep ties to.\n\nAnd since then Ezra has seemingly gone around crying foul play because how dare \"OP go on a trip with another guy instead of him!?\" as if the \"other guy\" doesn't have reason to actually join in on the trip.\n\nIf Ezra feels hurt about it, it's on Ezra in my opinion. OP shouldn't be forced by the \"friends\" to take some guy she's been dating 3 months, 2 months when the trip was first thought of, along on a trip like that. Especially not when it seems Ezra is totally fine with him by his own reckoning dating multiple people at once.", "What about the lack of his emotional empathy for her? He was selfish to bring his feelings up on this in the first place", "Jealous men should be left behind", "This \n\nI'm pretty shocked someone can be so dense about their relationship and how things can be perceived. Like no way someone lacks this much empathy to the person their dating and constantly trying to justify it with their time line and who they dated before they were official. \n\nI also question the validity of the point constantly made of him dating other people after 2 months of just being casual. Was this not something discussed by you both? This feels like half a story where op was perfectly fine dating other people for those 2 months, but now is using it as leverage to justify not Inviting bf. were you not on the same page this whole time?\n\nI don't think you're wrong for not wanting to invite him. But I think YTA because you lack all empathy and it honestly doesn't seem like you like your BF and it definitely doesn't seem like you have any respect for him. Honestly think you should sit him down and try having a mature discussion about it, leaving out the chicken nugget references. Your not doing yourself any favors there. Just making yourself sound immature and have no empathy to people's actual feelings. \n\n\nId say YTA", "Ezra doesn't seem to care much about OP's feelings according to the edit which revealed he says they've been together 5 months while she thinks the \"first 2\" don't count because he was seeing/dating others too during that time.\n\nThat's the guy crying foul that she's going with a child-hood friend to connect with a dark period in their shared family history while Ezra wants to come along to... make it a date-vacation to holocaust spots, I guess\n\nETA: the relationship is 8 months, but 5 months were super casual were Ezra still saw others and they've only been exclusive for 3.", "They’ve only been exclusively together for three months because he was dating other people before that, and the trip is several months away. I think it would be absolutely crazy even if she wanted him there to plan a three week international  trip that’s months away with someone who just stopped sleeping with other people.", "Very different ends considering OP sees the relationship as being 3 months long instead of the 5 Ezra insists on (because he includes the 2 months where he was seeing/dating others before then)\n\nOP included it in an edit", "Missed the entire context eh", "That was a tongue In cheek joke, you sound like you have the humour of…well no one.", "I think the fact their relation is only since 5 months, and that the BF wasn't exclusive during that period, is a part of the problem", "It's 3 months.", "If their new, even if theres a future less than 3-4 months not bringing him is fine its more the emotional stereotyping and fact she has 0 empathy for him thats concerning", "Timeline \n\nOP and friend: know each other their whole lives\n\n5 months ago - Is when Ezra says they started dating\n\n3 months ago - is when OP counts them as having started dating because Ezra was dating others too at that time\n\n1 month ago - OP and her friend, on the anniversary for her Grandfather's death, talk about going on a significantly meaningful trip they both have deep ties to.\n\nAnd since then Ezra has seemingly gone around crying foul play because how dare \"OP go on a trip with another guy instead of him!?\" as if the \"other guy\" doesn't have reason to actually join in on the trip.\n\nIf Ezra feels hurt about it, it's on Ezra in my opinion. OP shouldn't be forced by the \"friends\" to take some guy she's been dating 3 months, 2 months when the trip was first thought of, along on a trip like that. Especially not when it seems Ezra is totally fine with him by his own reckoning dating multiple people at once.", "She's been with him for 3 - 5 months.  This is not a long term relationship.", "I love too how people are saying he's wrong to think they were together for 5 (8?) months because for two of those months they were fuck buddies and he (only him? sounds suspicious but ok) was seeing other people. Ehh, takes two to tango and he wasnt cheating on her or anyone else; why does it matter so much that a fwb situation wasnt a committed relationship? why is it so odd that he counts those as part of their relationship history? idk, maybe Im wrong cuz Ive been out of the dating scene for 5 years but come on that just seems petty and ridiculous", "For me, what makes it YTA is that OP has stated multiple times they have no intention of sharing anything with him. Another user pointed out her responses and comments indicate she doesn’t even like her boyfriend and is using this trip to try and start a relationship with Ezra.", "She was dating this dude for like a month or two when they started planning the trip. Why would anyone include a brand new partner on a trip to another country to trace their roots with a lifelong friend/family member?", "Dunno if you saw the edit but this relationship has been 3 months long (2 months when the trip idea first came up). Ezra sees it as 5 though because he wants to include the 2 months where he was seeing/dating other people.", "Boyfriend of 3 months wants to go on a family journey.  They could break up in 2 months and he'll be in all the photos.", "someone's projecting.  It is absolutely possible for men and women to be platonic friends.  With the way OP described this friendship, there is nothing the boyfriend should be concerned about.", "It's in the body.  3 months that they have been steady.", "Timeline \n\nOP and friend: know each other their whole lives\n\n5 months ago - Is when Ezra says they started dating even though he was apparently seeing/dating others still\n\n3 months ago - is when OP counts them as having started dating because Ezra was dating others too at that time\n\n1 month ago - OP and her friend, on the anniversary for her Grandfather's death, talk about going on a significantly meaningful trip they both have deep ties to.\n\nETA, I messed up the timeline but my point, which I realise I forgot to add, is that Ezra is out of line if he's going around thinking the time spent dating others should count as much as the time he's been exclusively with OP. Especially if he's trying to say she can't go on a trip with her childhood friend without /having/ to take him along too.", "Any rational boyfriend of 3 months would not expect to go on a family history trip \"just because\" when they aren't interested in the family history, when it's really more about the fact that she's traveling with her male friend than wanting to go with her.", "Timeline \n\nOP and friend: know each other their whole lives\n\n5 months ago - Is when Ezra says they started dating\n\n3 months ago - is when OP counts them as having started dating because Ezra was dating others too at that time\n\n1 month ago - OP and her friend, on the anniversary for her Grandfather's death, talk about going on a significantly meaningful trip they both have deep ties to.\n\nAnd since then Ezra has seemingly gone around crying foul play because how dare \"OP go on a trip with another guy instead of him!?\" as if the \"other guy\" doesn't have reason to actually join in on the trip.\n\nIf Ezra feels hurt about it, it's on Ezra in my opinion. OP shouldn't be forced by the \"friends\" to take some guy she's been dating 3 months, 2 months when the trip was first thought of, along on a trip like that. Especially not when it seems Ezra is totally fine with him by his own reckoning dating multiple people at once.", "Probably because they've only been dating for three months and she's not ready to take a three week international trip with him that is lining up to be the most meaningful and significant thing in her life to this point?", "Grew up around, not actually affected.  This is a new boyfriend.  She is going on a trip to deal with generational trauma.  Not the trip for a new boyfriend.", ">Edit, for everyone asking, we’ve been officially together for 3 months. We were   \n>  \n>very  \n>  \n> casually saying for five months before that but I don’t count that as us being “together” because he was dating other people\n\nI'm not sure when the edit was added.", "I have the same exact question to be honest. I think the answer is not long and that all signs point to no on the second.", "Same question, if a long relationship I dont understand why he can't go on the trip with them \n\nTo learn and respect about op's family and history", "Dunno if you saw the edit but this relationship has been 3 months long (2 months when the trip idea first came up). Ezra sees it as 5 though because he wants to include the 2 months where he was seeing/dating other people.\n\nETA. Been together 8 months but only exclusive 3, Ezra was with others during the first 5 months", "Because I want to experience my family history in this way for the first time, not spend the trip educating him. \n\nYou can visit whatever place you want, free country.", "It's perfectly normal not to love someone you've been dating for such a short period of time; at three months exclusive, it would be a little unusual if OP *did* love him.\n\nAnd most people don't want to educate on demand, especially about family trauma.", "She's been going out with him for 3 months ( the 2 months prior don't count as he was seeing other people). I can see her being in lust with him, not love. \nHer friend that has known her all her life is not just going to support her. They are going to support each other for a family thing.\nHer bf can either deal with it - or leave.", "I'd say based on the edit that Ezra is getting about the same respect he's giving seeing as he wants to insist they've been together 5 months instead of 3. OP doesn't want to count the \"first 2\" because Ezra was seeing/dating other people.", "Your first judgement in your post is what counts, so you just voted her the asshole.", "You have to put a space between the Y T A or it will count as a vote towards asshole.", "Genuinely would be 100% fine with it. I’m not that girl who wastes their energy worrying about cheating in any context, but in these circumstances, I would also totally understand why he wants to share that with someone who is equally connected to the history.", "3 months long boyfriend, and I need to let him go on this historic pilgrimage with me?  Nope.", "5 months BF and he wasn't exclusive during that period... I don't think in such a case, I would present him to my family during this important trip.", "Where does it say the country? I assumed Poland which is fine to visit (might have missed it though!).\n\nI totally get why she doesn’t want to spend the vacation creating a learning trip for a guy she’s been dating 3 months. That will be a distraction / take emotional energy away from focusing on reconnecting to her history and processing her own emotions about it. It would be different if she had been many times, or if they had been together a long time. \n\nI also think many, many relationships can survive a 3 week break at the 3 month point. If not then it probably wasn’t going to be a long term thing anyway.", "All of Eastern Europe is not a war zone.... Unles OP specified Ukraine and I somehow missed it, you ignorantly generalising half a continent is a bad look.", "In this case \"boyfriend\" seems to mean \n\nPerson she has been \"seeing\" for 5 months, but he was still dating other people till about 3 months ago...\n\nSo taking him on a trip like this feels stupid.", "Dunno if you saw the edit but this relationship has been 3 months long (2 months when the trip idea first came up). Ezra sees it as 5 though because he wants to include the 2 months where he was seeing/dating other people.", "Uh…we just don’t want to date each other?", "What a weird question. Do you not have any friends of the opposite sex who are just that…friends?", "NTA.  You've been seeing this guy for three months, you barely know him.  It's not a vacation, it's something very personal for you and your friend.  What would he even do there?  It's not like you're sightseeing either.  I'm guessing it will be extremely emotional for you and your friend.  Like you said you don't want to be tour guide, and have to explain why things are important.", "If he were your spouse or in a serious LTR with you, I can see it being important to him for the specific reason that it's important to *you*. But you've been dating him three months. This kind of trip is so emotionally fraught and intimate, I would not presume that I was entitled to accompany someone on a trip like this if they didn't want me to. NTA.", "Your last sentence is the most important one. I suggest you talk to him and make the purpose of the trip a bit more clear to him. It's not a joy ride and it is not about him.\n\nBut I would at least give him some benefit of the doubt. Maybe he is not jealous for your friend, but rather wants to be there for you. As a pillar to lean on in tough moments. You are a fresh couple and maybe this is something that he feels he needs to do for you.\n\nEdit: nevermind, I read in some of your replies that you already told him all of that. If he still does not accept your decision after you told him your position and he even completely disregards Aleks feelings, then screw him.", "IMO your boyfriend is being very selfish here. He might be worried about your friend flirting with you or something, but considering you're not only friends but your families are friends and share difficult history together which is the basis for the trip, it's weird to worry that this will turn into a romantic trip for you two.\n\nThis boyfriend sounds selfish, and possibly jealous and controlling. If you want to try keeping this relationship, try explaining that this isn't a vacation but a family-related historical trip. You're going back to your roots, and his roots are not there. I've had older family members visit the \"old country\" cities that our ancestors came from. It's not unusual. Even if you were going to a famous historical place, it's not his business. What kind of person wants to horn in on someone's exploration of not just their family, but the Holocaust they lost loved ones in?\n\nNTA I hope your trip is everything you hope it will be.", "My gpts fled Warsaw, if I was going to visit Treblinka, I wouldn't think \"Ooh great couple activity\" especially with not knowing someone long. This is absolutely a pilgrimage for you and your best friend and shared history. Imo, your \"bf\" is insecure and showing it with petty jealousy.\n\nAlso, here's a great story about Walter Matthau. He and his wife were visiting Dachau and they got into a fight. Then Walter says \"Great! You've ruined my trip to Dachau!\"\n\nI hope your trip is enriching and healing. Hug", "Nope. I'm Jewish and half my family at the time died in the Holocaust, but that doesn't matter. As soon as I saw \"3 months\" and \"family history,\" all bets are off. This guy is barely part of your life- it doesn't matter if you're going to a Holocaust memorial or an African Diaspora museum, he only has a place there if you explicitly invite him. This is an incredibly personal thing to have a guy you barely know there- if he throws a hissy fit over something on the trip, you're stuck with him.", "Trips, especially longer ones like you described, should be about all the participants.  Earlier this year I went on a trip overseas with my cousin to a country where our mutual great-grandparents were from, and where my Nana's (other side of the family) family was from.  I planned the trip around activities we both wanted to do.  But I did add in a day to visit the town where my Nana's parents met, because it was her lifelong dream that she never got to do.  So I did it in her honor.  My cousin was of course supportive of this, even though it wasn't her family.  \n\nIt doesn't sound like \"Ezra\" would be like my cousin.  Also, like I said the town was just a day trip, your trip is entirely about feeling that connection to your family's past.  You should only go with someone who can be supportive of that.  \n\nHonestly, Ezra sounds exhausting.  I know you don't want to go on this trip with him (understandably!), but do you really want to be dating a guy like this?  Seems like it's always about him.", "I agree please don’t choose a guy you may break up with in a couple of months over lifelong friendships. NTA", "I'm going to play devil's advocate a little.\n\nIf my wife decided to do a trip like this I admit I would really love to go along, and if it was early on in the relationship even more so.\n\nI would want to try and connect with her, it wouldn't be about having a fun trip and it wouldn't be something that was about me. But it would be an amazing time to learn about the heritage of someone I care for. And I know me personally I wouldve already that about the possibility of a family. And I can tell you my wife's heterige is just as important to me as my own, because both of them are my children's. \n\nThere's two sides to it of course I understand the negative thinking of if the relationship doesn't work out it could taint the memory of the trip.\n\nBut if it's a relationship that seems like it may work out, or you want it to and it does it could be an amazing memory to share.\n\nI tend to think on the positive side, so yes I would be hurt and would feel that there's no future in said relationship be she showed me in my opinion that she has little belief or hope  in it being a long term relationship.", "Chiming in as a Jew: NTA. Having someone who doesn't get it on a trip like that will take away from the meaningfulness of your experience. And him wanting to join and feeling mad and jealous only further confirms that he doesn't get it. And especially at a time like this, you don't need someone there diluting the depth of what you will experience..", "I would say maybe he just doesn't get it but my husband isn't Jewish and grew up in a town with like zero Jewish people and he would have had an adult conversation with me about whether I would want him there NOW never mind when we had only been dating a few months.", "Honestly you're also overthinking this a little because of his pressure on you. You can travel without your partner whenever you want for whatever reason that you want. My partner and I are going on 6 years and take trips separately sometimes and because we're healthy we think that's just fine. He is manipulating you and this is just the beginning-- he'll keep pushing to get his way. Don't concede at all.", ">k why he thinks going to small towns in Eastern Europe needs to be about *him*.\n\nUuuuuhhhhhhh....... \n\nY'all got some communicating to do.  Ya boy is telling you he's insecure and maybe a little bit of a narcissist.\n\nNTA. go on your trip and let Ezra change his own emotional diapers", "You hit it right there. Why does any of this “have to be about him?” Three months is awful early to take someone with you on a three week trip! If it were me, I’d tell him he’s welcome to go and do whatever wherever he wants, but he’ll no longer be doing anything with you.", ">he’s not going to have any connection to going to see their old house etc. \n\nHe will if he truly loves you. \n\nFood for thought: I've been married for 20+ years. My wife's background, native country & ethnicity is different than mine. But, being by her side as she traveled to emotionally-significant places of her past (such as where she was born & where her grandfather died), was VERY moving to me. It brought us closer together. (And I know that having her by my side as we visited places meaningful to me was very special to her, too.) \n\nMy advice is, if you see a long-term future with \"Ezra\" then you should probably find a way to include him somehow: You're going to experience something deeply emotionally moving -- and if it was me, I'd definitely wanna be there with my girl (and... I don't think I'd feel too great about my girlfriend explicitly forbidding me to go, so she can travel & experience things with another guy, especially if he's single, her age & was also her first kiss). But hey, if this is just a short-term fling & not too serious, then go with your friend, accept that your relationship might not survive, and have the best trip you can.", "Honestly dump Ezra and then get with Alek 😂", "[deleted]", "Op said she doesn't want to share her family history, and it doesn't include him. \n\nIdk but when my husband and I were dating he shared things about his family history with me and we shared those memories. He loved telling me about his family history and it made us closer.", "It’s clearly a little related.\n\nIf they just started dating yesterday that’s a little different than if they’d been together 26 years in a number of ways.\n\nThat’s everything though. It’s just a factor, that’s all. \n\nIf someone on your second date gets angry and yells at you for the first time, fuck them, leave.\n\nIf your partner of 25 years gets angry and yells at you for the first time… aside from being upset you should probably be concerned as well about what’s going on, mentally or health wise.", "3 months?! wow. He barely has a reason to even ask to join and to even feel that hurt to have it dragged out so long.", "Ya, I feel like its one of those things where you can just tell its not going well (which is totally fine) if you really like the person that your dating chances are you will want them to be with you for important life events (or at least be aware of them happening) things move at different paces for everyone, but if at 8 months her boyfriend doesnt know her best friend enough to feel comfortable with them going on a big trip, and she doesnt feel like there is any reason for her boyfriend to be there with her, the relationship just seems like its not worth having. People should find people they really like being with and that are comfortable letting them be with your friends", "Pilgrimage is a great word for it! Certainly not a casual vacation.", "Happy cake day 🎆🎈", "Okay, but I think the question on this guy's mind is is she going to have a deep emotional experience and fuck this other dude on their pilgrimage.\n\nIt's a 3 month old relationship so deciding this trip is more important is 100% fine, but the guy's not crazy to not be stoked about this.", "Pilgrimage. Exactly.", "Gatekeeper. \n\n\"doesn't seem to share an emptional connection... or fully understand its moral significance\"\n\nThis is bullshit justification for gatekeeping. And I hate that word.", "Ok but like imagine you start dating someone and three months in they go on an emotional strong pilgrimage with another person they have known longer to connect with their shares heritage. It can be very powerful and overwhelming. Sharing something like that with someone you've known your entire life is bound to be very powerful. Lifechanging even, an di don't know how many of us would just be cool with our partners going on a life-changing emotional journey with another persont heyve known for way longer after three months of relationship.\n\n\nLike we can understand she's not an asshole for going on this trip but let's not pretend if this happened to any of us it wouldn't be a bit of a flag.", "Yes, logically what you say makes sense.\n\nBut that doesn't mean that Ezra's feelings are invalid. We all know if the genders were reversed (OP was a guy going with a childhood woman friend on a 3 week pilgrimage), that everyone in here would be accusing OP of \"something else might be going on with the friend\".", "That knife cuts both ways though. It seems like they only recently decided to take things seriously, but to the BF, this probably seems like a huge red flag that maybe she isn't trying to be serious with him. And you can't decide for him he is wrong. \n\nNow, as an adult I would just say they probably aren't compatible if they can't communicate around something like this, but they are still very young so, it is what it is. \n\nOP should get to have their trip. But the BF knows OP better than you do or anyone else does in this thread. And it's his relationship. He is allowed to not like this if he want's on principle.", "So if you had been dating someone for 3 months and they went on a trip with a member of their preferred gender, you’d be 100% good? \n\nBecause I’d probably break up with them.  That’s weird.  If you have such an emotional connection with this person, why are we dating?", "Why do people keep saying it's \"irrational\"? It's irrational to feel jealous when you are left out of something major in your girlfriend's life now?", "Be honest with yourself. You’d be totally fine with him taking a 3 week vacation with a female friend? And you’re not invited? You’re NTA but his feelings are justified.", "That's bullshit and you know it.. if this was vice versa.. you'd be apoplectic with jealousy and rage..", "exactly!!! also 3 months in is like… so not serious enough yet to be planning concrete future plans that require SIGNIFICANT amounts of money up front. most people 3 months in haven’t even said i love you yet and probably haven’t met parents yet. going on a 3 week long trip is just as serious as those in my opinion", "That's a very valid point. OP has no future with this guy because she is completely dismissive of his feelings.", "This is not a trip you take a three month BF/GF on.  After a year?  Sure. But three months?  You don’t even know this person; and I’d venture to say, his response to being told no is (hopefully) eye opening to the OP.", "I saw the update, this one of the more poorly written ones on here. OP should have led with this.", "Does Alek still feel this way?", "You are correct, I made my reply before the edit was added, and did not know the relationship was so young.", ">three month relationship\n\nif people were dicks to their 3 month old relationship partners and invalidated their feelings as all \"petty jealously\" those relationships will never convert to 3 year relationships or even something serious like a marriage.\n\nShe might not be the asshole but she isn't right, and he also isn't wrong in feeling that way, and if she's going to be acting this way now, she will also act this way and worse in future. And frankly if she's gonna never feel comfortable with sharing this with a partner instead of alek, she should just get with a jewish partner next. and ezra deserves someone better too who's not going to treat his feelings like this. I know for a fact this post would be yta with genders reversed because reddit just cares more about how women feel and not men feel.", "Ezra is that you", "I missed the part in the post where OP stated this... I read a few comments, I must have missed this pièces of information. Oh, I'm old... \"dated other girls for 2 months before he became esclusive\"? I can't wrap my head around such new customs, but to each their own...\n\nAnyway, the reason I voted NAH is that, regardless of time, this might become a hill each one of them will want (the relationship) to die on... it may become a moment when he decides that she does not value his presence in her life enough, or a moment when she decides that he has no business in her family history, and his jealousy becomes a breaking point.", "if this is how OP invalidates his feelings, it will not last long anyway.", "but that only matters if she doesn't have any long term plans with ezra, if it was someone you thought you will want to date for years and potentially marry ? then it would absolutely matter more to her how he feels and how it can have consequences for their future. in this case ofcourse I can see she doesn't care as much, ezra also doesnt care as much with how he wasnt even serious for majority of their relationship.", "Actually 8 months ago is when he thinks we started dating, but 5 months of that was us being super casual and him dating other people. 3 months ago we actually got into an exclusive relationship.", "it doesnt matter how long theyre dated, some things you dont do in a relationship based on your own boundary. it doesnt matter if they dated for years or a day, my boundaries dont change based on that.", "No, no, nope. I don’t think OP is in the wrong, but I just need to interject here. It’s not selfish to bring up feelings. It’s called communicating. Feelings aren’t always rational or convenient, but in any relationship worth having, you talk about them. Once you start setting rules about which feelings are acceptable or unacceptable to share, you’re headed down a dark path.\n\nIt’s NOT selfish to talk about your feelings.", "A jealous man is a dangerous man.", "Personnally loved the joke and the comparison - because yes, the Holocaust isn't chicken nuggets, and you preferring to share a (probably very emotional) trip to places that are linked to personal history with someone who also has that personal history is not akin to you not wanting to share chicken nuggets. Though maybe buy a Happy Meal for your boyfriend and tell him to suck it up.", "I think you hurt yourself by not saying right off that this is a new relationship.  People are missing the edit.", "Literally just proved the point. And redoubling on the YTA — you sound like an absolute delight.", "It is 3 months.", "Would you let your BF go on a vacation with a girl by themselves for 3 weeks and think it is fine? If you asked to go and they said no they don't want you to go? Almost no one in a relationship would find this to be acceptable behavior.", "They probably will break up after OP spends 3 weeks with another guy", "Platonic friends? Sure! A 3 week vacation with another man? Meh, might be cause for concern.", "I don't understand why you copy pasted this wrong info everywhere. EIGHT months ago they started seeing each other casually. Three months ago they went exclusive, then one month ago trip planning. This guy banged other girls for 5 months and wants to count that as time they were dating.", "...and being defensive, hostile, and immature about the whole thing as well. She could've sat down and had a conversation, rather than call him irrationally jealous and dismiss his concerns entirely. Dude needs to bail.", "Something tell me, based on her hostility to her boyfriend and lack of empathy, that were the shoe on the other foot, she'd be threatening to kill herself if he went.", "like i really dont get it, im israeli, i went with my classmates on a school trip to Poland to see the camps the chambers and all of that. \n\nyeah maybe some people cried, but majority were fine. i dont see the big deal, oh this is personal, i cant take you with me because youre not jewish so you wont get it.\n\nthats some bullshit, if you have anything important to you, who is greater to share it with than your partner, who supposed to be the closest person to you, and not some guy, \n\nmy current boyfriend is korean, hes not jewish, hes been to israel only once. but im glad whenever he comes up to me and asks questions about me, my culture or israel and showing interest.\n\ni cant imagine preferring to take some guy friend whos jewish instead of my boyfriend. \n\nlike im sorry, she obviously doesnt like her boyfriend that much, no way. \n\nthey are so going to break up", "Why should OP need to use this trip specifically to educate their bf? It's clearly a very important trip to them, they should be able to focus on themself and they should be allowed to want to share this with someone who is in the same situation. I don't understand how everyone in this thread basically puts this relationship before everything else, including OP and including generational trauma. It's ridiculous, honestly.", "Sorry, but you make your boyfriend sound like a giant inconvenience to you. I’m sure he’s hearing the same. YTA.", "[deleted]", "You could have asking him to come for the travel but to leave you during some visit, instead you ask a friend that you know since à long time to come... frankly look suspicious\nYou will yourself be educated you don't the exact detail of what happening", "because she obviously doesnt like her boyfriend that much, come on, stop kidding yourself", "Not weird when OP doesn't even seem to care about her boyfriend.", ">What would he even do there?\n\nComplain. If he's jealous now, he'll get *really* jealous watching OP and Alek share something so emotionally charged, even though said emotions aren't going to be happy-go-lucky ones.", ">What would he even do there?\n\nTry to get laid in the hotel after visiting the concentration camp.", "I was with you until the end of your edit, where you went wrong… the correct decision is to STOP screwing him (or don’t start) and say goodbye. Even if he wants to go for support reasons, and even if he doesn’t agree with her decision, his continued whining and pushiness puts his maturity at around 8 years old. He had a lot of growing up to do, and if I were OP I would tell him that the growing up will have to be done without me. It’s a 3mo relationship, it’s not like they have a history or anything worth fighting to hang on to", "Or, better yet, DON'T screw him.", "I wouldn't bother trying to keep the relationship tbh. 3 months in and he's acting like this, sounds like it'd be a long one", "Honestly some of the comments here about getting with Alek and such are bloody immature, how old are they, 5?", "You're making way too much sense for AITA", "Yes, but I think the most significant part is that she doesn’t want him there. I think OP is in the early stages of realizing this isn’t her person for this among other reasons not in this post. If she saw long term potential she might have put effort into explaining what she needed from him if he came along (ie “I could use a shoulder to lean on, but I’d rather you not come if you’ll need me to be your guide”), I think there’s more issues arising with him during this trip planning and she’s looking for the internet’s affirmation that she should walk away. The rule of Hell Yes: be it a relationship, trip or small plans, if you don’t get that hell yeah feeling, then life’s too short!", "This is perhaps very telling of where bf and where OP are in the relationship. No that he’s committed, he’s further along than OP who’s still at…this is new so you don’t belong *everywhere* yet.", "This", "The point at which you try to force someone to do something with you that they don’t want, is the point you can no longer claim you care about them or their boundaries. He feels entitled to be part of something that belongs to me, it’s *definitely* about him. \n\nAnd that’s okay, because we all feel our own feelings. We just have to acknowledge that and think carefully before we start putting the burden on other people to make us feel better", "Yeah I don't think that's what it is. MAYBE it is, but to me that seems like a big maybe. To me it seems like boyfriend is jealous now that they've been exclusive for 3 months, whereas he had no problems dating around before.", "There are so many ways he can take an interest in her history and heritage that don’t involve him throwing a tantrum because he wasn’t invited on an international trip after dating for three months bb…", "IT doesn't seem like that's what it's about, though. And even if his motivations for wanting to go were to learn more about her family history, he should accept that this is something she's already planned with someone else and that it's important to her. It sounds like it's going to be a somewhat solemn experience, although I'm sure also joyful. They've only been together for three months. Maybe she's not ready to share that part of herself yet. \n\nAlso, what if her friend doesn't want him to come? They planned this trip together and it's rude to just invite another person without talking about it first.", "Uhm, I don't think OP wants to do this trip to strengthen their relationship with anyone. They're very clearly doing this together because of their families' shared history regarding *genocide*. This might surprise you, but sometimes things do take precedence over a romantic relationship. Ridiculous take.", "Sharing the facts of history is not the same as going to the site of atrocities that have impacted your family. And this will be the first time I’m going, I don’t want to play tour guide on an emotional trip when I’m still figuring out my own feelings. There’s things I will be experiencing and processing, I don’t want to also be explaining that all to him the whole time.", "She said it's not about not sharing but that this trip doesn't include him because literally her and her friend's fam history doesn't include him. \n\nThis is a personal trip about family history and emotion and trauma. OP can take a separate trip with Ezra. Ezra is jealous and needs to grow up.", "I have been informed by OP that I misread a bit and Ezra actually claims they've been together 8 months. 5 of which were \"super casual\" where he was seeing/dating others. And /now/ he wants to be hurt that OP is taking a joint trip with someone so both of them can connect with their shared family history.\n\nOP has told Ezra she doesn't want him there but I guess he thinks a trip which inevitably deals with holocaust is bound to have OP falling for Alek?", "True, I just cannot understand why people say her bf being jealous is the only problem lol\nShe also didnt communicate him enough. According to what she said about ‘jealousy’, Im sure the relationship will be over soon", "yeah it’s not like they’re going to a resort together", "I mean, if she wants to fuck after visiting a Holocaust-related site, it raises other red flags, and thinking that she could also does - at least to me.", "Yeah I mean there’s definitely a question of whether one day Alex and OP will fall in love and whether this trip will be the catalyst, if they are at all attracted to each other honestly it seems kind of likely, but I think this is a unique enough situation that Ezra is just gunna have to live with that possibility. At the end of the day you can’t force your partner not to cheat on you if you feel me.", "You can \"gatekeep\" your families past traumas all you want", "I suppose it's where the fact that their relationship is \"fresh\" comes into play in both sides of the argument. On the one hand, they've only been together for 3 months, it was a trip planned before they got together, and the boyfriend isn't completely up to date with the heritage, so I can understand that he isn't invited. But on the other hand, they've only been together for 3 months, and a trip of that magnitude is something powerful, so I also understand him feeling left-out and being angry about it.\n\nI'm not Jewish, but I've lived in Jerusalem and visited Yad Vashem, and I've also been to some Holocaust related sites in Europe. There is definitely a difference between how those place resonate when your family went through the Holocaust and when you're seeing it as an \"outsider\".\n\nI had the same feeling when my family visited a place connected to my family heritage on my mom's side. It clearly didn't resonate with my dad the way that it did with us, and it didn't resonate with me and my siblings the way it resonated with my mom. It's so hard to explain those emotions to someone else, and I can understand wanting to do it only with people who'll understand on a deeper level without having the extra emotional and mental burden of having to explain things to other people.", "I suppose it depends on your view on male-female friendships ? I went on holidays with a male friend for 3 weeks this summer, and my boyfriend takes weekly salsa classes with one of his female friends. There is never any doubt in any of our mind that nothing else is going on. But I can understand that for some people, it's hard to believe in completely platonic friendships with someone of the other gender - and there can be bias on Reddit in that sense.", "This is such a weird take to me. Going on such a meaningful trip that long isn't something you do with someone you're trying to get serious with. It's something you do with someone you're already serious with. It's not a relationship building trip where you're going on adventures and having fun, it's a memorial about their grandparents. It's really weird that Ezra wants to go on it. I could see your point if it were just a vacation, but it's not.", "I think his irrational jealousy and “pick-me” attitude is a huge red flag for OP. She’s explained the nuances and significance of this trip and he’s making it about himself. Sure, he might see it as a red flag… would he if OP’s friend was a woman?", "Yes, it is irrational to think something involving her necessarily has to involve him just because they're dating, and it's even more irrational to get jealous of the lifelong friend that went with her when the friend is actually part of that story.", "Genuinely, yes. Because you know what, if a girl can take him she can keep him, and if he wants to cheat, it won’t take a three week vacation. Men can cheat in three minutes even if you have their location. If he’s that guy he’s going to be that guy regardless of the energy I waste worrying.", "But the thing is.\n\nThis is not a vacation trip its a sentimental one", "Most women say yes they will be, but when push comes to shove none of them are, I have seen this multiple times in relationships, when husband says he's not comfortable with someone and ask them that same thing but reversed, everyone say yeah they will be okay, but then when it comes down to it, they are pissed.\n\nthis is kinda same for open relationships that start where one partner wants to try out something new and convinces the other partner, but when the other partner also starts getting with new people the original one who started it wants to close it back due to jealousy.\n\nEveryone wants to give the \"right\" answer but when it comes to acting it out, no one acts right due to emotions actually coming into play.", "Not everyone is jealous and controlling. If my spouse had a situation like this, he could absolutely go by himself or with his friend. I will be hitting the spa somewhere warm.\n\nIt’s okay for people to exist outside of their romantic relationships.", "How very illuminating for you to project your own insecurities onto the rest of the world. \n\nWhen there is real trust in a relationship, jealousy can’t find its way in. When someone is apoplectic with jealousy and rage, there is neither trust, nor a relationship. \n\nJust because you have the emotional maturity of a crayon, don’t assume no one else is more evolved.", "Maybe you would be, but trust me I’m not that kind of person. Who gets in a rage about someone wanting to connect with their family history and doing that with someone who shares the history? Honestly anyone who gets that mad about it should seek help.", "that's a ridiculous way to react to that", "but if this was a man/woman someone considered the one or saw a future with they won't be dismissive of the feelings as \"petty jealously\", and just bulldoze through and say nah fuck you im going out with my opposite sex friend on this trip that means a lot to us.\n\nBut you will never understand our connection like him, and that's kinda the point i made, you won't take a 3 month relationship person to this trip for sure, but if it was someone you actually cared or thought you could have years with or a serious future with the 3 months won't matter as much in how you treated their feelings or the actions you took when they were mad.\n\nAnd if it was someone you thought you had a future with you would teach them and share that stuff with them, and would want to take them with you too, that won't affect the friendship with alek in any way would it ? and if inviting them feels pandering to jealously and fomo I don't think there is a future anyway, 3 months aren't ever going to convert to anything more if that's how people thought.", "Yup.", "That it wasn’t romantic? Idk, it was a decade ago, we haven’t mentioned it much lol. We’ve kissed more people since then I don’t think it’s at the forefront of either of our minds", "Your question seems like you're shifting blame to hide that you're Ezra.", "Dhdjdk And now he wants to force himself in on your trip with Alek?\n\nDoes he even wanna go for you or does he think he needs to be there in case you and Alek start developing feelings while looking into the dark times in your family history?\n\nETA, maybe you should make an \"update\" post to clear up the relationship status and what Ezra's issue is because some seem to read this as \"Oh he wants to connect with you\" While others (like me, I'll openly admit) read more of a overly jealous vibe and Ezra wanting to shoe-horn himself in on the trip because you happen to he going with a guy.", "A boundary of you can’t travel with a family friend is controlling", "New or old, still, the way OP is answering a lot of responses shows maturity isnt the highest. All for ones belief of doing whatever tf they want but just seems she rlly shouldnt be with this guy as a lot of her responses are pretty shallow and heartless towards him.", "A pilgrimage to see where your family was tortured and murdered is not a romantic vacation.", "They do. You don’t. \n\nHumor is not a measurement of maturity. Able to utilize humor on the subject of person trauma is actually a sign of great maturity", "5 according to Ezra. Because he wants to count the 2 months where he was seeing/dating other people too.\n\nBut according to him OP is not allowed to go on a trip with a family friend entirely emersed in their shared family history she knows because \"that's unfair to poor Ezra\"", "it is not a fun vacation.", "Not a vacation though.", "Fine - who cares?  This is a trip to visit places where her family members were tortured and murdered.  If new boyfriend can't handle being excluded, oh well.", "It’s like you read one sentence of the story and ignored the rest of the context. I’m sorry you’re living the life you are with your POV.", "Simple, I misread, was a lil quick on copy paste, and now haven't managed to find all the mentions to edit/fix them", "You mean, she's being defensive and hostile to assholes who are saying her boyfriend of 3 months'  feelings matter more than her trip to go see where her family was tortured and murdered?  Wah, wah.  No big loss if dude bails.  This is much bigger than him and he's too immature to see it.", "Apparently based on reply I got from OP in Ezra's head they've been dating 8 months, except 5 months were super casual and he dated others, and OP only counts the 3 exclusive months and is not comfy with him being on the trip and has told him she doesn't want him there. And instead of accepting her boundaries on deeply personal topic Ezra has kept nagging her to let him come along.", "If your bf/gf of *three months* is the \"closest\" person to you, I feel sorry for you. That is nowhere even close to being significant in your life, and if it is, again, I feel sorry for you.\n\nAnd she's not taking \"some guy\", she's taking a person for whom this is an equally personal trip, and with whom she shares a bond *specifically over the circumstances surrounding this trip, and whose inclusion on the trip is critical to its meaning*. They're not going to learn about the Holocaust, they're going to see specific things from their specific shared family histories. The boyfriend is not part of that, and it's crazy unhealthy for him to insist on worming his way into it.\n\nIf you didn't read the original post (and based on your reply, you cannot possibly have read it), just say so.", "Probably because if this is a major part of OPs history and heritage a lot of us seem to think that her boyfriend should be included in it. How is they weird?", "They've been together for 3 months (8 months but the BF was seeing and dating other people the first 5 months).\n\nHaving him on a emotionally charged trip because he doesn't care about OPs or her friends feelings and sees nothing but his own wants makes HIM the AH. Not OP.", "It's called codependency when you aren't allowed to do things on your own.  It's also called a big red flag when early in a relationship (3 months) you aren't allowed to go on a pilgrimage to see where your family was tortured and murdered without taking him, because his feelings are more important than your family trauma.", "I didn’t ask Alek to come, we planned the trip *together* because the places are significant to both of us.", "I can even see him complain about “not doing anything fun!” and I understand his jealousy with OP sharing something so deep and sad with her friend but this does show a level of immaturity in him. I wonder if he even understands the seriousness of the whole thing. I say NTA", "Like trauma bonding isn’t a thing lmao", "\"Ezra\" also thinks their relationship has been going on for 8 months, OP only counts the 3 months where they've been exclusive and unlike Ezra doesn't count the 5 months of \"super casual\" where he was seeing/dating others.", ">I think the most significant part is that she doesn’t want him there.\n\nThat's a very prescient take & I agree with you. Of course... it's always kinda tricky to diagnose a relationship from afar, especially when we've only heard one side, and we ALL are unreliable narrators. But I suspect you're correct, and I'd take it even further: She's more blasé about their relationship, whereas he's viewing it differently -- which might help explain his strong, emotional reaction to being deliberately excluded, while his \"girlfriend\" is traveling & sharing emotionally-charged moments with the guy she used to smooch.\n\n(Or, her boyfriend is just an immature a-hole. That could also be 100% true. But just reading thru the tea leaves... I suspect that neither of 'em have a monopoly on maturity.)", "I think you're right: Because she's viewing their relationship as a shorter-term, less-serious thing, she assumes that he's also on the same wavelength, and thus, his motivation MUST be that he's selfish for wanting to come, and he's doing it for *him*.\n\nBut if the guy is viewing their relationship as waaaay more serious & sees OP as someone he might wanna be with long-term, his motivation might just be that he's scared as fuck/insecure that something he greatly values might be in jeopardy -- and he's (in his head) trying to join the trip for *us*.", "trust yourself. it's clear you have good sense.", "And say she lets Ezra go. And he watches her and Alek share these very special, solemn moments, and the attention is not on him, and in the evening he expects her to placate him and make him feel better for the hours of the day when he wasn’t her sole focus…\n\nI’m not saying that Ezra is this type. But only 3 months into a relationship and he can’t set aside his jealous/selfishness/whatever? I don’t see it getting any better.", "People responding just don't get it.  She's been with him for 3 months.  They are not some really solid long term couple.  This trip has nothing to do with him and he only wants to go out of jealousy.", "Right? Like this is going to be beyond tough for them. He’s not going to understand the importance and probably complain about the trip. This is something OP needs to do with her friend. He’s acting jealous and isn’t understanding the significance. This isn’t a romantic getaway.", "Now that the op provided more info I'd say NTA but she does sound cold and I don't think this relationships gonna last. \n\nI could see her being the AH if she was this dismissive if they were together for say 2 to 3 years but since it's only been 3 months I understand and vote NTA. hence why I asked my question before passing judgment.", "You are 1000% correct and NTA. I’m Jewish and I fully get what you are doing and have mad respect for you, it’s even making me a bit emotional thinking about what you are going to go through on this trip. \n\nI guarantee 99% of these people questioning you are not Jewish and have zero idea the deep emotional trauma the Holocaust rendered on our people and in particular your families shared history. Ezra is clearly not understanding this either. \n\nAlso, this is Reddit so take these haters with a grain of salt and quit responding to them. They just don’t get it and/or are playing devils advocate.", "ya I definately agree, I totally understand having important family history and wanting to keep it with people that already share that history. That makes total sense, the thing that makes me kinda understand where the boyfriend is coming from is that she went through the whole planning stage of the trip with her friend, and didnt involve the boyfriend at all (at least from the sounds of it) If I were to attempt to play therapist, id gues that the boyfriend is just hurt because he realized (or is fearful) that the OP doesnt see him as either important or lasting enough to include in her plans, even if it was just mentioning \"hey im thinking about going to visit family stuff with my friend in a few months\"  everyone keeps saying that they barely know each other, but its been 8 months, of course hes going to feel a little hurt that he wasnt included at all. He didnt go about voicing it very well, but he deserves some benefit of the doubt as well", "People bang after funerals all the time.  With the close family ties and emotions running high?  Don't kid yourself.  Grief is as good an aphrodisiac as any.  Maybe there's zero attraction but if there's any...", "And that's all totally fair to op, I don't think she's an asshole at all. I also think her boyfriends feelings are very valid. Such an emotional journey with a close male friend will make most people jealous that fresh into a relationship. \n\nIt may be a deal breaker on such a new relationship as well. Its really unfortunate timing for op, and I feel like a very grey and tricky situation.\n\nI hope she figures it all out in the end", "It's not weird. Who says that the early stages have to be only about fun and adventures? Maybe I'm old, but seeing a place that has such historical significance to my SO would be much better than ziplining and jet skiing - that's where the real relationship is forged.", ">it's a memorial about their grandparents\n\nThat can still be an experience that helps a new couple be closer together. It helps them connect and creates a bond between them and lets him into her life and past a bit.\n\nIf I were the BF I likely wouldn't be concerned with the the thought of them having sex, but I would be a bit put off by the fact that she doesn't want to share that part of her life with me. Would it be a big deal after only a few months...probably not. But I'd still be a bit miffed at being left out.\n\nI still think she's NTA, but are they trying to build a relationship that will last or not?", "Ok, and that's fine. You're allowed to feel that way. \n\nPersonally, I wouldn't feel like my partner was taking the relationship seriously if they didn't share something like this with me. \n\nOn the other hand, this might not even be a factor for either of them. \n\nPeople are different and we are all allowed to have different expectations, boundaries and perspectives.", "I dont think that's relevant. The fact is many people have many different expectations for relationships\n \nBF is allowed to expect inclusion and OP is allowed to expect freedom. \n\nBut they are both clearly not going to get those things from eachother.", "It's not irrational to be jealous that your (new) girlfriend wants to take a life changing trip with her friend and not you.", "So refreshing to see this outlook.", "excellent point and power to ya.", "Honestly, with this level of maturity, you should be the one giving the advice on here. Kudos.", "Thank you, keep that perspective! That's mine, as well.", "EXACTLY. I've never given a shit about knowing where my girlfriends were or who they were with. I knew they weren't going to cheat on me. We never would have reached the level of closeness we already had if i was concerned about that. Anyone who obsesses over it is crazy. Dump this loser.", "Girl, you're so dang mature. You have no clue, but you actually just gave me sound advice with this reply. I wish you well on your trip.", "My question would be, has he shown any concern at all about how this trip might affect you emotionally? Has he expressed that he wants to be there FOR YOU? Or is it just that he doesn't want to be left out? \n\nYou're NTA either way, but if he's just complaining that you're doing something--anything--without him, then it might be a red flag for some controlling behavior down the road.", "This - like you've only been with his officially 3 months. Why does he feel entitled to a 3 weeks trip that that has a lot of family history behind it that he probably doesn't understand", "[deleted]", "I feel like you’re missing the point…your bfs feelings are valid in this as you are taking 3 week trip with another man. Yea, I understand the circumstances and that’s also valid but think about it from his POV….either way both feelings are valid here maybe look for a compromise?", "I mean, I've literally waved goodbye to my so as he took off on a cross country trip with his female best friend. The trip was about them, not me. They had a great time, I enjoyed the time to myself. If he wanted to cheat with her, he has had many other chances.", "So he cant go to Say greece for a beach vacation with his friend Thats a girl?", "Hmmm.....", "Is Alek currently single?", "You might be surprised how much men hold in, hoping the other party will change…", "Wow lol\nI hope ur bf can see these", "He can’t possibly want to be there for me because I’ve explicitly said I don’t want him there. So he wants to be there for him, idk if it’s about Alek or his own thing but it’s definitely not about how I feel", "Haha, he was selfish to try to guilt her for not letting him go to a place her family friends suffered at. You're ridiculous", "It doesn't matter she is bringing a man he doesn't know and is invalidating his feelings blaming him. This is already a dead relationship.", "It seems OP cares, hence the post… I wouldn’t blame any man for breaking up with a girl in a new relationship for wanting to go on a 3 week vacation with another man.", "The context around “you’re spending a 3 week vacation with another guy”? OP should go on the vacation, but just accept her bf won’t be around when she’s back, most likely.", ">You mean, she's being defensive and hostile to assholes who are saying her boyfriend of 3 months' feelings matter more than her trip\n\nNo we are just empathizing with the BF as most men (AND WOMEN) would not be comfortable with their new SO going with a man that she says she has known for her whole life going together alone on a 3 week travel together.\n\nLike some women really have no empathy for men at all do yall really believe you have the right to do whatever you want in relationships and think everything is cool but if the man gets upset they are jealous, insecure assholes? You can't do everything that you do when you are single when you are in a relationship there has to be compromises.", "If he wanted to up and go on a trip with a female friend, and he banned her from going, would you take this position?", "It's a boyfriend of 3 months, they made the plans after 2 months.  Would you really think that the first time you go to see where your family was tortured and murdered is a romantic trip that you'd want to take your new partner on?", "Because this is important to OP and they don't want to spend this trip educating him? They stated so already. How are they *still* obligated to bring him? Are his feelings of inclusion more important than a person whose family survived the Holocaust getting to honour their grandfather and perhaps working through some very heavy feelings the way they feel is appropriate? The BF can take the backseat for this one.", "Yes for 3 weeks with a man friend...\nSeriously, do you even love your BF because you speak of him really bad??", "Dating for eight months is still such a ridiculously short period of time though… especially when only three of those have been serious.", "I thought I was going crazy here lol. Sometimes survivors/victims/minority groups in general just want to share and talk with those who get it, who are in the same position. This has no impact on their romantic life. There's plenty of time to share this part of their life with the BF down the line. It doesn't need to be this trip specifically.", "Yep it’s brand new.", "The moment I read WHAT family history they shared - there are no two ways of looking at it. I have family lost in Holocaust - in the concentration camps and in the forests - and I would have taken my goy partner there only if they were a partner, not a recently begun relationship, and only if I were certain they were historically and emotionally prepared to experience it if not in the same way but at least comprehend my experience to some extent and take the lead from my state of mind there when it comes to their behavior, mindset, conversation, activities, etc. And it would have been significant to me whether they are a person I see joining me on a trip like that...", "A funeral and a concentration camp aren't exactly the same thing though ? Or even just the Warsaw ghetto. But I suppose I understand what you mean - though the idea makes me want to puke", "For me, it’s not that she doesn’t want to share that part of her life with him. I *get* that. New relationship.\n\nBut, on the other hand, saying “I’m going on an emotional journey with my lifelong friend, with whom I share a bond I will never have with you” is not exactly what you wanna hear from a romantic partner.\n\nShe’s not wrong for going without BF, but he’s allowed to feel how he feels about it. Within reason anyway.", "I think that’s ridiculous and he should stay at home jealous. A kind and secure partner would not care.", "He sounds like a big red flag, trying to force his way onto this pilgrimage with a family friend she's known her whole life, like it's some kind of romantic beach vacation.  They've been together for 3 months.  Seems like a lot of you think you aren't allowed to be your own person if you have a boyfriend.", "No she sounds like she has a healthy outlook on her partners autonomy. It sounds like she manages her jealousy in a healthy way that doesn't restrict her partners movements and it's frankly refreshing.", "The point of a relationship is trust , one of them anyways \n\nIf I can't trust my partner to not fk other women when im not present - that was already a problem before he took this hypothetical vacation with a friend to a fkin HOLOCAUST pilgrimage , a place wher they are foing to be doing the least sexiest activities anyone can think of. \n\nGetting mad at the vacation like that's the cause of the cheaters behavior is stupid, he was already looking to bang elsewhere if that's the case", "I mean I don’t really like the guy just from what’s been written.", "His feelings are totally valid, they’re his feelings, you can’t really make a value judgement. However, I don’t think his feelings mean he should come on the trip, or feel like I should have to invite him. I don’t feel like his feelings mean he should be trying to pressure me and make my personal experience about him and his feelings.\n\nAt this point it really feels like he cares more about making sure he gets invited than what this trip means to me in the first place which feels disrespectful af", "Because visiting Auschwitz is the same as a beach in Greece smh...", "He can if he wants. I’m really blasé about those kind of things, but I get that not everyone is, so if I was going on a two week resort trip with Alek I think it’s fair he’d mad about that.", "Even if OP gets jealous  for him taking another girl to beach funny vacation she would still be right because this is not a funny trip to greece is a sentirntal trip to see your family horrible and traumatic history.\n\nIt would be as if OP gets jealous because there is a woman in the boyfriend work trip or gets jealous because he is going to share a car with an old girl family friend to attend a funeral.\n\nVisit Auschwitz as an Holocaust survivor descendant is everything but a Funny beach trip and is normal to want to go with someone that is in your same position and know your history and not your 3 month not even jew bf that is going to go to the trip for fun and not sentiment", "Also like... knowing that he's considering this a relationship where he has spent the majority time with other people... yeah. Not getting serious vibes from him as him wanting to he there for you at all", "He behaves like a jealous baby. And the relationship is dead for that exact reason.", "No, the context that this “another guy” you keep mentioning is all but biologically family to OP.", "And if he isn’t then good riddance. OP deserves a boyfriend who trusts her in situations like this and isn’t so fragile as to think a trip taken with a friend to discover family history is something to get worked up about.", "As in same situation just genders reversed, or as in Ezra as Ezra on some random trip with a random girl? Because at least to me that's two different scenarios.\n\nIf simple gender swap and OP was a guy while Ezra and Alek were both women, and all the other things remainded the same then I have the same position, yes.\n\nIf not then it depends on the circumstances", "“A man friend” \n\nthe standard and expectations that heteronormative culture puts on relationships like this only hurts people, the idea that there’s something so unique about traveling with a man that is automatically a betrayal of some sort  that if he was just a another gender this would all be fine??? incredibly weird standard to hold someone too", "They've been together 3 months (8 but the first 5 months* OPs BF was still seeing and dating others).\n\nOP even said that feeling love between either of them (op and the bf) is still a bit off (meaning not there yet)", "Oh, yeah totally agree with that, just in case it wasn't clear. I'm utterly baffled that he wants to force OP to take him along on this trip.", "They are not the same thing and the joke about getting frisky while watching Schindler's List being unacceptable was made by Seinfeld long ago.  But being sad and desirous of comfort is being sad and desirous of comfort.", "This just reminds me of The fault in our stars where they kiss in the Anne Frank house…biggest red flag ever 😂", "Agreed. \n\nIf this is about him being jealous, he's a total AH; she should dump him.\n\nIf he just wants to be included in a big event and try to build a relationship with her, he's less of an AH but still shouldn't be trying to force his way into it. But if this is the case and she doesn't want him to go, then she should consider if she really sees a future with him or not. Because if she does, then this is the kind of thing that can build that relationship and she may want to reconsider. I'd understand him being miffed at being excluded, but I'd still respect her right to choose whether or not he comes because of the newness of them as a couple.\n\nEither way she really needs to think about their future.", "never said that he didn’t, go read my other comments where i say that he needs to work on the understanding part of this trip but she also needs to recognize that calling someone’s feelings petty and irrational does nothing to help the situation and only makes it worse.", "i mean if you read her other comments, no actually it doesn’t.\n\nedit: half her comments were about how his feelings were petty and she doesn’t care about them", "i’m basing my comment off of the others she has made and the fact she disregards his feelings, not about the fact that if he cheats he cheats.", "neither do i but i don’t really like OP either. don’t think it does any good by calling someone’s feelings petty and irrational.", "Honestly it is disrespectful. If you’ve tried to sit down with him and work out a solution to ease the jealously (that doesn’t involve him getting a “shut up invite”) and yall can’t come to a mutual understanding then he probably isn’t mature enough to date. \nLet’s be real I think most people would be a bit jealous in his situation, but a healthy adult would be able to take a step back and nurse that emotion themselves. Or if it’s too big an emotion for that, by coming to the s/o and saying “hey I’m a little uneasy about you going away with another man without me, can we maybe spend some time together beforehand so I don’t feel as left”. \nMost people haven’t learned this skill and that’s okay, so if you like this guy and he hasn’t done that, offer it. If he rejects it and still only wants to come with you, then dump him.", "I think you're spot on here. You're NTA, and if he's expending this much energy on trying to change your behavior and get things his way this early in the relationship, is there any chance that this is a one off reaction on his part? Because I highly doubt it. I think he's showing you who he is and what your relationship would look like if you stay with him. Is that the energy you want in your life?", "If that's how you feel about it then I would doubt that this is even going to work long term. I don't think he will be any less jealous next year, or the next. I think you're expecting your partner to be someone you know they aren't and at some point that's kinda on you.", "You can validate his feelings without taking him along. I think a lot of people expect that if bf’s feelings are valid then OP’s are not valid, and that’s not fair. However, I get the impression that he does not understand the gravity of the trip, and I think he would probably ruin it for you. This might be your dealbreaker. It has only been 3 months. If he were a fiancé or spouse it would be different.", "The way you speak about your boyfriend is driping with contempt and uncare. You don't seem to like him or even recognize his feelings. I'm not saying you should take him in the trip but at least be a little more understanding. Just do a favor for both of you and dump him so he can find someone who actualy likes him.", "So an unrelated male… on a 3 week vacation…", "And likewise, I hope OPs boyfriend finds someone who respects him enough to not travel and potentially share rooms with other men for a month at a time.", "Her hostility toward Ezra and her defensive response tells me she plans to cheat.", "Well if your partner is okay with you travelling with a person of opposit sex (i mean if you are straight) during 3 week and someone that you know since à long time,  good for you. I will not. He express his unease she compare it to à nuggets so frankly 0 trust if I was the BF", "I don’t think this trip should have anything to do with their future, clearly she does not want him there. It is not an opportunity to build a relationship if OP doesn’t want it to be. It has nothing to do with him.", "Sometimes feelings are petty and irrational, does nothing to pretend otherwise.", "bc they are petty. this isnt a vacation, this is op and their friend honoring their respective family members  in a very somber way. if op was going to a resort or something, then the bfs feelings would be valid, but this is not for fun, and is something the bf has no business being included in.", "You sound like the kind of person who goes through their partner's phone. OP sounds like she trusts her man, even after only 3 months. All she is saying is that if he *wants* to cheat, he will. She's trusting him that he won't.", "I haven't read all her comments, so maybe you're right, but why not respond to one of those comments instead of picking one where she expresses her trust and healthy boundaries?\n\nWere you just hoping your comment would be more seen by responding in a higher thread so you'd get more points? Otherwise I don't know why you'd pick this comment to respond and then say \"but her other comments!\"", "Eh. Sometimes peoples feeling are petty and irrational and it’s not up to us to hold their hand through them every time.", "True", "She's talking so well about healthy boundaries and trust, but people keep saying she doesn't like her boyfriend.\n\nSome of you obviously equate jealousy and control with passion, but that's not what makes a healthy relationship.", "This is wild projection. Consider looking within instead.", "Its not disrespectful to do this. People throw around the word respect when they mean obedience.", "again like i said in this comment, go read my comments where i said that’s true but it doesn’t help anything by name calling", "nah they aren’t, one can be understanding of the fact that this isn’t not a vacation (which i’ve stated in other comments she doesn’t got to take him) while also feeling uncomfortable with the fact that a three week trip will be taken with a male friend. \n\ni’m not saying she should take him, what i’m saying is to be considerate of his feelings due to the fact that he most likely does feel as if he is not a solid person her life just yet. that could be due to the short time they have been together or the fact that it’s just a specific boundary he has. he’s not wrong for his feelings and he’s entitled to them just as much as OP is, by dismissing them as petty proves that she has little care when it comes to her partners uncomfortable feelings.", "and also ready to take the consequences if he turns out to be a cheater. Trust begets trust.", "sounds like she isn’t respecting his feelings. calling them petty and such. people are entitled to their feelings and his are valid and by dismissing them as well as half her other comments, yeah it sounds like she doesn’t like him/ doesn’t care to try to better or strengthen her relationship with him. she doesn’t gotta take him on the trip but not even willing to talk to him about family history doesn’t sound like a person wanting a long term relationship", "and never said they weren’t what i said tho \nis that by name calling them does nothing, but make them more anxious and afraid", "Honestly just dump him 💀", "Thank you. Like people in this comment section are really out here telling on themselves by saying OP having healthy boundaries is cold.", "Petty and irrational are adjectives, not name-calling. If his feelings about this are petty and irrational that’s important information.", "Nah, he should've kept his feelings to himself here. Hes being selfish.", "They've been together for 3 months and his feelings are based on the idea he thinks she is going to cheat on him with someone who is basically a cousin. He can have those feelings but those are his responsibility to work out, not OPs.\n\nAgain, this relationship is 3 months old (5 at the most). OP has probably been planning this trip longer than they've been \"official.\"", "Respecting someone’s right to have a feeling about something isn’t the same as respecting the actual feelings. Sometimes what one feels IS petty and dumb, of course it’s allowed and it’s a natural thing, but that doesn’t mean that everyone should have to pander to it. At a certain point it’s on each individual person to get over themselves and hold their own hand through feelings. Also in the few comments I saw of OPs it sounds like she understands his jealously, but just doesn’t think that she should have to pander to it by inviting him on the trip. Which in this context is completely fair and doesn’t mean that she dislikes him.", "You say that but OPs boyfriend isn't respecting her feelings either, so what? She should just forget her own feelings for a guy who she's been with 3 months (8 months but 5 of which the boyfriend was seeing and dating other people)", "Sometimes peoples feelings ARE petty though.", "I mean sometimes we have to sit with uncomfortable truths about ourselves. Ones we don’t like that make us anxious. And good partners/friends/family are hopefully the ones telling us about that stuff when we can’t see it ourselves. Hearing words we don’t like is good for us at times.", "Seconded. OP sounds a hell of a lot cooler than her bf"]}