{"id": 3341, "submission_id": "z5vl6e", "title": "AITA for confronting my autistic neighbor for not respecting quiet hours?", "selftext": "Edit 2: I seem to have my first Reddit stalker??? They made several replies here, falsely accusing me of making threats, getting physical, etc. None of that happened at all. Calm down and get over yourself you strange person.\n\nEdit: We ran into each other about an hour after posting this, and we apologized to each other and talked it out. He's a fairly good kid, and nobody's upset at one another anymore. I'm going to have to highly disagree with the comments suggesting he purposefully was being inconsiderate or using his autism as a get out of jail free card for everything in life. I've met my share of people like that, but that isn't what happened here. Also, to the one person who sent me a private chat saying I'm a narcissist, my wife laughed at you and wants everybody to know she thinks you're a dingus.\n\n------------------\n\nA few days ago, some kid moved in to the vacant apartment on my floor. Right off the bat, our introduction wasn't on a great note. He somehow couldn't figure out how to get inside the building (you just use a key...) and I had to come out at 1 AM in the snow to help him. I let it slide since he looked about 18 and maybe hadn't lived in an apartment ever.\n\nFast forward to tonight, when he for some reason decided to do his laundry and drying at... 1 AM. For the record, my apartment is right above the washer and dryer in the basement. All 10 families in the complex get enough time to do the laundry, with leases saying you can only do it between 8 AM and 9 PM.\n\nAs you can expect, my apartment was shaking to the point it woke me up. I went down to the basement and saw him with a deer in the headlights look. I asked him why he was doing his laundry this late at night, well into quiet hours, and he didn't have anything to say. I told him he isn't any exception to the quiet hours rule, and he started firing one excuse after another, saying this was his first apartment, claiming he'd never felt the washing machine in his adjacent apartment, etc. I told him to stop with the excuses and take this as a lesson learned to not do laundry outside the hours outlined in the lease. He gave yet another excuse, saying that he's autistic and sometimes doesn't think things through the way a normal person would. He started stuttering out apologies and hoping I don't hate him (???). I just went upstairs and told him that if he ever needs to do laundry at night again, to take an Uber to a 24/7 laundromat.\n\nI went to the gas station to get soda, and when I got back in bed, my wife let me know she went down there and talked to him. Apparently he's afraid of men in general and was worried I'd call management and he'd end up homeless, and my wife had to reassure him nothing like that would happen. AITA?", "created_utc": 1669536845, "permalink": "/r/AmItheAsshole/comments/z5vl6e/aita_for_confronting_my_autistic_neighbor_for_not/", "score": 61, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told some kid half my age to not do laundry so late at night, and my wife who works with autistic middle schoolers said he ended up having a minor anxiety attack over it and that I accidentally scared the crap out of him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA Unless you left out a whole bunch, it doesn't sound like you were very hard on him at all. You let him know what the expectation was within the building and even gave him an option should the 1 AM laundry need strike again.", "NAH. You didn’t go down there and scream at him. You probably could have been more gentle, but there’s nothing inherently wrong with being direct. Sounds like he has a bit of trauma that made the encounter more difficult for him, but luckily your wife is an absolute treasure and was able to reassure him. Now that you’re aware of his situation though a gentle, “hey buddy, remember what we discussed re laundry during quiet time?” Would be better suited, but you hardly knew that in advance.", "Nah. I can see how he figured if the laundry was open, it was okay to use it any time he wanted. Sounds like it's been resolved.", "NTA. If he does unsociable things he's going to be confronted angrily, especially if interrupting someone's sleep. You're not going out of your way to be a dick. It's up to him to know what the rules are and how they apply to him, not up to everyone else to accommodate him, particularly at 1am", "NTA at all, and I’m not understanding any of these Y T A comments. It’s absolute fucking common sense to not start a cycle of laundry in the middle of the night when you live in an apartment building. You got woken up by it and it’s completely reasonable you’d be angry. As someone with a serious mental illness, it’s unreasonable and unrealistic to use that as a crutch to avoid responsibility.", "I might be going against the grain here but NTA.  Anyone with a bit of common sense realizes you don’t make noise in the middle of the night.  Imagine if you weren’t confrontational, his behavior would have continued.  You may have been harsh, but I get it.", "Soft AH, but you wife is an absolute angel", "Soft YTA here - I understand your frustration at being woken up at that hour, but it sounds like you came in guns-a-blazin’ on the poor kid. It’s his first apartment, he’s autistic, and it sounds like he has some phobia and perhaps trauma surrounding men; he’s not going to be perfect at all of this stuff off the bat. And of course you couldn’t have known these personal things about him…except for when he tried to explain it to you. You seem to dismiss all of his explanations as excuses, when really he was just trying to explain *why* and give context. You did ask first why he was doing the laundry, it just took him awhile to respond.\n\nI think if you’d calmed down and listened to him first, you could’ve avoided coming across quite as harsh as you did. Again I understand your frustrations here and it’s not like you’re a bad person or anything. It’s just a bit more kindness and patience is what a situation like this needs, which your wife seems to be aware of. It might be helpful to apologize to him and give him a few tips related to the rules and operating hours of other things in the building. That shows him you’re a good neighbor while also hopefully minimizing any future events like this.", "NTA!!! You didn’t intimidate him? You didn’t scream at him?? I don’t know where the ef people got that from. \n\nThe child made a mistake. You didn’t take it personal. \n\nI have extreme anxiety that even standing next to an unknown man causes me to palpitate, but reading what you said sounded reasonable, unless you have a deep voice then I understand feeling like you’re getting yelled at. \n\nBut those downplaying the literal movement of your apartment, or telling you to expect noise? What?\n\nWhen moving into anywhere w a lease/contract, it is important to always read it thoroughly. \n\nAs you should be when you’re signing it. \n\nI understand the kid didn’t know any better. \n\nBut OP just made it clear to be mindful next time. He didn’t cuss him out. \n\nJust confronted the one making noise at 1am. As anyone would do. \n\nAnd I hope the boy has some form of therapy to help w his fear of men, because unfortunately living in an apartment alone won’t help it. \n\nBut could be why he does laundry late at night, so when you apologize I’d ask OP. \n\nAnd even suggest to go during hours people are mainly at work as they’re usually empty I’d believe as they are in the places I’ve lived.", "Nta", "Not for telling him but you seem a bit of one how you handled it. I mean you must have recognised that he was actually afraid when he gave all these excuses, didn't you? See, I would be annoyed as well but if I see the other one actually is afraid and if the excuses would annoy me any further I would just say: \"No big deal, just don't do it again.\" And I am actually a very strict person that can come off as harsh but I wouldn't want to let someone be an over the top uncomfortablenesses in context to the actual situation. For that it wouldn't need the information of him being autistic, it would just clear my surprise that someone would be scared from that. But well, I am a woman and that we're on average a little better in such things is no secret, lol (you're on average better in other things, just saying, before someone feels pissed when coming along someone who doesn't ignore differences in sex). I go with\n\nNAH\n\nbecause he just made a mistake and you were just in a grumpy mood from being woken up.", "Nope. Rules apply to everyone. Including those who claim to be autistic.\n\nNTA.", "YTA, kind of. The guy should be respectful of the lease and quiet hours but it sounds like he didn't know or realize. You could have just told him the quiet hours/laundry times and directed him to the lease and asked him to please do laundry inside those hours because of the noise and such. Maybe don't go at him so hard.", "Soft YTA for how you went about it. I understand being woken up at 1am, but it's not something he's constantly done that you've spoken to him about. You said yourself that he looked young & I'm sure you scared him which is why he was saying so many things. Your wife is really sweet & I'm sure she handled it better than you did. Perhaps you could speak with him along with your wife so he's comfortable & you can discuss things in a helpful way that might ease things for everyone.", "YTA. The fact that you said he looked like a deer in the headlights says to me that you intimidated him. You should have read the situation better, he’s 18 and told you he’s autistic.  But given his initial response, you should have changed tactic.", "YTA you intimidated him. Guy didn't read the rules and needed to be told, yes, but ya could have been a little nicer about it.", "You politely accepted your feedback and agreed to restart neighborly relations with a gift basket. Yes, soft YTA, but definitely fixable and good on you for not being defensive!", "YTA\n\nIt's okay to be flustered about the noise, I hate it when things keep me up so I totally get it. But it sounds like you were unnecessarily confrontational about it. This could have been handled better if you had kindly explained that it keeps you up, the kid probably would have just apologized and never done it again, and everything would have been fine. Jumping down his throat over a mistake was not necessary.", "NTA.\n\nTake this from someone with special needs of.... varying severity, if he’s using it as a get out of jail free card and he does it too often then yes, I’d agree on them trying to stop you from blaming them, it’s not acceptable even if it is something that does need to be taken into account. You did the right thing in asking him not to and your wife is an amazing person, I’d suggest asking her to help you communicate with him.", "Sorry YTA - there's approaching with a level head and being a nice neighbour and there's going in all guns blazing. \n\nYou autistic neighbour sounds sweet", "Soft YTA you overreacted, but you did not know what was happening and you did not know about the kids mental issues. You were woken up in the middle of the night so being mad is understandable. As long as you apologize for your screaming and he does not do laundry in the middle of the night again, I think you are fine.", "[deleted]", "YTA. It sounds like the kid was apologizing profusely and instead of just saying \"now you know, everybody has to learn somehow\" you just kept complaining and berating him. It wasn't necessary at all. You called his apology \"excuses\" and then when he tried to explain as part of the apology that being autistic makes it tough for him to guess reactions, you continued to be harsh. He wasn't making excuses, he was trying to apologize and explain. You had every right to tell him about the quiet time hours but that could have been a simple statement, not a tirade.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA few days ago, some kid moved in to the vacant apartment on my floor. Right off the bat, our introduction wasn't on a great note. He somehow couldn't figure out how to get inside the building (you just use a key...) and I had to come out at 1 AM in the snow to help him. I let it slide since he looked about 18 and maybe hadn't lived in an apartment ever.\n\nFast forward to tonight, when he for some reason decided to do his laundry and drying at... 1 AM. For the record, my apartment is right above the washer and dryer in the basement. All 10 families in the complex get enough time to do the laundry, with leases saying you can only do it between 8 AM and 9 PM.\n\nAs you can expect, my apartment was shaking to the point it woke me up. I went down to the basement and saw him with a deer in the headlights look. I asked him why he was doing his laundry this late at night, well into quiet hours, and he didn't have anything to say. I told him he isn't any exception to the quiet hours rule, and he started firing one excuse after another, saying this was his first apartment, claiming he'd never felt the washing machine in his adjacent apartment, etc. I told him to stop with the excuses and take this as a lesson learned to not do laundry outside the hours outlined in the lease. He gave yet another excuse, saying that he's autistic and sometimes doesn't think things through the way a normal person would. He started stuttering out apologies and hoping I don't hate him (???). I just went upstairs and told him that if he ever needs to do laundry at night again, to take an Uber to a 24/7 laundromat.\n\nI went to the gas station to get soda, and when I got back in bed, my wife let me know she went down there and talked to him. Apparently he's afraid of men in general and was worried I'd call management and he'd end up homeless, and my wife had to reassure him nothing like that would happen. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA As somebody who's spent most my life living in big city apartments, I know how annoying one oblivious or egocentric late night noise maker can be. So not being super friendly after being woken up at 1:00 in the morning is normal.", "Hahahahaha....your fabulous ...I'm glad you hashed it out with him", "NTA this is the real World not some sn.owfla.ke  Reality.  We talk and solve the problems.", "YTA. \n\nI understand that you were woken up, but you live in apartment, and should expect some noises.\n\nPlus, this is a kid, as you observed from the very beginning with the key, clearly in his first apartment. Kindness would have worked. \n\nPeople with autism have a very hard time reading social cues, and for many, people not liking them is a big deal. They just want to fit in. \n\nMy nephew with autism is about to turn 18. People like you make me so worried for him. Kindness almost always works.", "YTA for confronting him the way you did. You sound like a boomer, and I'd have reacted the same way he did, and I'm not on that practicular Spectrum. You also say it like it's bad to be Autistic, which is not a good look on you.   \nI get it, it was 1 am, but if you have the presence of mind to go buy a soda, you could've had it to be civil about it. From the get go you sound awful, I hope your wife handles it from now on and your neighbor has as little interaction with you as possible for HIS sake.", "soft YTA, as an autistic person lol but i do get where you’re coming from!’ just be straight up with him", "Soft YTA\n\nYou acted nervously. You were sleeping, suddenly you're awaken by \"some jerk neighbor\" doing laundry at night. You went to the basement prepared to have a fight.\n\nSurprise, it's the new guy. He realizes he fucked up, but you're sleepy and mad, it's your nerves talking. He apologizes, tells you about his disease.. and here's where you're TA. By this time, you had the chance to unload those nerves. Now, pause! The guy is new! First apartment, maybe he didn't got a chance to read all the rules, he's autistic and didn't realize it's rude to wash at night! That's where you should have stopped, and politely say \"I understand. Please make sure next time you respect quiet hours, between X  and Y\".\n\nLucky your wife is awesome!", "Yta", "I think YTA on this one. who made you hall monitor, dude?? stay out of other peoples business.", "Yeah. I'll apologize the next time I see him.", "Yeah. I didn't even know the laundry door was open 24 hours.", "I don't think he was asking people to accommodate him. It was a simple mistake on his part. I'm not sure why people think he did it on purpose; I myself feel like an idiot for the way I acted.", "In all fairness, this is his first apartment. And it's a rather big achievement for somebody fresh out of high school to be able to get their own apartment here, let alone for an autistic person (that's not a mental illness, BTW). He clearly wasn't being malicious; I'll accept the judgment of YTA because of how I went about it. It's a stressful time for everybody I'm sure.", "Honestly, my wife said she would've gone down there anyway since it woke her up before I did. But she's practically a saint and also a special education teacher so she would've been much nicer about it. There's a lot of things I didn't know at his age, and I should've taken that into consideration.", "You're not wrong.", "What makes you think he's only claiming to be autistic? Just curious. My wife works with autistic kids and probably would've picked it up right away if he just lied on the spot about it.", "Yeah. I don't think he knew, either. The wife said he seems like a good kid with a decent head on his shoulders for his age. I think I'll get him a goodie basket of some sort and apologize for the way I came off.", "Yep. I was telling her I'd apologize the next time I see him and maybe give him a little goodie basket.", "Completely agree.", "Howwver true this is, you try to be nicer after being woken up at 1 xD at least I'm not sure I'd be able to", "Agreed. I've been doing construction for far too long and forget sometimes that you can't just talk to people that way. He seems like good people; I'll apologize when we see each other again.", "Wife said he seems like a good kid. I'm going to apologize the next time we cross paths.", "I do plan to apologize.", "I'm not asking if I'm TA for buying a 2 liter at midnight. I don't understand what that has to do with anything, or why you're so interested in if I drank root beer at midnight (I didn't). But for the record, I'm going to apologize when I see him again.", "Where at all did OP say he woke him up? Seems like OP got WOKEN up.", "If it matters at all, this is actually a blue collar suburb. Mostly just apartments, miles of houses, and a downtown about 2 square miles big. Fanciest thing we have is store that sells leather.", "I'm going to apologize to him when we run into each other again. I promise I'm not a jerk in general, or ever intend to come off as one. Unless the big Cheeto decides to make a campaign stop here; I'll happily be a jerk to him.", "Gen X, actually. I also never said it's bad to be autistic. I looked over my post 3 times and couldn't figure out where I may have unintentionally implied that. Before writing me off as an awful person who should stay away from others, please read my comments where I made it clear that I now understood I was in the wrong and intend to fix things and apologize.", "Autism is not a “disease”", "I heard you the other 5 or 6 times buddy.", "Like, *I* would have assumed if it's open, I can use it, and I'm neurotypical. And I can see how someone who hasn't lived in an apartment needs to get used to the requirements of respecting shared spaces.", "Either way you're NTA. Your response, although not friendly, was reasonable for the circumstances. You aren't responsible for someone overreacring to that", "This is a great answer. 👏👏", "I get it. Maybe it’s a thing regarding where we’re from. I don’t think anybody at any apartment building in my hometown would be even as nice as you were to be honest. You’re a better man than me, that’s for sure.", "100% YTA.I would report you for threatening me and harassment if I were him.", "Speaking as a 20 year old who was recently diagnosed: there's no immediate tells to whether someone is only \"claiming\" to be diagnosed. A lot of NT people say that people only claim to have autism and are just faking it. But in reality, there's plenty of autistic people who show symptoms that don't seem obvious at first. (The reason why I mentioned I was only recently diagnosed.)\n\nI'm not trying to excuse your neighbor's actions, as Autism isn't an excuse for bad behavior, but it's also dangerous thinking to imply that someone is faking their autism without hard evidence.", ">What makes you think he's only claiming to be autistic? Just curious. My wife works with autistic kids and probably would've picked it up right away if he just lied on the spot about it.\n\nI'm saying he told you he was autistic. Do you know for a fact he is? Nope.\n\nI could tell you I'm a cancer patient. Do you know for a fact that I am? Nope.\n\nYou don't know he's autistic. You only know he claimed to be. And no, your wife would not have picked up on it right away if he lied about it. Autism is not a trained dog that comes out and performs for everyone's convenience. Even a diagnosis by professionals is not determined in the space of one visit. If even the experts who diagnose do not know, your wife couldn't possibly.", "Sounds like a good plan, maybe take your wife along so he will not be as scared when opening the door?", "I think that's a good idea. I will say though that I've lived in apartments a good portion of my life and while this kid seems pretty innocent, it IS annoying as all Hell when people sign a lease they don't bother to read. OR sign a lease knowing they're not going to follow it.", "That's really sweet of you & a nice gesture to restart things! I really hope everything works out & you become great neighbors to each other.", "congrats on making a new enemy in your apartment building, dude. good luck", "[deleted]", "I just can't trust people who's first reaction is to attack and be rude, no matter the circumstances, so maybe I'm biased on that. \n\nI still stand on that YTA and maybe you shouldn't interact with your neighbour. But a goodie basket sounds good. Just... don't get near him. I have several Autistic friends and if he's like them it will take you ages to wash off the image he's gotten from you.   \n\n\nAlso, yeah... Gen X checks. All my encounters with your generation have been similar. It's like y'all have a radar for neurodivergent people and act so weird/rude around us. X'D Again, I might be biased, but damn...", "nah, dude. YTA and you are wrong", "I can see that. It's easy for us people who've lived in apartments for 100 years to forget that what's common sense to us might not be to young kids who've lived in houses their whole lives.", "Are you from New England as well? ;) I moved to Minnesota a few years ago and am loving it here.", "And where did I threaten him? You're being unhinged.", "I'd be furious if I was autistic and got accused of lying about it every time I made an honest mistake. It's sad how cynical this forum is towards marginalized people.", "Of course.", "I get it. But I can't see him doing this in a malicious manner. Not sure why the NTA judgements are implying he's stupid or something.", "You should read my update.", "Okay. I just wasn't sure what that had to do with the judgement at hand.", "... I didn't attack him. We actually just ran into each other and apologized. I was right that he's a good kid; he and I actually had a little chuckle over it. Also, please don't generalize me based on my generation. I'm not sure why you keep bringing that up.", "Nah what? I accepted my judgment. What's your problem?", "Chicago, so definitely no Minnesota levels of politeness over here, that’s for sure lol", "Oh, I don't think *he* did it maliciously, it sounds like an honest accident on his part. I was mentioning the larger issue of people who don't read/care about their leases. I don't think he falls into that category at all. Just probably overwhelmed.", "you DID attack him though. I feel so bad for this kid and that is why I keep commenting. what is wrong with you?", "Because it colours interactions more than people care to admit.  \nI'm glad he took it well.", "Oh please. You people are practically saints compared to us Upper East Siders. ;)", "You're being very weird at this point. Why did you post like 5 different judgements just on this thread, and when did I attack him?", "Why are you stalking this dude? The only ah on this thread is you :)", "I mean, I agree. Each generation has its own general culture and norms. I was a teenager in the 80s, and every single thing we said about the silent generation and vice versa is what Generation Z says towards my generation as well as Baby Boomers. But the point I'm trying to make is that we're not all bad.", "Why is it that those hailing from points north east so often think being meanly aggressive is a point of honor that gives them bragging rights", "We're just having banter. New Yorkers and New Englanders aren't mean or aggressive. If you visit, it's more that we're straight to the point. If I ask for directions in Minnesota, I'll get them, and end up in a 30 minute conversation about anything. If you ask for directions in Manhattan, you'll simply get told, \"Take the 4 and get off at Harlem 125th Street\" and nothing more. It's about cultural differences. I'd rather take that over the \"bless your heart\" thing that Redditors love yet seems unnecessarily passive aggressive to me. Again; cultural differences.", "I've been to NYC and Boston. Some of the nicest damn people you'll ever meet. And the ones that aren't are honest and straight forward about it. Much better than the fake \"hospitality\" they like to claim here in the south."]}