{"id": 33442, "submission_id": "18n34jj", "title": "AITA for getting my finances baby mom’s mother fired after she told me she hopes he chokes and dies?", "selftext": "UPDATE: I can obviously see both sides of this. I did not come on here to again defend my fiancé against people I don’t know nor know him. I wanted to know if I was an asshole for telling my management that another co worker just wished death upon my fiancé. I know for a fact that I didn’t say anything about her, her daughter or her grandson. She was saying things about my fiancé that I was highly uncomfortable with and then tried act like we could be friends. I told her your saying this about someone I care about, which she then said “ I hope he chokes and dies, THATS HOW MUCH I CARE ABOUT HIM” which was obviously her trying hurt me because I care about him. But her caring for him or not doesn’t matter to me, it became a problem the second she said she hopes he dies. Any sort of positive and or neutral relationship with her after this would be nearly impossible. I made the decision to report her knowing she would most likely get fired because I was uncomfortable and felt it would affect my job. And I shouldn’t have to feel uncomfortable going to work because someone told me my fiancé should die. I didn’t come in here to get opinions about the child support case, WHICH IS STILL PENDING AND GOING THROUGH COURT AS I TYPE THIS. \n~\nMy fiancé (25 m) and I (24 f) have been together for almost 3 years. I was very aware that he had a child with another woman and it’s not a problem for me. I have tried to form a relationship with the baby’s mother but she was bitter towards my fiancé. They are going through court proceedings for child support, so there was some tension. \n\nI recently had gotten a job at Amazon as a delivery driver. I had taken some time off for about 3 months due to being sick. When I returned, there had been a lot of new hires. One of the new hires was Amber. I, of course did not know who she was until she said this to me. At Amazon, there is a daily stand up meeting with all of the associates. At this meeting they give updates about our safety scores and delivery rates and such. On this particular day, I arrived early enough to where I had time to interact with some of my other co workers. A conversation started where we were talking about the military. Mind you, my fiancé is in the military, so when this topic was brought up, I felt like I could easily talk about it because I experienced first hand what it is like to be with someone in the military. Amber also felt the same way, stating that her ex husband was also in the military.\n\nOnce I began to speak, Amber interrupted me and said “I know your boyfriend, I know Tyler.” I immediately questioned how she thought she knew my fiancé. To which she then said “you know Madi?” ( his baby moms name) “I’m the woman who raised her.” I said something back to her which I don’t remember specifically what I said, but whatever what was said she ultimately responded “ I hope Tyler chokes and dies, that’s how much I don’t care about him.” Then proceeds to say it was nothing against me. \n\nI was obviously offended and upset by this. She tried to go into damage control and tell me we don’t have to let this affect our workplace and she didn’t want any tension between us. I immediately walked away. And after loading my delivery van I went straight to management and explained to them what she said to me. They assured me that they would talk to her and she would most likely would not be returning to work after that day. \n\nI called my fiancé because I was so upset . I began to cry because someone who I did not even know nor ever met just told me that my fiancé should die. Someone for whom I care very deeply about. Someone who I love. \n\nMy boss later reached out to me and told me she was terminated. So am I the asshole for getting my fiancés baby mom’s mother fired?", "created_utc": 1703100925, "permalink": "/r/AmItheAsshole/comments/18n34jj/aita_for_getting_my_finances_baby_moms_mother/", "score": 812, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I reported my finances baby moms mother for saying she hopes my finances dies which then got her fired.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: Why don’t you tell us what you said? I’m sure you remember", "Info - why is their split so contentious and what did YOU say to her?", "YTA for making this post and then constantly changing your story in the comments about how the conversation went and what you do and don't remember, but still refusing to tell us what you said. At this point, everything else is secondary: You cannot ask for judgement if you refuse to tell us the whole story, and insisting on it anyways makes you the auto-AH.", "Am I missing something here?  You were off the “recent” job at AMAZON for THREE MONTHS, managed to go back, and they fire AMBER for something said casually, first offense?\n\nOne side or the other, I call BS.", "ETA: YTA from ESH. You absolutely remember what you said to her to get her to make that comment, but you won’t tell us here because it makes you look better. I honestly doubt this story is even real.", "YTA. Based on the comments you’re kinda a trashy and your fiancé is a deadbeat who is refusing to pay child support. Nothing really complicated there, so the mother’s side of the family having animosity towards you and the deadbeat father is justified.\n\nI do appreciate your comments tho as they made it pretty obvious that you were intentionally leaving key parts out of the post and that you manipulated both the situation as well as the story to management. You’re not a good person, you’re not a decent human being, you’re not going to get affirmation here that you did the right thing, you did not. Take a long hard look in the mirror, your parents would be disappointed.", "I think Tyler is a worse person than you think he is.", "ESH  \nLove how you \"forgot\" what you said to even make her say that to begin with...then you edit to say you just told her \"you are saying this about someone I care about\"? Nah there was def more said on your end too. You remember word for word what she said, but keep changing the story about what you said shows me that you had just as much involvement in things escalating as she did.", "YTA. You remember exactly what she said to you, but do not remember what you said to her immediately preceeding this? Nope. I don't buy it. You were rude, or bitchy, or just insufferable then went literally crying and having a fit when someone said something not even directed at you. You know you said something about him being soooo great, and she responded appropriately.\n\nDon't drag your personal life into work. Y'all are so messy. (But also keep being messy because, even at my utter rock bottom, my life has never been this much of a shitshow and I love the stereotypical trailer park style antics)", "wow, you are very sensitive! You do realize that her saying she hopes he dies doesn't actually harm him, right? Also, if he is trying to weasel out of child support I kind of hope he chokes. Not to death, but enough to scare him. Deadbeat dads deserve to live in discomfort.", "YTA, for a few reasons.\nI read through your other comments, and you are telling a carefully curated story.\nYou are also bad mouthing their entire family, while dismissing real life needs to care for a child.\n\nThese people are suing your deadbeat BOYFRIEND, and you retaliated.\n\nThe military medical benefits are trash, and none of that is coming out of his pocket. He buys food and diapers, but that's pretty offensive and demeaning to the mother of the child.\n\nYou're young and seem really immature. \n\nThis isn't your husband, and you haven't even known him for three years. I guarantee you have ruined any chance of a healthy co-parent situation with them, as long as you're around.\n\nYour first inclination was to have her fired, and then call your boyfriend to do damage control on the fire you just started. You are now a danger to his court case.", "NTA.  Wishing death on a coworker's fiance AND SAYING IT OUT LOUD TO HER COWORKER is what got her fired, and rightfully so.", "I really would like a reply and explanation from you about my question about you changing your story about how the conversation actually went since you conveniently change it after being called out. So I’ll copy and post it directly to the post instead of relying to a comment of yours. \n\nThe way you told the story in the original post was implying that the conversation went something like this—\n\nYou’re talking to co workers about the military. Fiancés former mother in law over hears and agrees with your experience.\n\nThen ex MIL said I know your boyfriend\n\nYou ask how and she tells you. She’s the mom of fiancé ex wife.\n\nThen you reply something to her that you conveniently can’t remember causing her to for some reason say she hopes he dies?\n\nThis is exactly how you told us things happened. She didn’t say anything at all negative about him before you started “defending” him.\n\nWhatever you said after she said she raised the fiancés ex wife had to be SOMETHING that provoked that response from her.\n\nBUT NOW you’re changing the entire scenario and claiming that supposedly whatever you said to her was just you defending your fiancé from negative comments. You changed your story after people were asking you what you said and calling you out for conveniently “not remembering” or even paraphrasing.\n\nThat makes me believe you said something passive aggressive or offensive about her daughter which is what made her comment about your fiancé. I’m going to also assume you left whatever comment you made out of your story when going to management.\n\nUnless you clear up the actual details of exactly how the interaction went down and exactly what you said to her then I’m going to say YTA, because you’re purposely leaving out important details AND changing the story to make yourself look better. So that by itself makes YTA and makes me believe you’re not at all innocent in all of this.", "You remember pretty much every detail except what you said IMMEDIATELY before she said \"I hope Tyler chokes and dies\"\n\nHow convenient.\n\nAll your replies suggest your partner is a deadbeat making it seem like being in the military and paying child support is somehow a monumental task when most people would argue that would make it easier for him (steady income, good job security)", "Wait, wait. Let's look at this portion of your post:\n\n>They are going through court proceedings for child support, so there was some tension.\n\nIf your fiance is in the military and isn't paying child support then he is an AH. I might wish him ill as well. \n\nI'm leaning YTA too.", "So you pulled a huge crocodile tear tantrum because your deadbeat man is disliked by the grandmother of the child he's trying to dodge responsibility for?\n\nYTA, and it's gonna be ESH when you come back in a year crying about how badly he treats you.", "YTA. If you can’t understand why the grandmother of a child who has been deserted by the father would resent that man and why there is tension towards the deadbeat dad and why that resentment and tension might emerge in bitter and angry words towards someone defending him, then you and Tyler deserve each other. This whole situation is gross and you made it worse by getting her fired over it. I hope your fiancé gets taken to the cleaners in court and has to pay a lot of child support. \n\nAnd for your own sake, realize that someone who is a deadbeat to one ex will absolutely be the same with you if your relationship falls apart.", "I kind of doubt this story. I don't think Amazon would fire someone just for being an asshole. They're having trouble hiring because of poor working conditions and low pay.", "YTA. She said something mean about your man, once, so you run to HR and then she gets fired? Grow up.", "Wait and see - I bet you’ll be saying the same about him soon enough…", "ESH. \nShe was rude, but it’s awfully convenient that you’ve ‘forgotten’ what you said ‘defending’ your fiancé. Also, your fiancé sucks because, dance around it as you might, your comments make it clear he’s trying to weasel out of child support.", "YTA. Enjoy your crap marriage with your asshole loser fiancé", "[deleted]", "i was gonna say nta but after reading all your comments, yta and your bf too", "YTA and this story is missing key details. you are probably a bit of a slimy manipulator, is my guess.", ">I began to cry because someone who I did not even know nor ever met just told me that my fiancé should die.\n\nYou're 24 and crying over this? Yeesh", ">I began to cry because someone who I did not even know nor ever met just told me that my fiancé should die. Someone for whom I care very deeply about. Someone who I love.\n\nThat's a MASSIVE overreaction. But I don't see how your got her fired. She apparently violated some company policy or a harassment/hostile work environment rule.", "Girl, grow a spine.", "YTA big time. He's trying to dodge cs and the mother of his child's mother is supposed to think he's the greatest thing ever? You got with a deadbeat. Is it nice to say something like that? Absolutely not. Did he do something to warrant those feelings towards him? Probably. And getting her fired just makes you petty and immature as well.", "I don’t buy this. You conveniently forgot what you said to his baby mama‘s mother, but can remember word for word what she said to you? Lying by omission. In my experience military divorces are quick, easy, and expedited. Mine took six months. Unless someone is making it more difficult, the military gives dependents  a cost of living allowance that goes straight to them in the event of child support/alimony. Sounds like you’re part of the problem too.", "YTA What a big baby.", "Yta what a grass", "> I said something back to her which I don’t remember specifically what I said, but whatever what was said she ultimately responded “ I hope Tyler chokes and dies, that’s how much I don’t care about him.” Then proceeds to say it was nothing against me. \n\nIt's convenient that you don't remember what you said that triggered her to say this. It kinda comes across like you were being overly defensive about Tyler, to the point this lady had to say \"He can choke and die, I couldn't care less\". \n\nThen you go into melodramatic mode and run and tattle to management and call your fiancé to cry about it? Get a grip, ma'am. Like seriously. That whole paragraph makes you sound traumatized like you were the victim of a crime or something. Crying over someone's big mean words about someone you love. Someone you care deeply about. Like you need to justify running to management.  \n\nESH.", "I stopped reading at the title.\n\nWhat the hell does any of that even mean?", "YTA you got someone sacked because she doesn't like your fiance, quite probably for good reasons that you don't know.", "ESH - You all just sound super trashy and unpleasant.\n\nIronically you might have actually made your bf’s situation worse. If Amber was contributing anything toward supporting the baby, then presumably, that would have been taken into account in amount of support they’d be entitled to.", "i bet its not going to be too long till you realize why she said that about him. he cant mask forever", "Omg you’re going to have to get a tougher skin.", "Good lord, you sound so childish, YTA.", "YTA simply for only giving one side of the story", "YTA for the title alone, I thought I was having a stroke", "So his baby mom wants to set up court ordered child support and you think he will be bled dry?  It sounds like he is giving her the bare minimum and she wants the court to decide and have it in a legal contract and you are angry about that?", "They’re going through bitter court proceedings and you’re surprised by this sentiment? I mean she tried to at least preempt it with the idea that it shouldn’t affect your working relationship. I think going to HR over something so innocuous is incredibly soft if this is a true story. It’s not like he has a potentially terminal illness that he actually has a probable chance of dying. \n\nYTA", "I find it really interesting that you can't remember what you said to her. \n\nGoing with ESH, but I'm suspicious that it might be a Y T A one.", "ESH dollar to donuts you said something to get a reaction out of her, you defend a deadbeat dad, so you suck too, and you cried? Boo hoo", "ESH. No one rides harder for a dead beat than his new fiancé.", "YTA. What drama", "Of course you are the asshole, why wouldn’t you be? She doesn’t have to like you, your boyfriend, or anyone else on this planet. It’s time to grow up and realize you are not the main character in anyone else’s story! Hoping bad things happen to bad people isn’t a crime, hell it is barely a character flaw. Maybe HR needs to look into you and this supervisors relationship, see why he was so quick to aid this “damsel in distress” 10 bucks says if you aren’t fucking him he sure wishes you were.", "YTA. You clearly are dating someone who mistreated his babies mother and you have this delusion he is perfect. It's only a matter of time this guy treats you like shit.", "YTA. Your fiancé doesn’t sound like they have many redeeming qualities if you can’t remember what you said to defend them. So no, the lady was probably right to say what she said, she just shouldn’t have said it at work. And you cried over it??? Yeah, not very mature of you. if you can’t take what sounds like rightful criticism and dislike of someone close to you, get therapy. Like girl you signed up for this when you agreed to marry him?? You knew he was a deadbeat not paying child support, so why on earth are you shocked his BM’s family hates him?? You sound delusional.", "YTA", "Ohhhh YTA for sure, i guarantee there is so much more to this story.", "YTA. Don't want to get into details since I don't want to get banned. You know what you did and now looking for comfort with strangers.", "Conveniently neglects to mention what she said to Amber...", "YTA. You’re a tremendous asshole.", "3 sides to the story.. yours, hers and the truth", "Someone said they hoped he’d choke. Not that they would harm him in any way. Or you for that matter. And you said something you refuse to write. And Amazon fired someone over this ridiculousness. Sounds right.", "Yes, you are the asshole.\n\nwhatever happened to “sticks and stones may break my bones but, words will never hurt me”?\n\nyou’re certainly entitled to your feelings but, when you cause someone to lose employment because your precious feelings got bruised over her equally valid feelings; you’re an immature jerk. Grow up", "YTA - You’re purposely being vague about what you said in the interaction with Amber on purpose. You claim you didn’t say anything offensive yet provide no evidence that proves otherwise. \n\nThis is fake because what 24 year old dramatically cries like that.", "What a ration of horseshit", "YTA", "ESH so far. What exactly did you say? How can you possibly remember everything she said but not what you said? I’m thinking you just don’t want to say what you said because it would make YTA.", "YTA\n\nYou conveniently “don’t remember” what you said to her first. So for all we know you provoked it. \n\nOnce someone tells you that they’re the family of your fiancé’s baby mama that’s when you end the conversation. Stop trying to be friends with these people. \n\nIf you’re going to bang other people’s baby daddies you’re going to need a thicker skin. What are they supposed to be happy that their kid/grandkid has a broken family? What makes you the good guy to them? Just stop. \n\nWas the other woman careless? Yeah. That doesn’t make you not an ah.", "ESH\n\nYeah she really didn't have to say that and it was probably uncalled for. But your reaction to it is so out of proportion to what she said.\n\n>I hope he chokes and dies, THATS HOW MUCH I CARE ABOUT HIM” which was obviously her trying hurt me because I care about him.\n\nWas it obviously her trying to hurt you? Because that doesn't seem like what she was saying. It seems like what she was saying is there is some bad blood between your fiance and her and she does not care for him in the least.\n\nYou feel uncomfortable because somebody at work despises your fiance. Grow the f****** up already.", "Meh. I think you don’t fuck with someone’s livelihood if what they’re doing isn’t endangering you then or the business. \n\nShe was mean about your fiance. She knows things about him and a side of him you do not. \n\nYTA. \n\nYou don’t have to be friends or even friendly but don’t get people fired.", "YTA. She shouldn't have said that, but getting a woman fired over a single comment that hurt your feelings is pretty messed up. Unless you actually believed this woman meant to cause your fiance harm, (which seems pretty unlikely) this was a massive overreaction on your part.", "ESH.  A better response would be “STFU” or “mind your own business” and then move on with your day.", "YTA. You shouldn't have done anything.", "Haven't even read the post, but the title made me chuckle. Finance's baby mom? Accounting?", "You're lame!!", "wow, what a catch your fiancé is 🙄🙄", "YTA and ESH. Ur fiancé will probably do u the same way he’s done the other woman, and it’s funny u can’t recall what u said. Instead u, a grown woman, threw a crying tantrum to get someone fired because what? She said something that hurt your feelings? Won’t be the last time she says something to hurt your feelings. Your fiancé doesn’t need to see his kids considering your fighting his battles for child support, it’s embarrassing and weird.", "YTA. You don't remember what you told her, sure it is fair but you can't even recall the general conversation. Now that is weird.\n\nShe shouldn't have said that. Actually ESH but for playing with her livelihood yta.", "Holy crap, I didn't know Amazon was so strict and gives out punishments like that so quickly. Unless that wasn't her first offense, in which case good riddance", "YTA. Really? You had to get the woman fired? You couldn't just walk away and blow her off?", "YTA It sounds like this was a mom having an opinion about her daughter’s baby daddy.  She apparently doesn’t like him much probably because of how he treated her daughter. She is allowed to have an opinion about that.  There is a huge difference between wishing ill will on someone you dislike vs. threatening someone.  \n\nI don’t think she deserved to lose her job over this. Your issue with her being in the workplace might be understandable if you had to work closely with her in an office, but you are a delivery driver. My guess is you twisted what she said and exaggerated when speaking to her boss. What a nasty thing to do to someone.  Hopefully Karma will bite you in the butt.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy fiancé (25 m) and I (24 f) have been together for almost 3 years. I was very aware that he had a child with another woman and it’s not a problem for me. I have tried to form a relationship with the baby’s mother but she was bitter towards my fiancé. They are going through court proceedings for child support, so there was some tension. \n\nI recently had gotten a job at Amazon as a delivery driver. I had taken some time off for about 3 months due to being sick. When I returned, there had been a lot of new hires. One of the new hires was Amber. I, of course did not know who she was until she said this to me. At Amazon, there is a daily stand up meeting with all of the associates. At this meeting they give updates about our safety scores and delivery rates and such. On this particular day, I arrived early enough to where I had time to interact with some of my other co workers. A conversation started where we were talking about the military. Mind you, my fiancé is in the military, so when this topic was brought up, I felt like I could easily talk about it because I experienced first hand what it is like to be with someone in the military. Amber also felt the same way, stating that her ex husband was also in the military.\n\nOnce I began to speak, Amber interrupted me and said “I know your boyfriend, I know Tyler.” I immediately questioned how she thought she knew my fiancé. To which she then said “you know Madi?” ( his baby moms name) “I’m the woman who raised her.” I said something back to her which I don’t remember specifically what I said, but whatever what was said she ultimately responded “ I hope Tyler chokes and dies, that’s how much I don’t care about him.” Then proceeds to say it was nothing against me. \n\nI was obviously offended and upset by this. She tried to go into damage control and tell me we don’t have to let this affect our workplace and she didn’t want any tension between us. I immediately walked away. And after loading my delivery van I went straight to management and explained to them what she said to me. They assured me that they would talk to her and she would most likely would not be returning to work after that day. \n\nI called my fiancé because I was so upset . I began to cry because someone who I did not even know nor ever met just told me that my fiancé should die. Someone for whom I care very deeply about. Someone who I love. \n\nMy boss later reached out to me and told me she was terminated. So am I the asshole for getting my fiancés baby mom’s mother fired?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Yta for not asking more questions to find out what your future holds.", "Learn to spell “fiancé”.  Or did you purposely use “finances” because you planned on him being your sugar daddy?", "Just remember, if he treats one person like that, he will probably treat others the same way. There may come a time in your life when you understand their POV.", "Yes. It’s literally just words. Freedom of speech. Very, very childish. YTA.", "ESH it was an awful thing for her to say.  You likely said something pretty bad too that you “can’t remember “.  \nYou don’t know this woman, why do you care what she thinks of anything?", "ESH, 90% Amber, 10% you.   While tension and animosity in child support hearings is commonplace, Amber's comments to you about your fiance were mean and inappropriate in a work setting.   At the same time, Amber made a point of saying it wouldn't affect her work relationship with you.  I would have taken careful note of what she said and waited to see if indeed she could work with you without issue.   I think running straight to management was premature and a bit of an AH move.", "What I read from your comments is that you said your DH provides support and BM went to court to get support through the court and you and DH are pissed shes going through the court to get DH to provide support. You keep saying she’s money hungry - brought her family into it, buy you neve say how much or how little he actually gives her.", "Why would someone get a job where they have to work and be civil to the new girlfriend? Then blow up it up with death wishes!  Possibly so they can claim lack of a job is why it’s necessary for more income. as the whole thing seem off.", "NTA for what info is posted here but damn to have someone say “I hope he chokes and dies” that doesn’t come from no where good luck with that.", "I’m calling bullshit. Amazon wouldn’t fire someone over this.", "NTA. She brought personal drama into the workplace, that's on her. Her losing her job is on her, too. \n\n\nI'm not going to comment on the other stuff as we don't know the full story. Everyone saying you're an A H based on ongoing child support issues are delusional.", "NTA.  You didn't get her fired - if she'd have not said what she did she'd still be there.  She did it to herself.", "NTA - sorry this happened to you OP. What's the point of management if they don't take thing seriously? I'm glad they heard you and terminated her employment. It may raise some hairs in the future, but maybe she shouldn't open her mouth and say unwarranted stuff.", "NTA what a bxxxh.", "NTA\n\nShe can't say something that hateful, and then expect it to not cause workplace hostility. She did it to herself.", "NTA - you reported hostility in your workplace - someone wishing death upon your loved ones. That the person was subsequently fired for their ill manners isn't your fault.", "NTA.  Consequences of her own actions.", "What Amber said got her fired, not you.  It was a horrible thing to say, and grossly inappropriate in the workplace.  I'm glad management took it seriously.\n\nNTA", "NTA. That was a wholly work inappropriate thing to say, and HR agreed enough to terminate her. End of.", "NTA You can't say things like that to coworkers. The company protected itself from a hostile work environment lawsuit. They don't fit time for foolishness when half of America is waiting on last minute Christmas packages. 😂", "NTA. You didn't get her fired. She did all by herself. Making death threats is against policy at most employers.", "Nta. Regardless of what your fiance SHOULD be paying for child support beyond just \"he buys supplies\" (sorry but that's a red flag...it's not about money hungry. Baby mama has every right use money to buy the supplies herself that the baby needs when the baby needs them not be dependent on when he decides to do a supply drop of what he thinks she needs and approves of. Thats some control issue shit)\nBut even IF your fiance was a deadbeat fall down father, this woman had zero business bringing the issue into your workplace and creating a hostile toxic environment for you. Her words and demeanor were completely inappropriate and unprofessional. She should have just exercised some tact and kept her mouth shut. If she absolutely felt a need to address yiu at work about him the only acceptable response could possibly be \"I know him but I prefer to keep my private and personal lives separate.\"", "NTA   - that kind of comment is inappropriate regardless but especially in a workplace", "She wants to bring personal issues into the work place, she deserved it. No one needs toxic people around them at work, you spend so much time there.", "NTA. She got herself fired.", "NTA. It's not conducive to a good workplace environment", "NTA she should have never brought that hostile language into the workplace. Like all AH bosses say you are there to work not to fraternize.", "Nta at the end of the day the workplace fired her not you.", "Edited: after reading your comments and seeing some of the background, ESH (except maybe the ex and definitely the child). Yeah, she shouldn’t have wished him death, especially out loud at work, but avoiding child support is pretty gross and who knows what other dynamics were involved that you may or may not be aware of. You wrote this post and knowingly excluded information that would humanize her. Getting her fired right before the holidays is pretty terrible, you could have just ignored her. \n\nBefore, I thought you might not have been the asshole, but you supporting a man that won’t support his child makes you an asshole for sure.", "[deleted]", "NTA", "NTA. Amazon doesn't play about stuff like this. She said something really violent and hostile to you at work and made you concerned for your ability to work with her. She made an immature and unprofessional choice DURING A MEETING and it led to her losing her job. That was all her.", "NTA. There are some things that are just plain inappropriate to say to your coworkers. Wishing death upon their loved one is 100% at LEAST a write up, and is a valid fireable offense. It’s no different in cruelty than if someone said “I hope your mother/kids die” as wishing death to someone that a person cares about is vile and unacceptable.", "NTA. You didn't get her fired. She did that all by herself.", "NTA she’s plenty old enough to know her words have consequences", "NTA\n\nYou didn't get her fired, she got herself fired.", "In HR we have a saying, \"We don't terminate people, they terminate themselves.\"", "NTA\n\nI’m going to guess that what you said wasn’t that bad/negative if her comments were she hoped he died but claims you two could still be cool. Threatening someone’s loved one openly is a slippery slope to threatening staff and management, not just you, especially being so flippant about it. There’s no getting around those kinds of comments.", "Yikes!!  \nYou are NTA, don't doubt yourself. No decent human being says something like that nor should you have to deal with her on a daily basis.", "Nta shoulda knocked her teeth out", "NTA it’s hard to get fired at Amazon and I have a feeling this was likely not her first offense", "NTA - OP what this woman said to you was wrong and inappropriate in a workplace. The worst part is, because she is no longer employed, it will be harder for her with a child financially and may affect the amount of child support your fiancé has to pay. After a remark like that, your working relationship with her would've been strained at best, so it's not a bad thing that she is gone. The circumstances behind her anger are unclear, but hopefully she will be able to get past the hurt she obviously still feels and move on to a better place in her life.", "NTA. I can't think of a more textbook example of a hostile workplace environment.", "NTA. The rule of thumb in the workplace is remain professional at all times. She was being unprofessional and suffered the consequences.", "Nta she's the one who said it . You didn't get her fired her comment got  her fired . Who knows what uncensored outlandish venom she'd vomit out of her mouth onto someone else . The company made the decision to terminate her so I would have 0 guilt. It sucks to suck", "NTA - Telling a co-worker you've just met that you hope their fiancé dies clears the dismissal bar very comfortably", "She got herself fired. NTA", "NA she legit threatened ur husband ;/", "NTA - That's inappropriate workplace behavior, and she most likely was let go based on more than what you told her, since otherwise it would be a \"he-said/she-said\" situation.\n\nAlso, as a side note, your fiancé should be going for at least 50/50 custody (and remember, always ask for more than you're hoping for, 'cause judges like to \"split the difference\"). If he isn't loyal to his own child, he's not loyal to anyone else either.", "NTA\n\nNo matter her issues to openly say she wishes someone chokes and dies is just disgusting, and to say it to said person's fiancé is abhorrent.\n\nShe deserves to lose her job.", "She got herself fired. NTA", "NTA - death wishes are not cool in any situation. She deserved it. I hope she learned to keep her mouth shut in the future.", "NTA. You didn't get her fired, she got herself fired.", "Repeating:   YOU did not get her fired.  SHE got herself fired.  \n\nrepeat this to yourself a few times a day for about 2 weeks.", "She got herself fired. NTA", "NTA", "NTA wishing death on a coworker’s fiance the first time you met them in the first conversation you had with then is such an inappropriate thing to do and so stupid.", "NTA", "You didn't get her fired, her own words got her fired.\n\nEdited to add: NTA", "She got herself fired.\n\nIf I was a random coworker bystander to that conversation, I would have complained to management about how a coworker wished an aggressive death on another coworker's family member.\n\nDollars to donuts, someone else brought up concerns too.\n\nAbsolutely NTA.  You're just a normal person who was disturbed by Amber's behavior.  That's a good thing.  We should all be disturbed by that kind of action/verbal assault.", "NTA. It sure sounds threatening to me.", "It’s giving ‘starting shit but too scared to back it up’ and ‘I’m always the victim’. Not saying it is but the vibes are there.", "I don’t remember exactly what I said except that it was me defending my fiancé against some who only had negative this to say about him, which is when she said what she said.", "There split is contentious because the child support has been a battle. My fiancé is the military so things are much more complex when it comes to dependents. It hasn’t been easy. I defended my fiancé against all the negative things she was saying about him, which is when she said what she said. Regardless I have never met this lady and she began saying things to me that I couldn’t not stick up for my fiancé. Also, this family has a habit of saying things that are out of pocket or doing things out of getting revenge. His baby mom once sent someone to follow my fiancé and tried to confront him in McDonald’s parking lot with a baseball bat. I had only ever met his baby’s mom, so when her mother said this me, not only was I upset by it, I was worried how she will treat me or what she would do, regardless of the fact of her saying she didn’t want tension between us.", "Especially since now she is saying [30 other people witnessed it](https://www.reddit.com/r/AmItheAsshole/comments/18n34jj/comment/ke8t6ch/?context=3)....Yet...not a single person recalls what OP said? OP honestly trying to dodge the whole story so hard instead of being honest and upfront", "And casually or not, certain things should not be said out loud, let alone at work, while on the clock. There are conduct codes for a reason and she violated them.", "On paper it was her first offense. But they told me that she would say slightly inappropriate stuff all the time and that she was hotheaded. And she already knew who I was when I started working there again and I didn’t know who she was and when she had the chance she made herself known. I don’t know when she was hired but she already that reputation by the time I came back.", "Definitely real. I know for a fact that I never said anything on the level of which she did. I didn’t wish death upon anyone she cared about. There is reason she was fired. Also there are many witnesses that heard everything and she 100% in the wrong.", ">YTA. Based on the comments you’re kinda a trashy \n\nLOL kinda?", "Nope. There is reason she was fired and I wasn’t. My boss talked to both sides, me and her separately, and she had nothing to tell our boss on something that I said to her. But they did have my side and all 30 witnesses who heard it and confirmed she said this completely uncalled or and unprovoked thing to me. Some people will just say things out of pocket for no apparent reason.", "Exactly and in front of all our other co workers. If they let that slide, what else would they let slide?", "I personally can understand why you wouldn't want to hear OP brag about her fiance while the same person tries to screw over your grandchild and weasle himself out of child support. I also can understand wishing an AH like that, that tries to dodge all responsibility, to be dead. \n\nAt least ESH leaning more toward YTA", "Disagree. Until OP can tell us what she said in the lead up to this, I'm calling it an ESH because it's super convenient for OP that she is only telling one half of the conversation.\n\nETA: Especially because if you read her comments, apparently the conversation was much longer, but she still keeps leaving out whatever she said, except that she was 'defending' her fiance.", "That’s what we call “creating a hostile work environment.” Tsk tsk. Only Amazon is allowed to make its worker’s environment hostile.\n\n100% NTA. No notes.", "Op is just trashy and embarrassing. Probably thinks she can fix him and the BM is the only problem, no way her sweet fiancé is the issue.", "This post is about Amber telling me that my fiancé should die. Not about a child he’s trying to dodge. Telling someone who you don’t even know, that their fiancé should die, alone crosses a line. I am very well aware of how it looks from the outside. But I also I am engaged to him for a reason. If she wanted to say that, she could say it him or keep it to herself, but she told me, someone who isn’t involved in the case directly. And just expects me to be okay with it? I easily could have been fine working with her if I knew who she was, it became not okay, the second she said that me.", "I do understand it. I understand both sides. And I understand angry feelings and words are justified in this. BUT telling me AT WORK that my fiancé should DIE, IS WRONG and should most definitely not occur at work.", "The thing is, Amazon does have a cero violence in the workplace policy, if an employee is aggressive towards another one or even uses language that can be violent towards others, then usually it's bye bye.\nSpecially if the employee doesn't have tenure or was hired through a vendor. Which is usually the case for this position.", "I live in Canada and they take threats, swearing, and much more very seriously in the work place. Basically they don't want to be held accountable if something \"?bad\" later on happens.\n\nI've worked in factories where someone has said very colorful swear words and they were fired on the spot.\n\nMy last job had \"zero swearing tolerance\" - meaning you got caught swearing one time - you were terminated - doesn't matter if it wasn't directed at a person.", "Oh yes they would. amazon Has no issue with firing people. But they do let you come back after about 180 days, so she,k habe her job back", "Amazon fires you so quickly, lol", "My question is how does she remember every detail EXCEPT what she said ?", "I actually work at an Amazon warehouse, and new hires across the board start at 19 to 20 and hour, they have really good benefits and education bonuses. Amazon could do better, but they are not the evil entity they are made out to be. Ultimately, it's a warehouse job which sucks by nature, and there are a lot of safety rules, so many people don't want to stay long-term.", "Not to mention that management really isn't supposed to disclose that sort of info. \nLike ???", "They fired someone for the fact that she told me she hoped my fiancé would die. Thats harassment in their eyes which they have a zero tolerance policy for. And also the deliver drivers are hired through 3rd party companies called DSP’s (deliver service partner) so they get the say so in who they hire/fire.", "If she was volatile with the manager and got all up in the manager's face about it then yes, she would likely have been fired.", "Zero tolerance. If she had said she didn't like him or he wasn't a good man, it still wouldn't have been appropriate at a meeting, but it wouldn't have risen to the level of violent rhetoric. OP's fiance can suck and the mother still has to work within the rules of her workplace. None of this was necessary. The mother initiated the while situation.", "It's a threat she made. About nothingness donwith work", "He's 100% trying to weasel out of child support! \n\"Buying food for her\" and getting government healthcare is what OP considers to be plenty.\nWanting money for rent, gas, clothes, makes her a gold digger....", "Right?! Like how are you with someone for that long and never met his child’s mother before?", "Seems like a huge over reaction. It’s not like the lady threatened to murder him or anything.", "Whoa careful, OP might go to hr about you", "She was already upset the second I started to speak about him. It’s been a couple weeks since this has happened so I don’t remember the whole conversation. But it was probably me defending my fiancé against someone who only had negative things to say about him. But whatever I said, didn’t justify her saying that to me imo.", "Crying over the fact that her deadbeat fiance was called out for being a deadbeat fiance", "Seriously crying over this? I've had people wish death directly to my face and I just laughed and told them to go choke on a d*ck.", "OP's manager fired the wrong person.", "LMFAOOOOO", "Lets clear things up OP's fiance is a deadbeat trying to dodge paying support. OP is marrying an idiot as he is in the army and this will not end well. OP knows what her fiance is doing and is fine with it. \n\nOP overreacted heavily", "Probably wasn't the first time she's said something questionable", "It means she lives for drama", "She said *he’s a liar, he hasn’t told you the whole story, and he’s manipulating you*\n\nYou should have listened to her side of the story.  Your mother will probably be saying something similar in 5 years time.", "Oh so many", "How is that better? This way maybe she'll think twice before acting unprofessionally in the work place.", "Talk about Freudian slip.  I know a lot of military folks like OPs fiancé do bankroll their spouses, so it did make me wonder for a bit.\n\n“I’m the woman who raised her.” I said something back to her which I don’t remember specifically what I said, but whatever what was said she ultimately responded “ I hope Tyler chokes and dies, that’s how much I don’t care about him.”\n\nI really also want to know what comment OP made that she can’t remember that made Amber, her stepkid’s bio grandma, say she hoped her fiancé would choke and die he was so insignificant.\n\nI’m wondering if OP has made sure he’s actually keeping up with his child support and visitation obligations.  Don’t want to be marrying a deadbeat dad.\n\nOh, hey, bingo.  Amber also told OP “he’s a liar, he hasn’t told you the whole story, and he’s manipulating you” but OP didn’t want to verify anything.", "But I feel like randomly making that comment is a big sign she couldn’t work with her", "To me, her saying that to me ruined all possibilities of me being able to work with her. I felt it would make me uncomfortable to go to work. And I’m okay with a little bit of uncomfortableness but when comes to family and people I care about I won’t just wait around and see if i can work with her. My loyalty to my family comes first.", "BS...it will affect it. It does affect it. If it doens't affect anything why does it need to be said?\n\nWhat if she told the co-worker she hoped her husband died, is that ok? \"Sorry I hope this doesn't affect our working relationship\".", "This is horrible advice, at the very least OP was right to create a paper trail. The lady messed around and found out, can’t just say whatever you want without consequence.", "Not an AH move on the OP’s part at all. You can’t work with someone that hostile safely and the company needs to know because she is putting employee safety and security at work at risk. The woman got herself fired and OP is definitely NTA.", "Lolol. What she did is not. \n\nAmber should have kept her opinions and information to herself. She's lucky OP didnt go ahead and press charges or make Amber's life any harder than Amber already did herself.\n\nWhat Amber did was create a hostile work environment and she deserved termination.", "I think your mis understanding who she got fired. She got Baby Mama's (god i need a life typing this out) mother fired not baby mom.", "Well she didn’t know I worked there because I had taken a leave of absence due to an illness I was getting treated for. I came back and it was like the first day back she said this to me.", "I mean it comes from the fact that OPs fiance is deadbeat who isnt paying support and is hurting her grandchild. \n\nI can see the anger from grandma OP is also clearly leaving out what she said and isnt telling us the whole story.", "Yes like OP and her deadbeat fiance who is dodging child support", "Exactly!! Why would she want is to be cool and have there be no tension if I said something like that to her?", "Not her husband. BF of 3 years.", "You mean the conversation with the ominously missing sentece on OPs side that was said before the death wish while OP claims it was a normal converdation with nothing bad about her fiance until that point? The comversation with the grandmother of OP's fiance's child that he is tryibg to avoud paying child support for?", "Thank you! I appreciate the people seeing this post for what it actually is. Not giving me their opinion on my fiancé.", "INFO: What did Amber say that you had to defend you fiancé because from your story it sounds like all she said was she’s Madi’s mom and then you… started defending him?", "The way you've presented it, she said she was Madi's mom, you said \"something\" and then she said her nasty comment. If all she'd said was that she was Madi's mom, how do you get to 'she only had negative things to say about him'? You're leaving out a huge chunk of the conversation.", "Ahh but...[30 people overheard it](https://www.reddit.com/r/AmItheAsshole/comments/18n34jj/comment/ke8t6ch/?context=3), and not one of them remember what you said either? Mhm sure", "Try harder. You appear to be covering up your own bad behavior. You should at minimum be able to paraphrase some of what you said.", "So I was a military wife. If your fiance is telling you he’s not paying child support because it’s really complicated when you’re in the military, he is straight up lying to you. One thing the military does not tolerate is members not paying their bills and child support. They will garnish your wages faster than you can say tiddlywinks. \n\nEven if it were true that it’s complicated to add the child as a dependent (it’s not) then why can’t he just write her a check every month? He has a child who needs food, shelter, clothing etc. Why do you want to marry a guy who doesn’t take care of his child? \n\nYour behavior: It sounds like you said something very inflammatory when your coworker said she knows your fiance. That is the only way she would have responded with hoping he dies. But you conveniently can’t remember what you said?? BS. Are you 4? You went crying to your employer because someone said words to you after you likely started it? That woman has just cause to hate your fiance. Her daughter and grandchild are getting screwed over by him. \n\nI predict that once you have a kid and he bails on you that you will have a lot more sympathy for his ex. YTA for your behavior and for making excuses for a dad to not support his kid.", "The way you told the story in the original post was implying that the conversation went something like this—\n\nYou’re talking to co workers about the military. Fiancés former mother in law over hears and agrees with your experience. \n\nThen ex MIL said I know your boyfriend\n\nYou ask how and she tells you. She’s the mom of fiancé ex wife. \n\nThen you reply something to her that you conveniently can’t remember causing her to for some reason say she hopes he dies? \n\nThis is exactly how you told us things happened. She didn’t say anything at all negative about him before you started “defending” him. \n\nWhatever you said after she said she raised the fiancés ex wife had to be SOMETHING that provoked that response from her. \n\nBUT NOW you’re changing the entire scenario and claiming that supposedly whatever you said to her was just you defending your fiancé from negative comments. You changed your story after people were asking you what you said and calling you out for conveniently “not remembering” or even paraphrasing.\n\nThat makes me believe you said something passive aggressive or offensive about her daughter which is what made her comment about your fiancé. I’m going to also assume you left whatever comment you made out of your story when going to management. \n\nUnless you clear up the actual details of exactly how the interaction went down and exactly what you said to her then I’m going to say YTA, because you’re purposely leaving out important details AND changing the story to make yourself look better. So that by itself makes YTA and makes me believe you’re not at all innocent in all of this.", ">My fiancé is the military so things are much more complex when it comes to dependents.\n\nNo it's not. \n\nSource: My parents got divorced while my dad was in the military. Even before there was a formal child support order, he was able to take a portion of his salary each month and send it to my mom for costs for my brother and me. Sure, they hadn't gone through the court to calculate what the legal minimum should be based on their incomes and the time split, but nothing prevents a service member from paying the other parent of their child money for that child.", "No, child support is no different. I know because my father had to do it. Just saying.\n\nAlso- ESH", "> My fiancé is the military so things are much more complex when it comes to dependents.\n\nBull-honkey. He could be paying regardless. He chooses not to.", "Uh no.  My dad was in the military and had no problem whatsoever paying child support.  That’s a horrible excuse.  There’s something else there.", "lmao so your fiance is a deadbeat dad?\n\nsounds like you participated equally in this argument and are equally to blame. what she said is obviously an exaggeration, it's not a real death threat. you cried over this and got her fired? you are a jerk who manipulated the situation to ruin someone's livelihood. YTA", "Sorry no. My dad was in the military and he NEVER missed a payment to my mom, and usually had more money than us. He’d send way more than obliged in order to make sure I had a good life, because HE ACKNOWLEDGED THE ROLE HE HAD IN MAKING ME. It takes two to tango. \n\nYour fiancé is a deadbeat, and you are the delusional new wife about to find out the hard way. Have fun!!!! I bet you’ll be divorced in less than 5 years.", "If this is true, and you’re an unreliable narrator so I doubt that, I’d be looking over my shoulder if I were you. You inserted yourself into a volatile situation (with attempts at violence) that had nothing to do with you. Then you got the mom fired for no reason, imo. IMO you’re clearly TAH. Not something I’d do if people were attempting to harm my “finance” for being a dead beat loser father. 👏 👏 👏. You’re clearly a smart girl.", "[deleted]", "That’s nothing compared to the military’s code of conduct your fiancé is violating by not paying for his kid…", "I hope she reads this and sues them for HR discussing her with an employee", "You know for a fact you never said anything on that level but you cannot provide one snippet of what you said. Interesting. You know exactly what you said and you don’t want to repeat it here. She shouldn’t have said what she said but I don’t for one second believe you didn’t provoke her.", "“Never said anything on the level she said”\n\nSure Jan. Why don’t you give us an example so we can decide for ourselves. Also, Just because you didn’t wish death on her daughter doesn’t make it okay. I’m almost positive you said something insulting about her daughter which is why you won’t tell us.", "Doesn't have to be something you said, although it's unlikely you didn't say anything that would make ger responde in this way. You are defending a deadbeat who tries to not having to spend a dime on the child he helped creating, a child that is the grandchild of the woman you just got fired.\n\nI wonder how peoole like you can look in the mirror.", "So you don't remember what you said, but you know that it wasn't to the level of what she said... You do realize that this just reads like a stinking pile of BS, right?", "Well, I didn’t have any evidence of cheating at time of my comment so I couldn’t say she was totally trashy, just kinda :)", "Again and you keep forgetting what you said to her so either you now it was wrong and are lying to us or it was nothing serious which i doubt. \n\nYour commetns about the baby mama being greedy are just trash your fiance knows he does not provide enough thats why he is angry about the baby mama going to court. The fact that you dont know what he actually provides aside from medical says alot about you.", "Yea, cause you didn't tell your bosses the truth of the entire thing. And if there was 30 witnesses, how is it you STILL don't know exactly what you said? Lmao! So all 30 people, and not a single one knows what you said? Riiiiight", "You are with a deadbeat dad what does that say about you\n\nEDIT: \n\nMaybe read the comments where OPs fiance isnt currently paying support and also angry that the Baby mama went to court to get it court ordered.", "YTA.  How old is your fiancé 's baby mother?  Why are your fiancé and she  in court for child support? \n\n The woman was honest, and spoke her mind, she didn't attack you, and her verbal attack was towards her daughter's ex.", "We don’t know if OP was bragging, just that they were talking about experiences with having someone in the military. \n\nNot to mention there’s a million other ways to communicate in a civil manner. “I have a bad history with Tyler due to him having been with my daughter. Do you mind if we change the subject?” \n\nOr you know, just say nothing.", "What colud OP have said that justifies a death wush?\n\nIt couldn't be about the fiances ex or why would she say she doesn't care about fiance except he should die.\n\nEDIT\n\nI read OPs comments. Guy is a fucking deadbeat trying to weasle himself out of chilt support and being angry at his ex for wanting the things he promises to be a court order so he will have to pay and can't just choose not to when he feels like it. OP defends a guy trying to screw over his own child. \n\nYTA. Getting the grandma fired is only the tip of the asshole-iceberg here", "Wtf could she have possibly said to make this woman say she wishes her fiance was dead? This is still not something you say at your workplace.", "It doesn't matter. They were at work and the woman interrupted her and started talking about personal matters, ending in voicing a wish for violence and death. There is nothing OP could have said that made that appropriate.", "I actually laid out exactly what happened. Go read my other comments.", "Keeping her mouth closed completely would have been free and allowed her to keep her job. If you don't like someone why on earth would you approach their fiancee and start a conversation? Just keep stop talking and keep walking.", "Well, mgmt only fired one of them, so what she said couldn't have been that drastic.", "Bullshit. There is nothing that OP said that would justify her coworker saying “I hope Tyler chokes and dies.” OP didn’t know this woman and yet *coworker went out of her way* to speak to OP, reveal her identity and relation to the BF, and then verbalize a death wish.\n\nShe went out of her way to harass OP and she got canned for hostile work environment. Clear cut.", "That’s not what hostile work environment means.", "You are being very disingenuous.  You're acting like some woman walked up to you for no reason and said \"I hope your fiance dies.\"  Instead, you brought this man up to a woman who has very good reason to despise him, and then acted shocked that she told you how she felt.", ">Not about a child he’s trying to dodge. \n\nSO you know he is doing this on purpose wow no wonder your with him. \n\n> I am very well aware of how it looks from the outside. But I also I am engaged to him for a reason. \n\nThat you are supporting a deadbeat and happy to be married to one. Birds of a feather flock together i guess.", "It seems weird that you can't see the connection.\n\nIf your grandchilds baby-daddy would try to wease his way out of chilt support by not wanting it court ordered so noone can make him pay you'd probably want them not so alive as well. Dead he'd be less trouble with all the benefits because he's an obvious deadbeat, he won't be around if he's alive, but dead he at least can't fight the child being supported he took part in creating.\n\nYou should ask yourself why you are ok with marrying a deadbeat that does everything to avoid supporting his own child. You shoukd also think about your own future because even if you shouldn not plan to have children an accident still could happen and then you'd walknin the same shoes as his ex. And planning a child with a deadbeat would actually really be a dumb idea because ge obviously tries to avoid any responsibility at all costs.\n\nYTA. Be better and overthing marrying this guy.", "You say you she doesn’t know you but you’re making comments claiming to know all about her relationships, family, behavior etc.  I thought y’all didn’t know one another. You’re naive…….and gross", "You realize if your husband died, his child would financially benefit because he's dodging support.... Dodging support is so god damn disgusting. Your husband is not supporting a child he helped create.\n\nThe woman knows your husband will *never* help the child. Clearly this is evident by the *years* of dodging supporting the child, as you laid out... LOL. If that's the case, then it is *possible that the child would be better off having the person dead*. \n\nYou see how fucked up this is? All of this is on your husband and you don't even care remotely. I imagine you relish the drama based on the sympathy tears. You actually see the innocent child getting penalized for this and you support it... You contribute to the lack of support for the innocent child actively. \n\nNone of this actually is about your coworker. Just some words; nothing more. \n\nSo you believe that your husband dodging being a father and supporting his child is *way better* than your coworker saying your husband should die?\n\nYea you and your husband are made for eachother....", "You are totally wrong, this whole post is about your fiancé who is a deadbeat dad. So not only has he been denying financial support to his child for years, you've now made it worse before the festive season by getting Granny sacked. Well aren't you lovely? /s I'm going YTA here as you're evasive, defensive and won't admit what you said. She has every right to be pissed at your fiancé & to be fair you're ridiculous for defending his behaviour at all. She reacted to what you said, and you need to admit & own it. Doesn't mean she was right in her words but your actions speak volumes.\n\nEdited: you are involved, you chose to insert yourself into the situation when you accepted that ring. Don't condone his behaviour, make him see a better way to be.", "How would your dad and mom feel if you had a child and the father refused to pay child support so you and your child lived in poverty? Amber is defending her child and grandchild. You think it’s ok to defend your fiance so it seems it should be even more okay for Amber to defend her daughter and grandchild. \n\nTake a breath and really listen to what people are telling you. He is lying to you about it being hard to pay child support in the military. You said in several comments that he provides health care for the child. The military already sees the child as a dependent. This also means your man is getting paid more money because he has a dependent. He is making money off his kid but not paying support. There is nothing good enough about him to offset this gross behavior.", "With how you're reacting to this situation I would recommend breaking off the engagement because you have absolutely no business being married to somebody in the military. Guess what you need to be able to be successful in a marriage like that, thick skin. And your skin is about as thick as wet tissue paper", ">I do understand it.\n\nYou clearly dont because you keep saying she is greedy and trying to bleed him dry in all your comments. \n\nYou seriously ahve  mental issues given that you have no family and only a deadbeat fiance to turn to get help", "Maybe you shouldn’t have gotten into it with her at work, then. Why did you need to defend your fiancé, anyway? Why exactly do you care about what a stranger, someone you just met, says? And care SO MUCH that you absolutely HAVE to defend him at work? \n\nIf you understand her feelings then you shouldn’t have said anything and separated yourself from the situation instead of “defending” your fiancé. Because at the end of the day, you defending him doesn’t mean a darn thing. It won’t change her mind about him, it won’t convince any bystanders that your deadbeat fiancé is a standup guy. It just makes you look like a drama queen. \n\nBasically, it takes two to tango. She said something she shouldn’t have, but no doubt you did too. Next time keep it professional at work and save the defense for the courtroom. \n\nAlso you didn’t do yourself any favors. Now your coworkers know you’ll run to HR at anything they may say to you, and your boss knows you like to stir drama at work.", "Considering you only care about your feelings and not anyone else’s, I don’t think you really care about the other side. The damage has already been done. \n\nNo offense.", "This is especially true this time of year. This is their busy season and bring in a ton of temps to help handle the influx in volume. I had worked for Amazon as a temp during this time and they had brought in something like 900 temps, including myself. They had a zero bullshit policy back then as well and would let people go for talking shit on others, coming back from lunch a minute late, bathroom breaks outside of break time, you get the idea. Since Amazon may hire, at most, the best 10% of these people there are a lot of people who they can afford to let go, plus there is still a long list of people with the temp agencies ready to fill those spots.", "Was it violent though? It wasn't threatening to kill him, it was saying you wouldn't be upset if he met a gruesome end, and in response to something OP said but \"can't recall\".", "Where the fuck are you working that doesn’t let you vent with a couple f bombs here and there. I’m in the GTA btw but even my office jobs let me swear as long as it wasn’t in front of clients", "This was not a threat.", "Then they need to go learn the definition of harassment because that’s not it.", "I’m not defending anyone in this, but did she say she didn’t know her bf’s kid’s mom? Don’t think it’s that weird she wouldn’t know the mom’s mom.", "It happens. I’ve been with my husband almost 12 years. He has never met my kid’s dad. They have no interest in meeting each other.", "I can't get over OP...\"oh I was in tears\" because someone said something mean about my man. Grow up! If someone told me they hoped my husband choked, I might be pissed, but I cannot imagine turning on the waterworks. And if the person who expressed that was the grandmother of my husband's baby and he was dicking the mom around over child support? I'd accept her opinion as justified. Not that I'd be with an AH like that in the first place.", ">But it was probably me defending my fiancé against someone who only had negative things to say about him. But whatever I said, didn’t justify her saying that to me imo.\n\nIt probably does because he is a deadbeat and you are marrying him. I cant wait till he does that to you and then your back here crying about it", "Women like OP are the worst. They'll defend their boyfriends to the death and pass off any criticism as \"baby mama drama\"", "I'd be crying too if I had a deadbeat dad fiance. OP thinks she's 'won', but really Amber comes out the winner.", "Cried about the fact someone wished he would die to my face.", "I'm afraid such assaults on ducks and other members of the Anatidae, including geese and swans, cannot be countenanced by late-stage capitalism and are firing offences, possibly even hanging offenses if too many members of the jury have feathers or webbed feet.", "Considering she keeps saying she's never met her before, hardly likely.", "It wasn't random though. They were having a conversation about the fiance and how he sucks.", ">My loyalty to my family comes first.\n\nYour fiance is a deadbeat and your supporting that. \n\nYTA truly and you are lying about this interaction.", "He’s not your family. His child is his family (and he’s being a deadbeat towards his own child). What makes you think as his “finance” you mean anything? Get pregnant and see what he does. WAKE UP!", "Your family is his kid and baby momma and grandma. Do you not realize that? Separated or not, everyone is family here", "you better hope you are using some damn good protection or you are going to be this guys next baby momma that he doesn't support your child.", "You’re a delivery driver. Exactly how much would you be working with her? You’re mad that the baby mama is asking for more child support then went and took away a source of income from someone who was likely providing said support to the kid. Don’t be surprised if this move is used against him in the court proceedings. You’re an asshole and you’re not very bright either.", "When you choose a deadbeat dad as a partner, you have to expect some blowback from the people affected by his actions 🤷‍♀️", "Press charges? On what grounds??? You can't possibly think that that constitutes a threat, can you?", "Me too!", "In another comment you said she knew you worked there before you even came back.  Get your story straight honey.", "Are you sure? Drama queens can plot stuff like getting a job at your workplace. Just because you’re not working doesn’t mean someone else didn’t tel her about where you work! You are really nice to defend the ex when she proved herself in the wrong by even having a conversation about him!", "You’re replying to a lot of people who agree with you but are blatantly ignoring my post asking you why you changed your story about how the conversation actually went. \n\nHer- You say the conversation was like “ I know your boyfriend”\n\nYou - “How”\n\nHer- You know Maddie? I raised her”\n\nYou- “ you conveniently don’t remember” \n\nHer- “I hope he chokes and dies”\n\n\nThen people was asking what you said and the only answer you will give is that you was defending your fiancé from mean and negative comments. \n\nHowever according to your original story of events, the mom said NOTHING negative about him until AFTER whatever you said to her after she told you who she was.", "People can only judge about what you said and the NTA people are in the minoriry because they A didn't read your comments that add more contect to the supposed uncalled for reaction of your fiances basically ex-MIL an B they don't find it suspicious neither you nor any if the other 20 coworkers supposedly can't even remember remotely what you said towards her while you can still remember her exact words.\n\nTell us, what did you say to her? Doesn't have to be word by word, but you must remember what it was about that you said.", "Look, you came to a judgement sub with a story full of holes, people are going to pick it apart because that's the whole point of the sub. Congrats, the system works. Don't bitch about the judgement when it's entirely based on information YOU provided.", "> I appreciate the people seeing this post for what it actually is. \n\nA pathetic attempt to feel better about the drama you’ve started and are clearly dodging any semblance of responsibility for? \n\nBecause these replies read like the most desperate high school drama farming I’ve seen in years and I teach at an after school theater program.", "Yeah because I didn’t say anything except she was saying these things about someone I care about. Another reason why she was fired and I wasn’t.", "Im not covering up my own behavior. I had never met this lady and she immediately started attacking my fiancé when I started to talk about my experience about being with someone in the military. She had her own feelings about him and thought it was appropriate to tell me she hopes he dies.", "Why would she ask to be cool and say there doesn’t have to be tension if I said something even close to the level to which she took it? The things she was saying to me was before she made that comment was along the lines of he’s a liar, he hasn’t told you the whole story, and he’s manipulating you. And then saying it was nothing against me. “I’m sorry? Nothing against me? This is someone I care about that your saying things about and I’ve never even met you” to when she then said “ well I hope he chokes and dies, that’s how much I care about him”", "Couldn't BM call deadbeat's CO and tell them what he's pulling? Could make life ***awful*** difficult for him. And likely would.", "Truth.  Not hard to add baby to DEERS and get everything set up.  If he is on the birth certificate and has a copy, it's just a matter of doing it.", "I cried privately talking to my fiancé. But told dispatch exactly what she said to me in private and in a professional manner.", "He provides free healthcare and also offered to let the baby mom come up with an amount of money per month she would like to help provide for the baby. She refuses to let him pay without a court order because she wants more, which is her own words.", "True. And I know that. But that’s not my responsibility. Nor the topic of this post.", "\" I can't remember what I said but I remember what I didn't say.\"😂", "Because I don’t tell people there family should die. Regardless of how I might feel about someone. I wonder how she could look in the mirror.", "God her comments just ooze trashy", "How did you make that conclusion", "And baby is 3 years old.", "How do you get that he's a deadbeat? They're going through court to get child support sorted. Baby momma is bitter about him and probably wanted more than he can afford. Maybe he was paying and baby momma decided it wasn't enough and wants to bleed him dry.", "WTF?", "Not appropriate in a place of business. Like at all. That’s considered harassment and a hostile work environment. They are there to work not gossip.", "OP said the talk was normal and supposedly about the military, tgen she learnt about the relationship of the woman she got fired with her partner, then OP said something she can't conveniently remember and so can none of her coworkets according zo her, and then the grandma of the baby her fiance is trying to nit pay child support for used the common hyperbole thst he can choke and die fir all she cares.\n\nInterestingly enough OP supposedly didn't know the woman but somehow knows for sure she \"bled her ex dry\" and, according to OP, teaches her daughter, the ex of OP's fiance, to \"bleed him dry\" by going to court for the money he legally owes to his own child.\nOP also thinks her fiance does enough with occassionally paying for food and the military paying foe his insurance and his child being legally a dependant and by that \"providing free health care\"\n\nWe know a lot about OP to know she's an unhealthy person clinging to a deadbeat because she can't have kids and defends his awful behaviour and feels butthurt about others not accepting his awful behaviour all because she has attachment issues.", "Agreed with your edit. I'll also add that there probably are a lot of horrible things someone could say that would make someone else say the stuff Amber said. They're all very extreme, and if I gave some examples, I would get rightfully called out for speculating, so I won't. But I will say that coming to a forum like AITA and conveniently not including your half of the conversation, so that if it you did say something super extreme, the audience doesn't know it, is an asshole thing to do.", "She specifically ended the ‘wish’ with ‘thats how much i dont care about him’. Which sort of indicates (esp given it was apparently a longer conversation) that it was less of an actual ‘wish’ and more of a way to try and get op to stop having a go at her and, i assume, insisting she or her daughter is obsessed with him, or something along those lines.", "I can speculate about quite a few things that would make someone say that, but at this point it's all speculation. Because OP is not telling us the full story. And coming to a forum like this and intentionally withholding really relevant information is an asshole move.", "I’m going to go out on a limb and guess it was something negative about the baby mama.", "My husband is the strongest of chewers he is unchokeable!", "My guess is that Mama expected styler to marry baby mama and the fury arose from being face to face with the reason that would not happen.", "I have said before that I don’t want to speculate on what OP actually said, since I can’t be accurate, but there are a lot of things that someone could say that would make a reasonable person voice that response, and we’ve got no damn clue if that’s the case because OP refuses to include her side of the conversation.", "I did read your comments. That's how I came to this conclusion. Because in your post you say she introduced herself to you (no negative comments mentioned), you said 'something,' and then she said she hoped he choked. Now, in the comments, you keep saying that you don't remember what you said before she said she hoped he choked, just that you were defending him. So either she introduced herself and you started getting snarky 'defending' him, or the conversation went on a lot longer than you indicated, but you are not giving us the whole story.", "“fiancés baby mom’s mother”\n\nIm not going to lie…Am I the only one  lost on the actual relationship here?", "Companies aren’t really supposed to release employments records like that. Most they can say is “she no longer works here” and you get to assume. So she could have walked off. She could have still been on probationary period. OP could have lied to management about what OP said like she’s doing now. We don’t really know.", "It is a violent comment. If you fail to see why it is not appropriate in a work environment, that's on you.\nAnd HR it's gonna remove the person that creates the  hostile environment and  add other human resources jargon... \nThat's how it goes...", "You're telling me if someone walked up to you and said they wish your parent/s were dead you'd be totally fine with it?", "Yeah we can swear but I think my boss would also draw a line at 'I hope your fiance chokes and dies' (not a threat but definitely getting into harassment/toxic workplace vibes)", "Factories in Canada. Swearing in most workplaces is considered \"hostile\" or \"creating a hostile\" work environment. Swearing is not a necessity nor something anyone \"has\" to do.", "I never said this was", "Especially not towards OP who clearly made shit up to get her fired.", "Yes it is.", "yes it is. & you need to read the rules.", "She says she “didnt know who she was until she said this to me”. I think it’s weird to be with a guy for three years and not have any idea who the mother was despite also saying she tried to have a relationship with her? If the dude was involved in his kid’s life she would have met the mom some time over the course of three years. And does he just not know where the mother of his child works? I see tons of missing reasons in this story.", "How are you 24 and behave like this like seriously\n\nEdit: meant OP not you :) But seriously though", "Until two years later when they're the next baby mama in line and suddenly they're stuck with a baby and a deadbeat dad.", "Serious and straight up question. What the hell did you say about her daughter? Just because you didn’t wish death on her doesn’t change anything at all to me or other people wondering. Quit trying to justify it and focus on the mom. At this point this\nIs the question you need to answer if you want an actual judgement \n\nI think you are over the moon about getting her fired. I don’t think you’re actually scared or anything like that but it was a GREAT excuse for you to get her fired and there for hurt your fiancés ex wife in the process\n\nThen you were so proud of your little scheme and had to brag about it on Reddit. You couldn’t just outright brag though so you had to phrase it as a question and pretend like you feel bad and don’t know if you’re right. You thought a lot of people was gonna be like “YOU GO GIRL!”  “Omg, you poor thing! How terrible! You did the right thing and she got what she deserved”!\n\nAnd there are some comments like that but you weren’t expecting people to ask about what you actually said and you wasn’t expecting anyone to pay attention enough to call you out on your shit.", "Because he is a deadbeat dad and you are supporting him \n\nYou are 24 with the maturity of a 16 year old. The fact that you are fine with him dodging his support payments shows your character as well. \n\nGiven that you are lying alot its clear you lied about this interaction to management and caused her to get fired.", "Grow up you’re 24", "Grow tf up you’re literally being over bs drama that you participated in.", "You mean the grandmother of the child he is a shitty dad to? Yeah I'm on grandma's side. Get your tears ready because I hope he dies too.", "To a different employee not OP", "Yeah okay. It’s not up to you to decide who’s family or not.", "There not married, never have been", "God i hope so I do not want that kid to suffer because OP just had to have a baby", "In Canada you would be surprised what people can be charged with.", "Seriously, this behavior is so transparent and embarrassing", "oh now it's 20? It was 30 earlier xD", "I don't believe for a millisecond that she was fired over this", "Sure, you remembered every exact word she said but have no clue what your own mouth said?", ">Im not covering up my own behavior.\n\n>I had never met this lady and she immediately started attacking my fiancé when I started to talk about my experience about being with someone in the military. She had her own feelings about him and thought it was appropriate to tell me she hopes he dies.\n\nImmediately covers up own behavior. What did you say?", "LOL you’re probably not covering up your own bad behavior but the behavior of your (what sounds like) dead beat fiancé. \n\n“I hope he chokes and dies.” Doesn’t come out of nowhere. \n\nWhy is child support so contentions? Is it contentious because he’s trying to get out of paying for his child with the “complications of dependents in the military?” And using the military and legal red tape to delay establishing custody or the support amount?\n\nOut of curiosity, how old is the child?", "He’s clearly not paying child support you no zero about what happened in the relationship and you have left the mother of his child with no job , you suck", "You still won't account for YOUR behavior. What did you say to her?", "You're engaged to a man yet you've never met his daughter's family, not even in passing? Wow.", "That makes absolutely no sense and doesn’t at all line up with your original story", "Tbh he is most likely a liar, and she was trying to look out for your dumb little self. LOL imagine being willing to go to the mat for a deadbeat liar.", "Also way to dodge my question about what you said. You’re pretty good doing that.", ">he’s a liar, he hasn’t told you the whole story, and he’s manipulating you.\n\nShe's the mother of his ex. She likely believes all this to be true. There's even a decent chance of it literally being true. She was unprofessional to bring this up at work and you are naive as hell.", "lol…he is a liar and he is manipulating you.", "An awful lot of replies are asking what you said, so if you have suddenly recalled, maybe it should be added to the OP?", "What did you say to Amber?", "Did you tell them exactly what YOU said to HER first? Or was you being just as shady with management as you are here?", "So what? You manipulated the situation and were oversensitive for a fight YOU participated in. You are a hypocrite and a snake.", "In the military, he would be getting a stipend for having a dependent, which should be going to the dependent. He likely doesn't pay for the healthcare. The military does. I don't blame her for wanting it to be court ordered versus verbal. Court ordered he will be held accountable if/when he chooses to be non-compliant.", "He doesn’t provide free healthcare. The military does because his child is his dependent. He also gets paid extra because of his dependent.", "Uh, no. The *military* provides free healthcare. He does not.      \n\nIf the court decides he's not paying enough, then he's not paying enough. She doesn't get to decide how much child support is, that's up to the judge. Does his CO know what's going on with this child support dispute? They don't look kindly on their service members not fulfilling their obligations to their children.", ">She refuses to let him pay without a court order because she wants more, which is her own words.\n\nThis makes no sense. Why would she refuse money without a court order? It won't impact the court results, and means going without any support now. \nAlso, if you've been with him for 3 years how old is this kid? Has he just not been paying anything for 3+ years? Why'd she wait so long to take him to court? \nHonestly I can see why the grandma was so mad.", "Does he ever see his child? Does he want to see his child?", "*He* is not providing healthcare. The military is. She is correct in that the child support should be ordered through the court, as that provides protection against the amount being changed according to his whims and accountability should he refuse to pay.", "Wait, I thought you said he was a good man paying for his kid that just didn’t want to be bled dry? Now you say you know he’s not paying for his kid and it isn’t your responsibility? Which is it? Why are you insisting on marrying and defending a deadbeat? Like, he sucks hard and I wouldn’t care if he choked and died either. Grandma’s not wrong.", "At least you acknowledge he’s a deadbeat dad. \n\nThere’s hope you might one day lose the rose tinted glasses. \nHow old is the kid? As in how many years has he been fighting supporting the child he fathered?", "So tell us what you did say since you know what you didn't", "No instead you defend a man who won't spend a dime to keep his child from starving.  How can you look in a mirror?", "Your husband should die she was right. That's how she looks in the mirror.", "No, instead you defend a man and even construct lies about the conversation you had with his ex's mum to make him seem at least a bit less of a deadbeat AH although you know very well he is trying everything to get out of doing the bare minimum he is legally supposed to do", "OP would have to come out from underneath the Dollar General dumpster where she lives to achieve trashy. If anyone deserves to pee in a bottle for Amazon, it's her.", "Well you see, they made it the fuck up and came to a conclusion based on his own story they made up in their head.", "From her comments where she says that her fiance is dodging paying support for his kid.", ">This post is about Amber telling me that my fiancé should die. Not about a child he’s trying to dodge.\n\nFrom one of OPs comments thats where im basing that off of.\n\nYou wouldnt use that phrase if you knew what the fiance was doing.\n\nAlso the support the BM wants is court order as currently its not and could change on a whim which doesnt protect their child. The support given now is probably less than what he is supposed to be giving.", "Damn…. Talk about things missing in the OP lol And this is why AITA is such great fodder for drama shows.", "From the way OP painted the conversation originally it would have to be something horrible to let Amber go from 0 to 100 like that in like 3 sentences of talking and then OP really wouldn't have beeded to make the post not knowing what she did to deserve that anser. So of course leaving out the thing she herself said was suspicious and in AH tertetory but still the reaction would be very krass.\n\nBut the Update of OP now even changing her story for damage reduction after admitting in the comments her partner is a deadbeat she clings to out of attatchment issues. Just wow. How can people like that live with thenselves?", "I agree. It’s not a death threat/wish. It’s really just saying that’s how little she cares about him. If my SO’s ex’s mom said that to me, I’d just brush it off and think she was crazy.", "OP is saying this repeatedly, even after posters point out that many other people heard the exchange, but she's willing to trash the baby mama loads. I think the best she could get if she was honest would be an ESH verdict.", "From the sounds of it, she just had a negative view of OPs husband and voiced it. It doesn't seem like she said something negative about OPs husband in retaliation. Otherwise OP would have been in as much trouble.", "LOL from her most recent comments Baby Mama is just greedy and learned it from her mom.", "You know what happens when you assume?", "Go read the update", "She’s the grandmother of bf’s child", "OP has a fiancé, the fiancé has a baby with his ex girlfriend, the woman who got fired is the ex girlfriend’s mother.", ">OP could have lied to management about what OP said like she’s doing now. \n\nPure conjecture on your part. We don't know anything, so your assumption she lied is projection. Physician, heal thyself first.", "And it's a huge display of bad judgment for a person who is being entrusted with delivery items and access to secure apartment buildings, etc. Far safer for Amazon to cut bait, liability-wise.", "I'm saying that if someone said to me \"I couldn't care less if your dad fell off a cliff\", I wouldn't assume that was them threatening to kill him.", "Unless they have a knife in their hand then no I genuinely don’t care what some random person says.", "Meanwhile in Ireland it's perfectly normal for people to swear. Obviously you don't take it too far, dont swear *at* a boss/colleague or in front of a client but swearing as part of normal conversation? It's a part of communication for us. \nPolicing the language of adults outside any form of hate speech/harassment is frankly ludicrous.", "k have fun with the mods mate, & read the rules if your going to blatantly lie & try to smear someone.", "What rules? I don’t work at Amazon", "Pretty sure the coworker was the mother of the bf’s child’s mom. So the kid’s grandma. Going by title and the line about raising Madi “his baby mom’s name”", "Go read my other comments. Also they weren’t ever married. Quit making assumptions.", "Had to scroll too far down to finally see someone take OP to task. You're crying hard over some harsh words regarding somebody else? What a fragile flower. When you're abandoned Baby Mama #2 (or whatever # it is already with this guy) then you'll have something to cry about!", "That’s rich coming from you. You’re not married to him anymore than his ex was. How old is his child that he abandoned? \n\nIf this is real, I hope grandma files for wrongful termination and shares all this with his ex’s lawyers.", "If only there was a book with explanations of what words mean. We could look up \"family\" and all see that you're wrong.", "And? They have a kid together 😂", "This is you trying to shut down the question lol. You’re so obviously shady and a major AH. \n\nSince you refuse to tell us I’m going to assume the absolute worst and think you said something horrible about her daughter. You didn’t wish death so you think that justifies whatever you said. It doesn’t. So I’m thinking you said the nastiest meanest things to her and will continue to believe that unless you explain it. \n\nBe very careful about the lies your going to tell next though. You’re writing these lies online which makes it really easy to call out your inconsistencies. \n\nSo you might want to write down on a piece of paper the next lie you think of that way you don’t accidentally expose yourself again.", "They’re* ffs this comment history is fucking embarrassing…", "YTA - First of all, it’s they’re not there. Secondly, you’re not married to him either and there’s no guarantee that you will be. \n\nAs a 46 year old BM (hate calling myself that), the best thing you can do is stay in your own lane. Your deadbeat fiancé has a relationship with this family whether you like it or not. You aren’t his wife, you aren’t a mother, and you work at an Amazon warehouse for god’s sake. It doesn’t take a huge amount of talent to get a job there. Get off your judgmental high horse and stay out of it. Your fiancé should pay child support. His BM has every right to look out for her child’s financial best interest. A court ordered judgment is usually the best way to do that because it’s enforceable. And she’s not trying to “bleed him dry”. Stop that BS mindset. The courts literally put both people’s salaries in a computer called dissomaster and it computes the amount. At least that’s my experience in CA, not sure what they do in other states.\n\nRather than focus on what’s going on between them, start focusing on adjusting your own shitty attitude towards this situation. Especially since you plan to be a stepmother to this child.", "Neither are you and him. Never have been", "So are you. That means your fiance isn't family?", "If she was, then OP lied.", "I love this comment. Honestly. I want to use this phrase myself so bad but I know I'll probably forget when the time comes😂", "And, 30 other people witnessed it and confirmed to OPs boss, but yet can't tell OP what she said! Don't forget that\n\n[Source](https://www.reddit.com/r/AmItheAsshole/comments/18n34jj/comment/ke8t6ch/?context=3)", "It's giving \"missing\" missing reasons", "Not the mother of his child. The grandmother. Amber is the baby mother’s mom.", "I think the person who lost their job was the mother of the mother of the child.", "It explains why she said what she said. This lady is immature and has an immature mentality and was only saying this to cause harm. Not because I said anything to justify her saying that to me. I understand why she would have angry feelings towards my fiancé but saying it to me is where she crossed the line.", "I did", "Wouldn’t be a stretch if she was the reason they broke up and she’s now a single mother with a deadbeat not paying his child support dues.", "The military will also hold him accountable which is why he probably doesn’t want support to be court ordered. If it’s not court ordered, he can be a deadbeat without getting in trouble.", "OP litterally can't keep a single story straight, keeps contradicting herself with all her lies  \n\n\nAnd I agree, he's being worse then a deadbeat, I wouldn't care if he did either", ">Wait, I thought you said he was a good man paying for his kid that just didn’t want to be bled dry? Now you say you know he’s not paying for his kid and it isn’t your responsibility? Which is it?\n\nShe couldnt take people rightly pointing out her fiance is a deadbeat so now she's trying to use the old \"thats not the question of the post\" answers some of these people keep saying", "😀👍", "Can you not read?  ‘they are going through court proceedings for child support’ \n\nHow is that dodging?", "He’s not dodging supporting the child. He’s trying to dodge being bled dry. He provides what she asks for, now she wants more plus everything he’s already providing. For what? So she has money for herself? To buy purses and get her hair done? The baby is provided for, and that is his only responsibility.", "I dunno, I think OP said something but it just wasn’t quite so blunt or not work appropriate which is how they got away with it.", "All the adults in this situation are just sad and trashy tbh.", "I get an erection.", "yeah your update isnt anything special your fiance is a deadbeat and your are in dire need of therapy given your attachment issues", "So fiancés, Ex’s, mother? \n\nWow.  No way I would’ve.gotten that from the heading and that wall o text is a cluster to read on mobile.", "\"I couldn't care less\" is not the same as \"I wish\"", "It's creating a hostile work environment", "Saying \"I couldn't care less if your dad falls off a cliff\" is very different to saying \"I hope your dad falls off a cliff\". Even if you can't pick the distinction, other people definitely will.", "Except she didn’t say “I couldn’t care less if…” she said “I hope Tyler chokes and dies…”", "Its in the comments but go a head mate :)", "he means the subs rules.", "Omg are you serious!!!??? I have read your other comments and you aren’t telling anyone anything you said. You genuinely are trying your best but it’s not working. \n\nYou change stories and refuse to answer a simple question\n\n“They weren’t married” oh no I made a mistake but I’m not gonna let you try to use that to weasel your way out of your lies.", "We've read all of your comments.\nYour boyfriend is a deadbeat, and you talked trash about someone's daughter to their face at their workplace.\nYou can't seem to see beyond your own narcissism and greed.\n\n\"Bleed him dry.\" 🤣😂🤣 You have no clue how expensive it is to be a single parent, and you just made the financial situation even worse.", "I’m grabbing popcorn and strapping in, OP is hilariously delusional and fishing for victim bait. Gets greasy and defensive the second her unclear comment is questioned, but all buddy-buddy with every single remotely supportive reply. So transparently bullshit. 😂", "Never forget, don't be like OP!", "Oh but still I bet she’s put in more hours with his child then himself", "No it doesn’t explain my question at all. You basically just admitted to me that you’re lying now and changing things. The fact you didn’t even deny it or try to explain to me the inconsistencies shows me you’re lying.", ">This lady is immature and has an immature mentality and was only saying this to cause harm\n\nAnd not paying support for his kid wont cause damage for his kid? \n\nYou are 24 and acting like a toddler grow the fuck up and realize your marrying a failure", "I’m sorry OP but based off all your comments, it sounds like you’re being lied to by your fiance. I truly believe that you believe him and what grandma said hurt you and you wanted to defend him but you were an asshole, deliberately or not.\nEdit to add: there’s tons of parents who give child support outside of court orders and usually when they do go to court it’s because one wants to low ball or not pay the other", "You calling someone else immature - laughable", "What did you say to her, before she said he isn't telling you the whole story & you are being manipulated??\n\nWhat did you say that brought on this conversation?", "Oh sweetie, calling the baby’s grandmother immature in this situation is ironic since you’re the one being immature. \n\nLife is tough, and tattling because someone voiced their opinion on your deadbeat fiancé based on their direct experience with him is ridiculous. From your post, comments, and update, I don’t see anywhere that you told her that you won’t stand for that type of comment. You know, how an adult would have acted. \n\nA mature person wouldn’t run to their boss with their tail between their legs, they would’ve provided the other party with a boundary in that very moment. If she chose to disrespect that boundary moving forward? Absolutely go to your boss, you would then be justified. Knowingly intending to get someone fired for their 100% justified feelings toward your deadbeat fiancé - who is currently hurting TWO PEOPLE that she loves - is a total asshole move. \n\nYTA, hands down.", "I don’t know, based solely on what you’ve said about your fiance, it sounds like she’s right about him. He does sound like a liar who’s withheld information from you and not told you the full story. \nShe’s known him a lot longer than you and had a lot more experience with his “deadbeat dad” side. \n\nDoes he even see his kid?", "Oh there is somebody in this Dynamic who is immature but I guarantee you it's not Amber.", "That's almost certainly exactly the situation. Still hashing things out in court, but your already planning on marrying this man OP? \n\nINFO: how long have you known your fiance and when did they break up?", ">This post is about Amber telling me that my fiancé should die. Not about a child he’s trying to dodge. \n\nFrom Ops comment where she literally says he's trying to dodge having court order payments. \n\nCan you read?", "He's angry she took it to court so he can't dodge because he only wanted to make verbal promises he won't be held accountable for", "What exactly does he provide?", "The universe is going to have some laughs when you're the one having to beg to have a minimum of support for the next child he abandons.", "If he would be paying so much then he would actually want to go to court because child support is based on both parents earnings so he'd be protected from overoaying and could use extra money to build a trust for the baby for college or ehatever if he cares more than the bare court ordered minimum but doesn't want to raise it.\n\nIf he has to pay soo much child support, then he left someone he got pregnant while knowing she can't afford the baby alone and now wants to avoid paying his share because he knows it's bigger than what he is paying right now", "Well if he goes to court, they will issue an order for proper child support. It is based on his earnings and hers. He wouldn't be dodging it if he was paying what she is owed\n\nThe mother is an asshole for what she said, but it sounds like a lot of asshole in this situation too", "LOL none of which court ordered and can change on a whim whenever OPs fiance feels like it. Dodging the court to not have a court ordered child support plan is wrong. \n\nYour making alot of assumptions that the BM is after money when you dont know that. What if his current payments are not actually what is legally required of him, but according to you he is being 'bled dry\".", "How much does he provide *financially* for this child each month?", "She wants what she is owed. The court has a formula.", "He should get custody. That mother is going to deprive that baby of what it needs because she wants a purse and her nails done.", "I mean, if she did say something it was obviously not bad enough to be reprimanded for. That doesn't warrant telling someone you don't care if their loved one dies.", "So damn trashy. Except Baby Momma, I got no opinion on her, I'm not going to take OP's word on what Baby Momma is like since OP seems to be pretty biased.\n\nTrashy AF", "oh 100 percent", "NOICE! \n\nGrowing a little pine? Maybe oak?", "🤣💀 Stop it 😂😂😂", "I'm paraphrasing to over the part where she says \"that's how much I care about him\".", "That's not the definition of hostile work environment.", "Yeah the rule is don’t comment that something is made up.", "Yes, I’ve read them. What’s his point? I have not violated any rule", "The worse part, she is now saying 30ish people also overheard it, but yet still can't provide what she herself said....lol!", "Baby momma is bitter that he didn’t stay with her after getting her pregnant. \n\nMy finance signed the birth certificate and put baby on free military healthcare. \n\nMy fiancé provided more support by providing mother with supplies and food. \n\nBaby mom wanted more. Decides to go to court. \n\nMy fiancé fights support since he’s already supporting her in many other ways. Which they are still going to court for, it is not finalized. \n\nBaby mom’s family are money hungry and do in fact want to bleed him dry. This is what the mother of baby mom did to her ex husband. So she is basically coaching her daughter on how to bleed another man dry. \n\nBaby mom’s mother is bitter and angry and tries to tell me things about him even though I’ve never met her before. And then says it’s not against me and she wants there to be no tension. To which I said “ you are saying this about some I care about and I don’t even know you” to which she responds “ well I hope he chokes and dies, that’s how much I care about him” \n\nShe is the type of person that see men as money bags and can’t control her mouth because she is immature and likes to get revenge.", "Don't forget, grandmother is now unemployed, so no help coming from her.", "Looking forward to the reveal that OPs fiancé got his ex pregnant while she was in school or that now Christmas is gonna be awkward with grandma there lmao", "Off topic, how do I quote like how you just did? I’m new to Reddit lol", "Wonder what his CO would say if BM called and told them he's ducking child support? They'd make his life hell.", "That’s not the point of this post.", "If you read that comment, you must have read the one OP was responding to. She was using the phrase \"a child he’s trying to dodge\" because those were the exact words in the comment she was answering. \n\nOP hasn't said anything that implies her partner isn't stepping up for the baby.", "Yes thanks, I’ve just not seen that comment.", "The only one who isnt an asshole is the ex who didnt actually doing anything other than go to court for court ordered child support \n\nI feel like people are missing that", "That’s literally what I said lmao", "Balsa all day", "That's pretty ironic.", "not making stuff up when its in the comments and OP can't remember what she said in the confrontation.", "I know you havent hes been saying the same to me just wanted to let you know thats what he meant by rules i guess :/", "Vague assertions about food and supplies aren’t the same as child support. Bills need to be paid. If his child is living there then utilities and other costs ARE his responsibility even he is not. \nAnd him putting the kid on his health insurance really isn’t some huge sacrifice on his part, the court would have made him do that anyway.", "OMG it is going to be hilarious in a few years when he's moved on to the next woman and you're the one getting treated like this, and called names because, what a shock, a few bags of groceries isn't actually enough child support.\n\nSad for the child, obviously, but hilarious vis-a-vis you.", "“Baby momma is bitter that he didn’t stay with her after getting her pregnant.”\n\nGirl, reread this sentence 20 times and then reread it again. He got her pregnant then peaced out. Take off the rose colored glasses. \n\nHope you don’t get pregnant with this man because if he could walk away from a child once, then he will most definitely do it again. You’re blind to what’s happening. Keep defending this amazing man tho! He sounds awesome!! He sounds even better when you omit 90% of the story too!!", "Why are you acting like him putting His legal dependent on Tricare is some act of good faith when it's legally required of him. It's literally a nothing action.", "Child support is MONEY, not other things. Money to help put a roof over their head. And all the other expenses a child entails.", "In other words he's a deadbeat. Believe me, if he really thought he's adequately providing in other ways, then he could just pay child support and stop those other ways because surely that would more than cover it. Wonder why he doesn't want to, hmm...? Also military health care is that kid's right, not a favour he should be praised for.\n\nHe's going to lose, by the way. I guarantee you that. His income is known to the government and a formula will be applied, the money will be taken out at source. All he can do is stall and make things difficult for everyone. Once it gets finalised, the payments will be backdated and his pay docked. There's no dodging support when you're enlisted. The courts don't give a crap that he bought pampers. His sperm, his kid, his responsibility. \n\nI'm sorry you're buying his BS. Chances are, one day the greedy ex baby mama he's complaining about will be you.", "Alright im calling this as incel women be greedy posts. \n\nGoing to court for a proper child support payment system is not being greedy its doing things by the book. Its protecting her kid from any random changes that your fiance decides when it comes to the \"support\" you say he provides. \n\nAnd the BM isnt greedy she is probably entitled to more or maybe less and going to court sets that. THe fact that you cant understand that and are actively supporting your fiance's idiocy says alot about your intelligence.", "If the court orders support, he then stops buying the supplies he's currently buying. It sounds like he's not an active participant in this baby's life, just do court ordered support and be done with it. Then he (and by default you) don't have to deal with her regarding money. The healthcare is a non issue since he doesn't pay a dime to actually have it.", "You do realize that he made a child that he's responsible for just because the military pays for healthcare and what not and he provides \"food and supplies\" not sure what that means he is still responsible for the co care of the child he made. Fyi in most states the courts side with the mother and they will garnish his military pay.\n\nYTA, I feel like you aren't filling people in and deflecting from the reasoning as to why her mother reacted that way. You have only clearly heard one side of the story HIS. Do better OP.", "What about rent and utilities? Either she has to stay home with the baby or she has to pay childcare. Babies aren't just 'supplies' in costs.\n\nIt feels like you goaded her into a reaction because you didn't want all your coworkers knowing you are marrying a deadbeat", "You are obviously young and naive……you obviously have no clue how military life works and how a good amount of military guys work. While baby mama drama may not always be a red flag in the civilian world……in the military world, it’s a giant red neon sign. He got a local girl knocked up and is trying to get away with as little responsibility as possible. You will learn the hard way. I’ve heard this story hundreds of times due to my being a military wife for the 12 years my husband was active duty and still hear it 9 years after that living in a military town. I got lucky, somehow, I don’t think you’ll be.", "You know that isn’t how court works out child support, right? Or do you just believe everything he says? The custodial parent doesn’t get to choose what they get each month. The court decides based on a formula. \n\n& were you the reason for their split?", "Girl, you need help. \nYOU are the one who got revenge. \nProviding supplies doesn't pay the bills. That isn't child support.\nHe should be paying at least $1,000/month if he's military, and his CO will make sure he pays for that child.\n\nYou act like signing the birth certificate was a favor to the mom. \n\nThe military will support the mother of the child, and your behavior will have legal ramifications.", "I've heard that rant before, but it has always been out of some bitter deadbeat father pissed he actually has to pay  child support while doing next to nothing to actually raise his child. I've got to say hearing it verbatim out of a woman is a new one, that's some next level pick me shit. You know all those beliefs about women you're parroting of his? Keep in mind he 100% talks about you the same way, and he will screw you the same way if he gets you pregnant.", "Women like you crack me up. This man left a woman when she was PREGNANT with HIS CHILD and rather then realize what a huge asshole he is for doing that, you accuse her of being bitter.\n\nPlease come back and make an update post when you’re pregnant and he leaves you 😘", "It's not like he has to do anything for child suppirt. What a suprise, hus legal child is a legal dependant of his health insurance, oh wow, the child is now a fependant of tricare, applause to your fiance for leaving a girl he got pregnant and at least signing the birth certificate without having to be court irdered a paternity test, what a great guy you got yourself there! \n\nWanna bet he's gonna leave you as soon as he gets pregnant and tries to pretend legal health care dependancy and a bag if groceries is the same as child support and will tell an other woman his sob story of \"ex wants to bleed me dry with child suppirt\" although child support is paying the 50% expenses you'd pay for a child if you actually took care of it without the work of taking care of a child.", "I feel like you Yardi yadid over a lot of context in that story.", "*g i r l*", "Pick me alert!", "I just read her update in the body post, she’s desperate to be the victim here, absolutely missing the point and dismissing whatever she said as Reddit making her “defend her fiancé.” \n\nWhat a piece of work.", "When you open the reply box there is a menu on the bottom to change the text. \n\nClick on the three dots and you will see more options click on the quotation symbol.", "It might depend on what device you're using read it on because for me there's no dots but the comment or post I am replying to kind of appears as a little snippet at the top I just click it and it brings up the whole post and I can highlight what I want to quote and then it'll just give me the option to quote. But even if that doesn't work all you have to do is put\n(>) without the parentheses in front of whatever you want to quote\n\n> like this", "Your fiancé is 100% a deadbeat dad.", "The clearly hyperbolic statement \"I hope he chokes and dies\" is much more understandable with the context that she is talking about a bum who doesn't want to pay for his child's (and her grandchilds) wellbeing. Many a jury would agree.", "It is now.\n\nSo, no, he does not see his kid. And she has to call him every time she may need something for the kid he does not see, then wait for him to bring it if he decides it's necessary. And what makes him a good man?", "She says he didn't want it to be court ordered which means he wanted to be able to not pay what he promised whenever he feels like it. Also he said he is providing free health insurance whle he actually isn't even paying for it, the military does, tge chikd is a dependant, he just wants to get out of paying a dime for the child he helped creating.", "She said that he’s providing health insurance as a defense for why he doesn’t need to provide money to his child. It’s in the comments. He’s trying to get out of paying child support.", "Yeah while she went too far, I don't fault the mother that much either. This is her grandkid and [OP is out there in the comments saying they aren't family because they never married](https://www.reddit.com/r/AmItheAsshole/comments/18n34jj/comment/ke8hgiw/?utm_source=reddit&utm_medium=web2x&context=3)", "Nothing wrong with a soft wood, they're perfect for specific applications. 😁", "lol okay, thanks!!", "LMAO", "A portion of utilities are his responsibility. You're spot on though.", "And honestly I’m surprised he’s been able to dodge her this long the military takes child support very seriously", "This is what I keep thinking with every comment OP makes. She’s gonna be singing a different tune when she’s on the other side.", "& it’s free. He pays nothing.", "> Alright im calling this as incel women be greedy posts.\n> \n> \n\nWe call people like OP \"pick me\"s.", "Seriously, I can’t imagine how much more dramatic she’s gonna be when her fiancé dumps her for causing drama with his ex’s family in the middle of a custody case.", "I like your random generated name 😉\nFinally someone close to mine lol", "Thank you!", "Which is so stupid because it benefits him to have a court order as well. \n\nMaybe currently via the 'support' he was paying was too much and he can get it reduced or he wasnt paying enough. It works both ways, but it seems like the deadbeats are all out in force trying to paint the baby mama as the bad one.", ">He’s not dodging supporting the child. He’s trying to dodge being bled dry. He provides what she asks for, now she wants more plus everything he’s already providing. For what? So she has money for herself? To buy purses and get her hair done? The baby is provided for, and that is his only responsibility.\n\nSounds like the ex wants more child support and he’s having the court assess what that amount will be.", "You really think everyone that has divorced/split up considers their ex family? Or their partner’s ex family?", "Not really. I had a student with 5 kids and a husband who beat her and them- putting her in jospital more than once. He wanted to pay 30 bucks a month. Took her years. They also turned a blind eye to abuse"]}