{"id": 33500, "submission_id": "18nkuw1", "title": "AITA for arguing with my mom over Lululemon gift cards?", "selftext": "I (27F) planned to buy my nieces (17F & 16F) $50 Lululemon gift cards each for Christmas, but wanted to wait until I got paid to get them. I told this to my dad (important for later). Yesterday, I had to go pick up my mom (70F) from her part-time job. On our way back to her house, we were talking when she suddenly says Oh btw, you owe me $100. Thinking she was joking, I asked why. When she had went out earlier, my dad (67M) told her I was buying Lululemon gift cards. She was by Lululemon, so she went in and bought 2 $150 gift cards, thinking that it would save me a trip and then she would put her name, my name and my dad’s name on the gift cards. \n\nHere’s where the argument starts. I told my mom that, while I appreciated it, that I wish she talked to me about buying the gift cards. I told her that, while she could tell the nieces that I helped with the gift, they are going to think the gift came from my parents, so then it looks like I didn’t get them anything. Since moving out and getting a decent job, I’ve been getting them gifts separate from my parents for years and I wrap the gifts myself and put my name on them so that they know I bought it.\n\nI also tried to explain that now instead of just going to the Lululemon, now I have to go find an ATM and get $100 out. We don’t live in a bad neighborhood but I don’t usually go to ATMs since I’m worried about potentially being mugged, and since I use my card for everything. My mom doesn’t have PayPal, Zelle, etc either, and I don’t know where my checkbook is so the only way for me to pay her back is with cash. She said I don’t have to pay her back right away, but I told her that wasn’t the problem and that now, instead of me being able to get the gift cards and finish thinking about Christmas shopping, now I have to constantly be thinking about paying her back until I go get the cash. I also asked why she didn’t call me about it, as I would have suggested her to buy 2 $100 Lululemon gift cards and then I would go buy my 2 $50 gift cards so then it would look like the girls had multiple gifts. \n\nShe got mad that it looked like I didn’t appreciate what she did. When dad got involved later, he suggested I just go and buy the $50 gift cards like I planned and then the nieces get $200 for Lululemon so they can buy more stuff. I told him that, while not a bad idea, I know mom is going to keep bringing up how I owe her $100 if I don’t give it to her and (as I’m on a tight budget with a big trip I have planned next year) I don’t want to have to spend $200 to satisfy everyone when I had only planned on spending $100. \n\nFor additional context, my nieces like more than just Lululemon, so it would have also been easy for her to go buy a different gift card for them at one of the other stores that was near where she was at. And we can’t give my nieces cash as the oldest one will either use her money for bad things or will steal the cash from the younger niece and then use all of it for bad things. \n\nSo AITA?", "created_utc": 1703157927, "permalink": "/r/AmItheAsshole/comments/18nkuw1/aita_for_arguing_with_my_mom_over_lululemon_gift/", "score": 57, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Arguing with my mom over her buying the gift for my nieces that I had planned on getting for them and then saying she would put my name on it and I owed her $100, despite this causing me more stress since now I have to go to an ATM to get cash out for her, which I almost never do for safety reasons, and since I use my credit card for purchases, and since I don’t know where the closest ATM is to me, and now it looks like the gift comes less from me and more from my parents. My parents feel like I’m making a bigger deal out of this than it should be, which is why I feel like the asshole.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If this is a gift from your parents, then you don’t owe them anything. If they bought the gift for you to give, and it would be your gift, then you shouldn’t make it out like it’s a gift from your parents, especially if your name will be on it and you will pay it back eventually. It’ll still be your gift, just you weren’t the original buyer. On that note, you wouldn’t need to buy your daughters extra cards. It would just look like your parents didn’t get them anything.", "NTA\n\n  \nSimply tell your mom. Sorry, i won't join your gift, because I want a separate gitft. Then do that.\n\n  \nYOu NEED to put your foot down, or she will keep doing it. Your patents are AHs in this.\n\n&#x200B;\n\n\" I know mom is going to keep bringing up how I owe her $100 if I don’t give it to her \" .. Just answer her: Don't lie. I don't owe you money. YOu bought those cards without my involvement, YOU pay for them.", "NTA. Your mom hijacked your gift idea and is trying to make you the bad guy for not being appreciative. \n\nEdit: I would get the nieces another gift and tell mom that I would not be paying her for stealing the gift idea. She stole it so she pays the price.", "NAH\n\nHowever if your niece wants to buy drugs she will just flog the gift card for half its value and go buy drugs. It's just cash with a conversation penalty and  extra steps.\n\nBut then she may do that for anything of  value you get her, addiction does that to people. \n\nThe real easy way to fix this stupid fight is just to tell them it's $50 from you and $100 from your parents if the perception of your contribution is that important. Or write it on the card or whatever. \n\nSure it's a little irritating your mum didn't ask, but it's such a non issue I think you are being about as irritating by making such a fuss over it. Neither of you rise to the level of asshole but you both sound tiresome.", "NTA. Your mom stole your gift idea and then tried to force you to pay for part of her gift without asking your permission first. You don't owe her any money.", "NTA- For those not understanding the problem perhaps a different view will help. I have a large extended family. If I get a birthday card from my aunt, uncle, and my adult cousins, I know that 100% my aunt bought the card and signed everyone’s name. If there is a gift, she is responsible for that as well. I’m an adult and I understand it’s the easy thing to do, but a tiny part of me still wonders WTH is up with my cousins. They couldn’t be bothered to at least sign a card? From the time my kids could write their names they signed anything like this. \n\nNot a big deal to some, but making it known that you are on your own, you aren’t depending on mom and dad, and most importantly being proud that you are now adulting enough that you don’t need mom and dad to subsidize gifts can be HUGE. A much smaller scale that living paycheck to paycheck and finally having a decent wage and savings! Or actually being able to afford a home instead of renting.", "Should your mother have touched base beforehand? Yep. Are you making this way too big of a deal? Yep. Not sure why you can’t walk into your actual bank branch. Whether you visit the teller or an indoor ATM that most banks have, it’s not the security risk you’re making it out to be, nor do I understand why you think two teenagers won’t be able to comprehend a gift coming from three people.\n\nYour mother made a misstep, but it wasn’t done in malice. It’s not something to be all in a tizzy about.", "Why is this even a big deal? So what if your name is also on the gift? And instead of going to one store which is in limited places, you head over to an ATM in a bank branch that has cameras which you’re bound to find closer to you than a lululemon.  You won’t get mugged.  Good grief.", "As petty as this may seem in the grand scene of things .. your mother majorly overstepped. She took over your gift entirely, bought it herself, and is now asking you for money towards it. \n\nNTA. This is likely not the first or last boundary she crosses.\n\nIf it’s not a big deal, according to your parent’s logic, they should have no problem accepting you buying them a different gift.", "NTA.  Mom is being lazy af.  Go get ur own gift.  Lululemon was your idea and would have been nice to be able\nTo give it to them yourself.  Also mom should have told you what she was doing.  This is just amateur hour", "This is enjoyably low stakes compared to the usual (probably fake) train wrecks on this sub. I fo agree it's annoying, and you're NTA, but I'd chalk this up to families sometimes being annoying. Make sure your nieces know you contributed.", "\"She got mad that it looked like I didn't appreciate what she did.\"\n\nBecause you DON'T appreciate what she did. She overstepped. Let them give the cards as a gift, you buy new cards to another store in the amount you originally planned. And don't let her guilt you about the extra $100. Shut it down once she brings it up.\n\nNTA.", "NTA. This is annoying to deal with, but your mother did not have ill intentions. Your niece is just going to sell the gift card for half of what y’all paid for it if she is that bad off on drugs. I’ve been sober for 10 months but I know that everyone I knew on drugs, myself included does this with every gift card we receive, even if it’s a really cool store that we would love. *sighs* drugs ruin everything. Hope your niece decides enough is enough soon and seeks help.", "NTA Also don’t pay your mom it’s her own fault I feel like she did this just so u could “owe” her money", "YTA - much ado about nothing in my view.  Just tell your nieces you all contributed.  Surely going to the ATM is not such an ordeal.  Your parents didn't communicate with you but their reaction is not unreasonable.  You're creating issues where none exist. Relax!", "YTA.  \n\n\nYou are overthinking this. My bet is that your nieces will be happy they got 150$ to spend in that store.  \n\n\nYour mother just went ahead and bought it and as she said you can return the money whenever or you can suggest a deal where you'll do shopping for them in value of 100$ and you'll call it even. There are so many ways to solve this issue and if you want to give them something extra I'm sure you can find some Christmas card or something to go along with the gift cards.  \n\n\nYes your mother overstepped the boundary but it's not like something changed.", "Nta", "Light YTA. You're catastrophizing. Buy your mom a Visa gift card for $100 if you don't want to go to the ATM; you can get them at any drugstore or grocery store. Have your mom put all of your names on the gift cards. I'll upgrade to E.SH if she refuses to put your name on.", "ESH \n\nYour mother absolutely should have checked with you before purchasing the cards.\n\nYou are making a mountain out of a mole hill, so to speak. You can tell your nieces you paid for a portion of their gift.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (27F) planned to buy my nieces (17F & 16F) $50 Lululemon gift cards each for Christmas, but wanted to wait until I got paid to get them. I told this to my dad (important for later). Yesterday, I had to go pick up my mom (70F) from her part-time job. On our way back to her house, we were talking when she suddenly says Oh btw, you owe me $100. Thinking she was joking, I asked why. When she had went out earlier, my dad (67M) told her I was buying Lululemon gift cards. She was by Lululemon, so she went in and bought 2 $150 gift cards, thinking that it would save me a trip and then she would put her name, my name and my dad’s name on the gift cards. \n\nHere’s where the argument starts. I told my mom that, while I appreciated it, that I wish she talked to me about buying the gift cards. I told her that, while she could tell the nieces that I helped with the gift, they are going to think the gift came from my parents, so then it looks like I didn’t get them anything. Since moving out and getting a decent job, I’ve been getting them gifts separate from my parents for years and I wrap the gifts myself and put my name on them so that they know I bought it.\n\nI also tried to explain that now instead of just going to the Lululemon, now I have to go find an ATM and get $100 out. We don’t live in a bad neighborhood but I don’t usually go to ATMs since I’m worried about potentially being mugged, and since I use my card for everything. My mom doesn’t have PayPal, Zelle, etc either, and I don’t know where my checkbook is so the only way for me to pay her back is with cash. She said I don’t have to pay her back right away, but I told her that wasn’t the problem and that now, instead of me being able to get the gift cards and finish thinking about Christmas shopping, now I have to constantly be thinking about paying her back until I go get the cash. I also asked why she didn’t call me about it, as I would have suggested her to buy 2 $100 Lululemon gift cards and then I would go buy my 2 $50 gift cards so then it would look like the girls had multiple gifts. \n\nShe got mad that it looked like I didn’t appreciate what she did. When dad got involved later, he suggested I just go and buy the $50 gift cards like I planned and then the nieces get $200 for Lululemon so they can buy more stuff. I told him that, while not a bad idea, I know mom is going to keep bringing up how I owe her $100 if I don’t give it to her and (as I’m on a tight budget with a big trip I have planned next year) I don’t want to have to spend $200 to satisfy everyone when I had only planned on spending $100. \n\nFor additional context, my nieces like more than just Lululemon, so it would have also been easy for her to go buy a different gift card for them at one of the other stores that was near where she was at. And we can’t give my nieces cash as the oldest one will either use her money for bad things or will steal the cash from the younger niece and then use all of it for bad things. \n\nSo AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA Tell your mother to return the gift cards because you're goi to get your nieces something else now she's stolen your gift idea, even if you still end up getting the giftcards you intended.", "NTA, but don't pay her back.\nThat's their gift to give now, and you can find other gift cards for your nieces.", "NTA she still sees you as a child without autonomy. Make it clear this was not helpful and she should have asked you but if this is the first time maybe go with it but make it clear you’re not doing it again. All parents and teens go through these growing pains of adulthood. Be patient with your parents but firm. This is hard for them too", "NTA. Go buy your gift cards, and your mom can figure out what to do on her own like she did when she bought them.", "NTA. In the grand scheme of things, it is very minor. The nieces won't care in a few months, you arent in the hole for more than you intended, there will be other gifts where you can do what you want.\nEverything will be fine. \n\nBut. \n\nYou have put in mental effort to plan out how you can save your money and time to make your nieces happy, and now your mother has just completely thrown all that out the window. Now you have to make a whole new plan, and that takes time and energy and mental work on your end.  If she had stuck to your plan, you wouldn't have had to adjust things with 0 notice. \n\nAt the end of the day its not entirely about having to go to the bank or atm to get money, having your name tacked on to a gift, having to pay someone back, or having to pick a new place to get a gift card from. I will bet this is not the first time your mother has done something without any regard for you planning and effort and doesn't acknowledge that her making changes to your plans does not indeed make things easier. And this isn't the first time she's held something over your head. And this isn't first time she's done something without consulting you.\n\nYou're not mad about the gift cards. You're mad your family/mother doesn't value your time and planning and cannot see this from your side. And you are mad she just does what she wants without regard for others.\n\nYour feelings are valid, there are underlying issues at heart here and this is just one manifestation of it. But it's also not a dire situation. It's just an unpleasant one. It's not worth this much anguish.", "ESH mom was dumb for not talking to you about it first or realizing you’d want a separate gift to give. your concerns are pretty surface deep about getting cash and wanting your nieces to think highly of your gift when it’s just giving money. \n\nFor this gift just give your mom money and when you do, tell her next time you want to give your gift on your own.", "Or you could say with the gift that you got them the gift card and your parents chipped in with you. It makes it sound like you bought it and they tagged along.\n\nNTA mom over stepped and you should do as dad said and have dad tell her you owe them nothing as she overstepped. And if she brings it up later just say go say it to dad and let him explain it to her again. and maybe again. and maybe again.", "I strongly disagree. I would never, ever spend someone else's money without double-checking with them first, & I certainly wouldn't combine Christmas presents with my adult kid without...again...checking with them first. Circumstances change.\n\nTeenagers will absolutely think the gift is primarily from the parents, not OP, bc their whole lives they themselves have been add-ons when their own parents have given gifts. They will wonder why OP isn't getting them something separately like usual.\n\nAlso, you're very dismissive of OP & her wanting to stay safe, which is disturbing, especially given the fact that you know absolutely nothing about her neighborhood. I lived in a neighborhood in Chicago that was ok at perhaps noon, but I sure as heck wouldn't mosey up to an ATM or bank teller & get cash at any other time. I always got cash out when I was outside of the neighborhood. You're judging something you know nothing about.", "I am happy that you live somewhere where you don't have to feel anxious visiting a bank or ATM. I do too and it's lovely. But this is a real anxiety that people face.", "Not to mention if it’s that big of a deal just walk into the actual bank branch. There’s usually a security guard and you can visit the teller or the indoor ATMs that most banks tend to have. The mom should have touched base before doing what she did, but there was no malice in it, and I’m not sure why OP thinks two teenagers won’t understand a gift being from three people.", "OP can also suggest she'll do Christmas food shopping in value of 100$ for them, I'm sure her parents would be ok with that.  \n\n\nOP blew that out of proportion because she won't get to feel like the main star here.", "Oh I am sorry, you’re not a teen. Nevermind. Tell your mom you don’t want to go in on her gift card and don’t budge. You’re not a child", "I'm sure the nieces will be more focused on what they will buy for the 150$ they got more than who it is from. Not suggesting they won't be thankful but as a teenager 150$ is a lot of money so I'm sure they won't mind it's gift from 3 people."]}