{"id": 33598, "submission_id": "18ov10l", "title": "AITA for calling my husband selfish", "selftext": "I f36 have been with my husband for 19 years in that time I have raised his children from a previous marriage and also our children. I have been through a lot physically fertility treatment, pregnancy, miscarriage, births and then birth control for almost a decade I had a health scare approx 2 years ago which led to me wanting to discontinue birth control but with no other option I continued. I have recently had another health scare which has led to me needing to stop birth control but my husband simply refuses to get a vasectomy because he doesn’t want to, this has led to a number of arguments and I have said could ultimately end our marriage as he has a very high sex drive. I have said I feel he is selfish but he claims I am the one destroying our relationship when I don’t know what else to do\n\nI would like to clarify the age gap is appropriate I was only a few weeks off 18 and him 21 at the time we met and our relationship has been happy and health with no major red flags or fall outs until this recent issue. The ultimatum we are facing is abstinence or vasectomy I have simply mentioned the fact he has a higher sex drive signifies to me that it has the potential to cause issues and he should therefore want to prevent that for his own benefit as well as mine ", "created_utc": 1703297028, "permalink": "/r/AmItheAsshole/comments/18ov10l/aita_for_calling_my_husband_selfish/", "score": 133, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Asking my husband to get a vasectomy due to my health scare when he thinks I should continue as it’s not his fault women have babies\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I rarely recommend ultimatums but I believe it's time.\n\n  Door one: value the health of his wife an have a small outpatient procedure.  \n\nOr door two: a sexless marriage ending in divorce.\n\nHe's can't have his cake and eat it too. NTA", "Yep he’s a selfish ass. His kind of attitude Makes my blood boil.  Your choices if you stay together are condoms or celibacy.  You should not consider a risky procedure or medication for yourself.", "How old is your husband? \nThis situation sounds ick asf.", "NTA. Your husband is tho. Also: Condoms are vastly cheaper than another child, just throwing this in here.", "NTA. He can either wear condoms or get snipped. You’ve shouldered the birth control responsibility for NINETEEN YEARS. Here’s his chance to take responsibility.", "I like to think like you. You don’t want more kids? ✨ Vasectomy ✨\nYou’re NTA but your hubby is", "Your issue is factoring in his sex drive as if it matters - it doesn’t (unless your husband is a violent man). Simply stop having sex with him since he won’t have a vasectomy and you won’t have more children. You’ve talked, argued, and pleaded with him. Move on. This is the middle ground and if he’d like things to ever progress past a cuddle, he’ll wake up and take care of you for a change.", "You’ve put your body through hell and risked all sorts of health issues, just by taking birth control alone, for nearly two decades. Meanwhile he won’t get a reversible operation that’ll take him 8-9 **days** to recover from. His selfishness is at an *astounding* level. NTA", "Your husband sounds like TA, not you. Condoms are nowhere near as convenient and reliable a solution as vasectomy. It's the least he could do after all you've done for him. Does he actually want more kids or just frightened of getting his precious vas deferens snipped? It's a 20 minute procedure. His body, his choice I guess, but also your choice if you don't want to have sex with him anymore or choose to get out of the relationship.", "NTA. No snip, no dip.", "NTA... if your health/life is at risk from pregnancy or termination, and your husband recognizes that fact yet refuses to get snipped because he wants to be able to have children with some theoretical future woman, he is definitely TA.", "NTA, but I definitely don’t think an ultimatum is the way to go, either. It totally makes sense that you can’t be on birth control, and although it might be a little irrational for him to not get a vasectomy, it is his body at the end of the day. Would he be willing to talk about it? Is he afraid of rare side effects, does he just not like the idea, does he feel like it might impact his masculinity for some reason? It can help to talk to other friends who’ve had it done, if he has any. Even though it’s a super easy procedure it is still surgery, and some people are going to be squeamish about it no matter what.\n\nIt’s frustrating (actually, my husband is dragging his feet too!) but we have to try to be patient. Some alternatives are condoms and/or NFP…", "Nta for obvious reasons", "NTA - he has choices and so do u. It is a matter of follow through, which I am curious if u fail at.\n\nHear me out - do u continuously cave to his demands? Is this surprising to him that ur trying to stand ur ground, so he is just trying to roll over u (per usual)? \n\nI am NOT discounting what u have been through. If anything - u sound exhausted. Almost too tired to push back on things that most people would - leading him to feel like he can bully u into submission. \n\nAn ultimatum seems needed - which is why I ask the question above. U will need to stand by it - however u choose to word it (which I hope u do!). An ultimatum IS NEEDED, but u will need an escape plan if he chooses to try to steam roll u.", "It boils down to two options.  \n1.) Your literal health and well-being \n2.) His comfort.  \nIf he can't pick your health and well-being over his own comfort, he doesn't love you the way he thinks he does.  You have given enough, it's his turn now.  \nMy husband willingly went to the doc and got the snip just because he saw me have adverse reactions to birth control and took it upon himself to protect me. Oh, and we were in our 20's. He didn't think twice, and I treated him like a King for 3 days while he recovered.  \nIf your marriage is otherwise good, maybe he's afraid, and you two need to sit down and have a calm conversation.", "This reeks abuse", "NTA, your husband doesn't care about you or your health. You need to do what's best for you, put your health first and him last", "Say no more. He’s a self centered AH who doesn’t care about your health enough to get a vasectomy yet he demands constant sex. He’s an AH. Relationships should be fun, they should feel supportive, kind, loving and most definitely care about your health! You deserve better!", "You are definitely not the AssHole", "You’re obviously not the one. He wants to stay fertile in case he wants to remarry. This is easy to see. You just have to want to.", "Your 36 and have been with your husband for 19 years and have raised his kids from a previous marriage? WHAT. THE. ACTUAL. FUCK. Just use condoms, there's no reason not to but I'm fucked if I can work out who the ahole is here. Probably both of you. ESH.....", "He is absolutely being selfish. NTA.", "NTA\nVasectomy does not reduce sex drive in any way. The only reason to not get it is to want more children and your family is already complete. But of course men don’t care about that at all, will refuse to think logically and always consider it a threat to their fragile masculinity.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI f36 have been with my husband for 19 years in that time I have raised his children from a previous marriage and also our children. I have been through a lot physically fertility treatment, pregnancy, miscarriage, births and then birth control for almost a decade I had a health scare approx 2 years ago which led to me wanting to discontinue birth control but with no other option I continued. I have recently had another health scare which has led to me needing to stop birth control but my husband simply refuses to get a vasectomy because he doesn’t want to, this has led to a number of arguments and I have said could ultimately end our marriage as he has a very high sex drive. I have said I feel he is selfish but he claims I am the one destroying our relationship when I don’t know what else to do\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but your husband is a massive AH. I get he has, and should have, body autonomy, and “no” is a full sentence. However, you two are supposed to be partners. OP has health risks making hormonal birth control and pregnancy detrimental to her life. \n\nThe cost of purchasing condoms shouldn’t be a factor. The true cost is if/when a condom fails… and it’s not unusual for them to fail. It seems the better way to look at condoms is that they do not have a high enough success rate at preventing pregnancy to make them a viable option.\n\nThat OP’s husband is choosing his fertility over OP’s health, and that’s his right. But choosing his fertility over OP should tell OP how much her husband values OP’s life and their relationship… to put it plainly, he doesn’t value her life or their relationship. It’s OP’s choice to how to proceed. \n\nIf it were me, I wouldn’t want to be with someone who thought so little of me.", "So you were raising his kids from a previous marriage when you were 17 ? Really ??", "INFO have you guys heard about condoms?", "YTA. \n\nEveryone listens to OP's reason why she does not want to use condoms (and her husband wants to use them), her reason was \"but they are expensive for long term use, and after this amount of time not using them sort of take some of the fun out of the situation\"  \n\nSo you want your husband to get snipsnip because of health reasons (that's valid) (and it's his right to say what he wants to do with his body) but you don't want to use condom because \"it's not as fun\"??? Are you 16???", "I completely get where you’re coming from, but if we, as women, need bodily autonomy, men do too.  So if he says no, it’s no.\n\nThat’s not to say your husband isn’t a selfish jerk, tho.", "Jesus fucking christ, he's being obtuse, your can do without him. Who's going to lose out the most when you divorce, you, the one who no longer has to worry about your health or taking bc, or him, the one who apparently needs a lot of sex and is gonna have to find other places to get it plus losing the mother of his kids, presumably everything you do for him etc. Let him find out he can't be that great to actually stay with someone this selfish", "NTA. Look into getting fitted for a cervical cap. Your nearest women's clinic can do this. A cervical cap is very inexpensive, and when used correctly is more reliable than condoms. I was never able to use hormonal birth control, but the cervical cap worked great for me for decades. I didn't bother with this next thing, but you can IN ADDITION try watching your cycle carefully and avoiding any sex at all, even with protection, at your fertile times. In other words, you be the gatekeeper for avoiding pregnancy. If your husband doesn't like dealing with your schedule, or having to wait while you make sure your birth control is in place, then he should get snipped. My husband and one of my sons have had it done. It's no big deal and they report no diminishment of their pleasure. Good luck, OP. This is a real test of your husband's ability to be a real partner and work through issues together cooperatively. If he won't take you into account, you may have some thinking to do.", "Info: Why aren’t condoms an option? Combined with a diaphragm and spermicide and they are plenty effective.", "I do think your husband is being selfish here. If he’s done having kids, he should snip it up. But would you consider getting your tubes tied instead?", "The only assholes are the people commenting", "Why was a 17 year old hooking up with a man with 3 children?  Calling bullshit on it but in either way get your tubes tied.", "Penetration doesn’t need to be a part of sex for sex to be enjoyable.", "NTA but fyi you have two other holes you can let him have fun with…", "I think none of ur ar being selfish. U can't ask a man to cut of his Weiner same way u can't ask a person to not think about her health. Here is something i would suggest.\n1. Use condom \n2. Tell him to be a little patient with his libido and be patient with u \n3. Consult a doctor what more can be done\n\n\nBecause here is the thing, that thing ur talking about it not health either. Imagine if he ended up getting some disease too because of that because regardless of what people tell u that procedure is as dangerous to man as tubactomy is to woman. So I hope u will understand. It's not a huge problem. U guys have a great marriage don't let people in this reddit tell u to end it or otherwise. U have spend 20 years with that guy and u also know subcociously he is good person. Because from his pov it's not about toxic masculinity or anything, it's about his dear wife asking him to sacrifice his body with an irreversible change that may leads to who knows what. It's scary\n\nBtw the thing u said 18 yr old marrying 21 yr old , that's totally fine. Nothing wrong in that . U might be surprised but woman are actually 2 years mentally more mature then men so u had a mindset of a 20 yr old and u met a mindset of 21 yr old. It might not make sense but I read it in my science book so i believe in that.\nTc I hope u guys will figure it out", "Get a tubal ligation.  It is a pretty easy procedure and more effective than a vasectomy. Oh, the freedom!", "YTA\n\nWhatever bullshit martyr story you're trying to weave when filtered to its core, you're telling another person what to do with their body. \n\nRaising children and all the rest is a canard", "There are other alternatives to hormonal birth control products such as condoms, an IUD, cervical cap + spermicide, contraceptive sponge...\n\nIf you think it's a good idea for him to get a vasectomy but he hates the idea, would you get yoir tubes tied instead?", "NTA. So he's r*ped you.  So you were 16/17 yo when he already had kids from a previous marriage. \nYou've been brainwashed, gaslit, and r*ped.  Your husband with the high sex drive is probably already satisfying it elsewhere.  Get divorced.  This is a highly toxic relationship with the man who r*ped you.", "[deleted]", "Well I wouldn't say he iz selfish bcuz he don't want to cut off his balls there's nothing wrong that he iz saying or doin.. you close your legs an get your we we sowed shut see the point my point iz this you both know if you screw that your gonna have a baby then tell or make your husband or you 1 use a condom 2 stop fuckin 3 agree to disagree about not havin sex if not leave the poor man alone not his fault hee has a very high sex drive you ever even think that your beautiful an he can't help himself anyways night night have a blessed rest of your merriage", "[removed]", "NTA, I'm a father of 3. Married happily for 20 years , great sex life. I just pulled out before I blew. I plan on getting a vasectomy. Now that we are done having babies. my wife didn't take well to birth control when we were dating. So she came to the decision to stop taking it, and we were just extremely careful. Haven't had any problems, and if I want to get lazy, we just use a condom. It's not hard. Just ask him to be responsible, not worth bringing a life into the mix because of an accident.", "NTA.  I can see how this is detrimental for your marriage.  I understand not wanting to get a vasectomy, which while selfish everyone has their reasons.  But in that case he should be wearing a condom or should be going without sex.  It really comes down to your health and safety as his your top priority.  It should be a top priority of his too.", "you dont suck. he does. try that new drug thats out now, Nopussatall. if he loved you, he would be concerned for you.", "NTA. What is this guy's problem?! He is DEFINITELY selfish as well childish. My husband had his vasectomy after our second child was born, this was over 30 years ago, And he drove himself home!!! The doctor didn't even make an incision. It is so much easier than a woman getting a tubal ligation, as well as quicker, and only requires a local anesthetic. The only thing is that you still have use a condom the first six weeks afterwards because there are still live active sperm floating around in there. And yes, you can,still get pregnant in those first six weeks after vasectomy.", "He is definitely selfish. He either loves you or he doesn't.  If he loves you,  he will have this simple procedure. If he doesn't,  you don't need him around.", "nta. it’s not like he can’t fuck and cum after a vasectomy he’s just being a big ol sack of poop. i would give an ultimatum for the procedure considering it’s for ur HEALTH. like wth, u can’t do a little snip for ur person???\nffs michael scott did it and reversed it..TWICE. snip snap, snip snap.", "NTA", "Bilateral Salpingectomy dear lady but also maybe divorce after? 🤷🏾‍♀️", "Husband is prioritizing his non-medical wants over his wife’s medical needs. Husband is TA. OP- when people show you who they are, believe them. I’m sorry you are learning more about this man you married.", "NTA. I had to have a hysterectomy last year due to medical necessity. It was nice to be relieved of birth control issues, and I am grateful I had the ability to receive this treatment. I had laparoscopic surgery that left minimal scarring. All that written, It was so incredibly painful and took me 8 weeks to recover, missing 5 weeks of work. \nYour husband obviously does not grasp that the options before you two make his assertion that he won’t have a vasectomy INCREDIBLY selfish. You were right to call him on it.", "What about condoms?", "I see no issue in your logic . NTA", "NTA", "NTA. Your husband is an asshole.", "NTA. Your husband is an asshole.", "Probably start a relationship podcast.", "NTA your husband will not go through minor discomfort for your physical safety.\n\nIf you are in the US the maternal mortality rate is rising some states like Idaho are no longer reporting and women are being told they’re safety is not as important as the fetus they are carrying.  This is a terrible time for an unexpected geriatric pregnancy.", "Definitely NTA. Husband is a different matter. I’ve had a vasectomy and it’s nothing. He’s probably just dumb, tbh. Thinks it will make him less manly or something stupid like that. None of that is accurate. You’re right, he’s selfish.", "Let him know it’s condoms or a snip", "Leave now. Like, right now.", "Your husband is so selfish!!", "This would result in divorce for me.\n\nAfter everything youve gone thtough he should want to have this tiny procedure. My partner had one because hes not selfish. Id literally divorce in your case.", "No. NTA.\nHe’s incredibly selfish, and it sounds like you’ve been placating him for a long time.\n\nSimple options for him: Operation and sex, or no operation and no sex", "YTA since he suggested using condoms and you said they “don’t feel the same”. He can do what he wants with his body and you can do your’s. A vasectomy is still surgery ffs and all surgeries can lead to potential complications", "Have you guys discussed why he doesn't want the procedure? And can you guys use condoms? Nta. Just seems like this needs more context and there are also other forms of birth control?", "As a husband I am going to second this.\n\nNTA", "She doesn’t put his age in there, but if she’s been with him for 19 years, she was 17 when they got together. And he’s at least old enough to have “children from a previous marriage.”\n\nJust sayin.", "He is so selfish and doesn't care that his wife's, OPs, health is at risk. I would kick him to the kerb NTA", "Also he should absolutely get the vasectomy. \n\nBS masculinity shit and patriarchal expectations are the only reasons people can cite for not wanting one if they were actually honest. \nExcept for wanting future children, which still isn't often an issue as they are reversible. \n\nYou're NTA. He is because of societal patriarchal BS that he needs to resolve. \nHe needs to get a vasectomy. \n\n\nIt's been proven that hormonal birth control has major negative impacts and vasectomies have literally none.", "NTA. There is no way a guy too selfish to get the snip can be trusted to reliably wrap it up. One “just the tip” and OP would be in trouble. \n\nOP, your marriage is probably over. I am so sorry.", "Condoms also fail a lot more than a vasectomy and as the wife has already been through a lot of health scares. It’s not fair that she has to worry about it.", "No, I have 2 adult step children and my youngest is 8 after being already parenting for 19 years I do not want to start this loop again with a new baby 🤣", "If he had this objection at least it would be a reason but he doesn’t, he does not want any more children, only reason for refusal is he doesn’t want to. He has a dislike for needles but will not admit it this is his only reason i can think for his refusal but if this is the reason to refuse I think this is a very selfish act on his behalf and I don’t know what else to do", "You're right, patience is key. A lot of female people go with condoms for years because they don't want all the side effects of the hormones or other birth control, very often tho the inconvenience and unreliability of condoms wears off eventually and they are forced to choose one. Maybe the same will happen here if given time", "No I can stand my ground when needed, he tends not to admit when he is wrong, but in all honesty until this situation arose there have not been many occasions when we have disagreed so strongly on something", "This is what I was thinking. I am 35 and have been with my husband 15 years. Our oldest is 11 next month. It's so weird to think that this woman was with an older man raising his children during the time she should have been growing up becoming someone.", "How is any of it OP’s fault?", "Yes, they were 1 & 3 when we met and I moved in with him and the kids after around 5 months of us being together", "My parents had. My mom still got pregnant.", "Yes but they are expensive for long term use, and after this amount of time not using them sort of take some of the fun out of the situation", "Her reason also includes \"if they fail and I fall pregnant I won't be able to get a termination because of the health risk and I don't want more kids\". \n\nA vasectomy is more reliable than assuming the condom had been manufactured and used correctly.", "I agree, but this should’ve been a discussion before kids/marriage. A grown up conversation about husband’s willingness to get a vasectomy in the case that they decide no more kids. (IMO he is being selfish by not getting a vasectomy) OP, would you be willing to get your tubes tied if you cannot have any more kids due to health reasons?", "Another jerk woman jealous and asking to get divorce. Bro these days clowns on internet are all the same . Just break up. Can't solve a problem just die , can't open a jar just break it. All there are just extreme and extremely stupid opinions . \nImo none of them are ass , guy seems scared to get his Weiner cut and well the girl is already facing too much complications.", "My husband and I had much better sex after he was snipped. We never had to worry and could be spontaneous.", "We were both single and he had two children to his previous relationship not 3. No bullshit in this situation. Can you explain why you feel I should have quite major invasive surgery that requires me to be put to sleep over him having a small procedure outpatient procedure that can be done with a local anestetic?", "It’s way more invasive with much longer downtime. After already birthing children and sacrificing her body, it’s time for him to step up.", "How am I a martyr? And where did I tell him what to do, it’s not possible for me to be on hormonal birth control any longer. This is the person I see myself spending the rest of my life with, I’m unsure how Asking him to get a vasectomy to allow us a healthy sex life is wrong?", "What? Are you for real?", "She’s already birthed children and pushed humans out of her vagina. She’s miscarried. She’s been on hormone birth control for years. When is her husband going to take on responsibility?? Why should she have to undergo a surgery way more invasive than a vasectomy? Why does it always become the woman’s burden to bear. Hasn’t her body been through enough???", "So she should take body-altering chemicals, a foreign object shoved inside of her, or intensive surgery over him getting a leave-the-same-day reversible procedure so she doesn't have to experience miscarriage again? good god.", "Are you kidding? This woman has had parts of her body ripped open to birth their children. She’s been on various hormones for nearly two decades to allow for their family planning. Undergone the trauma of miscarriages and now you want her to consider yet another medical intervention because her husband doesn’t want to get a minor out patient procedure? A .5 inch incision and 3 days of recovery time? Is her body not allowed a break?\n\nI don’t care if you’re a woman. You sound ridiculous trying to explain birth control to OP like she’s not aware of other options.", "I was almost 18 and he was only 21 and single at the time we met. He had only been and stuck with his previous relationship due to his first child. I did not threaten him I simply said I felt it would ultimately destroy our relationship as it’s not possible for me to continue with birth control due to a breast cancer scare and then blood clot in my lung. I’m sure in this situation only his possible pain is the most important aspect way to victim blame….", "OP has legitimate medical reasons to discontinue birth control, OPs husband has no real reason to deny getting a reversable medical procedure other than a total disregard for his wife's health and happiness. You are wrong, and to be frank, you are failing yourself and all women. Your comment implies that OP should risk her health to provide her husband with sex, this is an absurd take and makes me think you need a therapist. \n\n\n\nThe commenter who deleted their comments claimed vasectomies are not reversible, this is incorrect. [Here](https://www.mayoclinic.org/tests-procedures/vasectomy-reversal/about/pac-20384537) is an article from the mayo clinic explaining why that is bullshit.", "The victim blaming with the 17 year old getting with a divorce man with kids is wack but the other stuff 8 agree with", "Have you ever looked into the side effects of birth control for women? (Hormonal and non).. or the side effects of pregnancy or miscarriage?\n\nOP is talking about sharing the load of birth control, which OP has taken full responsibility for their entire relationship this far, with now serious health complications ....", "\nA vasectomy is not castration", "What are you talking about, they don’t ‘cut off the balls’", "Troll, or just the victim of truly horrible sex education?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You just got phenomenally lucky pulling out. I know plenty of women who got pregnant that way. You know that some semen leaks out pre-ejaculation, right?", "As a man that has 2 kids and also a vasectomy he can get over himself and just get the damn procedure done. Work part for me was I couldn't sleep on my side or stomach for a week. He'll be just fine. Twll to stop being a baby. NTA", "As another husband (of 25 yrs). I third this.\n\nNTA", "Ditto.  Same here. He's a real piece of work.", "Yeah..... I feel bad for this girl being groomed and sucked into this trainwreck. Like, why? Why as a 17yo would you want to be with anyone who already has kids? Why not have a fun as an adult? Why saddle yourself with all this responsibility?", "She was just 18 and he 21. She says it", "something tells me she doesnt want to say how old he is bc when u do the maths she was 17 when they married/ got together, and he already had children from a previous marriage, meaning he probably shoudnt have gone after a 17 year old\n\nalso OP if this is the case i feel sorry for you. NTA but your husband is, and you should prioritize your health over some asshole", "You shouldn’t count on a vasectomy to be reversible, but yeah, in this case the man already has children with two different women, he probably shouldn’t be wanting more. He’s a total AH, OP should prepare for a divorce.", "OP-- in the event your marriage is over, you have caused an addition/improvement to your life by way of subtraction!", "Your husband just showed you that his desire to use you as a breathing fleshlight is more important to him than your LIFE. \n\nIf he viewed you as an equal partner, he would NOT place the burden of BC only on you and he would care about the serious health repercussions that you’ve suffered. \n\nHis words and actions have shown you what he truly values…You have bigger issues here than just hypothetical accidental pregnancies.", "You were *17* when you got together with your husband and he already had children. His children are now adults. How old is this guy and what is he bringing to your life?? I'm the same age as you, and GIRL. You don't need any of this.", "Then he can ask his doctor for an anti anxiety drug to take when he has the procedure done. Same as someone with claustrophobia getting something to take the edge off when getting a MRI. Your husband is being selfish and uncaring of your health. You re NTA but he certainly is!", "Have you looked into tubal ligation for yourself?", "Good!! So that makes things a bit simpler.\n\n1. Use condoms every-time\n2. Vasectomy \n3. Other form of BC (not knowledgeable enough to know what to suggest for men - but if there is an approved pill on the market - awesome!) \n3. Sexless marriage \n4. Divorce \n\nSeems pretty straightforward. Call a serious meeting with ur medical records and have it out.", "I have became someone, I think it’s actually made me a better person and mother too my two youngest children, his ex left and didn’t want kids so we made the best of a tough situation but I wouldn’t change it. My issue is simply this point we seem to be stuck on which is not something that has ever happened to us in all of our years together", "What did your parents think?", "I got pregnant using a condom and hormonal birth controll. I know other people too where pregnancies like that happened. Forget to take the pill, taking other medication, ripped condom, etc.", "What is your husband's solution to this birth control conundrum?", "Look. You either choose your health or you choose the \"fun\" and you get pregnant again before you stop having children. \n\n\"But it's impractical for the next ten, twenty years\" then you stop having sex, because he expects you to deal with that since he won't do it.", "ugh, going to hear \"bUt It DoEsNT fEeL tHe SaMe!\" 🙄", "Idk why you had to stop birth control, but the copper IUD is very effective and does not use hormones. Talk to your doctor about any other options. Alternatively, you could just stop having sex with him.", "girl if u wanna be a twinkie that’s ok but homeboy gotta fix his shit before u let that happen. maybe be a toaster strudel for a while if condoms are “so bad and expensive”", "[removed]", "Then she should get the snipsnip. She cannot tell him what to do with his body. It's his body.", "She can't take birth control and neither of them want to use condoms. The only other option is for one of them to get snipped. She can't force him to, but depending on where they live he can prevent her from getting her tubes tied.       \n\nKeep in mind that she was 17 when they got together and he already had multiple children.", "Bro i think those tubes tied thing is just bad.  People here are all calling the guy selfish but what if he is actually scared. Tbh he donno for sure if his wife will be with him forever and even if it's not the case that procedure also had health complications.\nIn her case she is getting that madical treatment because she needs it but in his case he is being given warning to take a treatment with unhealthy bodily complications because his wife (which we donno how close they are) wants it or needs it", "Because you don’t want to get pregnant again and he doesn’t want a vasectomy.", "There isn’t too much downtime. Two days at most for me. I liked that it was a lot safer with regard to unwanted pregnancy. This was my personal choice, but for OP it could prevent a divorce.", "The person you replied to was just pointing out that a vasectomy isn’t the only option. IMO OP should discuss other potential options with her husband.", "I don't think you realize that surgical vasectomies are not just trivial easily reversible procedures.\n\nThere are many options.\n\nInstead of ranting to me (female) that I listed options other than condoms and a vasectomy, please list some non-chemical, non-surgical, non-hormonal options. \n\nOr even better, please feel free to invent more birth control measures that can be elected by men. You will be a millionaire very quickly as I'm sure the vast majority of men would like to have some safe options to regulate their own fertility without impacting the satisfaction of their sex life.", "The question OP is asking is \"AITA for calling my husband selfish?\"\n\nCoercing someone to have a surgical procedure by calling them selfish is an AH move. *If the genders were reversed* you would annihilate a poster who asked \"AITA for calling my wife selfish for refusing to get her tubes tied?\" \n\nThe NTA move would be to lay out all the options and then take away the options that aren't going to work for either of them and discuss whatever options (if any) remain. No coertion, no manipulation.\n\nNo, I'm not suggesting she consider getting her tubes tied. I'm suggesting that before she calls her partner selfish for not getting the procedure that she wants him to get she consider whether she would herself want a similar procedure, and whether there are other alternatives that would work.\n\nNo is a full sentence for women *and* men.\n\nEdit: ...and non-binary people", "[deleted]", "[deleted]", "There's always going to be outliers. I've always wore protection before I met my wife, and yes, I am extremely lucky and selective about whom I stuck. But I always made it a priority to be safe and responsible. Watching loved ones die from AIDS made me super vigilant about safe sex, No Glove, No Love. Grew up in the 80s and 90s when AIDs and other STDs were a problem", "Bearing in mind he had children from a previous marriage at that age, it sounds as if he does indeed like reproducing…", "I was a few weeks off 18 he was 21 the kids were 1 & 3 there is no great scandal in his age. I am putting my health first which is why we are at this stand still, i asked AITA to confirm if others agree I am justified to stand my ground on this as it’s not something I can easily discuss with those around me", "No not true. I would never get my tubes tied without seriously making sure I never wanted anymore kids ever. It’s his body and his life. Which includes you but also includes him.", "This right here. I can’t believe he’s not worried about the blood clots she can get with birth control. It’s just all about his pleasure and comfort.", "I have but on the scale of the situation it’s a lot more invasive and carries way more risks than a vasectomy.", "But you were a kid when you got with a man with kids. I know a little bit about growing up faster than needed. You definitely became someone in the sense that it worked with the role you took om. But you never became your own person without having to worry about anyone but yourself for a while.", "YOU WERE STILL A CHILD WHEN YOU STARTED DATING THIS MAN. Is this what you would want for your own daughter?", "Cautious but supportive of my decision, we’ve made it 19years so it  paid off until now", "Condoms, which I agree can be a short term solution but aren’t practical for the next 10-20 years", "It doesn't though... OP is NTA", "The copper IUD has some massive side effects and many women cant use it. It can also increase risks for ectopic pregnancy, which if OP can't get a termination would kill her.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "She can ask and he can refuse and she can end the marriage without another good option. None of that is telling him what to do with his body.\n\nAlso if she's having issues with her health than a massively invasive surgery is not recommended for her. \n\nA vasectomy is day surgery and usually only needs a local anesthic. Most mine are fine within a week.", "Actually, he does want to use condoms, OP is the one who doesn't want to, her reason? \" but they are expensive for long term use, and after this amount of time not using them sort of take some of the fun out of the situation\" I'm quoting her reply.", "I realize what they were doing. IUD, cervical cap, spermicide, sponges, tubal litigation. That’s. All. Her. Again. \n\nI would agree condoms are an option. But they have to be worn every time. Is that something her husband can do?", "Thank you! That is indeed what I was trying to say... i was also wondering if OP would be less frustrated by hubby's refusal to have a surgical vasectomy if she herself doesn't want to have a surgery to tie her tubes.\n\nIf they enjoy sex more together without a condom and OP cannot be physically well with hormonal birth control, and neither want surgery, there are still other options that could work!", "Reality is there aren't magic birth control options that are risk/side affect free.\n\nI'm sure OP knows very well all the options available to her.\n\nShe's asking her hubby to take responsibility for it now. It's crappy that vesectomy is the only option for him, but I'm sure the births and miscarriage and hormonal birth control weren't ideal for her either. It's a marriage, it's give and take.", "It doesn’t impact their sex drive/satisfaction in any way.", "As a ‘surgeon’ surely you should know the risks of birth control and clots….. so no that isn’t an option for me. Also after fertility treatment and pregnancy and birth why is it ok for me to have yet another medical procedure that carries risks but not my husband??", "Ah I assumed because you said they were the asshole and said them getting with an divorced man with children was a reason they were an asshole, at that age gap I 100% doubt she was in complete control of that", "I’m glad to hear there wasn’t an age gap component to factor in. I was worried there. \n\nHis attitude for a 39/40 year old man is very, being diplomatic, old fashioned  and old school / patriarchal / toxic masculinity. \n\nYour health is at risk. You have received medical instructions to cease hormonal birth control. He needs to take on the birth control aspect after you’ve carried it and dealt with the side effects and complications for nearly 20 years. \n\nHim petulantly refusing to undertake a simple procedure is selfish and, quite frankly, rude and dismissive of all you’ve had to do over the years. \n\nTime for an ultimatum. Make it simple. \n\nHe has an outpatient procedure and gets to have sex with you when cleared. \n\nOr he refuses to take his turn and doesn’t get to have sex with you. \n\nIn all this, you speak of him having a high sex drive. It actually doesn’t matter how high his is, as your consent and level desire is important. \n\nI hope he has a serious attitude adjustment and gets it sorted. You must be so sick of having to deal with this after all this time. \n\nDoctors don’t just tell you have to come off hormonal birth control for no reason. I hope you’re OK 🫶🏻", "Not a scandal, but definitely scuzzy of him.  He  impregnated another woman when he was 17 & had a 2nd pregnancy less than 2 years later. Learned nothing from the first conception, obviously. \n\nThen that relationship didn't work out & you, not yet  a legal adult, helped raise his kids. \n\n\nBased on this type of history, he really hasn't ever had to focus on being the better man to win you over & keep you well.  Now it's still all about him and HIS wants/needs.  There are men here telling you that he's the AH.  Believe them.  It's true.\n\n\nYou have done so much for him and he's showing you how unworthy he is of your esteem.  Your health matters so much more than his sex drive or fear of a vasectomy.   Stand your ground.\n\nNTA!", "Talk to your gynecologist about a bilateral salpingectomy.", "Look yes the age gap wasnt huge but the life gap is. He had children and had explored adult life for a few years. You must have been fresh out of high school.\n\nAlso it's a bit late to be warning you about this but any man who manages to get married, have 2 kids and divorce before the age of 21 is not stable (or shows shockingly bad decision making).\n\nI doubt this is the first time he's been this selfish, if you truly took stock of your relationship and weighed all the times you've put your needs and wants last compared to his I'd bet it wouldn't be even.\n\nYour health is a pretty serious thing to 'compromise' on and anyone who values your life would not ask you to.", "I don’t think you replied to the right comment here.", "I had a salpingectomy. It was a simple outpatient procedure with no complications. The anesthesiologist was out of network and came with a high bill, but the rest of the procedure was inexpensive.\n\nIf this husband was a keeper, I'd say the responsibility is on him to get the vasectomy, but he's not a keeper. So you have to make the choices for yourself as an individual, instead of for yourself as part of the partnership.", "If your goal is to protect your own body, it would be wise to get your tubes snipped. Make Sure that you are safe if you cant trust your husband to use condoms... i am doing IT myself next year and havent even considered getting my partner to have a vasectomy because this is a desicion about my body and Not his.", "It sounds like your choices are tubal ligation, condoms (which require his participation), or nothing. You're not going to change his mind on this. Take it into your own hands.", "What are your concerns about condoms?\n\nI would be upset with my partner in your situation, too. However, I don't think trying to force him to get surgery is going to get you anywhere.\n\n I would be worried about the failure rate of condoms and about his lack of concern about my health and well being.  I would resent how he is willing to let my body undergo significant risk and pain while he isnt  willing to take on any to protect me. Finally, I would struggle to be attracted to a person that behaved that way. These are valid points that are more specific and relevant than the practicality of condoms for long term use. I think you should discuss things like this with him fully before you revisit the topic of vasectomy vs condoms. \n\nI also think you should say what you are and are not willing to do. For example: you are not willing to risk your health with pregnancy or birth control. You are not willing to rely on condoms. Then ask him what he sees as a solution. If he only offers condoms as an option and insists that you are being irrational or unfair, then you know that there isn't really an option to move forward. Also, solve the problem for now, not for the next 10-20 years. If you are okay with condoms now, then accept that's what you will do for now. \n\nAll of this is better than giving him an ultimatum about a vasectomy.", "I'm sure it's still better than no sex though.", "It looks very much like she's telling him what to do. \n\nDoesn't matter it takes less or more time to heal, it's his body and his decision. If he wants to and does, that's good. But if he doesn't for anything reason or no reason at all, it's still valid.", "Okay you're right that she's the one who doesn't want to use condoms because of the cost. But she still doesn't get to decide what he does with his own body. She has other birth control options, she just doesn't want to use them.", "Fair enough. OP should ask him to wear a condom when they have sex if she hasn’t already. If he refuses to do that, OP should push for a vasectomy. It’s not like vasectomies are irreversible, either.", "I sympathize that she has had to shoulder the responsibility and side effects herself all this time. I would argue in favor of it being his turn to shoulder that responsibility. But re-check the question - AITA for calling my husband selfish for refusing to get a vasectomy?\n\nAre you really suggesting that, independent of gender status, it is acceptable to coerce and/or manipulate the partner into having a surgery? Trying to force a 'no' into a 'yes' by calling them selfish?\n\nReally? Are you?", "[deleted]", "[deleted]", "Points for resurrecting the word scuzzy! LOL. Child of the 80s?", "Or just get the procedure done and divorce anyway", "Actually there’s another option, no sex for him.\n\nOP already put her body through enough, it’s time for the husband to step up and be a man and take some of the weight off. She already mentioned that she’s had too many health scares, how much more does she need to put her body through? Why is it always her? It’s his darn turn, his choices should be - get the vasectomy or deal with a sexless marriage", "Sorry to clarify, I have tried to explain my position on all of the above regarding my health, including the risk of pregnancy and how although we decided several years ago we didn’t want any more children, I wouldn’t be able to undergo a termination should an accident occur due to the failure risks of condoms but even still the reply I get is well I don’t want one with no further explanation or justification as to why or something like its not my fault women get pregnant", "Is it? If my option was condoms or no sex with the asshole husband, I'd absolutely opt for no sex with the asshole husband.", "Sure but I dunno, I do agree with OP that it's not a great long term solution", "Is she trying to coerce him by calling him selfish or is it just a statement of fact?\n\nIt seems like he's putting his comfort over his partners health and has done for many years. That's inherently selfish.\n\nIt is something that they seem incompatible over and its not something that can be resolved by compromise. Ending the marriage at this point isn't coercive, it's just the logical thing to do.", "If All of your suggestions for resolution rely on me doing something and comments about my age getting with a divorced man with kids etc were aimed solely at me, and the main concern point is his possible pain what else am I meant to think?", "The_Ghost_Reborn\n•\n1 min. ago\nColo-rectal Surgeon [40]\nAs a ‘surgeon’\n\nIt’s sort of suggested there^^^", "I wasn’t? You just framed it badly? If you didn’t mean that then I apologise, but after reading it that’s what I assumed you meant", "Lol,  not exactly a kid then. A little older .  It just really fits this guy more than anything I can think of currently..\n\nOh - douchenozzle!", "I absolutely agree that it's his damn turn, *but he's not going to do that*. And do you think he's going to be fine with just not having sex for the next 20 years until she reaches menopause?        \n\nShe's been through a LOT medically, and he doesn't seem to care. Neither of them want to use condoms. Bodily autonomy still applies - she can't make him get surgery that he doesn't want to get. But if she can't do hormonal birth control, then her options are the copper IUD (non-hormonal), tubal ligation, or no sex. I'd be very surprised if he'd be okay with the no sex option.", "I'm sorry, OP. I really am. I think you know what this means. I think you shouldn't make it about the vasectomy if you end things though, make it clear that it is about his lack of care for your health. \n\nAnd I just can't with his statement that 'its not my fault that women get pregnant'. It literally is and would be his fault that one woman got pregnant, namely you. Who the hell else's fault is it?", ">the reply I get is well I don’t want one with no further explanation or justification as to why or something like its not my fault women get pregnant\n\nUh, if you don't have sex with him, you cannot get pregnant.  So it's definitely HIS fault that the woman (you) get pregnant! \n\n\n\nDamn, with his level of denial for any responsibility,  I wouldn't be surprised if he has been fixing to cheat on your marriage for months. When he gets the girl pregnant,  which she'll be around 19, he'll be putting the blame on you.  (Not that it is any of your fault at all).  \nHe's just that type of irresponsible selfish prick.", "[deleted]", "I’m new to Reddit I don’t know about ranks but hey if the shoe fits", "[deleted]", "No I was just agreeing with your comment not your rating", "That doesn't mean you are competent. And clearly you are not medically competent. So maybe don't proffer your ignorant bullshit."]}