{"id": 33605, "submission_id": "18ov9df", "title": "AITA for telling my friend she was being a “pick-me” girl and embarrassing herself?", "selftext": "I (22F) am part of a friend group whose families spend Christmas at a ski resort. We all met there as kids/teenagers and became good friends over the years. Among us is my friend “Amy,” who has developed a terrible habit of mocking other girls who aren’t very good at skiing. If it were just a passing comment here and there about how silly and impractical some gear can be, I wouldn’t mind it, but she’s incessant.\n\nEarlier today, when we were all together at après-ski, she started with her comments again: “That suit looks ridiculous, she’s never skied a day in her life, who wears a full face of makeup when skiing, etc.” Our guy friends were all laughing with her, but guess what? They were all trying their luck with the “bad, vain skiers” later on.\n\nShe was obviously not happy about it and tried to keep her rhetoric going in front of our new friends, but I pulled her aside and told her that she was embarrassing herself. At the end of the day, it doesn’t matter how much she badmouths those girls; the guys will always go for the full Bogner cute girl. Being a ‘pick me’ won’t help her\n\nAfter our talk she immediately left, and is now starting a big argument on our group chat.\n\nAITA?", "created_utc": 1703297782, "permalink": "/r/AmItheAsshole/comments/18ov9df/aita_for_telling_my_friend_she_was_being_a_pickme/", "score": 52, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I basically called out my friend Amy for constantly dissing other girls at our ski resort, telling her this attitude might be why she’s striking out with the guys. This might make me the asshole because I was pretty blunt and said it in front of others, which could’ve been embarrassing for her. I wanted to be honest, but I might have crossed a line and hurt her feelings more than I intended.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA because her mocking behaviour of others really instigated everything, but it doesn't sound like she is a good friend, so why keep her around?", "People like her are the reason others don’t want to try new things.", "Nta she needs to focus on bettering herself rather than being judgemental to others. Perhaps she has a crush on one of the guys who were there and tried a little too hard in the wrong way", "Back when, I had a friend who developed a habit of badmouthing people. I finally pulled her aside and asked her if she talked about me the same way. She dropped the habit.  Years later, she told me how much that meant to her that I called her on her bad behaviour that way. \n\nNTA", "NTA. No one likes a pick me. If you ain't a girls girl she truly gtfo.", "NTA though I think you could’ve phrased it in a different way. What sucks about this is that she’s mocking other girls, so ig that’s the thing I’d emphasize. But yeah you’re in the right.", "ESH. Amy for putting girls she doesn’t even know down and pretending she’s better than them, you for putting Amy down and reinforcing  sexist stereotypes (‘the guys will always go for the cute girl’), and most of all the guys who are… happy to mock these women but then feel fine to put moves on them? You both need better friends than each other, and you both REALLY need better guy friends.", "ESH but all in an age-appropriate way. Your friend sucks for trying to be entertaining by mocking strangers who are just here to enjoy themselves. You suck for mocking her back by invoking the misogynistic \"pick me girl\" garbage. \n\nNeither one of you will be like this in ten years, fortunately. Adulthood just isn't sitting comfortably yet; teen cruelty and the need to categorize and dismiss others is still full play.", "Anyone who uses “ pick me “ is a full blown AH", "Mild ESH because that's a pretty cringe insult and you sound like you're jealous of \"the full Bogner cute girls\" yourself, whatever the hell that means.", "YTA\n\nIn your explanation you said you told her that in front of others. That is something you tell someone in private. It would be very embarrassing to get called out like that. You’re NTA for telling her, but the way you worded it could have been a lot better and much less mean. If she really is your friend you should apologize and ask her why she does it in the first place. It’s probably because she _likes_ someone in your friend group.", "YTA for using the term \"pick me\". Please stop. You sound like you're a child.", "nothing wrong with pick-mes lol guys love em", "INFo: does she have floppies?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (22F) am part of a friend group whose families spend Christmas at a ski resort. We all met there as kids/teenagers and became good friends over the years. Among us is my friend “Amy,” who has developed a terrible habit of mocking other girls who aren’t very good at skiing. If it were just a passing comment here and there about how silly and impractical some gear can be, I wouldn’t mind it, but she’s incessant.\n\nEarlier today, when we were all together at après-ski, she started with her comments again: “That suit looks ridiculous, she’s never skied a day in her life, who wears a full face of makeup when skiing, etc.” Our guy friends were all laughing with her, but guess what? They were all trying their luck with the “bad, vain skiers” later on.\n\nShe was obviously not happy about it and tried to keep her rhetoric going in front of our new friends, but I pulled her aside and told her that she was embarrassing herself. At the end of the day, it doesn’t matter how much she badmouths those girls; the guys will always go for the full Bogner cute girl. Being a ‘pick me’ won’t help her\n\nAfter our talk she immediately left, and is now starting a big argument on our group chat.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "She wasn’t like this before, so I’m hoping it’s just a bad phase and she snaps out of it soon…", "THIS. I (28f) have never been skiing and always wanted to but I don’t want to get made fun of.", "as you judge others......", "Yes that is being a GOOD friend. Ones who will call you out on bad behavior.", "Bogner is a ski fashion brand.", "~~Actually, OP says they pulled their friend aside. So they’re NTA.~~\n\nETA: I didn’t read the judgement bot explanation😅", "Perhaps - it might be that this blow up is what ends it all, but it doesn't sound like a huge loss", "In their explanation for the judgment bot she says she said it in front of others. If it was indeed away from the others like in her main post then yes I agree. NTA", "Aha. Thanks for pointing that out😅 Honestly, I still say NTA, it isn’t cool for the friend to look down on people and be spiteful about them, which she did in public. But at the same time, if I truly cared about my friend I would pull them to one side, so maybe ESH?"]}