{"id": 33753, "submission_id": "18r4g4n", "title": "AITA for potentially ruining my boyfriend's relationship with his best friend?", "selftext": "This is kind of a long story but I'll try to keep it simple. \n\nMe (27F) and my bf (28M) have been together for 3 years now and when we first started dating he had a very strong relationship with his best friend (let's call her Sarah). He trusted her so much, always went to her for advice or just chill, and my bf doesn't have too many friends because he's not from this country (he came to live here around 6 years ago) and he's very selective with people he wants in his life too. At this point everything was fine, I've met Sarah a few times and we were not close but I liked her and she is a nice person as far as I know. My bf would even go to her house to party etc and stay there for the night when he was drunk (I'm not the jealous kind of person so this didn't bother me at all). The thing is that Sarah has a sister who lives with her, which I met before knowing they were siblings because we went to the same places and we had some friends in common. She's a nice person too. \n\nThe problem began a year after when I was talking to my bf and it came up to the conversation that when he first moved in to the country he shared a house with three more roommates (all girls) and one of them was Sarah's sister, then he told me he had a big crush on one of them but that eventually she rejected him but some things happened between them before the rejection (like sexual stuff). This surprised me and even more when I asked who that was and he said it was Sarah's sister. After that I didn't feel comfortable knowing that he still went to their house tons of times, and even slept there on the same bed with both of them when he stayed!!!\n\nI tried to not make a big deal out of it, since this happened a long time before we knew each other and we really had a very good relationship but I couldn't help feeling a bit worried every time he told me he was going to their house, so I talked to him about his and he said he didn't mind loose Sarah sister's friendship because he didn't feel anything for her anymore and he wanted to be with me and he cut that relationship off. He stopped going to their house too much and tried to just meet with Sarah when her sister was not around but this eventually came up between them and he had to tell Sarah all that happened between him and his sister (which Sarah didn't know). After that Sarah started to take some distance from him and eventually stopped talking to him at all. \n\nIt's been a while but sometimes my bf tells me he misses his best friend, and I can't help feel guilty because this would've never happened if I kept it to myself.\n\nAITA for telling him how I felt and kind of ruined his frienship?\n\nEDIT: Some ppl are telling me I'm the AH for persuading him into cutting off the relationship with Sarah's sister. Well, I didn't. I even told him that it was not necessary to stop hanging with them, I just asked him not to stay at night if possible, that I could go pick him up if he didn't feel like he could drive and he came up with cutting off the relationship with the sister.\n\nPs. Some other ppl say I did this cuz I was insecure that he liked her. My bf has another girl bestie that he liked in the past, nothing happened at all between them and I'm totally fine with that relationship, I like her, we get along well and hang out sometimes too. What made me insecure was that something actually happened between him and Sarah's sister, not that he liked her before. ", "created_utc": 1703583009, "permalink": "/r/AmItheAsshole/comments/18r4g4n/aita_for_potentially_ruining_my_boyfriends/", "score": 374, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1 I might have ruined my boyfriend's relationship with his best friend\n2 I got insecure cuz once he had something with his best friend's sister and I made him cut that relationship off which made his best friend eventually stop talking to him. He just have a couple of friends cuz he's from another country and I just might have taken one of the very important ones out for maybe no justifiable reason\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta he fooled around with her sister and she clearly feels weird about that. That's not your doing.", "nta he didn’t tell sarah at first bc he knew it would affect their friendship, its his fault for hiding it", "NTA, your request wasn’t what ended the friendship, the secret did. Even if you never said anything at all to your bf, if his friend found out from her sister or some other way, the outcome would have been the same.\n\nThe friendship was on a timer once he slept with the sister, and hid it from his friend.", "YTA he's friends with his ex, that's all. That's a good sign he's not an arsehole. \n\nIt's a bit odd neither told her sister, but still no reason to do all this shit.", "YTA. So you caused your bf to loose one of his only friends because he had a crush on the sister, a crush that wasn't even reciprocated, before he met you. And he even said he didn't mind loosing the friendship so wtf are you upset about.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis is kind of a long story but I'll try to keep it simple. \n\nMe (27F) and my bf (28M) have been together for 3 years now and when we first started dating he had a very strong relationship with his best friend (let's call Sarah). He trusted her so much, always went to her for advice or just chill, and my bf doesn't have too many friends because he's not from this country (he came to live here around 6 years ago) and he's very selective with people he wants in his life too. At this point everything was fine, I've met Sarah a few times and we were not close but I liked her and she is a nice person as far as I know. My bf would even go to her house to party etc and stay there for the night when he was drunk (I'm not the jealous kind of person so this didn't bother me at all). The thing is that Sarah has a sister who lives with her, which I met before knowing they were siblings because we went to the same places and we had some friends in common. She's a nice person too. \n\nThe problem began a year after when I was talking to my bf and it came up to the conversation that when he first moved in to the country he shared a house with three more roommates (all girls) and one of them was Sarah's sister, then he told me he had a big crush on one of them but that eventually she rejected him but some things happened between them before the rejection (like sexual stuff). This surprised me and even more when I asked who that was and he said it was Sarah's sister. After that I didn't feel comfortable knowing that he still went to their house tons of times, and even slept there on the same bed with both of them when he stayed!!!\n\nI tried to not make a big deal out of it, since this happened a long time before we knew each other and we really had a very good relationship but I couldn't help feeling a bit worried every time he told me he was going to their house, so I talked to him about his and he said he didn't mind loose Sarah sister's friendship because he didn't feel anything for her anymore and he wanted to be with me and he cut that relationship off. He stopped going to their house too much and tried to just meet with Sarah when her sister was not around but this eventually came up between them and he had to tell Sarah all that happened between him and his sister (which Sarah didn't know). After that Sarah started to take some distance from him and eventually stopped talking to him at all. \n\nIt's been a while but sometimes my bf tells me he misses her best friend, and I can't help feel guilty because this would've never happened if I kept it to myself.\n\nAITA for telling him how I felt and kind of ruined his frienship?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Op you are infact quite a jealous person. Time to admit that. \n\nNow a conversation is needed here but you have no right to ask him to cut his friend off. You do have every right to understand a lot more about his recent interactions with the sister.", "It’s too early for my judgement.\nSomeone else take this one.", "NAH and I feel everyone involved acted maturely given the situation and circumstance. \n\n1. Your BF had sexual history with his best friends sister, who are close and live with each other.\n\n2. Once you learned of this history, you became uncomfortable with the situation and informed your BF.\n\n3. He acted accordingly and responded to this in kind, while having to inform his best friend of the new situation and how you are now uncomfortable with him hanging out with someone who he had sex with.\n\n4. I don't like making assumptions, but I am guessing best friend understood this, but the person he now has to avoid is her sister. She may feel like she has to choose between them and chose her sister over your BF.\n\nEven though he lost a best friend, he has shown that he is committed to the relationship, and I hope you realize that and express your gratitude to him. Things happen, and people come and go from our lives, but sometimes it's not easy to choose one person over another.", "NTA Sarah had a crush on your boyfriend and she is upset that her sister got there first. It’s probably best that these people fade out if you two are serious.", "NTA\n\nYou told him how you felt and he made his own choices after that.", "NAH", "NAH. He did what was right for you and the relationship. You did nothing wrong. Sara probably is upset they hooked up and kept it from her. That's on the sister and him. \n\nYou didn't ruin anything. Let it all be.", "NTA and I think everyone handled this maturely except perhaps the sleeping in the same bed part, that was weird.", "NAH. It is your boyfriend and Sarah who made this decision. If Sarah felt they have to choose between her sister and your boyfriend, it is normal she choose your sister. And nothing espectacularly bad seemed to happen, but them began to distance themselves, which is normal if you take into account that the sister is the roommates, is going to be difficult to find a time where she is not around to meet (especially given that more probably all of them have jobs, studies, other friends, maybe Sarah is with someone, too). So nobody is the asshole, just a sad situation overall, as nothing would have had changed if he hadn't had a random hook up with Sarah's sister in the past (it seems it wasn't nothing meaningful, after all).", "It's not your fault. She probably made the decision on her own. If I was her I would feel really grossed out learning my best friend slept with my sister and we have all since shared a bed multiple times. And they hid it from me for years. You were probably a factor in her backing off, but not the only one.", "NAH it’s not your fault that his friend distanced herself. She may have done that for many reasons.\n\nYou asking him to have less contact with the sister is absolutely normal, and I’m happy that he reacted like an adult and you both reached an understanding. If Sarah wanted to keep in touch with him, she easily could’ve. You cannot be blamed for that.", "A little TMI never hurt anyone, until it did. \n\nBut seriously, how do you recover from a \"I hooked up with your sister\" conversation? Asking for a friend.", "NTA he actually really needed to cut off the sister. And sometimes friendships just grow apart. Sarah clearly wasn’t comfortable with his sexual history with her sister and that’s not your fault at all.", "What does poo mode activated mean?", "NTA. \n\nBoyfriend was holding that secret in by not telling Sarah. I'm guessing if it came out under other circumstances the same situation (Sarah distancing) would have come about.", "Nta, he lost his friend Sarah, because he kept the happenings with her sister a secret from her.  I think you might have misunderstood and taken guilt that isn't yours to begin with.  This loss is solely on your bf's shoulders.", "NAH, you had every right to feel uncomfortable with the situation and he willingly cut the relationship off, and so did Sarah once she learned what happened. The friendship would've been off as soon as it came to light anyway which it eventually would've done. No need to feel guilty OP, it was bound to happen.", "\"Even slept there on the same bed with both of them\"....Ummm excuse me? \n\nThe whole friendship is inappropriate for a man who's supposedly in a committed 3 yrs relationship. I can't believe you were even ok with *this* ⬆️. Nta", "NTA but i generally see it as a major red flag if someone insists their bestest friend ever is of the gender they are predominantly attracted to. It’s good he was willing to distance himself from it but just in general, it shows a lack of ability to meaningfully connect with someone of their own gender, which will spill over into other areas. If someone of the opposite gender is your “best friend”, you’re in denial about what you really want out of the relationship. You should marry someone who is your best friend if they are the gender you’d prefer to sleep with. Otherwise, a shoulder to cry on easily becomes…well I’m sure most of Reddit knows how that sentence ends.", "NTA.  Sounds like Sarah felt like she had to choose between your bf and her sister, who's her roommate, and she chose her sister. You feel like you feel, and there was no reason not to share that with your bf. \n\nWeird though that Sarah was his best friend and she didn't know that he slept with her sister. They were all roommates and that's a big secret to keep. Unless there's more to the bf/Sarah thing than OP is aware of.", "They slept together. I definitely think would count that as enough reciprocation even if they stopped", "How did she cause any of this?", "Where did she ask him to cut his friend off?", "So...you didn't bother to read the post and came right to the comments for...negativity's sake.", "She can feel uncomfortable, if he was spending the night at his old crush’s place (whom he had slept with previously). That’s not being insecure, it’s absolutely normal.\n\nShe didn’t ask him to cut his friend off, it was just the sister. The friend in question made her own choice in this situation, and OP cannot be responsible for that. I think that everyone involved behaved quite maturely.", "You missed were Sara didn't know her sister and best friend had hooked up, that's probably playing a bigger role in the failing friendship than anything op did", "I agree with all of this.", "It’s a good summary but she doesn’t have to show gratitude because he chose to prioritize his partner. That’s pretty basic. She can certainly express that she felt heard, and feels that trust is anchored.", "This is very much an \"eye of the beholder\" situation. OP pointed out that she knows and trusts Sara, and isn't the jealous type. Until she knew about the prior crush/relations with the sister Op felt largely the same about her too.\n\nNo, the friendship isn't automatically \"inappropriate\"; the sleeping over part contextually might be based on OP's comfort level.\n\nI've slept platonically in the same bed as female friends while drunk as a young man in my 20s. As a married man in 40s, obviously I do not put myself in that kind of situation. I'd say personally Op's bf is at that transition point in his life - which he appears to recognize since he willingly made the right choices about this situation.\n\nNAH.", "Don't project your insecurities onto others.  Just because you aren't capable of being an adult doesn't mean that others aren't.", "Your comment is full of nasty ick.", "If you can't be friends with someone with the opposite gender because you will want to have sex with them, that's a you problem. Don't apply to it as a norm to anyone else, most ppl have a healthy relationship with the opposite gender", ">but i generally see it as a major red flag if someone insists their bestest friend ever is of the gender they are predominantly attracted to. \n\nGuess bisexuals can't have friends, and I can't have male friends because I'm gay. \n\nIf **you** are unable to keep things platonic, that's **your** problem and **you** should figure out why that is. Plenty of us can have friendships with people of the gender we're attracted to, without catching feelings or wanting to be with them. \n\nWork on yourself.", "This is some real old misogyny rhetoric, but then you do have trad in your username. Bit sad really, your restrictive view on the world.", "This is bizarre. \n\nHow does having a different gender best friend imply they can't connect with same gender people? Just cause I'm best friends with a bloke, doesn't mean I don't have women friends. That's mental. \n\nAlso, so much for queer people, eh? Pan and bi  people just can't have best friends?", "Where in this does an outcome exist that the bf and his best friends relationship is unaffected?\n\nI'm stating she has no right to ask for that before it is even a question in her mind.", "Except the part where op thinks she isn't jealous. \n\nThere is nothing wrong with how she felt, there is something wrong with denying that feeling exists", "Right? That should be the choice in this scenario lol", "Gee thanks. I'll keep this very sober advice for the future.\n\nYou could have just referenced my actual comment and argued *that* instead of hurling personal insults about my character, which you are not personally familiar with. Merry christmas.", "As someone who's pansexual. It sounds very restrictive", "That was quite the word salad.  I'm sorry that you couldn't comprehend that my words were in response to your comment.  Keep on projecting.", "Me too buddy. Heteronormative post of the day.", "NAH", "NAH", "NAH\n\nSarah is most likely taking distance because BF never told her he slept with her sister.", "I'm going to go with YTA. As others have said, you were the wedge in their relationship and now he lost his BFF because you were uncomfortable that he was intimate with his friend's sister in the past. This was the result of that, and it was pretty much the same as if you had asked him not to spend alone time with Sarah's sister.", "NAH. Although I know plenty of people have have remained good friends not only with their exes, but past flings, and there's nothing underneath the surface (but then again it might be a cultural thing), it's perfectly normal to feel uncomfortable as well given their intimacy. \n\nYou communicated. He listened and chose to distance himself. Sarah chose to do the same. Sometimes friendships do not survive change or a shift in dynamics. If he's the one to go to their house regularly, then he's the one making the effort. When that stopped, the friendship lost momentum.", "Nta honey, your bf has feelings for another woman. He's dating you because you didn't reject him and he's hoping it pushes his crush to reciprocate. Salvage what little dignity and self respect you have left and break up with him. You'd be doing both of you a favor.", "NTA part of being in a committed relationship is protecting the relationship - not putting yourself in morally ambigious situations that risk weakenig the relationship. Sharing a bed with another women us seriously pushing it IMO. Bbf is upset he did stuff with sister and then hid it, which also isnt on you.", "NAH, it's great that you spoke up and great that he listened and set boundaries to not cause any further issues. Don't feel guilty. Friends drift apart sometimes when they are in different places of life.", "YTA. People will say you aren’t and you handled things maturely. The mature part is true.\n\nBut the fact remains that you are indeed the wedge that separated your bf from his bf. Your insecurities got the best of you, and you allowed those to interfere with a previous relationship. \n\nPeople will say, well it’s your BF and it makes sense. Well your bf isn’t property and nothing was wrong. \n\nYour actions ruined his relationships with others. That’s just a fact.", "Against the grain here. YTA. You could have just kept it at limiting his time around the other girl. But it seems in your post it caused him to drop her and the Best friend off completely. \n\nSort of selfish", "This is one of those cases where it seems like everyone did the correct, mature and normal thing.  NTA.  No one sucks here.", "NAH- you did not cause this.  Whenever someone has a adult relationship, they disclose their history.\n\nHis friend didn't know that he had activities with her sister.  \n\nThat is why there's distance.  That would have been there had it been any other person in the relationship with your boyfriend.", "YTA. you aired someone else's dirty laundry. This info was told to you in trust and in no way was impeding on either relationship but you felt it needed to be said.", "Wondering the same thing. I assumed it would be if op was universally judged TA but that’s clearly not the case", "Uncomfortable about what? A previous relationship? If nothing is currently happening between the bf and the sister, there is no foul.\n\nPeople are aloud to have friendships with previous relationships. Come to find out that quite normal. \n\nIt was not bound to happen either, that’s a blanket statement to make yourself feel better and is fiction.", "No, he is doing things right now, but the bf was the AH by hiding his history with the sister from both Sarah and his gf. He would never have been in this situation if he hadn't done that. \n\nI'm not one who thinks you owe your current partner a complete rundown of your entire sexual history, but when you are going over to their house all the time? Sleeping in their bed with them?? Not cool, not cool at all. And Sarah clearly felt betrayed by not knowing this, too. She's probably wondering if OP's bf was only coming over to try to get to her sister. And I'm sure is equally angry at her sister for not telling her.", "Bingo, the gf is the catalyst and wedge.", "TBH, it is a really weird feeling to find out that your best friend fooled around with your sister.  It takes a little while to wrap one’s head around it, even if it is in the past.  Uh, or so I’ve heard………..", "read the first post - it tells about what it is. It just means that it is limited on who can post.", "Yes a previous relationship. Imagine if your significant other was staying at their ex’s house, even if there’s no foul play. OP has every reason to feel uncomfortable with it.\n\nLet’s not forget that BF cut off the friendship WILLINGLY, because you make it out like OP had a knife to their throat. \n\nAnd yes it was bound to happen as the friendship would’ve been over as soon as Sarah was informed anyway.", "Personally I understood that as \"he's shown, that this is relationship he's committed to, and it would suck if he was to i.e. propose to her and then learn she never intended it to be like that\"\n\nI'm not saying that it is the case or that they have to marry etc. Just that learning that commitment level is different sucks much more if one side already made serious sacrifices for relationship", "Oh got it, thank you! I’m still new to Reddit. ☺️", "Knife to throat? Dramatic much? \n\nThe BF was persuaded, and that’s just a fact. \n\nShe could have asked him not to stay the night and that would have been very logical. There are many avenues that could have been explored.\n\nOP is feeling guilty because the worst case scenario played out.", "She never asked it.", "Who’s denying this? This doesn’t change the fact there is NAH", "And yet here they are. \n\nShe created a situation where it was almost inevitable. \n\nI wonder how op would react to this happening in reverse. \n\nI also wonder how her bf will do with even less friends and basically no support system left other than op.", "Like I'm not one to talk, I'm the first to call someone stupid if they are being so - but you most certainly did add in a personal attack in your comment, even if you were responding to his comment; those two things aren't mutually exclusive.  \n\n\nI'm an asshole too, but I'm not delusional about being one. Unfortunately for you, you seem to be one of the delusional ones.", "Where did she demand the bf cut his friend off?", "The suddenly uncomfortable for him to spend any time with the sister, in a round about way does exactly that. \n\nAnd both you and op know this. \n\nIf the guy had his family and lots of friends it would not be such an issue. \n\nIf op really cares about her bf she needs to help him find ways to stall have a relationship with his best friend. Remember he has no one else other than op.", "No, it doesn't. If the friend cut him out that's on her, and him for sleeping with the sister in the first place. You are putting together a conspiracy wall in an attempt to blame op, and are looking idiotic.", "You are NTA my friend. He was the AH to some extent for keeping things from Sarah, his bestie. It had very little to do with you. He was being respectful of you by avoiding Sarah's sister, as he should have been, but it's not your fault that Sarah reacted the way she did. You can't control how other people react. Give him sympathy when he says he misses her, give him hugs, and let him know it's her loss, truly, and that he did nothing wrong. You are the epitome of an understanding girlfriend to have EVER let him stay over there with Sarah and other women that may have also been there at the time; that would be a no way from me for my husband.   \n\n\nIt's okay you felt insecure on this one. And it's not your fault Sarah stopped calling,", "Dude wasn't even honest with his friend about his relationship with sister.", "NTA because you didn't ruin anything and the people mad at you are just mad their boyfriends would never do anything like this for them lmao", "Your BF messed around (sexually) with his best friend's sister.\n\nBoth parties were adults and everything was done in consent.\n\nBUT HE NEVER TOLD HIS FRIEND.\n\n*<he had to tell Sarah all that happened between him and his sister (which Sarah didn't know). After that Sarah started to take some distance from him and eventually stopped talking to him at all.>*\n\nYou've got nothing to do with Sarah distancing herself. Your BF withold important information from her regarding him and her sister. And that didn't sit well with Sarah.\n\nNTA", "So, you don't comprehend words either.  Okay.  Good for you.", ">Don't project your insecurities onto others.  Just because you aren't capable of being an adult doesn't mean that others aren't.\n\nYou   \n1. Said they are not capable of being an adult. (This is a personal attack).\n\n2. You said their opinion is based of insecurities that they have that they are projecting. (also a personal attack)  \n\n\nYou don't even comprehend your own words. You are both delusional and a little dense in the head. Tough combo"]}