{"id": 33823, "submission_id": "18ro5i4", "title": "AITA for telling my boyfriend there is a reason he is alone and no one likes him after he spent the entire weekend insulting me?", "selftext": "My boyfriend (33M) is estranged from his family and doesn’t have any friends. When we met it set off a few red flags but he seemed like a genuinely good guy and I chalked it up to him just being a loner.\n\nOver the next 2 years he was great 95% of the time and in that 5% he was like a completely different person. Mean, nasty, cruel and just overall a horrible person. He would call me slurs, fat, ugly and other things to the point where I would mentally shut down. Then he would come to me and do everything he could to make me feel better. \n\nSo this past weekend was one of the 5%, I think he is angry that his family excludes him but would never say it. He badmouths them all the time, to the point where it becomes exhausting. So as he was badmouthing them, he said something like at least when his grandma dies and he gets his inheritance he will never have to deal with them again. I told him that was a horrible thing to say to which he said that he cares more about the money than any one in his family except for his parents. That’s when I told him he is fucked in the head.\n\nHe spent the next 48 hours berating me, calling me every name you can think of. Texting me nonstop while I was with my family and just being hurtful. Yesterday I texted him Merry Christmas and he responded with a “suck a dick”.\n\nIdk why but that made me madder than at any other point so I told him he is a miserable hateful person and it’s no wonder no one likes him he has no real qualities except for his looks and money. He is a disgustingly shallow human being and will grow old and die alone and no one will give a fuck. \n\nHe replied with lol. And that was that. He’s still my boyfriend and my friend said I was an asshole and went too far. I’m not sure if I am or not.", "created_utc": 1703640558, "permalink": "/r/AmItheAsshole/comments/18ro5i4/aita_for_telling_my_boyfriend_there_is_a_reason/", "score": 1047, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be an asshole because I may have gone too far and genuinely hurt his feelings\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but come on, WHY is he STILL your boyfriend? Do you think this is going to get better? Because it's not. You're right, there IS a reason he's alone, and you should be adding yourself to the list of people putting distance between yourself and that lunatic.", "Gain self respect - lose him!", "NTA.\n\nBut run. Run now. Get out.", "Dump him", "NTA \n\n\n\nYou sound like you are in the cycle of abuse. “The cycle of abuse often goes through four main stages: tension, incident, reconciliation, and calm. Abusive behaviors may escalate from cycle to cycle, although this isn’t always the case.” \n\nhttps://psychcentral.com/health/cycle-of-abuse#stages-of-the-cycle-of-abuse\n\nRead this book on pdf form about abusive men. \n\n“Lundy Bancroft’s Why Does He Do That? is a guide to how abusive men think, explaining the motivation and logic behind domestic abuse so that victims can better defend themselves against it. Bancroft draws on his years of experience as a counselor working with abusive men to shed light on how they deliberately confuse, manipulate, and intimidate their victims to get what they want. Ultimately, Bancroft hopes that readers will use his book to better assert their own humanity and independence, either leaving the relationship or demanding that their partner take responsibility for and change his abusive behavior.\n\nThis guide will break down Bancroft’s insights into the motivations and justifications behind abusive behavior and supplement them with the work of other abuse advocates writing since the book’s publication in 2002. We’ll also provide updated statistics and compare domestic abuse to other forms of violence.”\n\nhttps://archive.org/download/LundyWhyDoesHeDoThat/Lundy_Why-does-he-do-that.pdf\n\nAlso your response sounds like reactive abuse. \n\n“”Reactive abuse” is when a perpetrator of abuse deliberately triggers their partner into reacting to their abusive behavior aggressively. Abusive partners may use this manipulative tactic to shift blame away from themselves by claiming that the abuse is two-sided.” \n\nhttps://www.charliehealth.com/post/what-is-reactive-abuse#:~:text=“Reactive%20abuse”%20is%20when%20a,the%20abuse%20is%20two%2Dsided.\n\nIf you break up with him DO NOT for any reason go and see him alone. His behaviour can escalate as at that time he won’t have anything else to lose.", "NTA to him. YTA to yourself. Sorry lady but you are taking a risk there, what will you do when 5% turns to 10%? And 15%?", "This person is showing you who he really is during that 5% of the time. Pay attention to the red flags he's waving in your face when his guard is down. Get away from this guy and stay safe. NTA.", "You didn’t go far enough. Dump the psycho boyfriend and run very far away.", "Get out of this toxic relationship.", "I don’t feel sorry for people who stay in relationships like this. You don’t like it? Leave. Don’t come here and complain.", "You're definitely NTA, and you don't have to put up with it. \n\nIf you genuinely want a future with this guy, which sure is complicated and I doubt anyone here will encourage it, then he needs to get to a psychologist. It sounds like he might have BPD, or some form of personality disorder, and a whole bunch of associative trauma. Which, again, you don't have to put up with. But he needs to get on top of it.", "YTA for staying with an abuser. \n\nYou know no abuse is 100% of the time right because your self esteem would have to be through the floor to stick around for that. There has to be chinks of light for the victim to aim for. \n\nYou’ve already got some brilliant advice here. So I’m just going to use my favourite analogy. \n\nIf you knew a slice of cake had 5% shit in it, would you still eat it?", "[removed]", "run, don't walk.", "5% of the time being an awful human is 5% too much. \n\nPersonally I would never consider being with someone who acted like that even 1% of the time. The fact that it's recurring means he is actually always like that and just hides it most of the time\n\nHe doesn't sound like a good partner and I would not recommend staying in the relationship", "8 billion people in the world and you chose to **continue** dating a (in your own words) \"miserable hateful person\" with \"no real qualities except for his looks and money\". ESH", ">He’s still my boyfriend\n\n...WHY??\n\n&#x200B;\n\nEdited to add judgement: NTA, but break up with him, srsly.", "Don't do this anymore. This boyfriend is mentally ill and abusive. You need to leave him and figure out why you think this is acceptable for yourself. I'm in the middle of divorcing after 21 years of marriage to somebody with the exact same qualities. I'm having to start over with two kids and it is a fucking nightmare. NTA, but you have got to leave and not deal with this anymore. Don't be me.", "Why on earth does he think he's getting anything from an inheritance when he's estranged from his family?", "“He’s still my boyfriend.” Jesus, NTA but I hope you actually wake up and learn you deserve better.", "You're not an AH. YOU'RE AN IDIOT!  He won't die alone because you continue to take his abuse.\n\nSeek help; you are in desperate need of it.", "I cannot believe that you're still calling this hateful person your boyfriend. Are you that hard up for a boyfriend that you can't get another one? Why are you putting up with this hateful person that calls you slurs, names, insults you etc. That's not love. Something is wrong with both you and him", "NTA\n\nAbuse is abuse, 5% or 50%. Get out of there, NOW. What you said was the truth. There really is a reason EVERYONE avoids him.", "I mean, it sounds like you were telling the truth, so NTA in my opinion.\n\nPlease leave him. His behavior will not improve. You can’t change him. You deserve better.", "INFO: how old are you?", "You're NTA for what you said. But you are DEFINITELY the AH for staying with him. One day if you have kids would you tolerate that 5% of bad around your kid? When the kid mistakenly spills juice or breaks a glass at that 5% bad comes out breaking that little persons spirit? Him calling the kid stupid and idiot? Or when he berates you calling you fat, stupid and ugly in front of the child and continuing the cycle of abuse?\n\nYou're NTA for standing up for yourself and for expressing your feelings but get out of there. YWBTA for staying in a relationship where you're not valued and treated with respect.", "Whatever reason you have for continuing to be in this \"relationship\" after this, where \\*you\\* told him that:\n\n&#x200B;\n\n>he is a miserable hateful person and it’s no wonder no one likes him he has no real qualities except for his looks and money. He is a disgustingly shallow human being and will grow old and die alone and no one will give a fuck.\n\nMy god.\n\nYTA. He is as well. \n\nI don't understand the Why of your attachment (maybe the money and looks which you mention? But still UGH).\n\nYou are both terrible folks.", "NTA. Your boyfriend is an abusive AH. Your friend is an AH. You deserve better. I hope you find better people to surround yourself with.", "He's 33...how old are you.....\n\n\nYou also need new friends.  \nThis sounds  insane", "NTA, he is psychologically abusing you to cover for his own pain. Pretty narcissistic attitude he has and he truly is a sociopath.", ">He’s still my boyfriend \n\nOkay but why??? Why are you still with this poor excuse of a man??", "Why are you with this man? Read what you wrote again. Read all those texts and emails from this weekend again. NTA for now but if you decide to stay with this toxic, narcissist man in 2024 then you will become  T A to yourself for staying.", "YTA... to yourself. What are you getting out of this relationship? It sounds like you may be experiencing some financial abuse in addition to the heaps of verbal and emotional abuse. Make it easy on yourself, break it off with this bully.", "NTA. You just stated a fact.", "Run, honey, run", "I'm going to speak from experience that 90% he won't change.  Both of my mothers (first is my sperm donor) husband's were exactly like this.  And, it will only get worse as they age.  These are self centered human beings and he will not stop this behavior until you are broken and the woman HE wants you to be for him.  Try therapy first, by all means, but please have a backup plan, for your own well being.", "NTA but if he's only abusive 5% of the time...he's still abusive. You're in an abusive relationship. Please get out before it gets worse.", "NTA\n\nWhy are you still even considering being with this abusive asshole? You should have dumped him yesterday.", "Why are you with this guy he sounds terrible? ESH. He sucks just... In general. Him being terrible 5% of the time means he sucks at least once a month, if not more. \n\nThe only reason I would say ESH is your boyfriend was venting and you decided to talk down to him. He sounds terrible but I don't get why you decided to start that fight with him.", "Are you waiting for the inheritance too? I can't fathom why you would put up with even one percent of his tantrums.", "Nta for what you said. However, Yta for still being with your boyfriend and friends with the friend. Verbal abuse is still abuse you know", "ESH - You for still dating this person. You underestimated the 5% bad.", "ESH. If both of you still want to remain in the relationship (since you said he's only a dick about 5% of the time), you might want to look into therapy. Dude's got some issues that need resolving.\n\nFrankly, if my boyfriend told me to \"suck a dick,\" it'd guarantee he **never** got oral (or more) from me, at all, until he could offer a real apology.", "How little respect do you have for yourself that you ARE STILL WITH HIM. Obviously NTA but girl please leave the sorry, lonely, angry, fucked in the head man. And I mean, your friend is not wrong you shouldn’t be saying that your boyfriend, you should be saying that to your EX BOYFRIEND.", "You need to break this relationship off. You get nothing out of this. Don’t want any future children to suffer the mass amount of hatred he flings. NTA but you would be if you continue this relationship.", "NTA but anyone who spends 2 minutes insulting you, much less 2 days, doesn’t need a boyfriend title.", "You’re the AH - to yourself.  You’re doing what most victims of abuse do when their abuser is their significant other.  You’re practically textbook - explaining how wonderful he is 95% of the time & how he’s an abusive monster the other 5% of the time.  You need to take a serious look within yourself & decide when you’re staying with a man who is abusive - even “just” 5% of the time.", "Idk about the other fights but this one sounds provoked. He was venting, and u were mean lol esh", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend (33M) is estranged from his family and doesn’t have any friends. When we met it set off a few red flags but he seemed like a genuinely good guy and I chalked it up to him just being a loner.\n\nOver the next 2 years he was great 95% of the time and in that 5% he was like a completely different person. Mean, nasty, cruel and just overall a horrible person. He would call me slurs, fat, ugly and other things to the point where I would mentally shut down. Then he would come to me and do everything he could to make me feel better. \n\nSo this past weekend was one of the 5%, I think he is angry that his family excludes him but would never say it. He badmouths them all the time, to the point where it becomes exhausting. So as he was badmouthing them, he said something like at least when his grandma dies and he gets his inheritance he will never have to deal with them again. I told him that was a horrible thing to say to which he said that he cares more about the money than any one in his family except for his parents. That’s when I told him he is fucked in the head.\n\nHe spent the next 48 hours berating me, calling me every name you can think of. Texting me nonstop while I was with my family and just being hurtful. Yesterday I texted him Merry Christmas and he responded with a “suck a dick”.\n\nIdk why but that made me madder than at any other point so I told him he is a miserable hateful person and it’s no wonder no one likes him he has no real qualities except for his looks and money. He is a disgustingly shallow human being and will grow old and die alone and no one will give a fuck. \n\nHe replied with lol. And that was that. He’s still my boyfriend and my friend said I was an asshole and went too far. I’m not sure if I am or not.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but YTA to yourself if you don't dump his ass yesterday. You can do so much better", "NTA but why is he still your boyfriend?", "NTA. Your comment to him about why he is alone was totally spot on. It’s an uncomfortable truth that he needed to hear. For your own mental health, you need to re-evaluate whether you want to be with him. Do you see yourself growing old with him? Would you want any future kids to have him as a father?", "Well that’s rude. I’m estranged from my family and I have no friends because I have a lot of childhood trauma. Not a single partner I’ve had has ever thought this is a red flag. Try living my life, see how well you’d turn out.", "ESH. You deserve better and need to leave this relationship. He’s damaged and needs professional help.", "NTA but why are you still with him?  To take more abuse?", ">He’s still my boyfriend\n\n*BREAK UP!*\n\nGod this sounds so much like my *abusive* (narcissistic) ex. Leave him immediately. Just break up. There's no \"talking out\" in this case.\n\nNTA for saying what you said, but you're becoming the AH to yourself for staying.", "You’re TA because you’re staying with him ESPECIALLY after that.", "ESH, you seem to know what you got with him and still decide to be with him, he seemingly threw his entire family away for his narcissistic and apparently greedy ambitions, so I think it's justified to say, you are part of the problem by staying with him if he can say such things and you just taking it - He isn't a loner, he is simply so egotistical that he doesn't care who he hurts. You're normalizing him calling you slurs. That's absurd.", "INFO: What is wrong with you?", "Why the heck is he still your boyfriend? 95% doesn't make up for all the verbal abuse. That 5% is who he is at his core.", "NTA.  It was a horrible thing, and you're right.\n\n> he was great 95% of the time and in that 5% \n\nThat's what everybody says about their abusive partner.  \"Most of the time they're great.\"   If you were handed a great sandwich that was 5% shit, would you eat it?\n\nIf he cares so little about his family, what makes you think he cares about you?  It doesn't matter what he says, it matters what he does.", "INFO why are you still dating him???", "YTA. But only because of this: “he’s still my boyfriend.” You’re an AH to yourself for sticking around. \n\nSure, he’s good 95% of the time but he’s toxic as hell the other 5%. And you’re okay with that?\n\nGet out of that relationship, pronto. Because the 5% will eventually be 10%, then 20%, and so on. \n\nLet him find someone else to berate 5% of the time.", "Ted Bundy was charming, well liked by friends and neighbors.  He was great 95% of the time, the other 5% spent killing people. Nobody is 100% evil.  \n\nIf he only beat you up 5% of the time would you stay? Hopefully No and answer should be same for emotional abuse. Also good chance he’ll be left out of any inheritance. Treat yourself with some respect by not tolerating this behavior.", "NTA - but why are you still with him? For his looks and money?", "NTA. Spare yourself the suffering and break up with him.", "YTA for not leaving", "Why is he still your boyfriend?\n\nNTA for what you said to him, but you kind of are for staying with him.", "NTA \n\nLeave this man. Get out now", "NTA but break up with him already.", "You are for staying with him. I don’t care that he pretends to be nice, “loving”, and charming most of the time. The hateful ugly part of him is who he really is. He’s an abuser.\n\nHe needs intensive therapy if he wants to change, but that shouldn’t be on your time. Move on, find yourself, and then find someone who really understands kindness, love, and respect. You are deserving of that. And please, don’t get pregnant with his child. That would be child cruelty.", "But... why is he still your boyfriend? He's fucking awful! \n\nNTA for telling him a few home truths but you really need run. He sounds fucking volatile and that sort of shit doesn't get better, it increases as time goes by. \n\nAbusers use the same tactic your boyfriend does... they abuse their victim then turn around and tell them how they didn't mean it, it won't happen again and go out of their way to act like the most loving people ever... until the next time.", "YTA to yourself for continuing to date someone who really likes to torture you occasionally.", "NTA. You sound trapped in an abusive relationship. I’m glad you told him off. He’s could get violent given that you went against him. Are you in a safe location? Please get to one for a while and consider next steps, end this relationship. You deserve to be loved. You are worth respect. Drop this dead weight called “man”", "leave him", "WTF is wrong with you? YTA, for the simple reason of staying with this tool, be kinder to yourself, do you think Jeffrey Dahmer deserves props because he spent 95% pf his time NPT killing and eating people? Love is not enough of a reason to stay aaaanywhere near this.", "Not at all. Sometimes u need to show them the mirror.", "I am sorry, but at this point, if you go back, the 5% will be the norm.", "Why is still your boyfriend?  For his money and looks?", "OP, why are you willing to still claim him as your boyfriend?? He is a bad person. He is abusive. He degrades you when he is upset. Please make him **NOT** still your bf. NTA", "NTA. If he's like this 5% of the time when you're dating now, he'll be like this MORE if you stay longer.  Abuse is abuse is abuse, whether it's 5% or it's 50%. You deserve better.", "Does he have a magic D? Idk why else you’d stay. Because you’re basically dating a dumpster full of red flags. But it’s only 5% on fire and you’re standing in it trying to say it’s safe because 95% of it isn’t on fire. You’re still in a damn dumpster full of red flags that is on fire. Get out now!", "Leave him or you will continue to be the AH to yourself.", "Info: You say he's 33, how old are you? I mean, he's abusive and an asshole, I'm just curious if he's also a lot older than you.", "Yeah, she’s not going anywhere anytime soon.", "Can confirm, OP you need to read this book cover to cover, then again. \n\nBe prepared, your rating will sink to 90/10, then 60/40, then before you know it, your self worth is 0. Take the best care.", "This was the comment I was hoping I'd see.  This is 100% abuse, and it might be 5% bad now but it'll get worse. I really hope OP gets out of this :(", "\"The feces of the rock ptarmigan is used in Urumiit, which is a delicacy in some Inuit cuisine. Several beverages are made using the feces of animals, including but not limited to Kopi luwak, panda tea, insect tea, and Black Ivory Coffee.\"", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Too old to be involved in this", "> He is as well.\n\nThat's what E S H is for.", "Apparently he’s good looking & has money 🙄", "Because calling out negative behavior of your partner is the right thing to do.", "Perfectly said!", "Would you eat candy that was 95% the most delicious chocolate ever, mixed with 5% literal shit?\n\nObviously not. So why are you with this asshole?", "Remenber, he sometimes is nice and have money,  so you can't go away from this treasure", "Yeah what the fuck is this post?? Just because he's only an absolute fucking miserable abusive asshole 5% of the time doesn't make him only a 5% fucking miserable abusive asshole. That makes him 100% a fucking miserable abusive asshole. Jesus christ people please have some self respect and stop dating with such abhorrently low standards.", "And aside from increased frequency, at some point he may well escalate to physical abuse. Doesn't happen in all cases, but this is often how the pattern of abuse escalates.\n\nI really hope OP takes this comment section seriously and comes up with a plan to get out safely.", "Are you willing to have kids with this guy?  Run away", "I like this analogy, I shall borrow it with your permission.", "He THINKS he's getting money.  How many people in the world THINK/THOUGHT they were getting some inheritance but actually aren't/don't.", "You forgot she said he's good looking, probably over 6 foot tall too.", "Yes, it's true and very sad", "Oh yes, you're right 🤣🤣", "It's all about that 🍆", "> He’s still my boyfriend\n\n__INFO:__ Why?", "Why are you with him. Your 5% is crap. So you're not allowed to say anything that might offend him cause then you get the 5%. You were right about him being alone, so why are you with this jerk? Oh yeah, 95%", "Um, what? This guy is not your boy**friend**, he’s your boy**enemy.** Please take care of yourself and break up with him immediately. (And I never say that on Reddit!!) You deserve someone who builds you up. ❤️\n\nNTA", "NTA - but why are you with him? \n\nHis close family know exactly what he is like and have excluded him. \n\nHe is emotionally and verbally abusing you now - do you have to wait until it becomes physical before you realise you deserve better?", "NTA but you will be if you don’t end things", "Friend. He should not still be your boyfriend.", "As long as he's only abusive 5% of the time this is totally fine for you then, huh? What's the cutoff? 10? 20%? Or is it more than 30? Smh. YTA just for this alone.", "If you had a daughter, and her partner was treating her like he treats you, what would you advise her to do? \n\nSave those hurtful things. Let them fuel your anger. Then find some self-respect and lose 180 pounds of miserable weight by New Year's. \n\nNTA. (except to yourself)", "NTA for that, but WHY are you with this monster? Do you not care about yourself at all? Please end that relationship for your own sake, and work on your mental health.", "NTA. But why is he still your boyfriend? \nHe sounds abusive and horrible. I'm.hoping that grandma lives a good, long life and leaves her money to charity .", "NTA wtf you still doing with him, he's not going to change for you", "YTA. To yourself for staying with this person. He treats you like this, and you make justifications for him? Leave him. You deserve better.", "Why.... are you still with him? NTA for what you said but Y T A to yourself for staying with this dirtbag.", "YTA for being with someone like that for two years and after this latest rant/tirade/fit you say \"He's still my boyfriend\"\n\nWhy do you choose to stay with <<no real qualities except for his looks and money. He is a disgustingly shallow human being>>????", "YTA for not breaking up with him, whoever wants to be with someone like that", "Why are you even here? What is the point? You are saying you are going to go back with a man who verbally abused you, because hey, it’s mostly good. You sound like a battered wife making excuses for her abuser.", "NTA. Dear goodness just leave this wanker. Do you really want the rest of your life to be filled with weekends of abuse because he's in a 5% period? Do you really want to be someone who you yourself describe as 'fucked in the head'? Someone who brings that level of bile out of you? \n\nTell him to suck his own dick and dump him.", "Why do posters on Reddit have no sense and continue to make themselves miserable? Just dump him!", "Nta, you are correct and you should break up with this asshole.  He's not ok and isn't going to get any better any time soon. Iran if his family is like blood diamond rich, I might understand but think that's pretty slim chance.  Cut your losses and love yourself.", "\"Fun\" Fact: Abusive people aren't abusive all the time. Not even most of the time. \n\nYou are being abused. If you had a friend say her boyfriend hits her but it's okay because he only does it on occasion, what would be your response?? \n\nWhy is it okay if it's emotional abuse?? Emotional abuse is damaging in different ways. \n\nNTA but he's an abusive AH and you deserve better.", "YTA - You said yourself his only values are his looks and his money. So it seems you are only with him for his looks and money which makes you a very superficial gold digger.", "YTA if he is still your bf", "NTA but girl GET OUT. Blindside him and block his number after you breakup (in a public place or via text) if you can stay with a friend for a few days.\nYou deserve peace, you deserve to have a partner that don’t make you the worse version of yourself.", "Separate from him. In fact you have, so don’t re engage. Delete him from history. Get a new one.", "If you meant what you said when you said it, he needs to be your EX bf already or ESH - him, 100%, you just to yourself. This man is toxic. You can and should do better.", "Nta update us when you dump him.", "NTA although I don't understand why you actually call this person your boyfriend. This sounds fucking miserable.", ">He would call me slurs, fat, ugly and other things to the point where I would mentally shut down. Then he would come to me and do everything he could to make me feel better. \n\nThis is literally how you trauma bond someone to you and get them used to abuse. Your bf is emotionally abusive (for now, that behaviour tends to escalate with time). That 5% of the time? Thats who he actually is. YWBTA if you stay with this sorry ass man.", "Your friend is stupid. \n\nYour man is mean and hurtful with the only person who cares about him? Neah, thats stupid", "NTA but if he's still your boyfriend by the end of the day you will be.\n\nWhat you said to him *could* be considered mean but it sounds like you simply, finally, told him the truth. At some point he's going to have to understand that bitching constantly, blaming others for everything that's wrong and not reflecting on himself and his actions whatsoever means that nothing will ever improve. \n\nHe will be miserable for the rest of his life if he doesn't change - you are not responsible for making him do that though.\nEnjoy the peace of being single for a while and then look for a partner who acts like an adult.", "NTA I would have replied with, shure but not yours when he said suck a dick.", "Girl, get up.", ">He’s still my boyfriend\n\nwhy? he doesn't even love you", "He’s STILL your boyfriend? NTA but you will be for putting up with this disrespect - get out now while you can and never let anyone treat you like this again!", "Please for the love of god do not let that man get you pregnant.", "NTA. OP, you are being abused. Please leave the relationship as soon as you safely can, what he is doing to you is horrible.", "Why are you even still with him?", "NTA. But you seriously need to get away from him. He is abusing you terribly. Please for your sake, your mental health, your sanity -  leave that relationship. Red flags are waving", "ESH\n\nHim, obviously. You to yourself.", "What would you tell a friend who let their partner abuse them 5% of the time? Your bf is a fucking dick. Leave.", "Why is he still your BF? Why, why, why do you allow someone to abuse you this way?  Why is this all right with you?  Do you feel that this is all you deserve, or the best you can do?  \n\nI promise, you can do better!\n\nWhat you said to him was mean and cruel, but it sounds like it was 5 minutes of mean and cruel following 48 hours of hellish emotional abuse.\n\nMy advice is to get out.  Get out now.  Walk away.  And get some therapy right the hell now to figure out what's going on with your lack of feeling of self worth and your willingness to be berated for 48 hours and keep the BF who berated you.\n\nNTA", "ESH\n\nYour boyfriend is abusive, so he's automatically TA.\n\nYou became TA the moment you decided to abuse him back. If you said those things and then ended the relationship, you would have been in the clear. Instead, you decided to make the relationship even *more* toxic (quite a feat, actually) and become an abuser yourself. End it, seek therapy, and make sure your next partner likes you 100% of the time and you feel the same about him.", "YTA for staying with him. Sounds exactly like my ex… listen to those red flags, that’s your intuition telling you something is wrong. \n\nHe’s probably a sociopath (antisocial personality disorder)… they have trouble making friends & generally don’t get along with others.", "NTA, but you need to get out of that relationship.", "Why are you with this guy?", "NTA and why are you with him? You do understand that the 5% will grow because he's being enabled? Enabled as in, everyone just lets him act and say those things. What happens then? Will you stay when he turns violent or will you protect yourself before it happens. You should pay attention to red flags for a reason.", "Im really wondering if he has some kind of personality disorder like possible bi polor or narcissistic", "Please leave this guy", "NTA. Definitely get rid of him. That behavior will only get worse.", "NTA, but do you even like yourself?  Why are you putting up with this behavior?  Do you enjoy being treated like shit?  Why do you stay with someone who acts like this?", "YTA.  You are only with him for his looks and his money.  5% of the time is enough time for you to move on.  Have some pride in yourself", "Hon. You need to get out of this relationship. He was berating you for two days STRAIGHT. Of course you blew up, and rightly so. I would have broken before even the first hour and blown up at him. Do yourself a favor and get out as quickly and as safely as you can. He’s a bad person that is hurting you verbally. That’s still abuse.\n\nNTA, and wish you the best", " Nta regarding the issue about your exchange with him that what he said about his Gma is cruel. Saying he's f \\*k'd in the head, although true, might have been less confrontational if you had suggested getting perspective from a therapist. Your Bf doesn't sound like he's open to counseling, but it'd be beneficial to you to go. You've alot of supporters saying you deserve better, and I could not agree more. Please take care of yourself and stop worrying about this guy who gives you so little regard.", "Get out of this relationship. Do it today. And find a new friend while you’re at it, that one sucks. NTA", "NTA . Why is he still your boyfriend? Do you really want someone who is going to text you nasty things every Christmas while you are trying to enjoy special family time? If you really love him, he at least needs to get help, and you both need family therapy. At this point though, I think it's time to cut your losses. You've seen him for what he is. Do you want to be married, or have a stable relationship, or kids? Can you imagine any of those things when even 5% of the time he's this horrible?\n\nI couldn't imagine it for 1%. My husband would NEVER treat me this way. Not even .1%. Even if we were so mad at each other, even if it wasn't Christmas, especially if the other was trying to hang with their family we would still text something like \"I'm sorry we argued. I want to talk still- I want us to work it out because I feel sad but I hate fighting. I hope you have a great time with your family.\"\n\nDo you want to be with some dude who responds that you should suck a dick when you tell him Merry Christmas and are trying to enjoy your family time? He is SO TA.", "NTA - for your response to his behaviour/\n\nBut you have said ***\"he is a miserable hateful person and it’s no wonder no one likes him he has no real qualities except for his looks and money. He is a disgustingly shallow human being and will grow old and die alone and no one will give a fuck.\"***  Why are still with him?\n\n What you said is your true feelings about him and realistically he won't change and will continue to be verbally abusive and this may escalate over time. Be kind to yourself and dump his arse.", "NTA \n\nIt sounds like this was a breaking straw & you reacted as such. Also seems like you are right in what you said.\n\nBut OP, why is this person still your boyfriend?\n\nThe 5% when he behaves so badly sounds like textbook ab**e. The likely pattern is that the % will increase.\n\nPeople have left a lot of helpful links & comments which I hope you get to read.\n\nYou really do deserve better than this; he isn't going to make you happy.", "NTA for delivering the home truths but TA for staying in this relationship.", "NTA", "Run. Ditch him and *run*", "Hey op, why are you dating someone that calls you slurs? Wake the fuck up.", "The only way your the ass hole is to yourself for choosing to put up with this instead of leaving a clearly abusive relationship", "Whyyyy are you with him!? Please break up with him and seek therapy. This is abuse. NTA", "NTA your friend is not someone to confide in when they accept emotional abuse. You need to love you more and leave him alone. The 5% is still a problem and no you cannot help him. He laughed because that's what most do when they get called out and get what they tiv back. Time to build yourself up and surround yourself with better people ASAP.", "ESH.\n\nFrom this one example, you were clearly the one who triggered his anger with your judgement. Which makes me wonder if that was the case the other 5% of the times aswell.\n\nBelieve it or not, people can react badly when treated like crap....\n\nHis opinion about his family is clearly not good. But do you even know WHY he thinks that? Was he treated with unfairness or mental abuse? Maybe he has a reason to hate them? So you taking their side instead of his, can be a strong trigger.\n\nThere is not enough info here to judge it fairly. And I'm not even sure you have that info yourself...", "Good Lord, just dump him please.", "Sorry not buying the ‘he’s great 95% of the time thing.’ That’s not true because it’s impossible. You also say he badmouths his family ‘all the time’. I don’t know what happened between them (and I suspect neither do you because you only got his side of the story) but it might be something to do with the fact he’s actually awful 100% of the time, it’s just that it’s usually directed at them, not you. So he’s great 0% of the time. Stop covering for him and admit that you are with a complete asshole whose own family want nothing to do with him. If you accept, forgive, return to ANY abuse, even ‘5%’ - you only have yourself to blame. People like this don’t deserve loyalty.\n\nAnd finally- what inheritance? If he’s estranged from the family he’ll probably be disinherited. So not only is he an asshole, he’s also delusional", "NTA,  OP, getting out of abusive relationships is far more difficult than many of the people are willing to acknowledge but at the same time, they are right.  Variations on \"He's lovely when he's not an abusive bastard,\" are the iconic phrases of the domestic abuse victim.  It won't get better because it's not about you and you must understand that you cannot 'fix' this.  You cannot fix him.  If you don't live together (it sounds like you don't), retrieve anything you have at his place and then never see him again. Make sure anyone you do live with knows they are not under any circumstances to let him in.  If you do live with him, prioritise making a plan to extract yourself safely.  Do not tell him your plan; just prepare and then leave.", "YTA to yourself, for allowing yourself to put up with his abuse. You deserve to be with someone who doesn’t treat you like that.", "YTA to yourself for staying with him...", "YTA to yourself. Why are you allowing him to be so nasty to you", "YTA to yourself for putting up with this shit. Leave this garbage.", ">He’s still my boyfriend\n\nNTA, but why? Do you have no self respect at all?", "Read https://en.wikipedia.org/wiki/Curate%27s_egg\n\nNeeds to be understood in the true sense and not the dumb modern way.\n\nSounds like your bf has abusive parents from what little you're saying and his reaction is fairly normal for people brought up in that: he's probably a fragile narcissist - trying to desperately make themselves feel better on some sense but the merest knock will really trigger them. \n\nHe requires an awful lot of therapy.\n\nIt is not your role to look after him, or be there. Tell him he needs genuine therapy to get over the past. Cut ties from his parents and start a new life.", "Jfc. Break up.", "What do you mean \"he's still my boyfriend\"??? He's a massive AH. NTA", "ESH because you two are still together. You know that there is another way to exist in a relationship? That you can be in a harmonious relationship where you don’t BOTH insult each other and call each other names? Right?", "Girl, get out. Now.", "He's the asshole and your friend's an asshole too if they are aware of the whole situation.", "NTA except to yourself for staying with this guy for two years. Please figure out how to get out of this situation before you waste another minute on this asshole.", "Normally I'd say you are absolutely not TA, but I cannot for the life of me understand why, after even all this, you are STILL in a relationship with this man.  \n\nBecause you have not dumped this waste of food, water, oxygen and time, I rule ESH.", "Nta but like others have said, this is definitely a cycle of abuse. Also wtaf is wrong with your friend? If we strangers on the internet can see how messed up your situation is and how horrible your bf is then why are they telling you you're out of line!? Your friend is the AH too", "INFO\n\nAre you with him because of his looks and money?", "NTA. The lil b needs to grow the fuck up and you leaving him might just be the push he needs.", "info:\n\nhe's the shallow one...but you are still with him??", "Lol, he verbally abused you for 2 days straight and you're asking us if you're an asshole for standing up for yourself? OP, you need to see a therapist, bring your friend with you as well. Also, get rid of the boyfriend before it's too late. You're not even married and he already disrespects you. Imagine what he'll do in the future. It doesn't get better most of the time. NTA", "You both sound terrible. \n\nESH", "That's one hell of a relationship you got there 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "NTA\n\nBut seriously, wtf? \"He's still my boyfriend\"?? I think your comments were spot on to him. He's a dick and I have no idea why on earth you are still with him even after this. You should have walked out of that relationship the very FIRST time he had a \"5%\" moment. He is being abusive. Leave and let him die alone with nobody giving any fucks. And tell him to get help, because that behaviour is not ok.", "NTA why are you still with him? It is a classic cycle of an abuser to come crawling back and apologize. Get out.", "Please get out. Just reading this brought back all the terrible boyfriends I've had who made me feel worthless. I promise you, being alone is better", "You should dump him immediately!  No one talks to a gf that way.", "Ur friend is a moron. And, idk why ud date a man who calls u fat or ugly in a real serious tone", "you will be the asshole if you stay with this guy", "NTA\n\nWhy is he still your boyfriend?\n\nHe is the common denominator in all these situations, he’s the toxic one alienating people.  Have some self respect and walk away.\n\nHe would, however, make the perfect partner for your friend who isn’t really a friend, they are welcome to each other.", "NTA\n\nIn my culture, when finding a partner, we are advised to see how (s)he treat their parents and family members because that is how they will treat us after we get married.\n\nThat said, I do not understand why you are still his girlfriend.", "Why is he still your boyfriend?", "Maybe he has been abused by his family though.... people don't just say I can't wait till so and so dies. It's a heavy red flag sure but you need to figure out why. I'm sorry but if he's great a majority of the time and then just switches it might be an undiagnosed something.\n\nI feel bad for him tbh.\n\nAlso you just stated he's upset he isn't included. \nAnd then left him alone I assume on Christmas.... \nYou get an ESH here leaning toward YTA. \n\nNo one just blows up for no reason.", "You didn't mention your age and I wonder if it's considerably younger than this guy.\n\nRegardless, NTA for putting an AH in their place, and please DTMFA. He will only get worse over time.", "Nope. Not the AH. He is clearly showing you why he is estranged from his family. WHY are you with this AH? No one needs that much negativity in their life. He is not going to get better with time. Cut him loose.", ">So this past weekend was one of the 5%, I think he is angry that **his family excludes him** but would never say it. He badmouths them all the time, to the point where it becomes exhausting. So as he was badmouthing them, he said something like at least **when his grandma dies and he gets his inheritance** he will never have to deal with them again.\n\nNTA. He's delusional if he thinks he gets an inheritance. Y-T-A to yourself for allowing this to go for so long.", "Break up with him. And tell that friend to fuck off too. 48 hours on insults? Jesus Christ Girl. NTA.", "Move on.", "What is broken in you that you are dating this man?", "YTA and an idiot for still being with him despite the abuse. You are an enabler.", "I read somewhere that rat poison is 99%food and it's the 1% poison that does the victim in.\n\nI know from experience how that 5% can kill you. It will wear you down over time and make you lose sleep. You'll either lose a ton of weight or put on a ton. Your organs will start facing issues from the constant stream of stress hormones. You'll start developing autoimmune disorders. You hair will fall out. You'll be tired all the time but experience insomnia. You'll start to become snappy and short tempered from lack of sleep. The list goes on and on. All over putting up with  5% when you could be experiencing 0% of it.", "He’s still your boyfriend … why do you care what we say? Saw red flags… red flags confirmed… what else are you needing from us?", "NTA, he sounds like someone with undiagnosed and untreated mental health issues. I've seen people with bi-polar disorder behave the way you're describing. But it could be something else. \n\nEither way, this is abusive cycle to you and others. Emotionally and verbally abusive.", "These are two separate issues. One is why he isn't talking to his family. You don't know who's fault this is, his family might be worse than him. The second issue is that he insults and berates you. You need to break up with him and think long and hard why you tolerated this for so long.", "Life is precious. Stop wasting yours with a man who is horrible", "NTA. Please leave. The 5% is going to increase as he approaches 40. His metabolism is going to slow and he's going to get ugly and angry about it. Money never improves anyone's personality, if they are a good person while poor, there is a chance that they will continue being a good person but the chances to be a bad person increase, making them have to make more difficult moral choices. If they are a bad person, they will almost certainly get worse. He says he's getting an inheritance from his grandma but how does he treat her? It might surprise him how short lived inheritance will stretch, especially if he's currently poor. You said he had money now though (or at least that is how I interpreted that) so it's your life, you decide if you can stand the 5% becoming 10% then 30%, then 50%, especially if you stay cause you are showing him that you are going to put up with him being a crappy person to you.", "NTA it's called an abusive relationship he's completely horrible then whiplash he's the perfect boy friend again making you forget he just made you mentally shut down the 5% will become more the longer you date till the nice times are the 5% and the abuse is the majority", "He must have a Godly dick for you to stick around an ass that uses slurs. Let alone on you.", "\"He's still your boyfriend\"??? For what joy? Either you are not aware you are on the receiving end of abuse or you have just become so accustomed to it it doesn't even register on the scale anymore for you to still be in a relationship with this guy. Either way, yours seems far away from a healthy relationship. If either of my children were in one like this, I would tell them to get the hell out. \n\nA soft YTA, just for the \"he's still my boyfriend\" comment and perpetuating the abuse cycle.", "Uh why are you with this person because he sounds super narcissistic….", "\"He’s still my boyfriend\"\n\nWhy? You don't seem to lift each other up, rather tear each other down.\n\nESH", "Why is he still your boyfriend?", "And ...  why are you dating him?", "\" He’s still my boyfriend \" \n\n&#x200B;\n\nYTA if you stay with this guy", "I'd hate for one of my family or friends to be in a relationship like that. Are you such a dreadful person that you can't do better?", "NTA\nBut he definitely is and you see that he is, so dump him. \nIn your own words he's a miserable, hateful person. In my experience, someone who's 5% awful only gets more awful the more time you spend together. He's not going to improve.", "NTA why the heck are you staying in this situation go run in opposite direction asap!", "NTA\n\nListen you need to leave him\n\nGo NC\n\nThis was my ex. I was with him for 10years and had kids. It destroyed me. Over 10 years later I struggle with PTSD. As I said we have kids so we keep in touch and have actually managed to become friends. He still gets his «5%», the big difference now is that I can just hang up or leave when he gets like that. I don’t have to care about it. (The kids have mainly beem with me so no worries there)\n\nGet out and don’t look back.\n\nYou are NOT the AH, because dealing with a person like this is hell and your friends don’t see it. I can bet he is charming as hell when he wants to be.", "And yet he’s still your boyfriend go figure", "NTA.  \nAnd honestly breaking up with that guy might be the only way to make it clear to him that he actually will die alone if he doesn't change.  \n\n\nTrying more diplomatic avenues is absolutely not worth OP's time and emotional energy.", "apparently he’s got money? so she’s in it for the money apparently otherwise no idea", "Great comment, except it counts as a vote for OP being the AH 🤦‍♂️", "You had me in the first half, Ngl", "You're right, but a judgment of OP being the AH will be interpreted as she being wrong to have snapped at him as she did, so I cannot upvote this.", "Same can be said for John Gacey. He was a pillar of his community and was well liked by most. He still raped and killed over 2 dozen young men. OP needs to GTFO", "She said he has looks and money! Probably that's a good influence for her?", ">he's only abusive 5% of the time\n\nYeah it’s only one turd sprinkled on the pizza, otherwise the rest of it is quite tasty amirite.  smh\n\nNTA for the reactive abuse but Y T A for staying with this boYfriEnd.", "I can't figure out how to do the quote thing with the new reddit (could anyone tell me?) Anyway \"If you were handed a great sandwich that was 5% shit, would you eat it?\"\n\nThat is THE. COMMENT. Amazing.", "And when they really start keeping track, that 5% balloons to 50% or more.", "Even if OP was objectively right, in these sorts of situations it is better to cut losses and move on. There is not a single road in hell that will allow someone to come back from calling someone 'disgustingly shallow' and it would have been right from your BF to break up with OP for that alone. Jesus. The fact  that the BF then screamed 48 hours and proving her point doesnt help either.   \n\n\nAnd then staying together and expect things to go better/that this is fixable.   \n\n\nHell no.   \n\n\nEHS.", "I’m shocked YTA to yourself for still sticking around isn’t the consensus.", "No D is magic enough to make up for the 5%.", "She still with him because he’s abused her to the point where she believes he’s almost always a great guy.", "Money.", "This is a fantastic comment, best I’ve ever seen on Reddit tbh", "Woah. I've never heard of the term 'reactive abuse' but this is exactly what I'm going through. OP get out before it gets worse, you can not change this person.", "^ this", "Thank you for such a thorough answer. Highly recommend this book, OP.", "Apparently good looks and money are enough to make some people ignore the vile traits of someone's personality.", "You are literally blaming the victim! 🤷🏻‍♂️\n(You’re also blaming the abuser, but you’re also blaming the victim — criticizing her choices and “standards”. She will hopefully escape this guy and have a chance to start rebuilding her life and self-esteem so she can find someone who treats her decently all the time, but criticism and blame is the last thing someone in this situation needs. It’s not how to help someone being abused (if it was, nobody would stay in an abusive relationship). I hope you respond differently and with more insight when you encounter someone going through this in your life.", "It wasn't until 2020, when I realized that a person's wealth or perception of their wealth can cloud other folks' judgments about their characters.", "Yeah, it actually occurred to me as I was writing that possibly the BF is supporting the OP or that the OP is in some way financially dependent upon him, so that they feel trapped.  I really hope that isn't the case, and if it is, I hope that the OP will look at this situation and find a way to extricate themselves.", "That’s just how he caught her. She’s still there because he’s so badly manipulated her that she’s convinced he’s almost entirely a great guy! (she’s in REALLY DEEP 😢). \n\nShe hasn’t realized he’s been emotionally abusing her, so she likely hasn’t even begun to seriously contemplate escaping. Hopefully the responses to this post will help steer her towards an exit.", "In other words, he has the things that many women are trained to value above integrity, decency, and compatibility.  I stayed far too long with someone  (years back, thankfully) because on paper he seemed good and I was too inexperienced to realise that underneath it, he was awful.  It ended about as well as you might expect.", "you sound like an incel.", "Granted...", "To be fair, op says he has money. Guessing he has plenty now and inheritance would be never work again money.", "There's people like that!", "This thread is now locked due to an excess of rule violations. \r\n\r\n[Sub Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) ||| [\"FAQs\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)", "[removed]", "I remember a story years ago. A woman was with a man who was \"a really good guy... most of the time\". He only hit her once. Turns out, that's all it took. She's dead, from one hit.", "***-He’s still my boyfriend-***\n\nYTA purely because you don't respect yourself.", "NTA, but your BF and your friend defending his feefees definitely are. Treat them both like a questionable wet tissue and drop them immediately.\n\nThat they are both gaslighting you to the point that you think YTA is a sure sign you need to extricate yourself from them.", "NTA - please leave him. He will never change and sounds like an abusive arsehole. Make sure you’re safe when you do decide to end it though, do it in a public place if you’re going to end it in person, or have someone with you if you’re going to do it in your home. Block his number after. Do not go back to him, no matter what he says to you to try to convince you.", "ESH\n\nHe's garbage. And you're okay with that.", ">Mean, nasty, cruel and just overall a horrible person. He would call me slurs, fat, ugly and other things to the point where I would mentally shut down.\n\nIt was nothing but a disservice to yourself that you stayed with him after this happened THE FIRST TIME.\n\nListen, the first time your boyfriend calls you a slur and insults you better be the last fucking time. If he ever does it again, it can be as your ex, not your boyfriend.\n\nSeriously, dump this guy. Nothing is worth tolerating this kind of treatment. He is toxic, mean, and hateful. Let him be alone.", "[removed]", "light, rhetorical info: what leads him to think that when grandma dies he's still gonna be in the will for more than a shiny red penny? And are you ready for the abuse burst that happens then?", "ESH\n\nI make this judgement because you're the asshole to yourself for staying with someone who thinks so low of you.  No one who loves someone will talk to them like he talks to you.  And your comment about his only qualities are his looks and money, make you sound like a gold digger.\n\nBoyfriend is an asshole for obvious reasons.", "NTA.  At first reading that he is great 95% of the time, I was thinking “maybe he has a mood disorder”.\n\nBut the rest sounds like he might just be a mean person that was playing nice for a while.", "NTA\nThere's a little word missing from your post. \n\nThat word is 'ex'. \n\nHe sounds like he has not much going for him. \n\nWhy allow him to insult you?", "NTA - your boyfriend is spending so much time pretending to be someone he isn't, that when he has to actually deal with shit, his real self comes out in an explosive way \n\nI'd get far away from that walking red flag. Jfc.\n\nGood luck OP. Don't be desperate enough to date someone that sounds like an abuser.", "Only reason I see you being TA is to yourself because you haven’t left this miserable fuck. Get on that", "NTA but anyone who acts like that even 1% of the time isn't worth it so you are being an ah to yourself by continuing with him.", "He shouldn't still be your boyfriend because he is emotionally, mentally, and verbally abusing you\n You can do better, and you DESERVE better.", "ESH. \n\nYour boyfriend should never speak to you like that. \n\nYou should never invalidate his feelings about his family like that. \n\nQuestion: if, for example, you found out that he had been molested by a family member and it was known and no one helped, would you still consider him “fucked in the head” for believing that money was the only thing worth getting from them? What about plain old physical abuse? Neglect? Black sheeping? Where is the line for you? It sounds to me like he has serious family-related trauma and you judged him for it instead of having empathy and gratitude that you didn’t have the same issues.", "If he's estranged from his family, it's presumptuous that he'd even be on his grandma's radar when it comes to inheritances since he's probably met him and sensed he's just waiting for her to keel over", "If you’re willing to stay with someone like that, then why the hell should anyone else care? That’s your choice now.", "Why is he still your boyfriend. \n\nUnpopular opinion but yeah… YTA for saying that to him and staying.  You are\nHelping to create a toxic and harmful relationship.  Why would you stay with someone who talks to you like this or makes you talk to them like that.   \nNow don’t get me wrong he is also the TA but you stooped to his level and are apparently ok with it.", "Why are you with this guy? By the way, he’s gonna get worse. That 5% is going to turn into 10%. Then 25%. Then 50%….", "YTA to yourself for continuing to eat this shit sandwich.", "T", "Great another person who stays with a person who obviously is no good", "YTA because he's still your boyfriend. He won't grow old alone because you haven't broken up with him.", "Info: why he still you boyfriend?", "YTA - if you stay with this guy and continue to complain about this behavior. Stay with him and get used to it or leave.", "[removed]", "I had to recheck his age, he sounds like a high schooler (way too immature to be in his 30s) and also just horrible. You told him a truth. NTA. Leave him.", "YTA to yourself. Why are you being so cruel to yourself? Why are you still in that relationship?", "NTA. Do you live in Ontario? This sounds exactly like my abusive ex that I dumped back in 2019 and he's even that age too.", "NTA but he also should no longer be your boyfriend. You shouldn't put up with someone acting that way.", "Nta, your bf sounds very immature and verbally abusive. Dump he's ass and save you years of headache. Saying they about his grandma is so wrong, even if he thought it was a joke... Dude has some serious problems. No wonder he's a loner... sorry your going through this.", "Pretend you're someone else for a minute and read your post again. This is serious mental abuse from your partner and massive red flags. Do you want this behavior affecting other areas of your life? Will you be an emotional punching bag for the rest of your life in order for him to compensate for his insecurities at the expense of your mental health?\n\nNTA. I would consider any insults like these in a relationship as a massive red flag. Children swear and call each other ugly when they are upset or don't understand their feelings. Adults don't.\n\nAlso, the fact that you live through this regularly and it feels somewhat normal to you might indicate this behavior could be common elsewhere in your life/family. The pattern of 95% nice and 5% horrible is textbook emotional manipulation.", "NTA.\n\nWhy. In. The. Actual. Fuck. Are. You. Still. With. Him?\n\nYou need to find some self-respect and leave him. This sounds objectively nuts... and I'm a nurse who specializes in a long-term psych facility. I know crazy when I see it.\n\n🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩", "Why is he still your boyfriend after all that.  You know he’s a hateful spiteful little man who abuses you, and you still want to be with him.  It’s called love bombing. He will alienate you from your friends and family, and then it will be 95% nasty and 5% amazing.  Don’t do that to yourself.", "ESH. he’s a horrible partner but you’re also at fault for putting up with it. Know your worth and do something about it unless you want this to be your life.", "[removed]", "WTF?! Why does he still your boyfriend? Do you hate yourself this much?\n\nNTA for saying him the truth, but you such a dumb person for still being with someone like him... He replied with a \"lol\" because he knew nothing would change, he will keeping insulting you and you will keeping being by his side... This make you an awful person as well, who will keep being your friend if you bring this crap alongside?", "NTA for this situation but you are a big for staying with someone that doesn’t respect you. The first time he called you a name should have been game over.", "damn OP have some self respect...", "NTA and this relationship has last about 23 months too long. These are called 🚩 to your future if you stay with him.", "Yta to yourself\n\nI don’t understand people who just think it’s ok to be in relationships like this. At this point you can’t blame him anymore, you know he’s not a good guy but you’ve twisted reality in your head and think “this is how relationships go”\n\nYoure old enough to know better, so know better and get out. \n\nDo you want to stay with him for another 10?", "You're YTA for still being his girlfriend.", "[removed]", "Good Lord, seriously?? You're how old and you deal with this? You're being a sucker.", "NTA and he is abusive. Please get out and read Why Does He Do That by Lundy Bancroft", "NTA hes abusive.\n\nBut if you don't know his family, maybe he hates them for a reason. However he has no right to abuse you verbally", "NTA and I would say it's a good idea to end the relationship. I find it worrying that he found it okay to insult you. In my opinion, he should look into counseling.", "Your friend can have him if they think his abuse of you is acceptable and you are the asshole for actually sticking up for yourself, seriously though they guy is a lost cause.", ">Over the next 2 years he was great 95% of the time and in that 5% he was like a completely different person. Mean, nasty, cruel and just overall a horrible person. He would call me slurs, fat, ugly and other things to the point where I would mentally shut down. Then he would come to me and do everything he could to make me feel better. \n\nNTA but this whole thing right here makes me wonder why he's still your boyfriend. None of the 95% of the time he's \"great\" doesn't make that 5% ok. \n\nHe berates you to your breaking point and then lovebombs you. He needs therapy, your friend is wrong, and I hope you can find the strength to leave.", "Do you mean ex boyfriend?  \n\nYTA if not.  Don't tolerate being treated like that.", "INFO: why the hell is he still your boyfriend??", "Yta for putting up with him. 5% of the time is 1 in 20. Basically every other week you let this guy abuse you. That’s fucked. I’m sorry you are in this situation but leaveeeeeeee!", "He sounds terrible. Leave!", "And you are with him...because..... why??\n\nYTA to yourself.", "[removed]", "As he is still your boyfriend, YTA to yourself.\n\nthere is no point in this post or to complain about his behaviour when you are staying with him. I assume you are staying for the money as “he has no real qualities” YTA", "Jesus Christ, why are you still with this guy? The 5% of the time that he verbally abuses you does not make up for the 95% of the time that he's great. And that 5% will gradually increase to 10%... then 25%...", "So he's cruel to you and calls you slurs, ugly and fat periodically repeating 5% of the time? I'll have you know that calling you a slur only ONCE should warrant a breakup on your part. Why are you tolerating this?\n\n\" I told him he is a miserable hateful person and it’s no wonder no one likes him he has no real qualities except for his looks and money. He is a disgustingly shallow human being and will grow old and die alone and no one will give a fuck.\"\n\nAnd why the hell are you with him if you think about him this way? I think you both are \"fucked in the head\". ESH", "NTA. U should consider leaving him, it wont get better, only worse. And yas he is lonely because nobody wants to put up with his asshole behavior.", "Why is he still your Boyfriend? Are you so low on self confidence that you allow loved ones to call you horrible names? Are you not worth more?\n\nNot only did you not go too far (you have put up with this for way too long) but you didn't go far enough:\n\n'no wonder no one likes you, you has no real qualities except for your looks and money. you are a disgustingly shallow human being and will grow old and die alone and no one will give a fuck, including me. Well done on getting rid of the only person who tolerated you and Happy New Year too!\n\nNTA", "NTA\n\nBut you deserve so much better \n\nPlease.  Get therapy before dating again", "There are red flags that shouldn’t be ignored. Get out now or go see a therapist together but I’m guessing that won’t happen", "YTA for not respecting yourself enough by NOT breaking up with him after what he did. He’s an AH but you are allowing yourself to continue being miserable by being with him after what he did, why man?", "YTA to yourself if you don’t dump this shitcunt", "You say “no one likes you and you have no one”, is a false statement if you are still his boyfriend. Lol. \n\nWhy are you still his boyfriend?\n\nYTA, for making a liar out of yourself.", "NTA - but you need to get out before this gets worse. \n\nI once saw someone on here post something like \"if your partner was 95% a piece of chocolate cake and 5% shit, would you keep eating? Or would you throw it out and find another dessert?\" \n\nAnd if you're not willing to eat that, why are you willing to accept this? At least shit isn't as likely to hit you.", "NTA. So, just to clarify, does your friend think 48 hours of nonstop insults ISN'T going to far?", "***\"He’s still my boyfriend and my friend said I was an asshole and went too far.\"***  \n\n\nYou have got to be kidding!!  \nYou are obviously a terrible judge of character. Your \"boyfriend\" is an abusive AH. The 95% is irrelevant and meaningless when the 5% is spent berating you and calling you names. Why are you still calling this man your boyfriend? He's your tormenter.   \nAnd your \"friend\"??? This person who is saying that you went too far is not a friend. Anyone who thinks that you should accept being treated this way is not your friend.  \nSee a therapist and figure out why you're allowing this man to treat you this way. Get some support and run far, far away.", "This is the part where you run the fuck away. NTA. Drop him.", "You are NTA for telling him off, YTA for staying with him.", "NTA for what you said but YTA to yourself for staying with him.", "You say in your last paragraph that he's still your boyfriend.\n\nWhy is that, again?", "You mean your ex-boyfriend, right? The only AH behavior here is continuing to think this asshole actually cares about you. Dump him.", "YTA. You don't like this man. This relationship is toxic. And you seem to only be with him for his money and good looks.", ">He’s still my boyfriend\n\nYTA for that but only to your own self \n\nRedeem yourself by dumping the chump", "NTA but you're being one to yourself accepting this behavior. Doesn't matter it's only occasionally. He's abusive.", "BTA Why are you with him still?", "Break up with him jfc. I’d tell his grandma what he said too so that she can remove him from the inheritance.", "NTA... Unfortunately, he will continue to find new gfs to behave like this with. And this is the tragedy of walking away from such men. There is no dearth of women who are unaware of who he is, and he will be able to repeat this in an endless cycle. His looks and money will ensure this. Nevertheless, walking away is the way to save yourself from this cycle of abuse.", "NTA but girl, you need to run like your ass is on fire. This man is an abuser and that 5%? It's going to slowly increase over time if you allow this to continue. Run now and run far.", "You realize staying with him just makes you look shallow and will make you feel worse", "ESH. Y'all need to just break up and move on. There's no moving past something like this", "YTA to yourself for staying with this asshole. I get it, his looks and money outweigh his behavior.\n\nBreak up with him and go to therapy to increase your self esteem.", "YTA to yourself. Grow a spine and some self-respect and ditch this hateful, spiteful, mean and cruel loser.", "NTA why are you still with this person?\n\nYou perfectly described text book abusive behavior where he treats you terribly and then \"love bombs\" you until you come back and stay.", "maybe show him this thread, but you seem to enjoy being a verbal punch bag, so I suspect you are both AH's", "OP, I’m not a therapist, but having experience dating someone who had Behavioral Personality Disorder, it sounds like your bf may have BPD.\n\nThat does not excuse their behavior! \n\nAbuse is abuse. Leave this guy and find someone who will treat you right. \n\nI know, it’s scary. I found the opportunity to escape when during one of his rants he told me to leave and I took him up on it (when in reality he was expecting me to try to prove to him how much I cared and to try to comfort him while he lashes out at me verbally). \n\nBut you! OP you have your escape opening stating you right in the face. You told him he “…will grow old and die alone and no one will give a fuck.” And he replied with “lol” clearly showing how little he cares about you or your opinion. You basically told him that you were done being with him (otherwise he wouldn’t be alone) and all he did was laugh in your face. Just walk away and start living live without his abuse. You’re an AH to yourself if you stay.", "You’re an asshole to yourself for just accepting this treatment. It’s doesn’t matter if he’s great 95% of the time, it wouldn’t matter if he’s great 99.9% of the time. The minute he starts verbally abusing you, you should have walked away.", "“He’s still my boyfriend”.  Honey that “D” isn’t that good.  Get some therapy, find some self worth and move on.", "YTA for going through all that and staying he's still your boyfriend...", "Why is he still your boyfriend?", "Why is this guy your boyfriend?", "NTA\n\nAnd you need to get out. This dude is toxic af.", "Why are you with him? 5% of the time with his nonsense is 5% too often.", "NTA. Get out of this relationship. This is toxic AF.", "Please please please dump his ass, healthy relationships do not include any of the behavior you described. Dump him and go to therapy to process it, go no contact with him today.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "She's still with him because he's attractive & wealthy.\n\nOP, leave his abusive ass.", "Exactly. I think most of the people have the misconception that people in abusive relationships are abused all the time. No sir, even if an abuser is charming 95% of the time, a 5% is enough to be a toxic relationship.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA.\n\nHe's miserable during the holidays because it forces him to face the fact he's alone and you called him out on why he's alone.\n\nHe takes out his negative feelings on you OP.", "Thank you for posting this.", "She right out said why she stays---his looks and money. \n\nThe OP is YTA", "Well she hates everything about him except his looks and money and presumably is only with him for those two things, so she also seems to be pretty shallow and disgusting. Guess they deserve each other", "This ! You are turning into his emotional punching bag. Is this how you want to spend the rest of your life? And it can only get worse! Save yourself - don’t abide abuse, ever!", "I think it's because we're hearing one side of the story... He sounds like a AH, but I get the nagging suspicion there's more to this story.", "That is so common on these posts. So many people describe terrible behavior from their partners, but then they claim that their relationship is otherwise \"perfect\" and that they really love them.", "Look, I think calling her an AH for not realizing that this counts as an abusive relationship isn't really fair. I hope this is a wakeup call for her, but there are lots of reasons people second guess themselves and stay when they shouldn't. Victim blaming isn't cool.", "And children. He raped and murdered young men and boys. His youngest victim was 14 years old."]}