{"id": 3390, "submission_id": "z6gwzd", "title": "AITA for kicking my cousin out after what she said to my wife about our baby", "selftext": "My wife and I are expecting our first baby literally any time, she is currently 38 pregnant. For context, I am the whitest white to ever white, and my wife is first generation Korean American. \n\nMy family came over for thanksgiving because of 9 month pregnant wife, and my cousin from out of town is staying with us for the weekend. \n\nAfter everyone left and my wife, my cousin and I were winding down on the couch and she and my wife were chatting about the baby. I got up to go to the restroom and when I came back I heard my cousin say “I hope *babies name* has your hair and slender frame but gosh I really hope she has OP’s facial features and eyes.” My wife looked at her a little puzzled and asked why and my cousin said “Well a lot of mixed kids have those little eyes, it doesn’t look as cute but your hair is so beautiful.” \n\n\nMy wife told her that was kind of racist and she didn’t appreciate the notion that if our baby looks like her she’d be ugly. My cousin doubled down and I told her to leave. She protested and said she didn’t know where she’d go and we told her we didn’t care and she could get out. \n\nShe left but we have been bombarded with texts and calls from family members (excluding my mother who is appalled by the behavior) calling us assholes and sensitive and we can’t kick someone out for their opinion. \n\n\nAm I the asshole?", "created_utc": 1669593442, "permalink": "/r/AmItheAsshole/comments/z6gwzd/aita_for_kicking_my_cousin_out_after_what_she/", "score": 104, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I kicked her out where she didn’t have a hotel late at night and didn’t care what happened to her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. For everyone who has called or texted you, call or text them back and tell them to take her in. You can kick someone out of your house for whatever damn well reason you please, but full-blown racist comments is an excellent reason.", "NTA \n\nRacist is the appropriate word.", "NTA. She insulted your wife in her own home and you’re allowed to kick anyone out of your house anytime you want. What your cousin said is racist and she can keep her unwanted opinions to herself. Congratulations to you and your wife, I hope LO comes to the world healthy and happy.", "NTA\n\nGood job standing up for your partner. Guarantee the cousin isn't telling the whole truth, OR the rest of the family harbours the same beliefs. \n\nYour baby will be perfect no matter who's features they carry, OP <3", "Uh...your family is incorrect. You absolutely can and should kick people out for some opinions. Are those flying monkeys aware that your cousin was spouting racist shit and also basically calling your wife ugly for being and looking asian? \n\n\"Wherever shall I go on thanksgiving???\" Idk, there's probably a Klan sponsored turkey fry for her and all the racist uncles that get kicked from their holidays.\n\nNTA", "Nta \n\nShe was rude and racist.", "NTA, how racist is this woman, she needs to say sorry to your wife, what a shitty cousin you have and a shitty family calling you the asshole, no you don't need this\n\nGo NC with your Cousin", "NTA.  One of the relatives calling you can house her.   Where do they get off?", "NTA\n\nYou don’t have any obligation to let someone stay in your house, let alone someone who is insulting your family.", "NTA. She is racist, disrespectful and probably thinks this behaviour is OK because she's probably not been held to account previously by anyone else she has racially abused before. Good for you for sticking up for your wife and baby. Let's just pray that the AH genes stop with your cousin and don't get inherited by anyone on their side.", "NTA.\n\nYou expressed your discomfort with what your cousin said. They doubled down.\n\nYou have every right to hold people accountable for offensive behaviour in your home.\n\nYour cousin expressed an opinion - and has the right to accept the consequences.\n\nIn terms of you being sensitive, you can respond with \"X shouldn't have acted like a racist in our home if she's too sensitive to accept the consequences\".\n\nPlay stupid games, win stupid prizes", "NTA.\n\n>> we can’t kick someone out for their opinion\n\nRacism is *always* a good reason to kick someone out.", "**NTA** \n\nTo tell a pregnant woman that her baby shouldn’t have her features or it will be ugly, is a horrible thing to say. \n\nYou did the right thing by setting the boundary right away and kicking her out. \n\nGiven that your family lives close by enough to visit, any of them could have easily turned around and picked her up.", "NTA not only is it super racist but it's an absolutely shitty thing to say to someone you are supposed to care about.", "NTA.\n\nShe fucked around, she found out.", "NTA. \nShe literally insulted your wife in her own home. \nAnd it was indeed racist. \nAnd imo my house my rule, disrepect house’s owner - get kicked out.", "Having an opinion like “I think Harry Potter is boring” is just an opinion. Unpopular maybe, but harmless.  Saying what she did is just plain racist. Remember who took her side and take notes. They agree with her and are no better. \n\nNTA", "NTA and the family members who are upset are showing you their true colors, take heed", "NTA. You can totally kick someone out for their (shitty) opinions, and good for you for doing so.", "NTA. Good for you for sticking up against racism.", "NTA.\n\nYou didn't kick her out for her opinion.  You kicked her out for her completely inappropriate and unacceptable expression of it.", "NTA, it was racist and she new that", "NTA. It was a blatantly racist statement.", "NTA. The only appropriate response from your cousin when your wife told her what she said was racist is \"I am sorry - what I said was wrong.\" Not to double down on her racism.\n\nIf the family has a problem with you defending your wife - well then they can shove off. You don't need racists in your life. And, **yes**, you **can** kick someone out for their opinion.", "NTA\n\nI’m really hoping the people in your family that are calling you AH didn’t get the whole story, if not you have a lot of racist in your family.  NTA for kicking cousin out and I would watch my kid carefully with the rest of the family.", "NTA.  Racist and mean.  What kind of person even thinks that, let alone says it out loud, let alone says it to a nine month pregnant woman who is the race the racist proclaims unattractive?  Let her go celebrate holidays with fellow-racists, and for heaven's sake, keep her away from your beautiful little child when the baby arrives.  You really don't need a child picking up on and internalizing racist messages from a family member.  The cousin has revealed her true self to you know.  Buh-bye cuz.", "NTA. Your cousin can go kick rocks with the other racists.", "NTA You didn't kick her out for her opinion. You kicked her out for her rudeness.", "NTA. Racist. Did she just called the typical Asian eye ugly? So mixed baby is cool as long as they look white.\nRacist sister! If you child looks Korean, your family is going to make racist remarks and break that poor child confidence. So many posts on Reddit about kids growing with a side of the family that was racist, it’s really sad", "NTA Poll those relatives siding with your cousin: \"Just so I'm clear, you're standing behind the absolute racist remarks my cousin made about my wife and child?\".", "NTA. If someone told my wife that I hope your baby doesn’t look like you, I’d lose my shit. She almost directly insulted your wife to her face, and she then doubled down on it. This is some behavior from someone that starts a sentence with “I’m not racist, but…”\n\nAlso, you can kick people out of your house if you want. It’s your damn house!", "NTA -- She was being racist af and, even if she wants to feel entitled to her passive bigotry, she could still have minded her manners, chosen to be respectful of her hosts in their home, and not sat there saying some rude shit to a pregnant person who likely has already struggled with insecurity about her appearance through the pregnancy in the first place. Furthermore, if your other relatives want to enable her bigotry, *they* can host her. I am worried about what kind of experience your baby is going to have with their white relatives.", "NTA. Not only was that an incredibly racist comment to make, but it is truly unfathomable that your cousin would even think that was an appropriate comment to say out loud and no one would take offense. Unless your cousin was an actual child without access to a cell phone, credit card, or cash - it’s ridiculous that your relatives are harassing you over the situation. \n\nAll I can say is: I’m sorry this happened to you and your wife, your child will obviously be perfect, and don’t waste another minute thinking you did anything wrong, your cousin and anyone who thinks that behavior is appropriate doesn’t deserve access to your home.", "NTA\n\nShe is racist and she is wrong. Asian and white mix produce the cutest kids. Source: my kids are a mix of Japanese, Caucasian and Latino ❤️", "NTA. \n\nKick that racist to the curb.", "NTA.Actually you can kick people off your own house for whatever reason you want, your cousin being a rude racist just happens to be a good one.\n\nAlso, who looks at a parent and say \"I hope it doesn't look like you because it'll be ugly\" for whatever reason?How old is your cousin?I doubt that even a kid in the super sincere fase would be that rude.", "I don't even know where to start with \"you can't kick someone out for their opinion\". It's absolutely delusional.\n\nNTA.", "NTA\n\nYou don't get to say racist stuff to a pregnant POC in their own home, and get a bouquet of flowers.\n\nYou get kicked out of the house at night, and that was the only right solution there.\n\nEveryone who had the back of a racist a-hole may get one chance to consider:\n\"So you think being a racist, and doubling down, to my pregnant wife, in our own home, was an a-okay thing to do?\"\n\nAnyone who says yes just deleted themselves from your life.\n\nTake it as a cleansing moment you got for free. Don't feel bad about it. Ever.\n\nI had to deal with racist stuff from my in-laws one too many times. Now pregnant, I've put my foot down with my husband, and he finally understood while I might be mature enough to handle racism with cynical jokes, our son would take it personally. And then it clicked.\n\nDon't ever let family hurt your child, please. Those scars won't ever heal. They can be unseen for decades.\n\nAlso I saw you calling her beautiful, and it made me teary eyed.", "NTA. But tell her it could always be worse. The kid could come out resembling her. \n\nGo NC with this person like yesterday and any family who wants to stick up for her, they can be excluded too. Zero excuse for that behavior.", "NTA. It is an appalling thing to say to an expectant mother.", "NTA. You can kick anyone out of your home for WHATEVER reason you want. \n\nShe can have an opinion…elsewhere.", "Nta. You do not have to accept racism in your home.", "NTA. You can 100% kick someone out for being racist to and about your family, especially when they do it to your face.", "Deffo NTA OP. Your cousin insulted your wife and soon to be born child while you were kind enough to provide food and a place to stay. No one should have to deal with racist comments like that anywhere, let alone in their own home. By sending her away, you showed support for your wife and set a standard for the rest of your family that racism will not be accepted in your life. \n\nIf any of your family members were concerned about her having a place to stay, they could surely drive back for her if she couldn’t find a hotel (you suggested they’d not long left). \n\nI’m honestly shocked so many in your family are taking her side. I don’t understand how anyone could even think those things let alone say them out loud. She is obviously completely wrong and I wish \nyou and your wife all the best with your beautiful new baby", "NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife and I are expecting our first baby literally any time, she is currently 38 pregnant. For context, I am the whitest white to ever white, and my wife is first generation Korean American. \n\nMy family came over for thanksgiving because of 9 month pregnant wife, and my cousin from out of town is staying with us for the weekend. \n\nAfter everyone left and my wife, my cousin and I were winding down on the couch and she and my wife were chatting about the baby. I got up to go to the restroom and when I came back I heard my cousin say “I hope *babies name* has your hair and slender frame but gosh I really hope she has OP’s facial features and eyes.” My wife looked at her a little puzzled and asked why and my cousin said “Well a lot of mixed kids have those little eyes, it doesn’t look as cute but your hair is so beautiful.” \n\n\nMy wife told her that was kind of racist and she didn’t appreciate the notion that if our baby looks like her she’d be ugly. My cousin doubled down and I told her to leave. She protested and said she didn’t know where she’d go and we told her we didn’t care and she could get out. \n\nShe left but we have been bombarded with texts and calls from family members (excluding my mother who is appalled by the behavior) calling us assholes and sensitive and we can’t kick someone out for their opinion. \n\n\nAm I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "As a matter of fact, you can absolutely kick someone out for their opinion. \n\nA lesson your racist cousin learned.\n\nNTA.", "Wtaf! NTA.. I'm not even going to say more", "NTA", "NTA. People really need to stop before they speak, think about what it is they are going to say, and then not say it and reflect on why they have biases and racism. I feel sorry for your wife. I applaud you standing up for her. So many families chuckle and move on, making the target of the comments feel so alone.", "OP needs to go No contact with their cousin", "🎯 I don't think we as a society should mince words about it anymore.\n\nCall a spade a spade.", "My wife is the most beautiful woman I’ve ever seen and our baby would be incredibly lucky to look at her.", "happy cake day!!\n\nand agreed. nta.", "I almost went crazy on her but I try to stay calm and collected when it comes to my wife so I don’t stress her out.", "Our baby is a mix of Korean, Scottish and Irish because both my grandparents immigrated to the us in the 60’s.", "I bet they’re absolutely gorgeous!", "Thank you, and also it’s midnight… I should be sleeping. :)", "I don’t blame you on either fronts. FWIW I’m sure your daughter will be beautiful and incredibly loved! Good luck to you & your wife, sending hopes for a safe delivery!", "Your baby is going to be wonderful no matter what its heritage, because it will be loved.", "NTA I wish it wasn't the case but your family will likely experience more than a lot of this pretentious  faux concern that's really racism. I'm glad your child has such good parents that don't accept it not even one bit. Who ever your daughter, whatever her features, she will be astoundingly beautiful and your cousin will always be prejudiced and always be wrong. ."]}