{"id": 33907, "submission_id": "18ssr7m", "title": "AITA for giving two nieces the same gifts when they are different age", "selftext": "I (18f) am currently on school break and spending Christmas with my family (parents, 2 sisters and BILs, 1 brother and 2 nieces). We the adults agreed only the kids would get gifts to decrease the financial burden. I’m a typical broke college student but also an OK baker so for this first Christmas as an adult I decided to give baked goods as present.\n\nI made butter cookies with lemon icing. My nieces were Mia (9) and Zoe (6) each from different sister. I made two identical boxes for them. Each girl got 12 cookies each. They were shaped like things from the song 12 days of Christmas.\n\nEveryone complimented me on how cute the cookies for the girls were. I also made a batch (plain shaped) for the family and everyone said they were good. Mia did not look pleased, however, and was quieter than usual for the rest of the morning. At lunch, Mia’s mother asked to speak to me. She said Mia felt like it was unfair that Zoe got the same amount of cookies she did when she was the older girl. Mia always thought of me as the favorite aunt and was hurt that I didn’t treat her special.\n\nI don’t think I did anything wrong and Mia was being overly petty. I did make up with her ever since and we’re good now but I still wonder…aita?", "created_utc": 1703766347, "permalink": "/r/AmItheAsshole/comments/18ssr7m/aita_for_giving_two_nieces_the_same_gifts_when/", "score": 3181, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I gave two nieces the same Christmas gifts though one is 6 and one is 9. I think I could be the A because older niece should get something extra for being the bigger girl.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Mia is the kind of person who feels the need to minimize another person to elevate herself. I bet she would not have been happy if you gave more cookies to yet an older person than her.", "A 9 yr old is upset that her 6 yr old cousin had the same number of cookies gifted to her?\n\nHer mother (OP's sister) should have sat her down and talked with her (Mia) about this.  OP, you did nothing wrong.\n\nI am person, who when it comes to gift giving, tried to treat treat my niblings equally while respecting they  are different people.\n\nNTA.  I hope that when you \"made it up to Mia\" it just meant spending time with her and I hope you will spend similar time with your younger niece.", "NTA at all. Mia and her mother were acting ungrateful and ridiculous.", "NTA.\n\nHer mother should have handled this without your involvement.", "JFC Mia complained about getting *cookies*. Talk about ungrateful, on the nine year olds part. And her mother backing her up to complain. Yea, she is gonna grow up to be special. \n\nNext year, give Mia a card.  A *fancy* stupid card. Maybe a pop up card. With glitter and unicorns or some such shit. And the other kid some cookies. NTA", "NAH\n\nYou’re definitely NTA and Mia is nine. She was handling this quite well by not throwing a tantrum and verbalize her disappointment to a trusted adult, her mom. Glad to hear you two made up.\n\nMaybe you could have her help you bake next year. It should be fun for both of you.", "NTA and neither is Mia since she's a kid. Her mom should've explained to her that a dozen cookies is an absolutely normal number of cookies, especially when you're basing them on the *12 days of Christmas*. Mia's mother is a slight AH for even raising it with you. Why make you feel bad over doing something nice for your nieces? I've never heard of anyone getting more cookies based on age.", "NTA, your sister needs to teach Mia to be more grateful", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (18f) am currently on school break and spending Christmas with my family (parents, 2 sisters and BILs, 1 brother and 2 nieces). We the adults agreed only the kids would get gifts to decrease the financial burden. I’m a typical broke college student but also an OK baker so for this first Christmas as an adult I decided to give baked goods as present.\n\nI made butter cookies with lemon icing. My nieces were Mia (9) and Zoe (6) each from different sister. I made two identical boxes for them. Each girl got 12 cookies each. They were shaped like things from the song 12 days of Christmas.\n\nEveryone complimented me on how cute the cookies for the girls were. I also made a batch (plain shaped) for the family and everyone said they were good. Mia did not look pleased, however, and was quieter than usual for the rest of the morning. At lunch, Mia’s mother asked to speak to me. She said Mia felt like it was unfair that Zoe got the same amount of cookies she did when she was the older girl. Mia always thought of me as the favorite aunt and was hurt that I didn’t treat her special.\n\nI don’t think I did anything wrong and Mia was being overly petty. I did make up with her ever since and we’re good now but I still wonder…aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA but Mia's mother is an enabling one.", "Nta-gifting equally is not a bad thing.", " Nta and your cousin is entitled", "NTA - I’d have taken the cookies back if she felt so strongly about it. Children these days are too entitled! Not to mention her mother is an ass for even bringing the situation to you. She should teach her daughter to be thankful for what’s she’s given! There’s plenty of children who didn’t get gifts this year!", "This that’s spoiled kid behavior , cookies are not age restricted.", "She's 9. Her mother is entitled.", "NTA. Mia is at an age where she wants to be grown up and thinks she should have as little in common with “little kids” as possible. In her mind, getting the same number of cookies means you also think she’s 6 I guess? It’s a weird and difficult age as those puberty hormones slowly start to kick in, but you did nothing wrong.\n\nThe person who is TA is Mia’s mom who not only didn’t tell her to be grateful for what she got, she reproached you for not treating her “special” enough. I think you may need to have a discussion with your sister about how rude and inappropriate her comments were. A gift is a gift and she’s teaching her daughter not to be grateful.", "Wildly NTA. When I read the title I thought maybe the gift wasn't necessarily age appropriate for one of them like a little kids gift for a tween or something. CUTE COOKIES?! That's a perfect gift for literally anyone and needing to be special or favorite and get more than someone else is a wild red flag. This would be embarrassing behavior from an older child and that's exactly how it's going to be if your sister doesn't help her work through it rather than snowplowing all her child's hard feelings out of the way so she never has to deal with them.", "Unfortunately the nine-year-old doesn't understand how thoughtful and amazing that gift was. It's legit an amazing idea, using the song to create cookies. The real asshole is OP's sister. She should have explained to her daughter the reasoning behind the twelve cookies and should have never confronted OP regarding her daughter's short-sighted reaction.", "NTA\n\n\n\nBut you do realize what is happening here? Your sister is setting a precedent. She expects you to get/buy Mia the best present cause you are the “favorite” aunt. She probably already had a separate talk with your parents about how Mia deserves more for being the “first” grandchild so that makes her “special”. \n\n\nGood grief. Good luck next Christmas. Make sure to wrap Mia’s present in gold.", "NTA\n\nYou treated your niece's equally. And now, one of them is throwing a tantrum because she wasn't treated like a golden child? That says a LOT about your sisters parenting if she's raising her child to believe that she's owed more than anyone else, but nothing about you. You were fine.\n\nBut your sister needs to stop encouraging entitlement in her child. She may be special to her mother, but to the rest of the world, she's just another 9yo. That may sound harsh, but it's the truth, and one of the biggest problems people have as they grow up is when their parents have given them unrealistic expectations about their own specialness.", "[removed]", "NTA.  Everyone gets the same number of cookies if they are old enough to have cookies.  Five years old, thirty years old, ninety years old - same number of cookies.", "NTA Treat everyone equal, don't play favourites.  \n\nYou can make this a teaching moment by talking about how you love them both the same and they are both special in there own unique different ways.", "NTA. An older kid might need more food than a younger kid, but that's for like...your regular meal food. A gift of treats does not need to be calibrated to the kid's height, weight, and macros lol. There were 12 cookies because that was the theme.\n\nMia was a little sad but didn't actually do anything wrong; Mia's mom is the AH for shit stirring with you instead of gently telling Mia to be thankful. \n\n(I was expecting this to be a post about giving a toy that was too young for one kid or too old for the other, but cookies are universal!  Lol)", "NTA. My sister and I are 5 years apart and still often get matching gifts to this day. Mia and her mother are acting entitled; age should have nothing to do with the quality or quantity of a gift", "NTA and I can’t even believe Mia’s mother would relay that message to you. Of course you should treat your nieces equally.", "NTA at all, your sister is ridiculous and wrong.\n\nMy two youngest are 9 and 5 and my 9 year old wouldn't dream of reacting like this if they got the same amount of goodies, WTF.", "NTA, jesus h. christ. Being older doesn't mean she should get a better/bigger gift, what a spoilt self-centered attitude.", "Mia needs to learn to accept a gift graciously.  It was ridiculous for her mother not to shut it down.  Just because you are HER favorite does not mean she gets special treatment.", "Mia is being a little petty, but at least she comes by it honestly. Her mother should have have a gentle talk with her and not come to you to complain about unfairness. NTA. The asshole here is Mia's mother who missed the teaching moment.", "NTA. Not at all. But that child’s mother is not doing her any favors in raising her and she’s going to have a tough time out in the world. Yikes.", "NTA. Showing favoritism in Christmas gifts should not be a thing. Anyone who demanded it would not be my favorite.", "ffs, what the hell is wrong with your sister?\n\nshe should have nipped that behavior in the bud and you should have never heard a word about it.", "NTA. She'd hate my traditional nibling gifts, then. It's a book and a plushie, different depending on age. Nothing extra for being older. That's ridiculous.", "You are NTA but this isn't about cookies. It's about you being Mia's favourite person and Mia feeling sad that it didn't feel like she was yours. She's nine and she's having big emotions.", "NTA.\n\nMia's mother is TA for enabling Mia's complaint. Her mother's role is to parent and guide and this should never have gotten back to OP. Mia is young so this type of reaction isn't unusual, they're still growing, learning, and developing empathy.", "Nope, that's not how it works at all. If you had purchased gifts for your nieces, you would have spent the same amount of money on both, yes? They get the same number of cookies.\n\nMia is an entitled little brat, and her parents need to shut that rubbish down immediately - it is completely inappropriate for her to expect you will treat her differently to her cousin. This \"But aren't I your favourite?\" malarkey is problematic for everyone and needs to stop.\n\nNTA.", "NTA. Why would Mia get more cookies for being older? What makes her think she’s supposed to get unfair treatment?", "Um age does not mean you get more and your sister is an idiot for playing into that kind of entitlement.  NTA, but unfortunately it sounds like your sister is raising one....", " NTA - Since your niece went to her mother about this first, why didn’t she handle this herself?\n\nNormally when giving a baked gift like cookies, it would be a quantity of 6 or 12.\nThere was nothing wrong with what you did and it should have never been brought up to you.  Her mother was the A** by not correcting her daughter on her manners and gratitude.", "NTA. The mother shouldn’t encourage this behaviour tbh, they don’t have to be the same age to recieve the same amount of cookies, I don’t even understand that reasoning.", "NTA \nOpposite you’re thoughtful and that little sulk over not getting more cookies was ridiculous especially for the mother to give it any merit .", "NTA. What the heck? It's a box of cookies. I was thinking you got the older kid something age-inappropriate by buying two of the same 6-year old's toys, but a box of cookies is not the kind of thing you do that with. Unless mom was just telling you because you were clearly trying to figure out why Mia was upset and she wasn't really expecting you to do anything about it, then she's TA.", "NTA. Mia’s mom should have set her straight on how to accept a gift.", "NTA\n\nThey're 3 years apart, the gift they received was good for both girls. I don't think you have anything to blame yourself for. It was nice. If it was an ordinary gift from a store, then obviously you would have to buy two different ones because it's hard to find something equally suitable for both girls, but it was cookies.\n\nHowever, it was quite rude of the girls' mother not to explain this to her daughter because I think she should do it, that's what you're a parent for. Instead, she let you know as if you were the one who did something inappropriate.", "NTA, if Mia is complaining about getting the same amount of cookies as her younger sister, then she’s not doing Christmas right.    🍪🎄", "NTA. Mia and your sister are being entirely unreasonable. In fact, they’re being ridiculous.", "NTA - \"Mia, baked goods often come by the dozen.  I was thinking specifically of you when I baked and decorated these for you, and I was thinking of your cousin when I did hers.  I'm a little disappointed that you feel this way.\"", "Boy is Mia going to be disappointed when she finds out how few cookies adults get.", "NAH. \n\nShe didn’t throw a fit, just looked a little disappointed and shared her feelings with her mom, who shared them with you.  It’s actually a great opportunity to pull up with Mia and see if she’ll open up about her perspective, and for you to hear out her feelings and reinforce that you love her (not more than her cousin, but it just seems like she’s feeling a little discounted).  \n\nAt 9, Mia is likely starting to feel less like a kid and getting the same exact gift as her younger cousin might lead her to feel like she’s still considered a little kid. I can also see a perspective where she doesn’t feel like the gift was reflective of anything uniquely her.  A 6 year old, otoh, might feel more grown up because she got the same gift as an older child.  A 3 year age difference starts to be more significant probably around their ages and less so as they become older teens.  \n\nNone of this is to say you gave them bad gifts!  The cookies sound lovely!  I just remember being around that age - where I started to consciously understand gift-giving as a way to express knowledge of another person’s interests, which is a demonstration of caring - and getting nice things from well meaning relatives but also feeling like they were generic “girl gifts,” especially if another relative was given the exact same thing.  It was nice to be remembered, for me, those generic gifts didn’t have a lot of meaning for me personally and were an indicator that they were just checking my name off on their list.  Mia may be feeling a little of that.  And feelings are neither good nor bad, they just are. \n\nNow, if her mom’s response indicated she agreed with Mia or included something like “what are you going to do to make it right,” then she is TA.", "NTA\n\nSounds like you went to some time & effort to make the gifts. You did nothing wrong.\n\nMia's mom is the bratty one here for indulging her.", "nta. that’s really stupid and i would’ve shut that shit down with my child right away. i can’t imagine my kids ever thinking that way tho. i always get them equal things.", "NTA\n\nSounds like Mia’s mother handled this very poorly to me.  She is encouraging Mia to be spoiled and entitled.    \nYou did just fine.", "[removed]", "NTA\n\nThey are 9 and 6, not 19 and 6.", "NTA I don't blame a kid for having sibling rivalry, but I do blame the parents for not shutting it down.", "NTA. Equal was the only way to do it. Can you imagine the fit a kid would throw if they found out the amount of cookies was *unequal?*", "NTA - You didn't do anything wrong. Mia was being petty AND also the mother was being unkind about the gift you gave. The whole reaction to your gift is total nonsense and the mother is at fault for speaking to you about it . . . she should have responded to her daughter's pettiness to the daughter as a lesson in gratefulness.", "NTA. This was a learning moment for Mia, and as long as she understands why this is how it was, then it's fine. The cookies sound great though!", "NTA\n\nMia is not special and shouldn’t be growing up thinking she’s entitled to special things because she’s better/older/prettier/whatever. It’s a good lesson for her to learn. Her mom should be ashamed for raising her like that.", "NTA\n\nShe’s 9 so there’s hope, but your sister should have explained to her child while her response is not ok and left you out of it.  \n\nYou did the appropriate thing by giving them equal gifts. Giving Mia more would have been rather mean to Zoe, frankly.", "Yikes Mia is going to be a nightmare in a few years if her mom is acting like that's reasonable behavior", "NTA\n\nYou are the adult with an adult brain doing the responsible thing by treating the children the same. Zoe is a child, an only child at that, so while she is allowed her feelings it doesn't mean you should question yourself because she has her own view on how thing should be.", "Lol NTA. This is typical childish \"they got more sprinkles/icing/etc! than me!\" \"I'm the oldest, I get more!\" shit. All kids go through it, and it's important for her mom to set boundaries about fairness", "So the 6 year old gets 12 cookies, the 9 year old should get 18 cookies and what about 90 year old grandma? She gets 180 cookies? \n\nThat's not how Christmas works. NTA", "[removed]", "NTA.....Mia is a spoiled brat and her mother is enabling her behavior. You should probably get ready for more of this ridiculous behavior, because it isn't going to go away. I thought what you did was lovely and very creative. To me there is nothing nicer than a gift made by the giver, from the heart. And by the way.....if I was in your position, I would be careful about letting Mia think she is the \"favorite\". This could lead to some really uncomfortable and hurtful moments.....especially for Zoe.", "[removed]", "NTA. On my dad's side of the family there are 8 grandsons and 2 granddaughters. I got to grow up watching my only female cousin be openly favoured by everyone. You're right to treat your nieces the same. You'd be my favourite aunt too. Kids notice if they're treated as lesser at a very very young age. And if you ever come to Wiltshire I'll pay whatever you want for a box of cookies shaped like things from the 12 days of Christmas! Everyone I know would love them!", "NTA. You did nothing wrong. All cousins are the same, giving one more or better leads to resentment.", "I think the older child needs a dash of reality sprinkled on that entitlement she’s carrying. \n\nNTA.", "NTA. This is precisely why when buying gifts for my grandbabies, I always consider so many factors. I often give *gifts* of no money value, like baked goods and soups and stews because I know my son struggles and his wife cannot cook. I also provide help financially when it is needed. Home cooked/baked food is a goddamn blessing. Someone cared enough to spend time, specifically making something special! This year I was also able to make a  blanket for my newest grandson and a big boy blanket for my oldest grandson and a baby blanket for my granddaughters baby dolls (I crochet). The older daughter (and mother)  are wrong. No shame in heartfelt, homemade gifts.", "NTA\n\nThe gift was age appropriate to both kids. The mom is extreme ah for encouraging this behavior. Age would be relevant if say you got them both CandyLand and it’s not an appropriate gift for the older one.", "NTA. Mia is entitled and your sister indulges that behavior. She can have that feeling and speak with her mom, who should have a conversation explaining how it's a selfish and entitled complaint and that's where it stops. Don't feel bad and don't enable a brat.", "NTA. You did treat Mia as special when you took the time to make home-made themed cookies. True, you similarly treated Zoe as special, but that doesn't detract the thought which went into the themed cookies Mia received.", "NTA, neither are the kids. The mother is for not handling it herself.", "NTA.  Mia's Mum should never have spoken to you about this in the first place.  She shouldn't be encouraging her child to think being older equals getting a bigger, better present.  Also, encouraging her thinking that she is the favourite niece is out of order.", "Mia is being a little brat and her parents are condoning it. That was a sweet and thoughtful gift. NTA", "NTA, there are none here.\n\nI wouldn't have thought that a 6 year old and a 9 year old were far enough apart in age that a dozen cookies for each wouldn't be appropriate.  I have kids, and didn't differentiate between them to that degree.\n\nMia is a kid, they get to feel the way they feel and show it as long as it isn't too disruptive.  Sounds like it wasn't, and she was able to work it out with you.\n\nThe sister could have been an AH had she came to you in an accusatory fashion or supported her daughters hurt feelings, but it sounds like she just explained the situation to you.  \n\nBased on the story here, everybody is just fine and Christmas was saved!", "Whoa! NTA! It is time that Mia realizes that she does not deserve anything different or better than her cousin.", "NTA at all. and tbh if you'd given mia a gift that made her feel more special and like she was your favorite, you would've been an AH.", "NTA. Why would Mia get more cookies for being older? What makes her think she’s supposed to get unfair treatment?", "NTA, but your SIL surely is and she is teaching her daughter to be one, too.", "I totally get her. I got some products my SIL made, and I got the same amount as my other SIL who is 3 years younger than me (I'm 37 and she's 34).  \n\n\nKidding. This is ridiculous. How embarrassing for an adult to go and \"confront\" an 18 yr old for something like that. Wow.", "So basically, Mia told her mom that she deserved more because she loves you more, and mom agreed. \n\nI would let these two work it out for themselves. If you address it like it is a real issue, it becomes more real to them. I would just say \"how would Zoe feel if she got less? I didn't make them cookies to make either of them feel bad. I didn't know Mia felt entitled to more than others\". Then I would add in that sis should work on that before it affects Mia's ability to maintain friendships later in life. \n\nFrom there, they can chose to be narcissistic or chose to treat people how they want to be treated. But you were right to keep it equal!", "NTA. This is Christmas not a birthday. I can't blame the kid for sounding so entitled and princess like considering it has to be the parents that are raising her this way. Being an only child can be hard when said child gets everything they want and it comes time to share or be treated equally as they usually are treated like the only girl/boy in the world. But again it's up to the parents to teach their kid(s) that just because mommy and daddy may spoil them to death doesn't mean someone else should have less or that they should always have more. I would've sat her down and told her this. Wspxually bc Christmas isn't about gifts or who has what better or who got the most expensive thing. It's about being with loved ones. Mother should've explained tht to her kid instead of trying to get OP to bend to what her niece wanted which was ultimately \"I get more and better bc I'm older and special and the favorite\"", "Mia's mom is a rude cow and it seems to be rubbing off on Mia.", "NTA. What disgusting behavior. Mia needs to be socialized soon", "NTA, and it's WEIRD that Not only does the child believe you being HER favorite aunt should automatically mean she's your favorite niece and should therefor get a bigger/nicer Gift from you, but also that her PARENT confronted you about it and brought absurd reasoning into it. Being quantitatively fair in Gift giving for children a GOOD Thing to prevent rivalry,  because the one who received less feeling left out is supposed to be seen as worse than someone not being treated as Special as they feel entitled to. Also there is no reason to justify why a 9yo should get more sweets for Christmas than a 6yo. (It's MAYBE sort of reasonable that a toddler who is physically much smaller so gets mood-altering sugar rush from a smaller amount, or an adult who is supposed to be proud of valuing \"Moderation\", would get less sweets than either a 6yo OR a 9yo)", "NTA - Mia is just being a typical kid with her kid logic. They think they are getting the shorter end of the stick because their younger siblings will get something better when they are older.\n\nJust tell Mia you love the siblings equally, but when some gifts are age universal, you are expected to make things equal so that the younger one doesn't get upset. Since she is the older sibling, they will be the wise one who may have to sacrifice her age privilege to help the adults have less crying kids to parent.", "NTA; your sister is risking raising an entitled brat.", "NTA\n\nMy kids both got exactly the same things from their uncles - a Cadbury selection box and either £10 cash or £20 gift card.\n\n9 year old B doesn't like milk chocolate but isn't upset that she got them, or that 4 year old N got the same selection packs as her (although I did buy B some sweets the next day, to make up for it).  She's more excited about spending her money.\n\nB was more upset when she thought N had gotten more for Christmas from my parents - my parents gave N a set of colouring books and a pack of pencils, B got a spirograph set and a full ream of paper.  Both girls got a giant LOL doll, B had an aquabead set and N had an LOL vet set.  More Cadburys for both, but I knew in advance & had a white chocolate selection pack to swap straight away.  Similar amount spent on both, same number of presents each.", "NTA. Reading the title I was prepared to swing the other way. For instance if a 3 year old niece received some Paw Patrol toys and her 12 year old cousin got identical Paw Patrol toys, not so great. This was a cute thoughtful age appropriate gift!\n\nI also have many niblings and their gifts are of roughly equal value, I wouldn't think to give the older ones \"more\" than the younger ones?", "NTA - Your sister comes from a big family so she has enough experience to know that you don’t get different amounts of food in gifts. She’s raising a brat and she’s going to regret it when that brat hits her teen years.", "NTA. This was a teachable moment, and your sister completely flubbed it.", "NAH. Mia is likely not sad that she didn't get more cookies or the other niece didn't get less, she's upset because you're her favorite aunt and you got the nieces the same gift which made her feel like she wasn't special to you. She's nine, she's just bad at figuring out why she feels the way she does. \n\nHomemade cookies are a great gift, especially for a broke college student, but I do have to say that sort of gift doesn't feel to kids how it feels to adults. If the kids get homemade cookies, they were never the ones to put the work in-- or if they did, baking was a fun game. So theres no \"oh i get to have delicous homemade cookies but didnt have to do the work\" that adults appreciate so much. I think it was a good gift for the wrong audience and generic gifts like that make kids feel like you don't really know them.", "oh for heaven's sake - her mother should have nipped that attitude in the bud.  Absolutely NTA.  That child is going to be an interesting teenager if her parents are letting her get away with crap like that.", "NTA\n\nMia’s being petty, yes. However it’s not unusual for her age.\n\nThe asshole here is your sister, for basically telling you that you should be giving her daughter special treatment for - *checks notes* - “reasons”. \n\nIf Mia’s being raised with this attitude and expectation, then it wouldn’t be surprising if she became an insufferably entitled adult", "NTA\n\nShe's just envy 'cause you \"just put the same effort for the gift of both girls\".  \nShe didn't wanted exacly more cookies, she wanted that zoe had gotten less than her.", "NTA. \n\nMia isn't the AH, because she's 9 and is learning. \n\nMia's mom, however, is. This was a teachable moment about being gracious when receiving gifts. \n\nBut she didn't make it a teachable moment. She decided to make it your problem instead. What exactly was she expecting you to do? Get Mia an extra gift? Apologize to a 9 year old for \"only\" giving her 12 cookies?", "Nta", "Mia is going to grow up to be like my entitled SIL. Back in the day, when I was a broke college student I used to bake for people for Christmas. One year (then future SIL) said I only baked because I was too cheap to buy gifts. That was the last year she got any damned cookies!", "Lol wtf take her cookies away", "NTA-  you are a college student.  It’s amazing you took the time to make cookies", "NTA, that sounds like a lovely gift.  Your sister never should have come to you and told her child to stop being an entitled brat. Since when does being older mean you get MORE cookies/candy? That's not a thing.", "NTA. This isn't your problem. This is a parenting issue. Instead of pulling you aside, she should have taken her daughter to the side and explained to her that she should be grateful for the gift. Also, her mother telling you this tells me that she expects her daughter to get special treatment, which is probably where Mia got this behavior from.", "NTA - Sorry but Mia's mother should have told her daughter to not act like a spoiled brat instead of coming to you like you did something wrong.", "NTA.  My girls are two years apart and, when they were younger, problems were more likely to arise when their gifts *weren't* identical (and they often received more or less the same things in different colors or sizes).\n\nYour gift was sweet and thoughtful and within your budget.  I don't fault Mia for expressing her feelings to her mother (it's hard for a child *not* to show disappointment non-verbally, and at least she didn't say anything when she opened it), but I feel her mother missed a parenting opportunity here.", "Seriously? NTA", "NTA. The only problem here is the A H mother who doesn't correct her child for thinking she deserves preferential treatment", "NTA.  Your sister should not have even brought that up to you but instead nipped it in the bud.  If she did bring it up to you, she should have done so after she set Mia straight just to warn you that Mia had some feelings that she should have been treated differently, so she might be distant while she deals with understanding that you did nothing wrong.", "NTA. LOL. She’s nine. She doesn’t have a f\\*\\*king clue what she’s talking about, and her mother is clearly an enabler. I guarantee that kid is going to grow up to be a self-centered brat who can’t figure out why nobody likes her.", "NAH except possibly the mother.\nYou did what you thought was best but kids are weird.\nGiving them the exact same thing was probably a mistake - it makes the nine year old feel like she's being treated like a little girl.\nKids are sensitive about this shit. Don't know why but you can't change it. \nAnd siblings are a whole minefield of mixed feelings and jealousy.\nYou probably would have done better to make them different cookies based on what they like or maybe offer each a private fun day with you. (Could take them on a picnic, to the park, etc ).\nGifts need to be similar enough but also different enough that they feel individualized.\n\nThat being said, it's not your job to navigate the whole minefield that is kids and siblings as a nineteen year old.\n\nAnd the mom should definitely have dealt with it, possibly informing you but at the same time she should have explained things to the kid herself.\n\nAlternatively, she maybe should have guided you a bit earlier, if the girls are going through an especially sensitive time.\n\nIn any case, glad you made up.\n\n*Yes, I have a lot of nieces.", "NTA. Also, the cookies were themed on the *twelve* days of Christmas. Were you supposed to invent extra days???", "Info - was mia’s mom trying to guilt you, or was she just explaining Mia’s behaviour?", "NTA \n\nTell her if what are you going to do when she's 40 does she want 40 cookies then? She will be a right heffer. Tell her she got three extra because she's only 9 and the other one got 12 because she doesn't believe in babish things like age being important.\n\nEdit: added NTA", "100% NTA.  From the title I was thinking you’d gotten them the same craft kit for young children or something, but *hand-baked cookies* have no age limit.  I agree that you need to have a sit-down with Mia’s mother about her child’s entitlement.", "NTA, I assume you love them equally so you’re treating them equally", "NTA, but Mia's parents aren't exactly covering themselves in glory here. \n\nThis gift idea sounds rad, too", "NTA - she isn't entitled to more because she's older.", "NTA.  What were you supposed to do?  Put a plate of cookies in the middle of the Thunderdome so the kids could compete for them?", "NTA Mia's mother is TA and before long Mia will be also", "NTA.\nYou treated them both equally, because they are both equally your nieces.\nMia is young, but she is being kinda bratty and her parents should make it clear she cannot expect special treatment just because she thinks she should be the favourite one.", "NTA.", "NTA.   Mia’s mother should have shut that down immediately.   What you did was lovely.  Don’t worry about it.", "Q we put a", "NTA. Why would Mia get more cookies for being older? What makes her think she’s supposed to get unfair treatment?", "Oh, there was nothing to make up for and maybe you did more damage than help by doing so. She thinks she should get more because she is older? That's the beginning of a very entitled brat.\n\nNTA", "NTA. You did the right thing. Your niece is just being a kid and thinks older equals better or more important. \n\nAlso, to anyone: WTF is Poo Mode?", "NTA. Mia's mother is teaching Mia to be shallow and ungrateful. You did not owe it to your nieces to give them gifts. They are lucky that you cared enough about them to bother. People like Mia's mother take all the fun out of gift giving. Ignore her and don't change how you do things in order to suit her shallowness.", "Being older does not get you more or a better present. I have four nieces and nephews and we spend the same amount on them equally. It’s usually gift vouchers now as they’re a bit older and those let them go buy something they really want. At age 9 your niece is old enough to know how to be gracious in accepting a gift and her mother is the AH for not teacher her this properly.", "NTA - Mia's mum is making her a spoilt brat.", "NTA and it's super obvious", "You're NTA. Mia is a bad sport. And a whiner, whose mother needs to teach her proper etiquette; because it is never acceptable to complain that your present needed to be more.", "NTA.\n\nYou didn’t do anything wrong, and neither did Mia. She’s a 9yo who wants to be treated as “more grown up” than her little cousin, totally normal! \n\nThe only potential AH behavior here is your sister depending on her tone. If she was just letting you know so you’d be aware of why Mia was quiet, then that’s fine and she was just keeping you in the loop. If she tried to make you feel guilty or insinuated that you were being unfair, then it’d be AH territory.", "INFO: Was Mia's mom just explaining her behavior, or coming to you expecting you to do something about it?\n\n9-year-olds are AHs, it's baked-in. So that's a given. But if mom is enabling her pettiness and greed, then she's the AH.", "Nta that’s like me being upset with my SIL giving my husband and I the same snack baggies. FYI which I do love eating and since I don’t always eat sweets (not like I used to anymore :(( due to gestational diabetes and pre diabetes prior to my pregnancy due to genetics) my husband eats the rest of", "NTA.  Mia was being petty and selfish.  She probably thought she could wheedle more cookies out of you if she said she should get more for being older or the favorite.  If you would have given Zoe less cookies, it would have hurt her feelings.  But Mia is only 9 and she's probably found out that saying things like this to her mother works to get her way.  Not getting her way this time is a good life lesson that not all people are easily manipulated by things like this.  You're fine.", "NAH, I'm not gonna say Mia was wrong or right here. You did nothing wrong, she's just being, well, a kid, lol. I remember at 9 thinking it was a big milestone to soon hit double digits and being treated differently. I just hope your sister gave Mia an explanation over the whole thing before telling you why she wasn't acting thrilled. I'm glad you two are sorted out, don't lose sleep over it, it sounded like an adorable idea for a Christmas gift.", "NTA, mostly.\n\nyounger sibling here with about the same age gap: your sister needs to nip that in the bud now. my sister is a bit of a nightmare because my parents didn’t. it’s gotten to the point where i have threatened to leave family gatherings and not come back because she was such an AH to me and my parents indulged it as if it were funny. an extremely mild example: one year my SO came to xmas and gave me a bunch of small presents and it got to my sister so badly that she didn’t have more presents than me. WE WERE IN OUR 30’S!!! 🤯\n\npleeeeeeease don’t indulge her need to have more and be more special than her sister. it always backfires *spectacularly* in the end.", "Thanks for not just dismissing the child as a horrible brat. She's a kid experiencing difficult emotions. She didn't throw a fit, she just didn't look pleased and was quiet. If a parent had acknowledged her feelings but been firm about the gift being fair and the importance of grace and gratitude, it would have been fine.\n\nThis is just yet another example of a parent deciding that any time their child experiences a difficult emotion they have been wronged. My kid is disappointed they got an equal number of cookies? The person giving cookies is wrong. My kid is jealous that another kid got more presents? That kid's parent is wrong for giving their child more than I gave mine.", "I would explain it as school lunch. Doesn’t matter if you’re in kindy or in 4th grade, the meal is the same size.", "Completely agree. NTA, but the sister is 100% an asshole. The entitlement of the sister is outrageous if she is advocating for the 9 year old’s poor behavior. She needs to parent on this one. The only thing you should have received was a ‘hey Auntie, thank you for the cookies. They are awesome and I appreciate you baking for me’. The parent has then done their job. \n\nThis is insane.", "Agree. This is ridiculous. Being older does come with some additional privileges, seeing a movie the little one can't, etc. It doesn't entitle you to more gifts. \n\nNTA. Mom should be nipping this attitude in the bud, not encouraging it.", "In my family it's always been 'norm' to give the older kids something more expensive.. I.e. I'd get a \\~30$ gift and my brother/cousins his age would get a \\~50$ one.. But our age gap is almost a decade.. Seeing your comment made me realize it's only... 3 years. that is almost nonexistent :').. \n\nI'm assuming it's not about the gift value itself, because she doesn't seem upset about the cookies themselves! So at least that's a good sign that this is more something personal she's struggling with than actual gift values/her feeling spoiled :)", "It's not as if both got a book suitable for 6 year old because they were buy one get one free... homemade baked goods are a treat for any age, and both girls should have been happy to receive them. The 9yo's mom should have put a stop to this, bit made it OP's problem!", "Reminds me of my MIL. She gave the granddaughters the same gifts, even though 2 were 7 and one was 15. \n\nMy 15 year old niece snickered when she got a giant Barbie coloring book like her little cousins.\n\nAbout 20 minutes later, I caught her and a male teen cousin in the dining room, each coloring a page, lol.", "*That's a perfect gift for literally anyone ..*\n\nAbsolutely. OP, please feel free to send me cute homemade cookies. I will take any quantity, I am not fussy.   NTA", "I would love cute cookies as a gift.\n\nIt is probably some teenager hang up.", "Mia strikes me as a the typical childish complaints of \"they got more X than me!\" etc. Me and my siblings went through it, as did many other kids. But she's old enough her mom should be setting boundaries and not enabling it for sure", "No tantrum from the 9 yo, it was her mom who felt the need to \"correct\" the situation.", "Not a golden child but just the favourite niece. There is a difference.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "they said their niece considers them 'the favourite aunt' not the other way around", "NTA but it’s a little overboard to call Mia a brat. She’s definitely acting bratty, but she’s 9 yrs old and that’s kinda to be expected. \n\nAround 9 yrs old is when children begin to navigate industry v inferiority, which means they either begin to develop confidence or struggle with self esteem issues, and a lot of that development occurs in social situations. Therefore, wanting to be treated special by someone she values is very normal for her age. \n\nIt makes sense that she wants to be celebrated at her age and she should be celebrated, but she’s a kid and doesn’t know how to phrase that need so the ask comes out as more cookies. OP and her sister should find more social and less material ways to fulfill Mia’s need for social connection and individuality, like maybe OP FaceTimes or writes her letters or spends a day just the two of them when she’s home from college.", "The children are old enough to learn that it’s ill behavior to “look a gift horse in the mouth.” \n\nThat is, to find fault with something that been received as a gift or favor. \nNTA.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Right I would have eaten two of my kids cookies and said problem solved now you have less for being ungrateful.", "My sister and I are 3,add in my step sister it’s another 6-3 years between us 3 girls total. \n\nWe all get the same gift some times lol only difference is the color😅\n\nOne gets pink,one blue,one sparkles. Maybe different animals on it or a character etc.\n\nBut I’ve gotten the same gift as my older sister from my dad,only blue/sparkles not pink/purple.\n\n\nWhich we don’t care even at 9/10", "I’m not sure it’s the kind of person she is, though. This is a young kid acting bratty, most kids are at least a bit selfish. Yeah, her reaction was petty, but it doesn’t necessarily mean that’s who she is.", "Well, yes, she’s 9. 9 year olds are bratty little shits like that.", "Add a $5 gift card to Starbucks lmao. Those cookies cost way more in time and effort, most importantly love. Appreciation is everything", "Same. My cousins kids got books until they were 9ish, then they got Legos, and now that they're all teenagers, they get Amazon gift cards.", "This is a really great reply; thanks for sharing this insight. \n\nI do find it weird that Mia's mom didn't handle it with her daughter- talk her through her emotions, offer suggestions on how to handle those emotions. The Mom is an asshole in this situation, imo.", "Exactly. If OP had made cookies for all, would people who were 40 be entitled to 40 cookies?\n\nMia's mom is weird to not only think this, but to actually voice it. Especially regarding a *gift*.", "My thoughts exactly. It's normal for little kids to find small things like this \"unfair\", but it's the parents' job to teach them how to navigate situations like this. Mom should've explained to Mia that she isn't always going to get \"bigger and better\" than her sister, and that's okay. That's life. They got the same thing because Aunty loves them equally, Mia doesn't get special treatment just for existing.", "They are cousins, not sisters.", "Don't tell her baked goods often come by the dozen, tell her the damn song the cookies are decorated for is the TWELVE Days of Christmas! They each got 12 cookies because of the song. OP needs to ask Mia what days her younger cousin wasn't deserving of.", "Maybe OP can ask which part of the song she should have left out for the younger niece 🤷", "In the context of the older girl feeling more grown Up than her younger Cousin, it would probably be helpful to Point Out that If she were an ACTUAL adult, even a young adult Like 18yo aunt, she would Not receive Gifts from all present family members, so she would get plain-shaped Cookies of the same flavor to try, but No song-themed ones nor ones that belong to her to take home and eat later.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yeah, but Mia's mom is a raging AH. Help your child deal with disappointment, explain that gift giving should be equitable, regardless of age. As a parent, you don't berate the gift giver for not treating your own angel *extra special*.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "> I wouldn't have thought that a 6 year old and a 9 year old were far enough apart in age that a dozen cookies for each wouldn't be appropriate.\n\nAlso, they were special cookies done as a set to match a well-known Christmas song, it's not like it's a tin of generic round cookies.", "[deleted]", "Should have asked for 6 back.  The adults got one batch to share, since niece is older she should share more of her cookies like the adults are.", "It's not. It's typical child behaviour and is a result from having siblings and cousins. My siblings and I did this all the time - it's partly competitive, partly that you feel slighted (even if you weren't). Mia is acting like a typical child. However, she *is* old enough to be talked to about this behaviour and that just because she is older doesn't mean she always gets more. Stop shitting on a 9 year old for acting like a child", "The only siblings are OP and the mothers of the 2 girls. Did you miss this: \n\n>My nieces were Mia (9) and Zoe (6) ***each from different sister.*** \n\nThat means that the girls have different mothers.", "I have a sister two years younger than me and when we were under 10, we also used to get very similar gifts for the same reason. My other sister is 6 years younger so different gifts for her wasn't an issue since she was a \"baby\" but if my middle sister and I got different things, one of us would likely make a little fuss.", "I agree with your NAH judgement and questioning Mia's mom's motives but...\n\n>Giving them the exact same thing was probably a mistake - it makes the nine year old feel like she's being treated like a little girl. Kids are sensitive about this shit. Don't know why but you can't change it. And siblings are a whole minefield of mixed feelings and jealousy.\n\nI'm not onboard with any of this. Firstly, they're cousins, not siblings, but mainly, ***you absolutely can change that behavior*** and as a parent that is your entire responsibility. Giving them the same gift was not a mistake at all. It was a gift that OP spent time, energy, money, and love to make for her nieces, and expecting it be a custom, catered thing is entitled. Yes, you are correct that children can be sensitive about these things, but that is exactly what parents are for to step in and help them use age-appropriate methods to cope with what is for them a difficult concept. Mia needs to learn that she's not entitled to \"more\" just because she's older, and that can absolutely be done gently.\n\nBut, again, I do agree with you that Mia's mom is possibly an AH, but that depends on how exactly that conversation with OP about Mia went. If the mom was just giving OP a heads up, like, \"Hey, I talked to her, but just to let you know, Mia is upset at you and here's why, and it might be good for you to talk to her, too,\" then that's not a problem. If she was trying to blame OP for upsetting Mia and prompting her to make it up to her or resolve the issue, then I'd call Mia's mom an AH. But we don't really have the context for that judgement.", "Seriously. How messed do you have to be to think that “favorite aunt” should be an exclusive title and the aunt needs to work harder to keep the title?\n\nEdit for clarity: Mia’s mom is the AH.", "Yeah this is all mom’s fault. Mia acted out of turn but a kid can’t be fully at fault for their own behavior. It’s often a product of their parenting or developmental age. I can’t believe all the “Mia is such a brat!” comments.\n\nAnd as someone who doesn’t have kids but plans to, I love gentle parenting. It’s great that kids feelings are finally being respected. One of a few unfortunate byproducts if it’s not done right is exactly what you describe", "Agreed. This happened to me and my cousin who’s three years younger than me. Grandma always got us slightly different versions of the same thing. Which was weird cuz we had different interests and it always felt like we were being by compared (adult me knows this isn’t true preteen me was a little frustrated but polite and thanked them).\n\nMom needs to make sure Mia is being appreciative of the gifts. I wonder if maybe the mom was trying to explain why Mia was being out of sorts and not saying how come you don’t treat her special? I know after Xmas one year I expressed to my mom that my cousin and I hated having the same gifts and the next year things were different.", "I don't think it's about the cookies. It's about being treated \"the same\" as her younger sister.\nShe probably would have gotten better response if she'd given them the same amount, but different shapes or flavors based on their likes.\nIt made the older sister probably feel like she was being treated like a \"little girl\".\n\nKids have a whole minefield of their own politics... Which are ridiculous when you're older , but very important when you're 9.\n\nI don't think OP or the niece are AHs here. The only one who should have done better was the mom who should have explained things to her daughter.", "it’s not spoiled behavior, it’s age appropriate. the 9yo is at an age where she wants to be feeling independent and like a teen and not a child/baby anymore, so getting the same present as her younger (by 3 years, which is a lot for a 9yo) cousin is making her feel like they’re treating her like a little kid", "no, it's perfectly normal kids thinking. they just need to be spoken to and learn from it.", ">But our age gap is almost a decade.. Seeing your comment made me realize it's only... 3 years. that is almost nonexistent :')..\n\nTo be fair, 3 years is a HUGE age gap to a 9-year-old. It's 1/3 of her life.", "I would agree with you except for the fact that her parent's reaction was to coddle and enable her - and to tell OP that *she's* the one who needs to do better.  At that point I see no reason to assume that's not who she is.  \n\n\nIf anything, her brattiness is being reinforced and will indeed become her personality (if it's not already).", "Oh absolutely. Mia's mum saw her kid was sad and immediately made it OPs problem instead of addressing Mia's emotions with her. That's a real shame.", "Yeah, she's acting the way her mom has taught her to\n \nHad I gone to my mom hurt about it, she would have reminded me that my Aunty put in a lot of work to make those cookies and that I should be grateful that she was so thoughtful to make them special shapes and would likely remind me that she probably doesn't have a lot of money\n \nInstead her mom was like \"let me make a stink on your behalf!\"", "My point still stands.", "I actually don’t feel that gifts for an older teenager and gifts for a young child should automatically be equitable- here the difference is relatively small, so the gap between gifts, if at all, should be, too. In the case of this particular gifts, it would be weird. \n\nAnd the ‘favourite child’ thing is something that happens, but shouldn’t be blatant.", "Nowhere in the story did OP say that Mia's mom berated her though. It's perfectly fair for Mia's mom to inform OP about what Mia was feeling, that way OP didn't have to go guessing and could choose how to deal with this info.", "Nowhere in the story did OP say that Mia's mom berated her though. It's perfectly fair for Mia's mom to inform OP about what Mia was feeling, that way OP didn't have to go guessing and could choose how to deal with this info.", "Except Mia and Zoe are from different sisters meaning they're cousins, not sisters.", "What? Never in my life did - let me count- 15 cousins on my moms side and 6 cousins on my dads side- ANY of my cousins act like this nor did I.\n\nETA. This is not “child” behavior. This is behavior that has not been corrected. Parents are 100% at fault for failing to teach manners.", "The girls are cousins, not sisters.", "How dare you be reasonable about kids on reddit!! \nYou’re 100% correct tho, the age politics with kids are huge.", "Oh yeah that's why I can kinda understand the 9 year old feeling slighted without her actually being spoiled! She thinks she's a big girl and wants to be treated that way, but there's a talk to be had here by her mom..! It's moreso that I see everyone act like different gifts based on ages is very odd, it's really not :')!!", "Equitable doesn't have to mean the same. But giving one elementary aged child more cookies than another elementary aged child is not equitable by any measure.", "Maybe not but she did pull OP aside and lay on the guilt trip - “Mia always thought of me as the favorite aunt and was hurt I didn’t treat her special.” So fuck the other niece right? Cause Mia didn’t feel special enough.", "Ok, but it's still very common. Common enough that multiple pieces of media use this trope as a joke because it's relatable. And I have 5 siblings and 14 cousins and went through this. I suppose it isn't universal, but it definitely isn't abnormal.\n\nAnd I did say at the end that she is definitely old enough to be corrected and for proper boundaries to be set regarding this behaviour.", "I doubt the \"feel special\" was about the number of cookies so much as it was about getting what she might see as a generic gift because it's the same as her cousins and she's expressing that badly because she's nine and nine year olds aren't always good at verbalizing the cause of their feelings...", "No, but her adult mother should help her work through her feelings and understand how to be gracious when receiving gifts. Not go guilt trip the 18 year old who was doing her best.", "At Christmas this year we had 5 kids ages 4 - 10. All of the kids got the same box with 4 handmade chocolates from one of the adults. \n\nNTA", "NTA. Someone needs to parent Mia, and let her know that just because she's older doesn't mean she's entitled to be treated special. They are equal. If you had given Mia more cookies, the younger sibling would have been upset. The mom would've came up to you and asked why you gave Mia more cookies as the younger daughter is upset. \n\nEither way, lose-lose situation. \n\nMia's mother is TA in this situation. She should've told her to be appreciative. It's unfair for one child to be treated differently than the other. You gave them an equal gift.", "NTA.\n\nMia's parents are on track to creating an unpleasant child and terrible sibling dynamic.", "The mother should have shut this down. Her being older does not entitle her to more.", "NTA it's food nothing to complain about and they barely have a age difference", "NTA.\n\nYour niece's reaction is very typical for that age. She thinks that her sister is a \"baby\" and she is so much older and more mature and that everything should reflect that.\n\nHer mom should have taken her aside and given her a little talking to.", "The day that a pre-teen niece or nephew starts giving me shit will be the day I cease being a Favorite Uncle.\n\nNTA.", "NTA. Mia is a brat.", "Absolutely, positively NTA!!  \nYour sister is the AH for entertaining such an entitled attitude and major AH for missing out on a perfect teaching opportunity. How would Zoe feel about being treated as the \"lesser\" niece? Of course they should be treated the same in this situation.", "NTA - Mia’s mother obviously thinks *her* child should get special treatment over her cousin, and has obviously told Mia as much because why else would she be upset? By giving them the same gifts (which, as a 28yo, I would have been THRILLED to receive btw), you communicated to both Mia and Zoe that that’s not the case, at least in your eyes. I’m guessing that Mia’s mom is always dismissive and rude towards Zoe; prioritizing your own kid is one thing, but she doesn’t get to demand that other people do the same. If your title as “favorite aunt” is contingent upon her getting special treatment from you, it’s not worth holding onto lol\n\nW Aunt moment", "NTA- they better nip that in the bud now. Lol", "NTA \n\nher mother on the other hand, should have talked through this with Mia so she understands the importance of 'sharing' / 'equal treatments' \n\nI mean her mother should probably have handled certain things differently beforehand if Mia expects this kind of entitlement (and no blame to her, she's a kid who's just dealing with life as she's learned to).", "NTA By this reckoning, Mia will always get a better gift because she is older. If it were an age dependent gift, it would be different, but it isn't, so Mia's mom is raising her to be an entitled little AH in a few years. By this reckoning, it wouldn't be just gives either. Mia will always get a bigger piece of cake, a larger slice of pizza. Can't you see her at 30 doing the same thing? \"I get first dibs on the vacation condo beds because I'm older.\"", "You didn't do anything wrong and your sister should have told Mia she shouldn't expect more cookies just because she's older. Your sister is raising Mia to be a brat. \n\nNTA", "NTA \n\nBut your sister is for not nipping your entitled niece in the bud.", "Are you worrying about gift giving etiquette based on the behavior of a 9 year old?", "NTA. Socks and batteries for Mia next time since she wants to be an adult. That’s what my parents put in my stocking, among other things adults might use, like a fancy sewing kit, and I’m not going to lie I was super content with it.", "NTA. Your niece is just a kid so maybe she has an excuse but her mom should understand that you are being fair and kind by doing identical or equal things for your niblings. I have a niece and nephew and make a point of giving them a similar dollar amount of gifts for Xmas or birthdays. I don’t have a favorite nibling and I’m not going to show favoritism. I know how much that sucks to feel like you’re the least favorite.", "NTA.  \nI was honestly expecting it to be something like they were 13 and 23 and you bought them both a 'my first make-up kit' or similar.", "nta\n\nyou should give her MORE cookies because she's older?  That's not how gifts work\n\nWill she expect you should in future buy her more expensive gifts because she's older? Again, not how that works.\n\nIf this is typical behavior on Mia's part, I would just say she's old enough not to get gifts.  I don't give truck to enabling selfish greed.", "Tell her you love both of your nieces equally and that you don't pick favourites. It wouldn't be fair on Zoe for her to get less just because you favour Mia, and likewise, it wouldn't be fair on Mia if you decided to favour Zoe. She is just a kid and she is being petty and selfish about it, just calmly explain that it is only fair they get the same and that is that :) She likely won't even remember it as she gets older, kids get upset about the most ridiculous things sometimes\n\nEdit: NTA lol", "NTA\n\nIt's a really nice gift.... for anyone of any age.  It had a specific theme where 12 cookies is the optimal number to give.\n\nSounds like Mia is learning this at home.  I'm not sure what Mia's mom is teaching her and how but it deals seem like she thinks she's now an 'adult' or at least needs a more mature present than her 6 year old cousin.  Is there a competitiveness between the two mothers?  Or between the two girls ie does the 6 year old always want to play with the 9 year old regardless of what she's doing?\n\nThis is not really about the cookies but something underneath.  \n\nThe present is no different to buying them each the same box of chocolates (but with more effort and thought).  But that might have been a problem too.\n\nI guess the lesson from this is to not give them the same present regardless of how appropriate it might be.", "NTA, Mia is acting like a child her mother should have told her be thankful for what she has and it’s not a competition. Her mother needs to get her head out of her a$$ and parent her.", "NTA, but I can see why Mia is upset. It’s not about “I want more cookies” (even if it comes out like that; kids aren’t very good at parsing their emotions), but wanting to be seen as different from her little cousin. Next time, just personalize the cookies in their favorite colors! It’ll go a long way ❤️", "NTA", "I’m 33 id have loved that gift lol. NTA", "Why did the mom pull you aside for this? I feel like she could have just told mia to be grateful of her gifts.", "NTA Mia is a disaster in the making, says this auntie of 9 nieces and nephews", "NTA\n\nAgree with other posters your older niece might be hearing from her mom how she is the older sister and needs to be a big girl.  \n\nTo a 9 year old that might be interpreted as she should get ‘something more’.  \n\nI do think her mom needs to hear from you as gently as possible that BOTH your nieces are special to you.  That doesn’t mean one gets more than the others because you are their favorite.  \n\nIt means they both should grow up knowing you care for them and will be there for them equally.  In short there is no golden child. \n\nI think the baking of the cookies was a great idea and hopefully next year there won’t be any confusion.", "NTA\n\nThe 9 year old being upset? Typical kid behaviour, no biggie. The mum coming to complain to you??? That makes her the AH. \n\nShe should’ve dealt with that herself and told her not to be greedy. You were doing what good adults do and treating the kids equally.", "NTA: You were fair and it will help her learn that being older doesn’t mean special privileges", "NTA and your sister grossly missed a parenting opportunity and was rude about your gift.", "NTA\n\nI wouldn't say Mia is being petty, I would say she's behaving like a 9-year-old. She will honestly get over it before too long, and her mom should be encouraging her to get over it. (with positive vibes, like \"it's ok to be disappointed. But remember: our feelings are our own, and we're the ones who manage them. So how can we manage our disappointment here? Maybe we can ask if we can do makeup with her? How does that sound?\" This is assuming OP's sister knows about these techniques for helping children understand and regulate their emotions, but I'm trying to be the most positive here.) BASICALLY it's not OP's job to manage Mia's disappointment, it's her mom's job to encourage her. And in a few years she'll realize how petty it is to be mad over \"not having more cookies than my sister\". The goal is to help her move past it before \"a few years\" passes.", "NTA it's absolutely ridiculous to complain about equal treatment", "Agree completely! It can also just be a side effect of having siblings/cousins you feel competitive with. My siblings and cousins definitely did this to each other, and it's certainly a trope we see in media. But Mia, as you said, is old enough to learn from this if her mom would actually be a parent and talk to her. Her mom can acknowledge her feelings while also explaining that she should be grateful, etc.", "This exactly.", "I will second the NTA and the part about Mia. She is about that age where hormones start to come into play. I teach middle school and I can confirm in Mia's mind you treated her like a young child and she isn't 6 anymore. She wanted to be visually treated like an older kid. Mom needs to work on her choice and Mia might need a little chat too but I understand where she is coming from.", "It’s honestly embarrassing that this was even brought up to OP at all. This was a good parenting opportunity completely wasted.", "She's not a horrible brat, and I totally understand her emotions, as I had an older sister, but we were still close in age. She HATED anything we got together that didn't acknowlege she was the older sister. Or if I did something earlier than she did or was allowed to (such as, I stole my dad's razor and shaved my legs when I was 12--my sister didn't bother doing it until she was older, but she threw a fit when my mom wasn't mad at me. Other than the stealing the razor part.) \n\nAnyway, point being--they're cookies though. And apparently of the twelve days of Xmas. Was the younger girl supposed to only get the six days of Xmas? She's being a bit ridiculous and needed to be reminded as such.", "This is a perfect example of what's slowly happening to kids today. (I sound old cause I am. Next, I'll refer to you all as \"young'uns.\")\n\nLife is full of moments that people deem unfair, no matter what the age; it's all dictated by the emotional maturity of the person in question. Certain kinds of parents are taking that process and screwing it up by stepping in, not allowing the feelings to develop and be expressed, and immediately claiming their kid is being wronged, or is special or should somehow have a different outcome in a given situation. The terms helicopter and lawn mower parents is apt, and it's creating monsters.", "I'm child free (and plan to stay that way) but I also love gentle parenting. I have always believed that children deserve to be respected as human beings and that they can be engaged with in a manner that is both respectful and developmentally appropriate. \n\nBut you're totally correct. Some people have taken \"gentle\" to mean \"shield from all consequences and discomfort\" (which is, obviously, not what is actually meant by \"gentle parenting\"). Uncomfortable emotions are a part of life and it's essential to learn how to deal with them. \n\nI honestly think the parents in these stories don't, themselves, know how to manage jealousy, anger, disappointment, or whatever other difficult emotion. If their own strategy is to blame others any time they're unhappy, it would make sense that they teach their kids to do the same.", "Honestly I think she would be TA if she did give more to the older niece because the older niece is always going to be older. Maybe it's because I'm the youngest person in my family but I still get a cot in the office for holidays because I'm the youngest. I'm in my 30's.  Even before my siblings had spouses this was happening. It wasn't being younger and smaller because I've been the biggest sibling since I was like 12.", "Exactly(on cookie quantity).\n\nWhen OP does have money, this kid will be expecting double the money the younger one gets(unlike the fact that many relatives will send out gift cards or in the olden days cash tucked in xmas card--in the same amount for all the kids).\n\nAlso, tho i'm not an advocate of the \"it's(always) the thought that counts\", Sometimes you suck it up and just say thanks.  My Grandmother NEVER remembered which \"favorite\" colour her TWO grandchildren had.  No writing it down or something.  SO every year sibling got something in my fav. color and vice a versa.  Did I complain, No.  Did sibling? No", "And she also wasn't particularly rude about it, just wasn't super enthusiastic about it. That's a pretty mature response for a nine year old! \n\nI was the oldest in an age set and while I was generally a good kid, I realize now that I picked fights with my younger sister when I didn't feel like I was being treated as an individual. She was close in age and about the same size/bigger than me, so people always assumed we were twins and treated us the same. We both acted out against each other because of it, though it was never super serious. Kids are just oblivious assholes sometimes.\n\nThe mom, on the other hand, was super immature.", "I mean, I hate going back to the obvious.. but older cousin IS still a little girl. This is on her mom to be a mom and not try to pander to \"Waaa I deserved more!\" OP is absolutely NTA, although the sister/niece are little shits.", "It IS about the cookies. A 6yo would be filled up by fewer cookies than a 9yo, so the 9yo technically received a smaller gift by proportion. I don't make the cookie laws here.", "Or even just different boxes.", "Exactly my point. She's 9, it's normal to be upset about stupid things. It's her mom that is entitled. Not her.", "Gentle, compassionate parents are rearing gentle, compassionate kids. Shielding and making the kid a center of universe isn't a good, gentle parenting.", "NTA. What nonsense and poor parenting!!  Mom of 3 here.  There are times when gifts are either equal or FAIR. There are times when only one child receives a gift. It is the PARENT’S JOB to teach their children the difference and learn to gracefully accept whichever situation it is…no matter the ages. Obviously, the lesson should be age appropriate. NO MATTER WHAT THE AGES (including adults!), whenever cookies are the gift, EQUAL distribution is the ONLY way to gift!!!", "NTA. As a mom of a 16 year old, I feel so sad that the 18 year old was considered an adult and did not get presents. 18 is so young. My 18-year old neighbor is home for his first Christmas break, so we made sure to bring over a Christmas card with cash. That's a hard age to be responsible for so much.", "NTA. Gifts should be equal though not required to be identical. No reason to give Mia more because she's older. That smacks of entitlement as foes the implied threat yo demote you from favorite aunt if you don't comply.", "NTA.\n\nMia's mother's raising her to be one, however.", "NTA - this is a great opportunity for this kid to learn that it would have been seen as unfair by the younger girl or less valued or important to receive less cookies. I have a niece and nephew and although they don’t get the same gift we always spend the same amount of money on them to make it fair.", "NTA\n\nAgree with top comment, that Mia isn't the problem as much as her mother is. Her mother (/father) should have talked to her about (1) how much love and time you had put into making such beautiful cookies for both her nieces - and that she needs to appreciate that, (2) that she is only hurting herself if she tries to bean-count and compare gifts, and (3) she is really hurting herself if she expects to be given MORE than someone else. If she's THAT grown-up, then maybe she shouldn't get a gift at all and be one of the gift-givers to the \"little kids\" or she can appreciate all the love she was shown by all of her family.\n\nBTW, your gift sounds so beautiful and thoughtful. I think any grown-up would have also been pleased to receive it. You are definitely a great aunt.", "NTA.. you can love her and she can find you her favorite but she's not entitled to \"special \" treatment just because she wants it", "NTA. I have many niblings and amazing relationships with them. Sometimes, kids can be kids and they get a little \"i'm the favorite..\" I am open and honest with them. I tell them that each of my nieces is special in their own way. I love that they are kind, smart, funny, and loving.  I would explain how much time and effort I spent. Then calmly ask why they were unhappy after getting the cookies. Kids will usually tell you how they feel. Listen, and reassure them.  You don't have to agree with what they said to make them feel heard.", "I'm a grown-ass man and if a family member gave me a tin of cute cookies as a gift I'd be ecstatic. Hard NTA.", "In what way is simply being a little quiet considered a tantrum", "Ha! Reminds me when Burger King came out with the \"big kids meal\". It had a double burger or a whopper jr in it, and I think the drink was a size bigger. My eldest was so excited, he got to chose that one and the younger ones didn't, well because I knew they couldn't finish it.", "My aunt spent the same on each if us. If it meant buying one kid a gumball it would be the same. I got wonderful leather driving gloves w cashmere lining one year. Marked down to $25 but her friend bought them w her store discount so they met the $20 limit.", "No. No. There's a formula that must be followed. The 6 year old got 12 cookies, so the 9 year old should get 18. If cookies are given to a 20 year old they should get 40 cookies. A 60 year old gets 120 cookies and so on. ;-)", "Younger cousin tho"]}