{"id": 34034, "submission_id": "18ui5x0", "title": "AITA for taking my neighbor dog to the pound.", "selftext": "6 months ago I (37M) moved into my house with my wife and 2 boys under 10. We aren't dog people.   The issue is one neighbor had what according to google images is an Australian Shepherd.  In the last 6 months it has come into my front yard and back yard at least a dozen times.  It is rarely leashed and also manages to get through our shared fence.    \n\n  \nWhen I say something, the owners just say he's friendly and wants to play.  I don't want the dog to play in my yard.  My boys aren't  interested in playing with the dog.  I've taken the dog back to them every time.  My plan is to replace the fence to be sturdier, but we are still house poor and finances are tight for something like a new fence. \n\n  \nI ask them to leash it, they say no.  I ask them to repair the fence, they say no.  They seem to love the dog, but it seems to control my neighbors as opposed to the neighbors controlling them.  I've begged them to keep the dog out of my yard and its always been half hearted responses saying they will.  I threatened to take it to the shelter, they didn't believe me I guess.\n\n  \nI got fed up and took it to the shelter.  That evening my neighbor came pounding on my door looking for his dog.  I told him I got fed up and took it to the shelter.  The dude was incredulous and called me every name in the book.  I shut the door.  I heard from another neighbor he hasn't located his dog yet, its been about 24 hours.  I got fed up at his negligence.  AITA?", "created_utc": 1703950417, "permalink": "/r/AmItheAsshole/comments/18ui5x0/aita_for_taking_my_neighbor_dog_to_the_pound/", "score": 1020, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I took my neghbors dog to the pound.  I might be the asshole because I took his dog away from him and didn't tell him where I took it.  \n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "omg YTA this is horrifying", "YTA, that poor dog didn't deserve any of it even if it's owners are assholes! Next time you should seriously call animal control. Also, a shelter would've ran any tags or microchips and called the owners. I hope it's still alive.....", "YTA", "YTA because, while it may not be pretty, it’s soooo easy to free pallets and fix a fence.", "what you did is disgusting - you repair the fence if it means that much to you, rather than taking an innocent animal and dumping them off somewhere and taking a beloved member of the family from someone else. What you did may well be a criminal offence. \n\nNo you are not a dog person, nor are you a person with empathy\n\nYTA", "YTA, wow!!!! Contacting authorities or someone of a higher power to address the dog would have been the logical thing to do. But, you decided to not only be petty, but a major AH by taking a dog to a shelter, which is traumatizing to not only the dog but the owner. The neighbor was not being careful, sure, but calling your local police and/or code enforcement would have solved that issue.", "YTA. \n\nWhat a horrible disgusting thing to do. Yeah the dog and the neighbours are annoying but ffs, it’s not like it came in and savaged your kids! It was coming in and playing! You stole the neighbours dog and “took it to a shelter” which could potentially euthanise it. So you could have pretty much killed a beloved family pet all so….what?! It doesn’t play in your yard!\n\nYou’re vile, spiteful, deceitful and vindictive!", "I’m amused by all of the people attacking you, OP.  People don’t take control of their dogs or their kids, and go nuts when you’re called out on it. Too damn bad for negligent entitled people who treat everyone else’s property like their extended yard. \n\nIf you honestly warned them, then NTA.  \n\nIf you made it intentionally difficult to get the dog back, then YTA.", "You are a massive asshole and I hope Karma gets you good", "YTA, put up a for sale sign now, because you will never be tolerated in that neighborhood again.  Your lying about the shelter or they would have found the dog.  You've destroyed a family and possibly killed that poor animal. Biggest AH ever", "YTA If you were really so upset as to do something drastic you should’ve called animal control and they would’ve came out and had a talk with your neighbor.  What you’ve done instead is stolen their dog dumped it at a shelter and now won’t even tell them where makes you a massive ah", "You’re definitely 💯 the @sshole!!!!!!!!!!!!!!!!!!", "Don't you have leash laws where you live? All you had to do is call animal control and they would have taken the dog and/or fined it's owners. Animal Control may have made more of an impression on your neighbors and they would have kept the dog leashed or in its own yard. NTA although, I have never understood why people have such fits over their neighbors' pets coming into their yard or property when they're not causing any trouble.", "So ima go against the grain and say ESH except the dog obviously but you're like the biggest asshole in this situation. Firstly from your comments you say you dropped it off at a shelter & left yet the owner hasn't been able to find it? Bullshit, that's not how shelters work. You either dumped it in the middle of nowhere or dumped the dog in the parking lot of the shelter. You're absolutely the asshole. This is a family member & you literally kidnapped it because you have the maturity and conflict resolution skills of a dead fish at the bottom of the ocean. \n\nAs a dog owner your neighbors suck simply because it's their responsibility to make sure the dog doesn't get away into anyone's yard. There are actually leashes where you plant a steel rod in the ground with a hook at the top & tie a long leash so the dog could've been free & still leashed & not gotten into your yard. So they're the a-holes for this. \n\nYou're all assholes (but you're the captain of the asshole club in general). The solution would've been 1) call the police 2) call animal control 3) have sit down with your neighbors and explain that you have children who might be afraid of the dog or even make up that they're allergic. \n\nThere were SO MANY OPTIONS and you chose the 1) the nuclear option 2) the option that WILL alienate you from the neighborhood because believe me NOBODY will think you're anything but an asshole. If you're ever in trouble, you're on your own in your neighborhood. But I bet you're one of those people who think you'll never need anyone's help. \n\nHappy fucking new year, asshole.", "If someone did that with my dog, I’d probably be taken away in handcuffs….and I feel like a jury of my peers would have one person who would understand and acquit me. YTA", "Without a doubt YTA. You sound the worst version of human to exist on this planet. You could have filed a formal complaint… taking their dog to the pound is the most heartless thing I’ve ever read from this sub.", "YTA.  For the reason of not telling the shelter that the dog is in fact someone's pet.  You also never called animal control which you should have done several times.  Did you ever go the hardware store and buy some boards and try to fix the hole in the fence that way, until you can afford to replace the fence?\n\nThey must not have their dog chipped because that is the first thing the shelter would do is scan it for a microchip and that is their fault.", "YTA  \n\n\nAnd you are also lucky you aren't my neighbour. If you had taken my dog, while knowing its owners due to a fault on your side of the fence.... HOLY would the police stand quickly at your door for theft....   \n\n\nYou knew this dog had an owner. You are now endangering the dog, bothering the pound and stressing out the owner.   \nNot to mention, you not allowing your children to play with a friendly dog, I think you really should look up the benefits of growing up with a dog and to people who don't.   \nWhich you are apparently one.   \nIt has social beneficials.   \nThe owners are irresponsible, big time. But that dog is 100% innocent. You taking risk with its life is on you and as disgusting as it can be.", "YTA. \n\nIf you’re so worried about a dog in your yard, fix the fence. You seem pretty immature and self-centered, might be time to put on your big boy pants and act like an adult.  \n\nStop playing petty little games with living beings, you egotistical fuck.", "You stole property. You're a thief. Your TA.\n\nYou could have gone through the proper channels and let AC handle it.", "You're a huge asshole and I hope everyone in that neighborhood makes your life a living hell. You're lucky if this guy doesn't wreck your shit.", "ESH. They are irresponsible owners, but you had no right to take their dog to a shelter. If the dog is an issue, you call animal control. You do not take matters into your own hands and escalate the situation.", "Hopefully someone else adopted it and the dog wasn't put down. ESH but you're a little worse for stealing the dog and possibly putting it in a dangerous situation if the shelter is a kill shelter.", "YTA. I HATE roaming dogs. HATE irresponsible owners man's HATE the \"he just want to play\" BS. Your neighbour may be the AH managing this. \nBut escalating to potentially getting the dog killed to teach them a lesson is too much. It is a LIFE. \nI would kind of understand if you hid the dog for a few hours so your neighbour understand the danger that he may lost his dog, but straight up sending the dog somewhere where he can be gone forever is just a AH move. It's totally vengeful and spiteful.", "INFO Did you tell animal control it's their dog? Usually when they know who the owner is they give them a ticket, not take the dog. If you told them it's a stray that's a whole other story.", "YTA", "YTA. Wrong response that wasted resources for the shelter while you stole your neighbors’ dog.", "I love how these throwaway accounts give so much detail it makes them incredibly identifiable. Do we really need to know you’re a 37 year old Male lol", "Don't tell me.  It's a kill shelter you took it to. Right? Did you take it to a shelter in the same city/county? Yeah, you really did a bad thing. Kill shelters are run by the local municipality and they kill when they are overcrowded, like, oh right around the holidays.\n\nMassive YTA. There were plenty of steps with lesser consequences you could have chosen.", "YTA. The appropriate action would be to sue them in small claims court for money to replace the fence their dog damaged and then Replace the damn fence. Small claims costs are freaking nothing and often included in the win to be paid by the loser of the case. \n\nYou resorted to self help and in a lot of courts, that would void your claim. They were being irresponsible by not securing their dog but you are the worst neighbor. You took it too far.\n\nI also don’t trust people who “aren’t dog people”… I’m sure you have at least one neighbor who “aren’t kid people” but I bet they wouldn’t take your kid to an orphanage for walking on their lawn and shrug their shoulders when you went looking for them. \n\nOkay that might be a little dramatic but I think what you did is also dramatic so whatever. Ok bye…", "YTA. You should have called the police instead and let them talk to your neighbor about the issue. What you did was just cruel. Do you know what animal shelters do? Some of them put the animal down if no one claims them. Asshole. Shame on you!", "YTA and you will be lucky if you don't end up arrested. Legally speaking you stole his property. You did no contacting of animal control or the police, who could have forced your neighbors to comply with leash laws or repair the fence. Instead you took it upon yourself and committed a crime. You're an idiot.", "YTA. You don't like dogs, fine. But there is a difference between an annoyance and a threat with dogs. This is an annoyance. And not even a daily one. You don't state that the dog is doing any damage to your property (digging under the fence, chewing up lawn furniture) and it isn't chasing or snapping at your kids.\n\nYou could have called animal control for a loose dog, each time, and let them discuss with the neighbor. But to take the dog to a shelter, NOT inform the shelter of the owner's name, address, etc was just willfully cruel and I bet you're hoping they don't find the dog before it's adopted out to another family, or worse.\n\nI'd be expecting your residency in this neighborhood to be extremely unenjoyable from now on. Regardless of how much or little you planned to interact with the rest of your neighbors, this was a heinous act that is going to resonate for a long, long time. And unfortunately, your kids will likely bear the brunt of the negativity and freeze out/exclusion more so than you and your spouse, which is really sad for them. But hey, their dad is a dick so no one is going to want their kids to play with, host, or go over to their house.\n\nBut at least you don't have to deal with a dog you don't like on average once a month. Hope you're proud of yourself.", "YTA. You should have reported the loose dog to animal control. They would have come and ticketed him.\n\nWhen you took him to the pound, did they ask you whose dog it was? Did you lie.", "YTA. It’s not that you aren’t a dog person. You HATE them. You took the dog to the pound where that dog could be euthanized. You’re heartless. You could tell your neighbor where it is with the caveat if it happens again, you’ll call animal control who will ticket your neighbor. Your post is the ones that has disgusted me the most.", "So when your kid climbs the fence to get a ball that flew into their yard I guess CPS is getting involved.\n\nYes, it’s an inconvenience. Yes it might have been ugly and cost $50 in chicken wire to make a stop-gap fence solution. But taking their non-aggressive, non-damaging pet to the pound and not telling them makes you a total asshole. Should they have properly contained their dog? Absolutely. Should you have been a better person? Absolutely.", "So you solved your problem by committing larceny? Congrats. You’re a theif and a potential dog murderer. Yta. Big time.", "NTA up until you stole the dog", "YTA\n\nAnd honestly I hope your neighbors get their dog and sue you. You basically stole their dog and abandonded it at a shelter, and didn’t even have the decency to tell your neighbors which shelter.", "I’m a dog owner. I had a neighbor whose dog was constantly loose. Actually, 2. 1 was a goldendoodle. Obviously friendly, big goofy dog. Always getting out of their fenced yard somehow. The other neighbor had a pitbull, and they just let it roam. I don’t live in the country or suburbs, but in a big city near very busy streets. My concern was for either of these sweet dogs getting hit by a car. I also observed a lot of abuse from the owners of the pitbull and their small kids. Talking kicking, hitting, etc for the dog getting loose, yet they didn’t even own a leash. Another neighbor gifted them one and their dog was still out daily. I was concerned as this dog got older that it was possible he could be come aggressive from the abuse he got at home. \n\nMy husband fixed out shared fence to prevent the goldendoodle from getting in our yard. It took him 20 minutes and maybe $30. Unfortunately it didn’t stop her from getting out of her yard overall. Had to eventually confront both neighbors about the issue bc I worry about their dogs. I don’t feel either of them had any business having a pet, but i wouldn’t have taken it upon myself to take their dog to a shelter. Call animal control next time.", "NTA. The dog is safer at the shelter. The owners keep setting it up to fail and it’s solely their responsibility to keep this dog safe.", "YTA bc you punished an animal for a humans problem. Congrats on making your neighborhood hate you and probably leading to your kids being bullied about this in school. You are a huge AH.", "YTA\n\nSome shelters will immediately euthanise a large animal, they don't have facilities or budgets to look after them. \n\nIf you intended for it going to a shelter to be a warning, you F'ed up. Your neighbours still haven't located the animal, why wouldn't you tell them *which* shelter and contact info? \n\nIf you intended to simply get rid of someone else's dog, that's also just straight up awful.\n\n Even if the animal comes back safe to them, this is unforgivable. This is worth going to war over and the thing that you will have all neighbours actively turned against you for your own actions. \n\nThis is a thing that brings community together to actively hate you as an individual, you'll never be a part of the community. There is simply, no recovering from this in the eyes of many many actual normal people with feelings. \n\nNo doubt the neighbours will be more watchful if they get their dog back. But if it were my dog, lost or found, I would absolutely seek everlasting retribution and make your life a living hell while you lived there. You literally live right nextdoor to these people, there is no getting away until one of you moves.", "YTA. \n\nMy kids are scared of dogs. We just got where they don't try to climb me to get away from the 10 lb dog next door. \n\nSaid dog next door stays in our yard. Her owner let's her out and just leaves. Her previous dog got run over and I've nearly ran over this one a few times. We even have a leash law, which she told me about, but she use to be on city council and no one will force her to keep up with her dog. \n\nOur other neighbor has a husky who is fenced in but keeps getting out. I have him on camera running through my yard. Neighbor argued us up and down it wasn't his dog. Fine. \n\nAt no point have we picked up the dog and dropped him off at the shelter! Instead after the owners were talked to I told other neighbors who said dogs belonged to and they've called animal control. Because that's who you call. You do not take a living animal away from the only place they know and clearly drop it off at the entrance of a shelter and run off. \n\nDef YTA.", "YTA", "YTA. I hope your neighbors report you to the police. Tell them where you took or dumped their dog immediately. You’re acting as if six times in six months is a lot. Sure, inconvenient, but did not warrant such a horrible deed like stealing their dog and risking the dog’s life. Fix your mistake and get their loved one back.", "Yta what a terrible neighbor you are I feel bad for the neighborhood you moved into. Have you ever heard of animal control usually the first step before stealing a dog and taking it to the pound", "YTA. I have a neighbor with no fence and about 7 or 8 dogs, I’ve truly lost count. They always found ways to get into our backyard so WE made efforts to find/fix all the areas they were getting in to make sure their dogs stay out. You know why? That dog is now on my property and if something happened to it, they could come after me. Should my neighbor make efforts to put up a fence? Sure, but we know her situation so we show her compassion. We don’t take their dogs to the “shelter” just because they wandered into our front yard for a few minutes. \n\nYou’ve also potentially caused an innocent animal to be euthanized all because you’re “not a dog person”. Regardless of being a dog person or not, this was definitely not the right choice. But what’s more likely here is that you just dropped them in the woods somewhere, which means they could have been attacked, hit by a car, etc.. you basically sent an innocent animal to its death.\n\nIt’s also not your neighbors fault that you made the choice to over extend yourself when purchasing a home. You being house poor is not their problem. If you only moved in 6 months ago, it’s likely the fence was in not so great condition when you bought the home, unless a freak storm recently caused major damage. You bought this home knowing the fence would need work or need to be replaced. If it’s a shared fence, I can understand them not wanting to take on the entire cost. At a minimum, the cost can/should be shared.", "YTA. Your story doesn’t sound right.  IF you took the dog to the pound why didn’t you tell him which one, and why wasn’t the dog still there?  And even being “house poor” you can buy fence slats to repair the fence.", "YTA, and you have likely committed a crime.", "NTA or soft YTA. Let it be known that I hate dogs, but it definitely isn’t what I’d have done if the dog is genuinely friendly (especially friendly enough for it to let you catch it and drive it somewhere). I’d have started documenting when it came over and the interactions with the neighbors and filed complaints with the county or tried to force the HOA or something (I know there might not be one) to have them install and invisible fence or repair the fence on their end so the dog can’t escape.\n\nIt’s unlikely the shelter would put the dog down, but it does happen sometimes and this could still be a traumatic experience for the animal. It’s also extremely dangerous that the owners let the dog wander; that’s an easy way for it to get stolen (like you sort of did) or for the poor thing to get hit but a car, or for it to hurt someone if it gets scared. You gotta make sure you’re punishing the owners in a way that gets them to address the issue, not victimize the dog.", "Expect every single person in that neighborhood to hate you. \n\nYou’ve just ruined any chance you had of being friendly with anyone in the neighborhood. \n\nYta.", "YTA, I’m not a dog person but I moved into a neighborhood where my neighbor let her old dog wander about a little. The dog was old as shit but a sweet heart and loved the kiddos playing. I dealt with her dog taking a shit in my side yard by just texting the neighbor and she would come out and clean it. Did I like that the dog wandered about a little, no, did I like that the dog shit in my yard, no, but I just texted the neighbor and told the dog to go home and she’d wander her little old ass home. I looked out for the dog because the neighbors kid and the rest of the neighbors adored the old dog. I even got a small soft spot in my heart for her. I never once thought about taking that dog to the pound. Was it annoying yes, but you could have made so many different choices than the one you did.", "Yeah dude, YTA.", "YTA! You are a crappy neighbor. Check yourself.", "\"You're not dog people.\" I don't trust you folks. Something wrong with someone who hates dogs this much if you ask me.\n\nBut go get the dog now, or at least tell him where to get it. If the dog was already rehomed you can probably expect a punitive lawsuit.\n\n  \nETA Just hope your local news channel doesn't get ahold of this. Plus if your neighbor calls the cops I'm pretty sure you're going to jail.", "i don’t agree that you are the ahole. This is definitely an ESH situation. those owners are incredibly irresponsible and frankly stupid. But as others pointed out you should have just continually been calling animal control, taking the dog to the shelter was extreme. animal control could handle it and it would be good to have a record of these owner’s irresponsible behaviors (since none of this is the dogs fault) honestly they sound like they do not deserve a dog anyways but it still wasn’t the correct way to do things.", "What a garbage response to a non issue.", "Info: Why can’t the owners locate the dog? Did you take it to the nearest shelter? Did you tell the neighbor which shelter their dog is at so they can get it back? \n\nAlso you said money is tight but did you try anything to close the hole in the fence from your side or even sprinkle coffee grounds or some other homemade dog repellent in your yard to keep the dog out?", "ESH. But you're the bigger a-hole.\n\n They were rude. They were negligent. But the dog was not in danger.  \n\nYou stole the dog. You've potentially killed their dog. Or maybe you got the dog adopted by another family, and now that family going to be hurt if they have to give up the dog. \n\nRegardless, you have ruined any kind of positive neighborly relations you could have had. They were negligent. You were malicious.", "What I want to say to you would get me kicked off of here so I am just going to stick with YTA. How could you think you are not???", "YTA.\n\nLemme put this in a context you can understand, because it baffles me you even have to question your actions.\n\nI don't know if you're animal people at all, so if you are just insert whatever pet is your preference, and if you're not animal people then insert the name of one of your kids:  \nImagine your pet/kid kept going over to your neighbours garden, and they'd voiced their concerns, and the pet/kid kept going over to the neighbour, so one day they took your pet/kid to a shelter/daycare and then you couldn't find them. You'd be livid and heartbroken, too.\n\nYes, it sucks that the dog kept getting over and/or through the fence, and that your neighbours clearly weren't doing everything they could about it, but you could've handled the situation alot better.  \nYou could've called animal control, or googled what to do, or asked the police if they could have a word with the neighbour just to scare them into action a lil. I'm not claiming any one of those things is the 'right' thing to do, but would certainly be alot better than taking the dog to a shelter.  \nThis isn't a ball some kid kicked over, or a frisbee, it's a living thing that you've just uprooted from its home and must be incredibly confused and anxious being in a strange environment.   \n\n\nIf I were you, i'd apologise to the neighbour and them them which shelter you took it to before they kill the poor thing.", "YTA and a criminal. If they put the dog down, you’re liable. You really picked a shitty hill to die on.", "YTA easily.", "I don't understand why you wouldn't call the non-emergency police phone number. You took the most extreme and ridiculous step you could have taken instead of taking a more reasonable step first.", "YTA. I get some people don’t like dogs. But sometimes it feels like they just want to take that out on the dogs. you don’t get to just take someone’s pet like that.", "YTA- shelters require intake info, so what did you really do with the dog? You are a MAJOR AH.", "NTA\nPeople need to be responsible pet owners", "Let’s say your kids go and play in front of someone else’s house. Your neighbor gets fed up and drops them off somewhere without telling you. Then when you go ask about them, they just say “I dropped them off at xyz” and shut the door in your face. 24 hours later you still don’t know where your kids are. \n\nOf course YTA. To you it’s just a dog, but to your neighbor that’s their family.", "NTA-  I've called animal control on loose dogs even when I know who owns them before.  It's just too dangerous for them to be loose.  There is a boxer I'm starting to occasionally see out now, that I may have to start calling on.  I think it lives on the corner a few houses down.   Where I am dogs can be shot for being loose and harassing, not just killing, livestock, so they should not be loose at all if the owner cares about them.", "YTA, for all the reasons stated above. That dog could very possibly be put down before the owner's are able to recover him.", "Wishing you and yours the absolute worst for the holiday season. YTA", "YTA 100 times over. What you did to that dog is unforgivable. The amount of stress and confusion it experienced was likely to be terrible. You might not be a dog person but that animal has emotions. Your neighbours should be more considerate but you went about this in a cruel and heartless way that has caused so much emotional stress to the dog and to those owners. Imagine they called child services on you and got your kid taken away, temporarily,  that’s someone’s family member. Karma should be coming for you.", "YTA- hope you’re not too house poor for security cameras. You’re gonna need them.", "YTA. You may have killed or forever gotten rid of a dog they might regard as a child. At the very least tell them WHICH shelter you took the dog to.", "You stole a dog.  The dog had not done damage or hurt anyone.  You stole a dog, took it to the pound and now the dog CANNOT BE LOCATED.\n\nIf that dog is lost or - horrors - been put down, may I say that I hope you burn you know where.  But before that, I hope you get your butt sued.\n\nYes you are an AH, a great big, flapping, dripping one.", "You are 💯 a complete asshole. I hope your entire neighborhood treats you the way you deserve to be treated. Go get that poor dog back to his family.", "That poor dog.", "YTA. Correct fist escalation is calling the city - there are normally bylaws around this and someone would show up at their house and fine them. Taking it to a shelter is a step too far. (Though I'm surprised the dog didn't have a chip TBH since the shelter would have scanned it and called them right away. You wouldn't know this tho if you don't like dogs)", "I don't understand how you were able to surrender a dog without explaining how you came into possession of it. Feels kinda like you may have ditched this dog somewhere. YTA", "NTA\n\nI am a dog and animal lover and I don’t understand for the life of me why so many people here think the neighbor letting their dog wander at will isn’t the big dickhole move. \n\nThis is a dog who’s allowed out unleashed and unsupervised and is not in a fenced in yard. People saying OP signed the dog’s death warrant, like letting your dog wander around beyond your yard isn’t doing that already. \n\nIf the dog bit someone, or was hit by a car, or had an entanglement with wildlife—dog is screwed regardless.\n\nAnd I doubt someone so entitled as to continue to let their dog wander after being expressly asked not to, would respond any differently to animal control. People need to treat their dogs like dogs, not kids.\n\nHonestly you shouldn’t have told the neighbour you took the dog to the shelter. Just shrugged and said “I don’t know, weren’t you watching it?” Would have saved you some trouble.", "YTA Dog shouldn't be roaming and kept under control, in saying that you had other options instead of the extreme.", "YTA. Do you know what happens to animals in shelters? I actually hate you.", "YTA. Your complaint isn't that its aggressive, relieving itself on your property, or even barking. It's just wandering around. Where's the dog now, OP? Don't you watch movies? All dogs go to heaven, 101 Dalmatians, furry vengeance? Animals talk to each other. They're not gonna forget🐶", "I feel your frustration as I am not a dog person at all and this would also drive me crazy. But the next step to take would have been to call local animal control and let them handle it", "YTA. Massively. What you did was an epically disproportionate response. The dog was causing no danger or fear, and frankly wasn’t even around that often. Now this poor creature is separated from a family that loved it in a terrifying environment. It may even be put down. All because you just had to be right.", "If this actually happened, you’re the biggest AH on the planet. Call town government. Call the police. There are other options that aren’t so fucking disgusting. That poor dog is scared out of its wits now. You are sick.", "YTA. you know exactly where the dog belongs; that's not what pounds are for.", "ESH. Your neighbors should be more considerate and responsible. But you taking the dog to a shelter was a bit over the top and possibly illegal. \n\nUnleashed dogs are likely a violation of your city/town/county ordinance, so reporting it would be the way to go if nicely asking didn't work.", "Call animal control. Taking the law into your own hands clearly indicates malicious intent, therefore, YTA.", "YTA. that’s an animal control situation and not a pound situation. you stole your neighbors dog. pounds are for homeless dogs. they are full. you’re draining their resources unnecessarily.", "Did you really take the dog to the shelter? The shelter would have checked for a chip and contacted the owner. When the owner contacted the shelter they would have been able to go get their dog. Where is their dog?\n\nYou could have got a roll of chicken wire to reinforce your fence, but no, you just took the dog somewhere. YTA.", "How about you repairing the fence Sport?", "YTA that friendly dog could be dead now. You may as well put your house on the market and move, all the neighbors will know what type of person you are, and by association your partner and kids.", "YTA, and if I were your neighbor, you’d be sucking the long cock of vengeance for the rest of your days living on my street. Purely for self preservation purposes, you need to think harder about the potential, manifold consequences of doing petty shit like this. There are infinite ways for people to make your lives harder without breaking any laws or leaving you any real recourse - though if I never got my dog back, you’d be catching these mf hands at a minimum.", "ESH...as a dog owner I hate neighbour's irresponsible inaction. If someone threatened to take my dog to a shelter, I'd make every effort to prevent this from happening (leash the dog, erect new fences...). They didn't even bother.\n\nI also feel OP chose to aggravate the situation unnecessarily. You/your family would be living there, creating enemies around you doesn't do you any favours.\n\nI'm just wondering how the neighbour can't locate the dog though; is microchip not mandated where OP lives? Surely the shelter staff would have checked it and contacted them when the dog was brought in.", "Yta.  You may have gotten someone's pet murdered.   Yes they should have kept the dog out of your yard, but congrats, you will never have a good relationship with these neighbors.  They will not help you if you need a cup of flour, they will not split the cost of a fence along the property line.  Prepare for them to call code enforcement on you every time your grass is 3mm too long and not keep an eye out in case a package is delivered while you are out of town.  Hell if my neighbor put my pet in the position to be euthanized I wouldn't call the fire department if their house was on fire.   I would never speak to them or do anything neighborly for them ever again and if they ever asked for a favor I would laugh in their face.", "YTA I have never met an entire family of dog haters. How did this happen? Anyway, you had other options.", "INFO: Whose legal responsibility is the maintenance of the fence between your properties?", "You’re the neighbor that sucks here. You’re not dog people but to dog people, their dogs are their family. You just kidnapped their family member and abandoned it. If you dropped it at the shelter and they shelter doesn’t have any record of it then you’re a liar too. I hope karma comes for you hard. I would be absolutely devastated to lose one of my dogs. Just because it was kind of annoying you?? What kind of cruel human are you?!\n\nEdited to add: YTA!! Majorly!", "Best help him recover him/her.  He could sue.  It might be that the action is enough to make him a better neighbor.  If not, let animal control handle it.  There's probably a leash law that could apply.", "NTA\n\nThat is an untrained dog. That dog should not be going into your yard if you don’t want it too, they should have tried to put a stop to it the first few times you complained. \n\nYou warned them what would happen. Good for you.", "wtf did I just read? dude you telling the owner that you just randomly dropped off the dog a random shelter and now the owner can’t find their pup.. I’m sure if anything happened to the dog, that can be considered animal cruelty", "Who has responsibility for the fence? If you have responsibility for the fence and the dog is getting through because the fence you have responsibility to maintain is broken then you are definitely the A H.\n\nIf the fence is their responsibility to maintain, then they are the A H for not fixing it.\n\nHaving your dog unleashed in your own backyard is not normally negligent", "YTA massively.", "I bet you're a nightmare of a parent. YTA", "You are just the most giant fucking asshole ever yes you are!!\n\nIf one of my neighbors had done something like this to my dogs? Well, they definitely would be moving out very quickly after I found out who it was.\n\nI would make it my life goal to make them as miserable as possible in every legal method that exists until they were no longer my neighbors.\n\nI'm talking concert speakers so that I can play the most godawful porn at them thru the entire day, at max volume, but only until the law says I have to be quiet. Then my floodlights would go on and turn the entire side of my house that is closest to them to daylight. Strobe lights. Signs in my yard telling everyone what a fucking asshole you are. \n\nI would become a sculpter so I could put a 29 foot statue of you getting fucked in the ass by a lawnmower in my yard, that you would have to look at every day.\n\nI would plaster your face and name on the side of my car and drive by your work so everyone can read all about what a shit human you are.\n\nThere would just be only one limit to the shit I would do to you, but there is sooooo much available to do without breaking the law, and I have a fantastic imagination!", "YTA, you should’ve called animal control. \n\nThat poor dog, being taken to a shelter. If you dropped it at an open admissions shelter, they can euthanize quickly. So, you’d be on the hook for killing the neighbors’ dog essentially. \n\nAlso, what you said is not how shelters work so, what did you actually do with the dog?? Dump it in the woods somewhere?\n\nI volunteer at an animal shelter, YOU ARE AN ASSHOLE.", "You're a very big AH, I hope neighbor can report you for stealing the dog. BIG YTA", "ESH. Your neighbors should have repaired the fence and worked to keep their dog in their own yard, but you should never have taken the law into your own hands. You basically stole their dog. You all suck.", "ESH, y’all both should have made better decisions smh.", "Did you lie to shelter? You have to give them info on where you found it. Ultimately they don't *want* more dogs. They ask if there is a clear owner nearby. They don't just happily take in every new dog. I feel like you must have done something malicious to make sure the dog doesn't return.", "I’d like some clarification. You left the dog with someone who works at the shelter? Or you left the dog in front of the shelter to fend for itself? Because why wouldn’t your neighbour be able to find the dog at the shelter within 24 hours? \n\nI’m a dog lover myself, and I wholeheartedly believe pet dogs should be leashed up or enclosed within appropriate fencing. Dogs shouldn’t be running loose at all for a myriad of reasons. Even then, you’re coming off as a massive AH if you didn’t inform the neighbours immediately after.", "YTA.\n\nYes, their behavior and control of their dog leaves a lot to be desired.  But you just unleashed the nuclear option on them.  There were literally a thousand things you could have done first, including using stuff like boxes to block the home in the fence, filling a police report, etc.  The dog was not violent or aggressive.  Yeah, it was shitty that they had no control over it.  But what you did was reprehensible.", "YTA 100%", "I don't really get a lot of the YTA comments here tbh. So long as it wasn't a kill shelter. Absolutely NTA. I'm a dog owner, I love my dogs and there's absolutely no way I'd let them constantly run ragged around so body else's garden. That dog would be better off with owners that really care about the dog", "Ok so unpopular opinion here, but I don’t think he is the A. \nHis property..he asked a number of times. \nWhy should he be responsible for the neighbors dog? It’s the neighbors fault, not OPs. OP was just keeping his property free of dog. I totally get that. \nNTA", "You are more than an asshole, straight up monster really. Talk about neighbor from hell. A friendly dog comes into the yard and does nothing wrong and you obsessively try and get the neighbors to punish it, leash it, be mean to it.\n\nWhat the f is wrong with you!?! Get therapy. Seriously if a happy creature just being in your presence causes you so much anger and cruelty to tear it away from his family you need so much help. \n\nI literally want to tesr yoy away from your family, lock you in a cage, and put a timer on you to be put to death if they dont find you in time.", "YTA \n\nI like your handle as it's very accurate - there is a neighbour who sucks in your area. It's you. \n\nI hope your neighbour tells everyone in the neighborhood what you did. Enjoy being a social pariah buddy.", "When you lay out consequences, i.e. IF you cannot keep your dog on your own property, THEN  I will take him to the shelter if he continues to come onto my property... at some point, you are going to have to follow through. It's been six months of you asking and them not doing.  NTA - but only if you gave the shelter the owner's address when you dropped the dog off.  Y T A if you didn't.  For those saying you \"stole\" the dog, no, you didn't (as long as you didn't misrepresent the situation to the shelter) - any more than any other wandering pet that ends up in a shelter was stolen. Pet owners have a responsibility to keep track of their pets. Yes, they go wandering from time to time, and in a neighborhood, we all tend to look out for one one another's animals - except when the pet makes a nuicance of themselves and the pet owner refuses to do anything about fixing the problem. Then someone will inevitably step in and get local animal control involed in some way.", "Not only are Yta....  youre also a coward and id make it my personal mission to make youre life hell from now on", "YTA. A massive, cruel one.", "You are the singularly worst asshole, i've ever seen on this sub.\n\nAnd yes I'm comparing you to men who beat the wives and children.\n\nTell your neighbor what shelter you took his dog to, then get over yourself.", "I am too mad to type up a coherent response. YTA of the highest order.", "I hope your neighbor calls the fuckong cops on you and has you arrested and takes your ass to court. There were other options and you chose to endanger the poor dogs life.\n\nI hope karma comes for you.", "Jesus fuck ur a menace. I really hope that dog didn't die for your sins. YTA with the power of a thousand sun.", "NTA\n\nYou gave the neighbour every opportunity to right their wrongs and they chose not to.\n\nWhat else are you supposed to do here? Let them walk all over you?  Your neighbours suck and people need to realize that not everyone likes dogs or sees them as *allies* . \n\nHopefully they don’t get it back and they leave you alone.", "YTA, an f'ing asshole.", "YTA\n\nAre you always such a dick?", "YTA. An animal is a member of the family. You went over the line.", "YTA for pretty much ever reason everyone has already listed. \n\nYou were so incredibly stupid to own up to taking the dog into the pound. That was incredibly shortsighted.", "Nah, you aren’t an asshole. \n\nYou’re a FUCKING asshole.", "YTA OP should watch John Wick. I hope the dog’s owner sues him into oblivion.", "When a neighbor’s dog is on your property, take pictures and video and contact animal control for help. Do this every single time the dog is on your property and report it. Animal control is usually understaffed/under funded in most areas, but if you have video evidence it can help push the other owner to be forced to correct their behavior, fix the fence, pay fines, etc. The last option would be for animal control to seize the dog. \n\nOP went to the last resort too fast. \nNeighbor is wrong for not keeping their dog contained and out of OP’s yard, but there are better ways to handle it than now having a missing dog. \n\nOP, where did you take the dog? When you say to a shelter, did you go inside and surrender it to a person or not?", "Having dealt with numerous neighbors who let their sometimes aggressive dogs loose unleashed YTA. This dog was a mild nuisance at worst. Your first course of action should have been to call animal control or the police. You pretty much stole the dog considering you knew who it belonged to. I also find it hard to believe two kids under 10 have 0 interest in playing with a friendly dog(not that I think it's ok for kids to play with dogs they don't know), but it shows you're passing your weird hate towards dogs onto your kids.", "YTA and your now the asshole to your neighbors as well, may as well just move and preferably somewhere without neighbors.", "YTA. This is how you make an enemy out of your neighbor. Have you watched John Wick? You’re going to have to move, you will be the most hated neighbor.", "YTA", "NTA. No sane owner that cares about their pet lets their pets wonder around freely for hours everyday with no idea where it is. The dog could have been hit by a car, attacked by other animals or people, itncould have been injured in a multitude of ways. \n\nIt's crazy to me how people are normalizing the behavior of the owner. Someone who cares about their pets takes care of their pet, they don't let it aimlessly wonder around the neighborhood hood. The neighbors should be feel lucky that OP isn't a psycho or a dog hater that actually harmed the dog. It's insane that people have no commonsense and are incapable of caring about the wellbeing and saftey of their own pets.", "If this is real then YTA. There are many other things you could have done, such as contacting animal control or law enforcement. In my opinion, taking someone else's pet to a shelter and not telling the owner where is a horrible thing to do. I understand not being a dog person but this crosses the line. The way I see it, this will end poorly.", "YTA. You likely just made an enemy for life. Congrats for not being able to think past the moment and consider consequences you and your family may face down the road. \n\nAlso, I don’t believe you took it to the pound. The dog is likely chipped and if you took it to the place you claim, the neighbor would have found it by now and the pound would have scanned for a chip. What did you really do to the dog?", "To everyone saying he is in the wrong - what happens if the dog gets injured or injures someone on the OP's property? Is the dog owner going to take responsibility? or will he sue the OP?\n\nSometimes, people just don't get it, and it needs to be reinforced.\n\nNTA", "Imagine being the kind of monster who lures a friendly dog into his car, drives it to a strange place, and leaves it. YTA", "ESH, I would go with y t a because your reaction was horrible. But still, the owners careless attitude towards their dog constantly being in other peoples gardens is also an AH move. I think I would've just warned the neighbor that I put rat poison all over the yawn so unless he wants him poisoned, he should f*cking train his dog. I hate owners like this. Still, taking another persons dog to the shelter? Ouch. Please try to contact the shelter and get him back. He was a family member. If you're lucky they've learned from this and train him. If not, I hope you like the idea of them getting a new puppy, that is even less trained and will probably poop in your garden", "YTA. Depending where you are located, the dog had a high likelihood of being euthanized very quickly. Shelters are overrun especially this time of year so you also used up extremely limited resources for your petty neighbor squabble.", "I have a very friendly cat and one day he went home with a new friend. They took him to the shelter and I got a call within 24hrs. When I went to pick him up I said, “Am I going to have to keep picking you up from jail or what?” That neighbor actually dropped my cat off INSIDE the shelter and did in-take paperwork. YTA", "YTA. Big time. You don’t take a neighbors dog and surrender it to the pound. The dog just came into your yard, that’s not worth taking the animal to the pound. My neighbors dogs would come to my yard all the time when my dogs were alive and I welcomed them. They always went back after they played a bit. If that was my dog, this would not end well. Granted, I always kept mine in the house or under my supervision.", "Yta. It’s not even shitting in your yard? It’s just walking around and not bothering anyone? Screw you, weirdo.", "YTA", "Yeah. That's so far beyond being an asshole, there's not even a word for it. Absolutely MONSTROUS.\n\nYTA. I hope you get sued.", "Why do I’m think that op and his neighbor is going to be on Fear Thy Neighbor? Which is an American-Canadian true crime documentary television series.", "YTA - so many better ways to handle this. Enjoy being the black sheep family of the neighborhood.", "YTA. In my state that would actually be considered theft of property as animals are property and you did not call animal control.", "YTA. The whole neighborhood is going to hate you now.", "How has he not been able to locate his dog *at the pound*?", "OP all these people are crazy. Its a dog on YOUR property. You literally gave him warning multiple times. Redditors just like animals more than people.", "YTA, majorly. This was absolutely not okay. Jesus Christ.", "YTA You punished the dog for the owner’s problem.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n6 months ago I (37M) moved into my house with my wife and 2 boys under 10. We aren't dog people.   The issue is one neighbor had what according to google images is an Australian Shepherd.  In the last 6 months it has come into my front yard and back yard at least a dozen times.  It is rarely leashed and also manages to get through our shared fence.    \n\n  \nWhen I say something, the owners just say he's friendly and wants to play.  I don't want the dog to play in my yard.  My boys aren't  interested in playing with the dog.  I've taken the dog back to them every time.  My plan is to replace the fence to be sturdier, but we are still house poor and finances are tight for something like a new fence. \n\n  \nI ask them to leash it, they say no.  I ask them to repair the fence, they say no.  They seem to love the dog, but it seems to control my neighbors as opposed to the neighbors controlling them.  I've begged them to keep the dog out of my yard and its always been half hearted responses saying they will.  I threatened to take it to the shelter, they didn't believe me I guess.\n\n  \nI got fed up and took it to the shelter.  That evening my neighbor came pounding on my door looking for his dog.  I told him I got fed up and took it to the shelter.  The dude was incredulous and called me every name in the book.  I shut the door.  I heard from another neighbor he hasn't located his dog yet, its been about 24 hours.  I got fed up at his negligence.  AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA-I hope they sue you for any harm that came to the dog.  You had other options but went for the worse one.", "YTA. You have now probably alienated all your neighbors.  Having good neighbors makes life easier. Making neighbors angry tends to make things bad\n\nIt's just a dog.  And while you may not like dogs, you should of tried other things to fix the situation before going to this extreme. \n\nJust a piece of advice..go tell them where there dog is. If you want any hope of not having to move.", "YTA maybe you should go get the dog back. Unless you don’t care because you are an AH.", "YTA.  You’ve probably got this dog killed.  Feeling good about that?", "YTA: Build a fence, not that hard.", "You may be the biggest AH I’ve ever seen in this category. You traumatized the dog, stole from the family and burdened the shelter that never asked to get put in the middle. You better go get that dog back and give the shelter a huge donation. They don’t have the time or resources to deal with your pettiness. And apologize to the family and that poor innocent pup. Fix your fence and your shitty sense of right and wrong.", "You better hope the neighbor is fully sane. If you did this to my dog I’d be willing to get a criminal record, is all I’m saying. \n\nI agree loose dogs are annoying and the neighbor is an AH for that, but you used a nuclear bomb on the issue.", "YTA YTA YTA and probably a liar too", "YTA shelters are overful as it is, call the non emergency police line, call animal control at least let the neighbour know which shelter his dog was dumped at jfc you also just made an enemy of your neighbour", "YTA.  A sensible adult would’ve said the police will become involved if it doesn’t stop. You instead decided to go nuclear and are now probably going to be facing a lawsuit.", "Yes yta", "Yta and  some state will  euthanized dogs if the pound get to full of any pets,I hope your neighbors  sue you op for theft but don't worry no-one will speak to you or your family.", "ESH- you really suck like to the highest degree for not just calling someone and your neighbours are major AH for not knowing where their dogs are and ignoring your request for them to keep their dogs in their property", "I just hope it's not real...", "YTA\n\nDogs are essentially family members, so imagine if someone took your kid away from you. \n\nWords can't even describe how much I would hate you if you did this to me. The neighbor also sucks for not keeping track of their dog or keeping it leashed, but there were plenty of other things you could have done before stealing their dog and possibly putting it at risk of, who knows, possibly being put down before he has a chance to locate and retrieve it. \n\nJust wow...you said you're new to the neighborhood? Good luck buddy. I hope they do everything they can to push you out of that neighborhood. I know I would.", "Waiting for this episode of “fear thy neighbor” to get dropped in two years when someone gets murdered because of this.", "ESH. You could repair the fence. You took something that isn’t yours and put it in danger. Not all shelters are no kill shelters, so yes, you put that dog at risk. It doesn’t mean your neighbors are right, they suck. They mistreat their dog imo, so you should have called the SPCA. They are horrible, but two wrongs don’t make a right.", "My bad.", "YTA\n\nBut still most these comments are from awful dog owners who make their dog ownership other peoples problem.", "YTA.  The appropriate response was to call animal control and let them deal with it - they would've worked with the neighbor to ensure the fence gets fixed and the dog stays with its family unless rehoming it is absolutely necessary, instead you stole a dog from what you admit is a loving home and dropped it into the shelter system where it will most likely get euthanized if the owner can't locate it, or adopted by someone else and never see their family again.  Congrats op, you won the shitty neighbor award.\n\nEdit - also, might want to add that depending on where you live your neighbor can sue you for the dogs fair market value if they don't get their dog back, which for an adult Australian shepherd looks like around $1500-2000 USD.  If I were you I'd go get it, put it back in its yard, apologize profusely, and hope they don't call their lawyer, because if they do you're pretty much screwed.", "YTA you stole a dog. Call animal control.", "Presumably you had to lie to the shelter in order to get them to take the dog? If you took a dog in and told them that you knew the owner and that they hadn’t abandoned the dog, they would have sent you and the dog away. \n\nYTA. That’s not what shelters are for. Poor dog must be so confused.", "YTA\n\nBut you're a great new neighbor.", "YTA, I understand that they’re not being responsible dog owners, but what you did is not only terrible but also most likely illegal. Pets are property and you stole someone’s pet and took it to a shelter. I’m pretty sure that there were a lot more solutions that didn’t involve breaking the law: like contacting your city or checking what resources exist in your area for this type of issue", "Huge YTA. You should have called animal control.", "There aren’t even words to describe what an absolute raging AH you are. If you thought that dog coming into your yard once or twice a month was a nuisance, wait until you see how much of a nuisance it is to have every single one of your neighbors hate you until you move out. I hope they make your life an absolute living hell.", "Yta, a HUGE one. I do hope the dog makes it back and bites you in your giant ass", "YTA. So many other ways to go about this, and you chose the cruelest and most criminal route.\n\nPlease update when your neighbors sue you for dognapping and everyone in your community hates you for the rest of time.", "ESH\n\nThey're bad dog owners but you went too far. The fact that you just randomly dropped off a dog that you stole/kidnapped is terrible. You should have contacted the appropriate authorities.", "His kids will suffer too\n\nI would NOT let my kids play w his kids. None of the neighbors should.", "It's pretty standard to add age to these posts for generational context. Is this your first time here?", "OP even says it’s a shared fence though! He doesn’t have the money to fix it so instead of taking some responsibility this is the course? Honestly wtf. \n\nI’m with you 100% but can also be dramatic haha", "Taking an at large dog to a shelter is not stealing.", "Report them for what? The police aren't going to do anything", "This really depends on your location. At my last house local PD will simply give you the phone number for animal control, stating that animal control will take the animal to the local animal shelter for housing until the human can come pick it up. Or you could take it to the shelter yourself, stating I found this animal in my yard, and animal control will try to get it back to it's human (That is the sticking point with the above story). I used the latter because the one time I called animal control, the woman just drove around in circles \"looking for the dog\" and then vacated the premises.\n\nAt my current house I was informed any strange dog on their property would be shot on sight (cattle ranchers). If you suspect your dog has been shot non lethally (the nice ones apparently use bb guns to \"train\" the dog) it is recommended that you get radiographs done - as it could be considered a record of ownership.", "Where do you live that animal control ever does shit?", "Regardless of who is responsible for the fence, the neighbors are ultimately for keeping their dog on their own property.", "It's called being a \"dog at large\"\n\nyou can't just let dogs wander the neighborhood.", "Meh, a family that will properly care for it will have a chance to get it.", "Your comparison doesn't make sense. OP knew where the dogs owners were. Dogs that end up in the shelter end up there because people don't know where the owners are. \n\nHe stole the dog and risked its life by taking it to the pound where they may end up euthanizing it before the neighbor has a chance to find and pick it up.", "If the dog is gone for good, OP will have plenty of hell coming in the form of cops over theft of a dog and a lawsuit from the owners.", "Don’t let your cat roam, someone’s “friendly” dog might get it.", "I had to stop watching that for a while when I had awful renters behind me.  An escape artist human agressive dog was involved, as well as a kid who was about 11 with a potty mouth.  And a mother with a potty mouth who didn't think that trespassing was a real thing, or false calls to LE.  She kept calling me in with false allegations of abusing my chickens-  she finally was told that she would be fined next time.  They finally had a \"friend\" shoot up their BBQ and they were gone three months later, right before covid thankfully.", "Have you ever heard the old adage “If it’s not yours, don’t touch it”? This is what applies here. OP is the GIANT A because YOU CALL ANIMAL CONTROL. You DO NOT physically put an animal in YOUR VEHICLE and drive away then physically take said animal out of YOUR VEHICLE and drop it off ANYWHERE. If this was a package it would be theft. If this was a person it would be kidnapping. And btw I HATE DOGS and would never do something like this. It’s so much easier to pick up the phone make a call and have animal control speak to the neighbor about keeping his animal under control. Just like if they were partying at night. Do you go over with a shotgun? No you ask politely for them to stop. Next time, you call the police for noise pollution. Gtfoh with your “Reddit love animals” crap", "What were the other options? He told the owners (multiple times), offered solutions (fence, leash, better supervision) and the neighbours didn't do anything. It has happened dozens of times with no visible effort on the neighbour's par", "How is another family gonna take care of it? The dog hasn't been found so it's Definitely not at a shelter. I assume op either shot the dog or dropped it in the middle of the woods somewhere to die", "How is it \"theft\" if OP takes an unsupervised dog to the shelter? It's not his job to entertain the dog until the neighbour comes by and picks it up. Shelters are there to collect roaming animals, and that's what the dog was.", "Yeah no literally where im from the dog would likely have been shot after several warnings. Not saying i would but ya. Ahole dog owner was warned. And the whole point of this is that the dog was on their property. Yeah if people were partying on my property id just go out with a shotgun", ">What were the other options?\n\nWhile it is the owners responsibility to keep his dog on his property, OP also has a responsibility. Don't want other people's dogs and potential wildlife running in your yard? Better get a fence.", "OP said the dog keeps getting through the shared fence: \"It is rarely leashed and also manages to get through our shared fence.\" and that the neighbour refused to fix the fence so the dog couldn't get through. \n\nIt just seems like there werent any other options other than calling animal control, but that would have ended up with the dog in the same shelter so just one less step than what OP did.\n\nThe financial burden of the neighbours negligence shouldnt be on OP, so what were the other options that would've been fair to OP?"]}