{"id": 34048, "submission_id": "18ufao5", "title": "AITA if i deleted a photo my mother took?", "selftext": "My (18m) mother always takes photo of me without my consent \n\nI dont like being photographed  especially by other peaple im not photogenic at all and the photos are always super unflattering i have photos of myself but they are carefully taken to make me appear decent \n\n(To clarify i like myself physically i just hate how i appear in photos not in general) \n\nToday my mother and i were having lunch at a restoraunt and she took a photo of my and it was so bad that i asked her to delete it she refused so i made a bit of a fuss (nothing much i just said not calmly that it looked awful and i wanted it deleted i didnt raise my voicr bcs i didnt want to disturb other peaple)  and she gave in and deleted it \n\nShe says that she takes photo bcs she want to have memories but i dont like those photos. \n\nShe dosent ask anymore bcs i refuse most of the time bcs im not in the mood to have my photo taken and i dont think i owe her that \n\nNow she's mad and basically wont talk to me \nIts 3 days that im trying to get her to came with me to go drink a hot chocholate and she refused again\n\nEdit\n\nI thik i left out an important info i am trans all of this for me are pre trastion photos tahts one of the reason i dont like them \n\nI didnt want to say it bcs i want to be mostly stealth but i think its important\n\nEdit 2 \n\nA commenter said that it was a relevant info ao im adding it \n\nBasically after she took a photo of me she started bragging that she managed to snuck a photo of me that also a part of why i reacted like that  \n\nEdit 3 \n\nI talked with my mother we found a solution wixh is that she wont show me the photo taht she takes and ill say yes mlre ofteb to take photos with her ", "created_utc": 1703941714, "permalink": "/r/AmItheAsshole/comments/18ufao5/aita_if_i_deleted_a_photo_my_mother_took/", "score": 42, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1 i made my mother delete my photo that she took without my consent \n2 she takes this photo to rember our moments so im impeding that\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Yta", "Idk man im not photogenic either and i hate when my friend takes photos of me because they look terrible but i still let her because she wants the memory of it. \n\nJust kinda sounds like she loves you and wants to have pictures of you. Unless shes making before and after references with them then its no issue. \n\nEnjoy having her love you and take the photos, youll regret it later if you dont.", "Hmm either NAH or ESH, because you have the right to not appear in photos but it's your mother that wants to create some memories ( you'll understand when you'll be older). However , she should tell you in advance so you can rearrange yourself and \"look decent\" in the photos she's taking . My mother is the same , she would take pic of me when eating( I used to be a mess and I would always have something on my hand / face), when speaking ( no comments) or when I was making weird face because i was very anxious with strangers around me . I would tell her that I hated the way I looked and needed to be warned about her taking pics so I could actually like the picture  or at least look at them without wanting to cry ( yes I was a really depressed child that already hated her looks).\nSo you should do the same , she doesn't mean any harm with those pics.", "My dad was a professional photographer for a  national newspaper long before digital when dark rooms, chemicals and expensive paper were required to turn film into photographs.  He always had 2 or 3 Nikon cameras with different lenses hanging from his neck.  There are thousands upon thousands of pictures of my sisters, mom and I. Most taken without our permission. \n\nMy son got a hold of those pictures and made 3 photo books out of  them (printed and bound) that showed the story of my dads life and family from the 1950’s until 2023. It made my dad   so  very happy. \n\nHe died 3 months later. He knew he was dying and he spent a lot of time looking through those books while he still had the strength to do anything. \n\nI understand how you feel. You can be all butt hurt and vain like you are or learn to roll with it (I make a silly face in almost all of the pictures) but don’t discount the memory part of it. Your vanity won’t matter in 30 years when she looks back at everything during the  twilight of her  life. You will want her to be able to do that someday and you may regret not being more cooperative then.   Maybe when you have kids yourself you’ll understand better. \n\nYTA\n\nETA: it’s also extremely cool to be able to show my kids how I looked and changed over the decades. Only possible because my dad took so many pictures.", "I understand you don't like your photo taken, but at the same time your mom just wants to have photos for memories. You aren't always going to be living with her or near her.\nAre you going to be the same way when you get a SO who wants to take pictures of you as well?", "Very soft YTA. \n\nI get how you feel and where you’re coming from. I (24F) hate most candid photos taken of me, but I think as I grew up I realized it doesn’t really matter. People take photos of you because they love you. They want to cherish these memories of you. \n\nAs long as it’s not posted anywhere without your permission, I would encourage you to let friends and family take photos of you. I’m sure you’ll appreciate them when you’re older. I personally really regret not having many photos of me from my teen years. Let your mother have these precious moments with you documented. Be kind to her. She loves you :)", "NTA \n\nYour mom needs to understand boundaries", "YTA. Your post contradicts itself. You say you like yourself physically but don't like how you appear in photos because you're not photogenic, then say you don't like the photos because they're of you pre-transition. Does your Mum even know you're hoping to transition? I mean if she was taking photos of you unreasonably often then I'd understand it, but it doesn't sound like that's the issue here. Just let your Mum have a few pics of her child, jeez. You won't be near her forever, and memories of your kids are precious.", "What do you use photos for? I use them to remember all the happy times when I’m depressed.  Going through my photo reel favourites has literally saved my life.\n\nYTA your vanity is taking a gift away from your mother.  You are the most important person in her life, and as she ages she is going to struggle to remember all the good times.  So what if you don’t look good? Why is that the most important thing?", "I'm glad you and your mom were able to find a solution.", "YTA\n\nYour mother is only storing them on her own phone; she just wants the memories.\n\nThis is based on your edit that the photos won't be shared or posted on socials. If that were the case my verdict would be different.", "NTA\n\nI hated getting my picture taken when I was younger, especially when done without my consent. \n\nI made a fuss of it, people got upset, peace and quiet eventually ensued.\n\nThey'll get over it. \n\nNOTE: Christ almighty. The spelling, the lack of commas, ...", "NTA. Taking photos of someone without their consent is creepy — it's happened to me too and really unnerved me.\n\nHowever, you should suck it up pose for photos for your mum occasionally. It's not a big deal if they're not going online.", "If the photos are JUST for your mother, then YTA. If she wants to post them online or share them with others, then you’re NTA.", "I don’t understand why people in reddit dislike their parents so much", "NTA I think people shouldn‘t take pictures of someone without their consent. Especially if they asked multiple times to stop", "NTA", "Honestly yta \n\nOne day you'll want these pictures even if you think you look bad now. \n\nI hate how I look in pictures and I barely have any to show my kids because of it. Let people take the pictures but ask that they not be put online", "Info:\n\nAre these pictures being posted someplace?  Or are they just pictures she wants to have of her child?\n\nThis is going to get me downvoted I know, but I'll say it anyway.  I feel that today too many people act like everyone needs \"consent\" for any action.  You were in public, right?  Well guess what, chances are you were photographed a number of times.  The restaurant probably had security cameras.  There may have been traffic cameras on the street.  Someone may have taken a picture with you in the background.  Ever go to an ATM?  Surprise, your picture was taken. All of those things are perfectly legal and valid.\n\nParents like to have pictures of their children.   Everything doesn't need to be perfectly curated to be what YOU like.  It sounds like your mom probably has very few pictures of you since you get pissy about it.\n\nIf she was posting it online, I'd agree with you.  If she had a plan to print it out and frame it in her home, I'd agree with you.  If she just wants a picture of you from a nice day you had together, that she can look at when she is having a bad day or thinking of you, you are overreacting.\n\nEdit:  In the comments it says they aren't going on social media.  So YTA", "NTA - no one is entitled to pictures of other people, including one’s children. \n\nTotally don’t get they Y comments, also - I strongly suspect there were already far less if it was the father and OP was a cis woman…", "NTA, you dont have to justify not wanting photos taken of you. No photos exist of me except one from when I was 3 years old. And that’s how I want it to stay.", "YTA\nYou could have posed for the photo of you are worried about you being unflattering. \n\nIt's her memories of you.", "I'll get down voted but I don't care NTA who bloody cares what is being done with the photo, u told her repeatedly I don't appreciate or want it and she did it any way....and I can guarantee that photo wouldn't have stayed just for mums eyes she would b getting it out to show family members or friends \"oh look at the picture of op I managed to sneak\" NTA at all Ur are not required to make urself uncomfortable for others", "NTA here's a suggestion: talk to your mom about your feelings and also try understanding her feelings. A compromise could look like you letting her take a photo of you when you say \"I feel confident today, it's ok to take a photo right now\" or sharing selfies or photos with her that your friends take. Maybe say once a month you agree to have your photo taken. She wants to look at your photo, which is sweet, but she also needs help respecting your boundaries, it's not cool to rejoice about crossing them. I don't think her behavior is ok but it sounds like you're not communicating with her. Honestly this seems pretty low stakes, use it as a test case for establishing, communicating, and respecting boundaries.", "YTA.\n\nUnless your mother has a habit of popping around and taking candid photos of you in uncompromising situations, it's fine. According to you, you were in a public place anyways and the photo was for your mum's personal album ONLY. Chances are that multiple people out there have taken photos that include you somewhere in the background over the years.\n\nI rarely look good in photos either. During my wedding photoshoot, I learned a few tips and tricks on how to look better in posed photos but still look like crap in candids. \n\nBut ultimately, if I look happy in a candid, I'll let it go even if my double chin is showing because:\n\n1. If its true, its true. No amount of denying or wilful ignorance will make my double chin disappear.\n\n2. If it really annoys me that much, I should get to the gym and start working out to make that double chin disappear.", "Taking photos of someone that doesn’t want their photo taken is ignoring their boundaries. NTA.", "Sorry, your mom is giving you the silent treatment over this? She’s an asshole.", "NAH but as someone who hates their photo being taken   I understand why it makes you uncomfortable but you should try to understand how important it is for your mother to have those. Not just the staged, posed photos you like but the candid ones which she can look back on to remind herself of the times she shared with you. Maybe just try to compromise, she can keep the photos but can't share them or post them anywhere. \n\nAlso, I guarantee you when you look back you won't think you look nearly as bad as you think you do now, because you are at the age of peak insecurity. I remember photos of myself that made me cry because I thought I looked so hideous when I was a teenager. Now I look back and think I looked so much better in those pictures than I thought I did and realise how hard on myself I was. Now I'm glad I have them and wish I had more", "YTA  Don't like it? Don't look at it.", "NAH", "Depends if she's just taking pics because she wants pre transition pics. Bit shitty to be hoarding photos of you before you change in appearance. \n\nLike my mum looking at old pics of me and reminding me how nice I looked when I was slimmer. Thanks a lot mum, way to accept me for who I am 👍", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (18m) mother always takes photo of me without my consent \n\nI dont like being photographed  especially by other peaple im not photogenic at all and the photos are always super unflattering i have photos of myself but they are carefully taken to make me appear decent \n\n(To clarify i like myself physically i just hate how i appear in photos not in general) \n\nToday my mother and i were having lunch at a restoraunt and she took a photo of my and it was so bad that i asked her to delete it she refused so i made a bit of a fuss (nothing much i just said not calmly that it looked awful and i wanted it deleted i didnt raise my voicr bcs i didnt want to disturb other peaple)  and she gave in and deleted it \n\nShe says that she takes photo bcs she want to have memories but i dont like those photos. \n\nShe dosent ask anymore bcs i refuse most of the time bcs im not in the mood to have my photo taken and i dont think i owe her that \n\nNow she's mad and basically wont talk to me \nIts 3 days that im trying to get her to came with me to go drink a hot chocholate and she refused again\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I’m a bit older than you, but I also grew up with technology so I get it. I used to hate seeing myself in most photos and would be really self conscious about other people taking them and posting them. \n\nLooking back, I really cherish the photos I ended up with. As time goes by, you forget more and more of your past experiences, but documenting them truly helps to hold on to those memories. And honestly, I can’t fathom why I was so self conscious at the time because I feel really confident about the photos now. \n\nSomething to try to help ease your anxiety : don’t look at the photos after someone takes them. Just capture the moment and move on, then later you’ll be surprised at how you feel about the photo. They become more about the memory as opposed to reviewing how you look directly after and critiquing yourself.", "NTA. She doesn't respect your boundaries and is being manipulative and abusive towards you. You should pursue an own apartment and go no contact.", "YTA.  Those are your mother’s photos and her memories. She wants her family’s photos and it’s bit about whether you feel you look good.  She is the owner of the photo and you sound like you need some help. Please seek further support.", "NAH really because your opinion on photos matters and I do think it sucks (so maybe kind of NTA???) when you get dismissed over photos of you that she should’ve had permission to take (as in, she didn’t since you didn’t give it so she shouldn’t be taking it. Consent really matters \n\nBut at the same time I do understand her, my entire family hates being in pictures so much that I have like 5 to my name of each of them. My uncle passed away a couple years ago and to only have such a tiny collection of photos of him is heartbreaking and I wish I had more. My mom is getting older these days too and, while I don’t because again consent matters the most, I really do sometimes desperately want to just take photos of her to keep for the day she isn’t around anymore. I want to remember what she looks like when she colors to relax, when she sees something cute, when she has an enjoyable meal, when she’s laughing at something a family member says\n\nAgain, I don’t because I value that she despises photos. But it does make me really sad I can’t. I know I’ll regret all the times I couldn’t capture special moments. So I don’t blame your mom that much even though I don’t blame you either", "NAH - sounds like you have some self esteem issues and your mom is just getting exhausted with dealing with it. I cant blame either of you but I do hope youre working on this in therapy.", "NAH, I hate pictures getting taken as well but I am also glad my family has taken pictures of me at events now looking at them.", "NTA- you are allowed to not want photos taken of you. As a compromise (if u want to compromise) it might be better for her if you took the photos (or selfies) instead, or if you teach her how to take good photos:)", "NAH\n\nYOU didn't delete the photo. You convinced your mother to delete her photo.\n\nYour mother is allowed to take pictures of you *for her own use*. If she's *posting* photos to share with others, that's different.\n\nYou have a choice to make. You KNOW that your mom is going to take pictures of you. You can:\n\n* Accept it as a part of your relationship with her.  \nOR\n* You can spend less time with her (or even go no contact if you REALLY want to make a point of how much you don't like it).", "NTA your mom is acting disrespectful and entitled. She should respect your boundaries not boast about violating them. I understand her desire to have pics about you though, one solution could be to just do a photo session where you pose for pics however you want and if there are some that you like she can keep those. Only if you're comfortable with that though.", "I won’t judge, but let her take the pics even if you are transitioning.  She wants to have something to remember you.  Perhaps allow her every now and again when you are looking your best and perhaps have a photo with her.", "YTA. If she takes it for herself and doesn’t share it then whats the problem? Not to mention, you complain about her having pre transition pictures of you but you also refuse to have her get new ones. And you complain she snaps them of you secretly but you also refuse to take photos in general. You are making a giant fuss over her understandably wanting memories. \n\nAlso please for the love of god proof read posts before posting them. This was painful", "I'm going to be blunt. Nobody needs your consent to take your photo when in a public place. You don't need to like other people’s photos they do. Your mum wants memories of hiu as you are now, in the same way she took photos of you as a baby, a toddler and kept every goofy school photo. That is her right, they are her memories and her photos. \nStop being a deva and be kind to your mother.\n\nYTA", "I have this issue with my mom as well. When she pulls out her phone I usually try to turn my face away. I fucking hate someone taking photos of me without my consent. She will do it and say she won’t post them. Then all of the sudden she sends them to a group chat with family. Like wtf dont you understand about respecting someone. NTA.", "I only have one photo of my twin brother before he died.", "INFO\n\nDid she post the photo to social media? Or was it just her photo?\n\n&#x200B;\n\nEdited after clarification\n\nYTA\n\nPictures are one of the main ways that we store memories. My mom's mom and sisters (now deceased) all hated having their picture taken, which means that I have next to zero pictures of them. Your mom wasn't using the picture for anything other than herself.  \n\n\nAdditionally, your issue here is not hers and I doubt she thinks you look bad in pictures.", "NTA. Your mother is being manipulative and not respecting your boundaries. It is fine if she wants to preserve memories but she should get your consent and agree to delete any you don’t like. Maybe try taking a picture for her and sending it to her instead? Do not give in to her emotional manipulation whatever you do", "NAH. I get it, I have a similar attitude to yours even if it's not for exactly the same reason. I don't like seeing myself in photos so I don't like people taking them. And at the end of the day, I think it's up to the subject of the photo to consent whether the photo is being put on social media or not.\n\nThat said, as I've got older, I've realised more and more that my mother doesn't care how I look in the photos, like at all. She just wants something to look at and remember the times we've spent together. At your age, I assume you'll be moving out of your mother's house soon if you haven't already. She will miss the hell out of you and would like to have those photos to look at. The carefully posed photos you have of yourself aren't the same because your mother wasn't a part of the experience.\n\nYou do not owe your mother these photos, but please consider allowing her to take more photos. They will mean a lot to her. How about next time you want to take some more flattering photos, why not have your mother take them? You can direct her with the angles, lighting etc. Maybe it'll be a fun experience?", "NTA its just plain decency to care about others wishes about photos of themselves. A compromise can be made here though, you can figure out what angles looks good on you/ shows you in a way you want to be shown. \n\nI know the urge to photograph family to have an image of the person you love and the happy memories. But I always make sure they are satisfied with the photo.  \n\nI am guessing your mother wants to have photos to remember pre-transition you by, since she might be worrying that she is losing the you she knows and loves. But then she should be working *with* you, not against you.", "Yta your mother use her resources to take that picture and was one approve picture. You can't delete that picture if your mother use the cloud to backup.", "so you dont want pre-trans pics, she brags when she's sneaked pics, she forces you to look at bad pics of yourself despite knowing you have body dysmorphia, she uses them to knowingly break your nc with a family member, and theyre deliberately bad - *nobody* needs pics of people eating ffs\n\nNTA and I hope everyone who said you were sees the edits and comments. This isnt a loving act of a supportive parent who just wants private memories. Theyre being used to taunt & passed on to others. \n\nOP has every right to not want any part of a 'ha!' situation, especially when it comes from their *mother*", "I told my mom that I hated my choir outfit and I didn't want her to take any pictures. Guess what she did? Took pictures and posted them to her family's group chat. I was angry, and then I got yelled at for being angry. I get that it's precious memories and whatnot, but giving birth to you does not mean that you don't get to have any boundaries. I have looked back on some of my older pictures, and unlike the stuff people keep saying on here, I looked *exactly*  as bad as I thought I did, I don't look good in or like my pictures. It's always been bad, people tell me to smile or \"stop looking like that\" when I am actually trying to smile and look nice. People who don't want to take pictures should not have to.", "YTA but you came up with a good solution between the 2 of you. As to deadpictures, you should just see them as a different person. You can't change the past any more than you can change DNA but fortunately you get to live your life however you see fit and that's a great thing moving forward. \n\nGood luck to you.", "YTA Your mother wants so memories of you, as you are, no your perfectly posed insta photos. Get over yourself", "NTA, Your body your choice.\n\nI guarantee you if you swap the roles here the outcome would be NTA from everyone else lol, you have a right to say you don't want pictures of you on her device that is YOUR consent.", "My mum hates photos, so we have very few of her. There are some relatives that we don't have a single picture of. Meanwhile,  with digital cameras,  we have thousands of photos of the youngest kids. \nI understand your reluctance. I didn't have a single selfie until a couple of years ago, but try and find a balance.  Let Mum have the occasional photo. By all means ban her from sharing it, but these photos can really mean a lot.", "I'm working under the assumption she is keeping these photos for herself and not sharing them to socials - that would change the situation significantly. \n\nSoft YTA. She wants memories, and you really don't have to fuss about looking nice to your mom. She's your mom, she thinks you look like You. Like her baby, child, etc. Those photos are just for her, no one else. Let her take them as a niceness to her. \n\nThere are very few photos of me pre-transition after childhood, and even less from early transition, I also wasn't big on being seen. They're kinda neat to look at now way down my transition, and given how shit my memory is - also nice for the memories yeah. \n\nUnderstand that when she celebrates getting one it isn't a haha I tricked you but an excitement at getting a photo for her memory logs. She knows full well she will get older, have a harder time remembering this stuff, and having something to look back at for the good memories is worth a lot. \n\nTry to find a compromise with her, talk to her about how it makes you uncomfortable, but let her take a photo occassionally so she doesn't have to surprise you with it, and in exchange she can respect your no when you give it as well for the days you Really Can't Do It.", "Ah I think it's shitty she is ignoring your boundaries but I also understand her POV and feel it might be a bit more ok for her to do that since shes not posting it anywhere. maybe NAH?", "I'm sorry but her reason is irrelevant. If you don't want that image of you in her possession, she LEGALLY has to delete it. As well as morally. Its an image of you, you have full rights to where it exists. End of.\n\nThis is an argument I've had with my mum for more than 15 years.", "YTA \n\nIf your mother doesn’t have social media then what does it matter if she has a photo of you on her personal phone? I couldn’t tell you how many photos my mother has of me on her phone that I would delete if I had a choice. But it’s not up to me because that is her phone, and she’s got every right to keep that photo on her phone as long it’s for her own personal use. Seriously you might wanna talk to somebody about why it bothers you that your mother has a picture of you on her phone so much.", "Get over yourself....\n\nYTA", "God. YTA.\n\nIn 20 years when you’re a grown up you’ll feel silly AND you’ll realize how good you looked AND you’ll wish you looked that good again AND you’ll be happy your mom has photos of you. \n\nIt’s not like she posted it on the internet.", "NTA - I'm also one of those people who usually looks terrible in pictures even though I'm happy with how I look in general. I try to go through the pictures other people take of me and delete at least the worst ones (and often all of them). I totally get where you're coming from and don't blame you for being picky about this.", "YTA", "NTA i also think it's incredibly rude to take someone's photo if they dont want it taken and without asking them.", "Its ironic that the concept of the candid photo is lost given how much easier it is to take pictures.", "They're trans. They don't want documentation of how they've changed.", "I probably wont get a SO since im aromantic but yes i dont like having my photo taken by anyone it doesnt matter who they are its not that i dont want to take photos with her or having my photos taken by her specifically  its a general thing i dont permit my friends to take photos of me either but at least they ask", "Mom’s desire to have photographs does not override OP’s consent to being photographed.", "Well i dont think so i like how i look in certain situation photo are not that situaion \n\nAlso yes and he dosnt respect that at all dhe misgenders me and basically donsent want me too \n\nAnd she has photo of me i dont always say no i just dont like the snuck ones that she takes when im not aware of it \n\nWell to be more specific i dont like all the photos but at least if im aware its better bcs idk actually but theyfeel better", "Dont get me wrong i love my mom i just dont agree with her most of the times", "Because they are children, and parents are automatically the bad guy.", "Having been a judo coach for more a decade and having seen plenty of parent - children interaction, let me assure you: The simple reason is many parents are just terrible parents.", "I didnt know she was taking a photo of me i was eating", "She has an habit of doing it \n\nShe chooses the worts moments like while im eating or while im not happy \n\n> Chances are that multiple people out there have taken photos that include you somewhere in the background over the years.\n\nYea but i dont have to see those photos my mother show me the ones she does and brags abaut how she managed to take a photo of me", "Everything doesn't need to be discussed through a therapy lens. \n\nSometimes parents want candid shots of their kids", "Yeah, what a healthy way to deal with an 18 yo…", "> when you look back you won't think you look nearly as bad as you think you do now\n\nOhhh this sooo much. I used to think that I was so fat and ugly when I was 18. Now looking at those pics all I see is the glowing youth, and I wish I looked at least half as good now 🤣 \n\nOP I fully understand being uncomfortable with random pictures but let your mom keep them. Asking her to keep them private can be a nice compromise.", "She forced me to look at hom and bragged abaut it", "Wow, what a sad life you must have if this is your reaction to a mother wanting to have a photo of their for memories. I genuinely feel bad for you.", "Well. It only took 5 min for a NC recommendation.", "Shes not abusive i mean she is not perfect but it is not  that bad", "The mom is not being abusive or manipulative.", "LOL extreme much. It’s a photo, it’s not abuse.", "Im still pre transtion btw \n\nAnd i dont refuse all the time she has photo of me \n\nAnd im sorry i tried but i have a problem with writing and sometimes it slips ill retry to tidy it up when i get home", "Funny how different laws are! in my country that would actually be illegal. Here you absolutely need consent for that or the person photographed could sue", "Whats a deva?", "I used to hate having my picture taken because I had such a disconnect between how I felt about myself and how I felt I appeared in pictures and so would regularly stay back when they were being taken. But I came to the decision that I would likely want to have them to look back on and so I started letting people take them.\n\nI've done a lot of personal growth this las year and while there are some pictures I'm still not necessarily crazy about myself in, overall I'm much more comfortable with it and glad I have the phtots to look back on. I even take some selfies now and then!", "No its just in her phone she dosent use social media", "I have talked with her Nd we found a solution", ">NTA, Your body your choice.\n\nAnd this phrase has officially gone overboard", "I'm guessing you are in the UK, since you said mum.  But that is not the case in the US. \n\nIf you are in public, and I snap a picture and you are in it, even if you don't want to be in it, LEGALLY, its my picture and I don't have to do anything.  Maybe that is different in the UK.   If you want to say morally, that is a bit more of a grey area to me.   How many times do you see people recording, what they perceive as bad customer service?  If the person being filmed doesn't want that, I don't know that morally the person needs to delete it if they are capturing their experience.", "You're wrong, she does not legally have to delete it.", "Try calling the police about this. Lol. “Legally”", "Bcs she tells me  abaut it and they sucks so much they are always in bad situaion (while im eating, with a helmet , while im not happy) and then she sends some to my uncle who makes videoskit that i hate even more bcs i am no contact with him", "It really depends. Some parents have no boundaries whatsoever. In my personal case my mom would claim it’s for her personal storage however shares my personal details with my relatives and people she thinks “it’s okay” to share things with. However it’s my life and I should have the say on who knows what about me - it’s not her decision to make. Maybe OP’s mom might be like that too which makes sense why OP doesn’t want “unglam” photos of them in mom’s phone.", "Taking pictures of your kids is a normal parent thing.  Some day you will either be grateful she took the pictures or be regretful you forced her not to", "I absolutely hate having my photo taken. I flat out refused for many years. I now have dead relatives that I have no pictures of/with. A good idea is to take many photos at the same time so then you can choose which one you think you look the best in.", "Your mom would ask, but you always said no. You only took your feeling into account not how your mom feels about it. She wants to have memories of you. YTA.", "I get that. I hate it, too. I have friends who refused to be in photos with their kids when their kids were little. Now, they have adult children and very few photos with them together. \n\nOne of my kids is medically fragile and has almost died half a dozen times. I can’t tell you how much her photos mean to me now, even the ones when she was so sick and you can tell she feels awful. \n\nThis is important to your mom. You mentioned you are trans - Has she been supportive?", "If you think you need consent to be photographed, you probably shouldn't go out in public then.", "idk dude sometimes you gotta love someone enough to make a small sacrifice. I hated my pic taken too when I was younger but it made my mom happy and I loved her enough to suck it up. Funny enough she hated pics of herself too but I'm glad she sucked it up bc now she's dead and I'm grateful af to have lots of pics of her. \n\nI think she should ask for OPs permission but OP needs to be saying yes more often. And shes not posting it anywhere.", "It feels better when they ask because they're treating you like a person they care about. They know this thing makes you uncomfortable, and they don't want to do that so they ask if you're okay with it first and respect your answer. By getting your consent she's records the memories _with_ you, not of you - treating you like a person, not an object. \n\n- When they take photos knowing that you don't like it, it feels like they care about pictures more than they care about you. \n- When they try to do it sneakily without you knowing it feels like you can't trust them and need to be hyperaware of where they are and what they're doing at all times to keep yourself safe.\n- When they gloat about having taken the photos it feels like they've won some kind of game and are calling you a loser.\n- When they do it repeatedly and you can't stop it it mskes you feel powerless.\n- When you try to communicate that you don't like it and they ignore you it feels like your opinion and feelings don't matter. Like they see you as something they own and control that doesn't get an opinion, like a dog. \n\nNTA. It doesn't matter what the photo is used for. It's the action of taking the photo, knowing that their child feels hurt by something and proudly doing it anyway, that makes a kid feels awful. Mother's may be within their rights to photograph their kids, but their relationship with their child should still be more important than pictures.", ">have to see those photos my mother show me the ones she does and brags abaut how she managed \n\nI'll give her the benefit of the doubt and say that she brags because you make it super hard for her to get a souvenir of your time together. Maybe try smiling and posing voluntarily for a photo the next time. Or surprise, surprise, maybe try to offer taking a selfie that you send to her and immediately delete from her phone.\n\nIf after a few months of that, she still brags, then she's TA.", "Then that parent is extremely selfish and rude", "It’s okay to want something, it’s not okay to just take it via manipulation.", "They can want them all they like, but parents aren’t entitled to candid photos of their kids if the kids don’t want them taken. Children aren’t property, they’re people and their feelings about being photographed matter.", "Wanting is little different than doing it anyway when specifically told not to. \n\nYour attitude if anything makes me sad. No wonder people are sad around you, if this kind of behauvior is okay to you, no matter of how innocent their intentions are.", "This commentor is projecting their mommy issues on you. I’ve been there, always hated pictures I didn’t pose for or like. But looking back, especially when interacting with my grandparents, it’s more for them, their memories. You can absolutely ask she not post them online and keep them just for her though. I’m gonna say NAH. I see mom’s POV with wanting pictures. And I see yours with not wanting them.", "An adult taking pictures of a teenager when one is specifically told not to THEN playing martyr when a picture is taken down. \n\nIt's also creepy af.", "He had expressed multiple times he doesn't want her to take pictures. It's creepy behauvior to do it anyway.", "I think they meant “diva.”", "Let her take the photos. Have her ask first, but just say yes more often, don’t shut her down all the time. \n\nI hate having mine taken too, but if you’re in a good relationship with her and she’s not posting them anywhere, let her take the photos for herself. She loves you and it’s one way she can remember moments with you. \n\nYou could just ask not to see them if you can’t handle seeing yourself “uncurated”. It’ll be good practice for your self confidence to let it the photos happen though and learn not to be bothered by them. Honestly, try even posing for them and smiling and just leaning into it to make it a more relaxed moment. You don’t have to see them after, but it will make your mom happy and be a cute little bonding moment. \n\nThe issue is your own self esteem and dislike of your image. Nobody really likes photos of themselves but it’s because we are so used to seeing ourselves only one way. It’ll be good to just embrace it and accept that you can’t be perfectly curated all the time. Social media has made it worse for people.\n\nEdit; I say all this and I’m NC with my abusive parents. If I had a mom who loved me, I’d let her take my photo.", "I am so glad! :)", "I got that law from photographers in the US. I'm not in the UK though.\n\nA photo taken OF a public area and you're in it is different to a photo OF YOU regardless of location though.\n\nThe customer service, I'd object as the one being filmed. Where I'm from, that is far from the UK, if I specifically I don't want younto film me, you have a legal obligation to stop filming. If it is used anywhere publicly or privately, you're in for a hell of a surprise if i know about it and can prove you've used it. Minimum is a huge fine.", "She does though.", "Helped me in the past.", "Yes that is a good idea thanks", "When it comes to your own being you are the only person who matters. A touch, a picture, an action. Whoever it involves has final say. Only his feelings matter when it comes to pictures of him, it doesn’t matter how his mom feels about it. If she wants memories of it she can do what we all did before everyone had a camera in their pocket, just remember it in your mind for as long as you can.", "To be clear she has photos (very recent ones) of me its not like i dont ever take photos with her", "In public you do not have the same expectations of privacy that you have with your family. And consent matters in public too.\n\nDon’t take pics of people without consent, it’s creepy", "Drama queen alert", "And you are a predator or at least an enabler. I'm sorry about your parents being abusive towards you, because you're clearly reflecting them towards me. \n\nShe's taking pictures of a teenager after especially told not to, then playing martyr when a picture is taken down. That's creepy behauvior.", "Mom isn't playing matyr. You make it seem like this is random person taking pictures. It's a mom trying to capture memories.", "Oh ok thanks", "I dont have a great relationship with her tbh \n\nAnd i will ask its a good idea i dint even ask to see it this time she just showed me bragging abait how she was able to take the photo i was aslo annyoed by that its prob why i recated to badly", "Not in America she doesn’t.", "Look it up. She doesn't", "I hated almost all my pictures growing up. Now looking back (10 years later), i wished I had more pictures and I don't hate how I look. I hate how much I cared about looking good in the photo.\n\nI think the comment above has a good suggestion. Let her take multiple and choose the one you like the best. Or maybe suggest some times she can take a photo (whenever you feel decent or like the setting).", "Not when it comes to relationships you want to keep in. You also have to consider their feelings about things as well. You can't just focus on your own feelings every single encounter with them. Or you will end up alone with no one.", "Look, whether I think it is creepy or not, doesn't negate my point. \n\nDo I think it can be creepy to just take a random picture of a person or group?  Sure it can be.  I've also seen random people take awesome pictures of a couple getting engaged, and they liked it from a different angle, etc.   That doesn't mean consent is necessary.", "Without concent. It can't be underlined enough of how important consent is. I'm surprised in the end of 2023 you haven't picked that up.", "Ok whoa this is info that should be in the main post because her bragging to you about how she “snuck” a photo of you makes it seem like it’s not just “mom wants precious keepsake” but “mom is fucking with you.” Intentionally violating a boundary and gloating about it is a red flag. 🚩 \n\nWith this info, I vote NTA.", "Oh sorry, just the states. I don't know about south America.", "Not in UK either. I've looked it up, I didn't know this before.", "Worked against my cousin... google didn't get him out of the fine though, sadly. Even had to pay to fight her in caught... (her being the one saying he had her image in a public place). I guess experience hits harder than words on a screen. You learn it quicker too.", "Of course considering other peoples feelings is important but when it comes to your own being (I’m still not sure on a good way to phrase that) your feelings in the end are the only ones that matter. You can make the decision on if you want to go on the side of what the other person is feeling but 100% it’s always up to you yourself to make that final decision.", "Not everything requires consent. Simply taking a picture of someone in the moment just for yourself isn't bad. I take pictures of my wife and kids all the time in the moment. I don't ask them for consent. But you are making something innocent to be more than what it is. Mom is not being creepy or manipulative or abusive.", "Yeah it changes the situation a little bit", "She has told you not to take them but you keep on doing it for your own pleasure?", "It's called making memories. Holy shit. Kids aren't always going to be around. Spouses can die or get sick suddenly. There is nothing wrong with taking pictures of family in the moment to capture it.\nMy wife has never told me no to taking pictures.", "You see, that's the difference. He's in tender age, has told his mom specifically NOT to take pictures, but according to you, it's okay to keep doing it. She does continue and people are here like \"yeah, go ahead. Don't mind he saying no, it doesn't matter.\"\n\nVery creepy IMO.", "Again, that like saying a dad changing his daughters diaper is creepy when it's not. It's an innocent act. OP should be more open to thier mother being able to take photos. She isn't posting them online or anything."]}