{"id": 34075, "submission_id": "18uua29", "title": "AITA for telling my boyfriend he’s not the only one I’ll be kissing on New Years?", "selftext": "So I don’t know if this is a universal thing but my (19F) family has a tradition where on New Years when it hits midnight we give one person a kiss (my parents kiss, and i’d give me little brother a kiss on the cheek). Well my boyfriend (20M) asked if we were going to do a New Years kiss and I told him yes but I was also going to give my little brother a kiss on the cheek too because I’ve done it since he was born. He told me that he’d prefer if I just kissed him but I told him that it was tradition for me to give my little brother a kiss on the cheek. He called me an asshole because I’m only supposed to kiss him on New Years so am I the asshole for refusing?\n\nUpdate: I broke up with my boyfriend and blocked him, and I feel kind of a weight off my shoulders.", "created_utc": 1703982152, "permalink": "/r/AmItheAsshole/comments/18uua29/aita_for_telling_my_boyfriend_hes_not_the_only/", "score": 1335, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I want to be judged for the fact I refused to just kiss my boyfriend on New Years and I think I’m the asshole because he got upset and told me I was one when o refused to kiss just him\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Is this real?  He’s jealous of a kiss on your little brother’s cheek?\n\nDon’t give your BF a kiss on New Year’s, he’s a serious problem. 🚩", "Ew what? He's upset about this? Yikes be careful with this guy, that is extremely jealous and possessive behavior. To me this would be a huge red flag.", "NTA....Really? He's concerned with a harmless kiss with your brother?", "NTA your boyfriend has problems.", "Getting jealous of your girlfriends little brother, sexually, is one of the saddest of the red flags.", "NTA. He has a lot to learn. Do not feel pressured by him here. This is not only a family tradition, but honestly on NYE a widely celebrated tradition. Enjoy the celebration. He needs to accept this.", "NTA. My brother passed from cancer a year ago. Id give anything to kiss him on the cheek on new years.", "Get a new boyfriend, this one is broken.", "He does realise that the kiss between the two of you and the kiss with your brother will be veeeeeery different, right?! NTA.", "How are you even thinking you can possibly be TA?  In no universe, including all the multiverse of the MCU can you be considered the AH for this", "Your boyfriend sounds mentally unstable in a way that could become dangerous for you. His behavior is not 'normal' or loving. \n                                                      \nAnyone trying to control the affection you show your little brother is either one sandwich short of a picnic or a controlling psycho because that's weird as hell. \n\nSpeaking from experience, please be careful. \nPeople like your boyfriend usually escalate their controlling behavior over time.\n\nNTA.", "NTA. Bf sounds immature.", "NTA - Is your boyfriend 12?", "RED FLAG RED FLAG RED FLAG……it’s always something small an seemingly innocuous but this is how many controlling abusers start. Don’t kiss anyone but me and that includes your family……you can’t go see your family bc you are my family…..you can’t call your family…..you can’t call anyone……starts tracking your car with gps……..the next thing you know you’re just another Dateline narrated by Keith Morrison.", "NTA, your boyfriend must be really insecure if he's bothered by you giving your brother a kiss on the cheek.\n\nEither that or he watches way too much incest porn and doesn't understand that movies aren't real. 😂", "NTA I find it odd it even came up ahead of time.", "NTA - Someone should tell your boyfriend that jealousy, in most manifestations, is a damp piece of wood that nestles in tightly by the heart of a relationship and starts rotting on day 1. \n\nYou may want to tell him that this is controlling behavior and a red flag.", "NTA. This is you family tradition. Also, who gets upset shout someone giving their little brother a kiss on the cheek.", "NTA, your boyfriend's very insecure and controlling. Consider starting the New Year 150 pounds lighter by dumping him.", "NTA\n\nIf I were you though I’d stick to giving one kiss on NYE, to your brothers cheek, after you ditch this controlling AH.", "NTA. Weird dude", "I refuse to believe this is real. Nope.", "NTA, you should probably just kiss your little brother and tell this guy to go kid his own insecurities.", "Nta.   He's really jealous of your little brother getting a kiss on the cheek?  Seems like a weirdo", "When I was a kid and my parents threw new years parties, we kissed literally everyone in the room... I don't think the men kissed each other, or the ladies kissed each other, but other than that it was kissing all over the place, on the lips, including cousins and siblings.", "Woah woah woah. Back this horse up.\n\nYou have a tradition of a cheek kiss to your little brother. Very cute! Genuinely sounds adorably wholesome. I am presuming this tradition started years before you started dating.\n\nYour parents kiss on New Years. On the mouth, because that’s the usual tradition everyone does. NYE kisses are for couples. Your parents are a couple, and it’s super cute and wholesome they kiss.\n\nBut now you are also in a romantic partnership. And you’re bucking the social norm (that your family also engages in) that on NYE if you’re romantically involved with someone you kiss them on the mouth. \n\nYou’re not giving your traditions room to grow with your life. You’re in a different stage now. \n\nAre you planning on getting married, having your own kids, and kissing your little brother on the cheek when you’re 50? Is your partner (either this bf or someone else) supposed to never get a NYE kiss for the rest of their life?\n\nThere’s nothing wrong with changes as you grow. You can still give your brother a cheek kiss after you have the first kiss with your romantic partner.\n\nI suppose my answer is soft YTA to yourself.", "NTA but your BF is creating an issue out of nothing. Don't give him his New Year's kiss until he's at least a little brighter. It may be a few years though.", "Wow! Red flag on the field. Nta BF should know the difference between a kiss for him, and the one you’re giving little bro", "NTA: he seems insecure", "NTA and your boyfriend sounds like a real turdneck.", "Oh my friend, you are definitely NTA, and you can do so much better then any man who feels threatened by your relationship with your younger brother, or who’s your friend by a peck on the cheek to anyone", "NTA- If the issue was you wanting to kiss your brother FIRST then I would agree with your bf but kissing ONLY him? No way dude, I'd give kisses to everyone just to spite him.", "  NTA but your boyfriend is a controlled asshole.", "NTA Be very careful with what path you choose with this relationship.\nMy younger brother was not allowed to hug me or our Mum and he definitely couldn't give us a kiss or tell us he loved us and that lasted for 10 years.  It wasn't until they split that we found out it was A LOT worse than that.  His g/f ruled his life for 10 years. They split over 3 years ago and it's only been this past year that he is back to himself.  Laughing, joking, hugging, going out (without petmission) and even watching the big bang theory, among other programmes and movies.  He wasn't allowed to watch it because of 'Penny' and he couldn't play certain games due to the female characters.\n\nAgain, NTA but please, think about this.  It may be a good idea to talk to you family and friends about this.  I'm sure they would have the same concerns as I'm sure many here do.\n\nGood Luck.", "NTA, but you're bf sure is. He does sound like a creepy controller in the making, and he's envious of your lil brother. What an insecure jerk.\n\nI hate this entire idea of entitlement (exclusive or not) to people's bodies on NYE. I was in high school, and some random dude at a restaurant/bar grabbed me and smashed a kiss on my face at midnight. I was with a girlfriend when she got off work nearby, completely unsuspecting.", "don't you mean your new ex BF? lmao he is immature as fuck.\n\nI bet he watches incest porn, NTA", "I would tell your boyfriend that you’ll definitely only be kissing one person on new year’s and it won’t be him. NTA", "Do not let your partner control you. You know that kissing your brother is not sexual, and it is not cheating. If you allow your partner to control you on this, he will likely roll right into controlling who your friends are or who you spend time with. Which is abuse.", "NTA\n\nIt should not even occur to him to be jealous of your little brother. This is a red flag.", "“Those kisses belong to only me.” Then proceeds to grunt and spin on his but like a great gorilla. 😂😂", "I could see if you wanted to kiss an ex or another male friend, but he's your younger brother and it's a kiss on the cheek. You're NTA", "Obviously, because it's this sub, and he's a man this is clearly NTA and he's the biggest AH ever. Just dump him", "🚩🚩🚩🚩", "NTA your boyfriend sounds weirdly possessive. A kiss on the cheek? That’s something that only friends do in many countries casually and this is family. \n\nYour boyfriend sounds really… odd. Be wary.", "He's sounds super fragile.\n\nDump him \n\nNTA", "You bf sounds like an insecure jackass.", "NTA and he careful of your bfas he's a bit bossy.", "You're absolutely not the asshole for valuing and upholding your family tradition, despite your boyfriend's weird preference. It's completely unfair for him to label you as such and disrespect your values. He's the asshole for trying to undermine and belittle something that is meaningful to you. You deserve a partner who respects and supports you, not someone who tries to invalidate your choices. \n\nIt's clear that your partner is exhibiting toxic behaviors, particularly in regards to his jealousy towards a little brother. As a young person, you deserve to be in a healthy and supportive relationship, and it's time to prioritize yourself. It's understandable to have feelings for someone, but staying in a relationship with someone who causes unnecessary stress is not worth it. It's time to cut ties and focus on finding happiness and respect elsewhere. Remember, you deserve better and should not tolerate mistreatment or toxicity from anyone.", "NTA.  Start the New Year right.  Dump him", "It’s a cheek kiss. NTA your bf has something wrong with this mindset", "Red flag. Sounds controlling to me. Might want to reevaluate your relationship.", "NTA and yikes this is concerning.", "NTA. Your boyfriend is making a huge deal out of nothing.", "Wtf? No you’re NTA. It’s a kiss on the cheek.  That’s a fairly normal affection among siblings.", "NTA - Is your boyfriend serious? Why is he jealous that you're going to kiss your brother on the cheek like you always do...? That'd be a red flag for me, personally.", "What the heck. You are NTA, and boyfriend is being a controlling A.  \n\nYou should not have to ask him for \"permission\" and he should not be granting or withholding it.  It's literally none of his business.  You are 19.  Time to move on from this guy unless he apologizes immediately!", "NTA and there seems to be a generation of boys growing up who are taught to be jealous of everything.", "NTA\n\nYour boyfriend is already trying to control you - he just showed you his true colours.", "Eww. Your boyfriend is controlling. Don't be with people like that. They just take and take and you always thinks, yup, I gave up so much for this person, surely they appreciate it. Nope. Give in to one thing and the next demand is there. But lord help you if YOU want them to do something for you. Pick something up from the store? Stop sleeping with your best friend? Nah and no. You're the only one giving with people like this.", "NTA, this is a harmless family tradition that he has no reason to be bent out of shape over. It's not like you're kissing some other guy who is \"just a friend\".", "NTA\n\nNew Year's Resolution - find a guy who isn't an insecure AH", "NTA. I’m bisexual with a male partner. We have a female friend coming to NYE that is single and has been having a rough go of it. I asked my partner if after I kiss him at midnight, I give her a simple peck as well. He was like “sure, I don’t care.” I wouldn’t even consider it worth asking permission to kiss a close friend or family member on the cheek. Your partner is red flag amounts of controlling.", "NTA\n\nSorry, where are the rules about NYE kissing?\n\nKiss who YOU want.", "The clear solution is to also have your bf kiss your little brother too  \n(NTA)", "NTA. But please acknowledge the giant red flag he is showing you.", "NTA and your boyfriend is very much not ready to be in a relationship.", "Sorry, what?? Lmao, that is an ADORABLE tradition and you need to tell your bf that jealousy over your Little Brother is not cool.", "NTA. he's a weirdo for getting upset about it and calling you an asshole", "Girl…run from that relationship", "NTA\n\nYour boyfriend is pretty ridiculous though.  Jealous over a family tradition and showing love and care to your little brother.  What a weirdo!", "NTA, \n\nHe's jealous of your little brother? \n\nHe's got a couple things to work through", "If your bf can’t handle you giving your little brother a kiss on the cheek, for New Year’s, he has problems.", "NTA. Run.", "Nope and that’s a red flag girlie-walk away!", "NTA. Red Flag.", "NTA. It’s your tradition. But it’s a major 🚩that your boyfriend is getting this jealous over you kissing your brother on the cheek. You should get out while you still can", "OMG.....you should be asking if YTA for hanging on to this jerk. I'll chalk it up to his age and obvious lack of maturity, but if I were you, I'd be making a New Year's resolution to get rid of this guy. Right now, you are NTA. Hopefully, next year you won't be either.", "I wish you good fortune in finding a proper replacement for your current BF in 2024.\n\n If you were planning on a passionate kiss with some other guy at a party, ok, that's worth objecting to.   But, how this AH can possibly see a problem in you giving your BROTHER a kiss on a cheek, I just can't understand. \n\n1000% NTA", "Kiss him GOODBYE on NYE. \n\nThat's crazy toxic and baby steps towards abusive behaviour.", "NTA. Why does your boyfriend even feel threatened by your younger brother? That's such a bizarre concern to have.", "NTa. He sounds so full of himself and also so possessive. Get him gone", "NTA, that's totally innocent.", "What?! \n\nIn my family we hug and kiss each other on new years all the time, is not weird or crazy to celebrate a new year by hugging and kissing each other. The only difference is that if you have a partner, the first kiss will be that person, if you don’t have one, the first hug or kiss is the person standing next to you. \n\nSince I started dating my partner he’s been my new years first kiss (except for the new years we were long distance) then my mom , sister, grandma & stepdad. My mom’s first kiss is my stepdad. This year my first kiss is my fiancee & second will be our twins .", "Your boyfriend has no right whatsoever to tell you who you can kiss.  He isn’t the master of your behavior.  And to be so obviously jealous of your younger brother?  RED FLAG!  Something is not right with him.\nNTA. .", "NTA.  Leave that dude.  No, seriously, leave that dude.  he’s so insecure that he’s upset that you’re going to be giving your brother a kiss on the cheek? That’s beyond dangerous. It’s only going to go downhill from here.", "Nta your bf doesn't sound mature enough to be in a relationship", "Hey its me ur red flag\n\nNTA", "Straight up - BF is TA", "NTA and that’s a huge red flag. Being jealous of your little brother? Incredibly fragile ego on this guy, and for what seems to be a sub-year long relationship he’s way too possessive.", "Your boyfriend has confused familial customs of kissing, with sexual kissing.   \n\n\nHe needs to ponder that.   \n\n\nNTA.", "NTA. Boyfriend is unreasonable here.", "NTA\n\n\nBut, OP, this is a symptom of a much bigger problem.  \n\n\nAnd it's only going to get worse over time.\n\n\nBeware.", "NTA. He’s your brother. He was in the picture before your bf was and honestly I’m not sure if this is a red flag or not bc there’s not enough background information but it certainly raised my eyebrows.\n\nBesides it’s a kiss on the cheek and from the sound of it your whole family does it.", "NTA, just be discreet when you slip him the tongue.", "NTA but I don’t think he’s jealous of the brother. I think he is just excited/happy to share a New Years kiss with a romantic partner and he built it up in his head. (Think everyone kissing their love in Times Square are midnight). When she told him she was kissing her brother it dimmed what he thought was going to happen.", "Your boyfriend is an asshole. It’s weird that he would try and gatekeep your lips from the cheeks of your family. Bizarre.", "Keep the family tradition, trash the turd", "NTA - I suggest starting the New Year off in a positive direction, and make your next words to him be \"Buh-Bye\".", "NTA. He’s upset about you kissing your brother on the cheek?? That’s insane.", "NTA\n\nIt’s a kiss on the cheek not a make out session", "NTA. Dump the boyfriend as a new years gift to yourself cause that’s some major 🚩🚩🚩 he’s got.", "This is bizarre. Run away from him.", "Nta he’s a child. And I mean your boyfriend not your brother", "NTA. Your boyfriend's telling you the withhold affection from your family yeah that's not cool. He's jealous or he's extremely controlling or both. Yeah definitely take a look at any past behaviors and actions and that will hopefully clue you in whether you should continue this relationship but it don't look like it", "Drop the boyfriend \n\nEven though it’s within 48 hours of NYE. \n\nHe is an ass. \nDon’t celebrate with an ass.", "When he goes in for that kiss you should quickly turn around with your cheeks showing just in time for the big moment.", "Honey, this is your sign to run. Your brother should be the *only* boy you kiss tomorrow night!", "With all due respect, you are better than this. Keep the brother, drop the bf.", "You need to run away from this guy. No normal guy has any problem with a girl kissing her little brother on the cheek.", "[removed]", "NTA and your boyfriend is being a knob. \n\nHe verbally abused you for pecking your brother on the cheek? Run, girl, run.", "He sounds off", "NTA. Your boyfriend has bumped his head. If you planned on kissing another man that wasn’t family I could understand. But giving your family a kiss on the cheek is completely understandable", "NTA. This is a really immature view of it. It could also be the start of even more controlling behavior. You're both  very young so you're not experienced enough to know that no fully grown adult woman would put up with this type of demand. If he keeps throwing a tantrum like a child about it, then dump him and find a better bf", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I don’t know if this is a universal thing but my (19F) family has a tradition where on New Years when it hits midnight we give one person a kiss (my parents kiss, and i’d give me little brother a kiss on the cheek). Well my boyfriend (20M) asked if we were going to do a New Years kiss and I told him yes but I was also going to give my little brother a kiss on the cheek too because I’ve done it since he was born. He told me that he’d prefer if I just kissed him but I told him that it was tradition for me to give my little brother a kiss on the cheek. He called me an asshole because I’m only supposed to kiss him on New Years so am I the asshole for refusing?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I think it’s deeply creepy that your boyfriend is making a big deal out of this and trying to control your actions. Super big red flag.", "I feel so sorry for myself I took time out of my day to read this extremely trivial ‘problem’.", "NTA, that sounds like a BIG red flag to me...", "So let me set this straight: your BF is jealous of your little brother?\n\nWhat kind of idiot is he?\n\nWhy are you putting putting up with his shit, what is your problem?", "It's only one day away but you still have time to dump your BF that thinks kissing your brother on the cheek is a problem. Not all men are that insane.", "NAH, there's nothing wrong with finding the kissing a sibling a bit odd (yes, even on the cheek).", "NTA. Kiss your brother and everybody else in the room! It's tradition!", "NTA, tell your boyfriend to grow up", "NTA - your boyfriend is jealous and possessive. This is a massive red flag. Then he tried to gaslight you by convincing you that you’re the asshole here. I don’t think I’d be kissing him at midnight at all, instead a handshake and a good luck with single life buddy.", "Boyfriend is a dick", "[removed]", "When we used to get together as our whole extended family on NYE, our tradition was to give kisses to everyone. I have 4 sisters, and it was common to give everyone a kiss at midnight. It seems like your BF has already tagged you as his property, and calling you and asshole because you don't agree with him is a huge red flag. Serious insecurity here. Very controlling behavior too.", "NTA. Just what is going through his mind? He think you’re going to slip your brother 👅 or something? Eww and what an uncomfortable hill for him to stand on. 😳 He sounds like he has ridged notions of affection and familial contact… or could be he’s just a jealous and fragile muppet.", "NTA - Time for a new boyfriend!", "NTA. He shouldn’t get any kiss for NYE.", "This is stupid.", "NTA your BF has issues", "NTA.\n\nThis is honestly the affect and result of all the disgusting step sibling and incest style porn thats all over the internet. \n\nThis isn’t the first time I’ve seen a similar post about a boyfriend being uncomfortable with something truly innocent and it’s to do with family.", "NTA and I suggest your little brother be the only one you give a kiss to this year and your ex-boyfriend will have to find someone else for it.", "Your bf sounds controlling and insecure. Dear God…it’s your brother. You can kiss your brother, your father, mother…anyone else like that. Watch his behaviors.", "Jealousy is a dangerous weapon.  It only gets stronger over time.", "NTA, but the fact your boyfriend is jealous/upset You’re gonna give your little brother a kiss on the cheek is very concerning!\n\nIt just screams control/fragile ego issues!", "What the fuck? They’re FAMILY! If it was some shit like an ex-boyfriend I’d understand it but unless your boyfriend felt like you’d cheat on him with… your little brother… then that’s just ridiculous. This has to be the most one sided post I’ve seen here in awhile 😂", "Aw, sounds like lil BF wants to make sure he has control over you! Ditch his ass and hang with your fam on NYE.", "NTA\n\nHe's jealous of the cute tradition you have with your brother? \n\nThat's really weird, and it's also disturbing and controlling that he flipped out on you and tried to twist this/guilt you and pressure you into not doing something that you want to do.", "NTA.\n\nReddit cracks me up everyone saying you should ditch the BF, though! 🤣\n\nOh, btw, ditch the BF!", "NTA-At first I was like wtf with the title but after reading the whole post ur bf sounds controlling. It’s ur little brother! So u can kiss him on the cheek and if ur bf gets jealous then that’s a red flag.", "Why does kissing matter so much to him. Like oh noo my gf wants to follow a family tradition", "NTA. Your boyfriend's jealousy of your younger brother is a huge red flag 🚩", "Why is he so mad about a cute little tradition with your little brother? NTA. He's being weird. He's being jealous of your little brother. That's weird!", "Lol he's weird af and controlling for that\n\nNta", "NTA. Your bf can't handle that you are going to kiss your little brother on the cheek? That's some serious control issues there. (Does it make \"his\" NYE kiss less valuable, maybe? LOL) Skip bf's kiss?", "He sounds jealous and controlling. This is concerning behaviour. \n\nNTA", "Nta. Red flag red flag red flag. If your bf is already dictating and trying to interfere with your familial affection and traditions because of his jealousy and possessiveness you need to start your new year fresh single and ready to find love with someone who isn't threatened by your healthy and loving family connections.", "Any man so insecure and controlling that he is bothered by and thinks he gets a say in you kissing your brother on the cheek isn't ready to date. It will only get worse- get rid of him.", "NTA. He's getting the only 'romantic' kiss, and it's unreasonable to demand you abandon a harmless (and rather cute) family tradition just because he swanned into your life. Might be worth talking to him about why he's so put out by it though: possibly there is some cultural thing on his side that makes it more of a big deal to him, or possibly he's just super insecure (especially if this is his first time having a gf  at NYE and he's built the kiss thing into a major deal in his head). If he's not an AH the rest of the time and you intend to continue the relationship, worth taking the time to find out what his actual issue is and address that so you do not have to chose between what you want to do with your family and appeasing his little fits.", "NTA. That dude is weird.", "[removed]", "NTA\n\nDude got issues and you're not a therapist...", "NAH\n\nSome people grow up in a culture where kissing family members or friends is normal. Some people grow up in families where that isn't normal. Neither way is right or wrong imo.\n\nProbably a deal-breaker though is you can't reach some form of compromise", "NTA\nHis ego sounds very fragile, not sure why hes seemingly jealous of your younger brother??? Or maybe just uncomfortable????? Regardless the vibes are weird from him.\n\nFamily traditions are something you get to decide to do regardless of who you're dating. And it's extremely common to kiss more than one person on New Years (i.e. family, friends)", "NTA.  That's some real insecurity he's showing off there.  \n\nYou're not running off to make out with somebody.  Family on the cheek.  He's getting the good stuff, or he was until this ugly behavior.", "NTA\nGood thing you told him. Imagine the meltdown on NTE if it'd happened unexpectedly.  You've learned something about your BF. He has insecurities and he believes he can control what you do and how you relate to your family. 🚩", "Your boyfriend is pissed cause you're going to give your little brother a kiss on the cheek and you're wondering if you're the asshole?  No, you are NTA.  \n\nHowever, a 20 year old man jealous of his girlfriend is giving her little brother a kiss on the cheek may be a little more trouble than a simple asshole.  This is insanity level jealousy and should have you rethinking things with him... and this is not something I jump to  often.", "Your hopefully soon-to-be-ex boyfriend is a controlling yutz. Give your brother a kiss, same as always. You're NTA.", "Remind your bf that he's the newest person in your life and therefore the most expendable.", "NTA - run don’t walk away from this relationship", "YTA for the title bait", "NTA, and your boyfriend sounds like an Andrew Tate wannabe.\n\nMaybe the only people you should show affection to this New Years is your family.", "NTA.\n\nI don't feel like this even needs to be dignified with a response, if i'm honest XD\n\nThe dude's clearly insecure, and projecting it onto you. Not only that, but he's jealous of a *cheek kiss* to your ***brother***.  \nIf this happened to me, my foot would be kissing his ass in the direction of the door.", "He jealous of your little brother!!!  Lose this one.  Your generation (well everybody really)needs to weed this shit out.NIP IT IN THE BUD.   Dont have relationships like this.", "Please disinvite this jealous AH. He is too controlling and unreasonable, and Ted flags are waving non-stop. \n\nDon’t abandon your kid brother on NYE. NTA, OP but if you stay with this jerk, he will undoubtedly pull you away from your loving family.", "NTA.  If he can't handle you showing affection to a FAMILY MEMBER, he's going to be a nightmare down the track.", "Title: “AITA for telling my husband that I’m going to fuck a bunch of people on New Year’s Eve?”\n\nThread: “in our household, we call hugging fucking. My husband is insanely jealous that I want to platonically hug people on New Year’s Eve. AITA?”\n\nThese fucking threads are written by an AI tuned to rage bait all of you.", "NTA\n\nThat's some really possessive jealousy your bf has. Like others said that is a serious red flag. What's next, will he will become angry if you talk to other guys? It's a reasonable progression, and will make your life miserable.\n\nSeriously take a look at the dynamics in your relationship with him, it may save you a lot of emotional pain later, and maybe physical pain also.", "NTA but I think you should loom at those 🚩🚩🚩🚩", "NTA . It seems very strange to me that your boyfriend is jealous of your sibling relationship- a perfect normal and healthy, good thing to have. You need to tell your bf that it's actually a concern for you that he has a problem with your familial relationships.\n\nI feel like I've learned a lot about love, and this is one thing I'm certain on: you encourage and try to be part of healthy relationships, ESPECIALLY family. We humans treasure healthy family relationships so highly, and that and romantic relationships are what we value above all. The cool thing is you can basically get a second version of family with a romantic relationship. This is great for everyone- it's the most amazing thing when you can hang out with your or your partner's family for hours and both just bask really in this feeling of happiness and acceptance and love and family.\n\nSo people worry because they are concerned that it seems like he is starting to want to cut off familial love. This is something that happens in a lot of abusive relationships. If you see signs that this could be the case, run. It could also be your bf feels jealous for another reason. He might feel he wants to come first, or he might feel you have to split your affection or time. But of course- you don't have to split your affection, that's silly, and you don't have to split your time if you can have them start to have affection to each other too.\n\nTell him \"You are the only one I will be kissing on the lips! Since you are my partner, and I want you and my brother to have a relationship too, maybe you can hug him at midnight along with my cheek kiss! My two best guys! That would make me so happy!\"\n\nThis should make him happy, and encourage him to begin or strengthen a relationship with your brother, and become friends or even family. He doesn't HAVE to hug your brother, but this should let him know that you want him to be part of the family too. If he understands that, he shouldn't feel he has to compete, because he will be part of things too, and gain a lot also.\n\nThe only times I have felt jealous of my now husband's family were when I didn't feel like I was wanted too and it was me or them. Even then most the time I understood. But, my now husband started inviting me early to family stuff, and his family, and his Mom especially, always made me feel so included. This is the way. I love going to his family stuff. Just yesterday he rearranged plans because a family thing of mine came up last minute and he wanted to go. Sharing the family love is just good... for everyone.", " NTA….new year, new better bf.", "You’re only TA for your clickbait title.", "Your bf is jealous of you kissing your *little brother on the cheek* ?!\n\nThis is so weird and creepy of him.  Run 🚩🚩🚩🚩", "NTA and your bf sounds very controlling.  May not make for a very healthy relationship. Good luck!", "NAH, but it sounds like he was picturing it as a sexy romantic event and took you bringing up your brother as \"no :) I'd rather just give you the kind of kiss I'd give my little brother.\" He definitely sounds insecure, but it seems like he's feeling rejected over you not wanting to have a romantic midnight kiss with him.", "NTA. It's weird that he thinks you should only kiss him. Kissing anyone in your family on the cheek should be a non issue.", "I wish my younger brother was alive so I could kiss him on the cheek, but I also wish my husband was alive too and he wouldn't care if I kissed my brother bc he knew I loved them both in different ways. They both died too young. Your boyfriend is being ridiculous and petty.", "Kiss your whole damn family if you want. NTA.", "NTA. run. Just a matter of time before he starts trying to isolate you.", "On NYE.. Kiss your brother and then run as far away from your boyfriend as you can. This is abuse waiting to happen. NTA", "Some people use red flags as blindfolds instead of warnings. Don't be that type of person.", "Devil's Advocate here. The tradition I am familiar with is that whoever you are kissing at the stroke of midnight is who you'll be kissing throughout the year. Research says a kiss brings luck and good fortune in love throughout the year.\n\nAsk your boyfriend if he objects to you kissing your brother at all or is he just trying to make sure he kisses you first/at midnight/as the ball drops.", "No way that this ain’t absolute bullshit. You're asking whether you're an asshole for kissing your lil bro on the cheek?\n\nAssuming this story is true, then of course NTA. Your bf sounds like a completely unhinged weirdo.", "Holy shit \n\nYou're boyfriend is that insecure about you kissing *your little brother?*\n\nI'm laughing out loud right now NTA", "That’s bizarrely controlling", "NTA.\n\nYou’re giving your little brother a kiss on the cheek, as has been your family tradition since he was born. It’s not like you’re making out with some other guy. \n\nIt sounds like you’re boyfriend is:\n\nA) Immature and insecure\n\nB) Controlling and possessive\n\nC) Toxic cause he’s jealous of you kissing your BROTHER on the cheek\n\nD) All of the above.", "NTA. Your boyfriend is being an insecure, controlling jerk. This is a red flag. Reconsider your future with him.", "Dump the bf before midnight. He’s bad news and you’ll split anyways from such a bro in time… NTA.", "NTA but your title question is a bit clickbait. We're all jumping here thinking it's *something else*.\n\nTell your BF to get over himself. Or maybe just dump him in NY. That would be unique to him and nobody else. 🥳", "He, not you, is the asshole.  You - NTA. Is he jealous of your little brother?? Sounds a bit creepy to me - AND controlling, possessive.  Will he ALLOW you to kiss your folks, if they are with you? ALLOW, that word, should not even be in this discussion.  Be on the lookout for other red flags.  This is definitely one of them.", "NTA \n\nLOL, your bf is threatened by your brother. WEIRD!\n\nWhat is going on in this subreddit today?!", "NTA, your boyfriend has too many insecurities to be in a healthy relationship.", "nta  Your BF is being childish and demanding.", "Wtf? NTA", "NTA. I often think this subreddit is too quick to call on people to break up with their partners, but this kind of possessive toxicity is definitely a genuine reason to dump him.", "He has some major controlling/insecurity issues if he doesn't want you to kiss a family member on the cheek... NTA, this is very, very strange.", "[removed]", "NTA, dump him quickly before the New Year, you can have a fresh start. This guy is toxic.", "A grown man is jealous you’re giving your sibling a peck on the cheek? lol", "Run, sis 🚩🚩🚩 NTA", "NTA but your BF is insane and if you continue this relationship with him you are going to find yourself in the worst relationship imaginable.", "That is some wierd possesive crap. Nta you cant give you sibling a cheek kiss. Im not sur3 what rwd flag it raises but it sefinately aint right", "You are NTA, but your BF sounds dangerously overcontrolling - and no, I am NOT exaggerating! If he's cursing you out for doing something as innocent as giving a sisterly kiss on the cheek to your brother, he'll be doing much worse before long - quite possibly with his fists or feet. \n\nYou need this man like you need a broken neck! Get out of this relationship ASAP - this guy is seriously bad news.", "Where is red flag guy from TikTok when you need him? \n\nBf is being ridiculous. Be jealous of her kissing her little brothers cheek. That’s a weird thing of which to be upset.", "Speaking from experience, I agree. Sometimes you don’t even see the start of the downward spiral.", "You are so right. Dateline either by murder or suicide. I knew if I had stayed with my ex that I wouldn’t have made it to 80.", "My new favorite thing to do in this sub is to scroll through the comments looking for the normal person who can sus out the bs. Ty for being here.", ">You can still give your brother a cheek kiss after you have the first kiss with your romantic partner.\n\nAm I missing something? Isn't this exactly what she's planning to do, and bf is bent out of shape about it?\n\nFrom the original post:\n\n>Well my boyfriend (20M) asked if we were going to do a New Years kiss and I told him yes but I was also going to give my little brother a kiss on the cheek too", "Life is too short and too irritating to waste it on idiots that have their heads jammed so far up their asses, they can color-coordiate their internal organs for the aesthetic.", "It’s been 6 years since I escaped a controlling abusive partner and I still ask my current partner if it’s okay for me to go somewhere on my own - the movies for example. \n\nHe has to gently remind me that I can do whatever I wish. This damage lasts.", "NTA. Kissing your little bro on the cheek is not just normal, it's also a sweet tradition. Your BF sounds like a possessive jerkbag. Tread carefully with this one, that's a red flag that he might be controlling.", "Why such a condescending response? It IS ridiculous of him to throw a fit over OP giving her little brother a kiss on the cheek. She isn't telling him she's going to go tongue-kiss a bunch of random dudes at the bar. She's upholding an innocent family tradition. There's nothing wrong with that, and it is weird that he would be threatened by it. I'm not sure why you feel the need to make such a patronizing post.", "Preferably first thing in the morning.", "I laughed out loud at this. Yes. He needs to ponder everything about his response to this. Preferably alone on New Year's Eve.", "I don't think he's confusing anything. I think dude has some serious self-esteem issues and he's trying to make OP responsible for covering them up instead of him sorting himself tf out like an intelligent person.", "So he gets first kiss.  Not only kiss.  She is not responsible for living up to some ridiculous vision in his brain.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You sound weird, log off for a while. It’s perfectly normal to kiss your sibling on the cheek.", "Best never go to France 🤣", "Wish I could upvote this comment twice!", "LOL", "calling your girlfriend an asshole for not cutting off family traditions for a petty reason is alarming behaviour", "OP, this, he has control issues for sure! If he feels ok dictating that you break a harmless family tradition for his sake other things will follow and it'll get more and more demanding. I agree, skip his kiss, he doesnt deserve one at this point.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Never heard of this until a year or so ago. But anyway: some siblings age closer than others, cuddle more and even kiss each other on the cheek regularly. If their bond is that strong, then let them be. \n\nJealousy is totally inappropriate here… as far as there is no “history” and so on but assuming that’s not the case here.", "Move on from him…he’s still childish! NTA", "From OP’s title I thought she wanted to kiss a bunch of friend on the mouth and I was like, well I can understand that’s not for everyone… but kissing her little bro on the cheek is a problem now? That’s just weird. NTA", "Here is the answer^^\n\nNTA", "My ex wife got mad that I danced with my mom at a wedding we both went to(not our wedding). She wanted me to only dance with her", "seriously. my little brother and i are very close. we don’t kiss on the cheek, but it wouldn’t be weird if i did. we hug, we call each other every week for hours, we spend as much time together as possible when he’s home, i make him dinner, etc. i would immediately walk away from anyone who had a problem with our relationship. he’s my little buddy, and i love him more than i can express.\n\nin fact, my boyfriend has also gotten quite close with him. they worked together with my bf as his boss for two summers (landscaping) and knowing how important my younger brother is to me, he made the effort to get to know the kid and nowadays likes to join in on our weekly calls. bf loves having him over and just hanging out with him, he knows how happy it makes me to have my brother around and he’s only ever wanted to be friends with him.", "\"Getting a new boyfriend will take me fifteen minutes and a dating app. Getting a new brother is going to put my mom out for nine months, guess which one is easier?\"", "How is it a tile bait", "This this this.  What happens when OP interacts normally with other men who aren't family?  It goes off a cliff REAL fast.", "the bf might turn fully into a pumpkin at midnight. His brains already have.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Oh that’s perfect. Mind if I borrow it?", "Damn, you were just waiting for the perfect AH to use that one, the visual is killing me 😭", "I'm sorry that you dealt with that and are still feeling the effects.  I like to think my brother will date again, one day, but highly doubt it.  He just puts his time into himself and his son, when he is allowed to see him.\n\nI wish you all the best for the future and may it be a bright one. ❤", "“Honey. Honey. It’s ok if you want to [insert thing here]. It’s ok if you don’t. I love you either way and it’s okay no matter what.” \n\nI have nightmares sometimes that I’m still there. I’ve been out of that relationship for a very long time. And then I wake up next to my amazing, patient husband and i remember I’m not.", "Yup.\n\nNYE I kiss my husband first (on the lips of course) Then the rest of the family that's around.", "“His Holiness the Poop” 💩😂🤣 \nFor the fibre, the prune and the holy bean. 😌", "Yeah, 'btw, ditch the BF'... He's an asshole.", "I feel like I correlate your xwife, with the same people, that get jealous at funerals over hugs and such…", "Sounds like she's your ex for a reason", "Well, let him enjoy the next day then but you better move on straight after. \n\nHow did you end up with him in the first place 😳.", "Right?! LoL it was put to good use IMO", "It took me 4 years, a super patient partner, LOTS of therapy, and all the amazing people who supported and helped put me back together along the way for me to finally date seriously again. I would dip out on a relationship at the first sign of a yellow flag for a while. I married the guy, but. He farts sparkly rainbows, literally the perfect partner for me. It happens. Encourage your brother to get therapy and focus on himself and healing. Don't push him to date (not assuming you will just mentioning it because I had a friend who would HARP on me to go find a dad for my 6 year old. They aren't my friend anymore). Let him throw himself into his son, Encourage him to get a custody order with 50/50 physical/legal custody because hes legally entitled to his parenting time. I have been there. I wish you and your brother so much love and healing ❤️", "He will get there one day, but it’s going to have to be the right time, and the right person. It took me many years and meeting the right man (my husband) to feel comfortable and safe in a relationship. After I left my abusive ex, I tried dating before I was truly ready, and I just ended up with guys who treated me poorly (not abusive) but it was definitely toxic. I didn’t realise just how bad it all was until I met my husband and was actually treated with respect. \n\nUnfortunately, people often don’t see the red flags when women exhibit controlling behaviour compared to men. It can take a really long time to see it for what it truly is. My MIL & SIL are both quite controlling, and at one point early in my relationship accused me of controlling my husband because he called his sister out on her disrespectful behaviour. It’s because they just assumed that women should run the house and that it isn’t a form of abuse. They just assumed I told him to call his sister out, rather than him having his own opinion. Even my mum has told me that I should tell my husband he can’t do certain things. For example, he works incredibly hard for our family, whilst also renovating our house. He’s also a super hands on dad. The only thing he truly does for himself is play rugby. It’s a social outlet as well as a good stress reliever. But it does mean he has training & games every week. I want him to do something that makes him happy, and our kids love going to watch him play. But my mum thinks that I shouldn’t ‘let’ him play, and that he should be home more. If a man ever said that about a woman, the red flags would be raised so fucking fast. \n\nHe’s lucky to have family support from you. I didn’t get much when I left my ex, and it still hurts me to this day. You sound like a really great sister. Him & his son are lucky to have a positive female relationship.", "Definately", "Boy, do I know the controlling in laws, I was also 'blamed' for my husband having his own opinions on his family.\nWe're a close knit family, ngl, it was hard witnessing some of the interactions (the odd time she'd slip up) but my brother being him, made excuses thinking staying with her was the best for their son.  Only twice did I witness her behaviour and it was toward my Mum.  Gave her a piece of my mind that day, sadly  my brother paid the price for that.\n\nTime heals all, it may take a while but I have hope. \n\nThank you for saying that, I'm the eldest sibling now so do my best."]}