{"id": 3411, "submission_id": "z6k7qt", "title": "AITA for refusing my mom access to Disney+?", "selftext": "I (26F) changed the password for my Disney+ account and refuse to give it to my mom. I share it with a couple friends and I’m a huge Disney fan. \n\nA few years ago, I was diagnosed with Sensory Processing Disorder. It’s pretty much like it sounds, I have trouble processing sensory information, and get overstimulated to the point I can’t focus on anything for a while. Part of it is when watching a movie or a tv show, I need the subtitles on to help me follow the story and stay in tune to what’s going on. \n\nWhenever my mom watches tv, she says she doesn’t like subtitles on because it distracts her from the show. Granted whenever we are watching tv she is also playing games on her iPad and smoking and talking on the phone. \n\nLately, whenever she wants to watch something on Disney+, she uses my account and either turns off the subtitles herself or asks me to do it if we are  watching something together (which I feel is rude because I literally can’t understand what’s going on without them).  I’ve asked her countless times to put them back on when she’s done, or create her own profile so we can have our preferences set, yet she refuses to do either. \n\nFinally I’ve had enough and changed the password because I get annoyed every time I put on a movie or a show, I have to change the settings again on my own account. I pay for it I shouldn’t keep having to go back redo it. Now she’s throwing a tantrum and saying it’s not a big deal and she wanted to watch the rest of the Santa Clause show. I feel she doesn’t respect me and she doesn’t pay me to use it. AITA?", "created_utc": 1669602364, "permalink": "/r/AmItheAsshole/comments/z6k7qt/aita_for_refusing_my_mom_access_to_disney/", "score": 110, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because it’s petty to revoke all rights to using Disney+ over something as silly as subtitles.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA If you pay the bill and you are there watching the show, you get to make the rules. If she wasn't aggressively against subtitles and it was just a forgetful thing then I would say it's a bit extreme to ban her but the fact she does it when you are present and engaged is disrespectful and sets the tone of what's going on here, to the point I wouldn't be shocked if she just did it out of spite.", "NTA here but you can create multiple profiles on one disney+ account. Just have a Your account and Mum account.", "NTA you have tried to accommodate her. Perhaps if she accepts your previous requests then she could get access again.", "NTA - You asked her for the digital equivalent of putting toys away when done. Or, if you're from the 80s-90s, \"Be kind  Rewind!\" If she can't comply with that small thing  she doesn't get to play.", "NTA.  It’s your account.  She can pay for her own", "NTA\n\nYeah, it’s over something that’s an inconvenience for you (having to turn it back on I mean; not the sensory part), but it’s *your* account and *your* profile.  If she’s going to use *your* stuff, she needs to return it in the condition she got it in, even if it’s not a tangible items.\n\nThere are perfectly reasonable options available to her that don’t screw you over, but she can’t be bothered to even mildly inconvenience herself to respect the wishes of the person paying for her access.  \n\nHer choices are clear: turn the subtitles back on, *make her own profile*, or pay for her own account.", "NTA, your account your rules.", "Nta, if it wasnt a big deal then she could just turn them off and on herself.", "Damn kids have feelings too? Nah parents can steam roll those without consequences!\n\nHuge NTA Idk why people lord parenting as if they have privilege to do anything... But then don't even give an ounce of respect to their grown children.", "NTA.  My son has SPD.  We caught it very young.  I have built my life around his sensory issues.  Noise canceling headphones at daycare, school, backpack, car, home, and aunt's house? Check.  Weighted vest? Check.  Compression undershirts for every day of the week? Check.  Chewy tubes to bite on? Check. Sensory toys? Check.  Calming areas found at every destination? Check.  Heavy work items to push, drag, and pull? Check.  Items at home to bounce, rock, and jump on? Check.\n\nYou are asking you mom to just leave the closed caption on Disney plus and this is a no go?  That is ridiculous.\nIt is literally the very least she can do to help your sensory issues.", "NTA\n\nbut why didn't you just make your own profile and leave the regular one for her to use? or just make one for her? not victim blaming but instead of telling her to do it, you could have done it and this wouldn't be an issue", "Oh god This about all your mom has done for you and you can't be arsed to put on subtitles? YTA. get some real problems and just make her a separate profile ffs", "INFO: Do you pay rent, food and utilities in the home?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (26F) changed the password for my Disney+ account and refuse to give it to my mom. I share it with a couple friends and I’m a huge Disney fan. \n\nA few years ago, I was diagnosed with Sensory Processing Disorder. It’s pretty much like it sounds, I have trouble processing sensory information, and get overstimulated to the point I can’t focus on anything for a while. Part of it is when watching a movie or a tv show, I need the subtitles on to help me follow the story and stay in tune to what’s going on. \n\nWhenever my mom watches tv, she says she doesn’t like subtitles on because it distracts her from the show. Granted whenever we are watching tv she is also playing games on her iPad and smoking and talking on the phone. \n\nLately, whenever she wants to watch something on Disney+, she uses my account and either turns off the subtitles herself or asks me to do it if we are  watching something together (which I feel is rude because I literally can’t understand what’s going on without them).  I’ve asked her countless times to put them back on when she’s done, or create her own profile so we can have our preferences set, yet she refuses to do either. \n\nFinally I’ve had enough and changed the password because I get annoyed every time I put on a movie or a show, I have to change the settings again on my own account. I pay for it I shouldn’t keep having to go back redo it. Now she’s throwing a tantrum and saying it’s not a big deal and she wanted to watch the rest of the Santa Clause show. I feel she doesn’t respect me and she doesn’t pay me to use it. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, if it’s not a big deal then she can eat ha movie with the damn subtitles on. Your account, your rules lol", "NTA If you don't live with her and you pay for your account then you decide how it's used.", "NTA. Your mom needs to grow up.", "NTA \n\nYour account your rules. Giving access to your mum was a courtesy.\n\nIf she wants to watch the show she can sign up for her own account.", "No, she is the asshole", "NTA.", "NTA. Don't annoy someone who's letting you stream their shit for free. Your mom FAFO.", "NTA\nIts a major sorrow in my life you can't watch Netflix or Disney on the TV and have TWO different subtitles going lop", "NTA", "ESH this seems like a pretty avoidable fight. Yes she should be respecting your needs and should be accommodating when you’re watching tv together. But also you could just make yourself another profile and just let her have the profile she is defaulting to. Kicking her off the account seems like you’re committing to be mad rather than finding a solution or having healthy communication. Technically you’re not wrong but neither of you come out of this looking good or doing your relationship any favours.", "I’ve tried that. She still defaults to my account", "Found the mom.", "You clearly don't have any knowledge of what sensory processing disorder is.  A mom who cared would just leave the subtitles alone.\n\nAnd to be honest she has had SPD her whole life.  Her complaints were probably met with with shut up, sit down, stop complaining, just put it on.", "First of all, you have no idea how much or little her mom has done so you have zero reference point there.\n\nSecondly, she could be the best mother in the world, that still doesn’t give her the right to constantly disrespect a simple request. \n\nIf it were a mother complaining about her kid doing the same thing I’d be willing to bet you’d be on the mothers side, you seem like the “parents are always right, kids are always wrong” type.", "Or perhaps you could read where OP said her mom won't use a separate profile?", "I do not live with her. I come over about twice a week, and we alternate who cooks/brings food.", "u/boredofwheelchair has a point my husband and I have separate profiles and I put a pin on mine. It not hard.  Meanwhile it really sounds like you and your mom have \"other\" issues going on and your conflicting TV watching habits are just a symptom of some other toxicity.", "So she can't afford her own account? I guess she'll have to watch freevee.", "What about if you put a pin on your profile?", "You can put a pin on your account to prevent her from having access to it. \n\nUse your computer —->“On the profile selection page, select “Edit Profiles” and choose which profile you'd like to set a pin for. At the bottom of the profile page, find “Profile PIN” under “Parental Controls“. Set a 4-digit PIN. If you want to limit who can use this profile, toggle the option on.”<—-", "so then you just use one of the profiles instead.", "[removed]", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA but the actual TA is Disney for not giving multiple profile options in a single account even if parallel viewing is possible. For fu*ks sake Disney, don't be a money grabber in this atleast", "NTA", "Info: are you using other accounts (e.g Netflix) that she is paying for?"]}