{"id": 34169, "submission_id": "18wmt4a", "title": "AITA for keeping my hairstyle for a friend's wedding", "selftext": "I (30M) am the best man for my friends (30M) wedding in a few months time. I'm looking forward to it, have prepared a speech and am keen to attend even though it is several thousand miles away.\n\nI recently had a haircut in a mullet style and posted this on Instagram. It's something I'd been wanting to do for a while and I'm quite a fan of how it's turned out. The bride (28F) has messaged me saying that I should make sure it's gone for the wedding. No niceties to the message or other context. Just a message out of the blue saying I should not have this haircut at the wedding. \n\nI'm quite a fan of this hairstyle and want to keep it. I'm aware it's her wedding but it's my hair. I'm of the belief that you can't demand how people are to present themselves at a wedding - is she going to ask for headshots of all other guests to check them first?", "created_utc": 1704193035, "permalink": "/r/AmItheAsshole/comments/18wmt4a/aita_for_keeping_my_hairstyle_for_a_friends/", "score": 35, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Would I be the asshole for keeping my hairstyle for an upcoming wedding, even if the bride wants me to change it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but you should talk with your friend instead of confronting the bride. Are you best man chosen for your looks or for a different reason.", "NAH.  You do have a right to your haircut but she also has a right to have her wedding the way she wants it.  You do need to be up front and tell the groom that you don’t plan on cutting it and understand if that means you can’t be in the wedding.  If you don’t do that then you are the asshole.", "NTA if you want an ugly hair cut no one is stopping you - but be prepared to be dropped as best man.  You can demand how people present at a wedding - particularly when those people are in the wedding party - you expect that as the bride you are the only one in a white dress.  You expect people to dress up and not roll up in shorts and flip flops (unless that is the theme of the wedding). Bridesmaids wear what the bride picked out, groomsmen wear the suit they are asked to - it’s all part of the theatre.  \n\nMullets scream “low rent”.  I wouldn’t want that in my photos either.", "Usually in situations like this I’m on the hair side, but a mullet?? Literally nobody on earth looks good with a mullet. The bride is right. Everyone will be looking at your stupid hair and not at her. NAH, just cut it normal before the wedding or wear a wig.", "NAH. It's your right to do what you like with your hair, but as part of the wedding party, you will be in the photos. It isn't unreasonable for her to not want you sporting a mullet for her wedding photos.", "Yta it's not about you.", "Wig or a nice hat dude, compromise without having to cut it off.", "Several thousand miles away and you're expected to change your personal appearance? No thanks. NTA", "NTA, But let her know you won't be cutting hair, a best man is alot different then a normal guest, I think someone should be chosen not based on looks or anything but friendship, but others are different, this might be a deal breaker to them wanting you as best man.", "NTA you could have the worst hair cut ever and still nobody can tell you to change it. unless you buzz slurs into the side of your head i guess. \n\nalso sorry everyone’s hating on ur mullet lol , my mother just got one and it looks beautiful ! don’t let that bother you", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (30M) am the best man for my friends (30M) wedding in a few months time. I'm looking forward to it, have prepared a speech and am keen to attend even though it is several thousand miles away.\n\nI recently had a haircut in a mullet style and posted this on Instagram. It's something I'd been wanting to do for a while and I'm quite a fan of how it's turned out. The bride (28F) has messaged me saying that I should make sure it's gone for the wedding. No niceties to the message or other context. Just a message out of the blue saying I should not have this haircut at the wedding. \n\nI'm quite a fan of this hairstyle and want to keep it. I'm aware it's her wedding but it's my hair. I'm of the belief that you can't demand how people are to present themselves at a wedding - is she going to ask for headshots of all other guests to check them first?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[deleted]", "your haircut doesn't matter as long as it looks well groomed nta", "your haircut doesn't matter as long as it looks well groomed nta", "your haircut doesn't matter as long as it looks well groomed nta", "NTA\n\n&#x200B;\n\nDon't engage, don't answer her directly.\n\nForward her message to the groom, tell him you won't change your hairstyle. Ask him if he wants YOU to tell her, or if he wants to handle it. You are HIS best man, not hers.", "Definitely not looks", "As weird as this sounds, mullets are actually trendy right now. Beats me.", "If people going to a destination wedding find a bad haircut more interesting than the actual bride and groom, that has nothing to do with the haircut.", "Your mother got one? On purpose?", "yes .. to be fair she is a lesbian LOL but like i said, it looks very nice.! don’t be rude", "NTA. Most of the nah or Y-ta comments are entirely because it’s a mullet and no other reason. \n\nI’ve seen countless posts on here about hairstyles and weddings and the usual consensus is that you should never have to change your hair beyond general styling (no cuts, no dyes etc.) for someone’s wedding, and that it’s a ridiculous ask.  \n\nHad you got any other style or colour, it would overwhelmingly be NTA from most commenters. It begs the question as to whether people are only pro-self determination in regards to style as long as they (the commenters) don’t personally think it’s ugly?", "Fellow mullet haver here. There are a lot of Americans on this thread with no concept of fashion and style. NTA, mullets are cool, they've been modernised and had a resurgence since before the pandemic, possibly more common in Europe. Nevertheless, bride needs to back down. Don't cut it, if it was me I'd be super petty and dye it an obnoxious colour... Probably best not to do that", "NTA.  Tell your friend, the groom, that you're not going to cut your hair and if he has a problem with it, that you're fine with stepping down. Why spend all that money for a man who will let someone else run his life?", "NTA\n\nIf you're feeling generous, and you probably should be, you can get some gel and style it, or fold it into a ponytail, plait it, wear a hat, or in some other way make your hair more presentable to the bride.\n\nI don't condone mullets, but will defend your right to keeping yours, if that is what you truly desire. For those who believe a mullet is a step too far, imagine if the bride were *demanding* he have a mullet for the wedding. Then you'll realize hair autonomy is a red line.", "ESH.  \n  \n>Is she going to ask for headshots of all other guests to check them first?  \n  \nYou are not like \"all other guests\".  You are part of the wedding party.  And an elevated part, no less.  \n  \nShe's an asshole for not being nicer about her request--and it IS a request.  (You're welcome to keep it and she's welcome to kick you out of the wedding party for it.)   You're an asshole for thinking they should get no say in how you look on their wedding day.", "Unless your friend is marrying his cousin a mullet is inappropriate for a wedding.", "YTA - a mullet is a very trashy hairstyle to have for a wedding. And really a mullet, no one looks good with a mullet.  You should speak with the groom though as he would have the final say but dont get mad if he asks you step down or change your hair to something more appropriate.", "NAH - you're entitled to have your hair how you want it but the bride and groom are spending a small fortune to make their vision come to life. unfortunately the bride's vision doesn't include photos where the best man has a mullet. if it's important to you to be in the wedding party, then i would recommend cutting the mullet or finding some other compromise (like tie your hair up for photos so you can't see the actual mullet style for example). while i agree she could have either had her fiancé talk to you about it or at least been a bit more civil in her message to you, it is her wedding and being a part of a wedding party always requires you to adhere to dress code and other things. if being in the wedding party doesn't matter to you then just keep the hair do as is but it's pretty known how stressful planning a wedding can be - don't add to the bride's stress (even if it's silly). she wants her photos to have a certain aesthetic i mean, you see how insane people are over their instagrams/social media. think of a social media profile being the rookie leagues and weddings as major leagues. she has a lot of money on the line and wants things how she wants it. either adhere to her wishes or leave the wedding party", "NAH, but mullets aren't a good look man. Just, objectively. Even the people who they say \"oh wow, they're pulling off a mullet\"... they aren't pulling off that mullet. \n\nThis is not the hill to die on, she's gonna be his life going forward and you want her to be on your side and wanting you  around.\n\nIf you cant do it for her, do it to bring your buddy peace on his wedding day.", "NTA. However to be honest, it is a bit short sighted on your part given the well known and negative cultural associations with it and that you knew you were asked to be in a wedding. \n\nI don’t think you have to or should change it just for them, but don’t get mad if you are asked to step aside. If asked, just step aside, show up as a guest, and don’t be a dick at the wedding. You’ve unwittingly put yourself between your friend and his wife. You will lose that fight if you make him choose. Presumably this is friend is someone you see frequently and you don’t need his wife hating you over a hairstyle. You don’t want to throw away a valuable relationship for a haircut you can just always regrow. \n\nTalk to your friend and see what he wants. Let him deal with the bride.", "NTA but she isn't either. I agree a mullet looks really low-class.", "[removed]", "Your hair is your hair, and no one has the right to make any comments, demands or even share their opinions about it.... UNLESS IT'S A MULLET.\n\nThen, an intervention is obviously necessary.\n\nActually, hairstylists should be obligated by law to report mullets to either the nearest healthcare professional or law enforcement agency.\n\nYTA", "Sounds like she has some other reason she doesn't want you there, but is to cowardly to say it.  It's not that extreme of a haircut.  Not like you want to wear a foot tall red mohawk.   NTA", "NTA mullets are in", "This is correct...but also be politely prepared to step down as best man if necessary. Yeah, it's one day, and it's your hair - but it's their day and she/they can have it their way.", "No way. Mullets are glam, and totally in style in the bigger cities.", "No one is going to be concentrating on his hair. Get real.", "This is beyond ridiculous. Brides and grooms don’t get to control other people’s haircuts. The entitlement lol", "People hear \"mullet\" and immediately think of the Joe Dirt style mullet, but there are multiple mullet styles, and not all of them are ugly.", "come join us in 2024 when you’re ready", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "A mullet with the little side shave actually does it for me but I'm pretty sure that's the PTSD talking", "I regret to say I also kind of find them attractive. I need to be put in a facility and reprogrammed"]}