{"id": 34172, "submission_id": "18wkux0", "title": "AITA for refusing to give up a great housing offer that a good friend of mine really wanted?", "selftext": "So one of my friends, \"Audrey\", asked me to live with her and another friend of ours, \"Emma\". The three of us are part of a bigger friendgroup of about 7. I've been looking for a new place but i havent been very vocal about it. The new room is a huge upgrade, I get my own kitchen and it is in the city centre, plus it is very cheap.\n\nAs you can imagine, I was very happy when asked and i immediately said yes and i started making arrangements. When I was asked, Audrey told me that she and Emma had first asked another friend of ours, \"Madeleine\". Madeleine is part of the same group i mentioned earlier, but she was a bit more outspoken than me that she was looking for a new house. So naturally, Emma and Audrey had first asked her. \n\nMadeleine declined the offer, saying she had no money to pay the rent. The rent of this place is relatively low, but still higher than Madeleine was used to, and she is only living on student loans- she doesn’t have a side job so she simply wouldn’t be able to pay. Emma en Audrey had given her time to think about it and tried to make it happen for Madeleine, but to no avail.\n\nMadeleine was really sad about this, because she really wanted to move, but was very clear in her decline. Audrey explained this to me so i would know this whole thing was a bit sensitive for Madeleine, I understood completely. I asked Audrey if she was sure Madeleine didn't want it, and Audrey said no.\n\nSo I started to fix everything that needed to be done before moving there. I asked one of my close friends to take my old room, and he said that he wanted to, so i got very exited with the idea of a friend living in my old house.\n\nThat evening, Madeleine called me. She said that she regretted saying 'no', and that she wished she had thought better about this. After she declined, she said, she changed her mind, and had started thinking she could make some extra money so she could pay the rent and still move there. She did not communicate this with any of us. Madeleine said she was very sad and angry with herself that she had said 'no'. I felt she was jealous at me, because i (as her friend) dó get to live there, with two of our best friends. She said she couldn't really be happy for me.\n\nIt crossed my mind to pull myself back from the offer so Madeleine could still get to move there, but I didn't because I really wanted the new home. Plus, I had already arranged a renter for my old house. She said no, clearly, and i said yes, and i had already started planning everything. It was too late.AITA?", "created_utc": 1704185203, "permalink": "/r/AmItheAsshole/comments/18wkux0/aita_for_refusing_to_give_up_a_great_housing/", "score": 11, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > > Please Provide A Clear Statement Explaining Why You Believe You Might Be The Asshole As A Reply To This Bot.\n> \n> We need to know (1) what action you took that should be judged and (2) why that action might make you the asshole. Your feelings or internal thoughts are not judge-able conflicts. Keep in mind a third party's opinion alone does not qualify. Your conflict must be with the person your actions affected. You will need to explain briefly why someone calling you an ass\n\nI want to be judged based on wether I should have given my friend the room. I might be an AH because she really wanted to move, but i refused to let her take 'my' room.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. She said no, you made an agreement with the other roommates. She doesn’t get to go back in time and undo that.", "NTA\n\nMadeleine had an opportunity and rejected the offer.  If she had changed her mind, she should have contacted Audrey and Emma to see if the spot was still available.mShe shouldn't have tried to guilt you into giving up the room.\n\nAlso, Madeleine still can't afford the rent, she just doesn't want to admit it.", "Major NTA. Madeline sounds annoying. She seriously called to try and guilt trip you?!? Also, as said above, she won’t be able to pay the rent. She’d maybe pay one or two months and then cry and whine to her friends til they chipped in and paid it for her. You’re absolutely right, she’s just jealous.", "NTA. You did nothing wrong. Sounds like she had plenty of time to change her mind and only changed it once she saw someone else benefitting. Try not to worry about it. She doesn’t need to be happy for you. This is a her problem.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo one of my friends, \"Audrey\", asked me to live with her and another friend of ours, \"Emma\". The three of us are part of a bigger friendgroup of about 7. I've been looking for a new place but i havent been very vocal about it. The new room is a huge upgrade, I get my own kitchen and it is in the city centre, plus it is very cheap.  \nAs you can imagine, i was very happy when asked and i immediately said yes and i started making arrangements. When i was asked, Audrey told me that she and Emma had first asked another friend of ours, \"Madeleine\". Madeleine is part of the same group i mentioned earlier, but she was a bit more outspoken than me that she was looking for a new house. So naturally, Emma and Audrey had first asked her. Madeleine declined the offer, saying she had no money to pay the rent. The rent of this place is relatively low, but still higher than Madeleine was used to, and she is only living on student loans- she doesn’t have a side job so she simply wouldn’t be able to pay. Emma en Audrey had given her time to think about it and tried to make it happen for Madeleine, but to no avail.   \nMadeleine was really sad about this, because she really wanted to move, but was very clear in her decline. Audrey explained this to me so i would know this whole thing was a bit sensitive for Madeleine, I understood completely. I asked Audrey if she was sure Madeleine didn't want it, and Audrey said no.   \nSo I started to fix everything that needed to be done before moving there. I asked one of my close friends to take my old room, and he said that he wanted to, so i got very exited with the idea of a friend living in my old house.  \nThat evening, Madeleine called me. She said that she regretted saying 'no', and that she wished she had thought better about this. After she declined, she said, she changed her mind, and had started thinking she could make some extra money so she could pay the rent and still move there. She did not communicate this with any of us. Madeleine said she was very sad and angry with herself that she had said 'no'. I felt she was jealous at me, because i (as her friend) dó get to live there, with two of our best friends. She said she couldn't really be happy for me.   \nIt crossed my mind to pull myself back from the offer so Madeleine could still get to move there, but I didn't because I really wanted the new home. Plus, I had already arranged a renter for my old house. She said no, clearly, and i said yes, and i had already started planning everything. It was too late.  \nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Madeleine said no. You said yes. Absolutely don't give up the room.", "You're NTA. Madeleine had plenty of time to find a part time job to earn enough money to pay for the room. She didn't want it badly enough to do that until you planned to move into it."]}