{"id": 34214, "submission_id": "18x3yqz", "title": "WIBTA for banning my MIL from seeing my baby?", "selftext": "Me (F28) and my husband (M30) just had our first living baby (7 weeks old), after several miscarriages.\n\nWe’re staying with my parents for a few months whilst we have our house renovated. My parents both work full-time so my MIL came to stay for the first couple of weeks to support us. I spent 4 nights in hospital, so having the help seemed a good idea. She enabled us to get more sleep, and helped us with feeds/changes whilst I figured out household stuff. After 4 days of this, I realised it wasn’t the help I wanted. I wanted to be with my baby doing nappies/feeds, and have some alone time with him. I needed MIL to do the dishwasher, cooking, boring stuff. I tried to approach this diplomatically, e.g. asking her to do a change at 7AM and then put him to sleep back in our bedroom so that we’d wake up when he next cried and start our day as a family. Several times my husband and I woke up at midday with no baby in the room, and she told us it’s because he wouldn’t “settle” and we needed the sleep. This got gradually got worse, with her ignoring direct instructions from us (I.e. don’t feed the baby from a bottle), and so we decided to implement some boundaries. \n\nWe went out for the afternoon just the 3 of us (me, him, baby) and when we came back she was visibility upset and sulky with us. So then when we went out again we felt guilted into bringing her along. \n\nWhen she finally left, I felt she’d completely pushed me to the side and taken away my opportunity to bond - which was especially devestating after our losses. We decided to give it some time before seeing her again. My husband and I agreed to cancel future “help” but didn’t want to ruin Christmas so waited until after to tell her. His whole family came for Christmas and due to our worries about germs we implemented a no-one holds the baby rule (except us). She spent the whole day sulking and ignoring my family, which resulted in my Granny (F84) leaving after 1hr because she thought she’d offended her and didn’t want to spoil the day. \n\nShe then text my husband after, saying she was heartbroken seeing the baby and not being able to hold him. He then told her future visits were cancelled as we want to parent solo and bond as a family, but offered meeting for walks halfway. She declined, saying it was too painful to see and not hold the baby, as she had spent a magical time with him and missed him so much.\n\nI feel really sad for my husband as his mum is now isolating herself from my family. I’ve tried to be diplomatic and not create drama. But she’s been a huge distraction from our first 7 weeks of parenthood and I am desperate to phone her up and say that she’s ruined my experience of being a mum, been horrible to my family and owes them an apology, and I don’t want her seeing the baby anymore. WIBTA? How can I handle this better? It’s important to my husband that our baby has a relationship with his mum so don’t want to burn bridges.\n\nEDIT: just answering a few questions that have been coming up.\n\n1. The ban is until she apologises to us/my family and stops sulking. This would (hopefully) only be like a month? Not a permanent ban.\n\n2. Baby is premature and spent the days leading up to Christmas in hospital as he was sick. This is why we implemented the ban then, as we were super worried about having so many people from around the country in the house. We didn’t start the rule as soon as he was born, although we didn’t allow visitors in hospital and it was only my parents and MIL who held baby in those first few weeks. This ban includes my parents - they’ve not held baby since he came back from hospital (although it does feel extreme as they haven’t left the house much, but it’s easier to apply the same rules for everyone to - lol - avoid conflict).\n\n3. I know lots of people are saying that I have plenty of time to bond with my baby, and I absolutely know that and can’t wait for our future together. But I’ve lost a lot of babies before this, including one very late in pregnancy. I’ve dreamt about these first few weeks with a living baby for years. It may seem dramatic, but I truly never dared let myself believe I’d bring a living baby home from hospital, and I’m devastated I didn’t advocate for myself for in those first 2 weeks so I could spend every second with him. I’m not exaggerating when I say that MIL spent more time with baby that me - I felt like all I did was feed (whilst being watched / criticised by her - super invasive) and then got baby confiscated to be burped and cuddled by someone else. It was heartbreaking.", "created_utc": 1704238356, "permalink": "/r/AmItheAsshole/comments/18x3yqz/wibta_for_banning_my_mil_from_seeing_my_baby/", "score": 248, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I want to ban my MIL from seeing my baby\n2. My husband wants our baby to have a good relationship with her and avoid a big family fall out\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, you absolutely deserve the experience and she should’ve been doing the non-baby related chores around the house. It’s also super unfair to your family and the rest of hubbys family if there’s a no touch rule and your MIL is touching the baby. I think you made the right call with that. Just stick with your boundaries, don’t say anything to her about it. Wish you the best of luck, congratulations on your baby!", "NTA it's your child and you're allowed to set boundaries buuut you keep saying she 'ruined your experience of being a mum' and she took away your bond with the baby which is quite dramatic and I think you're seriously doing *yourself* a disservice by having this mindset. You're so hung up on the idea that it's all been ruined for you that it's going to *actually* ruin it if you continue to think that. You're only ever going to look back at this time as what you think you lost and not enjoy it as your baby's first weeks. Take the time now, the baby's 7 weeks old, he's still young and you have so so much time left with him, your MIL might've \"stolen\" some time from you but she didn't steal your chance to bond with the baby. Maybe if you accept that then you'll be able to look at the situation with your MIL differently. She's still being annoying and not accepting your boundaries, and she absolutely needs to, but maybe there's some leeway here.", "NTA. But I don't think it's necessary to ban her completely. \n\nIt's absolutely fine to not want the help she's giving. There's *no way* I would think helping new parents means hogging the baby and making them do all the household labour. And I wouldn't be putting up with a grown adult throwing a tantrum and driving family away because they think they're special and exempt from the rules.\n\nThat being said, she thought she was helping. When she ignored you, you rightfully established boundaries. Supervised visits on *your* schedule is the answer here. Leave her in time out for a while. Then make it clear that the ban will resume if she won't respect your parenting.", "NTA - you’re not an AH for this. Its your baby and she clearly was way too hands on and not a help. \n\nBut I dont think “banning” her works. Because that really will cause a big falling out. And whats your end game? Ban her until when? \n\nYa’ll need to communicate about this and come to an understanding", "NTA. your MIL is acting like a narcissist. you are the primary caregiver, so this is the only bond that matters in these early stages. once you realized this, you and your husband both communicated what you needed multiple times and she did not listen. she needs to back off and you should do your best not to feel any guilt about it because it is what's best for your baby. you don't need to call her to tell her she ruined things, but if she keeps guilt tripping you and your husband, continue to repeat your boundaries and ignore further guilt tripping. if she declines your offers, that is on her.", "I'm not going to come in with judgement here because this is too sensitive to call anyone out.\n\nI'm the mama to number 6 who is my first living baby for context. Doesn't mean I know you're thoughts or feelings, but also gives some idea of how it's different from the usual.\n\nI think emotions are heightened from all sides but I sympathise with MIL. You're with your family, she's allowed to be there. \n\nYou have admitted she's a huge help and you're able to sleep more than usual. \n\nWhen family comes by, you refuse to let her hold the baby she's helped with due to germs. She's already done that when it suited you and now you're taking it away. \n\nAgain, won't judge but even if she's the worst, your actions aren't kind to her. \n\nI really needed the perinatal services to make me see similar things. You may be alright, but if you have any doubts, reach out.", "You are doing great! This is not a you issue. You have done absolutely nothing wrong. Your MIL is behaving appallingly and seems to forget whose baby your child is. If she’s being horrible to your family, stop inviting her to things full stop. The consequence is no one’s fault but her own. Once you start enforcing boundaries maybe she will calm down, but remember you don’t owe her a relationship is she can’t follow basic instructions without trying to emotionally manipulate you.\n\nCongrats of your baby! NTA", "You would not BTA. \n\nShe is not respecting your boundaries and trying to guilt trip you into getting her way. You are doing nothing wrong and her feelings are hers alone to deal with. This is your special time and your journey. \n\nAlso, kudos to your husband for supporting you and handling his mother.", "NTA. your baby, your rules, and she clearly doesn't respect your wishes. feeding him from a bottle secretly?????? NO NO NO, get that lady out your house.", "NTA\n\nYou and your husband lost your newborn bonding time. I am actually shocked that you don’t have PPD.", "I can’t pass a judgment on this but I think you need to take a step back and try to be objective. Your MIL was just trying to help. Most new parents would give anything for that kind of assistance. It wasn’t working for you, but that doesn’t mean you should cancel future visits. If you’re struggling to bond with the baby, that’s not her fault. It’s not yours either. Motherhood is a journey. You have to be patient with the process. I can see some clear incidents where she overstepped, but none of them warrant depriving your child of a relationship with his grandmother.", "YTA. Sorry, but it's up to you to set rules and see that they're followed (or set consequences if they're not). Your \"experience of being a mum\" is on-going - try to focus on all the wonderful parts and stop worrying about this. \n\nThere is zero reason to phone up your MIL and lay into her (unless you DO want to burn bridges)! Your husband has already explained the new rules to her.", "YTA, nothing more to say.", "YWBTA. \n\nYou are going through a lot right now- hormones all over the place plus MIL trampling all over you and sulking. \n\nIt sounds though like your husband has your back and has stood by your side in making decisions regarding your baby. Let him continue to handle his own mom because, honestly, all that a phone call will do is give you a temporary sense of satisfaction. Focus on moving forward- I promise you that your bonding chances with baby are still there, especially now that you’ve taken a step back from her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMe (F28) and my husband (M30) just had our first living baby (7 weeks old), after several miscarriages.\n\nWe’re staying with my parents for a few months whilst we have our house renovated. My parents both work full-time so my MIL came to stay for the first couple of weeks to support us. I spent 4 nights in hospital, so having the help seemed a good idea. She enabled us to get more sleep, and helped us with feeds/changes whilst I figured out household stuff. After 4 days of this, I realised it wasn’t the help I wanted. I wanted to be with my baby doing nappies/feeds, and have some alone time with him. I needed MIL to do the dishwasher, cooking, boring stuff. I tried to approach this diplomatically, e.g. asking her to do a change at 7AM and then put him to sleep back in our bedroom so that we’d wake up when he next cried and start our day as a family. Several times my husband and I woke up at midday with no baby in the room, and she told us it’s because he wouldn’t “settle” and we needed the sleep. This got gradually got worse, with her ignoring direct instructions from us (I.e. don’t feed the baby from a bottle), and so we decided to implement some boundaries. \n\nWe went out for the afternoon just the 3 of us (me, him, baby) and when we came back she was visibility upset and sulky with us. So then when we went out again we felt guilted into bringing her along. \n\nWhen she finally left, I felt she’d completely pushed me to the side and taken away my opportunity to bond - which was especially devestating after our losses. We decided to give it some time before seeing her again. My husband and I agreed to cancel future “help” but didn’t want to ruin Christmas so waited until after to tell her. His whole family came for Christmas and due to our worries about germs we implemented a no-one holds the baby rule (except us). She spent the whole day sulking and ignoring my family, which resulted in my Granny (F84) leaving after 1hr because she thought she’d offended her and didn’t want to spoil the day. \n\nShe then text my husband after, saying she was heartbroken seeing the baby and not being able to hold him. He then told her future visits were cancelled as we want to parent solo and bond as a family, but offered meeting for walks halfway. She declined, saying it was too painful to see and not hold the baby, as she had spent a magical time with him and missed him so much.\n\nI feel really sad for my husband as his mum is now isolating herself from my family. I’ve tried to be diplomatic and not create drama. But she’s been a huge distraction from our first 7 weeks of parenthood and I am desperate to phone her up and say that she’s ruined my experience of being a mum, been horrible to my family and owes them an apology, and I don’t want her seeing the baby anymore. WIBTA? How can I handle this better? It’s important to my husband that our baby has a relationship with his mum so don’t want to burn bridges.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You don't have to do anything differently or worry about her at all. If she wants to pout and sulk and distance herself...wow, how quiet it will be :D   \n  I would be cheerful and pretend none of this ever happened. Offer what you want to offer as far as time and baby visiting and then the ball is in her court. If she'd rather have no time than what time you offer, that is on her. If she complains, I would Pollyanna the shit outta her and say that you know she wants what is best for her grandbaby and that is lots of time with her parents as you all adjust to being a new adorable family of 3. Your family will get over her tantrums, your motherhood experience is NOT ruined, and it is fine if she sees the baby, when and how you want because you are the mama.", "NTA this is your child not hers and she isn't respecting your boundaries, even going as far as to emotionally manipulate you. Life isn't a all or nothing, and she needs to understand that she can't replace you. I say call her bluff. If she wants nothing to do with your child because she isn't allowed to cross boundaries then fine, let her do her all or nothing. If she wants to act like an adult and meet half way wirh the options you've given her then great but she HAS to respect your boundaries and do not allow her to cross them.", "Agreed!  You have decades ahead of you, with this child.  Lots of firsts, lots and lots.\n\nShe didn’t “ruin your experience of being a mum” - unless you choose to frame it in that light and dwell on that, like a sore that you can’t stop picking at.\n\nYou’ve established your boundaries, and your husband is backing you 100%.  This is the first fruits of being a mum.  Relish it, and don’t look back.\n\nNTA.", "Exactly this!  Humans aren’t ducklings, bonds are formed over an extended period. The only way she can ruin your bonding experience if you give her the mental real estate to do so. Just focus on the things that you are loving doing with baby and don’t give her previous actions another thought. \n\nPro tip, however: Over the next 18 years or so you will need to get good at accepting situations as they are, not as how you thought they would be, or you will drive yourself (and hubby and child) bonkers.", "This!  Look, I was adopted.  My mom didn't get to hold me until I was nearly a year old, but I still bonded with her.  So focus on that *now*, at 7 weeks.  Don't let the resentment take up space in your head - it will be bad for you and for your family.", "I agree it’s too harsh - I’m just not sure what else to say. My family are all upset by her ignoring them all on Christmas (literally, looking away when spoken to, and got in the car without saying goodbye to anyone except my husband). Especially after they went to a lot of effort to cook & host, and she turned up empty handed. We don’t want her in the house a) to protect my family - who are all mad at her, b) to protect me from the baby hogging and c) to protect our baby, as she socialises A LOT and goes to loads of places where she could catch a bug. Baby spent 23&24 Dec in hospital hence the germ rule. He was also premature so more vulnerable. The germ rule was communicated in advance and applies to everyone, including my whole family. His family was 6 people, so it was a large xmas gathering. \n\nThe reason I want to talk to her is because I don’t think she gets why she’s in a time out and thinks we’re just being mean. Like you said, she thought she was helpful, but since she left I finally feel able to breathe and spend time with my baby without him being whisked out of my arms. It’s such a relief.", "No way she thought she was helping— Having a brand new mother do the house work, while Grandma spends the day bonding with the baby?", "You make an excellent point!\n\nThe \"ban\" is a knee-jerk reaction that really doesn't solve anything.", "Yes, I agree. I'm the mom to two and I don't want to invalidate OPs feelings, and it is a sensitive area, but the post partum time, especially with the first baby are absolutely brutal emotionally.   \nI also felt highly protective of my baby and frustrated with anyone who entered the bubble. It sounds like the MIL is a person who wants to be helpful, is excited about the baby and is trying to respect boundaries in an emotionally heightened time.  \nI think it is fine to bond as an immediate family, but cutting MIL out more does not seem warranted. I'd rather say something like \"MIL we love you and are so thankful for the help you have provided and how excited you are to participate in the life of Baby. We underestimated the emotional toll of postpartum and feel like we want to just nest as a small family for a little while as the dust settles. We are sorry if we have not communicated this gracefully. We want you to be a part of babys life - please give us some grace as we work through this as a small family\"", "But she isn’t respecting the new rules. When you set boundaries and someone breaks through them, it’s okay to say you need a break.", "I kinda agree, and I have a 14 month old….it is up to you and your husband to determine what type of help you want after a baby. People come to help and you give them a list of things that would be useful.", "But it sounds like you already have talked to her - she just chose not to hear what you were saying. Given that, I think maybe it's time for the three of you (hub, mil, & you) to spend a therapy session or two on this issue, with a therapist who's well versed in family issues and people who refuse to hear what's being said. \n\nI don't think that you & husband telling her is going to get through, but her having to listen and maybe re-state what you've said with a therapist present might work. \n\nI mean, if you feel you haven't explained it fully, sure, try again - but thousands of Internet strangers understood exactly what the problem is just from this post, so I don't think the problem is you not being clear about things. It's that she isn't interested in listening to what you have to say, and that's going to keep being a problem unless and until it's addressed (and quite possibly for a long time thereafter).", "Totally agree. Plus, OP is staying with her family, MIL probably is trying to be supportive. The feeding thing even could be attempt at kindness to let new parents sleep. I think MIL is trying to help, OP is used to how their parents do this and is not appreciating the help right now. \nNot the time to burn bridges, this is the time for the parents to survive and so many of us regret the things they've not appreciated at the time.\n\nMy daughter is 4 1/2 now and I regret not taking up every babysitting offer to just sleep. Even now!", "Feeding an infant a bottle when the mom is attempting to breastfeed is a huge no-no as it can create nipple confusion.I’ll is expectorated from bottles much easier/faster than from a nipple which is why babies that are given bottles along with breastfeeding too early will often go on to reject the nipple. It happened with our premie and was devastating for me, and also a huge pain as I then needed to pump and feed for almost a year which is way more tiring than breastfeeding", "NTA  While yes, MIL came to help, she way over-stepped the boundries, by giving the baby a bottle after you explicitly told her not. She was trying to usurp your place as mom by her continuing to disregard your wishes.", ">**She enabled us to get more sleep, and helped us with feeds/changes** whilst I figured out household stuff. After 4 days of this, I realised it wasn’t the help I wanted. **I wanted to be with my baby doing nappies/feeds, and have some alone time with him**. I needed MIL to do the dishwasher, cooking, boring stuff. I tried to approach this diplomatically, e.g. **asking her to do a change at 7AM and then put him to sleep back in our bedroom so that we’d wake up when he next cried and start our day as a family. Several times my husband and I woke up at midday with no baby in the room**, and she told us it’s because he wouldn’t “settle” and we needed the sleep. This got gradually got worse, with her ignoring direct instructions from us (**I.e. don’t feed the baby from a bottle**), and so we decided to implement some boundaries.\n\nOK, correct me if I'm wrong here but she has the newborn all night and you want her to then put him to sleep in your room at 7am so you can all wake up to start your day together the next time he cries? Why are you not starting your day with him at 7am after being away from him all night?\n\n Then you want to be with your baby doing the feeds but are sleeping until midday after not having him all night or even waking for him when he is put in your room at 7am and THEN you don't want this baby fed from a bottle? How on earth is he supposed to be fed and when are you actually caring for him?\n\nAs the parent you have every right to set the boundaries but the baby needs to be cared for and to establish breastfeeding he should be at the breast every 2 to 3 hours for as long as needed/wanted by the baby.\n\nI've either read this wrong or this is a shit post. Apologies if I've misunderstood.", "Nta for wanting to be a parent.  \n\nSo she's throwing a sulking tanty?  Boooooo.\n\nYour preemie baby is not her stuffie.", "OK, she crossed the line and stomped boundaries, and I absolutely agree with the steps being taken in reaction to that. \n\nBut please remind yourself that you’re not responsible for the feelings and actions of others. \n\nJust let it be now. Focus on your baby and let everything else fall away, deal with what comes as it happens but be confident in knowing that you’re extremely lucky your husband is taking any action at all and has your back in this. \n\nShe doesn’t matter right now so focus on what does. \n\nNTA.\n\n(And congratulations 😊)", "I’ve had several miscarriages and a stillbirth, and have yet to bring a rainbow baby home. I can COMPLETELY understand wanting allll the time early on especially. What’s the hard part (I have one living child), is other people’s obsession with babies, especially grandparents. \n\nThis phase is SHORT and not meant to be worrying about her and how she feels. It’s your time as a family to enjoy and sometimes struggle through and have memories to look back on. Let your husband set boundaries and later on you can address loosening them up. You aren’t bad for wanting this time and she’s not bad for wanting to be involved- she just needs to learn her place.\n\nNTA", "I am a 3 time NICU mama.  My youngest was born at 30 weeks in December so I get the extra anxiety of having an infant at the germiest time of the year.  \n\nBUT…..you want to use your MIL like an employee.  She’s a grandma.  Telling her she can’t hold the baby at Christmas when you had her in your home for the baby’s first weeks so you could sleep?  That’s messed up.  \n\nShe didn’t ruin your first 7 weeks with your baby.  She helped you.  Your expectations were different than what happened, but nothing was ruined.  \n\nWhat good would banning her do?  Especially when you need her in the future, because it’s going to happen.", "NTA.  I go to visit my son and his wife when they have a new baby.  I go for the specific purpose of taking on the household chores - cooking, cleaning, shopping and laundry - and if they want me to hold the baby, that's wonderful.  My job is to free up their energy so they can take care of the baby.  I can clean bathrooms, I can't nurse a baby.  I have to say, when I ask my DIL if I can visit, she says, \"You can come whenever you want and stay as long as you want.\"  You need to be more specific with your MIL about what would be helpful.", "I’m leaving towards Y T A big time but I’m reading the comments and maybe I’m missing something?  So MIL offers to help and you agree.  Then you realize that you want a different type of help, you want her to be your maid.  You don’t actually want her to be involved with the new baby at all.  Then you throw out a line about being concerned about germs but if that was really the case why would you invite people over to your house?  It seems to me like this poor woman feels used and that you’re being very overbearing and not letting her near the child at all.  She’s just trying to be helpful and wants to spend time with her new grandchild and it seems like you’re pushing her aside because you changed your mind on what you wanted… several times.  Could somebody please fill me in on if I’m missing something here?", "*<She declined, saying it was too painful to see and not hold the baby,* ***as she had spent a magical time with him*** *and missed him so much.>*\n\nThat was YOUR magical time which she TOOK from you.\n\nNTA", "YTA, you said it yourself, you were sleep deprived after being with the baby all night. You handle the first few weeks the best you could and she helped as best she knew. You BLAMING and wanting to cal her to complain makes you an AH. Having help is a blessing, babies get hurt all the time while in care of sleep deprived parents. She fed him a bottle while you slept and make it sound like she is a monster that is withholding your baby from you. \n\nYou have plenty of time to bond with the baby, and now that you are withholding help, many opportunities to be bonding with your child in a zombie state.\n\nYou sound like the type to appreciate the help when exhausted only to berate the people helping you when you feel better.", "NTA. Early postpartum time is so important for parent/child bonding. It sounds like you and your husband need to set clear boundaries with MIL that align with what you are comfortable with. She can take them or leave them. If she sulks, ignore her. She’s throwing a tantrum not getting her way and you have an actual baby that needs you.", "You would be the asshole if you called her up and demanded an apology for preventing you from having the early day bonding you imagined yourself having if she were not in the picture. That's not a clearheaded response to the situation and an apology won't fix your feelings of regret or anger. You have a clearer understanding of what you need now and it is not her help. Focus on your baby and making your situation as supportive as it can be. Ignore your MIL's immature nonsense because her feelings on this truly do not matter. If her sulking is going to affect family functions explain to others that she's acting out because you set boundaries around her access to the baby. Let her make a fool out of herself is she wants.", "NTA.\n\nYour baby; your rules.\n\nBut it needs to come from your husband, not you. You deal with your family and let him deal with his family", "NTA. Your mil does not deserve another thought from you. SHE came to your parents home, and disrespected your instructions. SHE came to your parents home at Christmas, empty handed. SHE made everything about HER. SHE drove your grandmother out of the house. SHE is pouting to get her way. SHE is the one causing problems. \n\nLeave that woman in time out until she apologizes to each and every member of your family, including your grandmother. \n\nLeave her in time out until she can be trusted to respect boundaries and instructions. \n\nOnce you think she can behave, only visit in a public place, so you can leave if she misbehaves. If she can handle being in public, then you can visit at her house. Once again, so you can leave. \n\nEvery time she crosses the line, back in time out. Minimum of 1 month each time. If she misses holidays with you guys, it's her own fault.\n\nGood Luck.", "NTA\n\nMIL did not “help”, she did whatever the hell she wanted to with your baby under the guise of help. \n\nReal help would have been doing what you needed quietly in the background.\n\nShe put her needs ahead of everyone’s, including the baby when she didn’t follow instructions.", "MIL needs to get a life of her own. She is the grandmother, not the mother. Being allowed to do grandmother things is a privilege  not a right.\n\nShe should have been helping you by doing housework, cooking meals, and saying '\"just tell me if you want me to change nappies or do anything else for/with the baby. By the way, I would love some cuddle time, but only when/for as long as you, the parents, are comfortable with.\"\n\nShe needs to stop sulking  apologise sincerely, promise not to do the things you asked her not to do and stick to that promise. Then, and only then, would I consider letting her back.\n\nI say this as a woman with seven grandchildren. \n\nYou are definitely NTA, OP but MIL needs to grow up and learn to behave.\n\nCongratulations on your little one and I wish you  your husband and baby a happy and healthy new year.", "NTA\n\nMy SIL is due any day now and I’ve been telling her for months that I’m going to come help as soon as she feels comfortable. My help will consist of doing dishes, laundry, sweeping/vacuuming, cleaning the bathroom, getting her snacks and drinks, cooking, scooping the litter box, and food shopping. If I’m lucky, I’ll get to keep an eye on the bebè while she grabs a shower or nap.\n\nThis is her time to bond with my niece and I’m going to do everything I can to make it easier for her to do just that. She knows she can ask me anything, from breastfeeding to post-partum p**ping, as I’ve got two of my own and have seen it all. I’m going to be the help I wish I’d had when I was going through this stage.", "I’m gonna get downvoted for this, but ESH. \n\nYou asked for her help. She has done this before, and truly thinks she’s helping. While she should listen to your instructions, she also wants you and your husband to rest. Don’t ask for help if you don’t actually want it.", "NTA, the time with a newborn is bonding time, your MIL didn't just make it harder for you and hubby to bond, she bonded to the baby, which now is messing her up emotionally. I'd feel sorry for her but it is kinda her fault.", "NTA\n\nMIL is ignoring the specific requests for the type of help you're asking for.\n\nPlus she needs to observe the boundaries you set with YOUR baby.\n\nHopefully the ban doesn't need to be permanent in that MIL will realise she needs to be understanding/gentle with you because of your process re your prior experiences.\n\nMany Congratulations, the more so in light of your prior losses.", "Your post is very thoughtful and you acted exactly right. Good that your husband has your back! MIL is consistently overstepping, wasn’t the help that could be expected - and is now sulking having been called out. \n\nNTA. \n\nObviously, the first days, weeks and months are when mother s and fathers bond with the baby. So enjoy the quality time now, the three of you.", "NTA\n\nSet the boundaries. She's already proved that she'll trample all over you unless you set and enforce them.", "NTA but I don't think having that convo with her will do any good. She sounds like my MIL—she wants to be the victim/center of attention, so she will just continue to harbor her self-pity until she's satisfied. For me and my husband, setting and sticking to a boundary has been the only way to let her know we aren't interested in this emotional game. Your MIL made conscious decisions to go against your wishes and prioritize her own time with your baby rather than help you in a way that wasn't serving her—you want to spell it out for her, but she already knows what she did. She'll face it (or not) in her own time. Maybe view it less as a ban and more on you and your husband shifting your focus from MIL's wants and need to your own and your new baby's? At some point either she'll want back in enough to make a peace offering or you'll move past what happened and can make a plan with your husband on how to move forward. Until that time just focus inward and enjoy your time with your little one!", "NTA\n\nIt sounds like you and your husband are on the same page. \n\nLet him deal with her. \n\nSet boundaries. \n\nEnjoy your baby", "I genuinely wish you the best, and because of that I have to say ESH/ her for not respecting your requests and sulking, and you for your victim mentality. If you want to move forward more skillfully, I’d advise:\n\n1. Reading up on what a boundary really is, how to set one, and how to hold one. This will benefit all aspects of your life!\n\n2. Taking ownership of your actions and autonomy. It sounds like you didn’t advocate for yourself and allowed for a situation that didn’t work for you, and you feel regretful about that. That’s rough, and I’m sorry you’re dealing with the aftermath of that. But you need to own that nobody “stole” your bonding time or “ruined your experience” — you’re choosing those narratives for yourself because you don’t like what’s happened. It’s a common coping mechanism, but if you can’t realize it’s happening, you’ll continuously resent her for something that she didn’t actually do, AND you’ll miss your chance to learn from this.\n\n3. Seeing a therapist and letting some time pass before enacting any “bans” or new boundaries. It sounds like you’re not totally clear on what you need/want, which is fine! So take a step back, go low contact for a week or two, talk to a professional about your feelings, and then make decisions from there. This is for your sake, not hers — it’s a way for you to get the bonding/family time you’ve been craving and get the perspective you need about who’s actually calling the shots here (it’s you!) so you can move forward in your relationship with her from a place of grounded-ness.", "I wouldn't implement a ban I would just stay at home and say you and the baby are recovering. No need to give rules that will upset people then.", "NTA! I would be extremely angry and disappointed if someone did that to me. I give every new parent only two unsolicited advices: 1) Parents need bonding with the baby, everyone else can wait, so whoever wants to help is to take care of mom, so mom can heal and take care of baby; and 2) A relationship with the baby is not a right, it's a privilege, no one has any claiming for the baby and only the parents can dictate what kind of relationship anyone else will have with the baby..\n\nShe stole you the first 7 weeks of bounding with your little baby, it's horrible and you should take some distance if you need, but please, don't let what happened use so much space in your mind that you don't enjoy the rest of your time with your little boy. He's there with you NOW, you are taking care of him now and that is the important part. Instead of resenting those last weeks, just hug your baby tighter now and get all the awesome newborn cuddles. I'm sending all the positive energy and luck in the world for you and your new family 💙", "Your baby, your rules.", "Your baby, your decision.  End of story. You want and deserve \"magical time\" with your son too, on your own terms. Don't feel guilty for that.  Hugs!\n\nNTA", "BTA (slightly)\n\nI think by talking it out openly (not emotionally heated), things could get resolved. But it is really important for the child to have good familiar relationships, as I saw from others...\nJmho", "> as she had spent a magical time with him and missed him so much.\n\nYour husband should have said, \"Exactly what the problem is.\"", "NTA at all.\n\nWhat a lot of grandparents refuse to accept is that when parents ask for help after a baby is born, it isn’t to help with necessarily caring for the baby vs helping maintain the household. It is SO IMPORTANT to be able to do that bonding that you’re speaking of in the beginning, especially so since you have a preemie — lots of skin to skin in the newborn days helps the baby regulate their little bodies, calm them, and helps your production as well. \n\nI’m so sorry that she tainted the newborn experience for you and I’m glad you’re setting boundaries to enjoy your time together. Please don’t let her pressure/guilt you — this is YOUR special time with your rainbow baby!!!\n\nCongratulations on your special little boy! I hope you are recovering well and get lots of snuggles with your little guy. As I type this, I’m snuggling my almost 6 week old rainbow baby. ❤️", "Oh, honey. Are you *and your husband* talking to your doctors about post-partum depression? Even MORE common after prematurity and NICU stays. \n\nYour MIL sucks and you are NTA -- but your fears about not bonding with the baby are very much colored by the storms of hormones you're having right now and by the trauma you *and your husband* went through with a premature birth and with baby in the hospital.\n\nYou would not be the asshole but don't even WORRY about your MIL and her childish sulking right now -- worry about ensuring you and your husband are getting enough psychological support, so that you feel confident in your bond with your baby and so that you both have real trained professionals to talk about your stress and anger with.\n\nYour baby, you, and your husband are the first three priorities here. Your MIL comes so far down the list she's after \"361: Remembering to cancel our trial of HBO after binging Succession.\" (362: MIL. 363: MIL's feefees.)", "NTA.  This isn’t the first time I’ve seen a post where either the mother or MIL wanted to stay the first couple of weeks to “help” where they ended up just trying to take care of the baby & leave the dishes, laundry, etc to the new mom.  There was one on here a few months back where the MIL wouldn’t even hand the baby back to the mother to breastfeed because the mother “didn’t ask nicely” enough.  Mothers & MILs like that are selfish & should be banned until they can behave.", "Your in law forget who’s shat out the baby", "NTA. Your only mistake was letting her have this much access to your LO that early in life and especially after you decided you felt you weren’t comfortable with the situation. Things would’ve been better for you all had you set a boundary long ago.", "NTA", "It's your baby, not hers and you are setting a good boundary.", "Nta. We had our one and only in Oct last year. Idk what we would have done without the support our parents. That being said, your mil overstepped her boundaries as being the supporting parent by leaps and bounds. You can never get back the bonding time she stole from you. I'm not really sure an apology will entirely resolve this. She needs to understand what she did and why that upset you, only then can she be forgiven. Anyways, we're visiting my parents and the 3mo old is currently having a very cute \"conversation\" with grandma.", "Your a Soft AH and only for one reason.. I’m a firm believer that if you have a problem with someone or something and continue to put off an inevitable conversation then things always end up worse. You should have told her 2 weeks in not 7 weeks later and after Christmas. You made it worse waiting so long. Yes she overbearing and a hover mother but you’re emotional and just had a baby. If you can’t have a civil conversation then don’t", "NTA, but maybe some firm bound first. My mil was the same, and it drove me nuts. She would wake up at 6am and start pacing at our bedroom door.  I would have to keep milk in the room in order to not leave the bedroom.  I eventually just set a time for her and used that hour or so to do someone I needed to do.", "NTA", "Sounds like MIL forgot who the baby really belongs to...", "This. So much empathy for OP, my MIL came to \"help\" while I recovered from a traumatic induction that resulted in an even more traumatic c-section. She didn't clean or help with food. Just watched Netflix and napped with him even when we specifically said he could only be held if she was staying awake to do it. I was trying to sleep, but my anxiety would kick in, and I'd go downstairs, and she'd be asleep with him on the couch. They really think they have more authority than actual parents. Infuriating!", "NTA. This isn’t the first time I’ve seen a post where either the mother or MIL wanted to stay the first couple of weeks to “help” where they ended up just trying to take care of the baby & leave the dishes, laundry, etc to the new mom. There was one on here a few months back where the MIL wouldn’t even hand the baby back to the mother to breastfeed because the mother “didn’t ask nicely” enough. Mothers & MILs like that are selfish & should be banned until they can behave.", "Yes - NTA.\n\nAnd agree with this comment. Don’t say anything about it to her. Let your husband handle her and just enjoy your baby.\n\nI’m so sorry you had a negative experience, and I’m so sorry for your losses.\n\nI just want to add that it’s so weird that a grown adult woman has been pouting and sulking. It is very manipulative and immature.", "She definitely knew what she was doing.", "Thank you I was getting the same vibe from OP. It sounds like PPD or something darkening her mindset. There’s still so much she has been a part of and will continue to enjoy with a new baby", "Hello! Yes sorry maybe I wasn’t super clear here. We went to bed with baby around 10PM. I’m exclusively breastfeeding (at least when she doesn’t give the baby a bottle) so was pretty much up all night. She slept in the guest room all night, then offered to come in at 7AM and change the baby and take him for a cuddle so that we can have a few hours clean sleep. \n\nThe point is that she should put the baby back either by 9AM or if he cries, so that I can breastfeed him. But instead of doing this she kept him downstairs and fed him formula from a bottle. We’re massively sleep deprived so would sleep soo deeply that we wouldn’t wake up until midday and then be devastated he’d been fed from a bottle and we’d missed hours of time with him. We asked her to stop this but she continued. Literally sneaking into our room whilst we slept and taking the baby away. \n\nSo yes you’re absolutely right - I am breastfeeding baby every 1hr throughout the night (he’s premature so needs feeding more often than full term babies). So all she was meant to be doing is alleviating us from one nappy change at 7AM but instead ruined my milk supply (I ended up getting engorged breast which were SO PAINFUL because of sleeping for 5hours straight without expressing or feeding).", "You read it wrong.", "Seriously.  Arbitrarily changing the kids diet without consulting the parents is a HUGE red flag.", "She says in another comment that when her family spoke to MIL, she would turn her head and ignore.\nAlso as a nana of 4, you don't help by going against parents' boundaries.", "This is ridiculous", "Maybe I didn’t explain myself well. We had over 20 people at Christmas, the only way to protect our baby (who still wouldn’t have been full term at Christmas if I was still pregnant) was to implement a no holding rule for EVERYONE. This included my parents, who live in the same house as baby (and still includes them). MIL had spent the 3 weeks going on holiday, going to concerts, going to bars - there’s no way she didn’t pick up some germs. The rule was implemented because baby had a stint of time in hospital and only came home on Christmas Eve.", "We don’t really have enough info to know if she does or doesn’t. Probably worth checking in with the doctor in case the feelings of missing out are part of something larger.", "I completely agree.\n\nI honestly can't understand coming to help after someone gave birth and making the new mom DO ALL THE DISHES AND HOUSEHOLD LABOR, instead of resting with the baby. \n\nI'm furious at both MIL and Husband for letting this happen. Poor OP.", "That’s rubbish.  Boundaries with someone’s child - especially an infant - should not be disregarded/ignored.  MIL majorly overstepped & that shouldn’t be ignored.  \n\nAlso, a new mother shouldn’t have to wait her turn to be with her own baby - which is exactly what you’re saying when you say the new mom will have plenty of time to bond with the baby.  New moms & babies actually have biological changes when they’re physically together that need to be nourished as much as possible for the first few weeks.  (Educate yourself - read up on bonding/love endorphins.)  So the first few weeks are NOT the time for anyone other than the new mom to be hogging the baby’s bonding time.", "NTA. She obviously disregards your wishes, your rules, and your baby. feeding him in secret with a bottle? Please get that woman out of your house.", "My mil came and did nothing! Wouldn't lift a finger to change a diaper, give a feeding, throw a wash in, fold laundry. So, there's that kind also", "Exactly, and the second that they asked her to do something differently and she decided that she was going to do it her way anyway. \n\nNo one mistakes that for help.", "I'm sure she *thought* she was helping. After all, she's giving them time to get all that pesky housework done /s\n\nBut, seriously, Grandma wants all the bonding, and doesn't see that her actions actively upset the parents. Grandma doesn't *want* to do the dishes or clean the bathroom, she wants to snuggle with the baby. So she does the kind of selfish mental gymnastics that some people do.", "I do think she knew what she was doing, she knew she was hogging and taking over your child. She had a child ( your husband) and wanted the baby to herself and is now so sad and missing the baby she bonded with….. poor me you took away her grandchild. Husband needs to step up\nand tell his mom that’s the problem it was not Grandma’s time to bond with the baby, it was parents time to bond. When MIL kept the baby so you could sleep, and took the baby out of your room when you specifically told her not to take the baby MIL was making a choice as a Grandma to overrule your decisions as parents. It’s fine that she’s upset but I would not fall into her poor me trap because then you are giving in to her idea that she is a third parent and makes decisions about the baby.  Block her poor me from your head. Now ignore the first 7 weeks and move forward. I know it’s very difficult, my 3 adopted children came to us at 9 1/2 months, 3 months and 5 months,  it’s very difficult to not think about all the newborn things you missed with your baby because MIL was withholding your child but in a couple months it won’t matter. At first I drive myself crazy thinking about things I was missing. Instead of dwelling on the first 7 weeks think of the fun years ahead. Don’t let your MIL ruin the good times you had the first 7 weeks but definitely don’t feel sorry enough for MIL that she cheats you out of the future. Parents have rights, Grandparents have privileges. Congratulations on your baby.", "This really needs to come from your husband, but as a united front. Tell her very specifically that you don't need help with the baby. That *if* you need help it's with the other stuff so *you two* can spend time with your baby. It's fine if she doesn't want to help that way, she doesn't have to help you with chores if she doesn't want to. But she equally doesn't get to help the way she wants if it isn't what you want.\n\nThat she can come over and spend time with *all* of you, but that Grandma Time and Family Time are two different but important things, and if she can't tell the difference and not intrude on Family Time then they're can't be any Grandma Time.\n\nIt's not okay that she thinks she's a special case. That she thinks the rules for *all* the family don't apply to her. It's not okay that she thinks risking your child for her social life is okay. If she won't stop overstepping, if she keeps ignoring you and risking your child, then keeping her away isn't too harsh at all.\n\nI really think you just need to start with a solid communication (without the baby), explicitly stating terms of engagement. If she won't play nicely, she doesn't play at all. If she's going to ignore people like a child she can be treated like one.", "*< I don’t think she gets why she’s in a time out and thinks we’re just being mean. >*\n\n*<she thought she was helpful,>*\n\nShe didn't LISTEN to you, and didn't RESPECT your boundaries.\n\n*<She declined, saying it was too painful to see and not hold the baby, as she had spent a magical time with him and missed him so much.>*\n\nThat was YOUR magical time which she TOOK from you. \n\nYou'll NEVER get those first bonding moments back.\n\nThis is YOUR baby, NOT hers\n\nShe should remain in Time-Out until she RESPECTS you and DH as the parents.", "Nooooo! Do not have this discussion with her! You will only open the door for more bad behavior and her claiming victimhood. It is NOT your job to manage her feelings. She is an adult who lacks self awareness. Do NOT engage when she whines or frets. You & hubby decide the boundaries, communicate them as clearly as possible, include consequences for infractions. Be consistent. Be a unified team. Rince. Repeat.", "The idea that you have put a grown woman into “time out” is gross.\n\nYour MIL didn’t ruin Christmas and her showing up empty-handed - after weeks of free help with the baby - should NOT have been a problem.  You said it was a large gathering, are you saying your family went to “a lot of effort to cook and host” just for her and wouldn’t have done it for all the rest of the family there?\n\nYou were fine with MIL holding the baby when it was convenient for you but suddenly you said no?  I don’t believe your parents weren’t holding the baby before/after the gathering, and having an exception for grandparents would be more than logical to everyone else.\n\nYour MIL “gets” that you are overreacting and unfortunately she’s doing some overreacting of her own. She likely feels very unappreciated and let down. It’s great that your husband is supporting you.  Your overreaction is even understandable.  However, you need to let him handle any conversations with her, and you really need to re-think how you are framing the first weeks of your child’s life.", ">Over the next 18 years or so you will need to get good at accepting situations as they are, not as how you thought they would be,\n\n*Very* very good point. OP's going to lead herself into a lot of disappointment if she gets too hung up on ideals and fantasies and not accepting life as it comes.", "This situation could be a catalyst to PPD for OP, esp. given her history of difficulty with pregnancy. Hormones are wild after giving birth. If there's any underlying depression or anxiety prior to being pregnant, especially. Being with mom or dad as often as possible, especially in the earliest days, is incredibly beneficial to all parties. Life happens, and it can be ok if this isn't how it plays out, but there is so much evidence pointing to this being the best case scenario. I only felt safe when I could roll over and check that my son was breathing after the traumatic birthing I experienced. Mom's mental well-being is so important during this time. OP isn't being dramatic or harsh. She needs to look out for her family until she can deal with this with a clear mind.", "OMG. I would have lost my mind if someone had tried to pull that with me. I exclusively breastfed both my kids, and no way would I have tolerated that. Nor would my husband have tolerated it. And NOBODY walks into our room uninvited. You are absolutely not overreacting. Just remember - you hold all the cards. You’re the parents, and what you say goes. So if your MIL wants to pout and sulk, just ignore her. And certainly don’t invite her to spend time with your family again. Her behavior towards them was completely unacceptable.", "My apology was always there if I'd read your post wrong, but once more, I am sorry. This clears up the misunderstandings I had and completely changes my perspective on things from how I first received read it. \n\nThe early weeks of parenting are really tough at the best of times and of course you would be massively sleep deprived. Her sneaking into your bedroom to take the baby or not returning him as you wanted is very much out of order and not what you'd agreed to. The baby needs to be with you as often as possible which I can see now was the case. Help is wonderful, but having people overstep your boundaries is not. Feeding him formula when you are in the process of establishing breastfeeding **and** when it's against your wishes is not just a small overstep either. You're right to be very upset over it.\n\nYour Christmas rule regarding no handling of the baby was the right one to have, especially with him being premature. You and your husband are tasked with keeping him as safe as possible and everyone should understand that and take it seriously.\n\nAs far as bonding goes, try not to ruminate too much on the time MIL was at your house. He is only 7 weeks old and you have all the time in the world now to just soak up this time and love on him without interruption. You will never forget those first two weeks and it will change how you do things with any future kids but please try to move past the mind set that she has ruined your experience of being a Mum and do see your doctor if these sad feelings persist. Your feelings are valid but it's not healthy to stay in the place of feeling that she has ruined motherhood for you when he is still so tiny. \n\nYou sound like a kind person who wants to do the best by your husband and not alienate MIL from your little family and he sounds like a good guy standing up for you and your son when needed. I agree that you're owed an apology and once you have a sincere one then hopefully she can be allowed back in with sound boundaries in place.", "If you are exclusively breastfeeding then why are there even bottles and formula in the house.\n\nI’m not going to call you T A, but I do think you’ve massively overreacted to a grandma trying to help and trying to be included when the other set of grandparents are literally still living with you and the baby.  I do not believe that your parents have never held the baby.", "Is your husband not working?\nWhy do you need 2 adults helping you?\nMost women do this on their own after couple days.\nI sure did. Husband went back to work after a week. Mother popped around maybe once and brought food.\nNo one came and did my housework. That’s what husband is for.\nYou sound very entitled,\n\nWTF is your husband sleeping until noon?  He’s not breastfeeding.", "Yes, and my apology was always there if that were the case. With Op's reply to me and the edits I can see it in the proper light now.", "I don’t think the MIL is a saint by any means but I also don’t think she should be banned from her grandchild’s life. I know a lot of parents who don’t have any familial support. Both of my parents had their mothers look them in the eye and say: “I’m not helping you”. It frustrates me when I see people like OP resort to banning their child’s grandmother instead of working it out with her directly. I just think there’s a better way to handle this.", "Where does she says she waited her turn? She’s was SLEEPING. \nI have two kids, I am still breastfeeding both because I know… but I was also never exhausted to the point that I couldn’t hear them crying which is what happened. \n\nThe whole time I thought the grandma did something unforgivable, she gave a bottle to the baby while the mother was dead asleep. And then to go and say THAT prevented her from bonding is ridiculous. If she has other example except for that and the fact that she was “sulking”, I might understand but that’s basically the extend of the issue.\n\nShe didn’t get to bond because she admitted happily RELIED on help to SLEEP the first 2 weeks and now is annoyed grandma held the baby more during that time… because that’s is basically what she is saying in the end.", "I’d rather a MIL just be useless than actively hindering/hogging my bonding time with my infant.", "THIS!!!!! \nThis is your child. Either MIL gets on board with you and your husband as the parents, or she stays in time out until she does.  \n\nYou feel like you’re being harsh, but if you give an inch MIL takes a mile. MILs behaviour has forced you to take a very firm stand.\n\nNTA", "Yes. That she refers to her “magical time” with OP’s baby makes it clear that she knew she was hogging the bonding activities.", "Thank you, I needed to hear this and am grateful for you sharing your experience.", "\"This is YOUR baby, not hers\"\n\nTherein lies the problem. MIL disagrees.", "She will absolutely form her own bonding moments going forward. Every parent who’s had a baby in Nicu has also found ways to bond. Instead of focusing on the lost time in the beginning and developing PPD it would be helpful to focus on the future and the good moments that are still to come.", "I don’t think it’s on OP to have a therapy session with a premature 7 week old after multiple miscarriages because MIL doesn’t listen or understand boundaries, that can come later.", "She took the baby. If you help you take the housework. OP isn’t over reacting, MIL is manipulative, controlling and selfish", "Because having bottles and formula is a good way to make a new mum feel calm and be sure to have a way of feeding the baby. Which ironically improves the potential of being able to breastfeed.", "We bought it in advance in case I couldn’t breastfeed. We didn’t want to have a crisis at 2AM if I didn’t have enough milk or baby couldn’t latch and for him to go hungry. \n\nThe no hold rule was only implemented after baby spent a period of time in hospital, and they have not held baby since then. Same rule for everyone.", "Saying most women take care of their babies alone is absolutely untrue. In most countries and cultures new moms have lots of help from family and friends. I’m Mexican-American and the idea of being alone with a new baby is a foreign concept. I had my mom, grandmother, and father staying with us for the first month (my wife was working and otherwise I would have been alone with a new baby 2 days after delivery). My best friend is from the south here in the US and she was available to come over to cook and clean for me any time I needed. My Vietnamese MIL brought us food and offered to come over any time we needed.", "FWIW I don't think she should be banned either. I think it is reasonable to put her in the penalty box and then allow her back on the ice (so to speak) with an understanding that the parents' boundaries are honored.", "It makes it sound like MIL was bonding with HER BABY amd only sees OP as an incubator and is now chucking a two year old tantrum because \"the incubator\" won't give her back \"her baby\".\n\nMIL needs help and I would be making therapy part of the condition to see OPs baby again bit it would be hard to hold MIL to that since the only way would be family therapy and that would give MIL what she wants \"access to her baby\" not being apart of her grandchild's life.", "HOLD. YOUR. BOUNDARY. \n\nMy heart breaks for you. I had a very very very small boundary violation (MIL didn’t bring baby back overnight because she thought I needed rest but I was upset when I woke up because my baby wasn’t in my room) and I STILL think about it almost eight years later. STILL. \n\nHold your boundaries. She knew EXACTLY what she was doing. It sounds like your husband is right there with you in all of this which is FANTASTIC. Going forward, let him be the defense and handle his family. You focus on healing, dealing with the hormones, getting everyone used to breastfeeding and such, and ENJOY THAT BABY.", "HOLD YOUR BOUNDARIES. She is treating you like an incubator and you're not, you are the child's mother. She had her turn to be a mother and raised your husband now she needs to step aside and let him and you bond with your own baby.", "Meh, this shouldn’t have been a tough situation to begin with.  OP is living with her parents but still needs housework help?  I mean she has a husband there too, right?  No argument that MIL should be doing whatever, not just the “fun” stuff, but it seems like OP didn’t handle any of this well and is possibly an unreliable narrator.", "Ignore this person, OP. They don’t know what they’re talking about", "Absolutely ...PLUS they asked her not to and THEY are the parents!", "So MIL didn’t need to go! If anything just shows more how disingenuous she was, no one wants someone to take over with their new child whilst the clean", "We don’t actually know how things went down.  The whole situation is just weird to me.  I had twins, was hospitalized for two weeks afterwards, and still didn’t have anyone coming in to help me when we finally went home.  Being attached to a bed for two weeks is a traumatic non-bonding event.  Having a MIL who takes a baby and keeps it quiet after you’ve had it all night long so that you can nap for four hours?  That’s not a traumatic non-bonding event.  Did no bonding happen in the night?  The examples being given just don’t add up to the overreaction being presented.", "It’s not an overreaction. What you’re saying is inconsistent, you’re saying it’s reasonable for the mother to be prevented from holding her child for most of the day but then unreasonable for the grandmother to endure the same? That makes zero sense. Only being able to hold your own kid when it suits MIL is not bonding and having a woman who is hostile to you take over your house and decide how you parent can actually be traumatic.\n\nYour anecdote reminds me of people who comment ‘My parents never gave me anything for my 16th birthday! I have no sympathy that people are moaning about unfairness when I’d have loved a gift card!’ On threads where someone complains their brother got a new car and the got a $200 gift card. Just because what you went through might be worse in many ways, doesn’t mean OP has no right to be upset.\n\nThere is also no reason to disbelieve the ban and that the parents were not holding the child. You really don’t think MIL is wrong for coming into their home on the pretext of helping and then ignoring their direct instructions regarding how to look after their child? And then deliberately creating an atmosphere until they felt the need to include her in the little bonding they could do before she left (like the walk) and again, at Christmas when she offended OP’s family? Making the birth of their baby about her is v unsupportive"]}