{"id": 3423, "submission_id": "z6t60o", "title": "AITA for not leaving my seat?", "selftext": "Customary declaration - I am typing on a phone and English is not my first language so I apologise in advance for any mistakes.\n\nSo, my husband (33M) and I (28F) were flying back from our wedding anniversary trip. The flight was 3.5 hours long but was delayed for 2 hours initially and we had been waiting at the airport for very long time. My husband loves the window seat and I prefer the aisle, neither of us like the middle and we don’t take it. So we book one aisle and one window in the same row and leave the middle seat for grabs. We don’t mind people sitting between us so we are cool. This time we have a woman in her mid thirties board the plane with her maybe 6-ish yo kid. The kid was sat in the middle seat of the row in front of us and the woman between us. We greeted and smiled and before the plane started my husband asked if I could grab his headphones from the cabin luggage which I did. The woman realised that we were together and asked if I wanted to switch the seats with her to which I responded no and said that I like aisle and he likes window so we were fine. She was visibly sulking but we ignored and carried on. Now, the flight starts to take off and her kid started squealing and screaming with joy like really excited and the guys sitting with the kid got annoyed but asked him to calm down. The mom saw this and asked if it’s ok for me to move to his middle seat so she could sit with the kid and take my aisle, I politely denied and said the kid looks under control now. Then she started screaming at my husband said, “It’s a good thing you don’t have kids because your wife definitely doesn’t know how to be a mom and what it takes. She doesn’t know how hard it is to be away from the kid and can’t help him. She doesn’t even care that you guys are sitting apart. But I think you can do the wise thing and switch with me.” To which my husband calmly said, “if we were travelling with kids we would have made sure to book our seats in advance together which doesn’t look like you did.” She got mad and asked for the crew. The crew came in and we told them everything. The flight was full the cabin crew couldn’t help and the whole flight she tried to elongate her legs to our sides or crisscross her legs on the seat, took both the arm rests, snored and slept and poured water on me. While deboarding the flight she called me an AH and said people like me shouldn’t be allowed to travel. So AITA?", "created_utc": 1669631512, "permalink": "/r/AmItheAsshole/comments/z6t60o/aita_for_not_leaving_my_seat/", "score": 1209, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I could have switched the seats and these things would have not gotten so far. But I paid extra for our seats so we wouldn’t be stuck with middle seats. But I think the situation could have been minuses.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA— I hate people who feel entitled to inconvenience others because their “needs” are more important than anyone else’s.\n\nYou and your husband were right to keep the seats you booked.", "NTA\n\nThat woman was only projecting her problems on to you. It was only a 3 hour flight and it's her own fault for not making sure to book a seat with her kid in advance. Also, she couldn't use getting to her kid as an excuse when she tried to switch seats with your husband who was sitting in the window.", "NTA. It would have a lot more sense for her to ask the people next to her child if she could swap. People don’t want to sit beside unattended children. But even then they gave the right to refuse.", "Info: Did she ask the people next to her kid to move? And if so, what did they say?", "NTA\n\nThis was not about the kid.\n\nShe tried to guilt you into changing your seat, so she'd get the more comfortable aisle seat and have her kid in the middle.\n\nBut you had already declined this and the child was quiet. \n\nIt's also remarkable that she only asked you as another woman and didn't ask they men who actually sat with her child. Why didn't she ask one of them?\n\nProbably because she already knew that no one would willingly do it but banking on you caving out of womanly loyalty or some other nonsense.", "NTA. She wasn’t the A for asking but after being told “no” she was extremely rude.", "NTA\n\nNo one is ever an asshole for sitting in their seats that they BOUGHT.  Your husband was correct, if she wanted to sit with her child, she should've pre-booked the flights.", "NTA. What an entitled piece of work that woman is. As if you’re somehow responsible for her and her son being separated. She should have planned ahead and her failure to do so isn’t your problem. She stuffed up and tried to make you feel guilty, so I think she’s a complete A. Good on you for standing your ground.\n\nedit: typo", "NTA. People have the right to not give up their seats on a plane, especially with the way airlines nickel and dime people these days. It’s also not fair to make your inability to plan ahead or unwillingness to pay a bit more to sit with your child everyone else’s problem. It’s fine to ask, but people need to respect a “no” and move on with their lives.", "NTA, that woman should have ensured she was seated next to her child. Yes, it may cost extra but she is a shitty mother and entitled enough to just assume people would switch seats.", "NTA. Mom rolled the dice on late booking and lost. Mom should have been razor-focused on her kid, because they could have been next to a creeper, instead of punishing you for standing your ground. However, the airline has the technology to know when a 6 year old is being seated separately and could disallow or up-charge this practice if they choose.  Hopefully enough of these situations occur to get them to make changes.", "NTA you should feel good that your free will caused this woman to seethe so hard.", "NTA - your husband was right- if she wanted to make sure her and her son got seats together she should have planned advance instead of trying to intimidate someone to move their seat. Your husband flipped the script on her and she didn’t like it.", "NTA this is a flight where you choose your seats (and may pay more for certain positions). She gambled and lost.", "NTA - No one is an AH for not switching seats on an airplane.  It's okay if people ask, but they get so offended when you decline.\n\nI reluctantly switched seats with someone once, we both has aisle seats, his wife was in a center seat, so I was the person between them. I didn't want to switch but since it was aisle for aisle it seemed okay. I said, \"as long as the media works in your seat, I'll switch\". The flight took off, the media didn't work in my new seat. I tried getting assistance but it was broken. I told them I had to switch back and they retaliated by handing things to each other, over me, for the rest of the 6-hour flight. At least I had a movie so I didn't have to hear them.", "[removed]", "NTA", "[removed]", "NTA", "NTA!!!!!   People are free to politely ask once if you will trade seats, but you are never, and I mean NEVER obligated to do so, ESPECIALLY if the trade is a downgrade. It’s her problem that she didn’t plan well enough to sit with her son, and could well have been an intentional tactic on her part. She was TA - not you!", "NTA. She got the seats she booked. You got the seats you booked.", "You're NTA. Her poor planning is not your responsibility. How sad that her 6 year old was better behaved than she was for the flight.", "NTA \n\n\"Your failure to plan does not mean an emergency on my part.\"\n\nShe behaved like an entitled child. Maybe she should have spent the extra money for assigned seats. Maybe she should have made her reservation on a plane that had seats together, instead of assuming people would switch seats with her. There's a reason why middle seats are undesirable.", "NTA. I personally might have though about offering her my seat- unil she insulted me. People need to learn to take \"no\" for an answer.", "NTA. I have a bad leg. It's not disabling, but flying hurts sometimes. I finally learned that windows/middle seats just mean I have next to no chance of stretching my leg, which helps. So, I pay extra for either aisle or bulkhead.\n\nWhen booking a flight, if you don't choose to pick your seats (whether by necessity bc the flight is full or by cheapness), you are risking not sitting together. You don't know why other people picked their seats, so it's a risk that someone isn't just going to roll over and switch. \n\nKnowing that aisle, window, and bulkheads usually cost more than middles, she could have at least offered to pay you a little. Or she could have asked the other side to switch. But it was still a gamble she took that didn't pay off.", "NTA, mainly because swapping seats with you wouldn’t, by itself, have solved the problem of wanting to be closer to her kid so she could keep him calm. Whether your seating preferences (one aisle, one window on a three seat row) could be considered inconsiderate in general would depend on how you behaved during the flight - for instance, if I was to find myself sat between you then you damn sure wouldn’t be passing things back and forth across me during the flight.", "NTA your husband is my hero for that line🤣🤣", "Nta-", "NTA, because her behaviour was clearly disgusting. But I have to admit, you guys are clearly a little bit dickish.\n\nThe kid's six, FFS. Somebody needed to budge to find a solution - whether it was you, the people next to the kid, or your husband. \n\nFlights get booked up fast, sometimes you need to scramble for a last-minute seat and families get split. So yes, the major asshole in this story is Mom but you guys could have seriously just given up a little bit to make the whole plane's lives a bit easier.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nCustomary declaration - I am typing on a phone and English is not my first language so I apologise in advance for any mistakes.\n\nSo, my husband (33M) and I (28F) were flying back from our wedding anniversary trip. The flight was 3.5 hours long but was delayed for 2 hours initially and we had been waiting at the airport for very long time. My husband loves the window seat and I prefer the aisle, neither of us like the middle and we don’t take it. So we book one aisle and one window in the same row and leave the middle seat for grabs. We don’t mind people sitting between us so we are cool. This time we have a woman in her mid thirties board the plane with her maybe 6-ish yo kid. The kid was sat in the middle seat of the row in front of us and the woman between us. We greeted and smiled and before the plane started my husband asked if I could grab his headphones from the cabin luggage which I did. The woman realised that we were together and asked if I wanted to switch the seats with her to which I responded no and said that I like aisle and he likes window so we were fine. She was visibly sulking but we ignored and carried on. Now, the flight starts to take off and her kid started squealing and screaming with joy like really excited and the guys sitting with the kid got annoyed but asked him to calm down. The mom saw this and asked if it’s ok for me to move to his middle seat so she could sit with the kid and take my aisle, I politely denied and said the kid looks under control now. Then she started screaming at my husband said, “It’s a good thing you don’t have kids because your wife definitely doesn’t know how to be a mom and what it takes. She doesn’t know how hard it is to be away from the kid and can’t help him. She doesn’t even care that you guys are sitting apart. But I think you can do the wise thing and switch with me.” To which my husband calmly said, “if we were travelling with kids we would have made sure to book our seats in advance together which doesn’t look like you did.” She got mad and asked for the crew. The crew came in and we told them everything. The flight was full the cabin crew couldn’t help and the whole flight she tried to elongate her legs to our sides or crisscross her legs on the seat, took both the arm rests, snored and slept and poured water on me. While deboarding the flight she called me an AH and said people like me shouldn’t be allowed to travel. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. She could have switched seats with the people in the row infront of you. Why didn't her hate get directed at them? Why would it make any sense for her to be in the aisle, further away from her son?", "The airline is TA but so are you. A six year old should be sitting with his mother period. No exceptions. The airline is an asshole for not dealing with that, but so are you for not helping.", "I different and say yes light YTA ...\nYou say she should have booked in advance but who says that was possible? The flight was full...\nIf it were adults i agree you are right not to stand up but for now i think ot would be better for the little kid because he had to sit with strangers.", "ESH. She clearly should have booked her and her son seats together. But so should have you two. I would be super weirded out to be sat in between 2 people who chose not to sit next to each other. My brain would immediately think it's some kind of trap. Or, best case scenario, anyone sitting between y'all gets to be stuck literally in the middle of y'all's chitchat the whole flight.", "Thank you. I wish I could show her these replies.", "Exactly. She thought she could inconvenience us by doing these things. But it didn’t bother us and I think she got more p***sed because of that", "Agree so much. I don’t have a problem with people /asking/ to switch seats if they weren’t able to get seats together (or were cheap and didn’t pay to be able to pick their seats). But I can’t stand when people /demand/ it. \n\nAlso not sure why the aisle seat would have helped her be with her kid, who was seated directly in front of her original seat. That makes no sense.", "I took that to mean that entitled mom gets the window and child gets the entitled mom's middle seat. Husband moves up a row to the middle. \n\nStill, NTA OP. That mom should have tried kindness.", "That’s what…she never asked them. And once we were up in the air the kid was fine. Didn’t scream and watched something on the phone. And the mom was busy being petty with me and I don’t think bothered to see what the kid was doing or asking him if he was fine.", "No she didn’t ask them to move. She just asked us. I don’t know why she didn’t ask them.", "Don’t know what it was but when I denied she definitely started reeling into my husband with mean stuff…", "Yes.exactly. The rudeness was something I couldn’t get past.", "Thank you for your response", "Yes. You could either use an allocate button which doesn’t assure you the consecutive seats will be allocated but costs nothing or you could pay extra to book your seats", "Audacity on some people. And the retaliation is like the cherry on top.", "[removed]", "I am sorry?\nI wasted your time on stuff you read?", "I didn’t want her to pay me or anything. And I didn’t exactly want to switch my seat. If I was seated in middle I wouldn’t have thrown a tantrum. I could have shifted but the way she got arrogant made stand my ground", "We didn’t pass things back and forth. I only passed the headphones to my husband and the plane hadn’t even taken off by then", "No…OP was not dickish. When it comes to flying, book your seats in advance. The lady should have done so, like many others in the plane probably. And 6 is fine to be sitting alone with mama behind them! They are 6 years old, not 6 months.", "I thought so too. But it really got on my nerves when she started screaming at my husband and saying I won’t be a fit mom…so I stopped giving it any thought I would have. Clearly I made it very personal and shouldn’t have. The situation took the better of me.", "It’s not like they forced the 6 year old onto a different plane. He’s a row behind her.", "No idea. Maybe she was trying to guilt me into thinking that it’s for her kid and I should do it. Because I am a female too. I don’t know what she was thinking", "so maybe the mother should book better seats? OP is NTA if you have a child accommodate for it, don’t be a poor parent. under no circumstances does OP need to “help”", "This is a you-problem, not everyone's else", "And I believe she didn’t cross a line by saying those mean things. But to each it’s own. Thanks for the reply though", "OP switching with the mother wouldn’t even have put her next to her kid though. It would have given her an aisle seat a row back from her kid, who was in a middle seat. She was actually closer to get kid in her original seat. So not sure I understand your argument? \n\nClearly the mother just wanted an aisle seat but didn’t pay for it.", "The mother is accountable for her own actions. A mother who wants to sit with her child will plan accordingly ahead of time.", "I don’t think the little kid had any problem as such. He was happy. And he was calm and happy.", "I can understand that. And my husband and I make sure we don’t inconvenience anyone. We don’t continuously communicate each other like that or pass things over. We sit by ourselves peacefully.", "[removed]", "[removed]", "Every flight I’ve been on for years has been packed. And the middle seats go last, especially if even couples travelling together decide to book everything from a row except the middle.\n\nThe woman was TA for what she was doing, especially since some of her “solutions” would have done absolutely nothing to help her son, only given her more comfort. But I am tired of people piling on with “oh it’s all her fault for not booking seats together” when often, if your travel isn’t known far in advance, there simply aren’t pairs of seats together left. Once enough people are booking in advance, it stops being a magic solution for at least some of them.\n\nIt’s not necessarily her fault for not booking seats together. She is TA for harassing OP about it, especially the sexist remarks.", "Any kid that age wants to be next to his mum or dad\nDon't matter if it goes okay or not", "That would be a really mean thing to say. So didn’t say anything like that. I think I am not the judge of who should and shouldn’t reproduce and her saying those things to me kind of hurt so I stayed my ground", "😂😂😂…you are welcome to use it.", "Agreed. But, she didn’t ask anyone else. Just me and then started spewing mean words.", "I wasn’t suggesting actually saying that.", "That is wrong on her side totally but thought I read she asked the stewardess.\nI would have asked more people but it's normal to ask the ones next to you.", "Oh ok..sorry, my bad.", "She did ask the stewardess but since the flight was full no one wanted to move from their assigned seats to a middle seat.", "NTA\n\nTHIS. IS. WHY. YOU. PAY. FOR. SEATS.", "These seats stories are all the same, especially the give up seat for parent(usually mom) with the kid(s)", "NTA the day parents stop acting like the world should cater to them is the day the world ends.", "The time to bring this up would have been at the gate. I've been traveling alone and have been asked by the gate attendant to switch seats so a family could travel together, which I had no problem doing.  NTA, and if she couldn't get the seats she wanted she could have spoken to the gate attendant prior to boarding to see if any lone travelers were willing to change seats.\n\nUltimately though, not your problem.", "NTA\n\n\nShe could've paid extra to sit with her kid. She didn't. \n\n\nI fail to see how that's your fault.", "NTA. I take measures to ensure I get the seat I want.  If they can’t do that then that’s their problem.  If it was a matter of switching a seat for another seat of equal comfort then I wouldn’t mind switching.", "NTA. Never sat next to a nice person while flying, but yelling at you for a seat? That’s wild.", "Nta....this is why she should have booked with seats together", "NTA!!! Omg why don’t ppl with kids book their seats together!!!! My guess is that she didn’t want to pay for an assigned seat and just got assigned middle seats. Seems to me it would be worth the extra money to sit with your child.", "NTA!!! I am so tired of people with children, who don't plan correctly (or don't want to pay the seat fees) and expect those without children to accommodate them!", "Nta. Your husband is right. She knew she was traveling with a small child and she should've planned accordingly.", "NTA", "Yeah. NTA she should have booked the seats in advance if she was so concerned about being separated from her child.", "NTA", "NTA. In what world does a mother book seats that arent together to travel with her 6yr old?!?!?! And then acts like a toddler herself. Yikes. Good on you and your husband for not letting this selfish, thoughtless woman talk you out of your seats.", "I am quite sure she has nagged and guilted others in flights before and gotten her way. You are NTA and a major champ.", "NTA. Poured water on you? I wish a mf would.", "I wish people like her would not travel. The airline industry needs to come out with a hard no policy to asking people to change seats to be together. If you want to sit together, PAY for your seats otherwise you will sit apart. This woman is a cheap entitled AH!", "Ends or get better?", "> I would be super weirded out to be sat in between 2 people who chose not to sit next to each other.\n\nThat's actually a pretty normal thing (booking an aisle and an end seat).  No one wants the middle seat.\n\nNot to mention if the flight is not full (which almost all flights seem to be these days), there is a decent chance that seat goes unfilled.", "So others shouldn’t book seats the way they want to because your brain is a little paranoid? \n\nThere is no indication that OP and husband are actually inconveniencing other people with this, that they’re constantly talking across the person in the middle or whatever. So why are they assholes here?", "I agree. I'd hate it", "Yeah. Although it was by accident or so she wanted me to believe. She had an open bottle of water on the tray which she knocked over and didn’t pick I picked because my leg was drenching.", "Did you even read the post?  The child was in a different row.  This was just the mother trying to get a free aisle seat for herself.", "I love your husband’s response, it was epic. NTA.", "NTA but the airlines could also stop up charging for normal stuff like seating families together. This woman was rude but of course we don't know if they were bumped from another flight and couldn't book together or if they had to travel suddenly and no seats together were left. The airlines have made travel awful and it makes people do crazy things.", "i read so many stories on reddit about people not booking seats together and i always get confused because literally every flight ive been on the seat reservation came for free with the plane ticket. and i do fly quite a lot. there is some seats that do cost money, like first class or more legroom, but just normal seats are always free. i wonder, is that an airline thing or a country thing?", "Nobody wanted her middle seat!!", "She’d identified her target couple to squash together. \nI also hate traveling solo because people identify you as an easy seat chess pawn", "Oh, no doubt, no doubt, her tantrum was the issue. I'm just saying that there are better ways to ask for a seat swap, but you've still got to be ok if the person says \"No.\"", "I’m soooo tempted to ask if that isn’t the same lol. \n\nBut sure, let’s try that optimistic thing people talk about and say ‘it gets better’", "[removed]", "More than likely, the mother in this story, and most other stories about entitled flyers, waited until the last minute to book their flight, and all that was left were middle seats.\n\nOr - she did not want to pay for the premium seats, so skipped seat selection thinking she'd get one of the premium seats assigned to her at boarding.", "Wow…that went dark real fast…😂😂…thanks for this…I needed to see this…", "If that’s the case and you’re left to deal with leftover middle seats then that’s what you do. Deal with it! It’s not fair for people who prebook seats which chances are they pay extra for (all flights I’ve flown the past few years let you pay to choose advance seats, if you don’t, you get assigned random seats at check in), it’s not fair for those people to move to accommodate others’ situations. I think we are all in agreement that lady was the asshole in this situation but she just needed to deal, as do others in her situation. Not the OP or her partners to deal with.", "Hey if I can bring a smile I’ve not lived in vain. Happy to help.", "Yeah oke than I read it oke. \nI get where you coming from but i myself have went on flights were i couldn't book assigned seat before and asked people to switch. I didn't ask one person but a lot and people always did this ( happend two times).\nNow my kid is 11 so she can sit alone but prefers not to ofcourse..\n6 is too young to sit seperate and although it wasn't your problem because flight attendant should have done something i still think it's an ah move to let a kid that young sit by himself", "I do get your point. This could have been avoided. But it was weird she just asked me and then blamed me and told mean things directed towards me when she didn’t get her way. If in the middle of the flight I had seen some trouble maybe I would have moved for the kid and the mom to be together (I am not a total saint, but I am saying that yes that is a possibility and I might have done it) but the way she said things and the things she said got me so enraged that even if the kid was rolling on the floor crying I wouldn’t have moved. If I needed a favour from someone I would at least be nice about it. And wouldn’t throw tantrum saying I don’t deserve to have kids or I shouldn’t be allowed to fly.", "That's totally wrong on her side and i understand why you didn't do it anymore.", "NTA. Although it’s possible the airline rebooked their seats and separated them. That has happened to us when a flight was cancelled/missed a connecting flight due to no fault of our own where I had originally booked our family’s seats together and were rebooked away from our 6 year old.", "Ironic that one of her aggressive moves was spreading her legs repeatedly, since that’s what got her in this situation in the first place. \n\nNTA. If someone intentionally poured water on me I’m doing everything in my power to create enough trouble for them that they’re at least banned from the airline we’re on.", "NTA. People like her should be banned from flights", "NTA. Her poor planning isn’t your problem. I don’t think she is an AH for asking you, but she became an AH the second she couldn’t take no for an answer without throwing a tantrum and insulting you.", "NTA. You and your husband were correct. She was the negligent parent for not assuring in advance that she would be seated with her child.", "NTA.  If she wanted a specific type of seat, she should’ve booked it in advance.  Trying to guilt people out of the seats they booked in advance is a jerk move on her part.", ">took both the arm rests\n\nThe person in the middle seat should always be allowed both arm rests. It is the worst seat, so letting them have both is their compensation.", "NTA  You're the Asshole?  She's the asshole.", "She was asking the husband to switch with her child, so she could sit next to her child and the husband would get the child’s middle seat a row up", "That was my thought. Either of the people in the kid's row probably would have jumped at the chance.\n\nOr even if she really want to be an AH, she should have swapped with her kid, and put him between the OP and her husband. But then, if he was kicking the seat in front of him, it would have been her! (I think parents should be made to sit in front of their kids -- I've had the back of my seat kicked so many time!)", "[removed]", "She was asking her to switch seats with her son, so they could be next to each other", "That’s sad…could have happened to her..but I have no context on that except for the fact that she reacted terribly", "I can’t thing of petty things to do or say instantly. I regret that. My witty responses come to me 2 days after the scenario has taken place..😂😂😂…I am slow", "Sorry?", "[removed]", "Of course, but a middle seat is a far cry from an aisle seat.", "Did you talk to your husband during the flight?", "You are correct, I misread.", "I agree she was TA but everyone saying she should have booked their seats together and it’s their fault she did not might not be 100% correct.  I would have definitely asked everyone around to switch instead and asked the flight attendant to request the same from other people too.", "Lol right?\n\nEdit: also NTA", "Right? I have too much social anxiety for this. Don't know why it is a weird thing to expect people to sit with those they're traveling with.", "The cheaper airlines charge to pick a seat.  Most of the times flying with 1 other person we were put together but sometimes we werent.", "I always fly garbage airlines and refuse to pay extra for seats and have never been separated from my husband. I assume it's because we're always quite early so we get assigned while there's still space. Be on time and be nice and you shouldn't have any trouble. \n\nIf this airline separated a parent and young child then they had to have been one of the last to check in.", "No idea…I am in Europe and every time I travel I have to pay for my seats unless the airlines shuffles and allots me a seat of their preference", "Stolen comment from u/kdollarsign2 Please report the bot using Report > Spam > Harmful bots", "Nope…I was busy watching anime and he was busy with music…", "I would've 😄 😄 😄", "You and me both.", "Yea, that woman was an AH in every way except one minor way (the middle seat always gets both armrests. It's the tradeoff for being in the claustrophobic middle) Your husband was completely correct in stating the obvious fact that while she was degrading your maternal skills, she was the one who didn't book a seat with her own child. Both you and your hubs are NTA.", "NTA- entitled people are characteristically unable to see the irony that the situations they cry about are often of their own making and then they always resort to incivility to further press their viewpoint. My response to her is that - actually lady, you're an AH because if the situation was unacceptable to you- you should have never got on the plane. It was nobody else's responsibility to fix or sacrifice their convenience for yours.", "You don’t have to know how to be a mom because you are not one (whether you know how to be one or not is irrelevant). She is a mom and apparently she doesn’t know how to be a mom either (her kid her responsibility).\nNTA!", "people like her shouldn’t be allowed to travel. NTA", "NTA.\nBut I do think the middle -seat- person should get both armrests.", "NTA. 1) a 6 year-old is fine 2 ft away for 3 hrs. 2) I don't understand why these people don't choose seats in advance. Even on airlines that make you pay it's only 15$ a seat for the cheap seats. 3) When they realize they aren't seated together, why don't they ask an attendant before the flight takes off? They can make an announcement for volunteers and someone who genuinely doesn't care will come forward.", "NTA - And I seriously wish airlines would start offering child-free flights.  Not just to avoid a screaming and/or hyper child, but to avoid their entitled parents.  I would pay extra for that.\n\nThat woman behaved worse than her child.", "NTA. If she wanted a seat next to her child, she shouldn't have booked two middle seats in different rows.\n\nThat said, the person in the middle seat *does* get to use both armrests; she was not acting inappropriately in that particular manner.", "NTA this is a classic case of “we’ll get someone to move on the plane so we can sit together”. This is why you are given the option to pick your seat, granted yes sometimes the genuine “there are no 2 seats together available on the plane” does happen in those cases it’s probably better to see if other flight times have the options available. It’s an AH move to assume that people will have to accommodate for you. \n\nI myself usually buy the window seat because I don’t want to inconvenience anyone as I will always fall asleep on the flight pretty much involuntary at this point. Long legs so knees are always cramped plus seats are always uncomfortable so passing out/knocking off just skips that discomfort. So rather just do that and not block off the other 2 seats as getting up and down in a plane usually results in knees getting hit or hitting my head added plus never hear any screaming kids when you’re passed out.", "ESH - It's awkward to make someone sit between a married couple who are likely to be talking across them, but she also should've planned ahead to make sure she got to sit with her kid. I think you both need to think more about other people and the situations they put them in.", "NTA - If she wanted to sit next to her kid she should have planned better. Also, once she figured out that you and your husband selected the seats you were sitting in and didn't want to move, why did she think you would give up your seat to go sit in the middle of the row in front? Clueless. If anything ask the person sitting in the window or aisle seat in the row in front if they wouldn't mind switching seats with her. Fucking entitled people are annoying.", "[removed]", "Yeah…I didn’t mention the taking of both the arm rests as necessarily a bad retaliation on her part.. I mentioned it like not only did she take both the arm rests, she also invaded our spaces by spreading her legs.", "[removed]", "From your description it looks more that she wanted to get your aisle seat, than comfort her child.", "She poured water on you? Did you do anything about that or inform the flight crew? Also: why couldn’t the guy sitting next to her son switch seats. Why did it have to be you?\n\nNTA, that lady is lucky you are nice.", "Bad bot, stealing the comment from u/mcsurfyfly", "PsyfdgicalS is a bot--downvote and report.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I edited the comments.  I meant to say that the gf should have given up after you first said no.  She was an asshole for continuing.", "She gambled and lost.", "Came here to say this", "I didn’t do anything but water because I maybe it wasn’t deliberate or so she wanted me to believe. She had an open bottle on the tray and hit it by mistake (I think) and didn’t even bother to pick it up, so I picked it up because my leg was drenched. \nAnd I don’t know why she never asked them, maybe she wanted me to do a solid woman to woman because I could understand her woes, or so she thought.", "[removed]", "Budget airlines - or short haul ones - will make you pay to choose seats, and if you don't pay then you might end up split. Slightly pricier or long haul airlines try to keep each booking together even if they don't pay extra. (or, for instance, Ryanair will give children free seat choice but one adult has to pay to sit next to the child - it's not an option to sit separate if the kid is under 12 though)", "In the US, even regular airlines like United and American will offer special \"basic economy\" fares that give you random seats at checkin and often don't allow you to use the overhead bins.  This saves you 5% - 10% off the price.  Sometimes less.\n\nIt's kind of ridiculous.", "It's a bit confusing, because she initially asked if the OP wanted to switch to sit next to her husband.  Then when kid started being noisy she asked if she would switch with son so mom and kid could sit next to each other.", "[deleted]", "I don't disagree. I just meant we shouldn't vilify the Mom, she may have had no choice. I don't blame her for asking a couple to switch so they'd be next to each other and she'd be more accessible to her kid. She should have accepted the no graciously but it sucks that every aspect of air travel comes with an additional cost just to make it slightly less shitty.", "Then I don’t see any issue with how you fly, generally. \n\nHowever, if I were the solo passenger seated between you and you talked over the top of me I’d be pissed off because it’s extremely rude.", "I did in the past and I had AND still have no regrets.", "We know that. And we don’t do that. Not just that but my husband kind of gets awkward and super conscious if I kiss him public. He is an introvert, so am I, and likes his things to be his business and not anyone else’s. And I respect that part. So we like doing things together and part as well. And this is one thing we do apart. Even if there was no one seated between us we would have indulged in our own musings rather than chitchatting.", "NTA\n\nI don't get parents who don't book seats with their kids.", "NTA\n\nLook, it sucks that she wasn’t seated with her child. But she wasn’t separated by an entire plane, *she was right behind him*, and screaming a sexist tirade at your husband was entirely uncalled for. You are getting the brunt of it because of your proximity and likely your gender and relationship status. (Notice how she didn’t bother you until she realized you were with a man.) But you know where else parents don’t sit next to their kids?\n\nIn cars when they are driving.\n\nAlso her son had settled after a moment of understandable excitement. It’s a good experience for him to have mom nearby, but also have a little bit of independence and learn how to interact with people. He’s six, not three. \n\n> took both the arm rests,\n\nOk this one I think is fine - middle seat always gets the armrests imo lol\n\n> While deboarding the flight she called me an AH and said people like me shouldn’t be allowed to travel.\n\nOh hey, just more blatant sexism. You weren’t the one being verbally abusive towards another passenger. Her kid was fine.", "NTA - she poured water on you because she didn’t get her way? Really classy of her. The only entitled person here is her, not you or your husband.", "Your seats you booked end of story.", "No, you’re not she just has ego people, like that need to get humbled if she got that mad she should have booked in advance not your problem .", "NTA\n\nI work for a major US airline. Op, you are definitely NTA. You have a right to the seat you chose. Its also very likely that the woman talked to the gate agent and was told the seats couldn't be moved. \n\nYou really ought to report this to the airline. Her seat #/flight #. That behavior is absolutely unacceptable. She won't be banned or anything, but the airline will likely give you something (travel credit, miles, etc) and for putting up with that utter BS you definitely should get something.", "NTA. \n\nBut middle seat does get both the arm rests.", "Nope - NTA.  There is no way in hell I am giving up my aisle seat to sit in the middle seat.  The lady should have planned better.  That's totally on her and not you.\n\nShe's the AH here.  Don't lose any sleep over this.", "NTA.  She could reserve seats together, and should have.  Her poor planning is not your crisis.", "NTA, altough I must say it wouldn't hurt to be kind and let a kid travel besides their mother.", "NTA", "Not really the question, but I also think you and your husband are TA for your booking strategy of always making a stranger sit between you. \n\nPersonally I think it’s weird and rude that you force someone else to sit between you while you still pass headphones, etc. back and forth. What an awkward setup! Sit together or sit apart, but no one wants to be your third wheel.", "I fly more than most. I've been a Delta diamond for nearly 10 years and AA Executive platinum for 2 of those. I've logged over a million miles as a customer, and spent time working for an airline too.\n\nFirst, you are entitled to not change seats. You picked it, you don't have to move. Someone else's lack of planning is not your emergency to solve. The crew is welcome to mandate a re-seating if they feel they need to.\n\nLikewise, the mother can ask, but she has to respect your no.\n\nThe introduction of seat selection fees and basic economy has also meant that some people feel entitled to the lowest price, but still think they should get the benefit of higher fares -- i.e. they should get to pick seats, even though they chose a fare that does not allow that. People who do this are AHs.\n\nBut there are also people who book late enough that there aren't seats together available anymore. And sometimes people are just trying to do the best they can. I have found there are some people who are genuinely trying, but stuck in a bad situation. And for every unprepared person, there is someone doing there best, and someone like OP on a high horse looking to shame them. Sometimes, an ounce of compassion, even when not necessary, can go a long way.", "Bingo.  NTA on the rest of it though.", ">It's also remarkable that she only asked you as another woman and didn't ask they men who actually sat with her child.\n\nI noticed this... as well as the fact that she told OP's HUSBAND that it was good they didn't have kids as OP would be a terrible mother. \n\nAs if parenting is only the woman's responsibility, and that insulting a woman's capacity as a mother is one of the most stinging blows you can land. She really thought she was diminishing OP's value as a woman with that remark.", "The headphone was just one time. And if you look at my other comments you will know that we don’t really talk or chitchat or pass things back and forth", "OP said that they don't talk or anything tho.", "that is not OP's problem tho. they booked the seats they wanted. those were their seats, period.", "What about airlines with a policy of children (teenagers) must sit with their adults,  but still expect you to pay to facilitate this?\n\nWhen you check in online as soon as it opens and can't get adjacent seats,  but when you get on the plane,  they mane everyone move,  because policy?", "Totally agree with this! And most people have no problem switching seats (especially when a small child is involved) so there isn’t usually a situation when someone tries to demand it.", "If she had the aisha seat,  she can swap with the nan in the assuage seat in front.", "If it’s enough for other people to figure out you’re together (and it was), then it seems weird and rude to me.", "I must have missed that part when I was reading the original post.", "She might have more chance with the guy in front,  because it gets him away from sitting next to her child. \n\nBut then again,  maybe not,  because the misfire seat is the least desirable, which is why she got left with two such seats by not booking.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Thanks for pointing out that people get bumped! I have travelled standby my whole life and when I was little, sometimes I’d be separated from my mom. She would always ask if someone could switch so we could sit together, and 99.9% of the time people would say no problem. \n\nObviously it does sound like this lady was rude and super wacky for going after the husband and making comments about OP, but it’s a 3.5hr flight and I get that it’s important for people to sit with their kids (especially if the kid was around 6 like OP said). Also husband was kind of ignorant for saying that if they had kids they’d make sure to book them together in advance…you don’t know if that was an option for them or not. Even if he said it “calmly”, he doesn’t know what it’s like being a parent and would probably want to sit beside his child too if they were separated. I think we’d need more info about the circumstances of how/when this lady booked for herself and her son to be able to properly judge the whole situation!\n\nI understand that OP preferred the aisle and had the option/financial means to book in advance, but it’s not a very long flight and you could have chosen to help someone out (which always feels like the right thing to do imo).", "The problem is that the good seats are being booked in advance so if you're not booking seats the airline maybe can't sit you together because there's no seats next to each other left. And for people saying \"but the seat next to us was empty\" it's probably booked by a no show. From someone who had booked a full row and no one of us could fly, so they most likely stayed empty and people probably being pissed why they didn't sit together when there's a whole free row, but obviously they couldn't use it because they didn't know we wouldn't come. \n\nIf you want to sit next to your kid pay for the bloody seat or don't fly if you don't like it. The airline doesn't force you to book with them. Of course you can always ask, but being pissed when others that did pay for their favourite seat  don't want to swap is entitled and rude.k", "We fly frequently with our kids and the problems usually arises when an airline cancels or changes your well-planned flight last minute via text. More often than not, when this has happened to us, there is no option to select seats until you check in at the GATE (first come, first serve).  Then, it's a mad rush to get to the gate AND find someone working it in order to negotiate a seating arrangement that'll work for you.\n\nUsually there are a few other people sitting around in the same boat waiting for the gate agent. It's all very stressful and can feel a bit cut-throat at times. We'll sometimes go to a neighboring gate agent to try and find someone sympathetic enough to assist us so we don't need to wait until just before departure to learn our fate.\n\nBecause this does happen, we fly SW whenever we can since there are no assigned seats and families (with young children) board early enough that we've never run into an issue with being able to find seats together. Unfortunately, SW doesn't fly to all destinations so it's not always an option", "NTA Once my mother and I were travelling together, and booked seats together well in advance. About a week before the flight we found they had just randomly reassigned us  to seperate seats. We were able to fix it before getting on the flight though.\n\nCarrying on and making it a problem for other passengers is not ok.", "I don't think it had anything to do with sitting with her kid. She asked OP if she could switch with her so she could have the aisle, then asked OP's husband if he would switch with her. She never asked anyone to switch with the kid. I think the lady just didn't want to sit in the middle.", "Why is this “more than likely”? Both of your suggestions assume that she was entitled, disorganized or cheap.\n\nAlthough this mom’s behaviour was definitely not the way to go, maybe they were bumped, traveling standby, or didn’t have the financial means to choose seats together. Maybe it was a last minute flight because of a death in the family. You never know why people are traveling.", "i feel like some airlines just dont even try lol", "If it was none of my business what other people do, then this sub wouldn't exist", "I don't blame her fur asking,  but throwing a tantrum when the request is denied is AH", "\"this is wrong on her side\"\n\n\"YTA\"", "NTA. People get so entitled nowadays. You booked the tickets, you get to sit there if you want.", "This gave me a lovely flashback to a flight I took when I was about 22 years old. I am a tall man with long legs - 6'4\" and whenever I book a flight I always book the emergency exit seat because it has a lot of leg room. Beside me was a man who was even taller than I. In another seat, in the middle row, was a man shorter than the man next to me but taller than I am. He requested I change seats - rather, the stewardess requested it. I politely declined and had it re-explained that we was very tall and would be extremely cramped in his own seat. I again declined. His comments were not very pleasant. Regardless, I enjoyed my fight significantly more than he. When we exited the plane he had a few unkind comments for me. Of course, as a young buck I returned them with as much flavor.   \n\n\nI detest people like her. NTA", "Nta", "NTA.", "NTA. They're your seats, you don't have to give them up, but I hate sitting between couples that pick their seats this way. Its incredibly awkward for the people stuck between you.", "NTA.  Your husband nailed it when he said it was the mother's responsibility to book seats in advance so she could sit with her kid.  Absolutely NTA for not giving up your Aisle seat for a middle one.", "It's bits like that that make me think this is an ESH situation. Also has me wondering if her and her husband try to talk to one another during the flight, as they're then setting it up so someone is stuck between them for that.", "Right? All I could think was \"why would a parent of a small child NOT make sure they're sitting together when they get the tickets? What if the only free seats for them are pretty far apart?\" Admittedly I don't have kids, but it just inherently feels like a poor decision.", "She probably didn’t want to ask a person traveling alone to move from his aisle to a center seat (obvious downgrade). \n\nThe logical move would have been to ask to switch with you first because she noticed you were flying with your husband in the same row. Most couples/parties wouldn’t have an issue sitting together if it helped someone else out, even if you both had a preference of window and aisle (I mean who doesn’t lol). Then she could have switched from your original aisle seat with the gentleman in front to be with her child! \n\nDon’t know if I’d peg you as an AH or not, but the situation could have been avoided if you chose to be the bigger person and help out a mom and her child (as there’s no way to judge and know what her circumstances were when booking their tickets).", "on a number of airlines in America, the cheapest tickets don't come with the ability to pre-book your seats. I tend to fly Southwest (where you get your seat based on what is available when you get on the plane so if you are flying with  kids don't check in 6 hours before your flight, it won't be pretty) but I did recently fly a more typically flight and I wanna say it was like a $30 difference. (Other airlines you have to pay specifically for your seat but i imagine it's the same range based on what i've paid to upgrade my seat.)\n\nI can appreciate that $30 a ticket can add up but to me, it's part of the cost of travelling. No different than paying a toll.", "I'm wondering if they came from a connecting flight that was late and missed their original flight.", "I had to book tickets for my family (only 1 kid then) at the last minute.  I was able to use the stupid up-charge for everything to my advantage as someone had booked one of those really cheap things for the middle seat of a row.  So I put kiddo and I on either side of him, put my husband in an aisle seat 2 rows away and prepared bribes.", "This is what I didn't get. Her reasoning was that she wanted to sit with the kid but she wouldn't even have left the row. She would even sit a bit further away.", "NTA. I don't understand why people think the nastier they get, the more people will want to accommodate them.", "NTA.\n\nThese \"should I have moved seats\" questions come up multiple times a day on this sub and it's always some wildly entitled AH trying to inconvenience OP for their own lack of planning. No offense to you OP because you're clearly not alone in being confused about this, but I wish we could cut down on these posts. I have never seen one where it was even remotely a question of the OP being an a-hole. You booked and paid for a seat! There might be a little leeway on SWA where it's a free-for-all, but even then... you sit down and that should be that.", "Definitely NTA.", ">“if we were travelling with kids we would have made sure to book our seats in advance together which doesn’t look like you did.”\n\nThat. If you need seats together, book seats together.", "NTA. She is the AH allllll the way.", "NTA. Airlines will book you to sit with your child for free if you ask and most parents do seat selection so that they can parent their child. I would have spilled drinks on her all flight long", "NTA.", "NTA. A lack of planning on her end, does not constitute an emergency on your end.", "The moment she pour water on me I would b****n the f*** out of her for being such and entitled c***. Then taught her child to swear", "NTA and she and everyone on that plane knows she’s TA, your husband told her right.", "NTA\n\nMaybe next time she’ll plan ahead and book seats together.", "Sounds like main character syndrome. I have been flying since I was six, back in the days when family could go all the way to sit your happy butt on a plane before take off. If we fly we prenook because I like to sleep in the window seat or be able to use the bathroom 500 times in the aisle and my sister likes aisle and my mom likes aisles for the room so the three of us end up spread out sometimes. The few times I end up a middle seat I just suck it up.", "Hmmm", "I feel mean about my comment but the fucked up way it came through makes me giggle. It shall remain!", "Not only should they not charge for it, it should be required for young children to sit with a designated adult. That would solve so many of these problems", "In August this year I paid the up charge for premium seats assignments. Together. My reality- on one flight I had 8 different seat assignments, 2 of which were with my family. The airline changed my seat assignment 5 times the day of the flight. I have no problem with selecting seat assignments together ahead of time. The issue is with the airline then changing it. The August example was my worst ever, but I would estimate I get moved 30 percent of the time and never together when it happens.", "I've flown several times in recent years when there were no seats available for me to reserve in advance when i bought my ticket. they block a lot of them to only dole out later on or you have to pay extra to get a specific seat. I usually fly alone so I don't care that much but if I was flying with a child it would suck, because either you wait and roll the dice or you pay extra.", "you make some valid points but there is a difference between giving up my seat on the subway (which I do all the time), and giving up a seat on an airplane when 1) I paid for it 2) flying is extremely physically uncomfortable 3) psychologically uncomfortable 4) stressful etc etc. A parent asked me to switch on my most recent flight- I had paid full price for economy premium in an aisle seat. i said i was fine with switching if the seat was also economy premium and an aisle (it helps my anxiety, and small bladder.) It wasn't an aisle seat. the parent wasnt' negative about it, so fine. but come to find out (from eavesdropping on the various convos that followed) that the spouse was occupying an entire row to himself in economy, and that the parent who asked me had been bumped to economy premium for free with the ids when \"normally they'd be sitting up there\" (they gestured to first class- implied they get there normally via upgrades.) So like.. if I did the nice thing right away I wouldn't have found out that other info. they were just like, yes upgrade us and we expect others to help us sit together. But I paid full price.", "I mean giving up a seat on the subway isn’t really relevant as you’d be giving it up to stand for a relatively short period of time. Everyone has a seat on a plane, and for whatever reason, this nutty mom wasn’t able to get a seat together with their 6 year old for 3.5hrs which would be stressful. \n\nYour recent experience on a flight sounds like a completely different scenario though. OP said that their flight was completely full, and in your case obviously it wasn’t if their spouse had a row to themselves.\n\nI’m kind of confused on a couple of your points…was there a kid involved? You stated that they were parents. Were they switching to sit beside their child? I don’t understand the relevance of them normally getting upgraded to first class, and am confused about why they were asking you to switch seats. \n\nOP’s situation was that both parties were in economy by the sounds of it, so there was no ulterior motive to try and get a better seat right?", "sorry that was confusing- wife was sitting next to kid 1. 1  wanted to sit next to kid 2. 2 was behind wife by a couple rows (and didn't care about sitting with 1). Wife wanted me to switch so kid 2 could be with her and kid 1. (if it was really about kid 2 being with a parent, they could have sat with the father who had a row to himself in economy.) I'm fixated on their free upgrades because I paid full price for a premium class, but they actively upgraded AWAY from being sat together. I guess my general point is, it's one thing if a parent needs to actively be engaging with a very young child to manage them, and another to just assume that that is the underlying reason for all parents wanting switches. (in my case it was just that Kid 1 had a mild preference and \"wouldn't it be nice\"). For the nonparents, no one ever knows if we have legit reasons for not watching to switch--it's just assumed we dont' have one other than selfishness.", "She was so worried about wanting to be right next to her 6-year-old to supervise and be that involved mom she thought you could never be … that she … “slept and snored” on the flight?", " NTA. But she is still owed the two armrests.  I still feel sorry for the people sitting with the kid.", "NTA. But it should be mentioned that the standard rules of access are that the window gets the view, the aisle gets the access and the middle gets the armrests. Again, definitely NTA, but the armrests were rightfully hers.", "NTA, but the part about her taking both arm rests...by recognized social rules of airplane flight, the middle seat GETS BOTH ARMRESTS, because the window has the wall to lean on, and the aisle has extra leg room. So you're NTA for not wanting to switch seats, but you are assholish for complaining that she used both armrests.", "That's what I read the first time the woman asked, but the second time she was asking OP to switch seats with the kid, so the woman and her son could sit together. I also read it as the offending woman asking OP's husband to switch with the kid as well. This would have given her either the aisle or window seat with the kid in the middle, and OP or their husband would be banished to a middle seat in the other row.", "NTA she should have gotten a seat with her child", "As a traveller I don't gaf if people want to trade. I will always say no for almost 99.9% those who asks typically ask in entitled and demanding way.  NTA she should've made arrangements to have herself/her kid to be seated together. I know for I always set for myself to be in a window seat", "NTA.  i hate disorganized entitled parents who believe because they have a child that rules dont apply... or that everyone has to change their plans.\n\n\nShe and her child sounds like a nightmare.", "NTA. \n\nI had a similar situation happen a while back. Though not with kids.  \n\nMy husband and I was going to see a movie. This was before the assigned seats in the theatre. I made him leave early so we could get there early. I like to walk around and pick my seat, before everyone gets there. \n\nOf course after we're seated, the theatre starts to fill up. When the previews started more people started coming in. There was an empty seat on either side of my husband and me. Of course two people come up to me and ask if I could move down one seat. \n\nI declined. I may be the AH for it, but I prepared and they didn't.  \n\nSame thing here.", "Flight attendant here.  You don't have to relinquish your selected seat for anybody if you don't want to, it's yours.  She was TA in everything she did and said except one.  It's the unwritten rule of the skies that the person sandwiched into the middle seat gets the armrests.  The aisle and window people can lean away, the middle person is just stuck there, unable to move.  Give them the armrest, though maybe not this woman.  She was awful.", "Come on she didn't do it by mistake she didn't even bother picking up the bottle and she certainly didn't apologize to you. I'm sure that could be a considered assault or battery I can't remember which."]}