{"id": 34249, "submission_id": "18xjnaf", "title": "AITA for telling my SIL she should be thankful most of her family just ignored her son's name instead of complaining that they only showered him with love?", "selftext": "My wife is Eve. She's the oldest of five. She has two sister's and two brothers. The SIL in question is the middle child Paula. Paula had her son in early December and upon his arrival announced that he was named after their maternal grandfather David. The name was not only a very big shock to the family but everyone with the exception of my wife ignored that she even announced the name at all and focused on the baby.\n\nThe reason the name was such a big deal is their grandfather was a horrible man. Eve faced the worst of him. But the whole family had to deal with how terrible he was as a person. He died 6 years ago and the family celebrated his passing. There wasn't a single member (maybe except Paula after this) who didn't feel like the world had one less evil person in it. This was a guy who was in jail and would have been serving a long sentence had he been younger/lived a lot longer. Eve required a lot of therapy to get over the stuff that happened with him. The rest of the family had their own journeys.\n\nAfter hearing Paula named her son after him, Eve made it clear Paula was no longer her sister and she would not be having an active relationship with her and that she should ignore her from this point on.\n\nThe rest of the family never said a word about the name but voiced displeasure to us. They also understood Eve saying Paula and her will no longer be family. We might see her at big family things but Eve won't speak to Paula again. \n\nThe rest of the family have seen Paula and her son on a number of occasions and over Christmas we saw her but didn't really speak. That is until Paula was bitching that everyone was so loving and doting to her son but refused to acknowledge the name to her. She acted like they were unreasonable for not having nice things to say about the name. I told her she should be lucky they ignored the name instead of complaining that they showered her son in love because naming him after their grandfather was always going to be a hard pill to swallow. I walked away then but she complained the rest of the time that I was an AH. Eve told me she's so self centered for being so pissed about that when I spoke the truth. None of my other ILs were upset either. But Paula and her husband acted like I had egregiously wronged Paula.\n\nAITA?", "created_utc": 1704289241, "permalink": "/r/AmItheAsshole/comments/18xjnaf/aita_for_telling_my_sil_she_should_be_thankful/", "score": 3088, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my SIL she should be glad her family ignored the name she gave her son instead of complaining that they shower him with love. Might not have been my place is the big thing but I also just poked the bear and she clearly wasn't going to want to hear it so I may have misspoke.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Has anyone asked Paula why she chose the name?", "NTA — Sounds like the family is going by the motto of if you can’t say anything nice don’t say anything at all! They are loving a baby that is named after someone that made their lives H E L L and she has the nerve to be mad they won’t acknowledge his name?! You can’t make sense out of nonsense! I would’ve named my baby ‘ABCDEFG’ first!", "NTA - it’s so amazing that you are a united front with your wife and standing up for her. Just continue to support your wife and if you ever feel the need to confront Paula again just make sure to discuss with your wife first. It’s her family so it’s really important you listen to how she wants to handle this.", ">Paula was bitching that everyone was so loving and doting to her son but refused to acknowledge the name to her\n\nHuh, I wonder if she was actually hoping to provoke anger, and looking for a confrontation about it, and she’s disappointed that no one took the bait. Otherwise, why would she be so bothered that everyone (except Eve) is just loving her baby, with no comment one way or the other about the name? She would have to be pretty oblivious to expect the family to gush about her choice to “honor” someone who they all agree was a bad person. Sounds like she’s fishing for drama, or maybe wants the opportunity to argue to the family that he wasn’t really that bad or something. In any case, you are NTA for saying what you said, OP.", "NTA\n\nYou only told the truth. Screw them, they are not your family. They are your in laws. Your WIFE is your family, and you did your job and protected her from abuse she thought she had escaped with her abuser's death. Best. Spouse. Ever.!", "Insane and very intentional she did that. Nta", "NTA. However it should be recognized that David ( the kiddo, not the grandfather ) is innocent in all of this mess. I hope at some point in the future you all can be friendly with him even though his name brings on painful memories.\n\nPaula on the other hand, seems like she exists to get a rise out of people. I would reward that energy with ignoring her existence for a significant period of time.", "Why would anyone respect that name? She knew what she was doing. She was knew what kind of a man she named her son after. \n\nI'm tired of assholes acting so clueless. NTA", "NTA", "NTA because the family need to respect the fact that David was a MASSIVE problem in your life and that to name there child in respect and admiration of that man is by default an attack on you and anyone else who suffered what he has said and done. You have all the right to as a result cut ties with that person as they are on the “dark side”.", "NTA, David's getting a little brother Adolf, surely.", "NTA\n\n\nI could be way off base here, but are you insinuating that Paula named her son after a known kiddy diddler? (Pardon the potentially crass turn of phrase, but I’m unsure of the censoring rules/algorithm and how else to say it without saying it)", "NTA and refer to the baby as Davey, his middle name or any nickname you choose. If SIL has the audacity to complain politely inform her that you and your wife refuse to honor the memory of such a vile person. Of course, if there is no interaction it's a non issue but others in the family who agree with you could follow this example. Sounds like SIL wants attention even if it's negative attention. Poor little baby.", "Nta. If her kid somehow found out he’s named after an abusive man, im sure he will change his name legally the moment he turns 18 and will go no contact", "NTA but unsure why paula didn't have a bad experience with grand father. yeah you name a child after someone who was hated and are surprised people don't make a fuss over it? The 2nd Marx brother changed his name from Adolph to Arthur because of a bad name and paula goes an invokes it?", "nta. fuck paula", "NTA", "NTA not at all.", "NTA. Paula's relationship with her father is her own business, but she can't expect everybody else to share whatever fondness made her decide he needed a namesake. Discreetly ignoring the name is probably the best she could have expected from her siblings, and pressing the point was a really bad decision on her part. You said nothing untrue or unkind.\n\nWe have something similar going on in my family right now, though thankfully not to this extent. (The relative isn't an actual criminal, \"just\" abusive.) Nobody's said anything to the parents but there's lots of WTFing behind their backs.", "Honestly?\n\nHow on earth is this the kid's fault?  How is this worth cutting ties to Paula over? \n\nDavid is the 44th most common name given to boys  in 2022.  \n\nSo, she's called her son David and she wants to say he's named after her maternal grandfather, who was an evil SOB that everyone in the world except Paula was glad to see into the grave.\n\nSo: you don't accept that the boy is called after him!  Have a family confab, exclude Paula and her husband of course, and - pick a David, any David.\n\n[https://en.wikipedia.org/wiki/List\\_of\\_people\\_named\\_David](https://en.wikipedia.org/wiki/List_of_people_named_David)   \n\nFrom then on - any time any of you refer to David, you say \"And this is David! - he's named after David Tennant, we're all big Doctor Who fans! or David Bowie - we're a musical family! - or David Beckham - we love soccer!\" Whatever is convincing for your whole family.\n\n*Especially,* you tell young David that. \"You're named after this David we all admire!\"\n\n*Overwhelm* Paula's assertion that he's \"really\" named after his maternal great-grandfather. Assure him this is some kind of joke of  his mother's - the entire family knows who he's named after, and he can be proud he's named after David Whoever, have we told you *this* nifty story about the David you're named after?\n\nCut Paula and her husband and young David off because of a name: that's TA. Let Paula's memorial to the evil old SOB stand: that's TA.  Change the narrative, you outnumber her.\n\nBut if this stands: ESH.", "ESH here. Maybe it wasn't the best idea to choose a tainted name, but your wife needs to realize that the man she hated is dead and a name is basically meaningless.  It's just a few letters, nothing more, nothing less. This child is not a reincarnation of the grandfather. To cut her sister off because of a name is an extreme overreaction.", "Info: Do you and your wife intend to ignore the baby for the rest of his life, just because of his name? He didn't choose it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife is Eve. She's the oldest of five. She has two sister's and two brothers. The SIL in question is the middle child Paula. Paula had her son in early December and upon his arrival announced that he was named after their maternal grandfather David. The name was not only a very big shock to the family but everyone with the exception of my wife ignored that she even announced the name at all and focused on the baby.\n\nThe reason the name was such a big deal is their grandfather was a horrible man. Eve faced the worst of him. But the whole family had to deal with how terrible he was as a person. He died 6 years ago and the family celebrated his passing. There wasn't a single member (maybe except Paula after this) who didn't feel like the world had one less evil person in it. This was a guy who was in jail and would have been serving a long sentence had he been younger/lived a lot longer. Eve required a lot of therapy to get over the stuff that happened with him. The rest of the family had their own journeys.\n\nAfter hearing Paula named her son after him, Eve made it clear Paula was no longer her sister and she would not be having an active relationship with her and that she should ignore her from this point on.\n\nThe rest of the family never said a word about the name but voiced displeasure to us. They also understood Eve saying Paula and her will no longer be family. We might see her at big family things but Eve won't speak to Paula again. \n\nThe rest of the family have seen Paula and her son on a number of occasions and over Christmas we saw her but didn't really speak. That is until Paula was bitching that everyone was so loving and doting to her son but refused to acknowledge the name to her. She acted like they were unreasonable for not having nice things to say about the name. I told her she should be lucky they ignored the name instead of complaining that they showered her son in love because naming him after their grandfather was always going to be a hard pill to swallow. I walked away then but she complained the rest of the time that I was an AH. Eve told me she's so self centered for being so pissed about that when I spoke the truth. None of my other ILs were upset either. But Paula and her husband acted like I had egregiously wronged Paula.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "No, because she offered the reason (to honor the grandfather).", "Seems the family is treating little Dave just fine, they're giving him love and attention, not dismissing him because of his mother's need to rock boats.", "I do worry about this kid. He will be in for a tough childhood having parents with this mindset...", "He says that they all experienced it, but Eve had it the worst.", "All the homies hate Paula.", ">How is this worth cutting ties to Paula over?\n\nOP hasn't said this explicitly but I'm definitely picking up that the grandfather sexually assaulted family members and molested OP's wife specifically. And everyone including Paula knows that.\n\nSo Paula saying she is naming her son David in honor of the grandpa is pretty much telling the wife I am naming my son in honor of the man that molested you. It is completely reasonable to cut ties and go no contact with a person that would do that, especially a sibling.\n\nYou are right about it not being the kids fault, but nobody said it was. Nobody is blaming the kid. The post says the rest of the family is loving and doting on the boy. It doesn't sound to me like OP or his wife have any hard feeling against the kid either. They are just estranged from Paula and by extension don't have a relationship with her kid.", "For my wife it is. She cannot get past the fact her sister saw that man as someone worth honoring after everything.", ">the man she hated is dead and a name is basically meaningless\n\nTell that to anyone named Adolf", "She cut her sister off because of the *intent* behind the name. \n\nAt best, Paula is stating that she doesn’t believe that grandfather did the terrible things he was accused of. At worst, she is stating that *she does not care* that he did those things. And when a family member tells you that your pain is either 1. a fabrication, or 2. completely meaningless to them, you’re not going to be too inclined to maintain a close and trusting relationship with them. They have told you that it’s simply not that important to them, why bother continuing to pour time and energy into keeping them close?", "I mean, her sister chose to name her son to honor a terrible man. She has said that's why the name was chosen. So there was always going to be fallout.", "If you read OP’s comments, the sister said that she chose the name to HONOR the grandfather. So he’s definitely NTA.", "And we found Paula!!!!\n\nNo one has the right to tell someone how to get past people like the grandfather.  It’s very common for families that go through abuse to kill the name with the person. Would you suggest a Jewish family “put the past behind them” with a name like Adolf or Heinrich?\n\nOP is NTA. However there’s nothing you or the family can do about the name. May I suggest that you all come together on a nickname for the baby, Bucky, Scooter or is initials and get everyone to call him that. For a petty twist , what was your wife’s paternal grandfather’s childhood nickname?", "My wife and I likely won't be part of his life. She is done with her sister.", "OK, so did anyone ask a follow-up question, like why would you choose to honour the grandfather given what kind of man he was?", "It’s literally a matter of time too when someone explains who his namesake was and what he did. \nAnd the shitstorm that follows is going to be insane", "yeah i got that, i'm just curious why paula didn't seem to suffer/resent him.", "Agree.  \n\nI think many posters aren’t picking up on the subtext of OP’s post and WHY it is so horrific that Paula chose to honor the grandfather.\n\nIt’s not about disliking the name David or blaming the kid for being named David or anything like that.\n\nIt’s about Paula choosing to honor the man who caused so much pain to the family. Inexcusable pain. Actions that landed the grandfather in jail!\n\nFurthermore, how do you think that baby will feel when he grows up and learns about his namesake?\n\nPaula isn’t just disrespecting her family - she’s also disrespecting her son.", "Yeah, I'm guessing that. But there's no need to let that memorial stand. From now on, little David was named after someone else, no matter what Paula says.", "Well, I can sympathise with that. But it does seem a waste to let that attempted name-memorial stand.", "But what's that really mean? Nothing. Does it mean the child will look like the grandfather? No. Does it mean the child will act like the grandfather? No. It's just something people say that has absolutely no real impact or consequences so it's pointless to get upset about it.", "I keep wondering what Paula is going to do when her grows up and learns what a horrible man he’s named after…\nNTA", "Yeah but the point is this child is not the grandfather, so it's misdirected anger. His wife is certainly entitled to feel how she wants about the grandfather, but to project that on to the child (an entirely different person) is wrong and not a healthy way to deal with issues related to a dead person.", "My wife was the only one, as far as I know, who addressed it but she was angry and not questioning. According to Paula everyone just ignored it which rings pretty true to what I witnessed.", "Because assholish people have some chosen people they treat nice, their flying monkeys.\nThey recruit them to proof others that they can't be bad. Or they use them to gaslight/manipulate their family members.", "It means that Paula decided he was a good person to honor. Which means my wife does not think of her as a good person to have in her life given her past with the grandfather that Paula is aware of.", "Are you picking up that the grandfather may have sexually abused his family members?\n\n(Grandpa was jailed. The family celebrated his passing. Family members are deeply hurt that Paula was honoring their terrible grandfather.)\n\nThis isn’t just about a random name - it’s decades of family hurt.", "No one is angry at the child. OP and his wife aren’t really going to interact with him because they want nothing to do with his mother and are avoiding her, that doesn’t mean they have animosity towards the child. You don’t get to interact with people’s children without interacting with them as well.", "It sounds like there's a larger family conversation that needs to happen with respect to the grandfather and how he's remembered.\n\nAlso, is Paula the shit-disturbing type to begin with?", "Your in-laws are a massive part of the problem. No one willing to tell her, \"naming your kid after an abuser was your choice. Our choice is that we will love your child,  but always look at you different. And when your child is old enough we will tell him the truth about his namesake.\"", "She can be. I know she's lost friends over that kind of thing. She can also be very dismissive of other people's hurts and pains. I believe she even lost a friend of 20 years because of that kind of thing.", "Totally agree except I hope the poor kid never has to know and feel saddled with the legacy. Poor lad will wonder if his fucked up mom saw something of the sadistic old git in him.\n\nNTA OP, I’d probably be worse and would be shortening the name or already thinking of nicknames", "Sounds like a hard person to deal with.\n\nIn any event, you're NTA for what you said. It sounds like you laid it out pretty calmly and honestly.", "Sounds like she learned that being an asshole is accepted in their family. She named him after someone whose personality traits she admired.", "[deleted]", "Trust me. Kid will start to realise the hesitation or at least the slight pause before using his name and he's going to wonder what's up. I don't know if he needs to hear full details, but a \"your grandfather was a very bad man and the name reminds us of him. It's not you, we still love you\" in an age appropriate manner is enough.  \n\n\nBecause reading between the lines...yikes", "No. That’s abusive to the child you absolutely vile person. Good god that is heinous", "Telling the child who they were named after is abusive? I don't think you know what abuse is if you think that. \n\nAnd definitely less heinous than actually naming the kid after an abuser.", "INFO: What exactly is Paula’s deal? Does she not believe others were harmed by Grandpa? Was she Grandpa’s Golden Child? Is she trying to rehabilitate Grandpa’s memory? \n\nI kind of get being too insensitive and socially stupid to understand why an ordinary name might upset people due to an extraordinary circumstance. That insensitivity can explain naming the child David. But it doesn’t explain her desire that everyone acknowledge that Baby is named for Grandpa. That’s going beyond insensitivity and bordering on aggressive. But why?", "It blows my mind people willingly interact with shitty people just because they are family. Some people deserve permanent shame.", "Has anyone thought that maybe Paula is struggling to deal with trauma and this is her way of doing so? Sometimes people want to pretend the abuse or trauma never happened and ignore it entirely. Paula naming her son in honor of his great-grandfather could very well be an attempt to block out that trauma by associating it with something good. Grief and feeling guilt over that grief can also play a role in this. If Paula grieved—which people have no control over feeling—her abusive grandfather’s death, she could be feeling guilty and trying to reason with herself that the clearly the abuse couldn’t have been that bad, so she’s named her son in honor of her grandfather to justify her reasoning.\n\nNow, obviously this isn’t healthy and Paula should be seeing a therapist if she isn’t, but I think the rest of the family ignoring these possibilities and just cutting Paula out is a shitty thing to do. I’m willing to give everyone the benefit of the doubt here, but you all need to sit down and have a meaningful conversation about this instead of ignoring everyone’s valid emotions and reactions to past trauma before deciding the relationship isn’t worth holding onto.\n\nAlso age is an important thing to consider here. Is Paula young enough that she doesn’t really remember the abuse? Did she block out the bad memories and only remember good ones? Are all of you a little bit older and born in a time when people didn’t talk about or acknowledge abuse like this? These might be worth clarifying.", "I haven't said anything but I had a similar stake through the heart feeling when my second youngest sister announced the name of her second son last year. She gave him our dad's very uncommon middle name as a middle name. I know that her relationship with our dad was very different than mine since she was an athlete and thus interesting and important to him and I was just the eldest daughter who was opinionated and kept the house going. But it just really rubbed in the inequality of what we got from our dad that she could name her kid after him while I'm no contact with my parents and don't want to ever talk to them again.", "She named her son after someone everyone hated so she had a forever reason to fight with her family lol that’s pathetic.", "I'm personally very hurt for your wife..\n\nThis post hurt my heart more than you can imagine. I've a feeling why your wife feels the way she do.  In my case, it was my mams brother. I lost a whole family. I don't miss them because my kids come first.\n\nTry be there for your wife, she might not be telling you everything.\n\nAlways stay om her side xx", "NTA- she was expecting sympathy. She should’ve read the room and knew she was talking to the wrong person.", "NTA, As the granddaughter of an abusive grandfather, I cannot imagine anyone in our family naming anything after him. We changed the name of a rescue dog because it had the same name as my abusive grandfather. I CAN understand not icing out an innocent child because his mother made an awful decision.", "Dang, I feel like maybe she really wanted to have a dramatic confrontation where she could be the “victim” because she is just honoring grandpa, everyone is being soooo evil to her baby, etc etc. The family is being polite by not commenting on her terrible choice, but yeah I think she is fishing for attention and started trying to provoke comments when the big blow-up she was expecting didn’t happen. \n\nSome people really thrive on negative attention, and I feel bad for this kiddo, lol.", "NTA. Paula sounds like she did this specifically to fuck around. If not, she should simply be happy that everyone is loving her son. But to point out that no one is bringing up the name is just asinine, and shows that she was only doing it to stir the pot.", "NTA", "NTA - Paula is an attention getter . . . She feels she should be getting more attention for the name.", "NTA. So she’s basically done the equivalent of naming her kid “Baby Adolf” and wondering why her Jewish family wants nothing to do with her. Definitely missing some screws in there.", "NTA. Paula is fucking stupid", "NTA I have been through a very similar situation", "NTA", "NTA. Maybe to drive homeyour point, nickname the sin Rasputin.  See how Paula reacts then.", "NTA poor child, what will they call him when he gets older, what happens when he finds out the truth. That’s going to be traumatizing", "NTA at least it's a common name? So at the very least it's not too much of a direct connection to him. But because Paula is insisting it is it makes it sound like she only named him that to get the family's reaction or to set up a situation where she can play victim.", "𝒩𝒯𝒜 𝐘𝐨𝐮 𝐡𝐚𝐯𝐞 𝐞𝐯𝐞𝐫𝐲 𝐫𝐢𝐠𝐡𝐭 𝐚𝐧𝐝 𝐞𝐯𝐞𝐫𝐲𝐨𝐧𝐞 𝐞𝐥𝐬𝐞 𝐭𝐨 𝐧𝐨𝐭 𝐛𝐫𝐢𝐧𝐠 𝐮𝐩 𝐭𝐡𝐞 𝐬𝐨𝐧 𝐧𝐚𝐦𝐞 𝐛𝐞𝐜𝐚𝐮𝐬𝐞 𝐨𝐟 𝐭𝐡𝐞 𝐮𝐜𝐨𝐦𝐟𝐨𝐫𝐭𝐚𝐛𝐢𝐥𝐢𝐭𝐲 𝐢𝐭 𝐛𝐫𝐨𝐮𝐠𝐡𝐭. 𝐘𝐨𝐮 𝐚𝐫𝐞 𝐫𝐢𝐠𝐡𝐭 𝐬𝐭𝐚𝐭𝐢𝐧𝐠 𝐚𝐭 𝐥𝐞𝐚𝐬𝐭 𝐞𝐯𝐞𝐫𝐲𝐨𝐧𝐞 𝐰𝐚𝐬 𝐥𝐨𝐯𝐢𝐧𝐠 𝐚𝐧𝐝 𝐚𝐜𝐤𝐧𝐨𝐰𝐥𝐞𝐝𝐠𝐞𝐚𝐛𝐥𝐞 𝐨𝐟 𝐭𝐡𝐞 𝐜𝐡𝐢𝐥𝐝 𝐢𝐧𝐬𝐭𝐞𝐚𝐝 𝐨𝐟 𝐡𝐚𝐭𝐢𝐧𝐠 𝐬𝐨 𝐒𝐈𝐋 𝐬𝐡𝐨𝐮𝐥𝐝 𝐛𝐞 𝐠𝐫𝐚𝐭𝐞𝐟𝐮𝐥 𝐬𝐡𝐞 𝐛𝐚𝐬𝐢𝐜𝐚𝐥𝐥𝐲 𝐠𝐚𝐯𝐞 𝐚𝐧 𝐢𝐧𝐧𝐨𝐜𝐞𝐧𝐭 𝐜𝐡𝐢𝐥𝐝 𝐭𝐡𝐞 𝐧𝐚𝐦𝐞 𝐨𝐟 𝐚𝐧 𝐚𝐛𝐮𝐬𝐞𝐫 𝐤𝐢𝐧𝐝 𝐨𝐟 𝐥𝐢𝐤𝐞 𝐉𝐞𝐟𝐟𝐞𝐫𝐲 𝐰𝐨𝐮𝐥𝐝 𝐧𝐨𝐭 𝐛𝐞 𝐚 𝐥𝐢𝐤𝐞𝐝 𝐧𝐚𝐦𝐞 𝐛𝐞𝐜𝐚𝐮𝐬𝐞 𝐨𝐟 𝐉𝐞𝐟𝐟𝐞𝐫𝐞𝐲 𝐃𝐚𝐡𝐦𝐚𝐫", "NTA, but children of horrible and/or abusive parents can have a range of emotions and coping mechanisms. Your SIL's journey clearly involves a cognitive rewrite of who her father really was. What she did may have been insensitive, ill-advised, and just plain stupid, but I doubt it was done out of actual malice. And indirectly excluding her son from the family isn't fair to him. He's an innocent child. Also, when he grows older, he's only going to hear the distorted version of why he was excluded, which may make him resentful towards a large part of the family. That would be a lose/lose situation.", "Did everyone ignore the Name entirely and call him \"Boy\" or \"Sweetie\" or \"The Baby\"? Or did they call him \"little Davey\" and just failed to praise her for choosing that name Like \"what a nice Name\" or to acknowledge that there ever was an abusive grandpa by the Same name? Both are NTA given the circumstances, but one makes Paula's complaint even more nonsensical than the other.", "Yes.", "YTA. You all are, with the exception of Paula. Your wife needs help.", "[deleted]", "YtA. First, why are you fighting eve's battle, she obviously has a mouth and is perfectly able to take up for herself. It's none of your business, or eve's, what someone else names their child. And speaking of child, grow up. The child's LUCKY the rest of the family showers him with love ? Grow TF up. For the child's sake, I hope you and Eve stay away from him.", "This is a bizarre situation,  but it’s just a recipe for constant drama.    You are disowning the mother and showering the baby with love?    \n\nBe prepared for a lifetime of drama", "“Who would’ve had a longer sentence if they lived longer / were younger.”\n\nThat’s all I needed to hear about what that grandfather was like. \n\n🤦🏻‍♂️\n\nI’m not even going to imagine what that guy did. That’s a life sentence basically.", "You can't fix stupid. This woman has the sensitivity of an ox.", "NTA but unsure why paula didn't have a bad experience with grand father. yeah you name a child after someone who was hated and are surprised people don't make a fuss over it?", "They employ them to prove to others that they cannot be evil.", "Agreed, she sounds like the type who just wants to stir the pot and piss people off by rubbing salt in their wounds.", "Everyone IS being friendly with him. Its literally in the title of the post! Everyone is loving the child, but arent commenting on his name, and thats what Paula is upset about.", "Great plan!  One of my uncles gives everyone nicknames and sometimes he does it so well, no one actually knows what the child’s real name is. Baby needs a nickname stat!", "She's definitely the type to insist on the full legal name. But I'd be getting away with \"hey buddy\" and \"your son\" as much as possible", "It seems overwhelmingly likely. I find it really unhelpful you're not allowed to be plain about this on AITA, because it hardly changes the reality if you're just avoiding the word.", "It blows my mind that people will act like AH’s over a child’s name.  That is the child’s name.  The child is not the grandfather.   Everyone in this situation needs to grow up and get over themselves.  So extreme.  Edit;  the name is David??  That is even more wild that it is so generic.", "Out of curiosity, do you actually think there is even a small chance you actually are the one in the wrong here?", "That's offensive to oxen.", "I HAPPEN TO KNOW SOME VERY SENSITIVE OXEN, MADAME!", "I don't even understand why she expects people to rave over the name in the first place.  When I named my three kids, I'm pretty sure most people did a , \"aww, nice name\" kind of reaction, but nothing after that.  I don't even remember anyone's specific reaction, except for my mother saying my daughter's name was very pretty.\n\nThe ONLY reason to expect anyone to have any further reaction to have a name is a sentimental attachment because of honouring someone (not that I'm in favour of that generally).  If it was a loved figure, THEN I could see extra reaction.   \n In this case, she was honouring an evil person, and by the sounds of it, EVERYONE knew it.  It wasn't a secret.", "I wonder if the father knew the history of the name or the grandfather?", "In pretty much any other circumstance then she should be allowed to insist on them using the child’s actual name however she deliberately chose the name of an evil abusive man so that baby needs a nickname", "[removed]", "I am also under the impression that this is what grandpa did and that maybe Paula was manipulated into thinking it was happening to her because she was extra special and he loved her the most or something along those lines.", "Oh I definitely agree", "I don’t think it’s the name. I think it’s more to do with Paula thinking that the Grandad was someone worth honouring. Of course the child is not the grandad but that doesn’t mean you won’t have a negative impact/reaction everytime you have to hear it.", "I just mean that the kid is innocent in this whole affair. Just doesn't seem right to cut him out of your lives just because his mother chose a name you have reason to hate.", "There's a certain kind of person that can't respect anyone's trauma. They will always downplay it, misremember it, bring up fond memories of an abusive person during family events, especially with the victims present. When they get any pushback on that they go ham playing the victim, telling you it wasn't that bad, get over it, you probably made it up, so and so was such a great person to me, its not fair of you to make accusations when they're over here making toasts to bullies and criminals. These are narcissistic people in their own right, anything they sense is a weak spot they will press and pick at and talk over and twist the knife a little deeper. I'd say Paula is probably one of these. Someone who would love to play 'woe is me' because she named her child after an abusive person and no one swallowed their pride and congratulated her on her sick choice.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "😬 That could well be an option here. Paula is certainly the bad guy in this situation, but she is also clearly not doing too shit hot if she'd pull this. Her poor child.", "First thing I thought when I read this. Second thought was that maybe Paula is suffering from the same type of lunacy as my own sister, and did it purely to upset people.", "Generally you can get away with extrapolating in the comments IME, but it's probably not technically allowed? \n\nIt's pretty sad when you really think about this scenario too. All the kids were abused. So the one honouring grandad is almost certainly acting out of her own trauma, which is... alarming given she has a small child.", "Stockholm syndrome?", "Exactly. I have a history with a “David” myself, not the actual name but an equally common name and given what’s not said probably very similar men, every time I hear the name I shudder. I don’t hold it against people who have the name but if my sister named her child to honour the specific person I sure as shit would never speak to her again.", "It's not my wife's job to subject herself to someone who would do something like that when her sister knows what a horrible monster that man was. For her, her sister is not worth fighting for after that. The relationship isn't worth it. Because she will always know how her sister feels.", "That's completely fine. But still, why would you want a relationship with a sister that would do that?", "I just think it's a pity for David, that's all. But I get that your sister feels differently.", "How despicable. Sounds like some kind of gothic horror story. AND WE WILL TELL THE CHILD THE TRUTH ABOUT HIS NAMESAKE. (cue horror movie music)", "It is a pity for David, but the only way to have a relationship with him is to have a relationship with the sister, and no one in that family is obligated to subject themselves to the presence of someone who honors a person who seemed to have actively harmed some, if not all members in some way or another. I agree with other ppl who believe it was likely sexual assault, but even if it wasn't that extreme, he clearly did *something* majorly fucked up. If Paula's mindest toward him triggers the rest of the family, then it is what it is and they have to prioritize their mental health first. \n\nAt the end of the day, Paula is the one who brought this on her son. One day, that kid is going to grow up and learn about the person he was named after, and I bet that's going to mess him up more than not having an aunt or cousin or whoever in his life.", "So maybe she names her kid after him because she’s also a miserable person who likes to cause pain and drama for those around her?\n\nShe intentionally chose to name her child after someone who mistreated and abused (I’m gathering from what’s not said) most members of the family. She chose the name she thought would get the most reaction and cause the most pain.\n\nNTA- she’s mad because people didn’t react how she wanted. She can’t actually think people would be happy with the name- she was going for drama. I honestly think she expected everyone to reject the kid and then she could play the poor victim but no one went along with her plan, they ignored the name and saw the child for who he was- an innocent child- instead of a tribute to their abuser.\n\nGood for them. I’m glad the rest of your family are decent people and I really feel bad for that child having that as a mother.\n\nI hope you all stay close and keep contact with David- he’s gonna need the support in the future.", "Oh yes! The kid were he my nephew would already be called Davy regardless of what his mother wants (and I am not normally a go against the parents name choice person) or something completely unrelated to his name like Bug or Sprout.", "They could take the opposite approach. And tell little David about all the good guys named David in the world… this might take some research 🧐 to have good examples", "Yup. My husband is the only David I know that isn't a total D-bag (only partially, but he's better now. 😉)", "He did beat Goliath with a sling shot.  What little boy doesn't want to kill a giant?", "Lol 😆 my husband is also a David; and not a d-bag either 🤪", "YTA, this is silly pettiness, what difference should it make what she names her child, the child is not an evil person, I would not want to be around any of your clan with their pettiness.", "She wanted the drama. Everyone ignoring it isn't giving her what she wanted.", "Nope. NTA.  Why are you asking when consensus was on your side and those reactions were in agreement with what you knew about the grandfather from your wife. Perhaps Paula's in her own delusional world. You don't need to join her there.", "NTA But child gets shunned because SIL is a major A-hole?", "NTA Paula obviously wanted attention for the name and her feefees were hurt when she didn’t get it. So she overreacted. She knew the name would cause controversy— that’s why she named her kid that. Is she usually that insensitive?", "NTA. But you should have ignored the one (your SIL) who loves to rock-the-boat or stir-the-shit. They simply do not care if what they do hurts others and only revel in the feelings of other's hurt feelings.", "\"you're right paula.  they actually love the name but are mad at you for taking it first.\"\n\nif she wants to play dumb, two can play that game.", "PITA.", "absolutely NTA!", "Sounds like you all The AH’s. It’s a baby, it didn’t get choice in its name. It should be loved and doted on and yes, say the name it gave a proper discussion and Knick name session.  I can imagine feeling hurt, but damn completely disowning your sibling and her child over a name choice, it’s weird unless they’ve all had a bad relationship the entire time. Also, if the man was that bad that your wife will disown a sister over a baby name, sounds like her parents did a crap job protecting her and maybe she should take up her issues with them, rather than burdening a baby or her sister with it.", "The fact that she concentrates on her kid’s name so much makes me think Paula did it to be an AH. It’s weird. NTA.", "NTA, just giving Paula the facts, which she was already well aware of.  Paula created this uncomfortable situation, (totally unacceptable for Eve) and you have now become the focus of Paula's frustration.", "Nta.\n\nIs Paula just completely ignorant? Maybe print out David's crime sheet...", "Or they're too shocked by her decision to know what to say about it. \n\nThe part that really baffles me is that Paula complained that nobody had said anything about his name. \n\nThe only thing I can figure is that she was intentionally trying to get a rise out of her family by naming her child after her grandfather. \n\nTalk about using a child as a pawn. Yikes!", "The first thing i thought of when reading this was that Chris Hansen TCaP predator “Hambubger.” When that guy died, his family, whom he had abused, celebrated and rejoiced.", "No", "How?", "Well, as the post is insinuating the Grandpa was a child abuser (not sure what kind of censoring this platform requires but I’m sure you know what I’m hinting at when I say abuser) I would also cut my siblings off I would cut anybody in my entire life off no matter how important to me you are I would cut my own child out of my life because that’s disgusting behavior and if I found out that I was named after an extremely abusive man I would change my name and go no contact with my parents", "Speaking as a parent, you have to be pretty fucking stupid and self centred to think anyone would give two shits about the name you give your kids. This woman did it for the shock and awe. Using a baby for her sick games… feels sorry for the baby.", "I'm not saying you are wrong. You still don't get to name someone else's baby. And to say a child is lucky to be loved is absurd", "This is where my brain went too if she’s not a special kind of garbage to literally use a child’s name as an opportunity to hurt someone.\n\nI suspect her head is super twisted around about Grandpa.", "To be in the kids life they would also have to be in the sister's life.", "He didn’t say that the child was lucky to be loved he said the mother was lucky that nobody else was mentioning the name and only showering the child in love he never said the kid deserved to be not loved and The child will grow up with lots of love but someday he’s going to ask why his aunt wants nothing to do with him and it’s going to be a hard reality for him to find out that he was named after an abuser the mother is making a very difficult choice for the child in the future in the name of selfishness. She was poking and prodding talking about how nobody else was mentioning the name if I heard my in-laws talking badly about my husband who is rightfully hurt by something somebody grew up with and he was close to your damn right I would stand up for him too.", " 😂😂😂", "Huh she's part of the family that had to deal with the grandfather... she's OP's  SIL, his wifes sister. The grandfather died six years ago. I think it's safe to assume that she knows what happened and who he was. Why would her parents tell her this is gonna be a problem?", "I don’t think it applies to this situation. Obviously this is a very sensitive and personal situation. The whole family seems to agree they are choosing to ignore the name rather than do anything. I think Eve had every right to point out the harm in the name. \nNTA. \nThe SIL seems to know the name was risqué in the family, and wanted to spark a family debate IMO. Her fault.", "This is right in line with my initial thought. It’s almost like she inherited the abusive gene, and she’s setting up her little baby to be her scapegoat.", "Yeah, that’s my concern. I really, really hope they can avoid this though. But odds are not in the boy’s favour…", "David Attenborough, David Lean, David Bellamy, David Niven and David Beckham. My uncle is called David and I adore him.", "David Bowie and David Tennant"]}