{"id": 34297, "submission_id": "18y4es9", "title": "AITA for telling my sister to come pick up her daughter when I was supposed to babysit her?", "selftext": "Context, hi my name is Lily 14yo female, my sister 33yo females, my friend 15yo female and my niece 8yo female. (Also I am one of those persons that forgets everything in one second) \n\nOne night my sister called me and asked me if I could babysit my niece next week because she had to do something and my niece didn't wanted to go with her because it was boring. \n\nAs a good sister I accept but I was a bit tired so I say goodbye to my sister, brush my teeths and sleep\n\n(My sister asked me to babysit her on Thursday and the call was on Sunday) \n\nThe next day was a normal day and I totally forgot about my sister and my niece. I go to my grandma's house to help her ect just a normal day\n\nThen the next day my friend calls me and ask me \"Hey girl wanna hang out at my house on Thursday?\" I totally forgot about my sister so I say \"yes\" thinking I had nothing to do that day\n\nOn Thursday my friend come over to my house spend the day and at night we will sleep at her house\n\nDuring the day my sister drops my niece and I remember I have to babysit her, it's not a problem because my friend and my niece know each other so we just watch movies. (My grandma is with us in the house because I live with her) \n\nThen comes the night and I take my phone to call my sister to ask her if she could pick up her kid because I had to go. I say very calmly with a soft voice \"Hey sissy I'm sorry I totally forgot I had to babysit her but I have to go right now and I really can't stay can you pick her up? Or I can leave her with grandma they're gonna draw and watch movies waiting for you to come\" \n\nMy sister starts yelling at me insulting me and calling me names like \"You freaking b! I told you to babysit her for a f-ing reason! You're so stupid! You can't do anything in life you're useless!!!\" \n\nI start to cry because I'm very sensitive and my grandma takes the phone saying that there's no need to panic and that she can keep my niece while I'm gone because it will be the last time I see my friend before she goes in vacation in another country. \n\nMy sister doesn't listen and yells again so I take my friend and go in her mom's car that was waiting for us in front of my house. \n\nWe had fun me and my friend that night and the next day my mom is a bit mad but it's okay. \n\nSo yeah AITA?", "created_utc": 1704343117, "permalink": "/r/AmItheAsshole/comments/18y4es9/aita_for_telling_my_sister_to_come_pick_up_her/", "score": 17, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action of leaving my sister's child when she needed it and the action of leaving my niece with my grandma when I was supposed to babysit her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH. Why couldn't you just tell your friend you had to watch your niece? You agreed to do your sister a favor and should have stuck with it and told your friend you had other obligations. You still got to hang out with her. Did you really need to spend the night at her house too while you were watching your niece? Or you could have at least told your sister that you wanted to spend time with your friend and asked her if someone else can watch her kid a lot sooner than when you're getting ready to leave and handing her kid off to your grandma.\n\nYou need to be more responsible and communicate your plans better. But your sister also way overreacted with the way she yelled at you.", "Info: how long did your sister ask you to babysit for? At first, it sounds like for an errand, because it was just because your sister had to do something your niece would find boring. \n\nThen it’s a day and night thing. \n\nInfo: does your sister pay you?\n\nInfo: how often does your sister ask you to babysit?", "ESH - \n\nyour sister was verbally abusive\n\nyou failed to communicate your change in plans to your sister when you had the opportunity", "ESH\n\nYour sister - her reaction seems disproportionate and rude and full nuclear. While I understand she got to know last minute that you cannot babysit at night but it still doesn’t justify her yelling curses at you given that you worked out a reasonable solution with your grandma. Also she sucks because it seems she never told you the duration for which she wanted you to babysit your niece.\n\nYou - Forgetfulness may be an issue you can’t control, but you can learn to handle commitments so that it doesn’t hurt anyone, including you. I suggest you should make a note or set a reminder in your phone or keep a to do list on a whiteboard in your room (this last one has helped me personally!). Also, once you knew that you were double booked, you could have made sure that no more issues arise and confirmed the duration for which you were expected to babysit or conveyed then and there to your sister that nighttime would not work for you. All said and done, as a 14yo i can understand that you are still very young and the weight of blame is far less on you than on your 33yo sister here.", "OP just stop doing favors for your sister. You're a child. Shes an adult and shes verbally abusive towards you. You owe her nothing.", "NTA after OP added the information that the babysitting job was only supposed to be from 11 am - 2 pm.  It is completely acceptable to call at 10 pm and ask where the parent is when they are 8 hours late.  I'd probably have started calling around 3. \n\nOP, your sister doesn't get to drop her kid off and just not pick her back up.  That was very irresponsible of her to abandon her kid and expect you to watch her all day.\n\nPlease do start writing down your commitments on a calendar because forgetting wasn't great.  And I hope you are allowed to tell your sister that you aren't available for babysitting duties, especially after how she just treated you.", "YTA you agreed to do something and then failed to communicate that there was conflict until the last possible moment, which then became a problem. Your sister shouldn't have said some of the things she did, but she has some points too. Time to start taking more responsibility and build some organisation skills.", "ESH. \n\nYes, she overreacted. But the correct response was for YOU to cancel YOUR plans. \n\nYour error caused this mess. It was yours to correct.", "Didn’t think u were the AH esp after your sister spoke to you like that .. but after only supposed to be babysitting for 3 hrs during the day and you had her all day and she didn’t want to pick up her child that def doesn’t make u the AH", "INFO: \n\na. did you agree to a specific timeframe (day and night at Thursday)?\n\nb. if you friend was ok with your niece, why not just invite her to your sleepover? \n\nNTA, since (according to a comment) you only agree to 3 hours, not all day and night.\n\np.s\nyou really doing a disservice to yourself with how you communicated, both in the post and to your sister.\nYou only was to babysit her for 3 hours. you should have said to her \"I'm sorry but i need to go no, I was under the impression I was only to babysit her for 3 hours, and it's been about 11 hours\". none of this self blame or \"forgetting\", this is on her. even if you forget, you did not flake on your promise.\n\nand you should definitely add it to the post! it's a crucial context, it shift the blame from you to your sister. as i said before - you did NOT flake on your promise.", "ESH. Your sister seemed like she overreacted big time. However, you are old enough to be able to manage your time commitments and schedule. You say you have a bad memory - so do something about it. I have a bad memory too, so I keep a calendar on my phone with alerts set to remind me of the event the day before and again an hour before. \n\nYou committed to watching your niece, so you should have followed through and changed plans with your friend instead since those plans came after promising your sister. Since you hung out all day, it shouldn’t have been an issue to just cancel the sleepover or reschedule.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nContext, hi my name is Lily 14yo female, my sister 33yo females, my friend 15yo female and my niece 8yo female. (Also I am one of those persons that forgets everything in one second) \n\nOne night my sister called me and asked me if I could babysit my niece next week because she had to do something and my niece didn't wanted to go with her because it was boring. \n\nAs a good sister I accept but I was a bit tired so I say goodbye to my sister, brush my teeths and sleep\n\n(My sister asked me to babysit her on Thursday and the call was on Sunday) \n\nThe next day was a normal day and I totally forgot about my sister and my niece. I go to my grandma's house to help her ect just a normal day\n\nThen the next day my friend calls me and ask me \"Hey girl wanna hang out at my house on Thursday?\" I totally forgot about my sister so I say \"yes\" thinking I had nothing to do that day\n\nOn Thursday my friend come over to my house spend the day and at night we will sleep at her house\n\nDuring the day my sister drops my niece and I remember I have to babysit her, it's not a problem because my friend and my niece know each other so we just watch movies. (My grandma is with us in the house because I live with her) \n\nThen comes the night and I take my phone to call my sister to ask her if she could pick up her kid because I had to go. I say very calmly with a soft voice \"Hey sissy I'm sorry I totally forgot I had to babysit her but I have to go right now and I really can't stay can you pick her up? Or I can leave her with grandma they're gonna draw and watch movies waiting for you to come\" \n\nMy sister starts yelling at me insulting me and calling me names like \"You freaking b! I told you to babysit her for a f-ing reason! You're so stupid! You can't do anything in life you're useless!!!\" \n\nI start to cry because I'm very sensitive and my grandma takes the phone saying that there's no need to panic and that she can keep my niece while I'm gone because it will be the last time I see my friend before she goes in vacation in another country. \n\nMy sister doesn't listen and yells again so I take my friend and go in her mom's car that was waiting for us in front of my house. \n\nWe had fun me and my friend that night and the next day my mom is a bit mad but it's okay. \n\nSo yeah AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You agreed to babysit for 3 hours and you fulfilled that obligation. Your grandmother was willing to step up since your sister wasnt back 11 HOURS LATER! \nToo bad your sister just screwed herself out of a free babysitter 💅🏽", "ESH. You told your sister you would help her first. You don't bail on plans just because something better came along. You got to hang out with your friend during the day, your friend could have gone home when their mum came and you could have finished babysitting like you said you would. Your sister shouldn't speak to you like that. If my sister spoke to me that way I'd never help her again.", "Pretty sure YTA.  Based on you freely admit that you \"forget everything\" and don't seem to think that's a problem (or you wouldn't be posting here) I'm going to assume that this isn't the first time you've caused problems for your sister in this fashion.  So while she is a bit of an AH for her response, I'm guessing it was building to that for a while.  You can't push people and expect them not to eventually hit their limit of dealing with your nonsense.", ">I have to go right now and I really can't stay\n\nWhy??", "YTA. It’s not your sister’s fault that you forgot you made a promise. I too have a bad memory so when there’s something that I need to remember that’s very important. I put a reminder on my smart phone. Even if it’s just as simple as remembering to take out hamburger in the morning for dinner that night.", "YTA\n\nYou cancelled with her last second and you did it to spend time with your friend. You forget things and you know it, start setting reminders. You're 14, time to grow up. \n\nIt might have been something really important that you cancelled on your sister just to spend time with your friend. Why did you wait until the end of the night to ring her?!?!", "Info: Until the pick up call, did you communicate at all that you had made other plans?", "ESH. I assume she called you on a cell phone? You know, the kind that comes with a calendar app? \n\nYour sister is quite rude tho. You aren't useless, you just need to get with the program and if you forget immediately - write stuff down!!!", "ESH but if my sibling ever said that to me, I'm no longer doing her any favours", "ESH\n\nYou did double book however the way your sister spoke to you wasn't appropriate.  Though your niece is old enough to occupy herself enough so grandma taking over shouldn't have been an issue. To be honest I wouldn't be babysitting anymore, If you want to hang with your niece then do so but don't do favours for your sister anymore.", "ESH. Mostly your sister for taking advantage of you by leaving her kid way longer than expected and being so terrible to you on the phone.\n\nBut you have to figure out a system to help you remember things you’ve committed to. What would have happened if your sister came by to drop her daughter off and you weren’t there because you were already out with your friend? If you’re too tired to write yourself a note, ask your sister to text you the details or call you back the next day. You’re old enough to keep track of your own schedule now. Use your phone calendar, get a planner, figure out what works best for you.", "I'm going to give you a soft YTA, only because of your age. However, in this day of technology, there is not excuse for missing appointments and other committments. I'm assuming you have a smartphone??\n\nYour sister may have reacted badly, but you let her down at the very last minute and then behaved immaturely by not honoring the committment you made to her. \n\nStart using your phone so that you don't forget important things.", "Did AI write this?", "No, my sister does not pay me and she said it was for 3 hours. She dropped my niece at 11 am and went for her at 10 pm which is totally not the time she told me", "See the comments. The sister is the AH. \n\nThe sister asked OP to babysit for 3 hours, left the child for 11 hours, and blew up when OP called her! The situation only became a problem because the sister failed to pick her kid at an appropriate time.", "Yea, calling a child a useless bitch is totally the correct and proper way to behave. Goof point sis", "My sister told me to babysit for 3 hours, she dropped my niece at 11 am and came for her around 10pm. My friend is okay with my niece but not for a sleepover because yk, older kid stuff I don't think she wants to watch ppl getting brutally killed in attack of Titan. + my friend would be very annoyed because it was the last time I saw her she's in vacation in another country and she lives in another city so I need to do a 2 hours ride to see her.", "Because like I said my mom's friend was in front of the house with her car and I can't make her wait there for hours just for my sister to come back", "Who really needs to grow up is OPs sister, who asked her 14 year old sister to babysit, unpaid, for three hours, and then blows up when OP calls her after 11 hours.", "No because like I said I was tired when we made the call and I totally forgot about it because it was 2 days before I make plans with my friend", "She actually called me on the house phone, yk like those phones that we have around the house in multiple rooms? I took the one from my room", "You should add that to the original post. \n\nIt’s crucial that you were to babysit for 3 hours, and after 11 hours, it’s time for your niece to go home.\n\nYour sister is abusing her sister privileges. Enough of this “family helps each other” stuff. She takes advantage of you. \n\nSure, you could have communicated better, but you were to babysit for 3 hours, not 11.\n\nNTA.", "that's a really relevant context op! you were not obliged to look at her at that point.", "This is ridiculous.\n\n1) your sister should pay you\n\n2) she should never have put a minor in this position (this is parentification and abuse)\n\n3) if she says she’s leaving her daughter for 3 hours, she leaves her for 3 hours. A minute longer and you call the police. This wouldn’t fly with a regular babysitter and it shouldn’t fly for you\n\n4) while you should invest in a calendar or diary, it should be filled with things you want to do, as a 14 year old", "OP please fix your post to include the time you were told to watch your niece cause that is important info.", "2nd point was just curiosity, doesn't make you the AH. first point is hugely relevant and makes you not the AH.", "Why was it so absolutely necessary to go with your friend at all when you were supposed to be watching your niece? You made the commitment to your sister first, why did you think it was okay to back out when your niece was already with you? Why didn't you tell your friend you'd forgotten you were supposed to be babysitting and couldn't leave? Why did you wait until your friends mum was already outside to ask your sister if she could pick up her kid? Why, at no point, did you ask your sister what time she was planning to pick her up?", "Also, wtf asks a 14 yo to babysit their child a full day and night? Imo its super wierd. And why isnt grandma babysitting if she is there?\n\nEveryone tellin OP to grow up - she is 14. By definition not a grown up.\n\nNTA but your communication skills are lacking. However, its the adult sister who is TA here.", "What about when she dropped the kid off?", "Yes, it’s a totally different situation. Title should be “AITAH for asking my sister to pick up my niece after babysitting for 12 hours when I only agreed to 3 hours”", "In above comment OP stated it was a 3 hr gig and sister left her from 11am -10pm. Well over the 3 hrs.", "That's the moment I realized", "But is that the moment you *told her*?", "No, I thought that it was only for the morning/afternoon not night and I thought everything was good but apparently it wasn't", "ESH\n\nYour sister shouldn't be derogatory to you but anyone is frustrated by someone who can make commitments, break them, but not use their words.", "But OP was told that it was going to be 3 hours, not untill night"]}