{"id": 34306, "submission_id": "18yb6e0", "title": "AITA for telling my boyfriend not to call me at night?", "selftext": "So me (21F) and my boyfriend (22M) have been dating for almost two years. In the first months of our relationship we used to fall asleep in Discord, and we kept doing that as it was very romantic. Eventually, we dealt with different work schedules so it wasn´t always possible.\n\nCurrently, I wake up at 5:30 in the morning to go to work. He is unemployed, but we are both working on our college thesis. He stays up gaming with his friends or watching series until 2:00-4:00 a.m, and then wakes up in the afternoon.\n\nRecently, he has been gaming more and more, and most days we stop talking at around 10-11 at night. because he wants to go play with his friends. He has even interrupted our activities together, like watching a movie, because he wants to go play. Sometimes it feels like he is not prioritizing the few moments we have together, because I am busy with work and college.\n\n(We do know each other, we have dates every week, we hang out together at school or at our houses)\n\nI have told him that if he goes to play, he shouldn't call me at 2 or 3 am, because I have to wake up early, but he says he wants to sleep with me in Discord. I told him he chooses to do that once he leaves, so he shoud go sleep by himself at that point and not wake me up.\n\nHe says he needs me, he has depression and anxiety, and that I should be there for him.\n\nI tell him to always call me if he is feeling really bad, but most times its just because he wants to sleep with company.\n\nSo, am I the asshole for telling him to stop calling me at night?\n\nEDIT: So I feel like I should clarify things. I don't answer the calls, they don't happen every night and most times I don't even notice them until next morning. That doesn't make it better but at least they don't tend to interrupt my sleep.\n\nSecond, I talked to him about it. I let him know that I was not gonna tolerate him interrupting our activities to go play (something he can do any other time, but not me) and that I wasn't going to let him call me after I sleep. He apologized, said I was right and that he felt bad about the whole thing. Let's see how that goes.\n\nAnd third, he has been a great boyfriend, respectful, not at all controlling or demanding. This issue has appeared in the last couple of months, as he had to quit work to work on his thesis, but now he says he can't concentrate in it and thus the excessive gaming started.\n\nSo thanks everyone for your comments, they have been very insightful and please keep sharing your thoughts!", "created_utc": 1704368461, "permalink": "/r/AmItheAsshole/comments/18yb6e0/aita_for_telling_my_boyfriend_not_to_call_me_at/", "score": 526, "replies": ["NTA- this is basic boundary stuff.\n\n>He says he needs me, he has depression and anxiety, and that I should be there for him.\n\nYou're his girlfriend, not his therapist.", "NTA, he just using you whenever he wants to sleep. I will sleep with him on discord if he wants", "NTA\n\nLeaving aside the various question marks this post raises about the state and quality of your relationship and addressing only the question that was asked - of course you’re not the AH for not wanting phone calls while you’re trying to sleep.\n\nWorking around each other’s sleep schedules is kind of a basic requirement for any healthy relationship, so obviously both partners should respect the other’s need to rest up for work, study, childcare or whatever.  A 2am non-emergency call from ANYONE would be a massive social no-no and a romantic partner should uphold a higher standard of social conduct than you would expect of a random acquaintance, not lower.  \n\nIt seems from your post like the phone calls are just one aspect of a range of problems you’re having with this guy and I’m not going to get into the rights and wrongs of those, but he definitely needs to stop calling you at stupid times and you’re not at all the AH for calling him out on that.", "NTA.  It's not your job to mess up with your sleep schedule to accommodate his game playing and/or his anxiety and depression.  He should get some medical help with the latter and, if necessary, turn off his rig at night. For all that he knows, his lousy sleeping habits are contributing to his anxiety and depression.", "NTA. You’ve set your boundaries, and they seem like fair ones.\n\nAlso, nearly EVERYBODY deals with depression or anxiety at some point in their life. It’s a pretty lame attempt at manipulation.", "NTA - he is ignoring your very reasonable boundaries.", "NTA. He can’t just do whatever he wants for his convenience and shouldn’t use depression and anxiety to guilt trip you into breaking your sleeping schedule.", "Nope.  NTA.  Why does he think it's okay to interfere with your sleep?  Boy needs some coping mechanisms and a lot more respect for you/your job.", "NTA\n\nWhy the hell would he be calling you at 2/3 a.m.??? Even if you didn't have to wake up early, if you're already asleep it makes no sense for him to wake you up just so he can fall asleep, wtf.", "NTA - and, honestly, how much thesis work is happening if he's sleeping into every afternoon and gaming with friends all night?", "NTA. Not at all. \n\nThe ‘I need you because of my depression/anxiety’ is basic manipulation bullshit. I would not be tolerating that. Maybe if he fixes his sleep pattern, stops spending all his time gaming, and gets a job - it could well do wonders in terms of his mental health.\n\nMore fundamentally, you’ve got a mismatch in terms of schedules, likely in terms of lifestyle, and - I’m guessing - in terms of life aspirations. If he isn’t able to get his shit together, I’d be asking myself, ‘where is this relationship going really’.", "NTA, dude needs to learn to sleep on his own.", "NTA his sleep doesn't take priority over yours and if he needs support with his mental health, he should seek professional help and not put it on his girlfriend (who I assume isn't qualified to give him the level of support he needs).", "NTA. It’s his job to find ways to deal with depression and anxiety so that he can sleep by himself like an adult. It’s not your job nor anyone else’s to soothe him every single night.", "What is this sleeping on discord non sense. Have you to even met or do u ever meet?", "NTA. This is basic stuff in a relationship. And you are supposed to help your partner with things. He should understand that you have to wake up early and then go to work as well. If you stay up, it will spoil your mood and affect your health.   \nIf you have been dating for two years, I'm sure you will be able to make him understand that this is not done. From what you're saying, this sounds like he is priotorising gaming with friends first and then talking to you. I did this briefly, but then I got an earful and from then on, always just texted goodnight or sent some sweet text and called the day after.", "He needs to be calling some unemployed person lull him to sleep. I would find a boyfriend more considerate, less needy, without a capital L Tattooed on his Forehead. NTA", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo me (21F) and my boyfriend (22M) have been dating for almost two years. In the first months of our relationship we used to fall asleep in Discord, and we kept doing that as it was very romantic. Eventually, we dealt with different work schedules so it wasn´t always possible.\r  \n\r  \nCurrently, I wake up at 5:30 in the morning to go to work. He is unemployed, but we are both working on our college thesis. He stays up gaming with his friends or watching series until 2:00-4:00 a.m, and then wakes up in the afternoon.\r  \n\r  \nRecently, he has been gaming more and more, and most days we stop talking at around 10-11 at night. because he wants to go play with his friends. He has even interrupted our activities together, like watching a movie, because he wants to go play. Sometimes it feels like he is not prioritizing the few moments we have together, because I am busy with work and college.\r  \n\r  \nI have told him that if he goes to play, he shouldn't call me at 2 or 3 am, because I have to wake up early, but he says he wants to sleep with me in Discord. I told him he chooses to do that once he leaves, so he shoud go sleep by himself at that point and not wake me up.\r  \n\r  \nHe says he needs me, he has depression and anxiety, and that I should be there for him.\n\nI tell him to always call me if he is feeling really bad, but most times its just because he wants to sleep with company.\r  \n\r  \nSo, am I the asshole for telling him to stop calling me at night?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. In a relationship both sides needs to be concerned with the needs of the other, and it sounds like your BF is only concerned with what *he* needs, not you. Your need to be well rested for work trumps his desire to talk to you when he gets done gaming, because gaming is a choice for him. \n\nHe’s being immature because he is expecting you to be available for him on call like a streaming service as opposed to seeing you as a person with wants, needs, and obligations of your own. What about him supporting you?", "Discord sleepover! Count me in", "yes! we try to go out every week, but we still live with our parents so we can´t really have sleepovers. sleeping on discord started as something accidental, like talking late and falling asleep", "If he REALLY needs another person to sleep, he needs therapy not her.", "If you need someone that bad, see a therapist. Don’t rely on a significant other. That will just end terribly", "Do you guys even understand my comment?? 😭 I said that she's NTA, why are you all attacking me???", "lol you aint wrong tho", "EXACTLY!!", "Thanks everyone for your replies! I will definitely have a conversation with him regarding this issue. I have already encouraged him to get professional help with his mental health, and I try to make myself available as his girlfriend, but I do have to look out for myself too.", "NTA, it's completely unreasonable to call someone at 2-3am when they have to get up for work at 5:30. I would have my phone on DND.\n\nHis anxiety and depression is not helped by staying at home and gaming all the time. He needs to go and get a job as that will help with both of those things. It can be that he feels he can't get a job because of those things, but they won't ever get any better until he gets some routines.\n\nI know that if I didn't have a job, I would gravitate to getting up late, going to bed late and feeling crappy but a job forces you into a routine and to stop the laziness coming out. At college age, he may need to just get it out of his system but even a part time job would help.\n\nHowever, he still should not be calling you at that time.", "How does he IMPROVE your life? Does he support you in your thesis and work? Does he cater to your love languages? It sounds like you are supporting his needs while setting aside your own.", "NTA - but what the hell is up with using discord to fall asleep with someone.", "\"we used to fall asleep in Discord, and we kept doing that as it was very romantic\"\n\nOkay, so this genuinely made me LOL. Yes I use Discord but I'm old enough this seems completely nuts. If a friend told me 30 years ago their partner needs them on the phone every night to fall asleep I'd also say that's completely nuts. I did have an acquaintance last year tell me their mother needs to call them every midnight to fall asleep, and I thought that was nuts, too. \n\nNeeding you to interrupt your sleep for a call every night at 2 or 3 AM is such an insane boundary violation, it argues for you dumping this boyfriend just for that. He's clearly sliding into an abyss and you don't want to be dragged down with him.\n\nNTA.", "NTA. Start calling him at 5:30 am so he can get ready w ith you.", "NTA, your bf is a grown ass man, even my 10 year old niece is more matured than him", "Absolutely NTA.\n\nYour boyfriend is acting like a child. He is not entitled to your presence on discord at 2 am. If he wants to fall asleep with you, he needs to adapt to your schedule. \n\nThis is not a crisis every night. This is him acting like a toddler who wants his mommy. Not okay.", "NTA. I'll say it gently cos you sound young but ew, men like this are not a vibe. If he needed you to sleep, he'd change his sleeping pattern to yours, he doesn't need you, he's being selfish", "NTA. Let's just call it out. You outgrew this dude.", "NTA. Also, you WNBTA if you stop being this overgrown game boy's emotional support/sleep therapist.\n\nYou have your own life and education to pursue, ditch this guy, he'll drag you down. The next thing he'll do is threaten self-harm if you don't support him or break up with him.\n\nOh, and he's not \"working on his thesis\", he's playing video games.", "Nta he's a child", "Just turn your ringer off!  Easy Peasy!", "Sounds like you are more engaged in life than he is, and it's bothering you. Don't let others drag you down", "nta\n\nyour bf needs to find a healthy way of dealing with his depression and anxiety. i think it's fine if he needs your support but right now i'm not sure the relationship sounds healthy for either of you. tbh it sounds like... he's taking you for granted or just using you so that he won't be lonely but i honestly don't know that. i don't know your relationship with him, much like anyone else outside of you two. it could just be that he's going thru a really bad episode and will/can pull out of it at some point and start treating you better. at this point you should prolly reevaluate your relationship with him.\n\nand fyi, you can browser and app call at the same time. same thing with mobile and pc. you just can't be in 2 private calls at the same time, one can be private, the other has to be in a server call. if this is something you want to do, he can be muted and keep you in a browser call and then swap back to you on mobile or something when he's ready to sleep so that he doesn't disturb your sleep cycle.", "NTA. \n\nOp, I want you to reframe this for one second to help you understand this. \n\n1. you are not being a good and solid girlfriend to him because you are not waking up in the middle of the night to help him fall asleep after he ditched you to play games. \n2. He is not being a good and solid boyfriend to you because he is asking you to wake up in the middle of the night because he doesn’t want to sleep alone after playing games until three am. \n\nHow is any of this fair TO YOU?\n\nYou work, go to school, wake up at 2-3 am every day so your boyfriend can sleep, then get up at 5:30 every morning to do a billion things. \n\nHe doesn’t work, plays games, sleeps late, and gets up when he wants to and does nothing all day. \n\nChase your dreams, don’t let him destroy them. Or you.", "NTA. I was in a similar position and like so many are saying, it’s not your responsibility to babysit his emotions or make yourself readily available for him- especially since he is leaving you to hang out with his friends while he’s in the middle of doing things like WATCHING A MOVIE with you. \n\nI know you also aren’t looking for a solution but something that helped for me is instead of calling each other on discord: me and my ex created a server where I would just afk in the channel and go to sleep and he would come in when he was ready for bed. I wouldn’t even acknowledge him or have my sound on but just like your bf, knowing I’m “there” was helpful for mine.", "depression and anxiety, yet want to play with friends and you have to work and wake up at 530am. What an @$&wipe...", "Jesus.. this generation 😂 falling asleep on doscord is considered romantic now?", "Waste of bandwidth", "Lolol", "Ii", "Downvoting for discord weeb shit", "That’s okay. He will call someone else 🥶", "I don’t understand the sleeping discord thing but honestly I think you out grew your bf", "NTA and you are not responsible for comforting him like that. He is overplaying the hand he's been delt and your role in his life. He needs to grow up", "So he has depression and you need to be there for him, but only when he’s done playing his games while not giving a shit if you have responsibilities the next day? Maybe he should think why he’s depressed and make some changes on himself. I can already see some of them that would do him good, like growing up.\n\nNTA", "NTA\n\n>He says he needs me, he has depression and anxiety, and that I should be there for him.\n\nIt's not his fault, but it is his responsibility. Also a better sleep schedule could really help him out on that front. Speaking from personal experience, his gaming and staying up late habits could be a symptom of his mental health issues. You should absolutely be compassionate and offer help within your own limits, but at the end of the day he is the only one who can get himself out of that cycle.", "If he \"needs\" to sleep with you, then he needs to go to bed earlier, it's that simple.  If he can't give you that basic courtesy to have a good night's sleep so that you can finish school, then it might be time for a serious sit down conversation about your future together", ">He says he needs me, he has depression and anxiety, and that I should be there for him.\n\nHe needs to be there for you in consideration of your work/sleep schedule. Put your phone on silent, and get a good night's rest.\n\nSo NTA.", "NTA. Y’all don’t sound compatible.", "NTA Call him when he sleeps to see if likes that!", "He needs a job lol too much free time. A job should help with his mental issues...being home all day messes with your head", "NTA- if he’s only gotta worry about school then making time to play games and hang out with you should be the easiest part but instead decides to do it in the evenings he’s gotta fix his schedule a bit more instead of messing with yours", "You're not doing anything wrong, you have to get through to him that if he chooses to hang out with his buddies to do that and sleep or alternatively to choose an early night and talk to you.\n\nYou've given him the space to spend time with his friends and you're both still seemingly on good footing, no reason he needs to end his day talking to you every single time, if he wants time with you has to cut time with his friends on occasion and it's as simple as that.\n\nI'd say it's great that you've given him his own space, but he's the one not respecting yours here, if you set the staple that its time for you to sleep then it's damn well time to sleep.", "NTA- Circumstances have changed and this activity doesn't fit your schedule anymore, that's  life. He should talk to someone about his depression/anxiety too.", "Nta he needs help. I’d dump him", "His therapist should be there for him.  Tell him that sleep affects moods, which it does.  The time of day that you sleep has an effect on your body.  Lack of sleep has an effect on your body.  If he want's to fuck up his circadian rhythms, that's his choice.   He would be considerably less depressed and anxious if he slept more during regular hours. It would stop fucking up his cortisol levels and he might even be happier.", "NTA at all. He’s using you", "NTA. You need your sleep", "NTA, this is highschool shit. Who has time for that", "Date a man, not a child.  Of course you are NTA.", "NTA at all.\n\nHoney, you need to read this: https://www.reddit.com/r/TwoXChromosomes/s/gaLrHtcyQP.\n\nHe doesn't care that his wants interfere with your need to sleep. He doesn't view you as as important as his friends/gaming/sleep schedule. Your role in his life is to fulfill his needs. He doesn't care about your needs.", "NTA\nSounds like you’re not a priority to him.", "NTA. Schedules change over time. Life is funny like that. Why would he wish to disrupt your sleep? Is he kidding.F that idea.", "NTA the mental health thing is weird, youre the gf not a therapist.\n\nAlso, a neat thing with discord is you can be in a private call and public server at the same time! As long as youre logged onto a browser + the discord app, he can privately call you on the browser, mute it and then go into a public server at any time on the app. Then when he's ready to sleep, he can just switch to the ongoing call with you on his phone, granted hes not loud or obnoxious and wakes you up.", "Nta, bf need to stop playing games and go find a job and be more productive. 2-4am, really? Also depressed no wonder... I hope he gets better and sounds like he needs to talk to a therapist. I always tell people that whatever you do, make sure you do it in moderation.", "NTA.\n\n He sounds like the type of boy that will NEVER mature into a responsible adult. Do yourself a favor and dump this loser ASAP!!!!", "You could make a Discord server just for the two of you and put yourself in call when you go to bed, so he can join when he goes to bed. \n\nAnd no, you are not the asshole. He says he has depression and anxiety and yet he's the one interrupting the activities you do together.", "NTA!! but if you’re willing to work a compromise i suggest making a server with just the two of you\n\nthat way you can just stay in the vc alone when he leaves, then you can fall asleep, once he’s back he can join the vc that you’re in without disturbing your sleep!! and he also gets to sleep call with you <3\n\nhowever i still think him prioritizing his gaming over activities with you is a separate problem that needs to be talked about between the two of you", "NTA, and calling your SO to “sleep together” is weird AF.", "NTA and his anxiety and depression will probably dissipate if he gets a job, which at 22 he should have. You need higher standards for yourself woman! There are some minimal standards every woman should have when evaluating a romantic partner, and having a job is important. You deserve someone who has some goals in life, not a boy-man who wasted his life gaming. Don't allow him to manipulate your emotions", "NTA dump this guy", "NTA and huge red flags from your bf. Saying I need you because I'm depressed is super controlling and revealing if the type if person he is. And also no offense but he's lazy af. If you aren't working and your in school it needs to be a full time job not work on ur shut fir acouoke of hours just to play video games all night. When I was in school I'd wake up early and go to bed at a good time. When I wasn't at work or school I was doing homework. Still was able to play video games for an hour or 2 each day. He's gotta grow up big time", "Girl, leave this boy. He is not going to change and these early signs of breaking boundaries are not good. He plays video games until the early hours and has no job. Not good sis", "NTA… but girl why did u ever answer that 2-3 am call, idc who it is i’d switch silent mode on and continue sleeping", "He sounds needy", "When I finished reading I had to go back to check the ages cause I figured you guys were super young. Or at least him. Sounds like you're on another level of maturity. NTA at all. You are being responsible by trying to maintain a healthy sleep schedule and he should honestly follow your lead.", "NTA. You guys are young, so I'm not gonna fault either of you too harshly. That being said, hold your ground. Since he's not looking out for you, you need to look after you. If he really needed you to sleep, he'd go to bed earlier with you :)", "No youre not", "That’s some juvenile bs tell him to grow some nuts", "He’s pathetic", "NTA: he should respect your boundaries", "> Sometimes it feels like he is not prioritizing the few moments we have together, because I am busy with work and college.\n\nIt feels like that because it's true.  He is not prioritizing the few moments you have together.  Also, he's an inconsiderate manipulative asshole.", "NTA\n\nThis whole \"going to sleep together\" thing should be something you did together because you enjoy it not because it's a necessity. If he legit can't go to sleep without you then you need to question whether your relationship is becoming codependent. He shouldn't be relying on you as a crutch to go to sleep and even waking you up for it because that's not an equal relationship, it's a relationship where one person wants the other to accommodate all their needs.\n\nIf he legit has problems because of anxiety and depression then he needs to get help so he can learn coping mechanisms.", "Eventually he might start threatening suicide if you don't take his calls, or if you try to end them. He cannot call you at 2 am and you cannot be his distress line.  Set firm limits now. End it if he cannot comply.", "Cringe", "If he wants to fall asleep with you, if he needs your presence, he needs to do it on your schedule.  If he can't do this then he is not participating in a partnership, he just wants everything his way.  Set the boundary and put your phone on privacy.\n\nNTA", "NTA\n\nI have anxiety and depression and it does not mean I can do what I want and my family can’t say no. If I can’t sleep that is something I must deal with. I can’t wake up the whole house. That would be mean and selfish. \n\nHe is using an illness for his own gain and honestly that makes me angry.\n\nAnd if he wants to take care of his mental health I promise you that the way he is living his life right now will make both A and D worse.\n\nWith this illness one needs routine, sleep at night and have a day routine. To just hang around and stay up all night will make it worse.\n\nHe has no right to wake you up and you are right to say so.\n\nSince I struggle with A and D myself I get so upset when people do shit like this. \n\nSet a boundary and if he does not respect it, then cut him loose, because he will not change.\n\nHe is AH - and yes, people with A and D can be AH just like everyone else.", "NTA, say goodbye", "Nor his emotional support animal", "If he loved OP, he'd consider her needs. But he only considers his own.\n\nOP, this is not love. He wants you as an emotional support animal, on his terms. He wants you when he wants and if that fucks you up, well, in his mind, he comes first.\n\nHe's telling you who he is. Are you listening, OP?", "[removed]", "Girl this comment was it !🎉💯", "Fr.\n\nMy partner & me both are heavily dependent (both have dependent personality disorder f.e) on each other. \n\nFor us? It's perfect. But we certainly know that it's not healthy & we're also always openly communicating. (F.e \"don't help me with phone calls or either I'll always rely on you for it and get unable to do so independently) and in therapy\n\nBUT we both got to decide if we're alright with being somewhat responsible for each other & it was a enthusiastic yes from each of us.\n\nThere aren't many things as terrible like being responsible for an other individuals happiness.\n\nDoes he have help? Like, does he get treatment for his problems?", "[You make me do, too much labor.](https://youtu.be/jvU4xWsN7)", "She's his ticket. He's gotta do whatever he can to latch on.", "Can I come too?", "Well said. I'd only add for OP to set their phone to do not disturb.", "That's it exactly. There are plenty of studies around inconsistent sleep and the connection to mental health.", "It sounds like their relationship is entirely online. This isn't that hard to imagine if you're familiar with how people in these relationships tend to act.", "Put your phone on Do Not Disturb before going to sleep.", "I hope everything works out for you. I was in a similar situation once. Please look out for yourself.", "Please update after the conversation!", "Similarly, one of my partners is longishdistance right now and he'll sometimes fall asleep with me or our boyfriend in a discord call. We just have a private server we use for it so that we don't have to answer a call if asleep, and it won't disconnect if someone leaves for a few minutes. \n\nBut yeah, totally agree, fixing that isn't fixing the issues here.", "Yeah probably not someone who's working and has a healthy lifestyle and sleep pattern though. Either way at some point he will have to learn coping mechanisms for his anxiety and depression himself. No one in the long run will allow him to prioritise his needs over theirs.", "LOL! You almost beat me to it. I was going for emotional support human....no leash needed!", "Some wild assumptions bro. They were both happy with the situation before, now things have changed and they just need to adjust lol. Wild to hear “yeah we used to sleep together daily because it was romantic” and still think “nah he just sees you as an animal there’s no love there” lol. Like not everything has to be a world-ending red flag my friend.", "Me too! Best part is i have alarms for the morning and they are loud 😈", "Too much gaming doesn't help MH either.  It can be the root cause of anxiety and depression- mostly due to disruptions of circadian rhythms- much like working night shift.  Blue light from screens exacerbates this.  NTA", "I can understand falling asleep through discord, that's not the bit I didn't understand.\n\nBut she's already sleeping. There's no justification to call someone who's already sleeping just because you want to fall asleep with them. And this is true for online or in presence lol", "You’re 21 and your parents don’t allow your boyfriend to stay over?? wtf is wrong with your parents. You should move out", "No leash *needed*, does not mean leashes are out of the question.\n\nI'll see myself out.", "Sleep is a fundamental biological need, and he doesn't care if she sleeps or not. That's pretty dire if you ask me.", "Prove it or i call Shenanigans 😹", "it is kind of a cultural thing, i'm not from the U.S and it is not 'normal' for young couples to sleep together at parent's houses in my country. I have to say they are pretty chill in every other way, we have slept together away on vacations. \n\ni can't really move out yet as my parents are still paying for college and my job doesn't pay enough for me to cover both school and life costs.", "I’m 21 and I’m from the U.S. I live at home and contribute to bills while being in school, but I’m not allowed to have sleepovers either😅. Sometimes it’s about your parents rules lol.", "“or maybe even desired”", "Does he not care if she sleeps or not, or is he being obtuse and desperate because he’s afraid of feeling alone?\n\nThere’s no reason two adults shouldn’t be able to work this out, if he has anxiety then they can come to a better solution than “either stay on call or break up.”\n\nThe fact is this sub lacks any creativity whatsoever when it comes to dealing with issues like this and always just goes straight to the nuclear option. It’s like 90% of the time that even the smallest issues are treated as complete deal breakers. It’s honestly just sad, even sadder because half of y’all probably look at divorce rates and lament as though your attitudes aren’t part of the problem.\n\nI mean, what’s wrong with a few sessions of couple’s therapy, and a pillow gift to sleep with? Is it really that hard to imagine an amicable solution?\n\nAnd the saddest part is the complete lack of nuance. Even if this is a deal breaker for you personallu, saying that OP’s partner views her as an “emotional service animal” based on a couple lines of text? I mean what kind of opinion even is that? Can you guys voice even a single concern without doing so in the most extreme and derisive way possible?", "U daring to sleepover with Mee 😂", "Bruh that’s crazy. Your parents shouldn’t be able to control you like that.", "The more reasonable solution is going to bed earlier is he wants to go to sleep with her. He can't do both, game with his friends until early morning, and be with her before going to sleep. \n\nNot everything is about finding a compromise between two people. She doesn't need to compromise her need of sleeping so he can do what he wants, when he wants. Sometimes, just one people need to decide what is most important for them.\n\nSo he has to decide: game with friends for not so long (or game earlier) and go to sleep with her girlfriend or game with their friends until whatever hour he wants and go to sleep without bothering her.", "She has asked him not to do it and she has explained why.  At that point he is not \"being obtuse\".  He's showing her that he doesn't care about her needs.", "Ehhh they’re not controlling at all. With my most recent boyfriend, he had his own place and I would spend the night at his many times. Some parents just have different beliefs about spending the night under their roof.", "The parents get to decide who sleeps in *their* house.", "It’s hilarious you guys actually think this is solely about his sleeping habits and not separation anxiety + a lack of ability to adjust to new routines. You avoid couple therapy like the plague calling it “unreasonable” in comparison to breaking up when OP and her partner have already made it quite clear they need help in their communication. You think OP is really better off coming here and listening to us dolts telling her to break things off, rather than the two of them spending an hour of their lives to work out their emotional detachment issues with an unbiased professional?", "Nta. It's called turning off your ringer, sound notifications on discord, and only leaving the volume up on your alarm.", "NTA\n\nI've always believed to care about someone is to care about things that are important to them and their health. \n\nI would prioritize my partner getting a healthy amount of uninterrupted sleep without sacrificing their livelihood or studies. That's just being supportive. \n\nSleep is crucial, a lack of can cause a domino effect in your life and could lead to developing some mental health issues of your own or worsening pre-existing issues.\n\nIf you want more time to interact with him for your own emotional fulfillment maybe you can get some calls in during commute, between classes, possibly on your lunch.", "How old are you? 13? Why are you even asking this", "He may need therapy if it’s a real dependency issue. Does he show any other controlling behavior?", "NTA. Everybody has the right to decide how and when they want to talk to anybody, and that does not imply you are enforced to meet others requirements.", "NTA. Calling someone three hours before they have to get up for work is not a reasonable expectation. If he can't get in line with your expectations (which are reasonable) then I don' t know if you will stay involved.", "If you want to do discord calls you can set up a server just for the 2 of you and communicate times in advance of when you want to sleep in call. If you're on the server you should be able to hang out in a channel by yourself and then he can join the channel when he's ready.", "As someone who used to be addicted to gaming, this is how it started. Cut out one activity to work on another, couldn’t focus on anything except the game. Started opting for games with friends over time with the boyfriend on most days, and eventually 18 hours every day of FPS’ and sleeping 6 hours from 4 to 10.\n\nI’m not saying this is what’s going to happen, but if you could gently try to guide him to generally farm less dopamine from video games, it’ll help both of you out in the long run", "Break up date us.", "Crazy how close your relationship is similar to mine. I’m about to be 21 and my boyfriend is 22. We’ve been together for 2 years. I go to work at 5:30 am as of recent. And my boyfriend stays up playing  games. However. It’s not as bad as how you described your boyfriend. He doesn’t have a job because he’s going to college for a technical cert as of right now. He’s on break. He doesn’t call me because he knows I have to sleep. But I understand where you’re coming from. No you’re not an asshole. Simply where your priorities lie, don’t lie where his is at the moment because he doesn’t work. However I think he wasn’t respecting the fact you have to sleep. Whether intentional or not. And from your update, it seems you fixed the problem. A relationship isn’t about who’s the asshole and who’s not. You work through boundaries and fix issues within the relationship. Me and my boyfriend were unhealthily attached in the beginning. Since then we have calmed down. We don’t talk as much as we used to because of my work and we both do school. But we talk when we can. I think just respecting each other’s time was all this was about. He definitely needs to fix is sleep schedule and learn when to call it quits at night. (I struggle with that on the daily. I just get sucked into the game)", "NTA you need sleep and he's calling you when it's convenient for him AFTER he's been with his buddies and AFTER gaming and AFTER anything else. he's priioritizing HIS needs and being slefish. you say he's admitted to this so fingers crossed?\n\n&#x200B;\n\nI used to call me in the middle of the night if she had a disturbing dream which was once a week at least. at one point, after we had had 28 days of straight rain, she called at 2 am to ask why she had a dream that the parking lot behind her building was flooding. that year for xmas some mutual friends got me a relaxation tape with the title \"call of the mystic loon\" I've rarely laughed so much about a tape. still have the tape, the girl is long gone", "INFO: Over the two years of dating, how much time have you spent in the same room as this person?", "Dudes interuppting sleep\n\nOh helllll nah. Tell this buster what the cut off time is hahahahaha", "NTA, sounds like your boyfriend could benefit from some counselling", "NTA - I’m also a depressed guy with a gaming addiction and I know very well that sometimes my priorities get mixed up and if I don’t watch out my behavior I start gaming more and more until it’s pretty much the only thing I do.\n\nIt’s very difficult to coexist with an addiction without relapsing, but with time you get better at recognizing what’s happening and stopping it earlier.", "NTA but if this is new he might be having a mental health crisis.", "He doesn’t sound like a winner.  \nIf you have kids he’s probably not going to the dad you’ll need", "NTA, mans quit his job to work on a thesis he isn't working and is actively making choices that get in the way of it. He's on a path of self destruction and is on a path towards becoming a neet. \n\nOP is still moving forward in life and is setting healthy boundaries. He is responsible for his own emotions and actions not OP.", "If he wants to sleep with company then maybe get a job, get a place and sleep together", "Sounds like he has a sensory addiction.", "NTA- u need to create boundaries", "NTA seems like he’s procrastinating lol", "Dump this guy I promise you can do better", "2nd shift workers across the world support you", "Nah I didn't even finish but he's being wack you're NTA.", "Nta.  He can choose gaming with his friends or spending time with you and falling asleep together.  Not everyone gets exactly what they want to do every minute of every day.  \n\nWhat a selfish person to say “no!  That’s not how it works!  I get to game with my friends and ignore you when I want to ignore you, but then when my friends are all gone and I decide to stop ignoring you, you better be there for me!”  \n\nAnd him acting like you owe this to him and using his depression is manipulation.  You know what doesn’t help depression?  Gaming till all hours of the morning and An irregular sleep schedule.  It is a distraction that makes him feel good in the moment which is why he likes it.  And then moment it’s gone - it’s onto the next thing that distracts him.", "Your boyfriend seems to have entered a bad place in his life. I’ve been there. No job, always gaming and acting like a baby. This is what modern depression does to a man. I know it is not my place to say it but he should try harder to fight with his anxiety/depression. I got over them by fighting them and there is no other way around. Sorry in advance if I offended you but I think he needs to hear this", "Quits work to work on his thesis, now games 15 hours a day and calls you at 2 am. Probably on his parents dime too\n\nI know how this gonna end.\n\nNTA", "Personally, I'd say fuck that guy.\n\nI **HATE** mfs who try to use mental health to guilt trip people into doing what they want. Fuck him. Selfish bastard. NTA.", "i swr reddit is so detached from humanity sometimes. if ur dating someone their emotional wellbeing is part of ur responsibility. imagine ur SO comes to you and opens about anxiety and says they wwnt to be w u and ur first response is i am not ur therapist like wtf????", "Count me in.", "Have bipolar and staying on a consistent sleep schedule has been one of the important things for me to be functional. Good sleep, at the same time every day, makes me a little less crazy. So do the meds. \n\nYour boyfriend slept without you being on discord before, he can survive now. Codependency can be a big problem and should be addressed.", "wow yeah crazy, my boyfriend also quit his job because it was taking too much time off college. now we have to work through this schedule and sleep issue", "certainly a lot of time, we try to see each other every week, we have dates, we have spent days with each other families, we hang out at school, gone on vacations, so yeah, a lot.", "Imagine having enough life experience to know that an overly-needy SO doesn't become *less* needy if you reinforce the neediness.  Imagine dating someone who knows how to take care of their own shit and doesn't make you do it.", "it is not entirely online, we see each other every week, once at least. we live in the same city, we hang out, we go out. its just maybe we are too attached so we like to talk at night and tend to fall asleep", "OK. Pretty much everything in the post sounded online, so it wasn't immediately obvious if this is just an aspect of an otherwise in-person relationship, a couple doing long distance, or an online-only our-lives-are-entirely-on-Discord kind of deal.\n\nNTA. You're setting reasonable boundaries, and it sounds like you spend a reasonable amount of time with your boyfriend for a person who is both working and working on a post-bacc. Your boyfriend's \"depression and anxiety\" (diagnosed? or self-proclaimed?) are not yours to solve at 2am.\n\nIf diagnosed, he needs to seek actual treatment. If self-proclaimed, he needs to seek actual diagnosis.", "He said he needs to sleep \"with company\" but means over a video call lol. Total product of the generation that grew up with social media. Connections aren't even real anymore. Future's gonna be full of weirdos and sex bots", "Not as loud as my snoring during the discord sleepover", "What?  Yeah, some parents don’t allow their kids to lay up with a boyfriend in their damn home.", "SNORE BATTLE", "It’s not just cultural.  In the u.s., plenty of parents would not be having this.", "You are on point and i agree. But 21/22 year old persons sometimes still learn to acknowledge their own feelings. Talk through it some times.\nIf this does not work for you because your partner did not yet learn to care for a spouses feelings yet, spare the couple therapy for coming partnerships and take care of yourself for now. Heads up! We all have to cope with emotional misunderstandings.", "You can't snore more!! Especially if there is some alcohol involved!!!", "I can too!! I don't need alcohol", "Not if you’re paying to live there and contributing to bills.", "If his anxiety is such a problem that he needs someone to be able to sleep, he needs therapy for him, not deprive her (or anyone else) of sleep.\n\nHis anxiety, and his lack of ability to adjust to new routines are not couple therapy problems, they are his problems. And she is not his therapist.\n\nShe doesn't need to adjust to his gaming routine, she has a perfectly healthy routine for her work and study schedule.", "> not separation anxiety + a lack of ability to adjust to new routines\n\nHe's the one who made the new routine.  So his inability to adjust to it is a him problem.", "Damn, you sound fun! \n\nCan you imagine how cute is a snoring girl that won't let you sleep? Haahahahahah", "Still their house", "Or he should lay off the gaming, exercise more, and get a better sleep schedule. This is much cheaper then therapy, if this doesn't work consider therapy.", "NTA - but OP, is this what you really want?  You and he seem to be at different stages in life.  Have you ever met in person? That changes a lot, too.", "NTA…it’s good you’ve set boundaries just make sure you stick to them! \nThere is no reason he’s staying up all night to play video games and NOT working, thesis or no. I could understand reducing hours at work or switching jobs in order to accommodate the time needed to work on his thesis but quitting to play video games? Um, no. And…yeah, that’s what he did if he’s not actively working on his thesis!\nI just hope you aren’t financially supporting his current endeavors…\n\nRegarding your request that he doesn’t call you while you’re sleeping, this is PERFECTLY REASONABLE. The ONLY reason to call you would be for an emergency. PERIOD.\n\nAs for trying to GUILT TRIP you with his mental health issues…he needs to speak to someone and get proper help. Which as his concerned GF I’m sure you fully support him getting the help he needs…hint, hint 😏", "Bro you sound like the problem, your even typing with attitude time to rethink how you act and are truly as a person cause it bleeds through the text", "NTA.  You may have feelings for him, but he is NOT a \"great boyfriend.\"  If he was a great boyfriend he would have his ass up out of bed at a reasonable time in the morning, looking for and keeping a respectable job.  Earning money.  Not staying up all night and sleeping all day.  And interrupting your rest when YOU \"are\" getting up very early in the morning to WORK.  And then working on your college thesis.  OP he is lazy.  That is not a good character trait for a partner to have.  I'm guessing you are young, so you are following your heart.  Try to disconnect the feelings though, and take a look at what he is actually doing.  It does not bode well for an actual sustaining relationship, unless you are willing to be the breadwinner and allow him to be a deadbeat and a bum.", "Nta", "I'm not going to weigh in on this with a judgment but my previous relationship was LDR for several years so I understand the whole sleeping in call.\n\nIf it's because he likes the sound of you breathing/ makes him feel like you're there. Why don't you two make a Discord sever where it's just the two of you? You can go into a voice channel when you're getting ready to go to sleep and he can join it whenever.\n\nThat's what I ended up doing when I didn't want to wake my partner up or vice versa.\n\nEither way, good luck to you!", "Yep he seems to lack discipline. He quit his job to write his thesis, but that’s unstructured and despite being an adult, he’s unable to structure his own time. Writing the thesis is boring and hard work and instead of buckling down and doing it, he’s just not. But now that he’s got all this free time from not writing the thesis, he didn’t go back to work either. He’s just hanging out enjoying his free time gaming all night. Like a child. \n\nMeanwhile OP is continuing to work AND do her thesis, so her time is limited. He’s the one with the flexible schedule and he can’t accommodate hers. What a jackass. \n\nI mean who wouldn’t want to kick it all day? Except, you know, people who need to work to live. “Mental health” is not an excuse for bad behavior. \n\nHe does not seem like a winner.", "This is so fantastically salty and I'm ashamed I didn't think of it. 🤣👌🏼", ">Your boyfriend seems to have entered a bad place in his life. I’ve been there. No job, always gaming and acting like a baby. This is what modern depression does to a man. I know it is not my place to say it but he should try harder to fight with his anxiety/depression. I got over them by fighting them and there is no other way around. Sorry in advance if I offended you but I think he needs to hear this\n\ni agree! he needs to hear it, i've told him", "No, but it's currently full of folks like yourself who don't read. They often hang out and have dates, they just ALSO have this extra form of connection that they enjoy."]}