{"id": 34302, "submission_id": "18y942r", "title": "AITA for picking my dog over my long term partner?", "selftext": "I have (F26) have been with my partner for just over 5 years, \n\n\nBefore we were together I went NC with my family (a whole other story) as part of this I had to leave my Dog behind, my parents claimed it was ther dog as they paid for him and the food etc and would not allow me to take it, this caused me massive separation anxiety that therapy has helped with, but I decided I would never have a pet again. \n\n\nWhen me and my partner met we both agreed that we wanted to be child and pet free. \n\n\nI have recently had a call from my family saying that my parents are unwell and aren't able to look after my dog, no other family will take him, so I obviously agreed to take him. \n\n\nMy partner is pissed, he hates dogs, I told him that I'm not giving up my fur baby and he either needs to accept him or move out. \n\n\nHe is now staying at a friend's and is refusing to pay his share of the rent. \n\n\nI think this is justified, a couple of years ago he came home with a goldfish out of nowhere, it caused a big argument at the time but we got through it, I told him this is no different and he needs to accept it.", "created_utc": 1704360481, "permalink": "/r/AmItheAsshole/comments/18y942r/aita_for_picking_my_dog_over_my_long_term_partner/", "score": 428, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am I the A for picking my Fur Baby over my partner of 5 years\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "While it is entirely reasonable for you to be thrilled to have your dog back, you have broken the agreement you had with your partner. You might have said \"I agree to no dogs (unless my parents give me back my dog)\" but he probably only heard \"I agree to no dogs\".\n\nEven if you have the lowest maintenance, best behaved, most angelic dog that there ever was, bringing a dog into the household for more than a weekend is a major change that deserves discussion and input from all members of the household. It's not a surprise that your partner has moved out and isn't paying rent and it won't be a surprise when your partner breaks up with you and comes to get all of his stuff.\n\nYou got upset and caused a big argument when he brought home goldfish. Goldfish don't cover everything in fur, need to be let outside at 3am, cost $100 every 3-4 weeks to feed, need to be walked daily, brushed etc. Him bringing home fish and your bringing home a dog are not the same and to suggest that they are, insults the intelligence of your partner.\n\nYou're N T A for picking your dog over your long term partner, but YTA for the whole way you went about this.", ">I told him that I'm not giving up my fur baby and he either needs to accept him or move out. \n\n>He is now staying at a friend's and is refusing to pay his share of the rent. \n\nYou gave him the option to move out, he moved out, and now you're pissed he's not paying rent?\n\nAnd I'm sorry, but there's a big difference between a dog and a goldfish. And it sounds like you blew a shit fit over the goldfish, but now expect him to be fine with a dog? A dog you haven't even seen in 5 years? You're delusional. Oh, and YTA.", "You gave him an ultimatum. Accept an animal that he hates living in his home with you KNOWING that he hates them and choosing to bring one in anyway, or leave. He left. \n\nNot sure what you expected the outcome to be, but you made your bed. Time to lie in it. Hopefully the dog fulfils all of the relationship needs that you had of a partner of five years cause I'm pretty sure he ain't comin' back.\n\nI know I wouldn't. YTA. And also more than a bit stupid if you thought you'd get a different result.", "YTA\nJust cause you expect him to pay rent after YOU brought a dog back, YOU ask him to move out, he did. Now he has to pay rent? Why?", "A goldfish is not even remotely the same thing as a dog. I find it very hard to believe that you genuinely think that's the same. Goldfish don't make noise. They don't need to be walked. They don't shed etc. Pretty much all the potential things that would \"bother\" someone who doesn't like pets obviously don't apply to goldfish. Why were you even mad about that? Because *technically* it's a pet? Seems irrational. \n\nI think your partner has the right to be upset considering you agreed to be pet free, and you suddenly changed your mind. You have the right to do that. It's a unique situation. You love that particular dog and the only reason you were pet free was because you couldn't have YOUR dog. Now you can have him, so you want to keep him. I get it, but I also understand why he's upset. I wanna say YTA not because you want to keep the dog, but more because of your attitude. \"Well he brought home a goldfish, so he broke our agreement first. (silly comparison) And I'm not giving up my dog (that I agreed not to have at the start of the relationship) for my boyfriend that I've been with for 5 years. If he doesn't like it, he can leave.\" Did he know that you loved that particular dog, and you only agreed to be pet free because you couldn't have YOUR dog, or did he genuinely think you didn't like dogs at all and therefore never entertained the possibility of you guys ever owning one? Did you try talking to him and explaining why the dog is so important to you? It doesn't sound like it, but if you did you should have added that to the post to make his \"jerkiness\" more clear. Either way, I understand why you want to keep a dog that is special to you, but it doesn't sound to me like your BF is the AH or that he's a hypocrite because of the goldfish thing. You're NTA for wanting to keep the dog, but your attitude kinda makes you sound like one.", "You're NTA for wanting to take in the dog. \n\nYTA for everything else. A goldfish is NOT the same and a dog and you both obviously don't respect each others feelings at all. Get your dog and move on with your life", "If you want the dog you should break up with your partner. \n\nYou agreed to be pet free, and therefore are crossing a boundary. YTA\n\nPeople may think your bf is an AH but he made it clear he doesn’t want dogs and you went against one and brought it into your shared home. I wouldn’t pay rent either. Your dog should pay rent since you picked him over your partner", "YTA but not for picking your dog over him. I would have done that as well, but expecting him to be okay with it and continue paying rent in a no longer pet free home is unreasonable. Comparing a dog to a goldfish is also silly. He’s not in any way obligated to accept your dog and he’s not unreasonable for leaving.", "> When me and my partner met we both agreed that we wanted to be child and pet free.\n\n> My partner is pissed, he hates dogs, I told him that I'm not giving up my fur baby and he either needs to accept him or move out.\n\nYes, YTA for going back on your agreement.", "YTA for asking him to pay rent after asking him to move out. Also, this relationship is over.", "YTA, Im a dog lover and understand where you are coming from. But why wouldn't you discuss this from him? especially after you made an agreement to be dog and child free. If he came home with a child you wouldn't be too happy...\n\n&#x200B;\n\n Edit: I missed the bit about the goldfish, a goldfish needs minimal care and attention compared to a dog, which is as you say a fur baby and will need constant care and attention.", ">I think this is justified, a couple of years ago he came home with a goldfish out of nowhere, it caused a big argument at the time but we got through it, I told him this is no different and he needs to accept it.\n\nYTA just for this \n\nA goldfish is in a bowl, it doesn't leave fur everywhere, chew your stuff or pee on the carpet. \n\nI love dogs, but to claim they are the same level pet as a fish, is just silly!", "Imagine if he came home and said \"honey I found out I have a 6yo kid from a previous relationship, I know we said we'd be child free but they are going to live here now because it's my baby and I have an emotional connection\" and when you then say that you don't want any kids he then retorts with; \"Then you can move out, oh and btw, you still have to pay rent\"\n\nThats a better comparison then a goldfish which is decorative (with a little care ofcourse) \n\nYTA. You took the dog in, you said if he didn't like it he could leave, he called your bluf and did indeed leave. Shouldn't have said that if you didn't want him to leave. And not paying rent when he doesn't live there is no more then logical", "YTA\n\nYou can't unilaterally decide to move a dog in, knowing that your partner hates dogs, demand from your \"partner\" to accept this or move out and when he does move out expect him to still pay rent?\n\nExtra-yta btw for calling your dog fur baby, that's so urgh.", "YTA. You gave him an ultimatum. He chose to leave. You don't get to be mad, because he made the choice your didn't want him to make. You broke the agreement. If you didn't want him to leave you should have not brought the dog into your house. Plus it's not your baby, it's a DOG.", "I mean, you already gave up your \"fur baby\" when you allowed your parents to claim ownership. If you really wanted him, you would have done whatever it took to keep him.And then you vowed to never own a pet again and you and your partner formed a relationship where that agreement was in place.\n\nIf I was in a relationship for that long and my partner said \"it's this dog or you\", I'd feel pretty shitty.\n\nAlso, you're comparing a GOLDFISH to a DOG? That's stupid.\n\nYour partner has every right to be furious, you chose a dog over him. You should move out, not him.\n\nYTA.", "NTA for choosing your dog. But YTA for accepting the dog without talking to your partner. As well after you both said you would be a pet free.\n\nYeah the relationship seems to be over. But the two of you should have a talk. Especially of moving out and paying rent. The two of you should have lease and depending on who is on it, what are the time periodes to end it, what it says about pets it is a different situation. But you should not expect your partner to pay for a flat he is not living in anymore, anymore than he has to pay legally (and even then he might would look into loopholes to get you kicked out or at least the dog for the remaining time of the lease)", "Looks like you both need to move on, over a dog and a gold fish.", "YTA\n\nPurely based on the fact that you made the boundaries and rules with your partner quite clearly prior to chosing eachother as partners. And now instead of admitting to him that you are reneging, you are only willing to see your motivation for doing so, and not understanding how that in and off itself doesnt alter the fact that YOU are the one crossing the boundary you two firmly established together.\n\nYou have no right to the surprised pikachu face. YOU changed, not him. He is the one who is betrayed.\n\nFor what its worth, I'd do the same thing as you have, and taken the dog in. BUT unlike you, I wouldnt be refusing to admit that I was making a change that I knew he wouldnt be able to live with, - and I would have apologised to him as well, to make sure I wasnt behaving as though his feelings were not valid. As someone who would chose a dog over a human however, I find it very disingenous of you to compare one to a gold fish. I mean come on\\`?! - If this is how you've been acting with regards to these discussions, you are being absolutely obnoxious.\n\nOn top of that, you are now behaving like a child concerning the fact that YOUR choice has consequences - and not just random ones, but absolutely consequences you'd know were coming, - such as him moving out - and you want him to compensate rent, so your consequences arent really going to fall entirely on yourself? YOU CHOSE THE DOG. You dont get to eat the cake and keep it too. Stop being ridiculous and grow up, especially if you want to make serious adult choices. Its not reasonable by any stretch of the imagination, that you not only get to renege on your relationship boundaries, but he has to grin and bear it, so you can afford the flat he is forced to move out of on top of losing his relationship in this manner...?\n\nYTA", "How can you even compare  goldfish with  dog? Slightly AH for that dumb comparison and for not being more understanding about your boyfriend's feelings. Other than that, there are no asholes, they just want different things and therefore are now incompatible. NAH.", "YTA. \n\n1. Did you even discuss it with your partner before making the decision to take the dog?\n\n2. a goldfish is not comparable to a fricken dog. seriously, do you think those two are anywhere near equal??", "NTA  about the dog but I think your relationship was on borrowed time from day one . If a goldfish caused a huge argument neither of you is mature enough to maintain a relationship", "YTA through and through.  A goldfish is not in the same ballpark as a dog.  Throwing away a great relationship with a human for a dog you haven't seen in 5 years i insane.  And Reddit's collective belief that dogs are better than people is dumb and weird.", "YTA. The only person that you're thinking of is yourself. That's not how a healthy relationship works. People talk to each other and communicate. Then they find a solution that everyone can live with. Not expect one party to abide by what the other wants just because they want to be selfish.\n\nAnd yes, there is a difference between a fish and a dog. Fish you can just feed once a day and change out the bowl/tank once a week. Other than that, no care required. Dogs need to be fed, walked, brushed, played with and watched constantly to make sure that they don't make a mess. Constant care is needed. BIG DIFFERENCE.", "This was his home too and You gave him the ultimatum of take in the dog or kick him out, knowing he didn’t want a dog, idk what else you expected. YTA for that. Sounds like you got a dog and lost a boyfriend. I’d suggest finding a roommate ASAP to cover rent, he’s not going to pay rent when you’ve asked him to leave and there’s no reason he should. (This coming from a huge pet person who’s 14 year old pup passed last weekend)\n\nAlso goldfish is nowhere near the same as a dog. They stay in a tank and require minimal caretaking with no sounds or messes to disturb you, as opposed to an aging dog.", "YTA and not for the dog issue, but for telling him to move out and thinking he would still help you with rent. I believe as soon as someone moves out/get told to move out you shouldn’t expect them to help with any bills.", "Are you seriously comparing a dog to a goldfish? YTA over and over. \n\nWhat you claim to be your dog is not even yours. It’s simply because nobody in your family can take care of it and you’re helping. There’s many different ways to go about. Family friends, friends, whatever. It’s clearly your family that has issues. You shouldn’t even have take it without your partner’s consent. \n\nObviously 5 years relationship is not a big deal for you. I absolutely agree to him not contributing to rental and all. Until you open your eyes and see who is the one that has truly been staying by your side.", "Lol at you comparing a dog to a goldfish. YTA.", "Yes, YTA, and if you truly can't see the difference between a goldfish and a dog, I feel sorry for your bf. You agreed to no pets, and you know your bf doesn't like dogs. You can certainly take your dog back if that's what you want to do, but you have no reason to be upset with your bf for moving out and ending the relationship.", "If you wouldn't let him have a goldfish, then yeah, I think it's a bit hypocritical in your \"no pets\" rule to have a dog. A goldfish is basically no hassle for the person who isn't responsible for it (and less hassle than a dog even if you are responsible for it). There's no way to live in a house with the dog and not interact with the dog at all. If he hates dogs and you now have a dog, then yeah, you gotta break up.", "YTA", "This is a hard one. I would probably break up with someone who didn't want me to have my dog or suggested I take it to a shelter because It obviously means we're vastly different people. \n\nBut you did agree to no pets or children so I understand why he's annoyed, soft YTA.\n\nLife happens. Keep your dog. Break up with him.", "Yep.... YTA.\nIt was not your dog... it was your parents dog, remember?", "NAH, you just don't belong together. It happens, life goes on. He wanted to be pet free (or at least the animal he hates free), you agreed - so when one of you wants to break the arrangement, it's understandable for the other to decide to end the relationship. \n\n Just because you could tolerate a goldfish doesn't obligate him to agree to live with a dog. It's a completely different commitment, you realize. If you don't want to deal with the fish, you can completely ignore it and even not notice it, but that doesn't apply to a dog.", "YTA. You explicitly agreed and told him that you would be pet free. Then suddenly you change your mind with little to no notice. How hard was it for you to mention that dog to your partner? For 5 years you couldn't be bothered to tell him?\n\n>I told him that I'm not giving up my fur baby and he either needs to accept him or move out. \n\nYou basically kicked him out and is now surprised he doesn't want to pay for rent? Why should he pay for rent for a place he's been pretty much kicked out of? \n\n>I think this is justified, a couple of years ago he came home with a goldfish out of nowhere,\n\nA dog and a goldfish are very different. Did he kick you into because of a goldfish? I think not", "Let's reverse the scenario. He comes to you and says \"I found out that I have children and their mother is very sick and cannot continue to care for them\". What would be your response? If you would say that he handled it correctly by saying you can either deal with it or leave with zero discussion then you have your answer. Something tells me that you would do the exact thing he is doing. You had an agreement; child and pet free. I think he made the correct decision and I believe he dodged a bullet if you are willing to so easily throw away a 5 year relationship. Also, you can't have it all. You are free to make your decision, but so is he. \n\nYTAH", "NAH. You both apparently just don't care for each other that much. It's okay. Move your separate ways.", "YTA\nWell, you changed, he didn't. You should move out to care for your dog if that's your choice. Why do you expect him to leave and still pay rent?", "Yta I really hope your boyfriend leaves you, because you obviously don't have enough respect for him, it was an agreement, as many people have said a goldfish isn't comparable to a dog, hope you enjoy being single op", "You both agreed a rule and you’re mad you broke it. A fish is a massive difference to a dog. Your partner has a right to be pissed! I would be. See sense and be mad at your parents for being hypocritical and abandoning their pet. I bet he is enjoying the quiet at his mates, yeah YTA big time here. In every way.", "YTA, goldfish is not the same as a dog - and you know that. \n\nTotally get why you would take the dog in, but your still the asshole", "NAH. \n\nYour partner never wanted a dog, so he is free to move out. If a dog moves in sind you have to pay the rent alone. You can't expect him to pay rent if you basically have thrown him out. \n\nI totally understand why you took in the dog, but there were hard boundaries.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have (F26) have been with my partner for just over 5 years, \n\n\nBefore we were together I went NC with my family (a whole other story) as part of this I had to leave my Dog behind, my parents claimed it was ther dog as they paid for him and the food etc and would not allow me to take it, this caused me massive separation anxiety that therapy has helped with, but I decided I would never have a pet again. \n\n\nWhen me and my partner met we both agreed that we wanted to be child and pet free. \n\n\nI have recently had a call from my family saying that my parents are unwell and aren't able to look after my dog, no other family will take him, so I obviously agreed to take him. \n\n\nMy partner is pissed, he hates dogs, I told him that I'm not giving up my fur baby and he either needs to accept him or move out. \n\n\nHe is now staying at a friend's and is refusing to pay his share of the rent. \n\n\nI think this is justified, a couple of years ago he came home with a goldfish out of nowhere, it caused a big argument at the time but we got through it, I told him this is no different and he needs to accept it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "The fact that you referred to him as “it” tells me that this is probably fake. No one who loves their dog ever refers to them as “it.”", "Damn, those scales from that stupid goldfish must have been awful. Bloody damn disgusting!\n\nYTA. The one to move out is you, not him.", "YTA for this sad attempt at a bait post.", "A gold fish? Fake story? \n\nAnyways, he’s free to break up. Be with your dog. It might be AH territory, but would you forgive yourself if you didn’t step up for your beloved dog?\n\nAt least be sympathetic that your SO is upset, but save your dog. \n\nI call fake due to the goldfish though lol", "This is super fake. Comparing a goldfish to a dog? Gtfo with that mess.", "YTA for going back on your agreement, YTA for comparing a dog to a goldfish, YTA for giving your partner an ultimatum over a dog he didn't agree to, then YTA for being annoyed he isn't paying rent, and finally YTA for picking an animal you haven't owned in five years over your long term partner.", "“Picking my Fur Baby”?! Op, try being honest here. You went NC with your parents more than 5 years ago. In all those years, you haven’t seen the dog either! Unless NC means something different to you and I. YTA", "A soft YTA - you’re going back on a deal you made with him so he has every right to feel this way. I would do anything for my dog but the least you could’ve done is has a full discussion with him about it.", "Well, it's simple, you two and your ideas just don't align anymore. I could never be with someone that \"hates\" an animal and I would never ever let a pet near that person.\n\nYour bf is entitled to not want to be in that situation, absolutely fair, but if you decide you take in your dog, do right by your pet and just leave your bf.\n\nJust go separate ways,OP. NAH", "You're never the asshole for choosing your dog, but it's clear that you can't have both the dog and that particular boyfriend. Don't ask for rent from him. Arrange a time for you and the dog to be out for him to come and pick up his belongings, and find a boyfriend who doesn't hate dogs.", "NTA for choosing the dog, but kinda TA for how you went about it.\n\nBottom line is, you clearly love your dog and he's a package deal. If your partner doesn't like that then it's time for the two of you to go your separate ways and find people who do and don't want a dog respectively to suit your needs.", "NAH. You had the dog before him. He can decide he doesn't want to live with a dog, however. But don't try to equate living with a dog and a goldfish... lol", "NTA for picking your dog over your bf, but you have to understand this means breaking up with him, as it is the rule you agreed upon \n\nYWBTA if you would tell your partner it is their fault. You have the right to make this choice, but it is yours, and your partner is allowed to be pissed about it", "YTA", "YTA. You had an agreement with your partner that you just ignored. Didn't even talk to him about it first, you just brought a dog home. Then you essentially kicked him out. Why would he pay rent? You told him to move out.\n\nYou chose your dog, now deal with it.", "You've agreed to something that is not viable. Being child free is ok, but agreeing to being pet free when you know you love dogs is bit dumb. Once pet owner, always pet owners and from experience you'll always miss having animal companion by your side. I'm not blaming you for agreeing to take your dog back into your care, honestly it was right thing to do and I'm happy for your but it wasn't right to agree to the pet free part.   \n\n\nIt's also not right to straight into the ultimatum territory, kicking him out of the house if he won't accept the dog inside it.   \n\n\nIt would be better to talk about it and maybe set some rules that would work for both of you.  \n\n\nYour BF is also acting like a drama queen especially if he was the first one to break the agreement and bringing in the goldfish. Yes goldfish is not as invasive to your home as a dog but still if he's not willing to honor the agreement why should you?  \n\n\n You both failed to approach the problem in calm manner and you both jumped straight into the extremes.  \n\n\nESH.", "YTA BUT yta that loves her dog.  \n\n\nYou made an agreement to be petfree. If he HATES dogs, then it really is black and white.  \nYou choose your dog and break up with him, or you choose him and re-home the dog.  \n\n\nEither way no one will die and your feelings will be hurt. Sometimes life is just kind shitty like that.", "Dogs are like little needy babies.  A goldfish is just decoration you feed once a day.\n\nHow the hell are people comparing the 2?  I barely consider goldfish pets.", "YTA for abandoning your partner of 5 years for a dog. You made an agreement when you got together, then you betrayed him and wasted 5 years of his life. That's incredibly selfish. A goldfish is not the same as a dog; a dog invades the space of everyone in the house, makes a bunch of noise, and completely changes the day to day life of the people living in the home. Y also TA for calling your dog a \"fur baby\"", "You can do whatever you want and end any relationships you want to, but being a decent human being means taking accountability when you hurt someone you supposedly loved. \n\nYou decided that your relationship agreement was null and void. This probably came out of nowhere for your partner. I suspect you can't have been that in love with him to make such a quick  relationship ending decision but that's by the by.\n\nSo nta for making a choice that ended your relationship, but yta for acting like the pain you caused with that decision has nothing at all to do with you and the consequences of said decision are a surprise and that hes being unreasonable. It's perfectly possible to make a decision that hurts someone because it's the right thing to do, and still take ownership that what you did hurt someone.", "NAH. I don't believe you're an AH for taking the dog back.  Situations change and if I were in your shoes, I would take the dog back as well. There's no way I'd allow a beloved pet to be placed with strangers in the final years of its life. I don't think your partner is an AH either for not wanting the dog, as you both agreed that you would be pet free.\n\nIf the partner is not on board to have the dog, fair enough. But, the OP has to accept the consequences of her decision which is the potential loss of her relationship and half the rent payment. Get a roommate who loves dogs, OP!", "Wait you kick him out, while expecting rent from him?\n\nYTA.", "INFO: you got through the goldfish argument you say, but you what was the result? Did he get rid of it or keep it?", "Ok first of all, a gold fish is not the same as a dog. Second of all, \"fur baby\" says a lot more about you. Third of all, a boundary was broken and yikes. I hope your partner is well. YTA.", "YTA. You both agreed no pets or children and you went back on it for a dog, not a “fur baby” a dog. Get a grip", "clearly YTA lol. i dont know how this can be debated.", "Assuming the dog is the youngest age possible of 5 for this to make sense. There’s between 5-9 years of life left for this dog. Likely less. Are you going to trade your life partner for a few years with a dog you originally agreed not to take in? \n\nYou broke an agreement by bringing in a pet and he has decided not to be with you and the pet. YTA for thinking you’re in the right with how you’re acting. N T A for choosing one over the other though, you can do that but expect him to move out and end your relationship", "YTA. This is a person, your partner, of 5 years vs a dog you haven’t had for at least those 5 years. That’s not your dog anymore. If you choose this dog over him you’ll regret it.", "Obviously, this isn’t the same as a bowl of goldfish. However, while you are reneging on your agreement, for which YTA, you are entitled to set your priorities to favor your dog over your partner. Apologize to him and negotiate the winding up of your household and relationship.", "Welcome to this weeks episode of people with the maturity of children, trying to negotiate their way through life, love and relationships\n\nESH", "YTA", "YTA a dog is WAY different to a goldfish. Your expectations are way out of line, I don't blame him for moving out.", "This is a dilema. I think your parents should have tried to get some help from a rescue centre. A loving foster carer would have been found nearby.  Your partner is quite right in not accepting an animal into his living space after you agreed no pets and no kids.  Kids do come along unexpectedly too, so just think about that one!!. A goldfish is not comparable. Dogs need attention. They require walking in pouring rain, snow.  They need grooming.  It must be quite old at this time and would probably need expensive medical care too.  Would your parents take the dog back when they are fully recovered - again this would be upsetting.  Maybe, boundaries can be set with this dog in your home.  Some  people allow their dogs to run freely all over the house, sleep on the beds , shedding hair everywhere.  Can you compromise with an outdoor large kennel in the yard during most of the day?  Keep the dog confined to just one large area? Walk the dog yourself.  Keep the dog away from your partner as much as possible. It's an old dog and deserves to be happy in its old age - it is only for a short time..I think your partner should agree to this dog living with you unless he is allergic to fur?", "NTA but you and him should probably not be together if trifling things like a goldfish and a dog causes a move out & serious arguments. How will you both handle real life crises, medical emergencies, child rearing, real debts, etc...if you cant figure out a fish & a dog without reddit input? Good luck.", "YTA. Not for choosing your dog over your bf but for breaking your agreement, went back on your words. You really compare a dog to a goldfish? 🤦🏻‍♀️🤦🏻‍♀️ you both agreed to be child and pet free but you broke that agreement.", "YTA\n\nLook, I can understand you. I love dogs too and if I had a dog I had to leave behind and then get the chance to take him in I would take that too. This however makes you TA. You agreed to be childfree and petfree. Also a goldfish is hardly the same as a dog. You can ignore the goldfish without any problems. You can't ignore a dog.", "OP,  you're in a difficult situation. In effect, although you are not recognizing your wrongs here, and you're the AH for how you're going about things, if you want your boyfriend back, you're going to have to compromise. It's that simple. \n\nYou mention not wanting to put the dog down. Of course ! But I feel like there's *maybe* a middle ground between \"I must take care of the pet in our shared home\", and \"I will put the pet down\". Look at local pet associations, you will find plenty of pet lovers. If you spend some time, I'm sure you'd find someone not too far from your location that could adopt your dog for the time being.\n\nIf you get someone to take care of the dog, you will be able to visit the dog at their house or when they're walking it, multiple times a week. At the same time, your actual shared PET FREE home will be PET FREE for your boyfriend to live in. \n\nNow, if you want to keep being stubborn and swear he \"just has to accept it\" because he brought *one singular fish* once, as if it's the same thing, you're free to do so. But you're going to have a BF free home instead of a pet free one, and your dog can't help you pay rent. Not to mention, from what you mentioned, there's a chance that your parents will get better, and get *their* dog back, and then you'll be all alone, hoping your ex-boyfriend will have enough sense not to take you back.", "YTA you an agreement to be petfree. I wouldn’t be paying rent either if my partner brought a dog into my home without me agreeing.\n\nYes life changes but it doesn’t give you the right to act like this. \n\nYou can set up the dog for adoption if you don’t want to break up. But if you didn’t think about giving this dog a new family (not you), then you have to break up.\n\nYou have to choose. Your bf or your dog, none is more important than the other one so it’s up to you to choose. I would suggest apologizing to your bf anyways if you want him to maybe have some compassion and cooperate while moving out. He could make this painful if he bought a lot of the furnitures and refused for you to buy him out.\n\nDon’t be stubborn. Just apologize and say: «  I shouldn’t have changed our agreement unilaterally. I cannot leave my dog, it’s like a family to me so our best move is to break up. » Let him process and then talk about him moving out etc.\n\nTake care", "NAH but the relationship is probably over", "YTA. Let me guess, you told him that you promised to feed and water it and pick up it's poop too?\n\nA dog is an expensive, high maintenance animal that can't be left unattended. A gold fish is a swimming piece of artwork that can be flushed down the toilet. It's only one step up from a houseplant.\n\nGiven your post though it is clear you want a dog more than a partner.", "You should have gotten therapy after you said you would never get a pet again and after blowing up over the goldfish.  It’s not too late, get therapy now", "YTA. I get you want your dog but he doesn’t want to live with a dog. Therefore you need to pay all the rent. You have done him a favor because you have proved you will always choose your wants over his.", "YTA\n\nYou're not the asshole for choosing to take care of your dog in a time of need, obviously. Life changes, and things happen. \n\nYour Partner is not the asshole for being mad and unhappy about a dog moving in, you even said yourself that you were mad about a fish. \n\nA fish and a dog have different levels of care and different time commitments. \n\nYou however ARE the asshole for not having a discussion with him about it beforehand, especially with an animal that WILL require his care. And for giving him an ultimatum to move out, he leaves and you expect him to pay rent?", "I think you are a huge AH. For one a goldfish and dog is comparing a Minicooper and a 747. Second why would you ever agree to a pet free life then get mad when you break that and expect him not to be mad?", "Dog = Goldfish....\n\nSounds like one set of rules for yourself and another set for your partner.\n\nYTA.", "YTA And \"refusing\" to pay half your rent when he doesnt live there is completly understandable. I feel bad for the dog.", "YTA.  A goldfish in no way compares to a dog. Especially one that you haven't been in contact with for 5 years.", "YTA\nI would do the same 100%, I support your choice. But you still had an agreement with him, you knew that about him. But I'm so glad you're getting the dog back.", "YTA. You agreed when you got together to be pet free. Now you are bringing home a dog he doesn’t want. \n\nAlthough he broke the same rule when bringing home a goldfish. Comparing the care, attention, and time that a dog needs to what a goldfish needs would be borderline ridiculous. It’s just not the same level.\n\nIn the same situation I’d probably try to compromise by taking the dog in, and try to find a new home for him. If I wanted to stay in that relationship.  \n\nI think if you’re even considering ending a 5 year relationship over this. then you don’t.  You’re basically saying you care more about the dog than the relationship. I don’t blame him for moving out.", "Yta but I think you did the right thing.", "YTA\n\nYou agreed to a child and pet free relationship.\n\nNow, your parents can’t care for your former dog anymore so you reclaimed it.\n\nInstead of having a conversation with your partner, you just did it.\n\n…and you’re surprised he’s pissed?", "YTA! A not pet policy is one of those things that if violated as an instant breakup. And no, a dog and a goldfish arent even remotely the same! A goldfish doesnt trigger your allergies, it doesnt randomly lick you out of the blue, it doesnt startle you by jumping on you, it doesnt stink up your place, oh and there have 0 instances of goldfishes mauling people. What an absurdity to compare the two!\n\nAnd you were without our 'fur baby' for the past 5 or so years. Enjoy being single with full rent and added expenses", "YTA for being angry that he's decided he doesn't want to live with a dog when yall both already agreed neither of you wanted to live with a dog. You decided you could accept a goldfish (which isn't even remotely the same as a dog but keep reaching) and he has decided he can't accept a dog. You can't force him to accept a dog you knew he didn't want just like he can't force you not to take the dog in. And it's ridiculous that you expect him to pay rent when he's no longer living there. And he's not living there anymore because of a choice you made. \n\nI don't think you're the asshole for wanting to keep your dog. I think it's a hard situation. But he's not the asshole for deciding it's a deal breaker for him. You knew where he stood on having a dog. If you weren't griping about him paying rent and equating owning a dog with owning a goldfish, I would say neither of you are assholes. You are just no longer compatible. Keep your dog and find someone else in the future that loves dogs too.", "Are you seriously comparing a goldfish to a dog? 😂 \n\nAnyway, YTA.", "I’m sorry but in what fucking world is a goldfish comparable to a dog…\n\nEdit YTA", "YTA. You both agreed to be pet free and you bought a pet into the house without even discussing it with him. A goldfish and a dog are completely different lol.", "ESH except the dog. Why must this be a case of absolutes? Why can’t you have civil discussions and show mutual compassion and understanding?", "Ok so you made an agreement, no pets or children. It’s not a perfect world and things in life change. God forbid if something major happens, I don’t feel he has the maturity to deal with it. He’s definitely not in this relationship if he can’t accept your dog, if he loved you he would unless he’s highly allergic to dogs.", "This isn't an ashole/not ssshole issue), IMHO. Just imagine yourself 20 or 30 years into the future. Do you see yourself with a dog and maybe a different dog but dog loving partner, or without a pet or kids and with your dog-hating partner? Which future feels better to you?", "A goldfish is a bit different to a dog,particularly if your partner hates dogs. That said, I wouldn’t want to abandon my dog either", "I see that many people interpreted your question differently than I did:\r  \nyou chose the dog in a difficult situation that you did not cause, hence NTA.\r  \nHowever, in relation to your partner, it is YTA, because something else was discussed.\r  \nThe world and life sometimes produces unforeseen situations in which there is no right solution for everyone.", "My mother wasn’t the world’s best, but she taught me two things that I firmly believe to this day: never prioritize a man over your children or your animals. I don’t think either of you are AHs. He doesn’t want a dog. That’s fine. You do want your dog. That’s also fine. You guys decided to be dog and kid free at 21. I’m sorry, but you were babies at the time. Very few people know what they want without changing their minds at 21. Your needs have changed, so it’s maybe time to move on to your next relationship. It happens.", "I think you’d have the answer if you read the post yourself", "this is so made up . get out of here", "NTA. For picking dog over partner. As a side note, he won the goldfish argument. Sure it’s just a fish, but he broke the agreement first and she has been living with a pet that must be cared for and tender hearts get broken. Did he take the damn fish with him or is she caring for it in his absence. And if a fish is no big deal, why are people gonna say it’s hard to tote the fish along when you couch surf in a huff. Because fish are a huge pain in the butt.", "NTA dogs are super special finally members, to me anyway. I picked a dog over a guy once and never looked back. \nThe relationship didn’t work but I’m married to the loml now and was able to take care of my dog until the end of her days", "For me NTA I’d do the same rightly or wrongly, but you need to realise you did go back on an agreement and that likely means your relationship will struggle! None of you are AH it’s just a shitty situation", "NTA I think you're absolutely right in taking back your dog for what will presumably by the last few years of it's life. If your partner can't see that then I'd say you're better off with the dog anyway.\nIt's not just about breaking agreements , it's about empathy. If your partner can't see how much this means to you and how awful it would be to have to have the dog put down then I don't think they care about you enough.", "NTA your dog needs your pretection and care, you did the right thing and this shows that you are a kind person", "NTA He is well within his rights to leave the home/ relationship as the parameters have now changed from what you agreed. However, i would die on this hill. You are doing right by your dog and he needs you. Your partner could show some more empathy for the situation if he loves you - its not like you went out and got a puppy.", "Keep the dog, this guy is clearly not for you in the long run! The dog has a few years left, compared to a lifetime together. If he’s not willing to compromise then be it. NTA", "ESH", "You need to hook up with the guy in r/relationshipadvice whose gf broke up with him for choosing his dying dog over her stupid tonsil removing surgery. Seriously go read that shit, I just did lol", "YTA! You agreed to be child free and pet free. I get that he crossed the boundary first with the goldfish but let’s not compare apples with oranges just because they are both fruit… in your situation both animals. \n\nHaving a dog means that you have to adjust your whole living situation. You have to walk your dog several times a day, play with them, can’t leave them alone for too long…dogs are needy. I love dogs but just like babies you really have to take care of them and it takes a lot of time and effort. \n\nYou also said that he hates dogs, why would you think that he would be okay with having your fur baby at home. I also do understand that he doesn’t pay rent anymore. Why would he pay rent when you made your choice. Should he happily pay for you and your fur baby to live comfortably while he sleeps at his friends house?", "Sounds legit. YTA", "YTA for unilaterally deciding to go back on an agreement without a discussion. \n\nThat being said, I would do the same thing (choose the dog that is).", "INFO:\nHow much does your partner know of the history behind your dog/situation with your parents?\nDid you caveat the no dogs with “unless my parents give me my dog back”?", "I mean I'm definitely biased, but I think any partner that would act this way in this situation isn't a good long term partner, and I'd consider it dodging a bullet to find out while you are still in your 20s. \n\nOne thing I personally had to learn is that women who don't want kids (me) and pets (not me I have a dog but also avoided one for a long time for the same kind of reason you mentioned) often are coming at it from avoiding being stretched too thin between their jobs/passions and putting in the needed time to be a good mother/caretaker. Men...don't have the same social expectations on them and just don't arrive at that decision the same way. Men who hate dogs and also want no pets and no children in my experience are rarely also good long-term partners because they often ultimately don't want to have to care for anything else period and see relationships primarily as having someone there to take care of them. That's gonna piss some people off, but in my personal experience, it was a red flag I missed too often. \n\nIf he can't manage the dog coming to live with you under this circumstance where you clearly didn't just go out and buy a dog on a whim against what you talked about but are actually just being a responsible adult, how is he going to manage when you have to take care of aging parents? Or you when you are sick? \n\nI also wouldn't date anyone here saying you guys had an agreement you broke the rules. People who see this as rules instead of adapting to life's curveballs are not the people you want on your team when the shit hits the fan. Marriages are more likely to end in divorce when the woman gets sick, and it's this same type of thinking people use to justify it. Don't waste your time.", "Good for your boyfriend, sounds like you never really cared for him anyways.", "First world problems. Caused arguments because he brought a gold fish home? A f gold fish? Guys grow up.", "Excuse me? He hates dogs???", "I dont you are a straight up asshole here. It might be controversial here to say but I can understand what you may have gone through when you decided to take YOUR dog back.", "Well I understand how it is when you’re hopelessly enthralled by your dog and feel strongly obligated to him. This was a surprise that neither of you counted on. I can see where both of you are coming from and this is just one of those things that happens so neither of you really is the asshole here", "NTA. Anyone who despises dogs isn't someone decent run don't walk from this guy. He preyed on your trauma from losing the dog to suit his agenda. Nope. Run don't walk from him.", "Nta and i will never trust anyone who doesn't like dogs", "So....I'm always going to pick a pet over a human, for obvious reasons.....\n\nThat being said, I definitely think you should have talked to him before agreeing. You both failed to communicate (goldfish + dog). Also, neither of you is respecting the other boundaries you both agreed to. What's the point of agreeing if you aren't going to respect it? I understand life threw you a curve ball, and I don't want the doggo out on the street, but you didn't approach this like you were a team trying to find a solution.", "Just keep the dog and move on.  I don’t understand anyone (SO) who is that averse to pets.  My husband isn’t quite the animal lover that I am (his family had no pets when he was growing up) but he did admit over time he really came to appreciate our dogs.  OP will find someone who likes animals.", "NTA you were so traumatised at loosing your dog you decided to never have a pet again. Your parents are now unable to look after your beloved pet so of course you’re going to take your fur baby back!! I would the same and if your partner loved you enough he would understand and support you. Life throws a lot of things to make us have to rethink what we would do and we all have to learn to compromise at times", "Tough Call.  Technically yeah you went back on your agreement but it was your childhood pet and you can't just walk away from that.  I'm going with NTA but only because I'm biased and love dogs.  I'd rather have the dog than the bf.", "NTA, but a goldfish is a whole world away from a dog (a pinch of food every other day vs walks, cuddles and attention) - but given it's age it's a small inconvenience in the big scheme of things.\n\nDogs teach you how to love unconditionally, so maybe your bf's reaction is a sign of things to come - how would he feel given other circumstances such as you being hurt in an accident.", "NTA \nI think this situation is a bit different because you owned the dog before the relationship and there was no one else to take him. Your pet free feelings for the relationship came from a place of hurt. However, your approach sucked and you should've just left the goldfish comparison to yourself. A dog and a goldfish are not the same.", "Nta i understand that a goldfish is different than a dog however a goldfish it still a pet. \n\nI think it time yall go separate ways it was your dog before your parents who were diks and decided to keep it from you so nta.\n\nYour dog would still be with you today if your parents weren't diks. He needs to take that into consideration. Yeah definitely time to end relationship find someone better hell cat people r pretty chill with this type of thing half of us gets our cats by them coming to us", "there's something wrong with any man who hates dogs, good riddance\n\nit was a sterile and fruitless relationship anyways, Dinks are a social and evolutionary dead end, just move on, NTA", "Ppl who don't like dogs are serial killers and psychopaths.\n\nRun.", "You’re doing what families do. And dogs are part of the family. He can opt out, like he’s doing, but I think you’re doing the right thing.", "YTA but if I were you I'd do whatever I need to keep my dog.", "I kinda believed this until the goldfish out of nowhere bit\n\nObligatory ESH. You agreed to a set up and broke it, your partner sucks for not liking dogs or understanding how important this one is to you in particular", "You literally said your partner hates dogs. He’s an asshole. Spend no more time on him and kick him to the curb.", "ESH\n\nYou love dogs. He hates dogs (very weird if you ask me). You should never have started a relationship with this man.", "NTA anyone who genuinely hates dogs isn't worth being with.", "NTA\n\nFor me an emergency can go against something we agreed before on, so i would personally break up with this person. If you would buy a puppy thats different, but here you are supporting your family members and the dog is one of them", "I get where you are coming from. But also gold fish are easier to deal with when sprung randomly on you. \n\nINFO: (feel free not to answer) do you know how long you will take care of the dog?\n\nOverall I want to say NTA but also I  do think you are making the right choice and he should be able to support you taking care of a beloved dog during a tough time. Even if it's just temporary he should feel sympathetic towards your situation.", "I don't need to read this. NAH.\n\npeople who don't like dogs are not good people.\n(unless previously attacked)", "These are special circumstances; this isn't one of you going out and just bringing home a pet, this is a family pet that you love(d) and that losing access to brought you trauma.  NAH.  I'm sorry your partner made the choice to leave, but it is his choice.  I would have brought the dog home, too.  \n\nI'm sorry, OP.", "You remind me of an old acquaintance that suffered from BPD. They sought validation and refused to change their stance when they were denied it. With that being said, what do you consider a discussion?\n\nUsually, discussions about topics like this are held to make a decision. If you had already made the decision, it was less of a discussion and more of you informing him of the decision you made by yourself. A decision that impacts the home he was also paying for. To give him an ultimatum and despair over what he chose to do is immature and illogical. I think you should seek therapy so that a professional can help you work through all the instances in your life where you felt justified doing something that caused harm or discomfort to others. YTA.", "You're both TA, there seems to be no kindness or real care between you in regards to this, just end end it if you can't be accepting of each other.", "NTA. major red flag that he doesnt like dogs or see them for the sentient beings they are. you obviously care deeply about dogs and this dog in particular, so his values and views dont align with yours at all.\n\n(also fuck your parents for stealing your dog and causing you so much distress)\n\n&#x200B;\n\nin regard to just abandoning you and not paying rent - hes disturbingly immature (guessing hes about your age) and pretty much showing you what a terrible unreliable insensitive person he is.\n\nconsider yourself lucky you have seen this side to him before you waste any more of your time on him. and realize you have denied your own feelings about dogs out of stress and sadness. you need someone who aligns with you.\n\nDONT accept an apology from this man. this will happen again. he will let you down and disappoint you in a bigger way. get out now while youre young. and you obviously have some sort of problem with your family, please dont let the fear of being alone make you stay with him. youre better off alone with your dog. your dog will be more loving and loyal than your bf.\n\ni dont think you should take any advice from people on here that dont understand the value of a dog. and reading the responses youre getting most people here are the AHs who are only viewing it from his side without acknowledging that you have some major trauma surrounding that dog. you dont need to qualify your situation toby mentioning him getting a goldfish. your reason and feelings are good enough, and he should have tried to meet you half way and understand you if he wanted to be a good partner. \n\ndump him. hes already abandoned you and the not paying rent thing is a nail in the coffin.", "I can understand why he’s annoyed about having a dog in the house when the original agreement was to have none. \nBUT. \nI would put my dog before my partner too. Because I’m a dog person. What can I say? \nNTA", "INFO: Why does your boyfriend hate dogs? If it's a trauma response/fear or something I get it, but if he's just complaining for no real reason, then that's a whole other story.\n\nETA that personal preferences are valid and respectable as well. Just wondering.", "NTA. That dog is your family responsibility and if no one can't take it, you take it.\n\nIt is not new or random dog.\n\nDog is not a toy, that you can toss away.\n\nEdit: oh boy how many people according to downvotes, would give up dog...\n\nPet is responsibility if you choose to get one, you need to take care until it dies... It is not a toy...", "NTA. Your dog is more important than him", "NTA. Dogs first.", "$100 for food a month? What kind of food you buying? I have 3 dogs and it only costs maybe $50 a month to feed them.", "OP most definitely is TA for picking the dog. It's super fucked up and also pretty unhinged to pick an animal over your lover.", "They said no pets, he already broke the rule, and she didn't choose this. To her it's take the dog or a member of her family will die... I know what I would choose.", "I was weighing this (as someone who has dogs and used to have goldfish). I think the effort actually evens out. Dogs need more day to day engagement, but you have to change the water in the fish tank, clean the glass, check the levels, treat the fish if they get sick (which they do!), regularly get enrichment plants for them, monitor for snails and stuff from the plants, have a quarantine tank… and then the fish die ANYHOW and you get to feel awful about it…", ">You got upset and caused a big argument when he brought home goldfish. Goldfish don't cover everything in fur, need to be let outside at 3am, cost $100 every 3-4 weeks to feed, need to be walked daily, brushed etc. Him bringing home fish and your bringing home a dog are not the same and to suggest that they are, insults the intelligence of your partner\n\nThe principle is the same, actually what he did was worse, it's not like he had an emotional connection to the goldfish", "Delusion and TA 100%", "Yes this! Maybe if she'd had a discussion and asked him and said this will be the only dog and he's getting old now so will only be a few years max. But he'd still have the right to be like no.", "I disagree though. Agreeing to remain PET FREE, not dog free specifically, was the agreement - the principle of the matter counts here.", ">And it sounds like you blew a shit fit over the goldfish\n\nWe had a disagreement but I accepted it, all I'm asking is the same from him", "Imho he can't be good partner if he doesn't like animals so much. But that's just my opinion.", "And no dog n fish aren’t the same. You can avoid the fish in his little tank and have virtual 0 contact and interaction with it. Care is minimum. Life span ridiculous. You go on vacation you put an auto feeder and adios Mr Bubble.", "Plus, comparing a dog to a goldfish is ridiculous. A dog makes noise that not everyone is comfortable with, needs daily walks, someone has to clean their poop, money for vet bills...", "Because he has a penis. Lol", "He knew about my dog, we had discussed it\n\n\nI never expected to get my dog back, but I can't allow him to be put down", "Goldfish have care requirements too - you can't just stick it in a tiny bowl and forget about it.  You need to have a large enough tank for it, you need to water change (and treat water) regularly, syphon the substrate in the tank regularly, monitor the water quality, medicate if it gets sick and so on.", "Also they fought over a gold fish.. wtf", "A goldfish is not the same as a dog, but it is a pet. A pet the bf went out of his way to get and bring home, whereas OP has been put in this position of choosing whether a member of her family dies. If the bf breaks up/moves out its on him. I, personally, could never hate anyone for doing that. In fact that kind of caring nature is very endearing for many. In the same way she has chosen the dogs safety over the safety of her relationship(understandably), her bf has chosen his (mostly?) Pet free lifestyle over their relationship.\n\nNTA!", "Yeah all of the above. OP YTA and comparing a dog to a goldfish  really? A goldsidh can't destroy your stuff, stink up your whole house, poop twice a day, need playing with and walks every day. Get a grip girl, they aren't comparable.", "I agree with you here. She's definitely the AH. She didn't even discuss it with her partner before hand - just unilaterally decided that it was happening and now the poor man has effectively been kicked out of his own home AND she's complaining about the rent.", "I hate this \"crossing a boundary\" phrase that's getting thrown about everywhere. She went back on an agreement, she didn't cross a boundary 🤦🏼‍♀️", "Not to mention a goldfish is not comparable to a dog!", "life changes, my dude.  Sometimes, when you love someone, you have to make sacrifices.  Clearly SO doesn't want to.", "She didn't \"pick \" the dog over her partner. She is just showing and feeling compassion in a dreadful situation.", "I would choose the dog. I don’t care what kind of person that makes me. It’s more of a “they’re not compatible” thing than the reasoning for it. This would be the crossroads and they’re not on the same page for an exception that was likely never going to happen. Dogs have short life spans, so she’s got a few good years with someone who brought her great comfort during a difficult time, and the boyfriend is justified in moving out. He also needs to pay his share of the rent until he’s moved his things out, though, but after that it is what it is.", "Seriously? You sound petulant and childish! She agreed to be pet free under different circumstances- those circumstances have changed- this was her dog! So she is  NTA - kick his ass to the curb- get a guy who likes pets and move on", "I feel like if you'd rather have a dog over your partner,and a dog that hasn't even been with OP for a rather long time as I can tell by the post...then they probably shouldn't be in that relationship anyways.", ">I think this is justified, a couple of years ago he came home with a goldfish out of nowhere, it caused a big argument at the time but we got through it, I told him this is no different and he needs to accept it.\n\nThey had agreement to be pet free not just dog free. He brought in Goldfish out of the blue before the dog situation. They are both AH.", "“Your dog should pay rent” what a stupid thing to say 🤦🏽‍♀️ \nAnd FYI - the boyfriend broke the boundary first with his goldfish, goldfish are also pets.", "He already broke said agreement with the goldfish, and she had to keep it. Read the whole post.", "I honestly think the boyfriend is being completely immature. He can be upset about the situation, but storming out and refusing to pay rent HE IS ALSO RESPONSIBLE FOR it just childish. \n\nYeah she should’ve talked about it before doing it but this “crossing a boundary” terminology is dramatic. \n\nAt the same time, BF could be a little compassionate and realize if she doesn’t take the dog, it’ll have to go to a shelter where it may or may not get adopted out and likely euthanized. The dog doesn’t deserve that. \n\nShe’s not an asshole for picking he dog over him. I’d pick my cat over a boyfriend any day of the week.", "If anything, both are A-holes because the boyfriend did the same thing with a goldfish.\n\nNot paying his half of the rent could potentially be a legal issue depending on the terms of the lease and whose name it is under.", "Technically he already broke that boundary though they agreed to be pet free but he brought a goldfish home. Now a goldfish and a dog 2 very different pets but you can't really decide to break the agreement and then get mad when the other person does the same. It's her pet it's more than likely house trained and everything she didn't set the expectation he was to care for it.", "NTA you were pet free bc you couldn't take the heartbreak of losing another dog plus people are allowed to change their minds. Your partner is an asshole. He knew how much that dog meant to you, that you needed therapy to deal with the pain. He knew you loved this dog so why wouldn't he want the person he loves to get a piece of their heartbreak? Go get you baby back!!! I lost my baby right before Christmas and I would give ANYTHING to just hold him one more time. I have suffered too many human losses but the loss of my baby is by far the most painful. People who don't love animals won't get it so dump the partner and go get your TRUE love!", "He crossed the boundary first and I accepted it", "i completely agree with you! i just wanted to say to please not put goldfish in bowls… they get huge!\n\n(im guessing the bowl part was just added to make the analogy clearer, better safe than sorry, though!)", "Whilst it would be difficult, if the only option was either he takes the child or the child dies, I would atleast try and make the relationship work", ">Extra-yta btw for calling your dog fur baby, that's so urgh.\n\nThank you! Finally, someone else gets it!", "The fur baby comment is so nauseating.  \n\"I'd never give up my fur baby that I abandoned for years.\"", "I didn't really have a choice about giving up my dog in the past, if I could have taken him I would have", "We did talk about it first, he wanted me to take the dog to a shelter where he would probably be out down", "Sometimes situations change, I would never have brought home any other pet that wasn't family\n\n\nAlso the boundary didn't seem to matter as much when he brought home a pet", "Why should I be more understanding about his feelings when he's not understanding about my feelings, we are talking about a family member to me", ">1. Did you even discuss it with your partner before making the decision to take the dog?\n\n\nYes, he wasn't willing to entertain any circumstances where we had my dog", "The argument was about how he brought the goldfish home without even a discussion (that isn't what happened with my dog) \n\nAnd that it was completely unnecessary", "\"my sister died and my niblings, who I babysit twice weekly and have no other family, have nowhere to go. But my partners doesn't want them\" --> Reddit: fuck those kids, they will be fine in the system. Yta and should be single forever.\n\n\"my sister, who I was nc with,  died and her dog, that I never seen in years, has nowhere to go. But my partners doesn't want it\" --> Reddit: the poor fur baaaabyyy! What an abusive bastard you married!!!", "Dogs are better than people, they don’t treat others like crap - unlike OP.", "I think he is throwing away a great relationship by not even considering trying to make it work, my dog is old, this isn't a perm situation", "He did keep the fish, the argument was that it was completely unnecessary and there was no discussion beforehand", "He knew all about my dog, he knows how much he means to me and how hard it was to have to leave him behind, I honestly never expected to see him again", "We do, on every other aspect the relationship is perfect\n\n\nBut he's expecting me to let my baby go to a shelter (and probably be killed) rather than accept him", "OP really did everything wrong lol", "We kept it, I wasn't going to make him flush a live goldfish", "Honestly I would have done anything to make keeping both of them work, cost isn't an issue, my parents have agreed to cover the costs \n\nI fully understand I will be 100% responsible for the dog \n\nHe won't even entertain a conversation about staying with me whilst I have the dog.", "We did have a conversation", "Cause it's either living with the dog or not living with the dog.  And when you don't want pets,  there are only 2 choices.", "That's insane, it's not a part of the family, it's just her parents pet. She betrayed her partner for someone else's dog.", "I don't love dogs. \n\n\nI love my dog, I would have been perfectly happy never having another pet for the rest of my life, but I cannot leave my Dog to die", "Anyone who hates dogs and can't keep his side of agreement.  \n\n\nMany commenters here see no issue with breaking the agreement but that only speaks volumes about their morals.", "You are as stupid as OP", "Please she told him to move out so he did therefore no rent is needed she's just reaping what she sow Op YTA.", "They agreed to a pet free life, so how is it his fault he doesn’t want a dog?", "Wait...\n\n So she had agreed to a pet free life, but clearly has lied to her partner about this and is now trying to manipulate him\n\nShe knows her partner hates dogs, but is trying to force her dog onto him\n\nShe told him to leave, yet you are saying he is abandoning her????\n\nAnd after SHE told him to move out, which he did, she and you are expecting him to still pay rent???\n\nAnd you call HIM a red flag and childish?\n\nDamn, you and OP both are the red flags here....\n\n(And i love my pets more than anything, but i will NEVER force them onto anyone. Nor will i start to manipulate people into living with my pets)", "Lmao animal lovers are genuinely nuts", "Why do you assume he doesn’t see dogs as sentient beings? Many people choose to be childfree, I don’t think it’s because they don’t think human children are sentient beings. I assume the same holds true for people who choose to be pet free.", "Thank you,", "my cat gets UTI’s and his food is mad expensive, prob $70 a month for one small cat. shit can be expensive.", "3 dogs for maybe $50!! What are you feeding them? I have one dog and he eats about that much.", "My dog has bad allergies and has to eat a prescription dog food. One 40lb bag costs 225 dollars. That sudden change came out of no where, 100 a month isn’t unreasonable.", "Dang what are you feeding them? Ol Roy kibble? Or are they just tiny dogs?", "Must be feeding them shit pellets at that price", "you feeding them dollar tree dog food or are they chihuahuas? lol", "Shit I’m spending $120 on dog food every 3 weeks, $35 for one cat and $55 (prescription diet) on the other every 7 weeks. I could feed them cheaper but I can afford to let them thrive.\n\nFed is best, but if you can afford to give your animals a good diet, they are healthier and less prone to medical issues.", "You're feeding your dogs garbage then.", "OP doesn’t exactly sound like the most pleasant person to deal with. Making a big fuss over a goldfish? The partner may be dodging a bullet here.", "Pets are completely reliant on their owners and most owners will always put the safety and care for their pet as a higher priority than the safety and care of any independent adult. Given the options were:\n\n1. her dog likely going to a kill shelter or\n\n2. try to force her partner into accepting her dog.\n\nit's understandable that OP chose the second option. No one would want their pet who they have loved so much and who they have been pining for, for years, to be killed because they didn't try hard enough to convince their partner to try living with the pet at least until other options can be found.\n\nI don't think OP is alone in being willing to choose her long lost pet over her relationship. I'm not sure I'd make the same decision, but I don't think that makes OP 'unhinged'.", "I was not intending to suggest that there's no work required to keep goldfish, although we both know that many people mistreat goldfish by not providing them with sufficient or appropriate care. But the impact on other household members if one member has goldfish is fairly minimal (although the grief impact of losing them is another story). The impact of a dog on other members of a household is significant even when the owner does all the pet care.", "No, having an aquarium / pet fish is in no way on level with having a dog. I have had multiple aquariums all my life and the maintenance needed is less than 5 hours a month. My mother spends more than 5 hours EVERY DAY on her dog.", "I think the wrong perspective is here, it's not about effort but about the impact on other household members, aka their partner", "This is absolutely a lie.", "But none of that maintenence intrudes on the other person. My goldfish isn't going to jump on their lap or get hair in their bed or food. Its not going to whine for food. If I'm responsible in maintaining it its no different for my partner than a large decorative piece of art. Absolutely not the same as a dog", "Plenty of people, myself included, think of fish as just medium maintenence decoration (no offense ti  those who have and love their fish). The principle is absolutely not the same.", "If this is what you truly believe, I hope you and your dog are very happy together and that your bf finds someone who actually keeps their word.", "It was a fucking fish op. Its not even a real pet, you can’t do shit with a fish", "For this line you are AH", "What he did wasn't worse.\n\nYou both agreed to 'no pets', \n\nregardless of an emotional connection, the person you quoted is right, dogs are far more of a responsibility", "Dude a fish is a fancy high maintenance lava lamp with an extra ethical obligation. Take the L.", "Grabbing at straws much? It's a fish...", "Wow. It's a fish. Tbh he's lucky he got away from you because you seem super manipulative. 😬", "The principal is not the same at all. Either you are unwilling to acknowledge it because it makes you look bad or delusional.\n\nWhat is the reason for the no pets rule ? For you it was that you didn't want to get emotionally invested in a pet that you had to live without and don't wanna go through it again.\n\nIn that regard getting a fish is more like getting a decoration or plants. It's not something you can interact with a lot and you probably wouldn't notice if it was replaced. It's very easy for you to completely ignore the pet and go on with your life as usual.\n\nThat's not the case at all for the dog\n\nWhat was the reason for your bfs no pet rule?\n\nIs is because of the effort? Coz having a dogs adds 2 hours work to you daily schedule.\n\nOr is it because he is afraid or uncomfortable or allergic around animals.\n\nRelationships are not about technicalities.", "Goldfish are literally just decoration 💀💀 (still shouldn't be neglected tho)", "It’s not the same. Goldfish are not work and they don’t require much attention. A dog needs to be walked, petted, played with, taken care of when you go away for a day. \n\nA goldfish does not. Stop comparing the two. You’re still the asshole and trying to justify yourself with comparing a goldfish to a dog makes you an even bigger asshole.", "It’s a goldfish not a tropical fish tank.", "What are yiu even syaing?? Do you think your partner would kick you out over a fish??? Behave. Firstly picking a dog over a long term partner is fucked up. Then going against an agreement is fucked up. Even worse is getting angry that ur boyfriend is pissed that u picked a literal animal over him", "It really does, plus the fact that it's essentially a member of her family at risk of being euthanized or put in a kennel. She didn't ask for the dog back.", "They are veeeery different things", "So when you said “accept him or move out” you really just meant “accept him.” In which case YTA and a major one.\n\nYou gave him a choice and he took one of the options. Now *you* need to accept *that*.", "Can't force yourself to accept something. If he doesn't want a dog, he doesn't want it. Ain't gonna change because reasons. Same about kids, if he doesn't want a kid and you \"surprise\" him with one, he's not gonna suddenly be fine having a kid. He didn't want it.\n\nYou could accept having a goldfish in the end. Great, you changed your mind. Probably because your reason for not having pets wasn't that you didn't want pets, but rather because you were at the contrary scared of losing them. He may not be like that, he may genuinely not want any pet. Which is fine, and which you agreed to just to break that agreement.\n\nUnderstandable that your partner doesn't accept it and is hurt. He's not an asshole here, in any way. Understandable that you wanted your dog back, and even that you chose the dog over your partner, shit happens. But YTA for expecting your partner to just suddenly be fine with it and for the way you imposed it on him without consulting him.\n\nETA At the time, your partner WAS an AH for bringing a goldfish you didn't want either. And it would have been your right to be hurt and upset too. Accepting it or not was on you.", "that was your choice to make, accepting it. he’s choosing not to, and that’s his choice, which he has every right to make. \n\nand it’s a fucking fish, not the same as a dog. as someone who has had both a dog and a fish, i can say that it’s literally not the same here 😂", "You clearly is trying to justify your actions, because you know that you screwed up. \n\nAnd no, the godfish and a dog are different things. Look at tons of the comments from tons of people, that expaining to you that IT'S NOT THE SAME THING.\n\nYTA.", "So go get a goldfish instead", "You told him he can move out and he did? NAH, if you don't bother him again", "mans had that tiny goldfish and you kept that big dog", "But you’re not asking the same from him, you told him he can accept it or move out and he moved out. Are you shifting the goalposts after he called your bluff? Not that I disagree with you in principle, I would take the dog over the guy any day, he seems kind of a jerk.", "He wouldn't be a good partner for you, or me. But he specifically went looking for a partner who (he thought) had the same views on not wanting pets. He went about it correctly, OP was the underhanded one here, with ultimatums no less.", "That doesn't makes any sense. I don't like animals, I never had nor will ever have any pets. I don't hate them, just fyi. Doesn't mean I'm a bad partner.\n\nYou guys give too much importance to pets and treat them like your kids. That's okay. But you can't judge others for not having the same emotions towards an animal.", "Him not liking animals doesnt mean he's a bad person jfc. I say this as an animal lover and a dog mom. Unless the person hurts animals, there's literally nothing wrong with not liking them, because fun fact, animals are messy and a lot of work, not everyone wants that.\n\nYou can't go and say this guy is unable to be a good partner just because he doesn't like dogs", "OP's backpedaling and breaking of agreements is a clear sign that she's the shit partner here.", "Then part ways and pay rent for you and your dog. You can’t expect him to pay also.", "Then you’re going to part ways and you can pay for all the rent. And yes, it is fair. \n\nYou went back on an agreement (and a goldfish is completely different than a dog and you KNOW it), so now you can either choose your partner of 5 years or you can deal with the consequences. \n\nWhile I’m all about saving animals, it’s amazing how you suddenly will drop someone who’s been there for you when you had no family to help said NC family out. \n\nYTA.", "Then offer to keep it only for the time it takes to find him a new family, and LOOK FOR ONE. Or be single.", "A goldfish is no more care than a potted plant though.", "But that could've all been done by OPs boyfriend with OP barely even noticing they have a fish. Dogs take over the whole house in comparison", "You can leave a fish for a week or two without feeding it if you go on holiday. Total maintenance including feeding and cleaning is around 30 minutes per week - and that’s if you have pretty high standards for a single fish. You can confine it to a couple of square feet of your home. You can ignore it for days on end. You can expect it to respect your personal space and not jump up on you. They aren’t even usually counted as pets on leases/tenancy agreements, unless you have enough of them to need a tank big enough to flood the place if it broke. If I have a fish, my partner never needs to interact with it and can continue enjoying a pet-free life.\n\nLiterally none of that applies to a dog.", "It's hard work i agree but it's very non intrusive compared to a dog.", "It can require cleaning the tank regularly having to keep it filled,feeding it and in some cases if you don't clean the aquarium it could stink  up the house they get very big and are pretty dirty fish. Went to someone's house once they had huge goldfish and the tank was so dirty you could hardly see the fish and they were like 5-6 inches long and fat. Means a big tank 50-60 gallons takes up space. Have to buy filters as well and food. Just because they're not running around like a dog doesn't mean that it won't cost you a lot to maintain.", "It's still a pet. They agreed to be pet free. He didn't hold his side of agreement", "We did discuss it, he didn't care that my dog might be out down", "She literally brought the dog into their shared home", "That's what a boundary is though, it's a promise or an agreement to not trample over someone's feelings. Something he didn't want is a dog, that's a boundary, a fence around what he finds as an acceptable relationship. She crossed that fence/boundary/agreement with what seems to be not a lot or any conversation. That is crossing his boundaries by going against their agreement.\n\nSituation may have played out differently had there been better communication. She's not wrong for wanting to take care of the dog, but I'm saying YTA for how she went about it.", "…She didn’t communicate with him about her decision to bring a pet home though they’ve discussed this before. There are 3 boundaries she crossed that are major red flags in a relationship - the blatant disregard to a decision made as a couple, the blatant disrespect to one’s feelings, and the utter lack of communication", "No I absolutely despise it because it always obfuscates what the actual situation involves. Even worse when people misuse that word to refer to something they want you to be doing rather than something they don’t want to be doing.\n\nYou’re absolutely right, this is walking back on an agreement. I’d probably keep the dog as well but it’s a YTA I’m afraid.", "I agree.  That phrase is being  over used like toxic leadership and woke…", "You ain't kidding.  \"Crossing boundaries\" is overused, lazy, and virtually meaningless these days as in encompasses any contentious issue that pops up by just living a normal, every day life surrounded by people.", "Also why  do people act like you agree to one thing one time and that can never change in YEARS? Sorry but life doesn't really work that way, it's messy and things change.\n\nThe sign of a strong mature partnership is compromising together in the face of these things. A dog is meaningful. It's okay they broke up over this but if he truly respected her he would still help pay the rent.", "That's the same thing. He hates dogs and didn't want one. Then she went and got a dog so therefore she broke a boundary he had. So yea she's definitely TA", "Yes, but every relationship is based on what sacrifices you are willing to make. Everyone has a line they are not willing to cross. To some people a dog is that line. They discussed this ahead of time and agreed no pets. To me this is a NAH situation. The partner is justified in saying he doesn't want pets as agreed. OP is justified in saying I know we agreed to this but extenuating circumstances have changed that. Nobody's an asshole here, they just are no longer compatible if neither is willing to budge on this.", "Why does he have to make the sacrifice? She could just as well make the sacrifice and just not adopt the dog.", "She flipped out on him for frigging goldfish... but \"somehow managed to get through it\". It being living with a goldfish...\n\nAnd you expect him to be ok with a full blown adult dog , when he always hated them??", "Bringing a dog in a shared home without the other person's consent isn't compassion.\n\nForcing the person to either deal with it or be kicked off their own home with little to no notice isn't compassion.\n\nIf she wants a dog, she can live alone instead of forcing her boufriend", "Thank you, I dont know what people expect me to do, this is a family member to me", "Did she ever tell him that those circumstances could change? Or did she led him to believe that they wouldn't get a pet?\n\n>kick his ass to the curb-\n\nShe shouldnt be whining about rent then. He got kicked out of his shared home, he doesnt need to help her pay for shit", "I agree with you, but I would change it to NAH. Circumstances have changed for her, he doesn't have to accept them too.\nHe sucks but he is not an A H for not wanting a dog.", "Yeah but putting a gold fish in the same category of care and life change as a dog is quite ridiculous. \nThat said she told him to move out he did. Why she expect him to pay rent?", "A goldfish isn't the same as a dog", "Lol. Not in any meaningful sense. No noise, no smell, easy to ignore.", "Two wrongs don’t make a right, and a goldfish is hardly comparable to a dog. This isn’t kindergarten.", "As you said, a goldfish and a dog are completely different. My kid has some fish and it’s essentially a water feature that requires just a touch more care, not a tank that contains pets (for example, we can check a filter and put in a food puck that will last two weeks and know the fish will be alive when we get home with not intervention from anyone else). If you asked us if we had pets they wouldn’t even register in my count.", "Sorry but a goldfish is nothing like a dog. You are joking if you think they’re on the same level.", "Look, I do see your point that he first crossed the boundary with a fish. However:\n\n1. Him bringing in the fish was your chance to say you broke our rule I'm out. Just like this is his chance to say you broke our rule I'm out. If you wanted the fish argument to hold water (no pun intended) then your time to speak up about it then. Not save that as a \"gotcha\" moment later on. \n2. You can't seriously be equating a dog and a fish can you? Like yes, both are a breach of rules. However, comparing the two isn't in good faith. Dogs require a significantly larger amount of attention and food. You don't have to worry about your goldfish needing a walk or jumping on the couch or ruining your carpet. If he had come home with a saltwater aquarium that require much more maintenance and money I could see the comparison. A goldfish though? Not so much.\n3. I dont know many people with anxiety around fish. I can't speak for your partner and don't know their history. I however don't ever want to own a dog because I was attacked by one as a kid and still get major anxiety around dogs, and there's a lot of people just like me. Neurodivergent people can also find dogs overwhelming with how needy/loud they can be and their intrusion of your personal space. Maybe there's people out there with trauma from fish, or who find fish to be a sensory overload, but I haven't heard of that, and I think if that was the case you would have mentioned it. \n\nI'm not saying you or your partner are assholes. It just seems like you aren't compatible anymore. Yes he should have respected your boundary with the fish. No he doesn't have to go back on his boundary with the dog. It just means you aren't compatible if neither is willing to change their stance. It's not a bad thing or the end of the world, it just didn't work out. Happens all the time.", "but it's a goldfish... a dog, literally, is a whole other animal. You don't need to walk a fish", "Did you then renegotiate the no pets allowed rule? And did he agree on getting rid of the rule? If yes on both counts, NTA, if not ESH at best.\n\nAt best because having a goldfish is having an ornament in your house you need to feed. Having a dog is a lifestyle change. You want your dog back (which is totally fine), he doesn't want a dog in the house (which is also fine). Those two wants are incompatible. You're not an AH for choosing the dog. You're the AH for demanding your partner stay with you and comparing it to a hardly comparable situation.", "A goldfish is an animated ornament \n\n100% not the same as a dog", "Oh I know 😅 people don't realise they can live something silly like 40 years and grow huge.", "But you could have down the road and you basically wiped your hands of him until your parents couldn't care for him. So suddenly now you can take him? What about a year ago? Or two years ago?", "Don't put the poor dog in a shelter. That's cruel. He's not a toy that can be thrown away when it no longer fits your life! \nI will go with NTA for keeping your dog. But I will go with YTA for expecting your partner to pay rent when you specifically said he could move out.", "Have you looked into no kill shelters? Or even most kill shelters have you sign a no kill waiver", "It’s a goldfish, it’s a glorified ornament. Didn’t realize they cost you triple digits in vet bills", "You haven’t seen that dog in years, and you made an agreement with your partner. Then you turn around and make a decision about said dog without consulting him first, does that sound fair to you? You’re pathetic if you’re choosing a dog over your partner. A dog you haven’t seen in years and who’ll probably be dead in a couple of years but whatever. I just wonder how you would have reacted if he did the same thing with a kid. Just showed up one day and said “we’re raising this baby” (actual baby not a fUr bAbY- cringy ass Millennial)", "It's not your family member, it's an animal. However, you did betray someone who could have become family.", "so you completely ignored a boundary of his. why would you not be the asshole here?", "Oh you’re one of those replying to every message, I see, so you don’t care what we write, you’re 100% correct no matter what. Good luck friend! Hope you meet some cute guys while walking that dog lol", "You're the one throwing away their relationship over an almost dead dog, he isn't. You thought you could manipulate him, that you were too good to give up, but you're obviously not much of a catch.", "You’re the one throwing away a great relationship. He’s not losing anyone except a selfish person he obviously doesn’t need in his life. \n\nHe was there for you and you are leaving him when there are other options for the dog. You are choosing to not look into them.", "Did you break up, or did he just move out? If the dog will be gone in a year or two, why can’t you just live separately until then?", "Ok, in that case it's similar. Doesn't sound like there's been discussion beforehand here either, and you're taking the dog regardless of what your partner says. \n\nHowever, a dog is still a bigger commitment than a goldfish and has way more effect on the house as a whole. A goldfish isn't going to make noise, smell, get hair/drool on things, or interact at all with people who don't choose to go up to it's tank. A dog really isn't the same. If he hates dogs, it's not gonna be good for him or the dog to have him resenting it every day.", "You still shouldn't have lied about being pet free and agreeing with keeping it that way. You should have at least have a talk with him beforehand about how you want to have your dog back now that it might go to a shelter.", "Have you looked into any other rehoming options? It's not necessarily \"keep the dog or it dies\".", "Doesn't sound like it's too important to you tho. Especially when you try to justify your actions with the goldfish thing.", "Look, i think YTA for even making this agreement in the first place when you clearly love dogs, it seems like you made it out of being hurt due to missing your dog. But don't listen to these people who hate dogs telling you to rehome him. At the end of the day, a dreadful situation occurred and you made a choice (which I fully respect, id do the same). If boyfriend doesn't like that then you need to break up, but don't be angry at him for moving out when you literally told him to.\n\nHonestly dog lovers should never date anyone who hates them. It's like when 1 spouse wants kids and then other doesn't. It will never work.", "I can definitely understand why you didn't want your dog to go to a shelter, but you and your partner really haven't managed this very well. It sounds like the argument escalated and became about score keeping and ultimatums so I wonder if your relationship was really as  \"perfect\" as you thought. \n\nI agree that it doesn't  sound like you both care about each other enough, if you can't navigate this. NTA for saving your dog, ESH for the rest.", "You told him to move out, what are you upset about", "Its a damn dog not a baby", "Not a baby, calling a dog a baby is not normal and you should talk about it next time you see your therapist.", "\"My baby\" fuck off. You abandoned that dog for years. You're a major AH", "It’s a dog not a fucking baby. You didn’t birth it or breast feed it, get a damn grip.", "Then the relationship is far from perfect because he thinks killing your dog is a good \"compromise\". That's a level of asshole I couldn't tolerate.\n\nYTA because you promised no pets but he's the bigger asshole for thinking it's OK to demand you have your beloved dog killed be he hates dogs. I don't think I could even get serious about anyone who hates dogs.", "Ita dog not q baby.i am on my 7th dog", "In that case, NTA. Why was it okay for him to bring a pet home, but now it’s not? The agreement was to remain PET free, not dog free. \n\nHe brought a pet and kept it. Your dog that you’ve had for quite some time by the sound of it needed a home. \n\nThe principle remains the same IMO.", "And what happens if your parents decide not to cover the costs?  You don’t sound like a very responsible owner, you should give the dog up", "And it sounds like in that conversation, he told you he absolutely did not want a dog and you told him to accept it or move out. He moved out. It’s not fair to get angry at someone for picking what you think is the wrong option in an ultimatum. Can you be upset or disappointed? Sure. But it doesn’t make him an asshole.", "You’re free to see it that way. She clearly disagrees with you and agrees with me. And it’s her choice to make.", "OK - so you love A dog. So I don’t understand why you would think a relationship with someone who hates dogs in general would work", "They agreed on PET free life, so how is it ok that he brought in a goldfish?", "I have a 140lb kangol and he eats $45 of costco salmon and sweet potato dog food each month.", "Ok, yeah. That is fair. I just was raised with ‘if there is an animal in the house it is a family member or there is no animal in the house.’ So effort was shared whether you wanted to or not.", "This! I had a beta in an aquarium for 2 years in my office. It just soothe me watching him swim around. My husband forgot even it existed cause he never comes in my office. Modern aquariums are very serif sufficient and outo feeder solve problem for long weekends or short holidays. Our dog is another level. It’s like comparing with the care of a plant almost. Again no offense to fishes but yeah… they are more autonomous let’s say.", "Exactly a goldfish is less money and maintenance than a tomato plant!", "I had lots of fish in my teen years and loved each of them individually but I still think the same!", "It is still a living being and it is still considered by many as PET.   \n\n\nHe broke the agreement. Doesn't matter how small or big the offense is the point is still the same. He broke the trust and the agreement.", "Did she ever even tell him that the dog existed?", "Also, the goldfish probably died a week later anyway. Unless he's really into the hobby of keeping fish, the goldfish didn't last long.\n\n\nAlso Also, I doubt he went \"either I keep the goldfish or you gtfo\" like her", "Exactly! What did he expect her to do? Send the dog to a shelter? Have a dog she clearly loved since she struggled when her parents kept him euthanised because of an agreement that her partner already broke?!", "Its so funny how she is comparing a dog to a goldfish", "How is he a jerk. OP agreed to no pets too. He didn't make her get rid of an existing dog either she just brought one into their lives.", "It doesn't make him a jerk of not wanting to have a dog as a pet. It doesn't make him a jerk for being upset that she broke their agreement. It doesn't make him a jerk for deciding between an ultimatum that was being given.", "How's he a jerk? They had an agreement, OP broke it with little to no notice, didn't even talk to him about it, and then basically kicked him out of HIS SHARED HOME. \n\nHe has every right to be pissed off", "I rather have a partner that doesn't like dogs then a partner that lies and goes back on their word", "From my personal experience people who are loud about don't liking animals are selfish and generally not nice or good people. I'm not saying that's your case but that's what I observe in my vicinity. And I very much can and will judge people according to my standards. (and I don't even have pets, my partner is allergic)", "I know right! The boyfriend was with her throughout her time of not having anyone and suddenly she just drops him like nothing happened. 5 years of that.", "OP was the problem in that family for sure", "All of this. So many people underestimate the amount of work and money it actually takes to keep and maintain fish.", "For me this would be a hill to die on. I would never abandon my pet, especially at an old age.\n\nAt the same time his wish to be pet free should also be respected. You changed your mind about pets, don't expect him to do it to. This is something you might not be able to surpass, and you need to prepare yourself for that.\n\nEdit to add verdict: NAH", "I think this is important context to add to the story. If you had told him the background to what this dog meant to you, and how the alternative is your family euthanising it - then while he has every right to still not want to live with an animal in his home, a callous response to your dog being put down if he can’t compromise or be open to alternative solutions (even temporary ones) paints him in a different light to how I originally read your post.", "So he knows how much you love this dog but has no empathy at all for your situation and would rather see it be put down than be inconvenienced? Frankly I think that makes him the AH, not you. Pick the dog and be glad he showed you who he is before you tied yourself to him.", "NTA. You never abandon an animal.", "Boundary-involves your time, energy, body or property. Ie \"I won't be around cigarette smoke/I will be pet free\"\n\nAgreement-between 2 or more parties, consent is ongoing and retractable.  either party can renegotiate or revoke consent. \"we won't smoke in the house/we won't have pets\"\n\nA rule-tries to control the time, energy, body or property of another party. \"you can't smoke/you have to be pet free\"\n\n\nNow she absolutely did break an agreement, she should have informed him that she was revoking consent to it before she brought the dog home. She should also have been the one to leave as she is the one who changed the agreement.\n\nHowever if his boundary is that he's pet free, and hers has changed, then he's actually doing a very good job of enforcing it, as the only way to enforce a boundary is to remove yourself from the situation.\n\nBoundaries around shared homes tend to be the most complicated, since both/all parties tend to have an equal stake and claim on the property.", "She's re-negotiating the agreement and pray she does not do it further.", "As opposed to figuratively?", "No need for 'literally' in your statement", "agreed. A boundary is a limitation (either physical such as property line or emotional such as 'I won't be around people who do XYZ) agreed to by both parties.\n\nI think their biggest issue is communication. they both seem to act and suck it up or leave? that sounds mutually toxic to me.", "maybe you can define it as a boundary, but it's not a promise or a contract, it was just an agreement. She no longer agrees.\n\nIf he's not able to adapt and is completely turned off by a pet, he's free to leave the person we assume he loves. If he's that weak-ass, he might leave her for that, but nothing of value will be lost. It's that simple.", "We did discuss it before I brought the dog home", "And triggered, bah.\n\nWhat are we, guns? No.\n\nWe are humans and we get set off, we flip out, we lose it, we go wackadoo, we blow up, we mouth off, we pop a fuse, we do lots of things, but wow has social media caused our overuse of certain terms, while we no longer effectively utilize our vocabulary.\n\nI identify - jokingly - as a capg-u-n and I am triggered. ;-)", "woke is not overrused, it's still nearly the dominant cult that took over most institutions in the last 10 years, from culture to finance and government\n\nto point it out, you need a name for it", "No one said people can’t change, but it’s the fact that she didn’t even discuss it with him and just did it. He lives there too so he has some say in the matter.", "If it were adopting a random dog this would be a fully different situation. This was HER dog that she lost to her parents who kept the dog to spite her. If there was ever an exception to make, this would be the one.", "I mean yes, but seriously, she had to leave the dog behind 5 or more years ago. Assuming this dog wasn't a freshly born puppy back then the dog may already be older now. Depending on the breed there will only be a few years left. If you throw away a future of lets say 40-60 years bc you will have to go through 3-4 a little uncomfortable years, he most likely wasn't in for the long run anyway or is just the type to break up any relationship as soon they are falling on hard times, in this case the relationship had an end date anyway.\n\nIt would be different if she just showed up with a puppy of a breed that will need another 10-15 years of comittment to take care of it, thats a different story. But thats not what happened here. \n\nI say NAH - its just a question of how serious you are about your partner and what you are willing to sacrifice to spend your life with them. Life always happens. You can agree to be child- and petfree, and then your parents die in an accident and you are the only living relative for your minor sibling or to take care of their pets. Or an old ex gf/ons of him shows up at the door with a kid he didn't knew about. Etc. Neither leaving or staying is the right or wrong decision, thats why nah. Its just a personal decision.", "Because it’s a matter of life and death for the dog. It is not life or death for the SO.", "Because he loves her and the dog means something to her.  Ugh, you sound single.", "What’s the alternative sacrifice, her sending the dog to the pound. The dog being out down?  Ending up with immense trauma and guilt?", "And allow a family member to be put down? \n\nWould you say the same if this was a human child", "Because it’s *her* dog.", "And we have no idea WHY he hates dogs. Maybe he had a traumatic incident with one, maybe he's allergic. We need to know the reason. If it's just \"I hate dogs\" for no reason that's different", ">She flipped out on him for frigging goldfish... but \"somehow managed to get through it\". It being living with a goldfish...\n\nThere's no mention of how they \"lived through it\", it being IMHO the argument that followed. It's very possible she had him remove the goldfish during that argument. She never says she had to live with a pet following that goldfish situation 🤔", "Yeah and he's flipping out about a dog she loves.  Did dude love that goldfish?  Doubtful.", "I think it's 100% fair and I would probably do the same... But I would also accept that it means a breakup. It happens. You will find someone else. I do think it's ok that you consider the dog a member of your family, I consider my cat as such and I certainly wouldn't ever accept that he dies, I know I couldn't live with that remorse, while I could handle a breakup (despite being devastated). But your partner was very clear...", "I'm just not sure why you're trying to paint yourself as the victim here, you should be proud of the choices you make. I would make the same choice, but I would understand the consequences when I made it. You unilaterally decided to take in your best friend and beloved dog because you cared for the dog more than the BF. I absolutely love my dog more than my GF, if I had to choose I would choose the dog.\n\nWhy do you think he needs to pay rent, you both agreed no children no pets. You wanna make the rules for the house, you pay for the house. This is all fair and makes sense.", "Nope. You’re still the AH", "I was put into the exact same situation with my husband. The exception is that it's a cat, and he is allergic to cats. There was still a deal that was made that no pets would be brought into the home. Family or not. YTA, I don't blame you because I have my cat rn, but that doesn't change the fact that it was an AH move. My husband and cat are best friends now. Maybe it'll change for you? I am fully aware I am an AH in this situation, but I don't care. I wasn't going to leave my baby behind. We've worked through it. Now my cat loves him more than me.", "NTA if that guy can't compromise in certain situations, you dodged a bullet. Good on you for taking care of the dog.\n Please pay your dog tax tho, thanks!", "I'm not putting them in same category, however if he doesn't honor the agreement and boundaries of being pet free why should she?   \n\n\nEither both of them honor the agreement or neither of them in which case the agreement is void. I'm not defending how she went about it but agreements are to be honored by both sides.  \n\n\nRent is whole another question. If they are both on the lease then they are both required to pay because then it's up to landlord how they handle it but I don't know about their situation that's why I didn't comment about it.", "Oh yeah, next to no cost...", "Also, the goldfish probably was there a week before going down the toilet. Meanwhile he would have to deal with the dog for a good few years", "This! Exactly. You \"were fine\" and compromised when he got a goldfish, but dog is a completely different case, it was your choice to change what was agreed upon and it is his choice to not change on what was agreed upon. ESH", "So what, dump an older dog in a shelter so it can live unhappily ever after?\n\nI agree that OP is the asshole for the way they went about this (and the \"you brought in a goldfish so you're a hypocrite!\" thing), but I can't blame them for wanting their dog back.", "\"No kill shelters\" are extremely unethical. They refuse to pet down animals for both medical and behavioral reasons because they think a dog having a poor quality of life and suffering due to old age and illness or being locked up for the rest of its life for being too aggressive to be adopted out is better than euthanasia. These types of shelters are the reason \"kill shelters\" are overcrowded and have to put animals down due to said overcrowding. If that dog is taken to a no kill shelter and doesn't get adopted, a horrible life is almost guaranteed.", "Wtf\n\nDumping a dog in ANY shelter is cruel. Especially when you have a home for them", ">I just wonder how you would have reacted if he did the same thing with a kid.\n\n\nI would have done what I could to make the relationship work, if the alternative was letting the child die", "Could have become? I'd argue that bf of 5 years definetly should be already a family but oh well, whatever she likes..", "She wouldn't be the AH because sometimes shit happens and you step up for family, and yes this dog is her family.", "Thanks", "There was discussion beforehand, we tried to find other family to take the dog", "I love dogs, my kids ans partner don't.\nI made the choice to be with them, so I can interact with dogs elsewhere.\n\nSame is true for million of people. Whether it is about kids, dogs, place where to live etc. I love the seaside, but we will never live there.\n\nA relationship is a _compromise_. It can work only if people make their choices consciously and accept the consequences _for life_.", "They shouldn't date anyone imo, because dogs take up too much time and your so will always be and feel 2nd to that dog. 😐", "IT IS A FUCKING NICKNAME!", "Goldfish are just decorations, dogs piss and poo on the floor and they make noise and invade your space.", "Absolutely,  tomatoes plants are some demanding bastards! (For people not into gardening, this is not an exaggeration)", "Alright, but then her options were to accept the fish or not *then*, and break up or not over it *then*. Same as his options are now. \n\nOP's perfectly justified in wanting to keep her dog, but a dog is not comparable to a fish, and she has to accept that and that the relationship is over. You don't spring a dog on your partner - even a dog-loving partner - and tell him to get onboard or move out, and then still expect to keep a relationship and get rent after they move out.", "A pet that can't even walk around and make a mess. A pet that most likely was alive for a month at best. He didnt break shit", "For real. I'm a hardcore dog lover, have rescued and fostered abused dogs for 10+ years, and I'm *baffled* at the notion BF was in any way wrong here. \n\nLike, I get why OP's choosing the dog over the relationship, but how does she not see that choice means she *loses the relationship*?!", "Are you vegetarian? I hope so. Many people who are loud about \"loving animals\" are very hypocrites. They don't love \"animals\" (despite saying so), they love \"some specific animals\"... which, in the grand scheme of things, is very similar to people who don't like animals. So we come back to the fact that this is all very subjective lol.\n\n(I'm not vegetarian. This is why I don't judge people for how much they like animals or not... Clearly, me and them are very similar regardless of what we say, because I love \"some animals\", which are very few compared to how many animals we don't care about)", "Dumbest take ever. Hating pets does not make you a bad person. Maybe they just don’t like the maintenance or having to clean up after pets. Maybe they don’t like the smell. And yes, dogs fucking smell bad idc what dog lovers say. Even cats can get bad.", "I love animals, and I absolutely hate the way humans feel like wantonly killing other living creatures is fine. Makes me loathe the human race on principle.\n\nBut that’s not at all the same as not wanting to take the responsibility 24/7 for another living thing. That’s usually what being “loud” about not liking animals boils down to - a personal dislike for the idea of having to deal with the responsibility and consequences (poop, noise, hair, etc.). If anything, people who claim to love animals but don’t care for them appropriately are far worse.", "That’s what’s most disturbing about OP in my opinion. If anything, I think the boyfriend might be dodging a bullet here.", "100%", "Totally agree. We have a bristlenose catfish my partner rescued 8 years ago, and he takes work and money.", "yes same here, this is a hill to die on", "The boundary is that he doesn’t want a pet in his home and she bought one against his will. That’s the problem. She can “revoke her consent” and get the pet but doing it in their shared appartment is a no go", "Yes ?", "I think the point being bringing the dog INTO their home literally crossed a boundary.", "Disagree. It gets the point across, no need to be so pedantic", "I suppose it depends on how pessimistically you want to view relationships, but agreeing to date someone is a sort of mutual contract. Ideally, you have conversations about what it is you both want in life and if everyone agrees to those terms, the relationship continues. Now, if they had never discussed being pet free and suddenly she brought a dog home and he left because of it, I would say they need to ha e a serious conversation, review or ammendment the terms and agreements of their relationship, or go their separate ways. However, since this had been discussed, and even previously fought about when he brought home a demonstrably less impactful pet, she has knowingly and willingly broken the terms of their agreements. She has broken their relationship contract. Again though, I thi k this whole thing could have ended differently had they just had open comms instead of her trying to get back at him for the goldfish. And yes, technically he broke first, but they obviously worked through that. So knowing how that went, she should have proceeded with more care, instead she sought to get even.", "How'd that discussion go? Why wasn't it in the main post?", "And did he say absolutely not? Did you have that info and still brought the dog home and was surprised he followed through?", "Did you actually discuss it, or was you telling him that you want to get the dog and he will had to deal with that?", "‘Can I get a dog’\n‘Absolutely not’\n‘Great, here’s a dog’\nIs not a discussion…", "So you still brought home the dog knowing your boyfriend hates them? \n\nCommunication is a bit more than an exchange of words. You can spend all day talking *at* each other but letting the words go in one ear and out the other isn’t communication - especially if you’re going to grill him over a goldfish. 2 wrongs don’t make a right.", "go woke get broke. now that is over used.", "Yes but you have to look at it from his perspective. It doesn't matter to him if it's her dog or a random dog, a dog is a dog and apparently it's a dealbreaker for him as he simply doesn't seem to like dogs in general. They agreed to have no pets and I don't see why his aversion to dogs would change in this instance or why he should make an exception. It's obvious that one of them has to go because I don't see any of them giving in on this matter.", "Yeah this is what I was going to say. The dog is at least over 5 years old and is hers. It’s not like it’s some random dog.  It is already trained and well past the puppy years. I couldn’t imagine not being able to compromise on this, and I’m definitely not a dog person.", "BS, why should it mean life or death for the dog? In my country it's strictly forbidden to kill dogs as animal protection is heavily promoted by the government. I don't know where you are from but even if you don't have the same laws in your country it shouldn't be too hard to find a nice animal shelter where the dog can be adopted or if OP is so terrified she should try to find new owners for her dog herself.", "And she doesn't love him and his aversion to dogs doesn't mean anything to her? In your opinion she should get a free pass on this based on what? Because the love for a dog is more important than anything? You can't put that above someone else's feelings, especially if they seem to be that strong. If you don't realize that maybe that's why you are single because I'm definitely not.", "Ugh, you sound obnoxious. From what I gather she didn’t even talk to him about that decision. And she literally put the dog above her partner. She admits that. I wouldn’t want a partner that puts her pet that she didn’t see for 5 years above me lmao. Especially after she agreed to not have pets.\n\nI’d rather be single than deal with that shit", "**selfish. Normally equates to being single.", "People who compare animals to humans are just psychopaths. Anyone who thinks their dog or any animal is as important as their child needs to have their children taken away also.", "Give the dog up for adoption. Doesn't have to be put down.\n\nIt's not though. Don't bring up 'ifs', its not a human. And yes, if one thinks they can't raise a child, then they don't have kids in the first place or give them up for adoption. Break up with your boyfriend, he should spend his time with someone who actually respects him and his feelings.", "I'd absolutely put down a dog over a human child anyway.....", "Of course not… cus it’s a human child lol…. Do you think that’s some “gotcha” to compare a dog to a human child? That’s a ridiculous comparison.", "I don't know why you assume there is no other way for your dog than to be put down. Where are you from? In my country it's forbidden to kill dogs and I don't see why you shouldn't be able to find a nice shelter for the dog where he can be adopted or just go and find new owners for your dog yourself.", "So what? Doesn't really change anything for him. He dislikes dogs just the same.", "Exactly!", "I also “ignored” my allergies to co-exist with a cat my ex-partner had and it led to tremendous health issues for me and my breathing. I hope you are encouraging your husband to follow up with his doctor to know how living with an allergen is impacting his overall health. I did not and I ultimately had to put my health first, and left the relationship. It often shocks me how often others expect their partner to ignore a health condition in order to justify pet ownership. It’s a dehumanizing feeling to see your partner ignore all the wheezing, teary eyes, constant sneezing, needing an inhaler every day, taking allergy pills and being drowsy, itching my nose and ear multiple times a day without any other recourse or considerations.  I hope that is not the case with your husband.", "It's not a compromise. A compromise would be them having the dog at home until they find a new home for it. As fast as possible.", "In what sense is this a compromise?\n\nA compromise is when both parties come to agreement. She just decided to do it without telling him. \n\nThat's not compromise that's just doing what you want to do despite your significant other's wishes. That's why she's the ah", "I had a beta fish in My home office which my husband realized he was still ‘alive’ when I informed him over breakfast that the fished had died the night before. ‘Oh I thought he died last year’… this is how much a fish impact your partner life. Our dog is another thing.", "Then why did you even agree to be pet and child free at all if you knew you have a soft spot for them? Having a dog changes life, just as having kids. Also, it could be that he doesn't like them because they bite him. Just as I wouldn't want any in my home because I don't want to be scared and uncomfortable at my own home. Don't make agreements that you can't hold to, simple as that.", "Sure... you flipped out over a goldfish, but you would take in a whole child. Uhuh sure, we all believe you.", "It was sarcastic dumbass", "Dumb take.", "If it requires feeding and cleaning of it's enclosure it's a PET. Last time I've checked Goldfish requires feeding and it's good to clean their enclosure once in a while it's a PET.  \n\n\nTheir agreement was being PET free.", "As someone with a parent who grew a shit ton of tomatoes, this is absolutely not an exaggeration.", "Now I’ll have more respect when I pass the tomatoes in the grocery store. Some wizard worked their magic to grow those suckers", "Yes and I never said OP is not TA for how she handled the situation.\n\nHowever they are bot TA because they don't hold their part of the agreement and they are both going nuclear.  \n\n\nEdit: to fully finish my thought. OP is right the the principle is the same. If they agreed not to bring in PETS then neither of them should bring in PET even if it is just a goldfish", "IT DOESN'T MATTER. They agreed on being pet free and he brought in PET.  \n\n\nI dunno why reddit commenters have such big issue comprehending that he still broke the agreement!", "I'm a dog mom, I love my baby, which is why I would never date someone that doesn't like dogs. Not only because I want to keep my dog, but also I'm not going to force someone to be around an animal they don't like.\n\nIt's the same as smoking, I dont like cigarettes, so I'm not  gonna date someone who smokes", "I feel like OP was the problem in her family. Any major inconvenience or someone not bending to her will and she throws that person out like they were acquaintances", "Yeah feels like it too.", "Other people can’t “cross your boundary”. He set a limit and he enforced his boundary by leaving. Boundaries are our own limits about what we will/won’t tolerate.", "She broke an agreement, yes. And like I said she should have been the one to leave. But since she didn't, they now need to figure out the lease. If bfs name is on it he's liable if she stops paying too, or only  pays her share. The landlord isn't going to care about interpersonal drama for whatever reason. \n\nBut agreements, rules and boundaries are not synonymous nor should they be used interchangeably.", "I think it figuratively crossed the boundary.", "it just tells us what both sides thought more important\n\nshe thought the dog was more important than her partner\n\napparently, he agrees that the dog is more important to him than his partner, too, if dog then no longer partner\n\ntells you what kind of barren relationship that was", "why did he get to bring home a goldfish without asking her first then?", "I'm in the US. Animals can be put down simply because there isn't anymore room in the shelter and they've been there too long.\n Overpopulation of shelters and stray animals is a huge \nproblem.\nEdited to add: If you want to get rid of an animal you either know someone or get on a wait-list for a shelter. If you don't carefully select someone to give a pet to than you risk giving away your pet to someone who would use it for dog fighting bait.", "It's lovely that _your_ country cares about animals so much. Most countries aren't like that. In the U.S. the shelters are overcrowded and understaffed, the rescue groups are beyond slammed. Millions of pets are euthanized every year because they were unwanted.", "Because of the massive wave of people who returned their pandemic pets once things opened up, normalized and many people could not wfh anymore the shelters in many areas are absolutely bursting full.\n\nIf that is an older dog, there is indeed a good chance that he won’t get adopted out anymore, because there is so much younger and probably cuter competition; in addition to the shelters social media sites and websites like ND are full of the constant “looking for home for my pet” post.\n\nAnd yes, kill shelters at least in the US absolutely do exist; what else do you think shelters are doing, if they absolutely do run out of space?", "Because the love for the dog means something to her.  This isn't like the goldfish, this is a part of her family and there's actual history here.  I doubt you're in an actual healthy relationship if this is how you see things.  Sad.", "We did discuss it, he didn't care that my dog might be out down", "It was her dog and it knows and loves her. It just lost its home with her parents and would be cruel to just give it away to another home.  Would be different if this was a new to the family animal rather than one she had to go to therapy over the loss of when parents kept it.", "You’re obviously not from the United States.  Animals are euthanized all the time here.  Most shelters kill them after a specified time if there is no one to step up and adopt the dog.", "“So what” is a response that make sense coming from a random redditor. Not from OP’s partner.", "Fortunately (or unfortunately, however, you choose to look at it), I am the only reason my husband sees the doctor for any reason at all. I don't expect him to ignore his health. He was free to leave if he wanted to, and I wouldn't have faulted him at all. Maybe your partner just didn't care about you because my husband has to deal with none of that. That sounds absolutely dreadful, and I'm sorry you had to endure such a severe reaction. You must have really cared to put yourself through that, but im glad you chose yourself in the end.", "Yeah, a fish is more of a decoration than pet- very little work or attention needed.  A dog needs food, vet trips, lots of attention, has to be cleaned up after and provides love and companionship, \na fish takes very little work (but can be expensive) and never leaves the aquarium. But what do I know- I love animals and have always wanted children so I REALLY don't understand people with this attitude.", "Tell me you don't understand what I'm saying without telling me.  \n\n\nThe both broke the agreement. He did it first with goldfish. Goldfish is a pet and their agreement was being pet free. End of story.  \n\n\nI dunno how to explain that in simpler terms.", "The issue about the goldfish was a complete lack of communication, he didn't need to bring home the fish \n\n\nIf it was literally life or death for the fish it would have been completely different", "To each their own. But pushing a dog onto someone that doesn't want that is even dumber. And them acting all pikachu face why they moved out and don't pay rent?", ">Some wizard worked their magic to grow those suckers\n\nThank you. I do try.", "They are? How is the boyfriend \"going nuclear\" for movig out when told to move out?", "A goldfish is barely a pet. It's a hobby and a decoration", "I just explained to you why it wasn’t just an agreement but also a boundary. It’s his home and personal space and that space got invaded against his will. Imagine if she just decided to let her family live in their shared home against his will. It’s absolutely crossing a boundary and if it’s important enough for him to leave his home, it’s obviously a big deal to him.\n\nLegally, he probably needs to pay but morally I absolutely think he’s correct when he’s not paying. She basically forced him out so she should take responsibility and pay full rent. Like you said, she should have been the one to leave. Not him.", "The boundary of entering the apartment door.", "that he is also an asshole doesnt mean she isnt YTA", "Yeah I agree that that was stupid as he also broke that agreement. Still, a goldfish would not impact OPs life very much, a dog on the contrary would impact his. But other than that yes, I totally agree that his action was stupid.", "The issue is that you took the dog in your shared appartment. That’s what makes you the asshole here. If your partner was against getting the dog, you should have moved out and then taken the dog. Instead you forced your partner out. It’s just shitty behaviour", "Yeah, but by the time you met him, you made agreement with him, all those five years you spent him, that dog is essentially ‘not’ your dog. If it did, you should have said since start that you indeed have a dog, just not physically with you. You then should not make the pet free agreement. Pet is a big deal, yet you brush it apart when you got with your partner.", "That should tell you all you need to know. He’s not a keeper. Don’t waste any more of your time on this person. He doesn’t hold you close to his heart.", "The dog deserves to live out the rest of his days with family he knows and loves.  If fiance can't handle a change of plans for a couple years knowing how important the dog is to you, then screw him. You did plan for this unlikely situation and it would probably be detrimental to your mental health and would build resentment for your fiance anyway, should you get rid of the dog.  If you went and adopted some dog then you'd be a huge AH.", "I agree but she knew her partner didn't want pets, and had a particular aversion to dogs. Her partner leaving is a consequence she has to accept if she wants to keep the dog.", "No kill shelters are a thing eh. Nobody said she even has to give it away. But yes it will\nComport ending her relationship. It’s ok eh. To begin with their choice to not have pets stems from different things. One was a trauma that can be healed and eventually she can even wants more dogs. He hates them not gona change.", "I think that is a bit reductive and dismissive, but I appreciate the last sentiment and wish you all the best to your husband.", "obviously, the care needed for fish is in no way comparable to a dogs, but id like to add that especially goldfish require a lot of care! they get huge  (theoretically up to 16 inches) and you need more frequent water changes as they produce a looot more waste than the average fish.", "Everyone gets that. They're saying it was broken to different degrees. Like how if you break the speed limit by a few km/hr or by 30. The latter is generally considered much worse", "In simpler terms, the goldfish never poops or pees in the living room, barks at anything, chews on furniture or slippers, hops on your bed, sheds all over the house, or licks you. Both are violations of the agreement, but the two situations are not even vaguely comparable. Goldfish in a bowl are a technical violation of the agreement. A dog is an obvious, in your face, blatant violation of the agreement. \n\nMost landlords would overlook goldfish as a violation of a no pet clause. They would definitely not overlook the presence of a dog. As a landlord, I have had  to replace doors chewed up by dogs. I have never had to repair damage done by goldfish.\n\nSometimes, you need to look beyond technicalities and focus on the practical impact of things.", "By not even willing to discuss how to handle the situation...", "It's still a PET!  \n\n\nBut good on you... Happy to see that you wouldn't be able to keep an agreement.", ">It’s his home and personal space and that space got invaded against his will.\n\nIt's hers too. That's why it makes it complicated. Their boundaries around their home cancel out basically. So it's the agreement that they made that is what was actually broken. Semantics maybe, but I feel like it's an important distinction. \n\n>Legally, he probably needs to pay but morally I absolutely think he’s correct when he’s not paying.\n\nI agree with that, but it could fuck up his credit or she could use it against him. He needs to break the lease ASAP if he's on it. If he isn't, we'll then absolutely he shouldn't pay and instead look for a place to rent in his own or with a friend.", "I see your point but OP's bf broke the agreement once too, and OP accepted it. In bfs case it was him randomly bringing goldfish, this is her taking in a dog she owned before and lost and would be on the streets if she didn't take her in.", "Did you miss the part of where she got therapy for it. No matter what, the partner is hopefully aware of her very real issues that resulted from her parents denying her her dog that she went to therapy for.", "Well, I'm sorry you feel that way. Thank you for the well wishes, and I wish you the same.", "Agreements are usually not speed limits though. Agreements about relationship are matter of trust and they should be honored from both sides. Their agreement was to be PET free. Goldfish is PET. Dog is a PET. They didn't have agreement to be DOG free but PET free.  \n\n\nHe didn't honor his side so saying he is not TA is just dumb and OP can feel justified in not honoring the boundary because she kept it for years. He didn't.  \n\n\nThe situation would be different if he never broke the agreement and she brought in the dog, however that is not the case.", "Agreements and boundaries should be still fully honored by both sides and if one side is not happy with the agreement then again both sides needs to agree on changing that.  \n\n\nHe broke her trust and the agreement first. They are both Assholes that failed to communicate properly but still excusing him for breaking agreement because it was smaller offense is BS.   \n\n\nI might get downvoted to hell but it is what it is. At least I can see how many people see no issue in breaking agreements.", "Goldfish require a regularly cleaned tank that grows as they grow, food, heat, water treatments. It's not 'just a goldfish' there a commitment to the care of the fish same as the dog. It may not be as demanding as the dog but don't act like a fish is that easy to care for. I had a fish for 5 years as a teenager, probably would still have it if I could've gotten it a bigger tank. Beyond that as everyone keeps repeating the agreement was no PETS. Not no dogs but a goldfish is ok", "Boyfriend did discuss, prior to getting the dog. He clearly said he wasn't up for getting the dog. What would compromise look like here, it's a binary choice, one of them would clearly be unhappy. \n\nPlus, *OP told him to move out*. After that, what was there to talk about?", "No it doesn’t cancel out at all. And it’s not complicated. No idea how you got to that conclusion, she brought a third party into their arrangement. You’re using mental gymnastics to justify it.\n\nEdit: I hate when people delete their comments when they look stupid. Cowards", "A dog is a lot more work and hassle then a goldfish", "The goldfish thing reads like satire. It’s literally decoration lmao. As if a little goldfish bowl that’s just sitting in a corner is comparable to a dog", "He is fully aware of my dog and my feelings for him, we had discussed our past", "A third party would be a human being.  Not a pet.", "It's really not. Goldfish are a lot of labor.", "Yeah that's why I think why this is a sucky situation for him either I think you are not an AH for wanting to take care of your dog."]}