{"id": 34356, "submission_id": "18ywf0k", "title": "AITA for telling my bridesmaid that she can't wear the same hairstyle as me for my wedding?", "selftext": "My (25F) bridesmaid (25F), Nola said she does not like the hairstyle I have picked for the bridesmaids and is going to be wearing the same hairstyle as me. When I told her no she got very upset.\n\nMy bridesmaids are wearing a messy bun, and I'll be having my hair down in Hollywood waves.\n\nFor context, we've known each other nearly 5 years, but haven't kept in touch much in the last 2. The only reason she's a bridesmaid is because she called me up on a promise I made her 3 years ago saying that I'd make her my bridesmaid when I got married.\n\nI'm really bad at saying no, so I said yes. I got her the bridesmaids outfit and accessories (I am paying for everything - they are paying for their own hair & makeup).\n\nNola has already said she doesn't like the bridesmaids outfit and asked me to change it. I was unable to as my other bridesmaids loved theirs and the dresses were non refundable.\n\nI also asked my bridesmaids to wear any  colour of the rainbow to my bridal shower, and I told them I'm wearing white.\n\nNola said, \"I'm wearing pink\"\nMe: Uh, sorry but pink isn't a rainbow colour. Did you want to pick something else?\nNola: Fine, then I'll wear white\nMe: That isn't a rainbow colour either and I'm wearing white, how about you wear green?\nNola: I'll think about it.\n\nI've already asked her to cater to my above requests (not changing the bridesmaid dress & wearing a rainbow colour for the bridal shower)\n\nAITA for also asking her not to wear her hair like mine & wear it like the rest of the bridesmaids?", "created_utc": 1704424252, "permalink": "/r/AmItheAsshole/comments/18ywf0k/aita_for_telling_my_bridesmaid_that_she_cant_wear/", "score": 3834, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I asked my bridesmaid not to wear the same hairstyle as me on my wedding day (2) I have already asked her to cater to my other requirements and not sure if I am asking too much of her and being a bridezilla.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. But OP, she had to push you into making her a bridesmaid, and she knows it. She’s self-centered and making trouble deliberately. Please tell her that since she doesn’t want to do the gig as defined, she’s out. Don’t give her another chance or she’ll show up on your wedding day looking like you. You’re allowing a lot of flexibility but she’s set to hit you with it.", "NTA but stand up for yourself and ask her to step down as a bridesmaid because it clearly isn’t working out. I’m sure seems scary to do so but do you really want this stress and negativity for your wedding day?", "NTA but you would be if you let her walk all over you! Sit her down and lay the law, tell her how it’ll work or she can be a regular guest or not come at all", "Maybe as a man I'm a bit biased but this seems a complete waste of time and energy.\n\nESH.\n\nWhy do you care so much about other people's hair\n\nWhy would she be so stubborn about a hair style.\n\nEveyone needs to relax more.", "NTA, stop being a walk over. Grow a spine. Cut her.", "I’ve been a bridesmaid numerous times and have attended many weddings (including my own) over the years. I’ve never known a bride to require her bridesmaids to have the same hairstyle. That seems very excessive and controlling. Since you’ve already made an exception for this particular bridesmaid, why not let ALL the bridesmaids choose their own hairstyle? That way this bridesmaid’s hair style won’t stand out so much. Are you so insecure that you don’t want your bridesmaids to choose flattering hairstyles?", "NTA\n\nShe's definitely playing games with you, especially the wearing white bullshit...giving you unnecessary problems at literally every turn\n\nJust do yourself a favor and drop her...or if you really really want to keep her, tell her exactly what the dress/color/hair etc is gonna be. Period.", "Since when is pink not a rainbow colour?? It’s literally the third colour in the rainbow song! \n\nMy wedding was 15 years ago and my advice to you is to let go of the petty stuff - shit is going to go wrong regardless of how hard you try to control it. You can decide how much you want to let these imperfections affect your enjoyment of your wedding day. I can guarantee you that, a month after the day, the only person who will remember those details is you (and maybe some of your wedding party). Focus on what is important and let the rest be what it is.", "I think you probably should tell her that. I think the only issue I have is you using the phrase \"All the colors of the rainbow\". Maybe I'm the only one but I thought that phrase meant ANY color and did not realize (as I just looked up) it specifically meant ROYGBIV..... There are shades of those colors though.... But I'm arguing semantics now and they don't really matter as she picked white next .... That and the hair... she's unreasonable and shouldn't be in your wedding period sounds like.", "If someone told me I could wear any colour of the rainbow, I would not take it that literally. Usually when people say that they simply mean any colour. That being said, I think it is ridiculous to tell people what colour they can wear to a bridal shower. \n\nI also wouldn't worry about how my bridesmaids had their hair done. This is a good thing, too, because I just realized that my MOH had pretty much an identical style to mine. I never even thought of this until now because with different colouring, figures, heights, etc, we still looked pretty different.\n\nYou will be the radiant bride in your gorgeous gown and nobody can take that away from you. Relax a bit and let your bridesmaids have fun and feel good about their appearance, too.", "Y.T.A. Grow a backbone and kick her out of your wedding.", "ESH. No one will notice her hairstyle. Seeing it from your pov, she seems very annoying and making it about her. You don't seem to want her there. Grow a spine and do something about it.", "Making fun of your fiance is a great reason to cut her out.\n\nI’m sorry but I want people on both sides that are standing up for us to be supportive. You making fun of the man I love is not being supportive. I think it would be best if you come as a guest or not at all.\n\nYou should have to be worried about her comments or her making issues about hair and dress.", "NTA. Sounds like there’s a good reason you haven’t kept in touch the past 2 years. Nola sounds like the worst.", "On the core question, NTA.  It is rather presumptuous to want the same hairstyle you have.  However, I think you may be being too controlling on having everyone have the same style instead of some range of updo styles.  I also think you being too controlling with what is worn to the bridal shower (since when do bridal showers have color dress codes?)", "ESH - eh, she seems difficult but - so do you. \n\nDress is fine but the exact same hairstyle? And what to wear to the rehearsal? Thats too much.\n\nEdit -bridal shower outfits, not rehearsal", "YTA to yourself. Kick out the person you don't even want at your wedding for causing drama. There was a reason you haven't hung out in the last 2 years.", "Nobody the F is going to notice her hairstyle. No. One. At. All.", "NTA wanted white, would accept pink, wants the same hairstyle as the bride, small town, cashed in a drunk promise....\n\n\nI imagine if she had the choice, she would choose pale pink that could be mistaken for white. It seems like she might want some attention at these events or to be mistaken as the bride.\n\n\nYou know her personality more than us and how far she might take things its not impossible to drop her you said it yourself you haven't really kept in touch much for the last 2 years what would the loss be.", "Info: how many bridesmaids and what if they all chose their own hairstyles? She would then not stick out as having the same hairstyle as you.\n\nIt feels like you regret having included her and now want reasons to cut her.  You will definitely find them if that’s the case - or you can remember that *everyone is looking at you* at your shower and most of the time at the wedding too.  No one mistakes a bridesmaid for the bride.", "Honestly? No one will care how she wears her hair. You’re the bride and everyone is coming to see you. If they’re paying for their own hair, let them do what they want.", "YTA to yourself, just kick her out of your bridal party. She’s not your friend.", "I never knew choosing hair styles was a thing until my bridesmaids and I were getting our hair done the morning of the wedding and the hair stylist questioned my sister’s choice of hair style because it was the same as mine (which was Hollywood waves by the way). Based on the fact that the hair stylist questioned it, I assume it happens a lot. We both wore waves and we both looked fabulous. As another poster said, people are looking at the bride.\n\nPink for the other event sounds fine though. \n\nSo umm, NTA I think.", "God. Don’t do messy buns. That is such a shit look on everyone. \n\nYes it is. \n\nYour wedding pics will look dreadful now and forever. Mark my words.", "Pink is not a rainbow color? That's the one thing you should have allowed. I grt it, the bride decides a lot of things, but the bridal shower attire, too? In all other respects, you are NTA. I'm assuming the dress is nice. The hair is on trend. She's being difficult. Maybe you are too a little?", "NTA.  Think maybe change your mind about her being a bride’s maid as she doesn’t seem pleased with anything about your wedding plans. As a guest she probably will dress like a bride. Maybe even as a bride’s maid try to steal the limelight.", "You already know you’re NTA. It’s so obvious. The real question is how to summon up courage and kick this bridesmaid out", "NTA. It’s not uncommon for brides to have different hairstyles than their bridesmaids (for my own wedding it was my hair up, theirs down)", "NTA, kind of. You are doing yourself and your fiancé a disservice by not standing up to someone you don’t particularly like and who makes rude remarks about your fiancé. You don’t want your memory of your wedding day to involve stress about this person. Sometimes stress about family members is unavoidable. But a now-distant friend? Not worth it. Stand up for your fiancé as well as yourself. \n\nRe the your actual question - based just on the hair, I’d say NTA. Demanding people wear set colours to a bridal shower seems overly controlling and kind of demeaning to me but I don’t want to judge on that because you’re in an uncomfortable situation with this apparently pushy Nola. It seems like the real problem is keeping her involved at all. \n\nGood luck and I hope you and your fiancé enjoy your wedding with minimal stress.", ">Uh, sorry but pink isn't a rainbow color.\n\nLyrics to \"I can sing a rainbow\" :  \n\nRed and yellow and **PINK** and green, purple and orange and blue. I can sing a rainbow, sing a rainbow, sing a rainbow too.\n\nNTA, but pink is definitely a rainbow color, so you might want to rethink that argument. Yeah, trying to copy the bride is grounds for yeeting her out of the wedding party.", "NTA. Just cut out her. Seriously. This is your wedding. Who cares if you promised her three years ago. This day is about you and not her. She is going to keep giving you grief unless you do something about it now.", "Grow a backbone and stand up to her.  No is a complete sentence.  You had to assign a bridesmaid to keep her away from you?! Why would you want someone like that in your wedding? This is your fault bc you’re behaving like a doormat. She literally makes fun of you and your fiancé. I’m really searching for a reason she would even be at your wedding bc she sounds like a dick.", "YTA for dictating a hairstyle and requiring your bridesmaids to pay for their hair.", "NTA and she is doing a lot and seems rather annoying", "[deleted]", "NTA, This wedding is all about you!!\n\nSheesh.. a true friend knows whether she likes it or not, she can suck it for you.. for your wedding!!", "NTA... it's your wedding.  That said, I don't think it's necessary for all the bridesmaids to have the same hairstyle, and I've never been to a bridal shower where I had to dress in themed colors.  So there may be wiggle room here if you're just doing what you think you should.  But if these things are important to you, they're not unreasonable, and I can see wanting to be the only one with your hair down.  There may be compromise room if she wants a different updo that isn't a messy bun though... your call.", "[deleted]", "NTA. She sounds self centered and ridiculous. This is NOT someone you want in your wedding party. She’s giving “I’ll announce my pregnancy during your reception” and I can’t stand that. What a pick me girl with outrageous attitude. This is YOUR day, not hers. Your day, your say.", "NTA, and consider dropping her as a bridesmaid. She’s not being supportive of you and she’s creating drama where it is not wanted or required.", "OP, this is YOUR wedding.  Nola is not the star of this show.  Tell her to fall into line or get tf gone.", "She’s a shit stir", "No! Your wedding, your rules (which are reasonable). Perhaps it's tiime to set firmer boundaries, any more hassle and she's no longer in the bridal party. It sounds like she is self-centred and it wouldn't surprise me if she does whatever she likes and derails your day.\n\nNTA\n\nEdit: have added a comment later as you've given us more info in your reply OP", "NTA\n\nDon’t just tell her she can’t wear her hair like you tell her she’s out of the wedding. This is your day and like I told my friend when she got married and I was her bridesmaid, if you wanted to have a nudist wedding then that’s what you have and everyone needs to accept that.\n\nYou are not there to bend over backwards to everybody else’s requirements, not on your special day.", "I would have one less brides maid", "NTA, What's worse the discomfort of a moment of saying no,  \nOr this prolonged torture", "NTA. Tell her that if she doesn't like the hairstyle chosen, or anything else, she's welcome to remove herself from the wedding.", "NTA, she sounds like she doesn't want to be a team player. Wearing her hair up for one day won't kill her and the fact that she thinks wearing white to your bridal shower is okay, just shows that's she's trying to be difficult. If your other bridesmaids think the dresses are nice, they surely can't be that bad. And you're paying for them...So many reasons why you're NTA. I wish you had the courage to exclude her from the bridal party.", "NTA Fire her from her duties. She sounds obsessed.", "You don’t have to promise for someone to be a bridesmaid, it’s your wedding, have one less or a substitute it’s not her day to dictate.", "NTA. Just tell her not to come to the wedding at all and never talk to her again? You’re not even real friends, barely kept in touch for 2 years, and now she’s annoying and causing ridiculous drama. Wanting to wear white to your bridal shower? Lmao. Block, delete etc", "She's making a huge fuss and making more trouble than it's worth. She bullied her way into the bridal party (probably to get a free dress) and has complained the whole way. A bridesmaid is there to support you and help you. She's doing the opposite. \n\nTime to give her the flick and ask her to step down. I'm sorry but this doesn't seem to be working for either of us, I think it's better you attend the wedding as a guest", "I would just uninvited her. She sounds like a handful", "Nope. \n\nStraight up your response is I’m wearing my hair down, bridesmaids are up. The comprise of letting her chose the up style. I let my bridesmaids decide their updos and the hairdresser just made sure they all looked cohensive. TBH try to deal with this before the big day but most professional hair and MUAs are good at managing this sort of thing, but make sure they have the heads up there may be an issue.", "Well normally you would be, but it's your wedding so you are entitled to that. so NTA", "NTA. You need to tell her you don’t want her in your wedding. This is like my ex calling me up demanding I have his baby because that’s what we once talked about years ago. If you don’t, you may regret it later when you see her in all your wedding photos. Don’t set yourself up for unnecessary drama on your wedding.", "NTA. However please grow a spine and kick her out of the bridal party. It seems that she wants to be the center of attention at your wedding. Please kick her out. You seem sweet but come on", "OP needs to get her MOH to tell this clown to settle TF down and know her role. NTA, its your wedding, be selfish as you want.", "NTA but tell her that she's no longer welcome because she's being a brat.", "NTA. \n\nYou do realize she’s going to escalate and you’re either going to spend money editing her out of the pictures (but not your memories) or just not enjoying them as much when you see her mug in them. \n\nAt this point I’d just say “Nola, it’s very clear we have different visions and opinions on how my wedding should be and this has been an ongoing issue. I do not need any additional stressors and have decided that I no longer want you to be a part of my wedding in any capacity. I wish you well.” \n\nShe forced her way in. Force her back out or everything else she does is on you. \n\nYou deserve to have the wedding of your dreams. Remember that.", "LMAO. No, NTA. Tell her it’s your wedding and she can get with the program or fuck off.", "NTA and she shouldn’t even BE a bridesmaid", "NTA\n\nI beg if you, kick her out. You’re going to end up looking back at your wedding day and whatever incident and/or scene she caused", "NTA - but why bother?\n\n>we've known each other nearly 5 years, but haven't kept in touch much in the last 2\n\nI'd be cutting my losses and ditching her.  It's pretty obvious that you aren't that close.  With the negativity her in your bridal party is bringing to your wedding, whether she is in it or you kick her out, I doubt you'll stay friends afterwards.\n\n>Uh, sorry but pink isn't a rainbow colour\n\n*Red and yellow and **pink** and green*\n*Purple and orange and blue*\n*I can sing a rainbow*\n*Sing a rainbow*\n*Sing a rainbow too*\n\nAre the lyrics I know, so YTA here.", "Just fire her. There’s enough stress with weddings, why add to it?", "NTA. So are you kicking her out of the wedding or no? Bc do you really need this energy for the day??", "Get rid of Nola from your life.\n\nNTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (25F) bridesmaid (25F), Nola said she does not like the hairstyle I have picked for the bridesmaids and is going to be wearing the same hairstyle as me. When I told her no she got very upset.\n\nMy bridesmaids are wearing a messy bun, and I'll be having my hair down in Hollywood waves.\n\nFor context, we've known each other nearly 5 years, but haven't kept in touch much in the last 2. The only reason she's a bridesmaid is because she called me up on a promise I made her 3 years ago saying that I'd make her my bridesmaid when I got married.\n\nI'm really bad at saying no, so I said yes. I got her the bridesmaids outfit and accessories (I am paying for everything - they are paying for their own hair & makeup).\n\nNola has already said she doesn't like the bridesmaids outfit and asked me to change it. I was unable to as my other bridesmaids loved theirs and the dresses were non refundable.\n\nI also asked my bridesmaids to wear any  colour of the rainbow to my bridal shower, and I told them I'm wearing white.\n\nNola said, \"I'm wearing pink\"\nMe: Uh, sorry but pink isn't a rainbow colour. Did you want to pick something else?\nNola: Fine, then I'll wear white\nMe: That isn't a rainbow colour either and I'm wearing white, how about you wear green?\nNola: I'll think about it.\n\nI've already asked her to cater to my above requests (not changing the bridesmaid dress & wearing a rainbow colour for the bridal shower)\n\nAITA for also asking her not to wear her hair like mine & wear it like the rest of the bridesmaids?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "She's not even really your friend if you haven't stayed in touch and she's held you to a vapid promise you made at age 22. Punt her.", "Kick her out. She’s not friend or even a good person if she’s going to bully her way into your wedding. The wedding is supposed to be celebrating you and your fiancé. Not tear you down emotionally and mentally. Tell her you don’t appreciate her being so difficult and that the request you have given her have been easy and flexible. You have been kind and understanding but enough is enough. It’s ultimately your day and your bridesmaids are supposed to support you. If she can’t do a simple task of doing so…or even just keeping her mouth quiet she has no business attending your wedding.", "NTA, but definitely drop her from the wedding party and the invite list, that way no one has to babysit her.", "NTA. The nice thing to do would be to offer a different updo (like a chignon) that will look somewhat similar to the other bridesmaids. \nI would personally ask WHY she doesn't want it (updos causing headaches, for example, vs just not liking the style). If she has a good reason, I'd try to work around it. If it's purely stylistic, I would tell her that she not only agreed to being a bridesmaid, but specifically requested to be. And that means matching with the rest of the group. Tell her if she isn't willing to cooperate, you would be understanding about the fact that she changed her mind about wanting to be part of the bridal party. \nBut be civil about it.", "NTA. Kick her out.", "Just tell her you don’t think it’s going to work out since it doesn’t seem like she’s being supportive of your wishes. NTA", "NTA. Unless she a maid of honor  she has to be uniform. I’d kick her out of wedding party unless she complied as it’s not her wedding.", "NTA. Honestly, I wouldn't have her be a bridesmaid. She's already showing her true colors, imagine how she'll behave at the wedding.", "Kick Nola out your wedding before she messes it up. Your way to nice.", "NTA.  But kick her to the curb already.  She’s trying to make herself a main character at your wedding.", "NTA get rid of her, she is poison!!!", "NTA kick her out honey", "Time to dump her. You fight ask her anyway. No need to struggle and be miserable with bridesmaid. It’s not her wedding. NTA.", "She wants to stand out so let her know that this isn't negotiable. The bridesmaids will have their hair up and all be uniform. If she doesn't want to do that, she needs to step down. End of discussion. \n\nNTA.", "NTA! its your wedding day and whatever you want goes!!", "NTA. I think everybody knows that if you're gonna be a bridesmaid you might have to wear a dress in a color or style you might not normally go for, same for hairstyle and makeup.", "NTA, but kick her out of the wedding party. Take what you spent on her dress and accessories as a loss and learn from this experience. You are extremely unlikely to remain friends after this, and you're not going to like the way she acts on your wedding day, nor will you want to see her face in your wedding pictures years down the line. This is your special day, and it shouldn't be dampened by the ghost of a promise you made when your brain was still underdeveloped.", "NTA. Girl kick her out of your wedding. You do not need this BS and you said you haven’t kept up with her for 2 years. Kick her from the wedding party and ghost. Make sure the venue knows she’s not allowed in.", "NTA. Why is this person part of your wedding party? Kick her to the curb, uninvite. Move on with your life. \n\nOn another note, I know it's common but it's low-key weird to be so in control of the bridesmaids that you make them all wear the exact same hairstyle. Same dress? Sure. Same jewelry? If you provide it or it's cheap. Same hairstyle??? That's crossing the line from asking someone to wear something to trying to control their body. It's weird. Telling them \"wear you hair up, or anything but Hollywood waves\" makes sense to some extent. But some people really hate how they look with certain hairstyles.", "You need to learn how to say no OP. NTA but kick her out.", "Is it just me or do so many of these start with “Im 25 and getting married and someone is being super immature” lol like no shade for getting married when you want but maybe your friends will be mature enough to act right at your 10th anniversary party. Or not, lol. \n\nNTA but maybe she could have a 3rd option if she hates messy bun so much but she definitely can’t have the same hair as you", "NTA you need to fire her ASAP. She is bound to show up in white and she knows you don’t wear white to a wedding if you aren’t getting married.. the audacity for her to suggest that.", "NTA to anyone but yourself. Time to kick her out of the wedding party and off the guest list. \n\nThis is drama no one needs or wants. You’re doing yourself a huge disservice by allowing this behavior to continue. She’s not your friend anymore. People change. People change their minds. You can end the friendship. The world will not end. \n\nGive yourself the gift of a peaceful and happy wedding that’s drama-free.", "NTA. Why are you letting her push you around? Cut her from the wedding party, those should be your closest friends & supporters, not some girl who’s trying to steamroll the bride’s choice. \n\nPlus, her trying to wear white to your bridal shower is messed up. Everyone knows white is reserved for the bride at all wedding related events, unless the bride requests otherwise or doesn’t care. \n\nThis is the most expensive day of your life. You don’t have to compromise. You’re not asking for half the ridiculous stuff we’ve seen people request (covering tattoos, removing rings, dying hair). She can wear a damn bun and pick rainbow color.", "NTA and tell her she’s no longer a bridesmaid. \n\nWhat’s she going to do? Sue you? Laughable. She’s already proven to not be bridesmaid material. Or friend material", "I don’t think you’re an AH, but I’m not generally in favor of a bride insisting on certain things like hairstyles, makeup, etc. \n\nBut in this case, I think Nola was probably going to give you grief over any choices or requests that you make, as the bride. She practically bullied her way in to her position in your bridal party and has challenged you on every decision you’ve made so far. She seems to have made it her mission in life. \n\nI wouldn’t be surprised if Nola shows up for the wedding in a pink dress, with hair down, and does everything in her power to throw shade at you that day.", "I’ve been a bridesmaid 4 times and never liked my hair or the dresses (I had to pay for them all). But these are people I adore, if they wanted me to wear a Big Bird suit with green lipstick I would have done it no questions asked. It’s not about how hot I look in front of everyone it is a very special day for someone I love and they want me to be a part of it.", "NTA. You said you’d make her your bridesmaid, you didn’t say you’d keep her your bridesmaid. I’d tell her you understand she’s not okay with the arrangements you as the bride have decided on, and as it’s your wedding, it would be for the best that she step down to avoid further resentment on both sides. She’s welcome to attend as a friend and not in the bridal party, and you’ll reimburse anything she was required to spend money on to be fair, but she will no longer  be included in any arrangements.", "NTA, but you might want to boot her out of your wedding party. She's making your planning, and your life difficult, and that's the last thing a bridesmaid should do.", "Yo kick her out of the wedding lol", "If you don’t kick her out of your wedding she is going to make your day about her. She is coming across as the kind of asshole who will turn up to your wedding in a long white dress and her hair EXACTLY like yours. You will regret it so much if you keep her in your wedding.", "NTA for not wanting your bridesmaid to have the same hairstyle as you. but seriously- messy buns? A nice updo when your hair is down would look much better than a hairstyle best described as lazy, haven’t washed your hair in three days so throw it into a messy bun. I’m picturing jeans, tank top, plaid long sleeve shirt and no makeup to go along with a messy bun.", "Okay, as far as her not having same hair etc I think you are fine, NTA. But making a big deal out of her not wearing a “rainbow color” to a bridal shower? Who the F cares? I wouldn’t even know what is meant by that.", "NTA but OP you need to get better at communicating.\n1) If you never wanted her to be a bridesmaid after 2 years of loose contact, then you can cut her out at any time (please don’t press your luck thinking you will still get a gift if you do).\n2) Any color of the rainbow and “I will wear white “ basically means wear any color (not just ROYGBIV) except white. I will argue that pink is just a shade of red. If you hate pink (a color that social media and wedding anything pushes for bridesmaids) then say that. \n3) I’m just confused. The bridesmaids are paying for their own hair and makeup and paying for a messy bun? Is there something special like a braid in it or something? \n\nHonestly, with the dresses, there’s always going to be one person not happy in the bridal party and you can’t make everyone happy. If your main issues are hairstyle and colors, those are petty arguments where it sounds like a communication problem. If you just don’t want her in your party, cut her out and let that be the reason.", "NTA\n\nStop putting yourself through this unnecessary trouble. She is acting very entitled and selfish. It isn’t wrong to cancel her invite based on the way she is acting. Don’t invite her. Don’t let her be a bridesmaid. The fact you’re considering having a friend act almost as an escort for her so she doesn’t come over and ruin your day is insane. Keep her out!", "NTA for the bridesmaid dress and hair, but the bridal shower rainbow dress code and pink isn’t a rainbow color is a bit much IMO", "NTA.\n\nBeing a bridesmaid is about sucking up what are probably going to be some not so flattering clothes/shoes/makeup/hairstyle choices to support the couple getting married.\n\nIt is ok to ask if there is another style/colour/hairstyle if you’re not comfortable with the choices, but if the bride says no you suck it up.\n\nThis woman is being unreasonable. Say you have given her the dress code and if she doesn’t like it she can step down as a bridesmaid before she makes any purchases. It’s your wedding, not hers and it sounds like you didn’t really want her there anyway.\n\nLearn to speak up for yourself, or get a friend to back you up.\n\nEdit: going through your comments she sounds toxic AF. Cut her out of the bridal party and maybe the wedding in general - so not worth the hassle.", "NTA, Denice her as a bridesmaid. She’s going to continue to cause problems. I’d seriously debate even having her at the wedding at all.", "NTA. Truthfully, Nola shouldn't be in your wedding party. You've only known her 5 years, 2 of which she's been absent. So effectively, you've only known her for 3 years, which isn't a lot of time in the grand scheme of things. From your writing, you don't even sound particularly close. \n\nThe best course of action would be to thank her for her time and relieve her of her duties. You don't need an acquaintance trying to upstage you every chance she gets.", "ESH- she’s being whiney and difficult and you have a lot of rules, if you didn’t want her to be your bridesmaid you shouldn’t have let her be in your wedding party. Let her wear her hair how she wants and wear a pink dress.", "Oh, my god. Have you given as much thought to your life together as to hairstyles for a single day? Hollywood waves. Jesus.", "Kick her out!", "Just give her an ultimatum: Wear what you have asked the rest of the bridesmaids to wear or don’t be one. Easy peasy. It isn’t her day. She doesn’t get a vote.", "NTA.\n\n***Disinvite her completely***. This doesn't seem like picky tastes, it sounds like she's a nightmare personality set on stealing and ruining *your* special moment.\n\nMatching the bride has always been taboo. Even if she just wanted flexibility, it's simply not her wedding to decide that. It's one thing if it was just a single misalignment, but all the issues together show she's not someone who deserves to attend *your* big event.", "If you’ve already had to assign someone to keep her and her nasty comments away from you on your big day then she shouldn’t even be invited, let alone a bridesmaid.\n\nBorrow a spine from your most stern friend and tell her not to come. Do it over the phone so you can hang up when the screaming starts. This girl is not your friend.", "NTA just tell her she is no longer part of the bridal party as she can’t respect your decisions and is too difficult.  Stop being a doormat and get rid of her.", "NTA you would not be TA if you kicked her out of your wedding either…you don’t owe her shit.", "KICK HER OUT.", "It’s time to fire her. Reimburse her for the dress unless she can return it. This isn’t going to be a fun day.", "NTA, but you need to work on saying no. Really, it's a skill that will help you immensely. \n\nYour asks are normal, your feedback from the other bridesmaids tells me for example that the dresses are not hideous, so it's a matter of opinion. She shouldn't have one. This is about you. Your wedding, your money, your choice (as long as it's not absurd). \n\nShe doesn't seem to get that.", "Info: Is your friend’s hair going to stay in a messy bun? Some people’s hair won’t.", "Would instantly kick her from being a bridesmaid 😂", "NTA but it's time to boot Nola from the wedding. She's actively trying to push boundaries. At first I thought \"idk hairstyles don't work on everyone you should probs have a selection of 2-3 anyway\" but oh my that's....that's not even the problem. She's just *awful*", "ESH. \n\nShe sounds like a fucking nightmare, and you should kick her out of your wedding party. \n\nYou also buried the lede in a comment - this woman is making fun of your fiancé and you refuse to stand up for him or do anything about it. He deserves better than a wife who will throw him to the wolves to avoid confrontation with someone she doesn’t even like.\n\nGo to therapy to sort out your people, pleasing and fear of confrontation, or you are definitely going to end up divorced, because it sounds like the only person you are willing to let down is your future husband.", "This one is actually kind of hard. I was always under the impression that the bridesmaid had a say in the things they paid for (so, if they paid for their dress, they could choose the style, but not the colour, for example). So if they are paying for their hairstyle, I would say that they should be able to choose -- but that you could say \"up-do only\". Again, I have no idea how it works, but I wouldn't call you an asshole for that. \n\nWhat I will say, is that calling you up out of the blue and demanding to be in the wedding party when y'all haven't spoken is such a red flag on her end. I get not being able to say no, I am similar. At this point, I would be telling her to take a damn hike. She is most certainly an asshole.\n\nOn a side note, (just personally speaking) I would never be a bridesmaid if I couldn't wear my hair down. I hate my hair up, and I truly believe that I look terrible in an up-do lol. I would feel self-conscious the whole time that I was ruining your wedding photos. I don't understand why people can't just back out if they don't want to follow what the bride wants. I'd rather step away from the wedding and keep the friendship than be forced to wear things I hate for the sake of being called a bridesmaid.", "Oh my god pick another bridesmaid.  Life is too short for these shenanigans.", "Tell Nola to F\\*\\*\\* Off. \n\nnot worth the stress. Time to toughen up. Boot her and have a great wedding day <3", "Just get rid of her as a bridesmaid", "The bride gets to choose not only the bridesmaid dresses but their hairstyles as well?  And decides what they get to wear to the bridal shower?  And is forcing them to dress in a Crayola color scheme that represents how each of them is a but single color but together they formed the glorious triumphant white radiance who is the BRIDE?\n\nNola sounds like a piece of work but all of this is so f\\*cked.", "Its YOUR wedding NOT hers.  She wears and does hair like the other bridesmaids, like what you want.  Your not being a jerk or unreasonable.  NTA", "NTA just kick her out.", "IMHO \"Any color in the rainbow\" means *any color*.  I've never heard of a bridal party being dressed in ROYGBIV like an entry-level box of Crayolas, and would totally have thought pink was acceptable.\n\nBut obviously white is not an acceptable alternate, not because it's not a single rainbow color (it's all of them, light-wise) but because the bride wears white, not the bridesmaids.\n\nESH", "Just tell her either she go with the flow of your wedding or she goes out of the wedding.", "X'D WOW! She wants to wear white and the bride's hairstyle? (Let me guess, the pink dress would have been a nearly white, pale pink.) NTA. It is completely reasonable to tell her not to wear the same hair style as the bride, especially when all the other bridesmaids will be wearing their hair opposite the bride's. It's also reasonable to ask her to stick to the color scheme. (It's not like you're asking a goth to wear something anti-goth here.)", "NTA, who is this person? The bride picks everything. Hair, colors, BMs are there to support the bride. I would ask her to leave if she keeps it up.", "NTA...she forced you into having her there and. ow is trying to take the spotlight! I'd X her right out of the wedding party at this point!", "Disinvite her from the wedding. Problem and headache solved. NTA.", "For all of the people saying they thought ‘wear any rainbow color’ meant any color at all: If OP meant any color at all she wouldn’t need to specify wearing _rainbow colors_. This is a level of obtuseness rarely seen on Reddit. It may be however, common amongst bridal parties.", "NTA I recommend that you uninvited her from bridesmaid duties then she can wear whatever she likes (apart from white) and have her hair however she likes. \n\nYou are not obligated to have her in your bridal party esp when she clearly doesn’t understand that as a bridesmaid you do not get to pick your dress or hair style", "This is what you get for not being able to say no. Obviously the Nola is A H but so are you for digging a hole and making it bigger for yourself and then acting helpless. ESH.", "ESH. Her, obviously. You for dictating what people wear to a bridal shower. Your decisions are for the wedding ceremony and reception, that's all. You don't get to specify people's clothes for anything else.", "Now brides get to tell you what you HAVE to wear to their shower and how you MUST wear your hair??  No wonder these modern brides sound like escapees from the looney bin.", "NTA at allll, it’s your wedding, and imo, u chose bridesmaids outfit, hair, makeup, etc. Not to mention, SHE ASKED FOR HER TO BE A BRIDESMAID. Too bad if she didn’t like the styling, if she wants to be a bridesmaid, she has to put up with not having her choice. In all honesty, if she goes to any event to do with your marriage, with anything remotely resembling what you’re wearing (eg. the hair and dress as mentioned) it’ll just make her look bad. I’m not one to bring other girls (or people in general) down but if she has the audacity to copy you ON YOUR WEDDING AND BRIDAL SHOWER, she needs to be removed from the wedding (if possible) and your life asap", "Ew! Messy buns?!? Ew some more. And pink is a color of the rainbow. Why are you demanding what color these ladies wear to your SHOWER? Seriously?!?!? Yta.", "Drop from your court. Simple as that. She is being ridiculous", "Definitely NTA. Nola is like a character from a book! Nola doesn’t like the hairstyle you gave her, she wants the same as the bride’s. Nola doesn’t like the dress colour, she wants white, the same as the bride’s. Perhaps Nola needs to think about what a bridesmaid is and what a bride is. You are the bride. She is the bridesmaid — it’s your wedding! I don’t think it is fair that she has the same hairstyle as you (even though you have kindly permitted this). And there are some lovely greens to choose from for her dress. Finally, if the stress of Nola being in the wedding party outweighs the pleasure of her being involved … she doesn’t have to be :)", "You are definitely NTA. If your hairdo is very big and beautiful, why would your bridesmaid want to copy and be the center of attention? It's your day! You can try to compromise and give her a different bun hairdo but not the same as yours. If she can't get over it, just don't make her a bridesmaid. Doesn't seem like a good friend anyway.", "Ugh. Getting married was awful because of all of the planning, but it did show me my real friends. My real ones were down for whatever.", "NTA. Ditch her as a bridesmaid. She will taint the whole experience for you  forever. She will keep going until the bloody wedding day if she is like my X best friend. \n\nThe horrible part of my story is that she was married before me and I was her bridesmaid. She had a maid of honour who did the same thing to her and she hated it. I couldn't understand why she then behaved like that for me. \n\nThe dress was wrong, she hated her hair, the shoes sucked, the NAILS weren't to her liking and she even changed her makeup after I paid for it to be professionally done. She was never available for the usual things and we found it almost impossible to find dates to shop, have a bridal shower, hen's night and so on. Instead of doing her matron of honour job for me on the big day, she spent the whole time fussing over her appearance and painting her nails and pressing her dress to try to make it sit better. It all revolved around her, on MY big day!\n\nI kept up that friendship way too long after that wedding.", "ESH. Pink is not white. You wouldn’t be in this position if you hadn’t made someone you didn’t want a bridesmaid. Learn to set boundaries, you will need them.", "Neither. It sounds like she’s being very annoying and difficult, but I have never heard of dictating a bridesmaid’s hairstyle. WTF? This is a thing? Everyone likes their hair different ways, let them choose their own style.", "NTA girl it’s time to kick her out of the bridal party. She’s going to show up with your exact hairstyle. She doesn’t respect you enough to follow your wishes. Remove her from the bridal party and revoke her invitation because she will start drama. All she’s trying to do is try to gain attention. She’s not worth the drama or friendship. \n\nMake sure you do it over text and say “I’m removing you from my bridal party because you have continuously disrespected me and I have no patience for the blatant disrespect. You are not allowed to show up for the ceremony or the reception either because I am also revoking your invitation.”\n\nAnyone who sides with her are not worthy of being in your life.", "OP - be careful. Many of the stories I have seen about bridesmaids upsetting the brides on their wedding day were preceded by red flags of them upsetting the bride on all the events leading up to the wedding, such as dress fittings, hen do etc. \n\nHow ridiculous she suggests wearing white, and being difficult about a bun. These are red flags that you need to heed OP. \n\nI would cut her out of the wedding now.", "Best move is to tell her you changed your mind and no longer need her as a bridesmaid", "NTA. You need to tell her \"these are the requirements for participating in the bridal party, which are very fair and every other person has agreed to without complaint. If you dont want to follow the requirements and dont plan to do so, then you need to tell me now so we can avoid the drama and I can find someone else\"", "honestly OP, grow some balls and remove her from the wedding all together.", "NTA regarding anything to do with the wedding attire & hair, but you sound a little bit assholeish regarding the bridal shower colour restrictions", "NTA, but she also shouldn't be a bridesmaid at all. She pressured you to keep an old, timed-out promise, and now she's giving you pushback on every step.\n\nI would strongly encourage you to tell her to stand down, and excuse herself from the bridal party entirely. \n\nIt's your wedding day - you don't need any additional stress from her BS, on top of a day that will likely be stressful in and of itself.", "She’s trying to manipulate and steal YOUR day. Remind her it’s not her wedding it’s yours , and if she doesn’t like to kick rocks.", "Nola needs to go…", "YTA. You are very controlling.", "ESH. \n\nShe is ridiculously pushy and obviously shouldn’t be dictating anything for your wedding. \n\nYou are just a mess for even agreeing when she brought up your promise from years ago. That’s just ridiculous. Be an adult and tell her no. Also, dictating what they wear to the shower is ridiculous and annoying. The only time you control any aspect of what they look like is the actual wedding day. \n\nSo kick her out and get over yourself.", "Oh wow, I feel strongly differently than all of you on this one. While she is clearly immature, this is mostly on you because it sounds like you knew this about her PRIOR to agreeing to have her as a bridesmaid. More importantly though, I will simply never understand why people — even brides — don’t have anything better to worry about than how people wear their hair at your wedding. Like I get you’re going for uniformity, but genuinely why does it matter? Aren’t weddings about celebrating you and your love? I literally don’t think I’ve ever noticed what the bridesmaids hair looked like at any wedding I’ve ever gone to. And for me personally, I just feel like we’re so privileged overall that we’ve lost sight of needs vs wants vs what actually matters and what doesn’t matter even the slightest bit. Like all perspective has gone out the window and some people don’t have enough food on their tables. IDK, I don’t want a wedding though so this could just be how i see the world and I could be totally off base with what is normal for brides to care about. \n\nESH", "Fake", "uninvited her to the wedding.  taking her off the bridemaid now will probably cause a scene at the wedding.", "NTA. But you need to toughen up and completely uninvite her or you'll regret it for the rest of your life. Send her a text if you can't handle saying it in person, but it needs to be done.", "This is YOUR wedding, not hers. None of your requests to her were unreasonable. I don’t think she should go to your wedding if she’s not going to listen to instructions and tries to fight everything you do \n\nNTA", "Nta but why are you dealing with this woman? Was it a blood promise or something ? You don't need to deal with someone being difficult especially when the rest of your bridal party isn't being difficult.", "WHAT? No way should you be having someone in the wedding party that makes fun of him. That’s so disrespectful and not how you should start off your marriage and the perfect excuse to tell her she is no longer a bridesmaid.", "OP needs to kick her out of the bridal party. Am I the only one who thinks she is going to show up in white?!? I can’t be the only one. NTA", "My thoughts exactly. She doesn't want to be a bridesmaid, she wants to be the center of attention. If she does end up being in the wedding she'll do something to grab the attention. \nMy own sister did it to me. Made a scene at my wedding because she didn't want to do the bridal dance, one of my husband's family traditions. Simply a dance with the entire bridal party to break the ice and start the reception after the meal. Sister was matron of honor and even as a child had to be the center of attention. \nAvoid the drama and tell her since she objects to the dress, colors and hairstyle for the bridesmaids perhaps she'd be happier as a guest", "Agree totally! NTA.\n\nOP should  tell her that she's out as a bridesmaid and avert a potential disaster on the big day. If OP doesn't remove her from the wedding party, I hope OP is planning on bringing her bridesmaid dress and accessories to the venue herself or there's a non-zero chance it ends up lost or damaged. \n\nPerhaps OP could seek the support of the another bridesmaid (that she's actually close with) if she needs help or advice that's more specific to the people involved.", "She’s playing you.    Call her bluff.", "[removed]", "Exactly, all she's doing is making trouble. NTA. Save yourself the stress and kick her out of the bridal party.", "I agree with this and I’ve been a bridesmaid/maid of honor 11 times. I would’ve worn a paper bag if that’s what my friends chose. It wasn’t about me, it was about them! They got to decide what I wore and how I did my hair! Her friend is ridiculous and needs to not be a bridesmaid! NTA!", "Agreed. This will lead up to a lot of drama. Do you want to have the extra tension when you get married and while doing wedding planning?", "Only don’t ask her to step down - **Tell** her it’s not working out and she is no longer a bridesmaid. It’s up to you to choose who is in your wedding party, and you can change your mind if someone is causing trouble.", "I think op should not kick her off the bridal party cause as of now we are sure that atleast she will be in the bridesmaids dress, whose to say that she will not turn up in white once that restrictions is taken off her.\n\nBut op you should definitely have the talk with her.", "I’m a lady and I agree. It never occurred to me to tell my wedding party how they could or couldn’t wear their hair, let alone their clothing for events that aren’t the wedding itself.\n\nLoosen though reins, girl.", "And you just know the selfish “friend” is gonna show up in pink or white and with the waves, lol. OP isn’t gonna do anything about it. \n\nWe know this from one post and a few comments, that girl definitely knows it.", "And all the bridesmaids don't have the same hairstyle!  So why fit about this one?  And, then rainbow business.  Christ.", "OP said in the comments she'd be fine with any hairstyle that isn't what she is wearing. I'd be pretty happy with that, that's what I did at my wedding.", "“I can sing a rainbow” does not accurately describe the colours of a rainbow, you know that right?", "That stuck out to me as well. “Any color of the rainbow” has always meant “any color” when I’ve heard it, not specifically ROYGBIV. Like, would maroon be out because only primary red is in the rainbow?", "I've never been to a hens night/bridal shower where there hasn't been a theme for what the bridesmaids wear.\n\nMight be a regional thing", "Thank you, I'd like to clarify. I specified rainbow colours (VIBGYOR) and I also explained to them the symbolism behind it. Light refracts into the colours of the rainbow. When you spin a rainbow wheel fast it looks white. In a similar manner, all of these girls have influenced my life and made me who I am. The colours of the rainbow and me wearing white is symbolic of how they are what makes me, me! ❤️\n\nThank you very much for your feedback though, I am trying not to sweat the small stuff but apparently sucking at it.", "Agree on the bridal shower. Wedding day? You pretty much get your say as long as you are not being raging A. I’m not buying an outfit in a colour I don’t usually wear for yet another event.", "The color wasn't for the bridal shower it was for the bridesmaids dresses for the wedding. \nI think this particular bridesmaid wants to be the center of attention. She even wanted to wear a white gown.\nMy own sister almost ruined my wedding by trying to be the center of attention. Didn't ask anything terrible, just my husband's family tradition of the bridal party briefly dancing together after the meal to break the ice and get everyone comfortable. My sister didn't like the idea and made a huge scene screaming and stamping her feet then grabbing her husband and stomping out while yelling at me.\nMy brother-in-law, the best man, saved the day by getting a female cousin to fill in for my sister in the dance. Once I stopped crying and fixed my makeup the rest of the reception was great.\nDon't want to see OP left with a bad memory of her wedding day so she needs to ask the attention seeker to just come as a guest.", "[tf is your post history my guy](https://www.reddit.com/r/Gay_rape_/s/bdvvtxpe1U)", "These are excellent points", "It wasn't the rehearsal outfit, it was the bridesmaids dresses for the wedding. When denied pink because it isn't a rainbow color, she wanted to wear white! To the wedding...\nThe hairstyle thing is a bit weird, I didn't care how my bridesmaids wore their hair. However I think this bridesmaid will only be happy if she's the center of attention.", "5 bridesmaids and 3 picked messy buns 1 has hair that's too short so she's going with her hair loose. 1 wants the Hollywood waves. I responded to another comment saying I guess I'd be fine if she picked any hairstyle except for what I'm wearing.\n\nI never wanted her in the bridal party in the first place as we are not close, she called me up on a drunk promise I made as a uni student to her, and literally have no way of cutting her as I'm awful at saying no to people. \n\nThank you for reminding me no one will mistake the bridesmaid for the bride! I need to remind myself of that often.", "FACTS", "Pink wouldn't have worked I'm a rainbow themed wedding. The bridesmaids were supposed to wear rainbow colors, red-orange-yellow-green-blue-indigo-violet.\nThen the friend wanted to wear white, again not a rainbow color.\nI really think this \"friend\" is just an attention seeker and will cause a lot of grief and/or bad memories for the bride.\nI have bad memories from my sister causing a huge scene at my wedding. Fortunately it worked out and the wedding was great after she stomped out screaming at me.", "Just because it’s a song, doesn’t make it so. Especially that song. Generally it’s Red, Orange, Yellow, Green, Blue, Indigo, Violet?", "Where are you from? I’m from the midwest in the US and we were taught ROYGBIV in art (red orange yellow green blue indigo violet)  in science you learn the 7 or 12 colors that are possible from a prism. \n\nIf you Google “is pink in the rainbow” it is not for a scientific reason. Pink comes from mixing  red and violet together but in a rainbow those colors are at the opposite ends of the prism aka a rainbow so there is no way pink is possible.", "Songs aren't always the truth. Even my 6yo knows the difference between the song and the actual rainbow.", "Given the nature of the discussion, it really doesn't matter. Hell, op would probably accept a dumb song as a justification. But a silly song wouldn't be the usual source of information when arguing about something you can easily google.", "But the bridesmaids dresses and jewellery are free for the bridesmaids? Op has said in another thread that they're only asking her to pay for the makeup and hair, Arguably the cheapest part of the outfit because of the dress alone", "Most ppl have the same hairstyles at weddings, it looks more polished and uniformed", "One of my bridesmaids thinks it's best to look uniform. I have offered them a choice of hairstyles and a majority picked messy bun. But Nola wants to wear the same hairstyle as me. I guess I'd be fine if she picked anything except my hairstyle.", "I’ve been a bridesmaid idk 10 times and not once has my hair been decided by the bride. Unless she’s paying for my hair to get done, she doesn’t decide it. Bad enough I have to pay for the hideous dress.", "Why can’t ppl agree to rules for one day , let one day be about the person getting married", "In my culture we neither ask nor accept gifts and bear all the costs of the bridal party. Her outfit, jewelry are all free. She only has to pay for hair and makeup for herself.", "This! I had a demanding bridesmaid. She was self-centered up to the point of later causing a scene at my baby shower. OP should do this now so she doesn’t have to stress on her wedding day.\nAlso, guarantee you one or more (likely all) bridesmaids are sick of her and are just putting up with her for your sake.", "WITH her hair in Hollywood waves!", "Wanna bet that even if she got downgraded to “guest status” she would still show up in white with Hollywood waves? I think OP needs to downgrade her, talk to her other bridesmaids, and they need to have a bottle of red on hand before pictures of the guests are taken. Take no chances.", "I wouldn’t be surprised if she’s the type to just not show up at all lol", "She’s the type to show up in a white wedding dress.", "This, except avoid the word \"perhaps\", it'll sound like she's being given a choice. Instead, \"It's obvious from your objections to the bridal party attire that you'd be happier as a guest. Don't give it another thought, and just enjoy the wedding.\"", "We chose not to have my SIL involved in our wedding, she was to come as a guest. She turned up in a bright red mini dress with shoestring straps and slit down the front. Completely on brand for her to draw attention in. Sticks out like a ducks arse in the photos.\n\nBackfired on her because everyone knows what she was like and ignored her on the night so she left early. \n\nOP needs to ditch Nola now and uninvite her entirely. This isn't going to end well otherwise.", "I am beginning to think providing security/bouncers at weddings is a much needed business idea.", "have security or tough family members ready to kick her tf out.", "When I got married one of my bridesmaids had a blonde pixie cut and the other had a chin length dark brown bob (super curly.) Without buying wigs they couldn’t have matched in any way at all! \n\nAs far as I remember I didn’t even *think* about their hair, they’re grown women and can decide these things all on their own. My ‘requirements’ were for them to turn up, look like bridesmaids for a bit, and then enjoy themselves. Admittedly, my wedding was very casual but still. \n\nNola does sound like a nightmare though.", "If someone told me the dress code was rainbow colours I would certainly think pink was fine. To me that means no black, brown, grey, etc. but bright colours are ok.", "Wedding culture has is wild in some places. Uk here. At my hen night five of us went to the pub. I don’t know what anyone had on, and could not have cared less.  We did have some deely boppers.", "That’s a very nice explanation to why you picked those colors, but typically the bride picks what the bridesmaids wear to the wedding, NOT the bridal shower.  I don’t think it’s reasonable or kind to dictate what they wear to any event than the wedding.  The hairstyle at the wedding is something that is normal for the bride to choose, though, as long as it doesn’t creep into wig/extension/cut/dye territory, so I think telling her she has to do the hairstyle you requested is fine.", "Bridal showers are not typically events you tell people what to wear.\n\nTechnically speaking, you aren’t even supposed to be planning or hosting your own bridal shower; someone else (typically your maid of honor or a female relative) is supposed to plan and host it for you. From an etiquette standpoint, it’s tacky for you to host it for yourself.\n\nSo you are being over the top here.\n\nI urge you to step back and refocus on what this is all about.\n\nThis is about joining your life with the person you love and sharing that joy with others that are important to you.  If Nola isn’t one of those people to you, ask her to step down. But for that reason, not because she is pushing back on hairstyles or dress colors (again for the shower! You don’t tell people what to wear for the shower!)\n\nIt’s not about what people are wearing or how they are doing their hair. Your wedding party are not props for your special day.\n\nYou are in too deep into the WEDDING!!! part of this all, and you’ve lost what this is actually all about.", "Light refracts into colors that include pink, though? I would not have taken that to mean pink wasn’t allowed, especially for the bridal shower.", "Nope, the rainbow colors was for the bridal shower according to OP.", "\"I also asked my bridesmaids to wear any color of the rainbow for my bridal shower\" it's right there in the post. OP is dictating what her bridesmaids wear to the shower, which is just asinine. There seems to be this whole thing now of brides-to-be wanting to monopolize wearing white not just for the wedding day, but also for the rehearsal and the shower and engagement party and whatever other event. I didn't even wear white to any of those events before my wedding, let alone give a crap what anyone else wore.", "Read again. She doesn't like the bridesmaid outfit, but it was already purchased for her by the bride.\n\nThe rainbow vs. Pink or white was about what ip wants her to wear to the bridal shower, not the wedding.", "No, it says plainly in the post, it's for her bridal shower. OP wants to dictate what colors her bridesmaids wear to the bridal shower. Absolutely absurd. This bridesmaid sucks for forcing her way into the wedding, but OP sucks too for getting bent out of shape about *bridal shower* outfits.", "You absolutely have a way of cutting her. It’s your wedding. You should only have people you want to celebrate with there. Especially as your bridal party. \n\nIf you can’t say no directly, ask your fiancé or MOH to do it. If you’re not close then you won’t mind tanking the relationship. \n\nSomeone who demands to be in a bridal party sounds like an entitled twonk anyway so no loss\n\nYou only live once. Cut her loose.\n\nNTA", "A drunk promise from years ago is not legally binding. Who on earth calls up someone on something like that? An attention seeker, that’s who.", "Kick her out. You don't want her and she's causing you issues. You're going to be on high alert all during your wedding. Rip off the bandaid and stand up for yourself. Tell her that you're over the drama and you are cutting her and not inviting her as a guest. Then make sure you have people in the know who can keep her out if she decides to crash.", "Kindly - if you aren’t mature enough to be able to stand up for yourself about this, how are you mature enough to get married. Please have some self respect and give this girl the boot.", "A drunk promise isn't binding, only pinky swears.", "How miserable does your life have to be for accepting a \"drunk promise\". You're really that easy to guilt trip ? She could ask you for all the money in the world just justifying it with \"you drunk promised it\" and it would be ok.\n\nYou would rather have someone you don't want in your bridal party rather than saying the word \"No\" . A ruined wedding will be deserved", "Whose wedding day is this again??", "You don't want her in bridal party? Why is she in bridal party then??? You're letting a drunken promise from years ago resurface for your *wedding* ??? It's your wedding, do what you want not what some woman you don't even seem to like wants! Yeesh! NTA but you're definitely the doormat! YTD ?", "NTA at all! I considered myself a super laid back bride (confirmed by my bridesmaids who said it was the least stressful and most fun wedding they’d been a part of), but even I would kick this girl out of the bridal party. If it were just the hair I’d say maybe you could compromise and let her pick a different updo, so that you stood out as the only one with hair down. But seriously? A white dress? Nah…I wouldn’t even have her as a guest at this point. \n\nI saw in comments you’re worried about it being awkward seeing her around, but honestly, it will be less awkward removing her now than what your interactions with her will be/feel like if she continues making your wedding about her and not what you THE BRIDE wants the wedding to be like.", "If she shows up in white or pink and with holly wood waves, don’t be surprised or upset. You’re setting yourself up for failure by not telling her the truth.\n\nAnd she’s selfish enough to do it. \n\nAnd you’re a push over enough to not do a damn thing and she knows it. \n\nYou’re only hurting yourself.", "Jeez hon, don’t let a reddit poster talk you into letting your bridesmaids choose their own hairstyles just to keep the demanding bridesmaid happy! No no no! At least stand firm on that!! It’s not about “mistaking the bridesmaid for the bride,” it’s that you ARE the bride and should look different and have a different hairstyle!! It’s your day! Stand firm darn it! It’s bad enough you’re quietly letting Nola ruin your wedding day & sabotage your wedding plans. At least have a gorgeous hairstyle of your own while she does!\n\nCongrats & cheers to a long and wonderful marriage!\n\nNTA", ">  literally have no way of cutting her as I'm awful at saying no to people.\n\nI promise in a few years (or god forbid, the day after the recs your wedding) you will look back at this and be so upset at yourself. It's not healthy to be a doormat to the extent that you recognize that you are making yourself miserable and then do absolutely nothing about it. You are focusing on the hair and dress because those are concrete things rn you can worry about, but the reality is it's her behavior and the negative emotions you'll have that will actually be an issue. Do you really want to have that awful feeling in your stomach everytime you look at your wedding photos?", "She has already given you **so** many reasons to cut her. You only get one wedding, if all goes well, you're gonna remember this day when you're 80. And if you're telling yourself that all this stuff she's pulled is it, and she won't cause any more drama on the wedding day, then you're misleading yourself.", "It’s not a rainbow themed wedding. The colors are for the bridal shower.", "Art of a rainbow or a photo of a rainbow? Rainbows I've seen in nature have pink in them. I'll die on this hill. :-)", "Pink is in the rainbow. End of story.", "I grew up in - Red and Yellow and Pink and Green, Orange and Purple and Blue. \nMaybe it’s a regional thing", "Isn’t pink just red and white?\n\nViolet = red + blue, so if you mix violet with red you’ll just get a redder purple.", "The actual rainbow has pink in it. Every rainbow I've ever seen has pink in it.", "Silly? are you saying that song is silly? Them's fight'n words!", "[deleted]", "I've done wedding hair and usually the bride picks the hair styles or gives a choice a couple of different styles to accommodate different hair length/type. It's not uncommon for brides to let the bridesmaids choose for themselves either but the majority of the time it's determined by the bride.", "Also did you have to wear the terrible shoes or am I just that old", "The bridesmaid also can’t pink to the shower because it’s not a colour of the rainbow…", "Oh! Then this is perfect, there is nothing for her to feel burned about. This day should be your shining moment. This day is about you and your partner and someone who is trying to make it about her from the start is probably going to do that on your day too. You don’t deserve that. I am a yes person too and I have really had to work to be able to say no. I think if you can be brave and tell her this isn’t going to work out, you will be able to breathe and relax and enjoy your true friends and your family as you prepare for your wedding. Wishing you a lifetime of happiness!", "Actually I think with some more thought you’re totally right! Removing her from the bridal party is probably the best idea as she’ll only cause more drama and issues later", "Sounds to me that she wants the spotlight. Wanting to wear white to the bridal shower and Wanting her hair to be like the brides. She definitely wants to stand out and get attention. Seems like she doesn't want to blend like the other bridesmaids. I know she originally said pink but i would bet money that she would have worn a light pink that was close to white and when it was turned down she chose white.", "I don’t know my sister just got married and had some similar issues. It ultimately was fine bc she just stopped trying to make everything perfect. People put way too much pressure on weddings. That being said Nola is clearly someone who needs to be reminded who’s day it is!", "This is why I stopped going to weddings.  The drama the hype of it all never adds up.  Its a boring three hour talking marathon with family slide shows and a terrible DJ.  People only go because they need alcohol and an excuse to get off the couch.", "Pink is a light shade of red. Red is a colour of the rainbow so it makes sense to me that pink is acceptable", "Would you then pick white after being told that no, it's any colour of the actual rainbow?", "Wow I missed that this was what they were supposed to wear to the *bridal shower*.  The notion that the Crayola-box color scheme was chosen specifically to signify that all these women were just parts of the glorious whole that is the radiant white bride is repellant.", "that event and colors have meaning to the bride. doesnt make her an ass 🙄", "Thank you very much. I live in a small town, I'll be seeing her pretty regularly and don't want to make things awkward in the future though I know it will be awkward at my wedding 😅\n\nI have allocated one bridesmaid to keep Nola away from me and make sure doesn't say anything critical or bluntly rude about me or my outfit on my wedding day otherwise I'm going to be overthinking about it for the rest of the day!\n\nAlready Nola makes fun of my fiancé and I'm not keen to be the butt of her jokes on my wedding day.", "> An attention seeker, that’s who.\n\nSomeone who will intentionally try to steal the spotlight from there bride on her wedding day at any cost", "The same kind of people who come out of the woodwork when someone they weren’t close with/hardly knew dies and says they were best friends", "I know that song, but it’s scientifically incorrect", "Because I asked her to. She's a very close friend and I trust her decision (She's been a bridesmaid atleast 3 times now so I figured she knows the ins and outs of bridesmaid looks). I asked if all should wear the same style or different and she said uniformity would look good.", "It’s extremely uncommon where I’m from (NYC). Then again we also give cash as a wedding gift and require open bars. Some of the shit I’ve seen on here is truly bizarre especially when hair for a bridal party costs $125+ per person.", "Omg! Me too! I had to wear shoes stained the exact color the bride wanted, and the dress and my hair and makeup and jewelry were all decided by the bride that I was a bridesmaid for.", "Hm I’ve never had someone demand a certain shoe now that I think of it. Just the ugly dress.", "Ok is that a big ask? It’s simple u can’t wear this color the bridesmaid is being difficult", "Removing her from the bridal party….and also giving her name and photo to security on the day of the wedding.", "People only go to weddings because of obligations, no amount of alcohol would be enough to entice me to sit through a 3hr wedding", "I used to cater weddings and I’ll challenge your comment of terrible DJs. Look up Doc Titus “the party doctor” he is an AWESOME DJ!!! Seriously the best ever!!!", "I mean, I go to weddings because they're my family/friends and I love them?", "No because who wears white when they're a bridesmaid?", "Bridal showers typically do not have matching outfits or outfit requirements for the wedding party.\n\nDress nicely is pretty much the standard requirement.\n\nActually, brides aren’t really supposed to be part of planning the bridal shower at all. Someone else is supposed to throw it for you and from an etiquette standpoint it’s gauche to throw your own. So deciding what colors other people should be wearing is definitely not the normal expectation.\n\nJust because you are getting married does not make the world revolve around you and you get to make event after event match your exact vision.  No one is that special.", "She says in the comments that them in rainbow colors and her in white are meant to signify that all of them came together to make her her.  Could be touching but to me sounds unbelievably self-centered.", "Agree to disagree.", "Save yourself the hassle. Remove her from your bridal party. I’ve been a bridesmaid in two weddings so far and it was common sense for us NOT to wear the same hairstyle as the bride and we wore the color the bride picked. I feel like someone who calls you up demanding to be a bridesmaid should have enough common sense to know that these are typical average asks of bridesmaids - Wear what the bride asks/picks (ESPECIALLY since you are paying for the dress) and don’t copy the brides hairstyle. \n\nIt’s great you have a bridesmaid ready to keep her in check but is this really something you want to worry about or be annoyed on your big day? \n\nLife is too short for you to have someone you don’t want in your wedding party, small town or not. Have a conversation with her and tell her this is the color you want her to wear and she needs to wear the messy bun, if she doesn’t then she can attend the wedding as a guest. Have your other bridesmaid who has volunteered to keep her in check there for backup if you have a hard time standing up for yourself. \n\n\n\nShe definitely isn’t a friend of yours if she is being this difficult about an event that isn’t about her. And the fact that she makes you the butt of her jokes??? Save yourself the drama. \n\nNTA", "You are worried about a hairstyle and a pink dress when she is making fun of your fiancé?    You are not facing the real issue.  Are you going to be happy looking at your wedding photos/video for years to come and see her in them?", ">I have allocated one bridesmaid to keep Nola away from me and make sure doesn't say anything critical or bluntly rude about me or my outfit on my wedding\n\nIf you have to do this she shouldn't be a bridesmaid. You're adding extra stress and anxiety to what should be a fantastic day. Get your MOH to do it with you if you need the support. But she doesn't deserve to stand up there with you if she's making your life difficult", "That’s a good enough reason to drop her- the whole point of weddings is for the community to support the couple in this big step in their lives! Literally making fun of the groom is failing in that.", "This is insane. Locate your backbone, and kick her out. Honestly, YTA for being such a pushover.", "You are mentally torturing yourself for months and risking drama at what is supposed to be the happiest day of your life.\n\nAnd you are doing that all because you're hesitant to have a 5 minute conversation with her where you just tell her you're done with her shit and she's kicked out of the bridal party.\n\nNone of this is logical. I know you say you \"have to\" because you're \"bad at saying no\" but this subreddit is absolutely littered with updates from people who were like \"hey guys it's been 2 weeks and I've decided I'm no longer going to be a doormat.\" You can be just like them. There's nothing in the universe stopping you. Literally you can just have a phone call with her that would be shorter than the time it takes to get coffee at Starbucks and it would be done with.", "That's not fair to you or the bridesmaid", "If you’re old enough to get married, you’re old enough to have a grown up conversation. \n\nShe’s making fun of your finance - time to be straight up and tell her she’s out. \nHow could you let someone be in the wedding that’s so disrespectful to him let alone the crap she’s pulling with you??!!", "Oh no, OP! I made a comment and have now read this. She's got to go! It's not okay that you as the bride need to get someone to keep her away from you. They're supposed to be there to support you and your fiancé. And insulting your fiancé is not okay. \n\nAs you're from a small town, you can let it be known that she was cut because she has been a nightmare, and provide some of the examples you've told us here. Your day is meant to be memorable... In a positive way. She's trouble!\n\nAgain NTA.\n\nEdit: For clarification and corrected typos", "Going to be far more awkward seeing her after your wedding where she’s made a fool of herself and embarrassed you or done something else to trash your special day. She clearly doesn’t care about you as a friend or the bride. \n\nIf you’re adult enough to get married you’re adult enough to stand up for yourself. Use her as your first practice on having a spine. It’ll do you wonders. \n\nHope you have a wonderful day and long loving marriage.", "Girl her mocking your fiance is terrible es paired with everything else. Have one of your good friends take your phone and boot her, they shouldn't have a problem with it. I've written and sent resignation emails for friends who were too nervous to take that last step and I'll never regret it, I'm sure your actual friends will be over the moon to send her on her way!", "I’m sorry, but your fiancé deserves better than this.\n\nWhy are you prioritizing someone you don’t even like over your fiancé? Because that is exactly what you are doing. \n\nIf you are so afraid of confrontation and drama that you are keeping her in your wedding party after she is unkind to your fiancé, then you are not mature enough to get married. This is his wedding too.", "With that, she should be out. Next time she says ANYTHING (and she will), kick her out. Tell her enough is enough, she has no right to make any demands or whatsoever, and that she crossed the line.", "Op, PLEASE fire her.. it is going to end up awkward regardless, but one preserves your wedding experience and one doesn't", "Dude you need to grow a spine. You will be so much happier if you stop letting people walk all over you. I know it’s hard to believe, but it’s true.", "Bella, this is your wedding. Your special day. You need to look after your happiness here. Someone you're not close with, who mocks your chosen partner, is disrespectful of your (reasonable) requests, is only in your bridal party because she DEMANDED TO BE, and stresses you to the point you worry she needs to be kept away from you, should not be part of the festivities. While confrontation may be difficult for you, I think you owe it to yourself to enjoy your day. You can deal with the awkward bump-ins. You'll never get this day back.", "God just grow a set and kick her out of the bridal party. Tell her she’s welcome to come to the wedding as a guest but in no way will she be a bridesmaid. A drunk promise 3 years ago isn’t binding and she knows it.", "Does ur fiance know she makes jokes about them? I dont know your fiance or yall relationship just what you say. It might be hard to say no yet it hurt more losing something important to you cause of it. I didnt say no to moving in with an abusive dude ect when trying help a friend. Thankfully it help me grow a back bone cause i left before he attempted murder the couple i try help. Best learn before its to late and it effect you emotionally. You control you unless you let others control ya. But again i dont know all of the story. The bridal party i say maybe a little to firm like others said. The hair and dress your nta. Where she jokes about your fiance hopefully they are simple silly jokes and not harsh and rude comments behind jokes. Congraz on the wedding tho.", "How does that bridesmaid feel about that? \n\nHer whole job for the wedding is babysitting your other bridesmaid because you cannot say no? \n\nFor fucks sake", "No one’s (well myself at least) is disagreeing with that. Doesn’t change that for many what you grew up with is embedded in your brain.", "Whose wedding is this? You let someone force their way into your bridal party. You’re letting someone else deciding whether the bridesmaids have the same hairstyle. What do you want to do? No one is more knowledgeable about what should happen at your wedding than you and your fiancé. It’s your day.", "Guess what - your marriage is still valid even if you do things differently than what was done for three other weddings your bridesmaid was part of.\n\nYou and your fiancé can do whatever you want for your wedding. If you want your bridesmaids to have uniform makeup and hair - you can ask for that. If you don’t care - that’s also fine!\n\nHell you could not have bridesmaids AT ALL if you didn’t want and your marriage would still be just as valid.\n\nNo one cares if your bridesmaids look uniform or not. Literally no one will care and guess what, once you’re settled into married life, neither will you.", "Not really that uncommon as you'd think, when I was doing wedding hair I was in the NYC area, I was actually charging more than that but still less than a lot of other wedding stylists. The closer to the city you get the more expensive stylists get. Honestly I wouldn't go all the way out to whatever location the wedding is at and do multiple people's hair for less than $100 each it's just not worth it, and if course the bride typically has the most elaborate style so of course it's going to cost more. Not for nothing but I'm traveling and working as the bridal parties personal stylist for the day, providing all the products I use, getting everyone looking perfect. I'll likely have to set aside the majority of my day for each wedding party I provide my service to and it's a ton of work. I like to get paid accordingly for my labor. The cost might seem high to you but when you consider the effort that goes into doing an entire bridal parties hair it's honestly not that unreasonable.", "Omg we used to wear these dyed to match dress satin pumps. Once the ac went out in the shit h and I sweat so much my feet were plum for days. I just aged myself so terribly. Also that wedding removed 40 Bobby pins from my updo. Last time as an attendant.", "It’s not on the wedding day though?", "That doesn’t even make sense.\n\nHer friends came together to make up her?\n\nAre they her mothers?", "I mean this is a bit harsh but u/uosdwis_r_rewoh is right. Your other bridesmaids are affected by this. You’re affected by this. Your groom is affected and everyone at your wedding will be too. You need to empower yourself to step up and politely lay down a boundary. The boundary being: “I’m uncomfortable with the demands that you’ve made, and I feel it would be best if you were no longer a bridesmaid”. You’re NTA for this but you kind of are an asshole for making this everyone else’s problem. It’s YOUR wedding and you’re not honor bound by a drunken promise.", "Or to her fiance either. Nola sounds awful.", "You’re not contradicting anything I’m saying. Except it’s expected that a bridesmaid pays for her own hair and the bride doesn’t dictate the style. Yes we get it done by the same stylist or stylists as a group *sometimes*, but I’ve never had the bride tell me my style. I obviously am not questioning the cost. I’m a native NYer, I pay $400 to get my color. I know what things cost.", "Doesn’t matter it’s not that big of an ask … I went on vacations where we got certain bathing suit colors for some days", "To make \"her her\" -- the person she is.  In case I'm not paraphrasing fairly, here's a [link to the comment](https://www.reddit.com/r/AmItheAsshole/comments/18ywf0k/comment/kge995l/?utm_source=share&utm_medium=web2x&context=3) explaining the reasoning.", "Ah I see - it’s kind of a sweet sentiment but only her bridesmaids made her how she is? Not her female family members, teachers, mentors.\n\nThis bride and her friends just seem so…young. So consumed with the things that don’t really matter.\n\nWhich I guess she they are, if she’s only 25.", "While your friend sounds like a PITA, why are you forcing a hair style that your friend isn't happy with? A dress I can understand, but I would be unhappy with a messy bun. \n\nAnd since when isn't pink a suitable colour if you want rainbow? This seems pedantic\n\nESH", "ESH she sounds annoying but so do you. \"You have to pay for your hair, but you can only wear it the way I tell you\" \nThen you tell her she can wear any color of the rainbow but then tell her she can't actually. Any color of the rainbow generally implies any color at all, but you decide that it must be an \"official\" rainbow color. What's more cringey is that, you chose this because that way they all represent you. Gross. It's a shower that other people are supposed to throw for you, not you get to dictate and control everyone else", "Sorry but telling people what to wear to the BRIDAL SHOWER (I assume it's a party where you receive gifts) is a thing?", "Why, yes, yes you are. Tell me, would you exclude a dear friend who wears her hair very short because she can't wear a bun? The bridesmaids are not a chorus line. And no bride has any business telling anyone what to wear to a shower. Or telling any guest what to wear to anything, unless she is specifying black tie or white tie.", "Nola is very demanding of her choices when in fact she shouldn’t be. It’s your wedding day and you shouldn’t be stressing out about this kinds of stuff. She could’ve declined the offer of being a bridesmaid in the first place if she wants to change everything according to YOUR plan. She’s the @hole imo. And really? Wear white? Is she kidding me?", "This is the first time I've ever heard of a bride-to- be demanding that bridesmaids wear a specific color to the bridal shower! I think that makes you a little bit of TA; however, the other bridesmaids apparently said they would do that, so your trouble-making one should probably fall into line. \n\nAs far as the hair style, the \"good\" bridesmaids have already accepted the messy bun look but, of course, the \"bad\"  one doesn't want to go along with it. Frustrating, and I don't think I would want a bride'smaid who argued about things that had already been agreed upon by the others.  Is it too late to get rid of her? You didn't say how far away the wedding is but, if I were you, I'd deep six her and move on.", "NTA\nFor the hairstyle, I guess, although I can't understand the idea of brides.aids looking like clones. Just let them wear the hairdo they feel best in.\n\nBut brides are now dictating the colors that bridesmaids wear at showers? When will this wedding as a production mindset end?", "YTA.   It’s just hair, that has got to be the stupidest demand I’ve ever heard from a fellow adult…Nobody cares about your hair or its style.   What matters is ensuring only you wear white.  The hair doesn’t matter", "NTA. Your day, your way and you need to get better at saying no. \n\nTell the unruly bridesmaid that this is what being your bridesmaid looks like, if she doesn’t like it, then she’s out. Personally, I’d be kicking her to the curb anyway, because a) you don’t really want her as a bridesmaid anyway and b) she’s causing you nothing but stress and hassle. In addition, I just know she’s likely to agree to your demands and then do her own thing anyway.", "Op. She's trying to make your wedding about her. Kick her out of the wedding party and maybe even consider not inviting her as she seems like the type to wear a white dress purposely to your wedding.", "Before you kick her out of the bridal party (and do please kick her out of the bridal party) jokingly let all the bridesmaids know one of their duties is to “accidentally” spill wine on guests that come in wearing white to the wedding", "NTA and stand your ground. Damn weddings make people act weird. It’s your day OP, practice being firm! It’s a really valuable skill", "**YTA for forcing your bridesmaids to wear a \"messy bun\" while you wear a glamorous hairstyle.**\n\nJFC, if you're that pathetically insecure, then don't have ***any***  bridesmaids, instead of forcing them to look dowdy so that you will look better in comparison.", "Petty", "NTA for hair and bridesmaid dress, but YTA for trying to dictate what people wear to the shower. That’s not an event you’re hosting.", "[removed]", "NTA- i would tell her she either does as asked or she steps down.", "I’m in my late 40’s now…. But when I was planning my wedding I remember my bf at the time asking if I wanted her hair long or short and I thought that was SUCH A WEIRD question !!! Like REALLY??? I’d NEVER try and dictate how someone’s HAIR would be just bcse it was my wedding!! That was in the 90’s…. Idk- it’s weird to me that the bride gets sooo much control over others just bcse she/ you/ I am getting married! \n\nBut back to the topic at hand…. No, NTA- bride wants her OWN unique hairstyle away from the uniformity of the bridesmaids…. I would expect everyone should be in agreement. If this ONE BM doesn’t want to comply, (esp all the other things troublesome) I’d ask her if she is still comfortable being in the wedding- if so, wear your hair like the others, or I’ll find a replacement- or JUST NOT! It won’t ruin anythg- there will just be one less BM….. no one will even care in a year! \nProb not gonna be a popular opinion but, oh well! Life and things and days move on! \n\nSome people’s ‘besties’ won’t even be besties after some time- just being real…\n\nNTA", "What kind of person demands to be a bridesmaid based on a promise from years ago? If you aren’t close she should just be satisfied with getting an invite. Kick her to the curb she is going to disrupt every event leading up to and including the wedding. That being said demanding a color dress code for the shower IS a bit extra. I’m assuming it’s for the picture aesthetic?", "Stop beaing a pushover , who cares what she wants just kick her out it’s not like you are even friends at this point", "She sounds like trouble. Looks like you don’t like her that much either. Hmm, not sure I’d want her at my wedding. NTA", "NTA\n\nBut jeez stand up for yourself!!! You keep saying you don't want her as a bridesmaid and yet won't drop her from it!\n\nYou say you're not close and it was a drunken promise.", "NTA, kick her off the bridal party, she's trying to make it about her.", "Nta. Its YOUR  wedding. Key word being \" your\".", "Nta. Time to lay down the law. \n\"Nola, it seems you aren't happy with any of MY wedding choices. My briedemaids will all have the same dress and hair. I think you would be better suited as a guest. Then you can do your hair however you want and wear any color but white in any shade. Im so glad you voiced your concerns so I could realize it wasnt a good fit. No hard feelings! I totally get that you want to be in something you like.\"\n...have security. The way she's acting she would show up with vintage waves and a white dress. She's an attention seeker. Nip it now.\n\nHave red wine and your bridesmaids on lookout. She shows up in white there might be a accident.", "NTA\n\nKICK HER OUT.\n\nOut of your bridal party and life.", "NTA\n\nIt's your wedding and she just wants to be center of attention.\n\nIt's one thing if a brides maid says hey can I do this smallish alteration to the dress because my tits keep dropping out and we don't need that on your day. It's another to be like ehhhh so I would rather look like you.", "“Do you want to stand in the front of the church, with the outfit and hair I picked, or with the rest of the guests wearing whatever you want?”", "NTA - And honestly this entire situation screams of needing boundary settings. No is not a four letter word. That’s hard for a lot of us, being women and people pleasures is sort of drilled into us. You need to establish good, firm lines in your friendship. It’s healthy for you, and her. If she’s a true friend, your relationship will only get better because of it. \n\nGently remind her you’re the bride, it’s your day and when it’s her day she can do things how she likes. You’d “love” to still have her participate, but if she doesn’t feel up to it, than she’s welcome to simply attend as a guest, provided she doesn’t wear white as a guest. Let her know you appreciate her commitment and desire to be with you on your day, but ultimately it is your day and you shouldn’t have to compromise for it.", "NTA uninvite her already. The mere suggestion/thinly veiled threat of wearing white to your wedding because she can't wear pink? Girl BYE.", "NTA honestly as someone who regretted who I had in my wedding party...just kick her out. It honestly doesn't matter if it makes the number uneven. I ended up with 7 bridesmaids and a lot of drama trying to keep the numbers even. Just kick her out.", "It’s your wedding. You make the rules. If she doesn’t like it, well she can simply not be in the wedding.", "NTA, it’s your wedding not hers. If she can’t do as you ask she doesn’t get to be in the wedding. \nShow her this thread, if you need too. \n\nShe doesn’t seem like a good friend", "NTA but omg unbridesmaid this nightmarish non-friend before she destroys your wedding and probably your relationship too bcuz what she’s showing you now is only a preview of what’s to come.", "your only hope for a drama free wedding is to get rid of her.  \n\nNTA", "Ok so to recap, friends calls you after 2 years of silence to push you into making her a bridesmaid, she acts like she’s entitled by wearing a different color dress and a hairstyle that matches yours.\nNTA\nIf girlfriend can’t fall in line with what the other bridesmaids are doing and wants special treatment then she can take several seats with everyone else or not show up at all. I know you won’t get the money back from what you spent on her but your day should be happy and all about you and your new hubby", "Seems like OP’s Asshole friend got on here and is down liking everyone’s answers of her being an AH!!!! Haha….. I swear!  If that’s indeed the case, I indeed take back what I said previously!!!!!", "NTA but you will be if you don’t remove her from your bridal team. Her behavior will not only affect you but your partner and others on the wedding day. So if you can’t get rid of her because she is treating you horribly please get rid of her for the sake of others and the drama she will cause", "NTA. I wouldn’t be friends with someone like that and I don’t think a promise made 3 years ago has to be kept. What if you had a falling out? Would you still have to keep your promise? No? Then you don’t have to now either, because obviously things changed since then. But unless I’m missing the last version of the rainbow song, Pink is a color of it?", "I'm sorry, she said she was going to wear white to YOUR wedding? You need to kick her out of the bridal party.\n\nEveryone knows, EVERYONE KNOWS that a wedding is about the people getting married, and the people getting married only. Usually, because this is the way we're socialized, it's the bride's vision. We're encouraged to plan our weddings from a very young age. Many of us have had very special, very specific ideas since we were very little. Even if we don't, it's still *our* special day. \n\nThe bridesmaids and groomsmen are *invited* to be a part of that special day. But it's not remotely about them. And because it's not about them, they don't really get a say in much of anything. Maybe on their day, they get to decide what everyone wears and whether or not to go out of their way to accommodate individual tastes. But they don't get to dictate jack shit on anyone else's day.\n\nYou get to pick everything about your wedding. I mean, you agree to it all with your spouse, hopefully you plan it together and all. But the bridesmaids sure as hell don't get to pick anything unless you want them to. If that means they wear a burlap sack and straight up juggalo paint, they better do it with a smile on their face. They don't have to like it - it's not their wedding. And if they're uncomfortable with something, they don't have to do it. It just means they don't get to be in the wedding.\n\nThe fact that she has basically wormed her way into your bridal party, and then found fault in everything she has been asked to do, and *then* tried to wear the ONE COLOR that EVERYONE KNOWS is SPECIFICALLY RESERVED for the bride (eeeeeeeeeveryone knows the bride and no one else wears white!!! this is extremely common knowledge!!!!!), and NOW she's trying to do her hair the same way as you??!??? She's causing problems on purpose and she's trying to take the spotlight from you.\n\nIdk wtf her problem is, but she doesn't deserve a place of honor on your special day.", "Uhhh.  The hair part is reasonable.  But if you were going to be THAT specific when telling someone to wear any color of the rainbow, then you probably should have just said “choose from this list of colors”.  I’m literally gay af and I wouldn’t have been able to tell you that pink isn’t in a rainbow.", "I think weddings are fucking stupid. That being said you’re not the asshole, this is your party. The question is are you really that desperate for friends to put up with this stupid cow? You better learn how to stand up for yourself if you ever want to be a mother one day. You’re going to  have a child that desperately needs their mother to stand up for them.", "Dump her from the roster.", "Jesus. Fire her as bridesmaid. She sounds like a nightmare. What is she even bringing as a bridesmaid because it doesn't even sound like she's caring or supportive of your relationship.. this is a celebration of you and your partner's love for each other and she's making everything about her. She is going to ruin your wedding day.", "Op, she's nor your friend", "NTA but who begs to be a bridesmaid?? I don’t need any more “oh you’ll wear it again” dresses.  Same with shoes.  \n You want me to shower you with prepared meals if you’re sick or just had a baby, I’m you’re woman. Need help doing housework under the same terms? I’m so there.  I’ve cleaned up friends broken waters with plug without a blink.  \n\nBut I am so over being a bridesmaid.  I became a last minute Maid of honor when the first one bailed and had an evening to write a speech because “you’re funny and speak publicly.”  Then I couldn’t be the witness to the marriage because I’m not Catholic.  I love my friends but dread bridesmaid crap.", "Maybe say to her that you are getting the feeling that she doesn’t want to be a bridesmaid and would she rather be a guest. If she has questions, say ‘well you are unhappy about everything and the other girls are fine. It feels like you don’t want to do it’. Then she chooses to lift her game or come as a guest. \n\nNTA", "Unbridesmaid her. 😭", "Since when do brides have a say about the colors a bridesmaid has to wear to the damned shower?!?", "NTA. Why is she still in the wedding party? She clearly doesn’t respect you.", "NTA It’s called bridesmaidzilla and you don’t want her anywhere near your wedding. You aren’t that friendly anymore anyway so you aren’t ruining anything. Tell her she is invited and will not be admitted. She’s caused enough problems.", "NTA. If you need help talk to your groom or the other bridesmaids and tell them what is going on. She's trying to upstage you at your own wedding and not even being subtle. But on your big girl pants and do what you want to do.", "There is rotten asparagus in the bottom of my fridge that I wouldn’t drop as fast as I’d drop this howler monkey. Learn to say no. Then learn to say Fuck No.", "NTA and you need to remove her from your wedding party. The fact that you’re paying for everything is not normal and extremely generous on your part.", "You really want this person in your wedding photos and memories?", "nTA but I would go crazy if somebody told me how to wear my hair. You have really strange customs when marrying in the US…", "Not only kick her out as a bridesmaid, but uninvite her from the wedding. She wants to upstage you & make it all about her", "Wow.  Kick her out.", "NTA - kick her out the wedding, she is going to be a nightmare to continue this with. It's your day and she's making it about her. Strange behavior", "NTA!!!! Your wedding is YOURS and your HUSBANDS day. Anything that isn’t done how you want it needs to be nipped in the bud. Wanting to wear white and wear her hair like yours??? Does she know she isn’t the bride??? If it were me I’d kick her out of the bridal party now.", "She said SHE’D wear white? Oh honey no. \n\nWhat exactly do you get from this friendship?", "I mean… why do you force them into a specific hairstyle?! I think that’s weird.\n\nBut she seems to be very self centered, so ESH", "Do you really want to keep dealing with this? I mean it's tough but tell her where she can go if she doesn't follow the outfits picked. It's your day, your vision, boot her if she doesn't do the right thing.\n\nNTA.\n\nAlso all the best, have an amazing day and I wish you and ya partner many happy centuries (I assume you'll both be put into computers at some stage)", "Kick her out of the bridal party? Why are you doing all of this for a person who you had a falling out with?", "NTA. Ditch her. She pushed you into making her a bridesmaid even though you barely speak. She’s doing all of this on purpose… she’s causing issues for you on purpose… don’t waste your time or energy on her", "I think Nola just 'entitled' herself out the wedding party, seriously OP she will just make your wedding about herself she's got main character syndrome and will wreck your wedding \n\nAct now and dump her from the wedding completely unless you want to be reposting on Reddit about how your bridesmaid turned up in white with her hair identical to you and stomped all over your day!", "NTA - Don't make the same mistake I did by having a bridesmaid that you regret. Mine was also a friend that I'd fallen away from a bit, and she was utterly **miserable.** She too said that she did like her dress after it was already bought. She was hours late to getting ready, and there's not a single photo of her smiling on the day. She also tried to cause drama after my husband and I left but my sister very quickly put a stop to that. Use the bravery I wish I had and kick her out", "Bro, kick her out. She’s a shitty person, and inevitably after this wedding you will go back to not being friends but she will be in all your pictures. You might as well go ahead and burn the bridge now.", "Kick her off the list. A promise made 3 years ago when you haven't had much contact in 2 years is just a recipe for disaster and she's already showing it.. 🤷‍♀️ \n\nJust tell her that since you've falled out of contact for so long you don't feel like you have matching wavelength and you don't want either of you to have a shitty time for your wedding. 🤷‍♀️ if she gets mad it's not like you're missing much of a friendship anyway", "NTA, my goodness girl, this person is going to ruin your wedding, I can just feel it. I would kick her out of the wedding party.", "Every colour of the rainbow is literally every colour on the spectrum. It seems like you meant you wanted them in primary colours. \nBut if you don’t want her as your bridesmaid don’t have her as your bridesmaid.", "NTA\n\nYou promised she'd be a bridesmaid. You didn't state of how long nor that you can't kick her out. Just saying.", "NTA please read my post!!", "NTA especiallyyyy for all the reasons combined, the only thing I can think of is I’d hate to be forced to wear a messy bun for a wedding. I’d get a headache and don’t think it suits my face so that’s the only thing that sounds reasonable to me haha", "NTA", "NTA. Kick her out of the bridal team.", "Fully agree. If the bridal shower hasn't happened yet, please OP, tell her that she's out already. It's like she's trying to make your event all about her. She's trying to upstage you methinks.\n\nMy suggestion: For your peace and to have a worry-free, peaceful and enjoyable wedding and pre-wedding events, cut her off now (don't even invite her as a guest and ask security to ensure she does not enter the venue). She won't like it, yes. But this is all about you. It also won't make you an asshole as you've already communicated with her you reasonable requests.", "NTA \n\nJust uninvite her. OP hasn't talked to Nola in 2 years and Nola is obviously a selfish AH, why would she want her in her life? Just send her a text: \"Your behaviour made me reevaluate our friendship and I came to the conclusion, that you don't have my best interest at heart. You trying to force your own views on me and deliberately choosing options I not only chose to set myself apart from the bridal party but are also typically reserved for the bride like a white dress feels disrespectful and selfish. I want to surround myself on my wedding day with people who love and support me. Sadly, it looks like you are not one of them and therefore are no longer welcome.\"\n\nIf that feels too harsh, OP can soften it by basically saying \"if you can't change your attitude, I can't welcome you at my wedding anymore.\"", "This woman needs to be kicked out of the bridal party. I wouldn’t let her in as a guest either.", "Pink is definitely valid as a rainbow colour.", "Thank goodness for this comment!  So many people seem to agree with this bride, and yet to me, it sounds ridiculous.   Why not just hire actresses or models for your wedding so you can insist they look how you want?  Your pictures will be perfect and your friends will no longer have to worry about your requirements and can just be happy for you.", "I’m SO confused why wearing a pink dress isn’t allowed", "Well - technically “the colors of the rainbow“ are clearly defined as ROYGBIV. Children learn them in school, there even is a well known mnemonic: *Richard of York Gave Battle in Vain*.\n\nNow of course you can say that commonly people understand that saying as “any color in the world“ or “any color you like“, and that is fair, simply a different view.\n\nTherefore, this could just be a semantic misunderstanding.", "The bridesmaids picked not me on a majority vote, it's going to be a hot humid day (with chances of a thunderstorm) so they'd like their hair out of their face. If you can think of alternatives I'd be happy to suggest to them?", "Roy G. Biv\n\nRed Orange Yellow Green Blue Indigo Violet\n\nThose are the only colors of the rainbow", "I am trying to understand what she means by \"Hollywood Waves\"! I grew up in a family who worked \"in the Business\"! Is she referring to 1920's, 1930's, 1940's, 1950's or 1960's Waves ?!?!?", "I am hosting, and while I call it a \"bridal shower\" that's only my 5 bridesmaids and me, no gifts or anything allowed or expected. We will be playing some games and getting to know each other as none of my bridesmaids have met each other in person, 3 live in different cities and are flying in for the wedding. 1 lives on the opposite end of my city, so about a 2 hour journey to my home. And Nola lives down the street. I've clarified why I picked the rainbow in a different comment and that isn't even my question, my question was just about the hair.", "There is no such thing as stealing someone else’s day.\n\nNo one is going to be confused by who the bride is and what the purpose of the event is that day no matter what Nola does. At most she’ll draw attention to herself and people will ask themselves “What’s that girl’s problem?”\n\nStealing someone’s day is not a thing.", "They are 25 and haven’t realized that being a bridesmaid is actually a huge financial and time suck and it’s way more fun to just be a guest.\n\nI’m mean, maybe Nola is realizing it just now…", "To the shower. After she was told she couldn’t wear pink.  To the shower, because OP was telling her bridesmaids what color to wear to the shower.", "Oh, not only white but also a dress that looks suspiciously bridal.\n\nOP, she is not a friend. Drop her and block her or I guarantee your wedding is going to be a nightmare.", "It doesn't even sound like she wants to be a bridesmaid at all. She is fighting this every step of the way. Some people are better left as guests.", "OP, please listen to this, I so wish I had kicked a very similar bridesmaid out of my wedding. She’s in all the photos and acted like an AH. I would uninvite and block.", "OP shouldn’t even have her as a wedding guest! She just sounds like trouble. NTA", "The rehearsal is itself an event for the bridal party, as is the shower. And OOP is being extremely flexible. “pick an actual colour of the rainbow” is not hard. “All bridesmaids’ hair should be up (if not too short) while the bride’s is down” is also not remotely demanding. OP’s actual friends are fine with these things. Nola wants to be a star and needs to take a seat.", "Red wine on standby. Accidental spills happen allot at weddings.", "Agree. I would interpret ‘any colour of the rainbow’ as any colour.", "The more you know. In Australia I learned the rainbow song as Red and yellow and pink and blue, purple and orange and green…", "Also pink is essentially just light red. If OP allowed light and dark blues and greens etc why not light red?", "I’ve never been to one where there is a theme to what bridesmaids wear. I’ve seen them but I’ve never known someone to actually wear expect that of their friends.", "I am 59 yrs. old and have NEVER heard of the bridal party being told what colors to wear at a bridal shower. That level of minutiae is just mind boggling and I find it hilarious and ridiculous. These women should be able to wear whatever they fucking want to wear, excluding white, I suppose.\n\nEdit: I just reread the post and noticed the spelling of the word “colour” so OP is obviously not from the US, which is where I am from. I’m guessing UK but I suppose several different countries spell it that way. In any case, perhaps the whole “bride designating what colors the guests wear to the bridal shower” is a thing in OP’s country. I’d be interested to hear from anyone else who has encountered this before and where you’re from.", "That’s the lamest shit I’ve ever heard. Someone wearing pink is not going to ruin the (lame) idea", "She is being unreasonable, but this is way over the top. No one likes having to buy a new outfit in a colour they don't love to be someone else's accessory. No one will get what you're trying to do and it's only a bridal shower. Stuff like this makes things much less fun for everyone.", "Or if interest, is there a reason you think you get to control hairstyles you're not paying for, and for why you want your bridesmaids to be wearing styles that are both ugly and inappropriate for the occasion?\n\nYTA, btw", "Give me her info.  I'll kick her out for you.  You deserve happiness on your wedding day.  Not stress.", "RE-READ! The Bride is so egocentric, that she needs to control what color the Bridesmaids wear to her bridal SHOWER !!!!!", "Her REQUIREMENT was for \"MESSY BUNS\" !!!", "Of course you can cut her. Text her and have your fiancé answer the phone. He/She can tell them that they’re no longer invited and to stop hassling you or you’ll be blocked.", "\"Only\" makeup and hair? That's often the most expensive part. Bridesmaids dresses often cost $100, while HMU is several hundred, never mind making sure that she has proper undergarments and shoes.", ">and they need to have a bottle of red on hand before pictures of the guests are taken. Take no chances.\n\nAnd they should take the chance of getting footed with a dry cleaning bill or something like that? \n\nSeriously. When people recommend \"just trip and get red wine all over that dress!\" They aren't the ones who potentially have to pay for cleaning the dress, or worse, pay for a new one. \nPlus, the wine could get on the venues stuff. Like chairs. The floor, etc.\nA full-on bottle, as you suggest, contains more than just a few drops. \n\nIf she's causing this much issues. \nThen, simply kick her out of the bridal party. And consider if you even want her there as a guest. \nIf she is a guest. Have someone informed that if she acts up, kick her out.", "I hate the ‘bottle of red’ thing. It’s frickin’ passive aggressive.   \n\n\nJust use words people …", "Same. That’s how that phrase is commonly interpreted. It’s kinda an obnoxious request anyway to put restrictions on what someone wears to a bridal shower.", "The colours of the rainbow is different to ‘any colour of the rainbow’ - I agree. But also, eh. If the bride said pink, I’d wear pink!", "How weird, we (in the UK) have Red and yellow and pink and green, purple and orange and blue!\n\nI wonder why green and blue are switched…\n\nIn other news, OP, ESH. If your intent is to create white from the entire rainbow, then you actually just want Red Green and Blue. All colours are made up from those three - you must have learned that in your physics classes? This friend sucks because she’s being a pain and not wanting to do what she’s being asked to do for YOU, whose day it is. You suck because you don’t understand basic colour theory and won’t just get rid of her. Tell her she’s out.", "I like RYP B. POG more than ROY G. BIV though to be honest", "Im in Australia, for mine my bridesmiads asked everyone to wear something black, easy enough I spose. I'm personally a believer that if there's a theme, it should be optional and something people most likely already have/ can borrow/ or just wear an element of instead of a whole outfit. \n\nPeople go a bit nuts with these things. Really here themes just seem so exist so you know which group of drunk girls go together when you are going from bar to bar.", "I’m in the UK and on my friends hen do there was a colour coded dress code, we all had to wear black bottoms and pink tops. Everyone did and it looked really nice; it was a good bit of fun. Just depends on the person I think.", "My kind of hens night. Give me a few too many drinks at the pub and a lot of laughs with the girls, any day.", "It really depends on where you are for if this is considered over the top or not. My friend went to a wedding where she had to buy a matching bathrobe, matching casual outfit, and a white dress. They even had matching earrings and coordinated Mickey Mouse ears (Disneyland party). That isn’t uncommon in our age and area. Wedding culture is getting a lot in some parts of America. And other cultures have always had bigger weddings so that combined can make for interesting cross-overs. My other friend had three weddings for cultural reasons and her bridal party (including her/her husband) had different outfits for each one. \n\nI didn’t even blink at OP having coordinated outfits for a bridal shower. It’s the tip of the iceberg. It’s also why I’m eloping.", "Checking the previous comments OP mentioned that a few other bridesmaids can’t have this hairstyle or don’t like (1 has hair that’s too short and the other preferes Hollywood waves). So OP did adjusted as long as it’s not the same like hers but this one bridesmaid wants the same like her", "Ok, I agree with you, but even still, we don't know the price of the dresses, nor what she is paying for the hair and makeup, which, is rather relevant. Undergarments would also likely be provided with the dresses too", "Nah just uninvite her from the wedding. She's the kind of cockroach that will turn up wearing white as a guest  for revenge if she gets kicked out of the bridal party.\n\nEdit: I do totally agree that she is 100% planning to wear white anyway.", "Anyone who says they'll wear white to a wedding is not a reasonable person and is clearly looking to stir trouble.  OP doesn't sound unreasonable and usually bridesmaids understand and do their best to be helpful.", "I've been to some really fun weddings - I've Ceilidh danced, ended up skinny dipping in a Yorkshire river, been to a costume party reception in a medieval hall, cocktails in a giraffe house (I was singing in the choir for that one too and we sang the Lion King when they came down the aisle), maybe you need more fun friends and family!", "To be fair, she already used her words. If she still shows up in white that’s on her", "OP is already using her words. Some people just don’t deserve more time and conversation spent on them. I would have already uninvited her completely at this point or just said no to her in the first place. If you have to beg to be in a bridal party, you shouldn’t be. It’s quite pathetic of the “friend”.", "No, it's just aggressive, a form of physical assault with serious consequences.", "Now I feel conflicted because I remember it being blue at the end as well, and I was raised in Australia, but by a British mother, so who knows where I first heard it\n\nMakes more sense with blue at the end though because it continues with \"I can sing a rainbow, sing a rainbow, sing a rainbow too\" which would rhyme with blue 🤔", "I think it depends what age you learned at also, or maybe what media you watched to learn. I'm from the UK and I learned ROYGBIV, no mention of pink. This recently came up in conversation at my work and it turned out that we had slightly different versions we had each learned.", "I’m from the UK (wales) and we learnt it red and yellow and pink and green orange and purple and blueee", "That's a pretty basic \"dress code\" though and there's a good chance that most women can comply without spending any money just for this one night.", "Yes, it’s a bit nuts. I think I’d turn up in black.", "Yeah, this explanation made my skin crawl lmaooo", "That's one way to analyse it. I simply meant I am who I am because of these wonderful ladies. They've been the crux of my life over various seasons and periods, and I want to share with the world how they have impacted my life. They're not \"parts of a glorious whole\" but my mentors that have molded me, nurtured me and helped me grow. I didn't think I needed to specify this but apparently I do.", "May be different culturally, but I think that’s too much to ask of someone.  If you’re going to pay for a different outfit for the bridal party for every one of the events that’s one thing, but if not I think it’s unreasonable.  It’s already so expensive to be in a wedding without adding more things outside of the typical expectations of a bridesmaid.", "YTA and here's why: \n\n1. You're not sticking up for your fiancé. Don't let anyone trash talk about your significant other.\n\n2. You're stressing out everyone you like (bridesmaids, fiancé) for the sake of someone who has no respect for you at all. \n\n3. You're paying this person to treat you like crap (buying bridesmaid dress, feeding her at wedding).\n\n4. You're more worried about potential future awkwardness than the certain bad moments happening today. Who cares if it's awkward in the future? You'll know why, your close people will know why and anyone who asks about the awkwardness in the future will know why - cause she's a jerk to you and you won't put up with it. \n\n5. You're being the biggest AH to yourself & your dream wedding. This jerk will be a huge part of your wedding memories and you're allowing it to happen. \n\nGet rid of her, make everyone happy and congratulations!", "OP are you really ready to be an adult and marry.  Honestly no insult but it seems you still need time to mature.  Being married is about be ready to advocate for yourself in a marriage & in life.  If you are grown enough to be a wife you are also grown enough person to kindly speak to Lola to exit the wedding party.", "all of your reasons for not cutting her out are ridiculous. who cares if you see her? who cares if she thinks you’re mean? shes making fun of you and your fiance and making your life difficult? stop being a doormat, you’re basically being bullied at your own event", "WHAT? No way should you be having someone in the wedding party that makes fun of him. That’s so disrespectful and not how you should start off your marriage and the perfect excuse to tell her she is no longer a bridesmaid.", "Please cut her out of the wedding. She is broadcasting very clearly that she does not respect you or your decisions, your fiancée, or your wedding.\n\nThe fallout from disinviting her will be *less* than the problems she will make for you by allowing her to stay. \n\nIf you cannot do it yourself, ask your MOH to do it on your behalf. Friendship with this woman is not something you need to worry about maintaining.", "This is going to backfire. Take her out of the wedding now. Anyone who tells you they want to wear white to bridal events and is mocking your fiancé is a bully. They shouldn’t be invited, let alone wasting a place of honor. I think you’ll regret it if you let her come.", "CUT HER OFF!!!!!!!!! PLEASE FOR YOUR OWN SANITY!!!", "Oh Hun, you need to not only get her out of your bridal party but not even invite her to the wedding.\nShe is disrespectful to you and your fiance now, think of how much worse she will be with a few drinks in her.\nI was going to say keep the peace as you seem unlikely to stand up for yourself to avoid the conflict but that's not on.\nIf not, you need to have a sit down with her, let her know how you feel and set some ground rules.\nShe's set to ruining one of the biggest days of your life.  Is she worth that?", "not removing her will make it even more awkward, she’ll make you worry on that one special day. It’s very likely she will also do something that is hurtful. You and all the attending wedding guests will remember that and that will make it awkward as well as ruin your day.", "So now your bridesmaid doesn’t get to enjoy your wedding and celebrate your marriage because she has to babysit someone no one wants at the wedding anyways?? YTA for that alone.", "You're not mature enough to be someone's wife if you are not mature enough to kick someone out of your wedding party when they MAKE FUN OF THE ACTuAL GROOM.\n\nYTA for not behaving like an adult here.", "It doesn’t sound like she’s going to care about it being awkward around town later, after she makes a self-centered scene at your wedding. A bridesmaid that you have to have someone else actually keep away from you at the wedding is someone to disinvite. Bridesmaids are supposed to be supportive. Friends are supposed to be supportive. Nola is clearly not supportive so she fills neither role.", "Get a backbone kick her out of the wedding party.", "Mocking your fiancé is the real issue. You should stand up for him and kick her out of the wedding immediately. I say this as someone who also struggles to say no. She's bullied her way into the wedding and seems determined to ruin it for you. If things are awkward afterwards, that's her fault not yours.\n\nYou need to forget the bridesmaid rules, that's a red herring (or a rainbow trout in this case? 😇 ). She's refusing to respect BOTH the bride and groom. That's the real issue, and that's ban-worthy.", "For the love of God, kick her out of your wedding and wedding party before the bachelorette party. If she is causing this much trouble now, that night will not be fun, it will be a nightmare, and just add more stress right before your special day.\n\nCongratulations on getting married! My husband and I have been married just shy of 30 years. I had so much fun at my wedding! Something always goes wrong at a wedding, my in-laws got lost on the way to the church and were pretty late, but don’t sweat the small stuff. Marrying the man you love is what it is all about. Being surrounded by people who care about you and are supporting you is what your bridal party is about. She should not be one of them.\n\nEdited to fix a little spelling and grammar, so I didn’t sound illiterate 🤷🏻‍♀️", "> Already Nola makes fun of my fiancé\n\nOP what in god’s name are you doing\n\nIf you can’t tell her no for your sake, tell her no for your fiancé’s sake.\n\nThink of it this way: you’re not telling her no. You’re kicking her out for insulting people you love.\n\nYou made the promise with the terms of her as a friend, but she has broken those terms, so you don’t need to hold that promise. Plus, you were drunk. No one needs to hold on to drunken promises.", "On your wedding day you are the Queen. She is already causing drama. Shes making fun of your fiance and making you the butt of the joke!?Seriously, tell her she's out. Have your moh tell her she's out. Let your bridemaids stop censoring her so she says something beyond redemption then you can kick her to the curb for being a b. Heck, just tell her she's done!!! Do you want to look back at your wedding pictures and see her? Do you want to be dodging her all day!? No! No way! It is your day! You are the Queen and she needs to back off of your pedestal! She is trying to dull your shine on what should be your brightest day! Don't give her the chance. Kick her out now, deal with the fall out with brutal honestly (you're not really friends anymore, you've grown apart, she's not happy with any choices you've made for briesmaids, shes a insufferable bully all she did was cause drama)and on your wedding day be the center of attention you deserve to be.", "We can tell you’re from a small town, but this level of micromanaging (specifying how they wear their hair? Telling them a specific color to wear to a bridal shower?) is very small town.", "Yeah I guarantee someone picked a lighter value blue than like royal rainbow blue OP wouldn’t bat an eye. Or an emerald green vs a Kelly green", "No", "“I’m really bad at saying no”- well, honestly? Now’s the time to start. \n\nI couldn’t have had all my bridesmaids look “uniform” even if I wanted to- different hair lengths- and tbh I loved the fact that they all got different looks on the day. They all wore different black dresses that were beautiful. \n\nBut I’m going to tell you something that nobody inside the bridal industry is going to tell you: all those little details that you’re beating yourself up over? Not a single person at your reception is going to remember them half an hour after they leave. Generally speaking, guests remember three things from a wedding: how the bride looked, the food and drink,  and if they got a chance to dance. \n\nWhat do YOU want? Because if you don’t actually care, you need to make that clear.", "Yup! As she’s doesn’t like the dress, she won’t wear it!", "But she promised her like 3 years ago that she could be part of it. /s", "Nola wanted to wear white to the bridal shower - not the wedding. Maybe she understood 'any colour of the rainbow' to be pretty much any colour, but she seems to want a party with her at the centre. \n\nOP should be very wary about their hair - the bridesmaids ar paying for their own hair and makeup so I would expect Nola's bun to be 'poorly' done and fall out into waves..... (what *are* 'Hollywood waves'?!)", "Even if they wear the wrong hairstyle?", "Seriously. I had a wedding at a campground with a bonfire, food trucks, lawn games and a good Playlist. 5 years later friends still talk about how fun it was.", "Yeah ok Doc we see you", "OP is using her words, but in a wishy-washy way. She’s trying to negotiate, with someone who bullied her way into the role in the first place and who hasn’t stopped trying to be special. I agree that the “red wine” attack is ridiculous, encourages bad behaviour, and incurs cleaning fees. Who wants to have a carpet stain distracting everyone for the rest of the event? And since Nola isn’t her friend any more, she’s not going to GAF. A clear uninvite, backed up by security, is the way.", "Yep. Uninvited now. Verbally. Using words. Don’t plant a ‘white dress patrol’ with a glass of red… deal with it ahead of time. Put security on the door if you need to so the issue doesn’t make it’s way into the room.   \n\n\nReading a different post here the other day where someone was ‘red wined’ because they had the audacity to wear a white shirt, with a navy business suit… to a wedding… and wearing ‘white’ was inappropriate tot he MOH. Nah. Someone was being a b t ch. Navy pant suit and white blouse under does not scream ‘stealing the bride’s thunder’. That solidified Red Wining someone in my mind - it’s a low act that shows you knew there was likely a problem and didn’t ahve the balls to deal with it, or don’t have the balls on the day to deal with it. Words.", "Currently an Aussie mum to a toddler - it ends in blue", "Yep, that’s exactly it! \n\nNow trying to figure out a rhyme for green that fits 🤔", "That’s an actual rainbow, yes! Pink (magenta) is opposite green on the colour wheel so doesn’t even show up in a true rainbow as it only covers a semi circle rather than the full colour wheel.  It’s an awesome piece of useless knowledge and great for a pub quiz (sorry for going into science here but I’m a MASSIVE colour/lighting geek and I actually do workshops for kids on the subject on the side 😅)\n\nArguably the true rainbow is the more interesting side of things, as the other way is essentially just between red and blue, so is mostly varying shades of purple and pink.\n\nThat said, I’m sticking to my three primary and three secondary colours as the proper dress choices. I mean… how awesome would an overhead photo be of the bride in white standing in the middle of a circle of Red, Yellow, Green, Cyan, Blue, Magenta (and back to Red). I mean, that’s exactly how it looks when you shine RGB lights at a white wall and overlap them venn-style.", "I feel like that was a more even tempered response than I deserved. :)", "so? this one did. doesnt make her an AH", "My fiancé is a much gentler person than me. He knows she makes fun of him but he brushes it off saying we need to be the bigger people. He also won't un-invite her from the wedding as it's rude. At most, demoted from bridesmaid to guest but that's if I'm at my last straw.\nReading all these comments makes me feel very conflicted.", "And even if you do see her around town, smile politely and move on with your day. You might be nervous the first time but it's going to get easier and easier every time as you remember the nonsense she tried to pull at *your* wedding.", "The bridesmaid in question.", "Hollywood waves is that style from the 30s with big soft waves rolling down long, loosely bound hair.", "Especially if they wear the wrong hairstyle.", "Sounds like a blast! I think people who know how to have fun in general, know how to throw parties. Dullest wedding I ever went to was a colleague of my boyfriend at the time. He's a lovely guy but a bit more corporate than me and these were accounting friends. The reception was in a huge hangar of a conference room, with a dull DJ and everyone else at the table was in dull black or dark coloured shift dresses, while I had on a hot pink, a-line embroidered bright number with a blue shawl. They were definitely not my people!", "It’s not a reasonable or typical expectation to put on people. So yes, being so far out of step with standard convention does make you an AH.", "The moment she made fun of your fiance, she should have been out of the wedding. Why are you trying to appease someone who is openly disrespectful to you and your relationship? It's not rude to uninvite somone who is making fun of the groom from the wedding, wtf.", "Ah. TIL, thanks. (So Nola probably could manage this 'by accident' if her bun came undone...)", "no, it does not. it just makes her different. calm your tits", "I have this thought when reading so many AITA's about weddings.  They're special but it's just a day and it's just a ceremony and a party.  It's not worth going crazy or ruining relationships over. (Although maybe it was worth weeding out this bridesmaid.)\n\nI went to a wedding once of a couple in their 60s, both with grown kids.  Their vows included promises to follow each others' end-of-life directives. No drama, no elaborate color schemes, just love and respect and joy.  One of the nicest weddings I've ever been to, even if it was missing the optimistic energy of thinking they were embarking on a journey that would last forever.", "25, going on 12!", "I’m a nearly a decade in, and I can promise young brides, even you will not remember or give a shit about your bridesmaids hair in the future.  Because it’s one damn day and your marriage is everyday, and that’s what really matters.", "Op, you're getting married. YOU NEED A SHINY SPINE OF STEEL to be a good wife/partner in life. It's imperative that you work toward this goal. Telling this jealous, attention-seeking frenemy - who is in NO WAY a genuine friend to you, that she is no longer a member of your bridal party or invited to your wedding, \"Period, no debate!\" - should be FIRST on your list, in strengthening your developing Spine O' Steel. ;) As should, ensuring that security is fully apprised of the situation, has a picture of her, and of course, will prevent her from stepping foot in your festivities. \n\nYou will be protecting your bridesmaids from enormous stress, working to protect you from all of her awful, selfish ploys. You'll protect your wedding party and new hubby from the same. And you'll protect yourself from her insane one-upmanship, ruining your sacred, happiest day, and potentially twisting everything so that when she has her meltdown, YOU are seen as the cruel, insensitive, selfish villainess of the scene. \n\nPlease. STAND UP FOR YOUR LOVED ONES. THEY DESERVE IT. STAND UP FIR YOURSELF. YOU DESERVE IT. Don't empower her to rob you of what's precious to you. Don't give it to her to destroy. Endure the fear of confrontation, and protect this sacred day for your HUSBAND, as he deserves it to be unmolested by her self-serving antics. Protect it's sanctity, beauty and happiness for YOURSELF!! YOU too deserve it. Protect it for all of your kith and kin who've worked hard and sacrificed in order to join you on this beloved day, BECAUSE THEY LOVE AND CHERISH YOU, AND WANT THE VERY BEST FOR YOUR WEDDING/MARRIAGE!! \n\nYOU'VE GOT THIS!! She's just a jealous hater, who wants to destroy the joy you have, because she is enraged that she doesn't have it herself. And if she is married, it means the marriage is a sham, it's horrific. Hence, she's that much more jealous. You needn't not shouldn't be mean when you do it. You just remain calm, firm, immutable, and keep it short. Hang up when you're done. The relationship is severed. That's it...!! BRAVA Darling, you've got this in the bag. 👜💓\n\nMay Your Wedding be Beyond Your Wildest Dreams, with Happiness Most of All!!\n\nGOD BLESS!!❤️", "Heyy my name’s Nola too haha funny. But yeah ugh that’s annoying. Honestly if you can’t say no to her give her the wrong details to the event with a new fake invitation and send that friendship out the window. This friend sounds like a villain in a Disney movie 🎥", "NTA it’s not like you’re asking her to cut her hair or change the colour. Just say if you aren’t willing to do this, it’s ok if you want to step down as a bridesmaid and if you do get your hair done like that you won’t be joining us down the aisle", "ESH. Your friend is obviously keen to be centre of attention but personally I feel that:\n\n1. Dictating how the bridesmaids can have their hair and make up when they are paying for it is rude. If you want them to have it a certain way then you should pay.\n\n2. Telling people what they’re allowed to wear to a bridal party so they fit the theme is a relatively thing that I’m really uncomfortable with. Being in a wedding party is expensive enough as it is!", "Honestly, I think a lot of these comments are forgetting something important - it's your day. Is some of this stuff trivial like pink not being apart or the rainbow? Sure. But this is the day that you and your partner want to be perfect. I'm sure there will be things outside of your control that will happen so you try to control what you can. Just because some of what she is doing is \"petty\" doesn't mean it isn't important to you and that is what matters. She is stressing you out unnecessarily which is the last thing you need when planning a wedding. I think you need to cut ties and full stop uninvite her from the wedding, no \"you can't be a bridesmaid but you can still come as a guest\" because if you do that she will come wearing white and her hair like yours - which is what you want to avoid. NTA", "NTA. Please fire this girl who is bullying you and negatively affecting every step of your planning and preparation. She is showing her colours now, don’t let her be there to upset and derail your day. I wouldn’t even let her attend the wedding based on this nonsense, but each to their own. \n\nSit her down with some support people and just say ‘ based on x,y and z you are not up to the requirements of participating in the bridal party. I’m politely requesting you step down’ if she reacts really poorly to that, follow up with, ‘your actions are showing that you bear no respect to this huge life event for me and my family, I will take this as your apology for not attending. There will be no place set for you’", "It’s time to cut her out. A simple “This day is about my husband and I and if you are not onboard to support me as part of the wedding party, than maybe it’s better for you to just support me as a guest where you will be free to dress and do your hair however you would like”", "NTA Nola is not getting married, you are. Either she get with the program or you boot her out.", "Stop wasting your time on people that don’t bring positivity or value to your life. Drop her as a friend and as a bridesmaid. NTA", "ESH.\n\nThis is not a conversation I would expect of women in their mid 20s.\n\nFirst off, fine about the aesthetic of hair on your wedding day, it's a small thing that she should really step in line with to make you happy. Without the additional context I'd have gone with N T A.\n\nSecondly, you made her a bridesmaid because of some vague \"promise\" made 3 years ago - that's not really a good reason, but we'll let it slide since you're a self-identifying people pleaser.\n\nThe final straw of this being an eyeroll situation is that you couldn't just let her wear pink to your rainbow bridal shower? REALLY? Because it's not prismatic canon?", "ESH. She’s being a real jerk about everything, but you are definitely an over demanding bride. They all have to have the same hairstyle for the wedding? That’s ridiculous- they are human beings, not accessories.  Same for the shower - who dictates what bridesmaids wear to a shower?", "ESH\n\nOf couse it's your wedding and should be your choice but I promise in 10 years you are not going to give a damn if all your bridesmaids hair didn't match or if someone's hair looked like yours or if someone wore pink to your bridal shower. The most important thing is you marying the person you love, not these little details.  She's rude to push you to be included as well and also for then bitching about every little thing. You clearly don't want her in your wedding, tell her to hit the rode and enjoy your day.\n\nSide note, these kind of posts are always a good reminder why I don't like weddings and why if I ever get married I'll just go to the JP and call it day.", "You lost me at \"hairstyle I picked for the bridesmaids\".  \n\nAnd you're also dictating what people wear to the shower?   \n\nI'll go ESH, because bridesmaid also complained about the dress.  Matching dresses is a reasonable request if you're paying for them, which you are.", "ESH. Your bridesmaid is crazy but I also don't understand the culture of telling people how to style their hair because they are in your wedding train. American Gen Z brides are weird", "Nta but she is gonna be when she finds out this isn’t her wedding on your wedding day. Kick her out before your day is ruined! Don’t have a photo album on the table you hate because it’s filled with photos of her because she stole the spot there too! My stepdaughter’s took the spotlight from my mother in law when she married their grandpa, now she is dying and we have only one wedding photo where the girls are not in it.", "NTA but please set boundaries with that bridesmaid. It's your wedding not her day and you don't need that drama at your wedding. I am an eternal people pleaser and I also hate saying no but sometimes you have to be strong. Maybe tell her something like:  \"I appreciate that you don't like certain colours and hair styles but please understand that it's my partners and my day not yours\" She is not being a good friend to you and is trying to make herself the centre of attention. Also what do the other bridesmaids think? Do they have your back on this?", "Disinvite her from your wedding and life, she's not a friend anyway. NTA.", "ESH -  I don’t understand the trend of trying to make your bridesmaids props in your wedding or accessories to your party.  They are there to celebrate with you and support you emotionally, not to be decorations.  She may be pushing on you for things but you are an AH for trying to control everyone.   Relax and enjoy this time in your life.  No one is going to remember what people looked like or who was in your wedding, except you.  All these details you’re stressing over don’t matter.", "I’m happy to tell her no for you. I’m an jack ass for hire", "NTA Id let the pink dress go, pink may not be strict rainbow but will be choosing the shade of green? Do you see my point? If you have trouble saying no or cutting her, tell her half up half down as a compromise?", "NTA but the rainbow tidbit does make you seem like a raging asshole who has left a whole lot out of this story. Having something rainbow themed then not allowing someone to wear pink is insane idc if it’s not a technical rainbow color like please get a grip on reality", "This actually happened to my husband’s daughter. One of the bridesmaids showed up to the wedding dressed totally different than the other people in the wedding party. In fact she was dressed in black. I don’t know why people that have been asked to be in a wedding don’t understand it is an honor to be asked and the decisions are made by the Bride and Groom.", "Definitely, boot her now. She will show up at the wedding & try to steal the spotlight. Why would she think it was even remotely ok to wear white to the bridal shower & plan to have her hair match yours for the wedding? No way.", "NTA for the hair thing but is it standard to dictate outfits for bridal showers? I would have pushed back on that too.", "You have worded this beautifully. I might just copy paste it with a few tweaks. Thank you!", "She's said she's not nice to her fiance I'm not sure why that isn't the main focus..", "Ding, ding, ding! \nI get that MOH is being fussy but good lord this insane control of brides these days is outrageous. Why? Like really why would you want to implement so many insane rules. Chili out bride, stop trying to make some perfect picture its crazy and no one will give a shit years down the road. Not even you.", "Thank goodness someone said what I was thinking! Brides shouldn’t dictate what color you wear to a shower (obv others should stay away from white!) And I had my bridesmaids wear their hair however they wanted so they could feel beautiful! I don’t like the idea that brides think their bridesmaids shouldn’t look their best on their day so they can stand out. You’re the bride, you are already gonna stand out!", "Yeah I was sort of with the bride until she was against her friend wearing pink to her shower. That’s… weird.", "I agree. People have different hair types and I don't think you can across the board decide a hair style for them. I had a bridesmaid with silky smooth thin hair, and a bridesmaid with super thick and kinky hair. One of them would have looked ugly if I chose one hairstyle. My sister did that to us and my and my other sisters hair couldn't hold that style and it looked like garbage by the time we were taking photos. I know the bride was unhappy with the way it looked when she got the photos back. \n\nI wasn't even willing to require my bridesmaids have their hair professionally done, because I couldn't guarantee the stylists I hired could properly care for the kinky hair. Those ladies know what their hair needs and what it can do, they could make their own decisions. These are adults, after all. \n\nAnd I agree with the shower clothing too. You don't dictate what your guests wear to your shower, outside of formality level. \n\nI would vote NTA here though, because of the rest of the circumstances surrounding this.", "What does PITA stand for?", "My SIL did this. She had picked out a style she wanted for all of them (some sort of side bun/braid combo). One bridesmaid had her hair done in the exact style but on the left side instead of the right side, and SIL lost her mind. She wanted it to be redone but there wasn't enough time. \n\nShe ended up excluding the BM from several photos and cut off the friendship afterwards.", "I’m with you.\n\nNola 100% is a button pusher, but also OP is waaayyyy too focused on the “look” of this whole thing (and not just the wedding itself but events where you typically don’t get that much authority over the wedding party like the shower).", "Thank you so much, I honestly nearly cried at this response. I'm building up that courage thanks to these comments.", "I'm sorry to use your name,you sound like a nice person, it's just the first name that popped in my head!", "This \"friend\" sounds like a stalker in a horror movie, lol. 😬", "She wanted to wear a pale pink, yes. It honestly didn't strike me until you mentioned this comment that it is very close to white... I only said no as it was not VIBGYOR colours and honestly didn't realise she was wanting to wear a colour similar to mine!!", "Actually she wanted pink, she talked about white only after that. The bride proposed green, a total different color from pink. They are both playing games here.", "She pulled me up on a drunken promise made 3 years ago when I said I'd make her my bridesmaid. I'd be more than happy if she pulled out or declined!", "I said it like that to keep it simple on Reddit apparently many have misunderstood though. I messaged them the exact colours so they knew what to wear.", "Thank you for your feedback. I feel like everyone's caught up on the updo thing so I'll share the photo of the [hairstyle](https://images.app.goo.gl/8CqsgFkxq5dtodeY9) with you. I think it looks great :) but everyone is entitled to their own opinion! I honestly would be fine if she picked any hairstyle except the one that I'm wearing 😅 but from reading the comments I guess my problem with her runs deeper than just the hairstyle and I need to work up my courage to have a frank conversation with her.", "Thank you!", "Thank you, I am trying to build up the courage to. I'm telling myself if she disagrees to anything else or comments on my appearance one more time I will tell her I'm reconsidering our friendship and maybe it's best if she not attend.", "I guess I'm not describing it very well. The \"messy bun\" look is the kind of look brides usually wear where the hair is neat but pulled a bit like a loose braid and there's some loose strands in the front. I've told my bridesmaids they are welcome to wear it. I would say the opposite of that is a very neat bun which I think would not be very flattering on any of them. Messy bun would be [like this](https://images.app.goo.gl/8CqsgFkxq5dtodeY9)", "Thank you!", "It is unreasonable to tell people what to wear to your bridal shower.", "It was a majority vote by the remaining bridesmaids. I let them pick from a bunch of styles and my closest friend and bridesmaid got to decide whether they all wear the same style or each can do their own. She decided uniformity would look good.", "That's exactly where we ended up! Half up half down. I agreed to that. But I've told myself anymore disagreements and I'll be firm with her that I'm doing things my way, and she is welcome to sit as a guest if it's getting difficult for her to agree to my requests", "I wouldn't consider [this hairstyle](https://images.app.goo.gl/8CqsgFkxq5dtodeY9) \"dowdy\" but to each their own.", "A messy bun is not dowdy - you need to wind your arse in.", "I guess it's a lot more common in my culture. I've been a bridesmaid at 2 weddings and the bride told us what hairstyle she's like us to wear. Anyway I gave my bridesmaids a choice of hairdos and a majority chose messy bun hence why we came to that conclusion.", "Its a thing, not my personal thing but yeah, I've seen brides in the US, movies, tv, even on reddit do this.  Its not a thing to want the same hairstyle as the bride or try to dictate someone else's wedding....unless you're suffering from main character syndrome.  OP's allowing them to wear whatever dress they want in whatever color they want as long as its rainbow.", "Spilt wine is a rainbow colour isn’t it?", "Why would she go to the extent just because she doesn't like that OP is being her party for her hair to be put in an ugly style that's inappropriate for a formal occasion?\n\nWhy is OP so wildly insecure that this would be a problem in the first place?", "I find it weird that she gave that specific of a dress code just for the shower.  I literally didn't care.  I chose the dress and that was it.  The bridesmaids chose everything else on their own.", "In my experience, bridal showers are actually surprise parties that bridesmaids coordinate like \"hey bride let's hang out\" then when bride comes out \"surprise!\" We (bridesmaids and other friends) get to choose the games (the prizes), food, or if we have a theme and the bride would be happy since everyone placed an effort into making it wonderful. There was a time when our party was like a nail and spa party so that the bride will be pampered (it was practical too so she doesnt need to worry about her nails).", "That would be a lovely explanation for bridesmaid colours but it’s a little over the top for a bridal shower.\n\n(Although I honestly would assume it was a gay wedding with no context.)\n\nAlso, primary colours are kinda tricky for most people to pull off (mustard yellow > yellow, maroon > red). There should be a bit of leeway for choosing a shade of a colour that works on a person. Keep in mind the rainbow from light is the entire visible spectrum of light.", "I’m really sorry to say this but your insufferable and you aren’t going to have a fun time micromanaging everything like that. You need to chill out.", "Honestly, the sheer self-absorption of having the people who you're supposed to be close to wear certain prescribed colours to your bridal shower to imply that their combined existence produced \"the person you are\" is just . . . wow. \n\nThere's a vast chasm of difference between showing *appreciation* for how people have positively influenced your life, and literally dressing other human beings up like Barbie dolls to show (in a remarkably dehumanising way) that who they are somehow . . . *culminates in you*. Honestly, I'm not even sure there's a term for that degree of arrogant self-centredness, but if there is, it's not a compliment.", "It’s a bridal shower. It’s not that serious.", "Setting a quite loose theme for a shower is normal (e.g. black and white, floral, colourful), but any limitations beyond that is too controlling, so for that portion of your story, that was 100% your bad (despite the sentiment). \n\nEverything else is the bridesmaid being an AH though.", "Pain in the ass", "Your SIL's ex friend is lucky to not have to deal with her anymore.", "Not gonna lie, if someone asked me the colours of the rainbow I'd 100% sing that song to try and remember them...", "There's infinite colors of the rainbow. Everything between those colors is also in the rainbow.", "Normal buns? Messy braids? Side buns? Double buns? Most women know how to put their hair up in a way that looks good on them without the exact style being dictated.\n\nMajority vote still often leaves that one person with a shit hairstyle. Not everyone can pull off a messy bun. For me a bun is still not a great hairstyle, messy would make me look like an ugly slob rather than cute.", "Reading that i was like why green? Purple or red is close to pink at least. Green is literally the furthest from pink in the color wheel. While the bridesmaid is being an asshole by imposing her presence when she clearly isn’t welcomed. the bride is being a bit difficult here. All the colours of the rainbow could easily be interpreted as any colour instead of the literal colours of the rainbow.", "Oo that's pretty!", "Dude, she's not your friend.  She's trying to dictate your wedding so SHE stands out.  I wouldn't be surprised if she creates drama at your wedding.   Also, beware the flying monkeys....they might even be bridesmaids...\n\nEdit:  YTA for letting her get away with ridiculing your FI thought.  She's doing that and allowed to be in the wedding with no consequence?  Being the \"bigger person\" doesn't mean be better, it means be a doormat and don't make a fuss so the badly behaved person never gets held accountable.  They bring the drama needlessly & deliberately....good luck trying to avoid it.", "Exactly, to each their own.  This is YOUR wedding....trolls can go kick rocks!", "This comment makes YTA even more tbh (see my other comment to you). If it’s only the 5 of you and these are supposedly your closest friends, why the literal F do you care what they wear? I read your explanation and I think it’s the silliest thing I’ve ever heard. For some perspective, if one of my best friends told me I was only invited if I wore rainbow colors for some cheesy symbolic reason when it wasn’t even a big event I would literally say no. Especially if I didn’t own anything in those colors. Many people only have white, black, brown and neutral tone wordrobes!", "Kind of makes it worse tbh. Call it a bridal luncheon and let people be adults and choose their own attire. If this is the attitude you’ve taken the whole time it adds to the annoyance of being told you can only wear a messy bun.", "I’d literally laugh out loud and decline if I was told I had to wear a certain colour to hang out with the bridal party.", "Some people don't just want to cause a scene, they want to cause a whole damn play.", "Thank fuck someone said it! I was panicking a little - pink is in the bloody song! \n\nNola is trouble though, she needs out of the wedding. OP will hopefully one day learn to say \"no\".", "Right, it really seems like OP just doesn’t want this woman to be a bridesmaid and is trying to manufacture conflict in order to “fire” her.", "Plus she says she’s paying for everything, then immediately says she’s not paying for hair/makeup. So what does “everything” mean? If it doesn’t include dresses for this shower, it’s extra tacky to force them to buy a dress anyway.", "Yes at a hen party there's usually a theme. So yes to be told that then it's usually done", "I'm English. These weird customs aren't ours.", "Ok, I'm totally with you on not forcing people to have their hair styled in one specific way, especially when they're paying for the service themselves. \n\nBut wtf is 'inappropriate' about a messy bun hairstyle? You're allowed to not like that personally, but calling it 'ugly and inappropriate' is a bit of an AH move on your part, u/WalkOffTriple", "No, the refraction creates 9 separate spectrums but two are invisible to the human eye (infrared and ultraviolet). However there is a phenomenon called spectral smearing between the colors due to the multitude of exit angles of the light in naturally occurring rainbows but it's still only 7 visible colors. Due to the smearing you can see shades between two colors that are next to each other, but in a true prism you can't see that. Regardless, in naturally occurring rainbows it's impossible to see colors that are a mixture of two colors of the rainbow that aren't next to each other. ie purple, magenta, hot pink, gold, etc", "Thank you ❤️", "Totally agree, NTA  though not letting her have pink at the bridal shower is a little petty... rainbow colours to some people is just all colours. But the hair and bridesmaid dress issue is enough to ask her not to be a bridesmaid and also just ask her not to attend. If she attends as a guest but not a bridesmaid she'll show up in a wedding gown for sure.", "Weddings really turn out the pathetic.", "I agree, first off let it be clear that Nola is a asshat who isn't worth the hassle and sounds like she does have an ulterior motive.\n\nI have never and will never be comfortable deciding what people wear, how they're going to do their hair etc, grown women know what compliments them and what doesn't in regards to hairstyles, clothes and makeup, I'm not going to decide that for them, people do put way to much pressure on weddings but on their guests to, I always wonder why it's not enough that people turn up to take time celebrating your happiness for the day, the main point of weddings being the vows you make has sort of took a massive back seat. A lot of brides don't even consider their own husbands and just make the entire day about them and their demands, I don't get it.\n\nAnyway not the asshole to OP I think on this occasion It may be a safe bet to remove her from your wedding party if she's going to cause trouble and more of a headache.", "And then the \"happy couple\" gets divorced a year later. It seems like people want a wedding, not a marriage.", "A dry cleaning bill or an assault charge if it seems obvious that it was done on purpose, given that \"tripping and spilling red wine on someone's dress at a wedding\" is an absolute cultural trope, and no one is actually going to believe that it was an accident. \n\nThat whole concept is so ridiculously childish, honestly I'd be embarrassed to be the person suggesting it, much less doing it.", ">I wonder why green and blue are switched…\n\nEverything is upside down in Australia.", "What? All colors are made from red, YELLOW, and blue. I think color theory of dyes is more relevant to clothes than the color theory of light and ophthalmology. I doubt her intent was to create white. I think she just wanted a theme, likes rainbows, and wanted to give her friends a choice.\n\nEdit: read further down, I was wrong. She is thinking light color theory. My bad", "Same in Ireland. Have been to a number of hen parties where there has been a colour theme. It’s fairly common here.", "I don’t think I’d say *repellant*.  It feels to me like OP tried to pay a compliment to her bridesmaids as being dear friends who each have contributed to her life in important ways.\n\nHowever, the wording definitely does come out as self-centered, and I’m in the camp that the bridesmaids should be able to choose their own clothing (within reasonable limits!) for the shower, rehearsal, etc.  The bridesmaids are their own persons.  They are loved and valued by the bride for themselves, and not simply because of what they’ve contributed to the bride’s life.", "I agree. Is the groom doing the same thing? I’d guess not. When did brides becomes so egotistical?", "[deleted]", "Telling someone you get to choose what they wear to a party whose only purpose is for people to bring you gifts is a bit much.\n\nIt sounds like you’re describing a bachelorette party, which (like the bridal shower) is not supposed to be planned by the bride. Bridesmaids choosing to dress to a theme at a party they planned and budgeted for is a bit different than the bride demanding approval over shower outfits.", "Grow a spine, OP. This woman makes fun of your fiance and she's pushing your boundaries. She is not a friend, she is intentionally causing drama for you. If you keep her in your wedding party you have no one to blame but yourself when she shows up with her wavy hair down in a wedding dress and ruins your day.\n\nYTA to yourself, because you deserve better.", "> the refraction creates 9 separate spectrums\n\nThat depends entirely on what light is passing through the water vapor, but for sunlight in the atmosphere, it generally contains all spectrums of visible light. Because raindrops are round, it's not a pure spectrum, but it still contains pretty much infinite spectrums of light mixing into an infinite number of non-spectral colors.", "Plus, the hairstyle - it’s not that she wants a different hairstyle but she wants the SAME one as the bride.  She could’ve asked for braids or a different style bun or anything else but she asked for the same exact style on the wedding day while trying to wear white to the bridal party.  I imagine she will show up in white to the wedding, it seems she’s trying to make it her day", "You are lucky.  You found friends and were born into a family you love.   A lot of people do not really get that \"perfect family.\"  Alcohol as sad as it sounds is what brings most people together for superbowls, christmas's, weddings, new years, etc.  Take alcohol away from all those events, every sports arena and out of weddings and you will see who really celebrates the love of christmas, new years, sports, marriage etc", "Sooo true haha", "Its a gamble on the DJ and you got a good one.  Trust me the DJs I saw made me cringe.  The  duck duck song is like this ritual for sheeple.", ">A dry cleaning bill or an assault charge\n\nI had thought about adding the assault charges but I wasn't sure if that could be a scenario. \n\nBut I would absolutely imagine someone doing that. \nIf you are showing up at weddings in white dress or as some MIL's do, a full wedding dress. Then you are someone who would put charges on a person, too, with a high \n\nIn general, it's just.... don't do it.\nThe venue alone.\nSome of those fancy ones I can't imagine a chair or something is cheap.\nThey would want compensation as well. Guess that could be a big bill or a trip to court as well if you don't want to pay up.", "And to remember: Richard of York gave battle in vain!", "Upvoted for your edit which meant I didn’t have to go find OP’s comment 😉\n\nI love how people are actually generally pretty responsible on Reddit!", "I understand your sentiment and I think it's very beautiful. But please think about the reality and practicality of what you are asking people. They are already going out of their way to join you in all your celebrations. If you want them to wear certain dresses or a particular hairstyle, you need to pay for it.", "OP, I've done some reading on bridal showers and found that themed and dress-coordinated events aren't unusual these days, so I apologize for my strident criticism.  I got a little carried away and it wasn't nice. \n\nI should do a whole AITA on how I picked out a tux with a vest and tie that matched none of the wedding colors -- on the morning of our wedding.", "She offered to do it.", "Most people?  Most people have loved ones, wtf are you on.", "I honestly didn't think it was a big ask. But I will offer to pay for the dresses for the shower. The hairstyle was picked by a majority bridesmaid vote not me, anyway I did have a chat with her and she will do a half up half down hairstyle. So she won't match me, but she also won't match any of the bridesmaids but I'm going to ignore that :)", "She needs to be completely uninvited. She made fun of your fiance. She is trying to BE YOU at your wedding by emulating your style. She is actively trying to upstage you at EVERY turn. Simply demoting her will end up with her walking into your wedding in a white dress with Hollywood waves. I know it. You know it. \n\nRip the band-aid off.", ">we need to be the bigger people.\n\nSacrificing your own happiness and comfortability to placate someone else is not being the bigger person. Being the bigger person means taking the high road, staying mature, but also putting up boundaries and sticking to them. You aren't putting up any boundaries and you're letting someone else take advantage of you and manipulate you, that's not being a bigger person.\n\nWhat you need to do is remove her from your wedding and be honest with her. \"Nola, you are constantly stirring up problems with every little detail regarding my wedding, on top of that, you are constantly making my wedding about yourself. This is incredibly disrespectful to me and it's the reason I no longer want you as a bridesmaid, and to be honest, at this point I'm not even sure I want you there as a guest. Please pack your things, you are no longer my bridesmaid, and we'll see how things go from here to see if I still want to invite you to the wedding.\" That's it, leave it at that. (You could also do this over text, and leave out the 'pack your things remark.)'\n\nIf she says 'BuT yOu PrOmIsEd' then you say \"that's another thing, it's incredibly disrespectful and manipulative to hold some promise made years ago while drunk, while circumstances and our relationship were different, over my head as a means to get what you want from me, especially since you don't even care about my wants or needs in the matter and don't consider me or my feelings at all. This is not something an actual friend would do to another friend, and it makes me feel like you don't really care about me at all, you seem to only care about being a bridesmaid.\" If she tries to argue, cut her off, stating that it's not up for discussion and you need her to leave, and leave you alone for now.\n\nThát's being the bigger person, communicating your boundary, enforcing it, and not arguing back or making backhanded comments back to someone who throws them at you. Please stand up for yourself.", "Op you need to get rid of this girl as your bridesmaid. She is gonna turn up in white, or will make the day about her. \n\nHonestly YWBTA if you don’t get rid of her. Doesn’t matter how small your town is, when she makes trouble you are going to look back at your wedding and think of her. Not about how lovely it was. Not how much love you and your husband will have, you will think of her. Don’t give her that power. Remove and univite. Get your mum, other bridesmaids or MIL to uninvite. Politeness and social etiquette went out of the window the minute she started to make demands.", "Huh and yet NONE of this was included in the OP", "This is not a case where you have to be the “Bigger person” because nothing about this day is about her, but you and only you and right now she’s stressing you out beforehand, what will she do in the actual day??", "Why'd this get a bunch of downvotes?  Seems like a totally reasonable and fair resolution, and explanation.  I guess people really want Nola out of there?", "I’m glad you came to something you feel good about.\n\nRegardless - you already had one bridesmaid who wouldn’t match, correct? So now you will have three with hair up, and two with unique styles, and as someone whose been married a decade I promise *none of your guests are going to notice or care if one or some or all of your bridesmaids had different hair, nor will you starting the day after your wedding*.\n\nBecause it’s not important. What will be important, and what you and all your guests will enjoy and remember, is how much you and your finance love each other, how fun it was to see everyone, how fun of a day it was. Because that is the whole point.\n\nIf Nola does try to “steal the show” and act out, if anyone notices it will be only to cringe at how obnoxious and embarrassing she’s being. It will reflect poorly only on her, not your or your fiancé.\n\nIf you don’t want her there, in the wedding or at all, because she’s not actually someone you care about or feel is part of your chosen tribe, great cut her.  But I promise you she cannot “steal” your day. No one is going to get confused about who the bride is that day and who they are all there for.\n\nYou will not be sitting here, 5, 10, 20 years from now stewing on what your bridesmaids did or did not do with their hair.", "Probably not. It involves loosely curling hair in a fairly precise, uniform and neat way, rather than a \"beach waves\" look. \n\nAnd her hair would have to be wavy in that way already for her bun to lead to that look. I have wavy hair but wouldnt get that poom unless I was specifically trying to style that look.", "No.  These aren't natural waves and require product to keep them in place.  Making hollywood waves and then putting them in a bun will mess up the waves.  It's also hard to make them fall out naturally which means either people will see her taking the bun out or she will have to seclude herself to make that happen.  Either way she comes off as weird and rude.", "Google search on Veronica Lake.  Those are Hollywood waves.", "Personally, I'm getting fed up with all these bride posts and their \"it's my special day and I want everyone looking at *me* so no one please look prettier than I do or anything like me\"\n\nI'll take my down votes like a man now.", "I think you’re being ridiculous about her hairstyle and a dress color. You’re the bride and a friend, not a queen. She’s a bridesmaid, not your fashion slave. Stop being so controlling. Rainbow colored, really. Eyeroll.", "Anyone that opts to wear white to a wedding who isn't the bride is an AH, period, end of line.\n\nOn the other hand it's just hair, why is that such a big deal to you? I guarantee that the only person who will notice she has a similar hairstyle is you.\n\nFor a lot of people \"any colour of the rainbow\" pretty much means any colour other than black or white. You should be more clear with precisely what you mean.\n\nNola sounds like a pain, sorry. If she can't be bothered to fit in with the wedding party then she has the option to opt out. Them's the bricks when you say yes to being part of someone else's event.\n\nNTA", "You will be TA if you don’t kick her to the curb, immediately. This woman is going to cause drama", "Your day, your rules. End of. No you are not the A", "I actually can’t imagine forcing my way in to being someone’s bridesmaid…why would you even want to if the bride didn’t specifically want you there?! And not only that, but to make a fuss about what you’re wearing too??? OP has every right to just kick her out, the friend should just be grateful she gets to be in the wedding at all", "This!\n\nPlease tell her if she can't do what all the other bridesmaids are doing happily then she doesn't need to be in the wedding at all \n\nI would also tell her that if she shows up on the wedding day in white or pink and has her hair in anything but a messy bun then she is out and will be asked to leave the wedding \n\nThis is your day and it's clear she is at the very least trying to take away from that!", "Why do the bridesmaids need to have messy buns? Did they all like that hairstyle idea? Why do they all even need to be the same? Agree in general that it might be odd to have ONE bridesmaid with hair matching the bride’s, while the remaining bridesmaids get the just-woke-up look. \n\nWho gives a crap what color the bridesmaids wear to the shower? Just dress to match the occasion—so probably wear something nice. \n\nAlso, not sure why all the bridesmaids were not allowed to weigh in on the dress, or did Nola originally say she liked it and then wanted a different one? \n\nESH. She doesn’t seem like a person you actually want in your wedding, so you shouldn’t have asked her to be a bridesmaid in the first place. The only time that’s appropriate is if your spouse to be and you both agree to include siblings or something. Don’t ask everyone you know. Especially based on a promise from 3 years ago. \n\nShe seems like a pain but you also seem too controlling. To avoid becoming a bridezilla I would recommend taking a step back and also making sure your bridesmaids actually ARE ok with your dress and hair choices. Maybe they are scared to disappoint you?", "You're right, I missed it in my first read. Probably because it was so ridiculous my brain rejected it.", "You're right. My brain rejected it during the initial read because it was so ridiculous to try to control outfits for a shower", "I just reread the post and it was outfits for the bridal shower. People are getting ridiculous with weddings!", "I agree. I can’t imagine making rules for a bridal shower. \n\nAs for the wedding, I cannot for the life of me comprehend why bridesmaids care about what they wear, hair or makeup. As long as you’re not obviously hideous, who gives a shit. It’s not your day. \n\nI’ve been in so many weddings. Not once have I ever complained about the brides choices. I don’t care. I’m there to support her. I want the day over as quickly as possible with the least amount of problems as possible. Why anyone would want to create issues during an already very stressful day is beyond me. \n\nSeriously reconsider this “friendship” OP.", "I reread the post and it was outfits for the bridal shower! Wow, people are getting ridiculous with weddings", "It’s the standard for the bride to decide the colour scheme and aesthetic of the bridesmaids outfits", "In America at least hens night isn't the same thing as the bridal shower.  Bridal shower is when friends/family comes together to give the bride gifts at a part, the bachelorette party is the hens night equivalent.", "Everyone telling you you're being controlling are the ones actually expecting too much in their expectations of a low-key/chill bride, imo. \n\nYou're not dictating every last detail, and you PAID for their dresses. I've been a bridesmaid five times and no one paid for my dress. I wouldn't bat an eye if someone sent me a photo and said \"do your hair like this\", even though I don't think I've ever had a hairstyle dictated before. I have had the color of shoes/jewelry dictated though.\n\nAnd it's NOT too much to just ask people to wear a certain color. They're your bridesmaids, not just random guests. You have a theme for the shower. It's the same as if you asked everyone to wear a special T-shirt to the bachelorette. These are more requests than the most loosey goosey bridesmaids situations I've been in, but kinda on par with the average ones. \n\nI also immediately thought ROYGBIV with rainbow colors but I'm gay and I guess we take our rainbows seriously 🤣\n\nAnyway, NTA, you're making pretty basic requests and this girl is saying no to all of them, she's not a team player and doesn't deserve to be your bridesmaid.", "Yeah, whereas OP said \"I'd be fine with any hairstyle, as long as it's not the one hairstyle I'm wearing at my wedding\". This \"friend\" is insisting to wear the same hairstyle as the bride for her wedding, that's not the same as a demanding bride.\n\nEta: to add what OP said in another comment: \"The bridesmaids picked, not me, we went with majority vote\"", "Your SIL is a jerk. My hair absolutely won’t part the other dude ton because of cowlicks, if someone forced me to make it go the opposite direction, it would look utterly rediculous. Imagine cutting off a friendship because of the wrong direction of hair…", "French twist? Curly up-do? Puffy braids? \n\nMessy bun screams low-effort. It will not look elegant at all. Is that what you want?", "Great idea, so you will gain a scene and a cleaning bill at your wedding 😒", "For the wedding yes, but for a shower? Maybe my friends are just low maintenance.", "Not just remove her from the bridal party. She needs to be Completely disinvited. She's going to show up dressed in white with her hair done up like OP's. \nBetter have some security on hand.\nNTA", "I’m stealing this!  It’s a fabulous line", "Yeah it comes down to friend groups I’ve had friends who’ve wanted everything to look how they wanted so it’s not uncommon and normally it isn’t that much of an issue", "> All colours are made up from those three - you must have learned that in your physics classes?\n\nSpeaking of physics class, fwiw, color theory is not actually how rainbows work.  The sun is emitting full spectrum white light, which gets separated into the spread out \"rainbow\" by rain droplets.  All those other colors are actually there, it's not just combinations of RGB.", "This! She'll definitely show up looking for trouble... in white. NTA.", "Huh. Yeah, in my circles, asking your friend to buy a different brightly-colored dress because pink isn’t rainbowy enough would be considered pretty entitled for anything but the main event. But responding with “fine then I’ll wear white” makes it clear who the asshole is here!", "I think it was a culture thing. As a Brit, American weddings sicken me. Unfortunately, all the worst parts are becoming common here, too. The sheer waste of it all, the audacity of the bridezillas, the meddling mothers, the expense the guests have to go to. I'd be horrified to be invited to one. \n\nCan't wait to elope by ourselves!", "Are you suggesting that someone needs to have red wine available?", "With all due respect, the comments aren't excusing her - they're telling you to look at yourself too.", ">Your other bridesmaids are affected by this. You’re affected by this. Your groom is affected and everyone at your wedding will be too.\n\nAt this rate, this conflict is going to be one of her core wedding memories, forever. Is that what she wants?", "Because she knows you're too pathetic to stand up for yourself & your fiance and kick the girl out. She did it out of pity, not because she wants to spend her day doing that.", "Glad you were able to make things work. Congratulations on your wedding! It will be over so quick, I cannot stress enough to you that this is just one day of the rest of your beautiful lives together. Don't sweat the small stuff!"]}