{"id": 34360, "submission_id": "18yszr0", "title": "WIBTA for kicking my (30F) husband's (31M) fire station off of my netflix account?", "selftext": "I've had this Netflix account since before meeting my husband. It's tied to my email and of course my password. I login today to see that he added his fire station to our account without asking me for communal use. He is new to this station, so there are plenty of other men there that could have done this before if they wanted to. I've asked him several times before to not give my accounts to anyone. Our money is shared so technically we both pay for this account (we both work), but because of the information tied to it, I consider it mine. I started to text him about it and he promptly ignored me when he realized my \"tone\". I would like to kick the station off since it's likely they all have their own accounts anyways. He thinks I'm overreacting. AITA?", "created_utc": 1704414790, "permalink": "/r/AmItheAsshole/comments/18yszr0/wibta_for_kicking_my_30f_husbands_31m_fire/", "score": 257, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am going to kick the fire station off of my Netflix that my husband gave without asking me.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  You can't even watch a movie without the whole fire station knowing that you watched it?  These aren't college kids, the station can afford a netflix subscription.  If you want to get your husband back, go ahead and watch a bunch of \"Magic Mike\" type movies, or woman leaves man because he is a jerk movie and leave those in your previously viewed file for the firehouse to see.", "Change your login data now.", "My husband is a firefighter. The station has YoutubeTv with NFL Sunday ticket. But for other streaming services it's personal, so one guy provides HBO, one Netflix, another Disney etc. They don't share passwords, they just don't logout.", "NTA- and you have a bigger problem than Netflix and your password.\n\nHe didn't respect your reasonable requests in the past and now he's ignoring you and claiming you're overreacting.", "NTA they can get their own account if they want it at their station. Log out everyone & change passwords.", "NTA considering Netflix just made a bunch of rules about account sharing", "[removed]", "NTA. It's a group of paid professionals. Surely they could scrape together the cost of a membership for the department. I'm assuming he just logged in and didn't give your password to everyone, but I would buy an account for them and call it done. Also they're gonna fuck up your recommendations. That's the most unacceptable part of it all", "NTA. You've asked him to not share the account, and he went and did so anyway, without consulting you. You'd be perfectly justified to chop that shared account off without consulting him. Then you can be the one ignoring him because of his \"tone\".\n\nObviously, this needs more discussion, but first you need to get his attention.", "Wow OP I guess you just want EvErYoNe tO cAtCh FiRe AnD DiE because you HATE Firemen.\n\nJk NTA- he should have asked.\nI’m actually REALLY surprised they didn’t already have a Netflix setup? Usually the department will cover it or the boys will all contribute for one.\n\nDon’t get suckered into that, OR if he wants to go that route- Hubby is now paying for a Netflix. He is new so I get he wants to make a gesture of goodwill but that’s his torch to carry- not wifeys.\n\nAlso after hubby takes over go on their faction of the account and F with it to only suggest shows like Bridgerton and Gilmore Girls, ect.\n\n(Plot-twist: They get hooked on GilmoreGirls)", "NTA. Kick the fire station. Hubby wants an account with his friends, he can attach his own personal information to it.", "NTA. This is a simple communication thing and your husband failed on all counts.", "NTA change the passwords on everything using your information and kick all devices off; even his. If he can’t respect your information, he can pay for his own accounts.", "You should rephrase that title: \"WIBTA if I expected a group of employed adults to chip in about 75 cents a month so they can watch movies, and expect my husband, a grown ass adult, to not get pouty when I do?\"\n\nYou're NTA. Husband is.", "Netflix no longer allows you to share outside the household - it simply won’t work on a smart tv, fire stick, etc. connected to a different wifi address (only phones for traveling). I can no longer bring my fire stick to utilize Netflix when traveling without paying the add-on fee…", "Yta.. let him enjoy the Netflix at work.. it affects you in no way", "NTA", "I would change the password to my account.", "If you both pay for it, can’t it be considered both of yours? I think he should have a right to the account if he is also paying for it. I agree with the point they most likely have Netflix accounts, but them knowing what you watch isn’t the end of the world. NTA ig", "ESH\n\nYou for claiming sole ownership even though he pays half, and him for not running adding the hall (or anyone) past you on a shared account\n\nIf the privacy is your biggest concern, I'd recommend creating a joint email account you can use for couple or shared things", "YTA - I don’t know why it matters BUT why not just talk to him about it instead of sending a bunch of texts? \n\nI think it’s weird to not have it up there, but def YTA for communication skills", "Just put the account in his name. Problem solved. No one actually cares about what you watch on your account.", "YTA. Your making a huge deal out of nothing. That's your husband. Is this really the hill you want to die on?", "YTA. If you're BOTH paying into the account, number ts just as much his account as it is yours", "Dude....they're firemen!  They save lives for a living!  The least you could do is let them watch \"Squid Game\".", "I don’t see the big deal why not just let them use it", "What else does he share with them....", "What is the harm in it?", "mmmmhhhmm, yeah, YTA", "Don’t make your husband’s life harder than it has to be! He’s probably already getting shit for being the new guy anyways.", "Idk for me the whole \"it's my account\" thing is a red flag. If y'all were just dating then sure, but he's your husband, as a man who helps provide and considers everything in a relationship 50/50 this would irritate me\nI'd say you would be the asshole", "[deleted]", "Your husband wants to use the account at work, but needs to ask permission?  Is this a joke?", "ESH. You consider it a shared account that he pays for half of… but actually you consider it yours? And the two of you are fighting this much over a Netflix account? You really can’t figure out a way to share like the lowest value, most trivial thing in your marriage?", "[deleted]", "YTA- the poor guy can’t watch his own Netflix at work . Make that make sense. YTA", "NTA\n\nOMG are those people so cheap? They can afford a Netflix subscription. It's like one dollar each .", "YTA we shared accounts all the time when I was on my LE shift for the Navy. Yeah my wife and I paid for it but also one of the team shared their streaming acct as well. Don’t be so controlling OP. These guys will literally run into a fire to save people. Give them some grace", "Not the asshole, but nobody is really, just consider that every day with him might be your last. Does Netflix password sharing really matter? Ask him to create a new user on your account for the station. Put a password on your user like parental controls. I don’t know. This seems trivial to me", "What is it hurting? Your privacy, ego...? How??? Why?? Are you really this narcissistic/controlling?", "Fire fighters are cheaters…..end of story.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI've had this Netflix account since before meeting my husband. It's tied to my email and of course my password. I login today to see that he added his fire station to our account without asking me for communal use. He is new to this station, so there are plenty of other men there that could have done this before if they wanted to. I've asked him several times before to not give my accounts to anyone. Our money is shared so technically we both pay for this account (we both work), but because of the information tied to it, I consider it mine. I started to text him about it and he promptly ignored me when he realized my \"tone\". I would like to kick the station off since it's likely they all have their own accounts anyways. He thinks I'm overreacting. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, it’s not about money but it’s not cool he gave your email address and his reactions make it worse . Dump his ass", "NTA. I'm surprised Netflix has allowed it considering their crackdown on password sharing. It's none of his station's business. If he wants to watch it himself, he could put it on a tablet or laptop .  It's not for them to use. They could technically access and change all/any info.", "Magic Mike movie thing is genius", "I was thinking binging a bunch of Snapped like shows.", "It won’t matter he’s probably made a new profile on the account", "THIS. And that he stopped responding because she had a \"tone.\"", "I have to agree with nta. Full disclosure my mom had Netflix for many years(she's since canceled) and I let my ex have the password thinking he'd take over the empty slot(3 person account) he absolutely did not absolutely Fricking lotly didn't. He took over my spot and was watching lesbian romance knowing it made me uncomfortable. No desire to stop. It took me months to reprogram my algorithm. I was allowed a spot Because well family.", "Yeah, Netflix accounts are supposedly only for use by members of the same household at the same IP address now. No more sharing anymore so different people can log in from different locations using the same account.", "This comment makes no sense. Upvoted.", "Except he is paying for the accounts....", "He works in a fire station, I can't call him all the time as he responds to emergencies. Sometimes texting just works better. This is something I have spoken to him before about in person.", "Absolutely, I would like to be talked to if we are giving it out to a bunch of people.", "Not at all. My wife and I pay for Netflix, but it's tied to my info, so it's my account, just like the amazon is her account, even though we both use it. That's tied to her email. i would never claim her accounts, in her name, to be mine.", "I understand where you are coming from, but since it's a password that I use a lot and my email I am more referring to that aspect. This is not the first time this has happened and I ended up having a bunch of really weird things watched on my profile. I've also had my Netflix account stolen (unrelated probably). I wouldn't even care if he purchased another one. Or if he wants to give his personal info away that's his choice too.", "No, that's not what happened. He gave it for the shared living area for anyone to use.", "His use is not communal use. You can have a negative opinion without twisting the info.", "We aren't really fighting like cats and dogs about it. In fact I didn't even do anything yet hence the WIBTA part of the title.", "Netflix has been cracking down on account sharing. I don't know what situations are okay and which aren't", "He has his own profile on his personal devices that he watches at work. What do you mean by this?", "Was that perchance before the May 2023 crackdown on sharing accounts?", "Question, how is valuing my account security narcissistic? If he wants to purchase another account for the station, more power to him.", "I’m gonna have to assume this comment is satire for my own sanity", "WTF? I do not think you understand the definitions of the words you are using.", "Yes, please use out dated gender insulting pranks to get back at your husband, as opposed to talking to him like an adult. You're NTA, by the way.", "Then you watch it on the new profile", "You can remove things from your watch history and it'll take it out of the algorithm.", "Yes, sort of. I was using an ex’s Netflix account (with permission) and when the no sharing stuff came down, it sent an email for the account owner to respond as some sort of security measure/confirmation that the account owner was using the account.", "1) Half paying and he can spring for his own as\n2) it’s her identity that will end up stolen and \n3) his actions indicate he doesn’t give a fkn about OP having to deal with that.", "Ehhhhh he’s not paying for it in that sense, it’s her account that she’s been paying for long before he came around. They both work and the bills come out of their joint account so he’s technically paying for half", "That’s sketch, my brother is a firefighter and he calls me all the time while at the station, if I call him and he’s out on a call he just calls back when he gets back to the station.", "You spoke to him about it before you were surprised he added it to the fire station account? Not sure how that works 🤷‍♀️", "100% agree. \n\nMy info on the account = mine. His info on the account = his. Do we household share? Yes. Do we share the other person’s account info with someone else? NEVER.", "First, change your password. Also first rule of thumb…NEVER reuse your passwords!", "The only way they would have your password is if your husband gave it to them. If he logged into the account himself, they’ll never know the password.", "They wouldn’t know the password. He probably just logged it in and then it stays logged in.", "Like he signed in and did not sign out? \nOr did he post your email and password?", "Well, now that I have your permission to have a negative opinion…\n\nI didn’t twist anything.  The man works at a firehouse.", "Why do you care? I’m incredibly confused about your concern about the “communal” aspect.\n\nAssuming he didn’t post the login and password on a piece of paper, and instead simply logged your jointly paid for account (with your email) into a smart device what is the concern?\n\nYou recognize that the access which you are paying for is not finite. If he watches it at the station, it’s not stealing from your ability to watch. If he watches it and someone else is in the room the other person isn’t taking away from his nor your use of the service. There is no marginal cost to watch more.", "I mean, in that case I suggest rather than just summarily cutting it off just talking to him about it and expressing your concerns to see if you can come up with a different solution. Maybe he won’t even care that much.", "But he can’t use his profile on a larger screen in the station?", "Yes as I retired in 2021", "What is the security risk?", "How is this an out dated gendered prank? I don’t even see it as “getting back” at the husband. I just think it’s funny that the firemen would see that’s what she’s watching.", "It's more than that. My mom ended up getting her own account cause she got a message to make her TV the home TV. Then when I logged in I got the same message. And it was constantly a battle between us to confirm the TV as the main account holders. A total nightmare tbh", "He does call me a lot. I try to respect his work activity by texting to see if he's available when I need to call. It works for us.", "A million upvotes to this. \n\nOP, LOCK ALL PASSWORDS DOWN. NEVER REUSE A PASSWORD. \n\nAnd NEVER share a password with anyone else. I mean, normally a spouse could be trusted with that info but if my husband logged in on a publicly accessible device with my password and email address I’d be PISSED. Luckily my husband is not that careless.", "Ok but personal use is still not communal use. It's that simple.", "Then your experience password sharing is irrelevant and outdated.", "Either way I ended up getting my own account. They can be shared but it’s a PITA. Didn’t feel like jumping through the hoops", "Fair enough.  Still ridiculous.", "NTA, but it doesn’t make sense. Do you know if he’s just using it to watch Netflix at the station? What if he made an account specifically for the station so he doesn’t share the shows he personally watches? I also don’t see the problem with it since it’s more than likely just him logged in and not him handing everyone your login info and credentials. I would say if it’s that big of a problem get another subscription so he can watch Netflix where he wants. It’s that simple.", "YTA\n\nThis seems like a weird thing to get upset about. Dude was trying to do a nice thing for his new bros.", "Are posts like this for real?\n\nDo you even like your husband? \n\nYTA", "NTA\n\nhowever, i would be very tempted to start 'watching' the most embarrassing things you can find on netflix and when/if asked by anyone at the station tell them is your husbands account and you dont use it!", "Make a profile with his name, and have it watch loads of teen trash shows and anything embarrassing you can find. Watch him remove the Netflix account himself.", "NTA. \n\nChange the password. There should be an option to log out all devices. Don't give your husband the new password. If and when he's earned enough trust back, sign into the account on his phone, but still keep the password from him until you fully trust him again.", "NTA. You won’t be able to share it for long. Netflix is cracking down on sharing accounts. You’re going to have to eventually pick which one is your household and then if you want to leave the firehouse on there it’s an extra eight dollars a month to have extra accounts on there. I just went through this with everybody I have on my account and we technically live within one minute from each other on the same street and they still had to get their own accounts or I had to pay extra keep them on mine. \n\nBut I agree with others you have a bigger issue he did this without talking to you to make sure it would be OK.", "NTA\n\n>I've asked him several times before to not give my accounts to anyone\n\n>he promptly ignored me when he realized my \"tone\".\n\nThis isn't okay, he's a grown adult so why is he acting like a child?!\n\nInside the account settings is a button where you can log out of all accounts, do that and change passwords. Asking him *once* to not share it should have been enough, asking him several times only for him to ignore you while and after it is making him a huge AH.", "YTA !!!\n\nHow do you know he didn’t just leave it logged in ? You’re acting like he gave your password out . \n\nAsk him to make a guest account for the fire hall and save your hill dying for something worth fighting over . \n\nCan’t believe how many people said you should dump him - crazy Reddit people", "Well, Since Netflix now charges EXTRA for extra people on your account, I'd say take them off, change the Password, DON'T share it with your Husband, Tell him to get his OWN if he cannot keep it to himself. My husband and I were sharing, we are in seperate Countries atm, and Netflix said we had to pay more for me to use it as it was under a different IP address. So, unless HUBBY wants to pay for the WHOLE BILL WITH ADDITIONAL CHARGES, then he should stop sharing!  OP- NTA", "Yeah, how is this story even possible now? You literally can’t do this anymore. If they did the “I’m travelling” it will expire in 2 weeks and it doesn’t give you more codes", "Thank your Husband for me. I always appreciated Firefighters. Had a house fire and was proven why I give them so much respect.", "My point exactly. It's ten bucks a month... pretty sure you can allow other people to watch netflix. Especially people who are risking their lives to keep people safe.\n\nI kinda think she's being petty about the whole thing. You can hide your watch history too so she can't use that as a reason.", "I agree. Everyone should want Firefighters chilling at the Station watching Netflix. Once they have to leave for a call, bad things are happening. They risk their lives to save lives and property. OP should be happy to share the account.", "The main problem here isn't that firefighters get to watch Netflix it's that her husband ignored her boundaries, gave out her Netflix account she had from before she met him (something she had specifically asked him not to do), then proceeded to ignore her and belittle her when ahe went to talk about it. How the fuck is she TA here?", "Not sure why she cares tbh.", "Get real.", "I’m in Aus and my American friend uses my account and also a friend interstate", "“Their” account that they both pay for.", "It took me months to clean My algorithm.", "That is very odd. Do you have anything special set up? Netflix recognises VPN’s and blocks them plus wouldn’t let you access another country’s Netflix either. In addition to what I mentioned in my previous comment. I think it was back in May our multi-house family stopped being able to share an account when the crackdown was rolled out in Australia.", "Nope. My friend is in Texas and I’m in QLD and it works", "Lucky you!"]}