{"id": 34382, "submission_id": "18ywxvu", "title": "AITA for buying my wife flowers as an apology?", "selftext": "My(23M) wife(22F) made plans for us to go to her best friend's(22F) place for New Years Eve. I'm not a fan of this friend, we don't mesh. I think she's just overly loud and very much one of those, \" Look at me, look at me, make me the center of attention\" type of people and she can't stand that when I'm around her, I don't bend the knee basically.\n\nAnyway, she and my wife got to talking a few weeks ago, her friend said she was having people over, invited my wife and I. I didn't want to go, I asked my wife to just let me back out. She told me to buck up, smile, and bear it.\n\nI just couldn't do it, so on NYE day, I started feigning this bad cough( although a few were real) and telling her it hurt to swallow. I told her it wasn't a good idea for me to be around a big party, so, she went to this party and I stayed back.\n\nWell, when she came back, she found that I'd order pizza and some wings and got some beer. She did this whole, \" For someone with a hurting throat, you sure did have quite the dinner. Hows that cough?\", which I already knew meant, \" I know you lied, fess up\".\n\nI fessed up, she told me she was hurt, disappointed, and told me she is going to make me earn her trust again. I tried apologizing, she told me to save it.\n\nA couple of days ago, I went out and bought roses, her favorites, got a card too, apologizing. She came home, immediately threw everything out and told me I'm an AH for trying to \" buy her trust and forgiveness\"\n\nAITA?", "created_utc": 1704425805, "permalink": "/r/AmItheAsshole/comments/18ywxvu/aita_for_buying_my_wife_flowers_as_an_apology/", "score": 48, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be the asshole for not asking her outright what I can do to improve the situation\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA you buy your wife flowers because you want to do something nice for her to show you think of her.   You DON'T buy your wife flowers and candy to makeup for your stupidity. That being said unless you always bail on her plans you should be able to pass on a party you don't want to go to.", "YTA for the title. That really isn't the issue here. Also, how did you think she wasn't going to figure it out? Sound immature honestly.", "YTA. Flowers are a gift, not an apology. She doesn’t want a gift right now. She wants to be able to trust you, and that’s not something you can just go to the store and buy.\n\nIt requires actual effort, time, and consistency to restore trust. She may have trouble being close to you for awhile, and the best thing you can do is accept that, don’t push her, and just keep being honest with her until she starts believing in you again.\n\nNo shortcuts, sorry. And no apologies that aren’t good enough to stand on their own without the added gifts. That’s what she’s trying to tell you.", "Yta. From ur post I bet the friend isn't the attention seeking one.", "YTA\n\nNot for buying flowers, but because you WERE using it to get in her good graces again. You broke her trust, that takes actual work to fix not gestures grand or small\n\nAnd also you could have been honest with her about not going. Maybe you’re freshly married enough that she feels like you need to be together for these events but that’s a discussion you have as adults.", "YTA \n\nBy your own admission, this was a large party with many guests. It would have been the easiest thing to spend minimal time with the one person you dislike. Instead you lied in your wife's face. You just told her you'd rather spend NYE alone than compromise and spend time with her. \n\nAlso, sorry, your behaviour makes me doubt just how awful she truly is.\n\nEdited to add - your wife is understandably upset with you and you are acting as if with the roses, your owed automatic forgiveness. That's not how life works. If you keep pushing, she'll just get more annoyed and resentful of your behaviour.", "YTA because you lied. The whole flowers because I'm sorry thing is also such a shitty cliché. \n\nThe number of times I have been asked by a florist what I did wrong when buying flowers for my partner is fucking irritating.", "NTA for the flowers, but YTA for lying. It sounds like your wife needs a little more time being angry. Just give her some space.", "I want your wife’s side of the story, that would be way more entertaining than you over here loving the smell of your own farts. YTA.", "Aww hunny are you disappointed that forgiveness and gratitude didn't immediately follow your sad attempt at distracting from the lying? poor booboo\n\n&#x200B;\n\nYTA", "info needed: if you didn't wanna go to her friend's place for NYE, did you suggest some other alternative outing?\nleaning towards YTA rn", "My wife...and then this...and then this.. .and then that...and then pizza...amita?\n\nThis is ridiculous. Next time, try to capture the humanity of your characters rather than just your contrived notions of the plot.", "YTA for lying. She still mad, and it's gonna take time and effort for her to calm down. Gifts are typically helpful, but they don't just magically make things better...keep showing love, and no more lying", "yta. you should have at least gone for a little bit even if you don’t like the friend. go be there with your wife and go home when you were ready to leave", "Yta for  lying", "ESH You suck for lying and your wife sucks for trying to force you to spend time with a person she KNOWS you dont like. If she had been respectful of your feelings in the first place, none of this would have happened. She made plans FOR YOU without checking first, she INSISTED you go after your objections, now she's all SHOCKED PIKACHU that you lied to get out of it. I bet she has \"hurt feelings\" for weeks and weeks and weeks, oh the betrayal. What a pill. Anyways, no more flowers. Her fake little pity party stops now. She didnt need you there. She didnt need your support to go party with her friends. Its all bullshit. She's getting off on making you feel bad. Tell her not to force you to keep plans you never made in the first place. That way you wont be forced to lie to get out of them.", "YTA, you don't understand relationships.  Your wife asks you to unstop her mom's toilet, you can say no.  You can keep repeating no.  You can't say you have to work that night and then go to your friends.  They will pick the thing you did wrong and throw it in your face.\n\nNext time, say no and mean it.", "Trying to imagine lying to and ditching my fiancé on New Years just because I find one of his friends annoying and I simply cannot. What a dumb reason to play sick. \n\nYTA and you know it.", "YTA for lying to get out of doing something with your wife. Think about how you’d feel if the roles were reversed.", "ESH you for lying and your wife for not only accepting on your behalf to go to. But trying to force you to go to a party with people you don't like on NYE.", "YTA, unrelated to you but my boyfriend has lied to me ONCE, about something academic related, he revealed it to me and I thought I was fine but it broke down my trust as someone whose been lied to so many times in the past, it took a while for me to regain my trust, it took reassurance and communication.\nAnd that was just for something INSIGNIFICANT, we BOTH CRIED over it. I can't imagine how it felt being lied to about your partners HEALTH, she came back worried about you, but you lied. You don't go to the party for your wifes friend obviously. You go for your wife and the food, instead you lied and destroyed her trust in you when she wants and needs you around", "NTA. But your wife is, for forcing you to spend NYE with people you don't jive with. You could have spent it separately, you at home, she at a party that she wants to attend. Unless you \"force\" her from time to time to do stuff she really doesn't want to do?", " NTA - she wanted to force you to do something you didn’t want to do and when you asked to back out she doubled down. You have some responsibility in the fact that she’s mad because you lied but let’s take it a step further you go, have a shitty new years night probably still get into an argument now her new years is ruined too and you are still the jerk lose lose situation. \n All you did was choose the lesser battle, all she see is her feelings got hurt. Men and women argue from different perspectives you’re coming from the point of view of logic and reason she’s coming with her feelings and emotions. Just some advice for the married life get ready to pick the battles and accept that even when you know you’re right and you’re only trying to prove that she’s still going to have to win before the argument is over that’s all they ever care about is thinking that they are the one who are right. \n\nGood luck bro invest in a bulletproof vest and a helmet your going to need it", "NTA Your wives a full grown married woman who makes her own decisions over the head of you, her husband! On such an important night as NYE! ​​And she was old enough to go to her friend's party by herself.....She needs to stop be little girl mad!.....and she needs to stop making deals involving you, she needs to use her voice and ask you first instead of treating you like you are part of her accessory. Happy New Year 🍻", "YTA because you didn’t just tell her you didn’t want to go and weren’t. \n\nShe’s the AH for telling you to buck u, grin, and bear it. \n\nYou’re both the AH for the flowers. Don’t waste money on shit that does and gets thrown away. And her for not at least appreciating them before they died…", "Nta.. she should have accepted your request to not attend", "NTA. You should've stood up to your wife when she demanded you go though instead of agreeing and then lying your way out of it. This isn't a particularly big lie and unless you lie frequently, this probably didn't make her lose trust in you for anything important. However, lying to her instead of just telling her no definitely made her lose respect for you, and that leads to a lot of problems in a relationship. I don't care if she would've made a scene unless you agreed. You have to be willing to rock the boat sometimes. Frankly, the fact that your wife told you to suck it up instead of trying to persuade you to come tells me that she doesn't respect you very much to begin with. I don't know you, but you might need to get a backbone to begin with. She might also be an excessively disagreeable person who you should not have married.", "you’re an adult, she shouldn’t be forcing you to go to parties, and you should just put your foot down instead of lying. ESH, i think you both just need to grow up", "Try to make up the night to her. Take her to her favorite restaurant, treat her like a princess, and prove that she’s worth doing hard things for. She probably feels like she’s not a priority right now. Your partner was probably really looking forward to NYE (especially with you) and feels like what she wanted didn’t matter more than pizza and wings. She’s upset because she doesn’t feel seen or important. Flowers and chocolate are default “I f*cked up” gifts and don’t necessarily reflect that you actually see her and why she’s upset. Show her that she’s a priority and be patient. I think very soft YTA. Your head is in the right spot in wanting to repair things, you just need to meet her a little closer to where she’s at.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy(23M) wife(22F) made plans for us to go to her best friend's(22F) place for New Years Eve. I'm not a fan of this friend, we don't mesh. I think she's just overly loud and very much one of those, \" Look at me, look at me, make me the center of attention\" type of people and she can't stand that when I'm around her, I don't bend the knee basically.\n\nAnyway, she and my wife got to talking a few weeks ago, her friend said she was having people over, invited my wife and I. I didn't want to go, I asked my wife to just let me back out. She told me to buck up, smile, and bear it.\n\nI just couldn't do it, so on NYE day, I started feigning this bad cough( although a few were real) and telling her it hurt to swallow. I told her it wasn't a good idea for me to be around a big party, so, she went to this party and I stayed back.\n\nWell, when she came back, she found that I'd order pizza and some wings and got some beer. She did this whole, \" For someone with a hurting throat, you sure did have quite the dinner. Hows that cough?\", which I already knew meant, \" I know you lied, fess up\".\n\nI fessed up, she told me she was hurt, disappointed, and told me she is going to make me earn her trust again. I tried apologizing, she told me to save it.\n\nA couple of days ago, I went out and bought roses, her favorites, got a card too, apologizing. She came home, immediately threw everything out and told me I'm an AH for trying to \" buy her trust and forgiveness\"\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA for lying to your wife... you should have been clearer with her that you didn't want to attend. You shouldn't have to lie to get what you want.", "YTA\n\nYou lied to your wife \nYou claim her friend doesn't like you because you don't worship her (meaning she sees how disrespectful you are to your wife)\nYour wife told you to do better with your behaviour so you bought her flowers.  \n\nWhat a wet wipe.", "my hope was she just wouldn't think about it, maybe she'd be too tired", "she definitely is", "OP didn't want to go and wife was not taking No for an answer. What is the solution here? I know what OP did is not ideal (extremely idiotic), but what do you do when someone doesn't accept a No?\n\nProbably following through a lie was smarter option than ordering a pizza.", "not a huge fan of the silent treatment I'm getting", "Had to scroll way too far for this.", "To put it in other words, you're not a child trying to trick his mom into giving him a note to miss school, so don't act like it. Just say you won't go and explain why. Y'all might fight, but in the long-run if you are honest she (and you) will respect you more.", "You lied. \nExpected to get away with it. \nThen gave your wife a half assed apology gesture when she TOLD you that you would need to “earn” it ? \n\nKeep making dumb decisions. Your immaturity is really showing.", "Life is full of choices. Some good, some bad. Some smart, some dumb.\n\nThis was a dumb one for you.", "“I figured my lies and manipulation would work and now I’m confused that my wife has a functioning braincell and can see through six-year-old-who-wants-out-of-school level behaviour”. Come off it.\n\nThree things: first, give examples of how you seem to think you are asked to “bend the knee” around this friend - because that level of dramatic and conflict-oriented language from you screams that the friend is at the very least not the only problem in your interactions and may not be the problem at all.\n\nSecond, do you understand that in the specific problem between you and your wife, your complaints about the friend are irrelevant? The problem is you lied to your wife and abandoned her on New Year’s Eve.\n\nThird, you have to pick one - either it was fine for you not to to and wasn’t abandonment because there were lots of people at the party, in which case you could have gone along and barely needed to interact with the friend you object to; or you would have had to interact with her extensively, in which case the group was small enough for your absence to be a big deal. You can’t have it both ways.", "Sure she is haha that's why u put on a whole show, abandoned ur wife, and lied. But sure she's the extra one", "Sonsometimes people dislike others because of similarities. At the moment it seems you and the friend are similar. You are both pick me, give me attention people.", "Man, if only there were some way you could have avoided it.", "And she was not a huge fan of you lying and not spending new years with her.", "Then learn the lesson lol", "Surprise surprise, actions have consequences", "Play stupid games, win stupid prizes.", "abandoned her? She was at a big NYE party with friends", "Ultimately, you chose to ring in the New Year alone than be with your wife (did you even Facetime her?).  Blaming her friend is pointless.  You have more work to do. YTA.", "Yes that's u abandoned to stay home rather than be a good husband and support her.", "IDK what I was supposed to be supporting her in, but, I respect your ruling", "And that's why ur wife's mad.", "well, now she's not talking to me", "My point", "Because you're pushing and not admitting you've done a stupid thing. Give her space dude.", "Because you lied like a coward instead of just telling her you dont want to go there.🙂 At least you could take care of the beer and leftovers if you gonna lie. 🤣🤦This would piss me off as well, that fake excuse you gave her. Anyways she can go where she feels like going on NY but you are not obligated. 🤷", "Which OP will never get. le sigh"]}