{"id": 34406, "submission_id": "18zi3mw", "title": "AITA for changing my name after my dad gave it to his affair baby,?", "selftext": "I F(20) have a halfsister F(7) that is a product of my dad's affair and he thought it would be an amazing idea to give her my name. He started forcing us to get to know each other as siblings and my mom being the traditional wife that she is let her into our home. Don’t get me wrong I don't hate the child because I understand that she's innocent in all this, I'm actually working on getting over it and learning to love and accept her, however I despise the fact that my dad decided to give her my name.\nI started hating my own name and didn't want to be associated with it anymore so the moment I got to college I introduced myself under a different name to everyone I met there. I got a certificate which had my new name on it and when my dad saw it he went berserk claiming that I don't like his child and I don't respect her. My mom is also angry at him for what he did especially since the name was given to me by her and not him.", "created_utc": 1704490036, "permalink": "/r/AmItheAsshole/comments/18zi3mw/aita_for_changing_my_name_after_my_dad_gave_it_to/", "score": 6625, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I changed my name behind my parents backs \n(2) I hurt my mom in the process who is already hurt by everything else going on\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, and depending on where you live, you can legally have it changed to the name you picked. You can also change your last name at the same time if you like. It's a simple petition to the court. You can file it yourself when you get the right form to fill out, and it will only cost you a filing fee. Small wait for a judge to look it over and approve it, and then you can get all new identification in your new name, including birth certificate.", "NTA. \n\nIt's like he wanted to re-create you. It's creepy. \n\nI'm sorry this happened to you OP.", "NTA. \n\nWho tf gives their two children then same name, product of an affair or not?", "NTA. It was horrible of him to give your half-sister YOUR name. Truly, itboggles the mind. You have every right to be upset with him for doing that, and every right to change your name. \n\n&#x200B;\n\n>I got a certificate which had my new name on it and when my dad saw it he went berserk claiming that I don't like his child and I don't respect her. \n\n\"Hey, dad, why didn't *you* respect or like ***ME*** enough to not give your affair baby the same name as the child you already have? Why didn't you love your new infant and respect her by not giving her a new name for just her?\"", "Info\n\nYou both share the same first name?", "NTA.  What he did is ridiculous.  In your place, I would legally change my name-- including my last name, if I share it with him.", "Heh, reminds me of me a little. My parents had me, gave me a name with a particular sound at the end, divorced, then remarried and the next child they each had, also has the same sound at the end, one spelled the same and the other nearly so.   Their do-over babies...   NTA.  Naming another child the exact same thing is weird.\n\nSalvador Dali had a elder brother who died before he was born.  They named Salvador after him.  It caused him to have existential uncertainty.", "NTA OP!! That is so messed up, if I were you I would take it a step further and legally change both your first AND last name. Change it to your mother’s maiden name (if you have a good relationship with her).\n\n\nThat is so twisted and messed up considering your mother picked out the name and he had the audacity to name his affair child the same thing. I don’t know if his intentions were lazy or evil but either way it is a ginormous crappy thing to do to everyone involved. Especially for that kid to grow up and realize that they are the product of an affair AND their father couldn’t even bother to come up with a different name.", "NTA. Your so-called father did a horrible thing, and you have every right to change your name and be free of that.", "NTA.\n\nAffair aside, he… gave a second baby the exact same as you? That’s weird as absolute hell. There is no non-insane reason to do that. It’s horrible he made you feel you had to change your own name to get clear of his insanity.\n\nYour Dad is and has been an AH for many years.", "Your dad does sound like he wouldn’t have the brain capacity to remember two names.\nNTA", "your dad sounds like hes intentionally waging psychological warfare on your family to put it mildly. no you're nta and im very sorry", "NTA but holy crap is your father a monumental example of what a man should not be. He cheats on your mom, leaving her alone with a teen daughter, then he calls an affair baby the same name, has the audacity to come back to your come and then thinks he's in any position to criticize you?\n\nIt's admirable that you're trying to have a relationship with the girl - which you're not obligated to - and you should look into getting your name changed legally, it's a simple process in most jurisdictions.", "NTA\n\nI wouldn't even consider naming my current cats after a previous one...let alone a human child!! WT actual F \n\nCongrats on getting a new name - hang that certificate proudly and I wish you all the best.", "NTA. Your name, your decision.", "NTA - it’s your name and you can change it if you want to. Your father clearly has some weird reason for giving you both the same name, but you don’t have to participate in his games by keeping the name.", "NTA. You get to decide who you want to be, regardless of mini me.", "Wouldn't call you an AH for that, but your mom sounds like the one disrespected the most in this story. Your father is piece of... work. piece of work.", "Info: is your dad George Foreman?", "NTA\n\nYou need to have a frank conversation with your Dad and explain to him that while HE may be fine with his affair, having your name used as an attempt to bridge his betrayal of your family isn't acceptable and never has been. You tell him that the name HE chose to associate with the results of his bad choices is now tainted by his actions which are 100% HIS FAULT. If he's mad he has only himself to blame.", "Omg, I just see Cotton from king of the hill. He had Hank, then years later had Good Hank. Anyone who's watched that show knows exactly how hank's dad is, and I'm so sorry you had to grow up with a father like that. The idea of affair baby and legitimate baby feels kind of gross, but it definitely feels like your dad is a creep who is just trying to stir the shit without any regard for his daughters or the mothers of his children.", "NTA. Sounds like this is a half sister and not a stepsister? Stepsister would be if she wasn’t biologically related to you but your dad married her mother.", "NTA I honestly don’t understand what your dad was thinking. Cousins having the same name isn’t all that uncommon but siblings related biologically is just plain weird. You haven’t done anything wrong but it’s a shame you’ve had to change your name especially since you were given it by your mum. I would sit and have a conversation with your dad about how you feel", "NTA,Your father is, it sounds like a failed attempt to replace you, I feel sorry for you, you definitely deserve more.", "NTA. Your dad is vile. I hope you and your mom can remove him from your lives.", "NTA & there are some really messed up parents in this world", "NTA. People can change their name for any reason. In your case, you have a very good reason: your dad has given that name to his other daughter. That was an extremely hurtful thing for him to do. So, of course, just like all bullies, he is throwing a fit and trying to make YOU out to be the bad guy just for not being 200% ecstatic about his actions. My son took the step of doing a formal legal name change so he would not have the same last name as his abuser. I suggest you make a legal name change, and distance yourself from your dad. Sadly, he doesn't care about your feelings at all. I am so sorry you are dealing with this. Just know that there are many people out here who empathize with you. Having a crappy dad is, unfortunately, not rare. You will grow older and form friendships with people who truly care. Just be careful not to get too involved with men who are like your dad. That's all too common for young women whose dads have failed them. (Been there, done that, am older and wiser now.) Therapy might not be a bad idea, so you can learn that YOU are lovable, even if your own dad doesn't seem to know it.", "NTA,\n\nYour Dad is a p¡ece øf $hit", "NTA WTF does that? Do you guys have the same surname cuz that's even more crazy. I'd tell him there was only room for one \"my name\" and you changed that", "NTA\n\nWeird flex on one’s own kids. It is not ok!", "I’m sorry but your dad is an effing moron!  Not only did he inflict an affair child on his long suffering wife, but he steals your name, and then cracks the shits when you don’t like it! this man is a narcissist who has no concept of reality.  Your mother is better off alone and she needs to run , and I never say this but in this situation I’ll make an exception, she needs to take him for everything he has!", "NTA. Perhaps you could include your mom in selecting your new legal first name. But most importantly, do what feels right to you, trust your instincts, and keep your eye on your future.", "Not the asshole. Is your Dad George Foreman?", "Change you first name to whatever you want then change last name to your mother's maiden name", "NTA but your father sure is, and stupid as well because who could think that would be a good idea?", "NTA. Cheaters never seem to understand, it's not just a betrayal of thier spouse. It's also a betrayal of the kids.", "I suspect your dad gave her your name so he didn't slip up and call her your name to begin with. It was an easy way to cover his tracks. \n\nLazy git, and a major AH.", "Wow I feel for both girls for the father disrespecting both girls. Who does that! Where is the individuality", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI F(20) have a stepsister F(7) that is a product of my dad's affair and he thought it would be an amazing idea to give her my name. He started forcing us to get to know each other as siblings and my mom being the traditional wife that she is let her into our home. Don’t get me wrong I don't hate the child because I understand that she's innocent in all this, I'm actually working on getting over it and learning to love and accept her, however I despise the fact that my dad decided to give her my name.\nI started hating my own name and didn't want to be associated with it anymore so the moment I got to college I introduced myself under a different name to everyone I met there. I got a certificate which had my new name on it and when my dad saw it he went berserk claiming that I don't like his child and I don't respect her. My mom is also angry at him for what he did especially since the name was given to me by her and not him.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Mrs Figgzy isn’t on Reddit but told me to say your dad is an idiot. Nta.", "NTA", "NTA. Your father is not only a cheater but also either a very horrible or very stupid person.", "NTA. He sounds like an idiot, so maybe he was worried about having to remember an extra name.", "NTA your dad is insane", "I would have changed my last name as well.  Your father is an insensitive ahole. Good for you! NTA.", "NTA. Your dad is. Why in the world did he think it would be a good idea to give this child your name?? I just can’t even imagine dealing with all of that.", "Wtf?! You are (half)siblings, who in the right mind gives siblings the same name? Maybe a lazy parent who doesn't want to bother with reminding names...\nQuestion: Does he also name any pets you have snowball II and snowball XI? \nNTA", "NTA, I feel sorry for your mother too as she picked the name.\nThat’s awful your dad would give away the name like that, the name of my children is part of their identity, I would never make them share that name with a sibling.", "NTA, your dad’s a prick", "This is fake, right? You trying to tell me the AP AGREED TO THIS??!!!!\n\nNTA. Take it to the next level and make sure the AP knows he named after you. She should flip out and demand a change. Then change your LAST name to your mom's maiden name. Don't drop what your mom gave you. Drop your dad.", "NTA as if the affair wasn’t bad enough, he doesn’t even give the kid their own name then makes an assumption that you don’t like the kid.  This guy is a piece of work", "NTA. You’re living an episode of the Unbreakable Kimmy Schmidt right now. I feel bad for you, your half-sister and your mom. This is an awkward situation all around and he doesn’t have any say in what your name is-you’re an adult.", "\"Oh no, I love the kid, she's amazing. It's YOU who I don't love and respect.\"", "NTA I'd be taking your mom's maiden name and picking your favorite for a first name. I'd pick Gaia for a middle name. The goddess with no father.", "NTA. Your father is one of the most inventive narcissistic assholes I’ve heard of. That is a genuinely new method of fucking up your family.\n\nIt’s obvious to literally everybody here that simply naming a child after an existing sibling is a weird and uncanny thing to do. That it’s the product of a relationship in which he betrayed your family clearly makes that worse. You’re absolutely in the right to want to distance yourself from that in any way you can. I’m very sorry that your mother was disappointed by your choice, but it’s not her that has to deal with being constantly reminded of the weird and awful situation.", "This is more than a family pronlem. It is a legal problem as well. Imagine in 10 years you get a speeding ticket to a car thats not yours, and a driver thats not you", "NTA - Aren't you also your Dad's child?", "I’m so sorry. My father did something similar by naming his affair child my middle name and claiming he named her after me. This was after 14 years of hiding her existence. I understand you feel hurt. I think trying out a different name may be a good exercise for you. If you find you like it, you can keep it. If you decide to stay the same name, that is fine too. It is your choice. Don’t let him bully you into anything, but he will be angry and blame you. If you are relying on money from him, I’d continue legally staying the same name and never letting any paperwork near him. Once you are independent you can legally change everything and go by your preferred name.", "Why the hell would he want both daughters to have the same name ? plus you having the name first changing it because you don’t wanna share a name with a sibling  it’s like say Sam 1 and Sam 2 wtf .he’s the idiot and I’m sorry you had to change your name in the end .", "NTA\n\nAside from the sheer bizarre weirdness of two siblings sharing the same first name, your dad was being manipulative and abusive trying to force the relationship when the kid is a product of his affair.\n\nThe fact he ignores the emotional damage doesn't mean you have to. Congrats on your new name", "NTA. So only the affair child is HIS child? You’re not? \n\nMore reason to change your name. Screw him and ‘his’ child", "NTA\n\nPeople who name 2 of their children the same thing are mentally ill or idiots. Your father should be grateful you even speak to him or his affair baby.", "nta, but she’s not your stepsister, but your half sister", "George?", "Àà2à2", "Esh\n\nShe's not your step sister or an \"affair baby.\"\n\nShe's your half sister and a human being. Your father is TA, so take your anger out solely on him.", "NTA", "NTA", "I’d have cut off all contact with that asshole.", "Nta and your dad needs ongoing psychological treatment", "Ballgag", "It’s totally weird that he was ok with naming both daughters the same name. Yo me, it does not mean that you hate her, as much as you wanting a unique name, that does not tick your dad’s box for daughters… naming them the same name because I guess it’s easier. \n\nTell your parents that it’s HIS fault.", "NTA.", "NTA - why would he ever think that's a good idea??? Why would the mother of your half-sister think that's a good idea??? Is your dad trying to replace you with a new young version??? Did your stepmom like the name before and refused to come up with another when she realised you already had that name??? It's such a bizarre thing to do. \n\nIt's horrible that as a result of your dads actions you've developed a negative outlook on your own name (though very understandable). He absolutely shouldn't have done this. \n\nIf you want to change your name, go right ahead. Your dad should actually listen to you from a point of understanding and compassion - not get mad about it. All this concern for his other kid but none for you it seems. So sorry and I hope you love your new name!", "NTA\n\nUno Reverse. I believe *he* doesn't respect his child....the one he had first.", "NTA your name is your name, do as you wish", "I’m so sorry your dad is such a dunce.", "[removed]", "Nta like you name the affair baby like this your dad is crazy ...i mean he wouldn't have cheated if he wasn't", "NTA, and everything in this post is wholesome, most especially you working through your feelings for your sister. Keep it up! Sorry you got dealt this hand.", "Just like the British comedy The Other One.", "I’d be really curious to hear wtf your dad was thinking with this one.", "He probably did it to lessen the chance of calling the older one by the wrong name", "Our neighbors used to have a golden lab named Stanley.  Every time Stanley would die, they’d get a new golden lab and call him Stanley too.  I think they went through four Stanleys before they stopped getting dogs.", "Seems like Pops is trying to replace you.", "what the fuck is wrong with him I'd laugh but I just want to punch your dad", "NTA.  That is just so incredibly weird.  I would tell both of your parents to shut the fuck up or the last name is next.", "NTA. Who gives siblings the same name??? If your mum gave it to you, and you want to keep it for that reason, maybe make it a middle name. But you're free to change your own name regardless of circumstances, and in these circumstances? Even more so!", "So she's a half-sister, not a step-sister? And are your parents still married?", "This is weird and you’re NTA. Who does this? Name their affair baby after their daughter? WTF", "You changed your last name too, right???\n\nWTF? Definitely NTA.\n\nINFO: is your father George Foreman, and if not, what culture does he come from?? Because that seems completely insane to me, unless he is George Foreman, and then it is only mostly insane.", "NTA. Further more you should take your mother's maiden name as your surname to piss him off even more.", "NTA  \nYour father is a sick man.... and an AH.", "Nta", "Is it that she is your step sister or your half sister?", "NTA. Your dad is weird af", "I am so angry for you.", "You’re an adult and if you want to change your name then you can change your name. I’m pretty confident that you didn’t pick something outrageous or offensive so there is no issue here. I wouldn’t want to share a name with my sisters either.", "NTA - make sure the child knows its not against her, hard though this may be, but your father is a major asshole.", "NTA, your dad’s a freak. Sorry that happened to you. It’s insane that a parent would do that. Pick an awesome name and own it.", "NTA", "NTA he is so weird for doing that, you don’t deserve to be treated like this", "What in the hell was he thinking???  \n1. takes your name away from you and your mom\n\n2. he went berserk because you did what's right for you\n\n3. disrespects your mother and his wedding vows and has the nerve to say YOU don't respect the child he created outside the marriage\n\nI've got more but you get the point...", "NTA and a side note that I'm very sorry that happened to you.", "You're not even close to being the asshole op.", "You are NTA. Your dad is…out of his mind.", "NTA", "\"and when my dad saw it he went berserk\"???   \n\nWow, I feel bad for you.  Your dad had an affair, which led to a child, and your idiot dad made the decision to give her the same name as you?!\n\n&#x200B;\n\nI have no words.  Did you ever ask him why he did such a dumb thing?!   That's gotta be Top 10 stupid things people did on the planet for that year.   And then he 'went beserk' when he found out you wanted to change your name to disassociate from the situation.\n\nDon't take this the wrong way, but your dads a complete idiot. Sounds like a creep too.", "[removed]", "To me this is a slap in the face to OP! I would change my name too! Wow! That guy has some big brass ones!", "How bizarre to give both your children the same name! I’m surprised the child’s mother went along with it.\n\nYou can change your name for any reason you want! That includes no reason. It’s too bad he did that to both you and your half sister.  You two have a real winner for a dad.\n\nNTA", "NTA\n\nYou don't need to justify changing your name. You are your own person.\n\nPlease try to remember that your sister is just a little girl who loves her Daddy and has no idea about adult relationships, though. You're the adult in that relationship.\n\nEdited to add, I'm sorry your Dad gave your name to someone else. He's the AH here. Hopefully, he thought he was honouring you in some way and just greatly miscalculated.", "Changing your name is 100% a smart move! NTA", "Omg my grandfather did this shit….had two sons with my grandmother and then a daughter by my grandmother’s cousin and my grandmother kicked him out while pregnant with my mom. He named his first son L, second J and his Affair baby D. Then after grandmother kicked him out, had three more children and named them L, J and D….so freaking crazy!", "Not even close. That was a horrible move by him. It's like saying the first kid didn't count and this is the real one.", "Info: is the name in question here a variation of your father’s own name? \n\nAnswer doesn’t change the judgment at all though. Absolutely NTA", "NTA wtf", "NTA", "Change that name baby! Then tell your father he’s AH for naming another child after you.", "NTA. \nMy dad tried to name my half sister the same name as me when I was 18. Complete first, middle and last. I had to remind him it was my name. \nThis man had the audacity to act like he didn't know it was my name. The man has a tattoo of my first name on him.", "Be careful of his motives. Are any grandparents leaving you anything in their will or any savings set up in your name? Dad might have bad motives for using your name for his affair baby. Cheaters can't be trusted.", "NTA \nThis is crazy. The same name?!", "NTA\n\nThat was disgusting of him!  I’m sorry you have to deal with that.", "NTA\n\nYour father is, though.  I can think of many bad names for him, but I’ll roll with the primary one being: Lazy.  All the names in the world, and he couldn’t think of one different one?  What a dumbass.\n\nGo for it and change your name legally: your chosen first name, your mom’s surname.  Let him really stew in that.  😈", "NTA. That is the weirdest shit I’ve ever heard… if you weren’t related that’s worth a restraining order.", "He didn’t respect you to let you have your own name. Massive NTA, how his AP allowed this too is beyond me.", "My name? Janice Dadsacheatingtool McKenna", "NTA. Your name is yours. It’s messed up to give both your kids the same first name. Your dad is self-centered and immature. He sounds completely intolerable.", "NTA.  I want to ask what he was thinking, but this post gives no evidence that he was thinking at all.", "NTA absolutely, who does that to their kid?\n\nI'm only sorry for you having to give up your name. YOUR OWN NAME. On the other hand... For God's sake, your dad is thrash. And still acting b***hurt about it? Is he absolutely incapable of reading the room?\n\nYou can tell him to get lost. Is he incapable of understanding that you just don't do that to a child? You don't go na mine every product of spermination the same thing. And ouch! He picked the name your mum, *whom he cheated on*, chose for you???\n\nThis is getting worse each time I re-read what I just wrote. We're here for you!", "NTA\n\nyou're more than justified in wanting to change your name, and it's him that doesn't respect either you or her or he'd have given her a different name.", "NTA\n\nThis is funny on *King of the Hill* but not so much in real life.", "NTA. Please go all the way and have it legally changed. Consider changing your family name as well. >.<", "NTA\n\nYour father chose to be a huge asshole, both by having an affair, and by then naming his affair baby with your name.", "NTA. If my dad did that, I'd cut him off just on principle alone", "NTA\n\nYou father is quite frankly a complete ass. \n\nI just have no words to describe how awful  a person I think he is. \n\nPersonally, I would stop seeing this man. Because something isn’t right with him and he’s working out his considerable issues on you and gaslighting you on top of it for the trouble. \n\nI would get as far from this man as possible. Seriously, Red flags all over the field.", "NTA, what the fuck? That.. is all I can say without getting banned", "[removed]", "NTA\n\nWhat he did was insanely disrespectful towards you. And your mother for that matter. It's almost like he wanted to erase you. It's got to be also incredibly impractical to have two daughters with the same name on purpose.", "NTA- The affair aside, how STUPID is it to give the same name to two sisters ?!", "Why not change you last name to your mother's maiden? Like this you keep the name she gave you and you get another exclusive to her.", "NTA\n\nYour mother needs to find some self worth if she's staying with your father and accepting his infidelity into the house.  Is he still with the AP?  Even if he isn't, he knows that your mother will forgive anything that he does because he's gotten away with it at least once.\n\nYou are right that what your father did is awful.  I would've changed my name too.  And your an adult and have every right to.  \n\nIt sounds like there is a cultural or legal thing where you can't change your surname for the purposes of inheritance if you say that you stand to lose too much if you do change your surname.\n\nThe child is innocent but it doesn't mean you have to accept her and be her sister.. but do you have to be respectful as none of this is her fault.  \n\nI can't believe that your father gave you both exactly the same name.  His reaction and what he did would make me want to limit my interaction with him.  \n\nHow long have you known about the existence of his other child?  Is this something recent or did your mother find out while the AP was still pregnant?", "Personally your whole family sounds toxic. I would restart. You know close the doors change your name to something you actually appreciate and want to honor, and never contact them again because that will only bring you pain. You should have said to your dad, I changed my name because you gave it away to someone else. She's innocent and now you have hurt her because you couldn't be original and come up with a different name than my own how do you think she feels having to walk in my shoes.", "What kind of father would do that?  He’s a horrible man.", "I once heard of a guy who had a double life, 2 wives, 2 sets of children. He named the children the same names so that if he made a mistake with the names he wouldn’t get caught out. NTA.", "Hell no.  He disrespected you and you distanced yourself.  He doesn’t like it?  Don’t have an affair and sure as shit don’t name the bastard child after you.", "NTA.\n\nAnd ewww to your Dad. No one wants a sister/ half-sister getting their name. It's like he tries to erase your individuality and make you metaphorical co-joined twins. Let alone the issue with \"which Kathy does he mean?\" if someone uses your boths name... very unpractical and inappropriate.\n\nI am sorry you had to change your name though, that's sad. And no, it doesn't mean at all that you hate your half-sister (you might want to explain this to her if you don't want her to feel hurt... your Dad might try to manipulate her into believing in his distorted worldview).\n\nGood luck!", "NTA. Holy crap that’s creepy.", "Nta.but she's not ur step sister she ur half sister", "The man has absolutely No Shame.", "Your dad is a piece of work and your mom is weak for staying with him. Ditch them and that affair baby as fast as you can. \n\nNTA, cut contact and run.", "NTA\n\nSorry that happened. It's very okay for anyone to change their name for any reason.", "NTA, \n\nyour father is an idiot", "NTA. It's SO incredibly odd your father thought it was a good idea to give her the same name. I'm so sorry you have to deal with this!", "NTA. Your dad is disrespectful to *you.* I don't blame you for changing your name.", "NTA\n\nYou’re father on the other hand…", "NTA. That's some crazy and disrespectful behaviour from your dad.", "[removed]", "NTA. Sounds like your dad doesn’t respect YOU. This is so bizarre as to border on completely deranged on your dad’s part. I cannot imagine the mental gymnastics he required to make this make sense. Keep your new name and try to love your little sister in spite of your boneheaded parents. None of this is her fault.", "I don't usually comment on these things but here goes ..\n\nNTA. As a dad myself with two kids from different relationships l, strictly speaking, could have named them the same name. I chose not to because they're different people!!! \n\nIt's too late to change a 7yo name l, but if you want to change yours, you go ahead, you're an adult and you're making decisions that affect you and how you grow personally and professionally. \n\nYour Dad is the one that needs an attitude adjustment. Be honest, be frank, don't back down from your position. Your Dad is in the wrong here. You don't have a problem, he does. Don't apologize for someone else's issue.", "Why in the world did he do this?", "Hey hey - maybe dad just didn’t want to remember too many names? \n\nOP you are NTA.", "NTA, but curious what his affair partner thought of all this?!", "I see it as a compliment. It happens all the time. Families pass a favorite name around. Sometimes one person may use their middle name to avoid confusion. Take it as a compliment.", "Info: does he only know one name?\n\nNTA", "NTA - Unless you're one of the most famous boxers in the world and a little crazy, you don't give your children the same first name.", "NTA foiled his plans quite succinctly.", "NTA. Bruh that’s insane it’s like your dad is trying to live in an alternate timeline", "You are NTA. But your father. \n\nAnd for him to be angry at you for changing your name.... what is wrong with the man?\n\nDo what you need for you.", "NTA. \n\nIf anything, he’s just an entitled idiot and your mother needs to understand it’s common sense to just kick him to the curve and get a divorce(if they haven’t.) yes, the child is not at fault, he is. He has no authority over your actions, and if he’s mad about it he can grow a pair and suck it up. He has thick enough skin to cheat, but not a big enough brain to try and understand your reasoning. So no, if anything, he’s the AH.", "She's your half-sister, not step.", "NTA. Sometime parents poison the name they gave you. You deserve to be called by a name you like instead of one that makes you cringe. \n\nSigned, \n\nSomeone who changed their name and has no regrets.", "Nope. Your dad should have picked a different name.", "Wtf is wrong with your sperm donor...what an ah.\n\nYou, on the other hand, OP, are NTA. It's your name and identity.\n\nBig kudos to you for being so kind and understanding towards a child who is just as innocent in this as you are. I feel so bad for you both, but your sister is likely going to have an identity crisis in the future when she finds out the truth (as in affair baby and being given your name). Sperm donor here is just such a major ah.\n\nInfo: where is AP? Did she know about you and your name? If she did, she is just as horrible as daddy dearest here (besides the affair of course).", "Absolutely NTA. This is horrible!", "Your dad should not punish you for his inability to be creative and bless each child with their own identity. \n\nYou are NTA. You are protecting your stepsister.", "NTA\n\nEven if there was no affair etc drama, your personal identity was taken and shared with someone else...on purpose.\n\nMakes perfect sense to want it back\n\nDad is massive T A for the affair, taking your name, and stealing the name your mom gave you... basically everything. He has zero right to be angry or excuse her at all", "Im sorry, But WTF!?!? Is he that unoriginal? Does he think shes Long-Cup8142.2 Thats a major Ahole move by him. I wouldnt even bother talking to him after that.", "Nta. Dad is kind of a dunce", "Your father is wrong, which is my nice way of putting it.  You had the name first.  And if we want to change our names, we can.  I did.  NTA.", "Your not aita", "You are NTA.\n\nYou are an adult and you can change your name to whatever you want.", "NTA\n\nWhat your dad did was a total AH move.  If you got to the point where you literally started hating your own name, you had to change it.   If your mom is mad, she should be furious at your dad for what he did.  Not at you.\n\nYour dad is the Major Grand Poobah AH though.  Your mom is just hurt and upset and misplacing the target for her anger.", "Omg NTA. I would totally insist he changes his daughter’s name instead, with mom’s full support. She shouldn’t even step in and be accepted until that happens! - the last line justifies this 10000%", "is he George Forman or just that stupid.", "Def NTA. That was disrespectful to give him your name. Clearly after his reaction he favors the love child than he does you. Tell him he’s not in high school anymore and to get over it. He’s being childish. I would have had my name changed the moment I found out about him naming another child my name.", "NTA. Your dad was WAY out of line to give her your name, and your changing your name was a completely sane reaction to an insane situation. It certainly wasn't a rejection of your half-sister. It was a rejection of your dad's asininity. \n\nAnd I'm probably your mother's age, and I can tell you, our generation does not have a \"tradition\" of accepting our husband's affairs. Your mom is probably thinking the same thing as you: That it's not the child's fault she was born.", "It used to be a German custom to give all of the kids, the same first name and only change the middle name. I don’t think that’s still a thing though.", "NTA, your dad is an idiot.", "Are you sure it was his idea and not AP?", "Omg, your dad is an idiot.", "You NTA\n\nYour dad? Big AH. Your name should have stayed just yours", "What's wrong with your dad that he can't remember more than one name for all his daughters? What an insult. It's like he thinks you're interchangeable.", "That’s very weird lol you aren’t the asshole.", "I am confused. Isn't she a half-sister? Is your dad your stepfather?", "My husband worked with twin sisters; Katherine and Kathleen. Hence forever known as \"Kathy and Kathy\"!", "[removed]", "[removed]", "Just to correct you on one thing, you have a half sibling not a step sibling. NTA btw.", "[removed]", "Your father is the AH here and I feel terrible that you mother is sticking with him. What he did is bizarre, disrespectful, lazy and gross. NTA.", "Incidentally, one of my cousins named his daughter after his favorite uncle's oldest daughter: me. Her name is Theresa Marie....I spell my name without the H...and my middle name🤦‍♀️", "Start calling his brother daddy and see how he likes it.", "[removed]", "This literally happened to a friend of mine, except they're really close in age and she didn't know about it until adulthood.", "NTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.\n\nNTA.", "Stepsister?", "NTA. Your dad is though. He's also an idiotic narcissist.", "Geesh …. Definitely NTA", "Was he trying by to replace you or something ?\nWhere’s your sister’s mom ?", "What kind of idiot gives his affair baby the same name as his first daughter??? NTA...you should have asked your mom to help with picking a new name.", "OP, i’m so sorry you had to deal with this! You are NTA at all, in fact, your dad is. It is so weird to me that he would want both of his children to have the same name. Maybe start going by a middle name, or I like the comment that said have your mom help you since she picked your original name if you’re not set on what you’ve picked!", "That’s messed up, your father messed up. I’d change my name.", "Just curious, what country are you from?", "daaaaaaafuq NTA but your dad sure is", "NTA HE'S the one who doesn't like his child & doesn't respect her!!!🤦‍♀️", "Nta, your dad is delusional.", "NTA. You don’t have to share a name with your half-sibling. He is definitely the AH here.", "That's....a little ridiculous. Your dad named his second child the same thing as his first child. That's....I just don't have words. \n\nNta op, lean on your support network. Therapy might be a good shout to work through your feelings", "NTA 🩷", "You are NTA. Your father is. I mean seriously? He could not have thought of something else? Thats a d move right there. Sorry you have to deal with a father like him.", "NTA. Your father si absolutely mental for this", "Your father is sick, why he thougth thas was a good idea?", "OMG, so NTA.  Maybe INFO on reasons your dad gave her that name, but it's difficult to even imagine a good (i.e., non-manipulative) reason why.  It's rare enough for siblings to be given the same name - George Foreman's kids - but that's a gimmick.  This isn't.\n\nAnyway, you're >18, you can change your name anyway.  A lot of women do, when they get married.  So, have at it, Princess Consuela Banana Hammock!", "NTA and that is abhorrent of him to do. The OBVIOUS implication is that he was attempting to make a \"new you.\" \n\nI'm so sorry that happened, and admire you greatly for taking agency over your own name and claiming a new one!", "NTA. Your dad screwed TF up. He hurt you, he hurt your mom, and selfishly set up an impossible situation for you all to deal with. You did what felt best, and not out of disrespect for your mom, or your half sis, or even your idiotic father. Seriously- wtf is wrong with his brain to make that horrible decision? Baffling.\n\nETA: I have gone on reading and am still thinking about this. Like seriously, is he George Foreman?", "NTA times infinity - your dad however? Mega asshole.", "So a woman had a baby with a married man and acceded to his desire to give the baby the same name as his existing daughter? That's bonkers.", "Is your dad okay mentally?", " He is disrespecting your mother (She named you ) and screwing you over in the process. \n\n If you mom was a man and he disrespected a man like that, punched in the throat might be a mild response. \n\n So you're definitely NTA in this one.", "Holy shit. This is awful on many side. NTA\n\n1) He ruined the name of yours by naming his illegitamate daughter (old fashioned idea sorry but applies) by his legitamate daughter. This now puts a stain on your name\n\n2) holy shit what will happen to your sister (you should use this to help you here to maybe prepare to bond you later) when she learns that she is an affair baby, the name is yours. The trauma from learning that will probably lead her to change her name in the end\n\n3) do try to at least accept your sister. The reason? Your sperm donor is a god aweful parent and this MAY cause her to hater he father later. You may never have a sister bond, but you can have a shitty father commerative dinner once in a while.", "Wouldn’t she be your half sister?", "I know a guy who did this.  Except he didn't do it - the affair partner chose the name.  He's super embarrassed he has to explain why his two kids have the same name.\n\n\nFrom what you are saying, your father was part of the naming decision for affair baby.  He is an incredibly shitty human.  I'm sorry. You do what you need to do.", "NTA, but your father is a prick. First, he has an affair then he names the child after you. How do you fix your brain to think this is a good idea, I think he did that to stick it to your mother. He claims you don't respect your half sibling when in truth he doesn't respect you. I don't blame the baby, you two just happen to have an AH for a father. I would go low to no contact with him because he is only concerned about what he wants, and he will never let you have any peace for changing your name. In fact, he might demand you change it back because in his mind he was being clever.", "Wow that’s fucked up. And creepy as hell.\n\nNTA.", "NTA\n\nDid HE name the baby, or did his partner name the baby? I have heard of partners (step-parents) pulling this kind of bullshit, but not the bio parent. From a step, I would see it as a move to ‘replace’ the earlier child (as it often seems to happen when they are also limiting the contact between the parent / earlier child). Either way, they’re both in the wrong - even if one suggested it, the other should have said no. \n\nI’d tell him if he’s so concerned with your identity, he shouldn’t have forced you share it in the first place. He’s still got one (OP’s name), he doesn’t need two.\n\nDoing this with a baby from an affair is also a double gut punch. If that kid were me, I’d also feel sick realising that my name was just a copy and paste job. Like did I not warrant my own name? Why make an already shitty situation more shitty and confusing?", "As someone who has a half-sibling with the same name as me, you’re 100000% NTA. Your dad is though.", "Nta I can't believe this is even a question. Who does that!?", "Dad was hoping she would what? Get ahold of any inheritence your mom left you because she shared a name?!?!\n\nHis behavior is Telling. \n\nNTA, but your father is.....something worse altogether.", "My older sister's Dad did something similar - no affair though.  Sis lived with us, he married someone else and gave his next daughter the same name.  Cue YEARS of resentment", "NTA. Your parents are...special. Your dad gave his affair baby your name and your mom was okay with it? What a weird thing to do. I would have changed my name too.", "NTA- didn’t even have to finish the first sentence.", "NTA - It’s weird as hell that your dad decided to give his second child the same name as you. I totally understand wanting to change it at that point even without the affair. Also, I’m glad that you aren’t blaming the child in all of this. I’ve seen way too many posts like this where people are treating the children terribly for their parents’ mistakes.", "NTA your dad fcked up, he knows that and projected feelings of guilt towards you onto your little sister by naming her like you „She’s my little baby“ (which is you but represented by her) and when he saw that you don’t want that kind of connection and not playing along with his psychotic behavior, he completely lost it (not out of anger towards you but himself)", "People change their name for many reasons. It's common for the entertainment industry\n That's so rude to name another child your same name. With that said, there's a man named George that named all his children after himself and put a number after each of them. You could put a number 1 after your name then tell your father to call you number 1", "If he got so angry to start accusing you without asking why - He might had some scheme using you two in his head. I mean, looking at you as a two perfect puzzle pieces in his ideal life where he is the main character that granted you gracefully his dna and your names. And a name change was the thing that show you as real people with their own thoughts snd intensions but not his beautiful pawns in now cracking world of the Wise Ruler.\nI got this vibes from the all names-system and his fast and furious reaction on the non-under-control name change. \nIt's very much an assumption. Yes.\nI don't know you or him personally so it's also a very big assumption.", "Nta, but it’s weird that you have to learn to love and accept her.", "100% NTA, your dad is a colossal AH, first both the affair and giving the baby the same name as you.", "I’d go no contact with the dad. He obviously has zero respect for you, your mom, and your entire family. Even your mom should be low-contact considering she’s enabling your shitty dad’s behavior.", "NTA. Your dad’s decision defies logic.", "NTA\n\nThat is genuinely unhinged behaviour by your dad, a bizarre gas light, horrible manipulation.\n\nAnd your mom should never have allowed the child into the house under those conditions.\n\nGood on you for changing yours.\n\nHopefully your mom changes her last name sometime too.", "NTA.\nYour father is the disrespectful one and a major a-hole.", "You are right to be upset. Remember to keep your anger focused on the correct target, your dad. He is the one that created the situation, pitting you against your half-sister, and putting both of you in a frustrating position, to say nothing about how your mom must feel. I’m glad she’s empathetic toward the child and I hope she’s not going to easy on your dad. Your half sister is just a tiny kid but probably knows something is up, even if she doesn’t understand what’s really going on. It is your name and you are right to change it if it’s what you want! He’s going to have to accept that he can’t control you. And that your relationship with your sibling will proceed on its own without his control. Eventually your sibling will be an ally in holding your father accountable. It sounds like he’s not accustomed to being held accountable. Hang in there", "Nta. I'm sorry he stole your name from you.", "Your dad has some issues.", "NTA at all!! How terrible of your dad to something so rude and selfish to you. That’s absolutely appalling and I don’t blame you for being upset. Can you go to a lawyer and have a name change made official? What a shame your dad didn’t see the error of his decision before he named the child. Ugh. Again you are not the AH. Good luck.", "Your father is a gigantic walking AH. He gave his affair baby your name and then acts like everything is great..That is just psychotic.  Change your name. Go NC with him. NTA.", "NTA.  Your Dad has no right to be upset, and no right to say that your desire to have a name that you don't have to share with your half-sister means you don't like her, it simply means you don't agree with his ridiculous decision to give both of his children the same name.  Your Dad is lucky you even still speak to him.\n\nAlso, without knowing anything about your Dad other then he cheated on your Mom and has no respect for you, I'd be worried about fraud.  Presuming that your sister has the same surname as you as well, he has a child who has your name.  I feel there could be a way he could use that to his advantage (if he's that sort of person).", "Your dad cant be an arsehole they are useful hes way worse then an arsehole. Maybe a net with holes in, in the desert.", "Your dad is a sociopath", "Nobody is the asshole. It sounds like your dad loves you and thinks you’re a success and wants his baby to be like you. \n\nHe wants you to influence the baby. It’s possible you’re the biggest accomplishment in his life.", "What the hell was he thinking?? You are nta but your dad is questionable.", "NTA \nTalk with your mom and make sure she understands where you are coming from, and that it isn’t her at all\nAs for your father, he can f right off forever", "Are any of you guys old enough to remember the Bob Newhart show and the episode where the three brothers get introduced by the eldest. He says to new heart, “this is my brother Darryl, and this is my other brother Darryl”\n\nPersonally, I think that’s where George Foreman got the idea 🤣\n\nOP, i’m so sorry this happened to you. It’s funny as hell in a sitcom, but in real life it’s awful as hell. NTA", "NTA, it's weird he named her your name. I'm guessing he's trying to feel better about his affair, like trivializing it. \"Look, yes I had an affair and baby, but you both have the SAME NAME! We're family, isn't that special?\"", "He is psychologically trying to make up with that child what he messed up with you I think, hence the same name. He needs psychological help. I am so sorry.", "You're the asshole... To him.\n\nWho cares what he thinks? He clearly doesn't mind being an asshole himself.\n\nDo you.", "NTA.  The main reason is that anyone should be able to choose what they want to be called by.  Your story is obviously compelling.", "You gotta do what you gotta do to be good. If that means changing your name why not.", "NTA- my husband’s cousin has 2 affair babies that has the same name as him. Both the other mothers did it as an fu to the wife. People are trash, I’m sorry you’re dealing with this.", "NTA\n\nYour dad has a lot of nerve. He has a child outside of his marriage. Gives her your name and gets upset because you find that offensive?\n\nLook at it this way. He didn't consult with you on the naming of your half-sister and you don't have to consult with him to let the name go.\n\nLet him be mad. But make sure (at some point), that your sis knows that none of it is about her.\n\n.", "Same first name! Your dad is a total AH. You are NTA. I’d feel the same way if I were you.", "NTA I don’t know what your father was thinking when he gave your name to his new daughter, but I have a hard time believing that it wasn’t intentional. He’s a jerk.", "Did he do this so he didn’t have to remember 2 names when talking to people about his daughter(s)?", " It's not up to them.  It is up to you.  Enjoy your new name.", "Not sure how the father thought that would go over well. NTA. I would have done the same thing.", "Nta. Take the affair out of it... Two kids with the same name??? Lazy at best, rude and unkind at worst. How are people meant to tell you a part on paper or in conversation without them having to be like describe your age or something. It's just confusing.", "NTA. This definitely sounds like retaliation for changing your name, not a genuine attempt to connect you and the child.", "NTA, why did he think it was a good idea to have two children with the same first name...", "To be fair, it is very weird for your father to give two of his children the same first name… Do you know why he chose to do so?\n\nI think it’s completely understandable you want your own name and make decisions in that regard. NTA! But perhaps including your mother in your thought process might be a thoughtful gesture towards her?", "NTA \n\nDon't blame you for wanting to change your name. Your dad should have used an original name. It screams that he couldn't be bothered to try and remember a 2nd child's name so he used the same name for both. Also you're an adult, you can change your whole damn name if you really want to and if I were you I would change it legally. Also him getting mad that you don't want to have a Sr. Jr. thing going on with a child that came out of an affair because he couldn't keep it in his pants.\n\nTell your dad to go Fu*k himself and if it's so important to have 2 kids with the same name maybe he should go make another one. 🤦‍♀️", "Your nta but your dad sure is.  My grandfather pulled the same stunt.  Named the son with his side piece the same name as his legit son.", "NTA - your dad doesn’t get to decide if your feelings are hurt or not and he doesn’t get to put himself first. It sounds like he is a cheating liar and deserves the consequences of his actions. \n\nI feel for your mom, especially since if she is still with him.", "NTA. \n\nMy spouse also shares first name with father’s love child who was born a few months apart from my spouse. That’s weird af.", "I knew a guy who did that. Both daughters were named Joy. Asshole behaviour. NTA. And make it a name that is uniquely lovingly you.", "He is mad because he doesn’t think you like his other child?! He gave her something of yours without your permission. He betrayed and dishonored you. The name you give yourself is a more valuable and he can’t have it or give it away.\nNTA", "NTA but does he pay for your schooling? You may have to pretend to go along with his wishes for a while if that’s the case", "Your dad is acting like he does not respect you! I hope your middle names are different at least!\n\nDoes he have a brother? Start calling him his brothers name. When he complains, ask if he does not love and respect his brother (don't,  that was sarcasm and will get you in more trouble). \n\nAt 18, I would change my name.\n\nAnd next time he mouths off, really, I would just ask, with a sad face why am I not enough of a Long_Cup for you that you had to replace me with a younger version? Hopefully, it will make him feel bad. \n\nIt actually could be that ypu are so awesome, he wanted two of you!", "Did he tell you why he gave her that name ?", "NTA - what was your dad thinking? Actually, he obviously wasn’t. He is lacking in so many departments, I feel bad for both you and your mom. Change your name to whatever you want, your pathetic father obviously wasn’t thinking of you and how awkward it would be for you to share a name with your younger half sister. Of all the names he could’ve picked, why did it have to be yours?\n\nAnd I need to say this but - you mother is a saint. Not only has she forgiven a cheater but she also invited his offspring {who was a result of his infidelity} into her home. Give this woman everything she wants in life. She deserves better than your dad, though.", "That’s crazy that your dad decided to give both of his children the same name. Is he trying to be a sadistic a**hole? He must be if he also had an affair and is trying to push the affair kid on his wife.\n\nNTA. Dad should be on r/AmItheDevil", "NTA. If he had a second daughter with your mom and gave her your name, you’d still have a right to be upset.\n\nHe’s mad you are having issues with his affair (messed up), having an affair child (super messed up), AND giving his other daughter YOUR name (sooooo fucked up)! Is he a narcissist and a sociopath? He has created a huge mess you are just trying to deal with in any way to keep you sane. If you cut him out of your life you would probably be better off.", "Sounds like the guy doesn't want to remember two different names.", "I would legally change both. Pick a new first name then use my mother’s maiden name for my last name. \n\nNTA.", "I have done this (just to add my late father's name as a middle name).\n\nI will warn you that it does cause a lifetime of minor nuisance. \n\nEvery time you would normally use your birth certificate as ID you need to show your birth certificate (with your old name) and your change of name certificate (with your new name) then the poor person taking the ID needs to work out how to process the unfamiliar ID.\n\nstill worth doing. My dad was the best, yours, not so much.", "I don’t know where you live, but it’s more involved than just filling out a form. You have to advertise it in newspapers and legal newsletters and it has to be done more than once, at least where I live. It also costs money to advertise in the newspapers. Most people need an attorney, too.", "Such a narcissistic thing to do as a parent and assume you’d be ok with it. Definitely NTA", "I said similar in a reply to another comment - it feels like a do-over. I can't imagine how anyone wouldn't be offended.", "I'm surprised the affair partner was ok with naming her child after OP.", "maybe they’re just a really good daughter? or perhaps even an asshole?", "My dad and uncle have the same first name (culture and religion importance) but they both go by their unique middle names because it's an incredibly common one.\n\nThis though is like a Greek myth, (Zeus naming Hercules after Hera so she wouldn't hate him) didn't work then and doesn't work now. NTA", "My wife’s aunt met a girl in kindergarten with her exact name, first and last name. \n\nThat other kindergartener was her sister. Her dad had knocked up another woman in town named both of them the same name. \n\nThis was in Appalachia, so not exactly shocking.", "George Foreman.", "George Forman does", "My grandmother and her sisters all had the same first name and then their middle name that they went by. It was for cultural/religious reasons.", "I knew two kids named Moses in high school who turned out to be half siblings. They were roughly 6 months apart in age and lived not too far from each other. I still wonder why they named the second one Moses, like dad definitely knew Moses 1 was his, why name the other also Moses?", "Maria Theresa of Austria.\n\nShe had 11 daughters named Maria, but everyone called them by their middle names (ex: her more famous daughter, Maria Antonia is better known as Marie Antoinette).", "my grandpa named his daughter and his secret love child the same name so he wouldn’t confuse them. they’re also the same age. no one knew about her until they were 35ish", "Fucking exactly.\n\nI am my mom’s “affair baby” (as much as I hate that term). Guess who I’m not named after? Literally any of my siblings cause that would make an already fucked up situation way way worse.\n\nOP, absolutely NTA—and thank you for clarifying that you don’t blame the kiddo. People like her (and me!) need more people like you", "Yes", "how is that bad? such an overreaction and kinda selfish on OP’s behalf to be offended that someone shares their name and unwilling to accept their stepsister for simply having the same name? OP is being weird and offended for no reason", "My maternal grandfather had a little brother named Patrick Richard. Pat died in infancy (or he was a stillbirth, I can’t remember) and their next child was named Patrick Joseph.", "I assume he might have also done it so he didnt accidentally call OP the wrong name and out himself prior to them knowing about her", "Im honestly suprised OP even has contact with her dad. If it was me, i would have been done the moment he decided to he named his new child the same as his other, would be enough for me", "No", "You're correct but linguistic correctness doesn't help answer OP's question.", "My mom doesn't want me to change my name, she thinks it's only fair that my half sister does", "Nope", "Yeah, because we all know it's the younger sister's fault that their dad is a horrid person.", "She is I made a mistake while typing 🙂", "She’s definitely a affair baby. Her dad cheated on the mum. She may be just a baby but she still was the result of an affair", "She was born out of an affair, that means yes, she is an affair baby. She’s OP’s half sister and her dad’s affair baby at the same time. Those two things aren’t mutually exclusive.", "Half sister", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Maybe even get the mom's input on a new first name, since she was the one who chose OP's original name.", "*last name of mothers last boyfriend before marrying OPs dad", "You can change your name on your birth certificate (at least in the US). I’m in the process of doing this now", "My birth certificate has a typo so I must always bring my ID, Birth Certificate, and birth certificate correction. \nAll because the nurse's name was spelt wrong.", "And in some states you can only do it once. So there’s no changing it again if you get married. \n\nThat may not be something OP cares about. But then again maybe it is. People have different opinions about it. So it’s worth looking up all the rules and having a solid think on it before you decide. Especially if you’re happy enough doing something simple like going by a middle name.", "Had a coworker joke about his Italian-American family, and how there were pretty much two names for all the boys. Peter or Anthony. So there was Peter, Pete, Big Pete, Little Pete, Old Pete, Fat Pete, Tony, Big Tony, Little Tony, Young Tony, Tones, Petey, etc.", "*Heracles. Hercules is his Roman name, Heracles his Greek one. Either Zeus, Hera and Heracles or Jupiter, Juno and Hercules. Sorry, my inner mythology nerd came out lol", "Oh.my. God.  That's rough. 😭", "It's so dear old dad wouldn't get confused or caught in a lie 😂😂😂", "Nooo! So the dad wasn't around? Or knew they were gonna be in the same class and just decided to see how it played out??", "I want to know why the children’s mother agrees to any of this. I have never let my husband exclusively choose the names of our kids. We agreed on them.", "Five sons and they’re all named George Edward Foreman…wtf.", "I'd like to grill him about his thinking process.", "Mary Agnes, Mary Alice, Mary Margaret, Mary Catherine and Mary Louise were sisters in my neighborhood when I was a kid.  (Went by Aggie, Allie, Maggie, Cat, and Lulu)", "NTA. Your dad is unhinged and lazy to give you both the same first name. Presumably you also share the same surname ? \n\nThis can be extremely problematic later on as your personal records could easily be mixed up.\n\nHonestly, the sheer audacity of this man to give the same name to a child that was a product of an affair and introduce the child to his other kid he’s who he named her after. To clarify both you and your sister are innocent in this and it shows such maturity on your part to not hold this against her and to treat her as the innocent party that she is in this fucked up mess. Your sperm donor… just wow…", "I have no words to describe how awful that is. You're NTA, OP. On the other hand, your father? Well, the words I have for him would get me banned. I'm disgusted by his actions. It's lower than low to name your affair baby after your legitimate child. SMDH.\n\nEdit to add: apparently, my phraseology has caused a shit storm. I meant no offense with what I said. I struggled to find the right words through the amount of pain I am in at the moment. I sincerely apologize for using an outdated and offensive turn of phrase and did mean to imply that 5he other child bore any blame. That is entirely on me and my pain-fogged brain. I acknowledge that I should have used \"half-sister\" to refer to the other child and will be more mindful of this in the future. Thank you, sincerely, for the lesson.", "Can you legally change your last name to your mother's maiden name? Make your new name that you chose be your first name and for your mom make the name she chose your middle name.", ".... What an insane thing to do. Nta", "..... is your dad George Foreman? \n\n\n\nNTA", "Your father is, at best, crazy, at worst just a horrible human being. Your reaction is entirely understandable. NTA.", "Yeah that's screwed up. NTA for wanting to change yours.", "…this is…so absurd…I’m so sorry OP! Your dad is…like what?!?\n\nIf I had the stamina to be petty for years, I’d have a serious conversation with my dad about him changing his first name to my fiancé’s name as soon as we got engaged…because, y’know. That’s what you do when someone is about to become family? They SHARE A FIRST NAME?? And if he declines I’d have full rights to go berserk since it so OBVIOUSLY means dad doesn’t like my fiancé OR respect him right? 👀 /s\n\n(Naming babies after adults from other generations is one thing but naming a half-sister the same as an existing child is just as absurd as the scenario I described above)\n\nIn real life though, sheesh. Idek! I recommend distance from your dad, a solid convo with your sister since you know she’s innocent in this, and just support your mom who I’m sure deep down has some feels about the choices she’s made, make sure she knows you love her.\n\nAnd love yourself too, by minimizing contact with your father-type person. Who thinks like that?! I can’t. I cannot. I’m so sorry, OP.", "I hate that he stole your name. I have a lot of respect for you for not taking your anger out on your sister. Your mom is an amazing woman to handle this so well. \n\nDad is the ah, no questions here.", "Your dad is a fucking nut job", "That is monumentally fucked up", "That's fucked up. Your dad needs help. How did his mistress see this as a good idea?", "Oh honey, sweetie .. you are NTA 1000' times. Never ever think that. I didnt even check the other comments to know. You have the right to have your own personality, your querks, your traits, your own name. It's different when someone totałly unknown to you shares the same name as you (FB says there are over 20 girls that have the same first and last name as me, but I'm not related to them, they are far away from me in every prospect of life)\n\nWhat your father did is unspicable, awful and truly unfatherly - English is my second language so sorry for misspelling. \n\nYou had a right to change your name officially, any other thinking adult (who is in his mind) would do the same in your shoes.\n\nBear your new name with pride and joy. Be proud of it. Make it yourself. Make it yours. \n\nIf you ever hear anything from your father about that I advise you to tell: you have a new \"your old name\" do as you wish. And just block him. He showed you that he doesn't even respect you. Cutting all ties with aweful parent at your age is so aweful, scary even. I did it myself in your exact age. But you know what? 18 years later, I still dont regret that desition. I even believe it was one of the best one I have ever made.\n\nBe you, love yourself and most importantly: advise yourself what you would advice your best friend. And be your best friend always. Even if the best friend's advice is to cut the contact. Your best friend only wants what is the best for you. Be that for yourself.\n\nI'm sending love from a stranger and wish you ałl the best op.\n\nBE YOUR OWN BEST FRIEND", "Yo wtf is your dad nuts? Like are you Mary Smith and she is also Mary Smith? Thats illegal in most countries.", "You know Carl Marx named all his daughters Jenny. Just wierd. You are not the asshole.", "NTA so much.\n\nI'm sorry you feel like you even have to ask if you are TA.  \n\nThere is every reason to think your father is emotionally abusive and even if he's not, he's  giant dick. I hope you have gotten and are continuing with therapy.", "Definitely NTA but just a theory re the naming: maybe he just named her the same as you to help hide about the affair and the other baby initially? Just so when the name comes up by mistake or overheard, people would think it was about you? I dunno. Just throwing it out there since it somehow happened to me — my cousin named his other baby (which initially his wife didn’t know about but my relatives knew about) the same name as me for that reason. But then again… at least my cousin named her after me and not his own daughter — definitely f-ed up. Hugs with consent OP!", "Wtf NTA, who does that?!", "What the actual hell. \n\nWhere's your dad, I just wanna talk to him.", "wtf?! Is your dad an idiot? This is so bizarre!", "This dude is a straight up psycho. You don’t get a restart ya dwerd. 😭 I am so sorry you are dealing with this. You don’t have to do anything you’re uncomfortable with and you’ll still not be the ahole.", "So you’d be ok having a sibling with your exact same name?  I highly doubt it. She’s not overreacting at all!", "Actually, OP stated that she's trying to work through it and accept the half sister. No unwillingness there :]\n\nThe problem for OP is that her dad was unfaithful to her mom, and then gave the baby he had with his affair partner the name given to HER by her *mother*, not her father.\n\nIt would have been even worse if the name was given after a deathbed promise; like say \"my first granddaughter, I want to be named X...\" Then the grandparent's son in law goes and applies the name to the product of their son in law's infidelity.\n\nIf you'd be fine with that scenario, you need to get your head checked out mate", "Good point", "It can help clarify the question. \n\n“You said A, but then you told a story that sounded like B. Did you mean B?” \n\nWe can guess, but it’s good to clarify.", "She is right but I highly doubt that will happen. \n\nI am sorry you have to", "Your mom has failed you, tbh, that this is what she is mad about? About the name she chose being stolen instead of your actual feelings, you have no control over your half sister’s or dad’s actions, it is not fair but nothing here it’s fair.", "I hope you can find a way to reach her with your decision, maybe approach her from a standpoint of empowering both of you rather than your father and a child (who is just as much a victim). Best wishes.", "He has 9 kids named George. I apologize, it's an old man joke.", "She's a child born via an affair. \n\nPeople first language always.\n\n\nEdit - ok, my fellow Redditors...you win. From now on, let's start back up on calling babies born out of wedlock bastards...after all, it's not an insult it is just what they are when they're born to single parents.", "People first language.\n\nHow terrible to call any child an \"affair baby.\" It's dehumanizing and just as bad as calling a child a bastard.\n\nEdit - absolutely bizarre that Reddit, the supposed home of liberalism and progressive values is suddenly against people first language.", "Nice idea! But only if she will go along with the idea. I changed my name while in college due to my family name being an unfortunate double entendre (bad enough to get obscene phone calls). I told Mom I was taking her maiden name, but she objected and forbade me from using it. (No idea why, except that Mom just didn't like anything unusual that could embarrass her with her conservative friends; she strongly resisted almost anything I wanted to do that hadn't already been done by her peers' kids.) So I took my maternal grandmother's maiden name instead, this time not telling Mom until after it was done.", "Skinny Pete, Tony Knuckles...", "My Italian-American family is the same, only with Peter and Samuel. There's 3 currently living Peters(Pete, PJ short for Peter Jr, and Petey) and 4 living Samuels(Sam, Sammy, Sambo who is actually a Samatha, and Little Sammy). I don't know why every Italian-American family has exactly two names that they latch onto, but we do.\n\nAnd yes, I am aware of the potential racist implications of one of these nicknames, I didn't pick the nickname, she's had it for nearly 60 years.", "No you're absolutely right, my phone autocorrected I think lol.", "You didn’t mention the one daughter also called georgette.", "Brooo you saying the word give made me fully lightbulb moment the last sentence of OPs post, the mom gave her the name, I think her dad named \"his\" child the name to get back at OPs mom or am I too high right now", "Moving aside the affair and all that it it weird af to give two of your children the same name. Like there has to be something wrong with him besides eccentric.", "Hear me out.. is it genius? If anyone starts gossiping he has a second daughter, hearing the name would make you think it was wrong. He could hypothetically get insurance for one daughter and have them both use it...he won't ever get caught saying the wrong name, there's probably other benefits (for him)", "To be honest, It's pretty weird to give both kids the same name, regardless of their provenance.  Yaknow, imagine \"These are my sons; jack, jack and jack\".  The parenthood doesn't really change how stupid that is.\n\nIt almost feels like he wants a do-over, I'd be more than offended in OP's position.", "This reminds of that Newhart skit: \"This is my brother Daryl, and my other brother Daryl.\"", "Oh ffs, people get their panties in a bunch over nothing. STOP APOLOGIZING TO IDIOTS.", "Wow, your edit is longer then your original comment. Maybe you should stop giving a fuck about what anonymous losers think and own your words.", "I know you mean well but “legitimate child” is a terrible phrase that should never be used as a term of reference.", "Your comment is gross.\n\n'Affair baby' and 'legitimate child'?! This isn't Game of Thrones. That 'affair baby' is a little girl.", "Sadly no, I stand to lose a lot if a change my last name but I will legally change my first name", "Nope", "Or Cotton Hill", "This is exactly where my mind went to", "This is the right take on it: Dad *stole* your name for his affair child.", "Yes, I guess it's not in mine", "not in the US, George Foreman named all his sons George\n\nfrom Wikipedia \n>Foreman has twelve children: five sons and seven daughters. His five sons are George Jr., George III (\"Monk\"), George IV (\"Big Wheel\"), George V (\"Red\"), and George VI (\"Little Joey\"). On his website, Foreman explains, \"I named all my sons George Edward Foreman so they would always have something in common. I say to them, 'If one of us goes up, then we all go up together, and if one goes down, we all go down together!'\"", "i wouldnt care. worse things in the world than someone sharing your name 🤦‍♀️🤦‍♀️", "I had to look this up. I’m from the uk and only know GF from his grill. When I heard this I thought well maybe they are called ‘George, (insert different given name), Forman’. \n\nTo be honest, there’s defiantly some narcissistic traits, calling all the boys George Edward Forman.", "Most sane progressive.", "\"I also go by George.\"", "nah dude it feels like a weird sort of power trip honestly. like “i betrayed your trust, now i’m going to make sure everyone is reminded of it”. like.. the same name? that’s so deliberate, but i cant think of any reason to do that unless you’re trying to hurt someone…\n\nNTA OP but your dad is. and so is your mom for staying with him… i’d yank my kid out of that environment so fast and say “see you later”..", "I think you’re right. This absolutely sounds like a power play of sorts. All the names in the world and you use the name your older daughter’s mother picked for her? Seems like OP’s dad really wanted to twist the knife.", "But the dad is the one who messed up, right? Or am I too high rn? 😂🤣", "Nope date of birth and social now needed each child", "I agree with this being done to make sure he doesn’t say the wrong name and get caught.", "I think you are exactly high enough rn. Or a genius. Or both. Or somehow I am high. Because this somehow makes a lot of sense to me.", "George Foreman is a huge example of naming all his boys the same name, only one of which is a Jr.", "Reminds me of Newheart- \"I'm Larry, and this is my brother Darryl, and this is my other brother Darryl.\"", "\"I'm Larry, this is my brother, Darryl, and this is my other brother, Darryl.\"\n\n...anyone who gets that is really old....😂\n\nBut yeah..the fact that this scenario was a running gag on some old 70s show, and dad here decided to make that into a real life scenario...NTA. That was incredibly disrespectful to just hand over your name, your identity to the next kid...and holy cow hows this little girl going to feel to know her dad didnt think it was worth it to come up with a name special to her....like, that is just such a cruel thing to do to both of them. Huge AH move.", "I always think of actor Anson Mount. He's Anson Adams Mount IV. He's got an older half-brother who is Anson Adams Mount III.", "Please don’t downvote: I think Dad is an AH for both having an affair, and naming the new kid the same as the old kid, but I may have idea of why he did it. \n\nSince I assume the kids live in separate homes, this way he doesn’t have to worry about calling one by the wrong name. Would be most effective for the traveling salesman with two families who don’t know about the other.", "It’s actually probably worse than that. If the child was born before he was caught, he was just making it so that he wouldn’t accidentally call OP his other kid’s name, which would be suspicious. He probably called wife and mistress by the same nicknames, too.", "I knew two brothers with the same name. There’s no catch. Same name. Completely. Full brothers.", "Yeah, but I knew an Indian family growing up and almost all of them were named George--brothers, cousins, fathers, sons. Except for one of them that was called Steve.", "Random offshoot thought from the three hypothetical three Jacks, [couldn't help of think of the Jims from Shoresy](https://youtu.be/GZ5z-p_EUts?si=_fXxdVrvz5Ghi0Bw).", "Or maybe he named them the same name so that he wouldn't make a mistake and call them the wrong name.", "I'll own my mistakes and thank those who teach me.", "not a native speaker. why is it terrible and what should be used instead?", "I apologize for causing any offense.", "So….spawn of adultery? \n\nSeriously, though, I get your point. Using the terms legitimate & illegitimate saddles the child with a label for something they had no control over. A child should not be the one labeled. It should be the parents who should bear that burden.", "I said the same and got downvoted to shit. People here are something else.", "what would you lose?? i’m not trying to be rude, i’m just curious. could you change it in the future when you’re more established, or is it not an option at all?", "How's that now? Lose in what sense?", "You don't have to legally change your last name. You just tell people how to pronounce it. Like\n\n\"Hi, I'm Smith. You spell that a-d-a-m-s.\" \n\nNo one can control how you pronounce a name.", "You should change your name to George Foreman just to make a point to your dad how weird this is. Or even better your dad’s name. Only for a bit then change it to something proper but this is how I would get my revenge.", "OP\n\nAnd Good OP", "He was an American heavy weight fighter but he made more money off grills.", "Wait, where’s the “affair” mum in all of this? And it wouldn’t be a step sibling, it would be a half sibling- same dad. Or is dad with other family? I’m so confused.\nOr too high right now. \n\nNTA \n\nbut I’d keep your original name as a middle name for your mom’s sake since the child of her husbands affair is now walking around with the full name she gave her own child.", "Yeah but in my experience the cheating parent can very much be a vindictive asshole, because they either play victim and justify it or they try to destory the person", "I’ve heard stories before (take with a grain of salt) where basically the man named the children in his second family the same names as his first family so he’d never mess up calling the kids the wrong name. \n\nIt’s kinda smart but also so fucked up. The energy spent on this “big brain idea” could’ve been spent so much better.", "And George Foreman has the excuse of being punched in the head a lot.", "Never knew that.  But then he put his full name on a grill, so \"The George Foreman Child\" isn't hugely surprising either.", "He also named one of his daughters Georgetta, despite having five sons that he all stuck with his name, he’s such a narcissist", "They do have numbers. I attended college with one of them", "not just the boys. ALL his children r named 'George'", "His daughter(s) are also named George. SMH\n\nCorrection: One of his 3 daughters is named Georgette. His sons are George Jr, III, & IV.", "Fourth Bruce: 'Ow are you, Bruce?\r  \n\r  \nFirst Bruce: G'day Bruce!\r  \n\r  \nFourth Bruce: Bruce.\r  \n\r  \nSecond Bruce: Hello Bruce.\r  \n\r  \nFourth Bruce: Bruce.\r  \n\r  \nThird Bruce: How are you, Bruce?\r  \n\r  \nFourth Bruce: G'day Bruce.\r  \n\r  \nFourth Bruce: Gentleman, I'd like to introduce man from Pommeyland who is joinin' us this year in the philosophy department at the University of Walamaloo.\r  \n\r  \nEverybruce: G'day!\r  \n\r  \nMichael: Hello.\r  \n\r  \nFourth Bruce: Michael Baldwin, Bruce. Michael Baldwin, Bruce. Michael Baldwin, Bruce.\r  \n\r  \nFirst Bruce: Is your name not Bruce?\r  \n\r  \nMichael: No, it's Michael.\r  \n\r  \nSecond Bruce: That's going to cause a little confusion.\r  \n\r  \nThird Bruce: Mind if we call you 'Bruce' to keep it clear?", "agree other than Newhart was 80s lol.", "I get it. Am old.", "I get it. :( I guess I am really old, 58", "Wow. wtf.", "Good idea. Maybe he should also rename his mistress to his wife's name....😅", "It could also be that it was not his decision even. Perhaps the other lady wanted to name the child after someone in her family,  coincidentally the same as OP.", "Holy crap that is brilliant. Never thought of that! And I haven’t thought about those awful traveling salesmen from back in the day. How many families destroyed……", "There's being named after someone and then there's your dad naming his affair baby the same name as them ,I'd freak out if my father pulled that bs . He's lucky all she did was change her name.", "It’s not a mistake. “Legitimate” is the way you refer to kids born from two parents who are married, and has been for centuries. “Illegitimate” is the way you refer to kids born from two parents who are not married, and has been for centuries. “Affair baby” is slang but very commonly used. \n\nThere is no need to apologize for any of it because a few people (who are being heavily downvoted, btw) objected.", "Your mistakes? What did you even say dude?\n\nEdit: All this over referring to an affair baby as not being \"legitimate\"? Stay pathetic reddit.", "It's not, it's just a holdover from religion/marriage and the olden times when things like land claims existed and mattered. I wouldn't worry too much about it's use tbh", "Half sister would be appropriate here.", "Short Explanation -\n\nIt’s common (Especially Religious/Traditional People) in the U.S. to refer to a baby born out of wedlock as Illegitimate.\n\nThis brings an entire host of issues, often these children are neglected, abused; basically they have a rough life.\n\nIt can be more common in wealthier family’s (They don’t want inheritance going to an “illegitimate” child)\n\nIt says you’re not part of the family we don’t accept you.\n\nNothing needs to be used it’s just her Father’s daughter/her half-sister.", "Wow, lots of downvotes. Anyway, the term “legitimate child” implies that children born out of wedlock or in situations like this are illegitimate. It’s derogatory to those kids who were born into a situation they had no control over.", "It is no longer considered appropriate as it attributes blame for the moral failing of the parent to the child. Like the kid didn’t cheat or do anything wrong she was a kid. She doesn’t even choose her own name, the moral failing is on the parent who stepped out on their spouse and didn’t even consider how re using his existing child’s name on a new child after divorcing her mother would make her feel. Like he’s the morally illegitimate one, not any of the kids.", "Existing child in this scenario would have been fine.", "They can downvote all they want. They're talking about a 7 year old girl like her existence should be a dirty secret.", "Trusts going out the window and such. \n\nIf you have generational wealth you're dealing with, changing a last name is essentially cutting your own arm off.", "I like this way)", "Or maybe to Consuela Bananahammock.", "Why is everyone high? Damn", "And if you're filing the paperwork for an official name change, might as well switch your surname to anything you want, too NTA", "Energy spent on an affair is energy that could’ve been spent better altogether. Spent on their actual partner. Spent on hobbies. Spent on children.", "In fairness, we do not know how many times OP's dad has been punched in the head.", "So what is the mom's excuse for letting him name them all George?", "Damn, poor girl.", "Narcissist?  The man is an efficiency expert.", "Guess that makes it easier to yell for a specific one.", "Sequential or random?", "😂🤣 Thanks for the correction!! I honestly couldnt remember if it was first run, or reruns when I was watching it! It was awhile ago...my memory is fuzzy!!! hehehe!", "That would still be his fault", "But for every family they destroyed, a new one was created /s", "True", "You have a point but also, I think those terms online are fine. The younger kid is the dad's affair baby, and the older one is \"legitimate\" (it is possible that she was born outside of wedlock too, but that doesn't matter). The people commenting here are not the kids family members and no one's disowning the kid because someone on reddit called her an affair baby", "I thought the parents of OP were still married.", "There we go with the woke shit.", "Both children exist", "Exactly!\n\nIt's about calling the 2nd child the same name as the 1st. The 2nd child was conceived as part of an affair.\n\n I'm impressed that OP agrees that it is not the child's fault and that they aren't blaming their.\n\nOP is very legitimate in feeling upset with her Dad for having an affair and naming his 2nd child the exact same first name! Like seriously, why? What arsehole behaviour. \n\nOP NTA. Dad is AH.", "Amen to that.\n\nIt's just bizarre because reddit is supposedly so liberal and progressive yet they're still totally fine with refusing to use people first language in this sort of case. I even said it's no different than when people used to call children born out of wedlock \"bastards.\" I guess they're still not grasping it, ya know?", "Princess Consuela Bananahammock", "Because it’s Friday!", "OP should change their surname to their mom’s maiden name.", "Not nearly enough, I'd guess.", "Probably, \"he punches people for a living and has a lot of head trauma.\"", "Well I was born in 81 and I remember watching first runs of it when I was little with my grandparents. Then it googled it and saw it ran 82-90. The Bob Newhart Show which was the one where he was married to Suzanne Pleshette (botched that spelling) and played a psychiatrist if I remember right. And the previous show was the inspiration for the finale of Newhart which I’m still not gonna spoil for someone who hasn’t seen a show that ended 33 years ago, but is considered one of the best endings of all time by many.", "And destroyed. Oodles of trauma going around.", "Lol okay I have been called woke in every possible way and tbh you surprised me this is a new one\n\nJust to clarify:  Saying “if a parent fucks up, it’s not the kids fault” is woke to you? Can you explain why? Like I’m not being an asshole I’m genuinely curious why you would think that. \n\nLike in my actual real life, my dad’s a massive asshole who fucks around on my mom, but that’s not something I did? And if he has some kids out there with women he is not married to - and knowing him, there are probably plenty and he’s probably ditched them all, it’s part of why I’ve never done a DNA test lord knows I don’t wanna know - I wouldn’t blame them? Like those kids didn’t choose to be my dad’s kids? How can a kid be responsible for their parents decision to be an enormous dickwad?", "Yes, it’s so “woke” to treat human beings as… human beings.", "Seriously it’s not like they called it the Bastard John Doe!", "Anyone who uses \"woke\" unironically is definitely TA", "Previously existing and previously named child.", "It's just groupthink. Most of them probably wouldn't talk about a child this way IRL.\n\nPeople see lots of upvotes, it must be true. Lots of downvotes = bad. Saves the hassle of critical thinking. \n\nThe best conversations tend to be on a comment no-one is paying attention to.\n\nDon't let them bother you. It's rarely gonna be wrong to stick up for a 7 year old.", "Or Trash Boat", "😂 I don’t take weekends off, so I didn’t piece that together", "Or too many times, but there is no in-between.", "Just saw a story of a lady whose dad went around and fathered 10 other children and she eventually got them all together. Insane", "I think they were calling you ‘woke’ for policing language when the original commenter clearly meant no harm", ">It's just groupthink. Most of them probably wouldn't talk about a child this way IRL.\n\n\nI used to think like that until I started teaching and actually started to be around parents - now I'm not sure.\n\n>People see lots of upvotes, it must be true. Lots of downvotes = bad. Saves the hassle of critical thinking. \n\nYup. \n\n>The best conversations tend to be on a comment no-one is paying attention to.\n\nNow that is the damn truth!\n\n>Don't let them bother you. \n\nMore amused in a sad way than bothered. It's just a shame how much humanity sucks.", "But I didn’t police anyone. Someone else said that the term shouldn’t be used anymore and then someone asked why and then I just answered that question.\n\nI personally think folks should use whatever language they want. I prefer it when people let me know exactly who they are so I can decide if I want them in my life or not. \n\n☮️", "You get it.", "I could swear I read this exact story a while back. \n\nNTA, anyway.", "NTA, OP.\n\nI would be pretty offended in your shoes. He named his illegitimate child after you, and your mother picked the name 1st.\n\nI would consider changing your first name and having your mother's maiden name as your last name.", "wtf who names their two kids the same name?!", "If there’s anything that men have, it’s the audacity🥴", "Yta it's just a name.", "Wow!! Ok, I’ve been through something very similar and now that I’m older I’m going to tell you something that I had to learn but didn’t understand until I was older. If your dad was there for you and loves you as a child, he didn’t cheat on you. He cheated on your mother. You actually liked your name and I identified with it before you are wrong because you’re cheating yourself out of YOUR name.  The little girl didn’t ask to be here or for the name.  Yes, your dad was weirdly wrong for giving her the same name. But, you have no idea if it was her moms idea or held significance for some other reason.  Children often don’t realize that parents are people  too, and parents had a life and a past before them.  Have you ever thought about what if your dad had a connection to the name other than your mom naming you…. Shoot in my case my dad let my mom pick my name. Initially he didn’t want it because it was his first loves name, the second time around ( my half sister) it was done as tribute because he realized that his first love was his true love.  F’d up but true. I would have never found out if my grandma hadn’t of told me.", "Posting again since OP couldn't handle the criticism and reported it to the mods. \n\n\"Forcing us to get to know each other as siblings\"\n\nI'm not saying that your dad isn't an asshole.\n\nI'm also not saying that you fell very far from the shit tree. If you have to be forced to get to know a sibling, whether they were born from an affair or not, you're an (this said something else but apparently asshole isn't as bad so maybe this one won't get removed) asshole. Maybe try being less like the parent you despise, rather than trying to emulate them. \n\nYou should honestly be ashamed of yourself, assuming this is even real and isn't a shameless attempt at a karma-grab. This is not an attack, it's a response to you seeking validation and an answer to your question. Your behavior is that of an \"asshole\", only because I'm not allowed to use words that effectively communicate that you've been worse than that.", "YTA", "[removed]", "I know a guy with a similar situation. His father had a family in another country, but he abandoned them and immigrated to Canada. He formed a new family and gave this guy I knew the same name as one of his earlier half brothers. I get the impression that his childhood was pretty messed up (his dad is dead now, he started his second family when he was pretty old).", "As someone who has legally changed my name, yes it is that easy.", "This!", "My mom grew up down the street from a family who named all of their girls Mary, but gave them different middle names (think Mary Ellen, Mary Alice, Mary Sue). They all went by their middle names. Why anyone would do that to their children astounds me.", "i used to know twins whose names were both \"Henry\". They were \"Henry Matthew\" and \"Henry Leonard\". Their older brother's name was \"Henry William\" and their father was just \"Henry [last name]\"\n\nthey were nice but very weird in that regard", "George Foreman", "George Foreman and Cotton Hill.", "Pretty common in some cultures apparently", "An AH that doesn’t want his affair baby ostracized-if she has the same name of existing child the resulting confusion will hide his cheating", "I've done some genealogy research and, almost without fail, whenever a child died (and that used to be much more common than it is nowadays) parents would give the next child of the same gender the same name. Never seen it happen when the original child was still alive though.", "Anson Mount's dad. He was also an Anson Mount.", "Lmao my mom told me that her ex named my older sister and his affair baby the same name so that he wouldn’t get their names confused", "The same sound at the end of your name? So if someone names their kid Lilo, and then names their next kid Kylo, that’s similar enough for you to think it’s a do-over baby? What about Kaylee and Rylee? I don’t get it.. that’s dumb.", "Jesus Christ, this is somehow me! My parental failure (father) had an affair while my mother was pregnant with me. The asshole gave the affair baby a name with the same sound as mine. Like, there’s only a one letter difference in our names. Also for 20 years we all thought I was the youngest. Turned out I was second to the last by two months. All cheaters should die.", "That’s not so unusual in Spain. My mother’s brother died before the younger three kids were born and the brother got the same name and the sister the female version, thankfully my mum was the youngest", "Omg you’re right lol hank and GH lol", "What a stupid take. Found the father.", "Bullshit. Parents who cheat destroy their child’s family and lives.", "It’s not one.", "Gross.", "NTA. I’m glad to hear you’re working through this so maybe you can have a relationship with your half sister but you would not be the asshole for cutting ties/being distant w your dad. \n\nNaming a second secret child the same name feels like a way he can cover his own tracks and not have to remember another kid’s name/worry about saying the wrong kid’s name", "It's possible she didn't know about OP at the time of filling out the birth certificate (I'm not defending the AP, it's just not mentioned in the original post)", "What do you mean?", "Doesn't the SS card fix that? I'd imagine it would since women have been changing their name for marriage for centuries.", "That sounds tedious. I'm European, and I don't need to do any of this hassle when proving my ID. I have changed my surname to my own, and after it got registered, I have not needed to show any papers about my birth name anywhere. My new identification papers suffice, and no one has problems with it.", "I am one as well. My mom had the audacity to say I was made out of love. In reality he cheated on his wife with my mom. They ended up getting pregnant same time! Not once but TWICE with my younger sister. I come from a small community and now it made sense why people looked at us a certain way and wondered why our dad ignored us at community events.", "They're not unwilling to accept their stepsister.  They're unwilling to share the same name.", "Wait, Appalachia, probably a small town, how did he keep them separated until kindergarten?", "Is it Muhammad?", "Hot backup", "Maybe to keep the name straight so he doesn’t get caught. Or maybe everyone already knew?", "Your dad is a major ahole.", "Just FYI, aside from the emotional issues, having the same name as someone in your immediate family can be a source of legal and financial trouble. People get the other person's debts, tickets, warrants, etc. all the time. It shouldn't be that way... and yet, here we are.\n\nYou can't really force your sister to change her name (or your parents to change her name), so you might as well change what you have control over. I would absolutely not keep the original name.", "More like Dittany, Brittany and Litany.  Half/more than half of the name.  Plus they married other people and never spoke again, so it was even weirder that they both did that.", "Info: This is going to seem facetious, but real question: \n\nHas your dad been evaluated by a psychiatrist? Because he sounds utterly insane. \n\nHe’s upset you don’t respect a 7 year old. A 7 year old that happens to be his affair child that he’s bringing around his family. And, oh, yeah. A 7 YEAR OLD WHO HE THOUGHT SHOULD HAVE THE SAME NAME AS HIS FIRST CHILD. \n\nWTAF? Seriously. That’s beyond the pale. Way beyond. \n\nNTA, but your dad needs to be evaluated. No sane human would do that.", "If you want a little chuckle about a similar situation, here's [Kathleen Madigan](https://youtu.be/jWdfh3RWBcE?t=173)", "Also, you know what else is gross? Dismissing someone else's opinion without any reasoning. It comes off as extremely ignorant and biased. Have a good one though, OP. Literally everyone with a brain knows you can make a second (or third, etc) account to push your opinions without actually justifying them. Disgusting.", "Not as gross as the behavior that OP exhibited and described in this post. Honestly, I'd use disgusting to describe that. And that's being nice and following the sub rules.", "I hope the affair partner didn’t know. I mean OP’s dad thinking this is acceptable is bad enough, but two adults deciding to name their kid after the kid’s half sibling would make me feel really sad for them with two parents like that.", "i’ve deduced it’s highly possible for OP to simply be such an asshole, that the father simply wanted to “restart” their relationship in a sense. thus the same name etc", "This is the winner right here.", "Why do they care about the spelling of the nurse’s name? Are they fact checking it that much?", "Mine doesn't have a name at all, it's getting to be a bit inconvenient now", "Yup I changed mine in high school. The entire process sucked such major ass I'll never do it again, but it's all painless now and my birth certificate is updated to keep it that way. The only bump in the road is not being able to skip the \"have you ever been known under a previous name\" question.", "All good points! (I got downvoted for offering legitimate information. Crazy people of Reddit!)", "My paternal family had the same for 3 generations - Pop, Big David, and Little David! Little David is not so little anymore and has named his kids Alison, Andrew, and Anthony so the \"first son is named David line\" is broken.", "Irish Catholic?", "I want to know where the mother of this little girl is in all this? Why did she agree to this?", "Just to let you know, it's pretty offensive to both donor conceived people and sperm donors to refer to a deadbeat or bad father as a sperm donor. Real sperm donors are generally happy to know their biological children, unlike deadbeats. Being donor conceived is not the same thing as having a bad parent.", "I had no idea that illegitimate was offensive… I always thought it a purely legal term since there is a vulgar word for being born out of wedlock. But then I didn’t know this word was anything other than a nice way of saying the Bword.\nI have a half sister who has a different dad. I have known and called her both. \n\nFor reference… I am not looking down on anyone. I was also born out of wedlock and would be the last person to ever think less of a person based on their origins. I cannot say I would not resent the half sister if I were in ops place though. I would struggle with her being there much less shared my name.  Op is clearly a very loving person. \n\nI agree with you too that dad is the ahole and what he has done is… well, I don’t want to offend sick folks by calling it sick. Creepy? Dunno, but It needs a special word. I also have brain fog so it will take me time to find a better word. lol", "I’m fine with affair baby", "It's not bad at all", "It's painfully obvious that you didn't mean any harm by calling the children those words and kind of misspoke. It's those attacking you for it who should be ashamed of themselves. People are so obsessed with the holier-than-thou approach these days. This lengthy apology looks excessive.", "Or the mum was just mentally beaten down by a wanker of a husband for over 20 years and will accept anything his does.", "You think a mistress has good ideas.\n\nIf they had a good idea they would be married themselves and not fucking with a man that's wedlocked.", "That's blatantly false. Can you back that up with any sources?", "Not all of them, but definitely at least 2. He also had an Eleanor and a Laura.", "lol sure bud. Whatever you say, affair dad.", "I wouldn’t classify you as any better.", "I actually love my maternal maternal great grandmother's maiden name: Powers. It's the only one that speaks to me that I know of.", "Well, it would make it look like you were born out of wedlock and/or she didn't know who the father is. Conservatives would have a field day with that.\n\nSo I guess I get her stance.\n\nDoesn't make it right, though.", "AITA roulette is fun. You never know when the exact same opinion will get a hundred upvotes or downvote you to oblivion. \n\nGood thing I was never cool or popular in school so I never learned appropriate levels of caring what people think of me! This is probably the only place that’s helpful …", "Are you… Are you OPs dad?", "You got it one!", "I wish I were high too. It's been too long. So sad.", "My dad will cycle thru every other daughter, our mom's name & the pets name before he lands on the correct one. For all of us. Just yesterday he kept calling me \"cat\" (not the cat's name, just cat) because his brain wouldn't supply my name. Good thing we know he loves, cares & cherishes us by his actions His brain just hates names. 😹", "Best guess: she had no idea until it was too late", "It's not weird that they both have the same name, its devious. It will be so the dad didn't accidentally call one of his daughters by the other ones name before his affair was discovered.\n\nOP, NTA,  it's a shame you had to change your name, especially as your mum chose it, but it is understandable.", "I’ve seen it happen not bc they want a do over, but rather bc they don’t want to call their kids by the wrong names. By giving his two daughters the same name, his family would’ve never found out about the second daughter until he made it known.", "I know someone who has 3 sons named George and one named fucking Chad 🤣🤣🤣", "I had a neighbor do this. Named all his kids Michael after himself. So there was Mike, Mikey, and Michael.", "My ex husband and his best frenemy did the same.  They each have 2 sons, and both sons have their father's name. My son is the younger son, and it was a huge argument even in the delivery room. They kicked him out of the hospital because he made my blood pressure skyrocket, over a name. My ex was also physically abusive, so I gave in in the end but gave my son a different middle name. He was angry about that too, but oh well.", "My mom knew a family who all had same names. Dad, mom and their 2 kids. 😂 They were supposedly weird.", "I am getting less do-over vibes and more lazy and would probably say the wrong name while trying to hide affair.", "My uncle did it.  Two sons with the same first and last name.  We found out when the outside child became a prominent politician.", "It happens.  My first husband (and his bio brother) was removed from his parent’s home due to drugs/ abuse.  He was eventually adopted and given his adoptive family’s surname.  But his bio father had more sons and named them the same names as the sons he let go.", "All it means is that you can't inherit your father's titles.", "I forget if it was Ann Landers or Dear Abby who said this\n\n\"there are not illegitimate children.  Just illegitimate parents.\"", "This is your own opinion based on your own egotistical perspective and discomfort in the word. If you are an illegitimate child then you can speak. If not, stfu and stop giving your perspective on something you have no right to speak for. And if you are an illegitimate child, then sure you can speak for yourself and what you want to identify as but you cannot speak for other illegitimate children and how they identify. It is you who is uncomfortable  with the word and pushing that perspective on others. That’s why you’re downvoted and that’s why you’re an egotistical fool.", "Going on a limb to say it’s bc of Caste? Super sorry you are being emotionally manipulated this way.", "Or change your middle name and go by that as your name.\n\nIe:\n\nHe named you Virginia Elizabeth K.\n\nYou change it to Virginia NAMEOFYOURCHOICE K.\n\nLegally go by V. NAMEOFYOURCHOICE K.\n\nNo one can argue with that. Its your name.", "To use again. That part what's wrong there. Also his affair and association with it, all the pain now intertwined with the name. Let's keep child out of it.", "That is both very sad and very possible.", "He also named a daughter Georgetta", "So he just make their family (second?) name longer. Their have non-official names as we could see, that look like a dog names also :/", "At least I can admit I'm an asshole.", "im a girl so that’s impossible", "My father did the same thing with me and my half-sister. We’ve both got the same first names. We’re both within a couple months of age though, so he was probably trying not to get caught by calling me (his wife’s child) by the wrong name.", "It can also be an attachment thing, to help bond with the child/children. Also a reason why twins often have similar names.", "My family had a falling out among the older generations and there were lots of cousins who lived in town that I didn't know. \n\nI had my son and named him something I thought was unique, but wouldn't get his ass kicked at school. \n\nOne year later a cousin also had a son. He named his son the same first name and middle initial as mine (same last name, too). The baby was also born in the same month as my son. \n\nI didn't even know it until I requested vaccination records from the pediatrician and the office sent me the wrong one. \n\nThe whole town only has 17k people.", "That's exactly what I was thinking also", "In other words, dad is definitely the AH but also too lazy to learn a new name. SMH", "I saw a couple of posts several years ago where the husband wanted the baby to have the same name as his affair partner - in case he messed up.   \n\nHis wife would think he was talking about their daughter.", "Yup! This is also why men call women, babe, sweetheart, or other endearments. It’s not always sweet words it’s because they don’t remember your name", "Not to be confused with Anson Williams. (Potsie from Happy Days for all you youngins' ;-)", "From Crossroads??", "Same, but they're identical twins lol. And their dad's name is also the same.\n\nThey're from El Salvador, and it's apparently more common there.", "this sounds like a scott pilgrim reverse thing. Steve VS his attempts to get family approval.", "Your family could stop providing things now and in the future if it upsets them. Have to balance that with the discomfort of the current name.", "At least George Foreman has the excuse of being repeatedly punched in the head.", "He made more money *licensing his name to be used on grills*.", "Well, yeah, assholes do tend to go around bullying people.", "Or so you claim to be 🤔", "Christ on ice :( I’m so sorry!\n\nHow are there MULTIPLE PEOPLE in this world who have thought this was a reasonable thing to do? ☹️🫶🏾\n\nETA: if a parent has the capacity to view the name of their child as a tool to hide their shitty actions …my god, there’s so much to unpack there. Blast radius of that selfish action is WIDE, bruh :( sheesh", "Watch as My George Forman child makes a sandwich with my George Forman Grill to give to my George Forman Child!", "To be fair those grills are amazing, and they double as a sandwich toaster / panini press.", "Georgina and Georgiana were in easy reach, but no.", "Naw, it's just easier to remember who he wants to yell for if they all have the same name. **See:** *punched in the head*, above", "I read that he didn't know who his father was and wanted his boys to be sure they knew. 5 sons and 2 grandsons named George Foreman", "Natalia, Leola, Freeda, Michi, Isabella, and Courtney are not named George.", "He has 7 daughters and 5 sons. All five sons are named George and only one of his daughters is named Georgetta.", "He also had a daughter named Michi, I went to school with her", "Is that true?  None of the sets of twins I know have similar names.  One pair does have an older brother named George,  though.", "I have the most common female name in america. A super common middle name but a very uncommon last name.  I still share my exact name and birth date with one and another off by one month. Same year and day. Same hospital. I never went to school with them or met them, but RETURN YOUR LIBRARY BOOKS! I shouldn't have to drag my ssn out to be able to check a book out!", "With all those identical, typical ID points (full name, birthplace, month/year), you might want to consider adding a middle name to your child (no joke).  If the other kid ends up being, shall we say, a less than upstanding person it might cause no end of grief for your kid.  And you’ve just had a taste of potential issues (health records) even if the other one is good as gold.", "Nooo..dont frown cause youre old...be happy cause youre old enough to remember the classics!!!  That was legit a great show too...", "My father-in-law’s first and second wife both had the same first name, so just saying…", "Yep!", "Illegitimate is also possibly the nicest/most clinical way to refer to a child born from an affair. Sheesh it's not like they called the little kid a bastard.", "Oh yes, I suppose father's daughter or half sister would make sense. Thanks for explaining!", "Ahhh.. thanks for the clarification. I suppose it's the same here. We used to use \"anak haram\", which is illegal(?) child, then \"anak luar nikah\" which is child outside of marriage. Not sure if there's a softer term out there in Malay, though.", "the hell is that supposed to mean???", "I feel like at this point, human reactions have been charted enough for us to see that this weird combination of total narcissist patriarchal relationship and good old Texas chainsaw massacre harebrained thinkin' HAS to be pretty common anywhere men can get away with this, and that people are pretty stupid.", "I'm not sure whether he's been punched in the head too often or not enough. Either way, it's not the exact right amount of head punches. If he's had too many, I say we keep going at this point and see if we can't somehow circle back around.\n\nNTA, OP.", "Time to switch from punching him in the head to kicking him in the balls! Just to be safe", "I feel like the amount is directly proportional to the wow level of his behavior. And this one story is pretty high on the wow level", "OP's dad should have been punched somewhere lower.", "It’s green and has an old white guy on it", "I think that George Foreman loves his kids very much.", "She knows how hard he can hit?", "You've GOT it, by George!", "Or making bacon for breakfast in bed, if you don't have a butler.", "Or Georgia", "It is also easier for the kids to ignore.   \" thought you meant the OTHER George!\"", "I believe sequential, but ya know, I never asked and George Foreman the 1st is weird enough to just give them random numbers", "George Foreman 3.14?", "I was in a wreck (not my fault) and the other party was no longer at the scene but left their info... The officer took an extraordinarily long time running my info. When she came back she said she had to double check my info multiple times because there was apparently someone with my same first and last name with a warrant out for their arrest. Apparently our birthdays or SSNs were also quite similar. I'm glad I have a common name which is probably why the officer checked so closely. If it was a unique name assumptions may have been made. 🤣", "I am happy :). I love life and am glad I remember that show.\nAge doesn't bother me at all. Thanks for the uplift!!!", "My father’s 1st, 3rd and 4th wives all had the same name… and his 2nd and 6th were the same woman too…", "My sister divorced one guy and married the second guy with the same first and last name lol", "Dude, my ex boyfriend had 3 ex-girlfriends with my same name lol! It was weird af. It's not even a common name!", "That was not by choice.  OP’s father had input into the half-sister’s name.", "Yeah it doesnt reduce the fathers assholeness, it just means his wife has achieved equivalency", "I assumed that’s what they said based on the backlash", "Ok I missed on that, but the point still is the second kid didn’t choose her life. It’s totally Fed up that the dad did what he did, and I feel so awful for OP. But the half sister also did not chose to be in her situation either. She’s just a kid who happens to have a terrible dad.", "It’s you and /u/wwphildunphydo that decided the word is offensive. You are speaking for your own feelings rather than those of people actually affected by this. You’re like white people who get offended at people dressing with ethnic clothing, calling it racial appropriation, while the actual people embrace it. It’s your attitude and immediate assumption that the commenter is being derogatory or insulting by using a well known and well accepted term. Don’t speak for others and stop getting offended for others. It’s not groupthink, it’s not about that. It’s about YOU and YOUR ego, thinking you have a say in any of this. Unless you are a child of an affair, you have no right to speak and your opinion is invalid. Even then, you can only speak for yourself and your own identity and NOT for others. \n\nYou are downvoted for your ego. Not your opinion. Not your perspective. Your ego.", "☹️\n\nETA: you are right I’m just sad about it at the moment…the truth will set me free but not before pissing me off, ugh", "Keep her first name and change her last name, maybe she can learn to not hate her own name. It’s not her faults or the other child’s the dad is an AH.", "If needed, I volunteer as tribute to carry out this sacred duty.", "Exactly what I was thinking.", "At least then he won’t be able to have a third", "They all have nicknames.", "I suppose one could stuff some pie in a George Foreman grill.", "Sure it was by choice. FIL decided who he wanted to marry.", "The other woman is not a \"wife\".", "And hey, love your user name.", "Crap Bag", "And you have my axe!", "I'm going with the latter", "You can’t help the names of who you fall in love with, but a baby’s name is a choice.", "The two of you are group thinking each other in the most obviously ironic way I’ve ever seen on Reddit. Literally justifying each others ego while being completely blind as to why every other human is downvoting you. It’s not a redditor thing, behind every redditor is an actual human with real perspectives and guess what, we all think you two are ridiculously egotistical hence the downvotes.", "Thank you! 😊"]}