{"id": 34472, "submission_id": "1900doj", "title": "AITA for not allowing my injured brother to use my pull-up bar", "selftext": "Hello, I (15M) find myself in a bit of a dilemma and could use some perspective. About a month ago, my brother (17M) broke his arm and needed surgery, leading to a checklist from the doctor that included using a pull-up bar for his therapy at home. Here's where the family drama kicks in.\n\nQuick background: I've had serious privacy issues with my mother and brother throughout my life. They would frequently enter my room, mess with my things, and essentially claim ownership of my belongings without my consent. To combat this, I decided to install a lock on my closet door, where I store valuables like Halloween candy, exercise equipment, and various hobbies. They don't even need half the things in my room. They enter mainly because of boredom, and this resulted in my 1200 dollar telescope's focuser being broken because my brother was fiddling with it.\n\nNow, when my mother discovered the pull-up bar was recommended for my brother's therapy, she demanded access to my locked closet. When I refused, explaining the lock was precisely to prevent such intrusions, the situation escalated. She argued that my brother needed it, while I stood my ground, insisting it wasn't happening due to their history of not respecting my boundaries.\n\nLater that day, the conflict intensified as my mother returned, again demanding access. I held firm, stating it was their fault for the lock in the first place. This led to a family argument, with my father supporting my perspective, while my mother and brother accused me of being selfish and claimed families should work together. I CLAIMED THAT FAMILIES SHOULD WORK TOGETHER AS WELL, but it's just my mother and brother who make this so difficult, and I said some things that would have been better just not being spoken.\n\nThis went back and forth for like a week, and I was planning to stay firm where I stood. But the more I thought about it, the more I thought about whether I was in the wrong or not.\n\nI've kept these emotions from everyone else, and to have them bottled up like that for so long makes it very difficult to not speak out loud. I'm just tired of all of this and want to hear what others have to say. So, AITA for not allowing my injured brother to use my pull-up bar, given the privacy issues and the lock I installed for my own sense of security? The action in question is my refusal to grant access to the pull-up bar, which might make me seem selfish, especially considering my brother's injury and therapy needs. I genuinely feel torn and could use some outside opinions.\n\nEdit for context: Yes, the bar was purchased as a gift from my father for my birthday, is drilled, glued into place and used daily. No, I cannot move or adjust the bars height due to it being glued and drilled. Additionally, I've allowed my brother into my closet in the past for \"needing something\" but that resulted in the telescope's focuser breaking", "created_utc": 1704548992, "permalink": "/r/AmItheAsshole/comments/1900doj/aita_for_not_allowing_my_injured_brother_to_use/", "score": 30, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1.) the action I took was not letting my injured brother use my pullup bar\n2.) my brother is injured and needs it and I am depriving him of help\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - a family that can afford a $1200 telescope for a teen can afford a $30 pull-up bar for the privacy-invader. Also, I'm guessing mom and bro are allowed privacy/their own stuff, but clearly OP isn't.", "INFO \n\nWhy does it have to be your pull up bar?\n\nIf it's that important fit one in his room.", "Info: Did you buy the pull-up bar yourself, or did your parents buy it for you?", "NTA It's weird that her response to your brother needing a piece of equipment for his rehab to be, \"Great! He can just go in OP's closet multiple times a day to use the one OP has.\"\n\nAsk your dad to get brother his own, to install in a different closet.", "They can buy their own blessed bar .A week has gone by and they are still trying to use your bar ? They are not that expensive.Aldis may even have them on sale now .NTA.", "NTA- they can surely get him his own bar for his rehab", "Nta. They played a stupid game in the past by invading, now they will the prize for it. Especially since op let the brother in his closet one time and he broke a very expensive object of his. So stand your ground OP!", "I’m going with YTA for two reasons.\n\n1. You could have taken the bar from your closet and re-locked it. Brother gets pull-up bar, you keep your privacy. Everyone wins.\n\n2. It’s not your house. While I do believe that everyone is entitled to some privacy, your parents would have been completely within their rights to come in and physically remove the door from the closet. After all, it’s their house.", "They don't need access to your closet. They just need the pull up bar, which you could just leave out. While I understand having the lock, not letting him use this seems unreasonable. YTA", "YTA. \n\nI understand your frustration about family members not respecting boundaries or property and damaging your stuff.\n\nHowever, your brother needs the pull-up bar for his rehabilitation. Why make your father buy him a new one when you could just install it somewhere in the common areas of your house so both of you can use it?", "Just take out the pull up bar and let him use it. Lock everything else in the closet. And write an contract or get any kind of proven agreement that if brother or/and mother were to break the pull up bar (how he now would do that, but just in case) they would have to buy u a new one.", "YTA;. Just let them use the pull up bar and move on. you are the drama in this instance.", "YTA- it’s a pull up bar, it’s clearly not being used in your closet. Just give it up and if he breaks it demand a newer, better one. Why does someone with a broken arm, who had surgery a month ago, need a pull up bar anyway?\n\nYes privacy should be respected, and it sucks your telescope was broken, but was it replaced or fixed?\n\nAnd you’re 15, you shouldn’t need to hoard Halloween candy. Go to the store and get candy whenever you want.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\rHello, I (15M) find myself in a bit of a dilemma and could use some perspective. About a month ago, my brother (17M) broke his arm and needed surgery, leading to a checklist from the doctor that included using a pull-up bar for his therapy at home. Here's where the family drama kicks in.\r  \n\r  \nQuick background: I've had serious privacy issues with my mother and brother throughout my life. They would frequently enter my room, mess with my things, and essentially claim ownership of my belongings without my consent. To combat this, I decided to install a lock on my closet door, where I store valuables like Halloween candy, exercise equipment, and various hobbies. They don't even need half the things in my room. They enter mainly because of boredom, and this resulted in my 1200 dollar telescope's focuser being broken because my brother was fiddling with it.\r  \n\r  \nNow, when my mother discovered the pull-up bar was recommended for my brother's therapy, she demanded access to my locked closet. When I refused, explaining the lock was precisely to prevent such intrusions, the situation escalated. She argued that my brother needed it, while I stood my ground, insisting it wasn't happening due to their history of not respecting my boundaries.\r  \n\r  \nLater that day, the conflict intensified as my mother returned, again demanding access. I held firm, stating it was their fault for the lock in the first place. This led to a family argument, with my father supporting my perspective, while my mother and brother accused me of being selfish and claimed families should work together. I CLAIMED THAT FAMILIES SHOULD WORK TOGETHER AS WELL, but it's just my mother and brother who make this so difficult, and I said some things that would have been better just not being spoken.\r  \n\r  \nThis went back and forth for like a week, and I was planning to stay firm where I stood. But the more I thought about it, the more I thought about whether I was in the wrong or not.\r  \n\r  \nI've kept these emotions from everyone else, and to have them bottled up like that for so long makes it very difficult to not speak out loud. I'm just tired of all of this and want to hear what others have to say. So, AITA for not allowing my injured brother to use my pull-up bar, given the privacy issues and the lock I installed for my own sense of security? The action in question is my refusal to grant access to the pull-up bar, which might make me seem selfish, especially considering my brother's injury and therapy needs. I genuinely feel torn and could use some outside opinions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "We have no idea who paid for anything.", "Not to mention the 3rd or 4th bedroom of the house has a large walk in closet.\n\nThey can clearly purchase a second pull up bar, they're using this to defeat OP's new security protocols and resume their hobby of ruining his shit.\n\nNTA", "the bar was a gift from my father, they don't want to buy a new one", "my father made the perchace", "Idk about that they aren’t exactly broke and can just buy a pull-up bar for 50 or less which makes all these arguments pointless ESH", "father paid for bar and half the telescope as separate gifts. i paid for the other half of the scope.", "NTA - You said that your father supports you locking your stuff up, and he bought the pull-up bar for you specifically.", "Can your family afford to buy another pull up bar? How regularly do you use yours?"]}