{"id": 34482, "submission_id": "1906abk", "title": "WIBTA if I kicked my daughters homeless friend out of my house?", "selftext": "I a 35f have a daughter 16f. About a year back she brought her friend over because her mom kicked her out lets call her Zara. Now she hasn't really done anything wrong this past year until now. I find having a hard time punishing her or holder her accountable because she is not my actual daughter and I don't want to make thinks weird.\n\nMy phone charger went missing, and it keeps randomly appearing then moving. I've asked everyone where it is and no one knows so after two weeks of not being able to charge my phone consistently I went into my daughters room. Zara and my daughter share a room, and while searching I found alcohol. I don't know what to do? I know it's A's, because I found it on her side.\n\nZara takes school online and doesn't really have friends, she's already house kept. So I don't know about anyway of punishing her. I've heard from my daughter that Zara has found other accommodations but still chose to stay with us. I don't really want to kick her out. Maybe if I say if it happens again I will?\n\nIf this was my child this would be competently different. So if making threats would be bad what should I do so this completely stops? I don't want to got to extreme measures and my son says he listens to a lot of reddit so maybe you can help.\n\nEdit: I just weed pen in her room as well, I’m from the USA aswell \n\nEdit2: Hello All thank you for your input. I talked to her and I’m giving her three months to make better choices and if not I’ll decide later if she has to move out. I’m going to talk to my daughter as well. For now it’s settled.", "created_utc": 1704565259, "permalink": "/r/AmItheAsshole/comments/1906abk/wibta_if_i_kicked_my_daughters_homeless_friend/", "score": 154, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I don't believe I would be the asshole because she could be introducing drugs into my house. I could be the asshole for going to the extreme.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You need to have a confrontation/conversation with Zara about laying down the ground rules (it might be easier for you to write down your talking points first).  You might even include your daughter in the confrontation/conversation.  And as part of laying down the ground rules, lay out the consequences for violating them.\n\nNip this in the bud before she tries to test the boundaries with something worse.\n\nGood luck.", "You essentially adopted a teen. Either be their parent or their landlord. You are not in a passive role here.", "INFO: If this was your daughter, what would you do?", "YWNBTA - your house, your rules.\n\nThat being said...I would be careful to assume these things belong to one person just because they're on her side of the room. For all you know, they could be getting placed there on purpose - if you're going to have a conversation about it with Zara (which I think you do) it's worth having one with your daughter as well so that they both know what is/isn't tolerated in your home.", "YTA idk why you’re assuming so many things here…it could very well be your daughters. just have a conversation about it", "YWNBTA – your house, your rules. You're being extremely generous letting this girl stay with you and she brought alcohol into your house (presumably underage, although I'm not sure where you live) and could be a bad influence on your daughter.\n\nI think you'd be right to confront them about the alcohol, and make it clear that if she breaks any more of your rules then she's gotta kick bricks.", "NTA, but I doubt your daughter is innocent in all of this, unless your daughters phone takes a different charger how do you know she hasn't been taking yours, if they share a room then how do you know that the alcohol and the weed pen is only Zara's, just because you found alcohol on Zara's side doesn't mean that it isn't your daughters and that she hasn't drunk any of it as well.\n\nHave you questioned your daughter regarding the charger, alcohol and weed pen?.", "INFO\n\nIs Zara a minor? Why are you not calling CPS if that's the case?", "You could be opening yourself up to a whole host of legal issues continuing to let her stay. Since she is a minor, you need to call CPS. At the very least get listed as her “official” guardian/foster parent if you choose to let her stay. \n\nThere are also a host of supports for foster teens she doesn’t have access to right now, there is often help transitioning to adult life when they turn 18 and in many states free or very discounted tuition at public universities. Have you thought about what happens when she turns 18? Will you continue to support her? \n\nShe also likely needs counseling to work through whatever situation she had with her parents that resulted in them abandoning her and that abandonment itself (source: I was abandoned by my parents as a teen). CPS can help you figure this out too. CPS is no longer the bogeyman it used to be; there are resources this girl should have access to regardless if you are there to support her.", "YWNBTA\n\nYou are not the official foster parent and I imagine this opens up a huge can of worms.", "YWNBTA You are a host to this girl, and the host in any circumstances can decide when a stay has been overextended. I'd be more concerned about your daughter's lack of a social life and homeschooling versus the drinking. Every teen tries alcohol that's par for the course, but not having friends or a social outlet that's more concerning.", "YWNBTA If you tell her that if she does any of this ever again, she can be greeting the door.", "YWNBTA She is probably just being a teenager, and if you give her shit she will know you care and feel more part of the family or whatever. If I had another kid move in with us, they would have the same rules to follow.", "NTA you probably need to sit the girl down and explain rules though.", "Have you tried sitting both diwn and having a house rules convo or are you really punishing her fkr taking a cord?", "I think this is a bit of a tough one. On one hand this kicked off over a missing phone charger.....that seems a bit petty. And the other infractions seem like normal teen shit that requires parenting, kinda normal stuff. On the other hand though, you took in this teen that needed a home, this definitely deserves respect and it is your house and therefore your rules, period.\n\nIt would be completely acceptable to kick her out, however, based on your post I think that would be an over reaction. There is definitely a better course of action to try before deploying the nuclear option.\n\nI really think you need to have a conversation with both of them and simply lay out the rules and expectations you have and also explain that your rules need to be followed if they want the current living situation to continue. You don't need to be Zara's parent, you just need to be the adult, if that makes any sense.", "YWNBTA. You need to take charge of this situation. She can't just stay there without ground rules being in place and you also have to make sure to be legally in the clear with all of this (I'm assuming state to state regulations would vary, but since you're neither her parent nor her guardian you might already be in dodgy territory with her staying at your house).\n\nSo either, you make this arrangement official in some way and the rules that go for your daughter go for both of them or you tell her she needs to move on. You are the only adult in this scenario and you need to take responsibility for everything being above board, the teens wouldn't know how and wouldn't care.", "no, not her house", "YWNBTA\n\nThis situation is untenable. Over a year? No rules or punishments in place? Nothing official being done in regards to her home life and you fostering her? Her hiding the fact that she had other options on places to stay? \n\nAll of this is a mess, that I am guessing you didn't sign on for. You have been very generous but it's time for her to go.", "NTA   \n\n\nYou wouldn't be an asshole for asking her to leave, it's your house and she's sharing a room with your daughter and is bringing alcohol and drugs into her life.  \nThey're teenages and that kind of stuff is going to start showing up at some point in their lives.  \n\n\nThat said, you have a moment here to help a young woman find her way from being lost. This \"other accommodation\" could be just about anywhere and with anyone. Right now, with you at least, she is safe and in an environment where she's taken care of.  \nYou could let her go and up to her own fate or you could talk to her about it, try and help her understand why doing those things so young isn't the best move and the dangers it can put her in. It's bad enough for anyone but for someone who has no real support network, these kind of situations can put her in a real bind.\n\nShe's one bad night away from having her life flipped upside down.", "She lives in your house like your kid. Treat her like your kid if she doesn’t like it she can move. Sometimes kids need a parent that is not their parent.", "NTA. I mean I doubt just her friend is doing it, your daughter is most likely partaking as well. \n\nIf it were me I’d do what other suggested; lay down the ground rules with both of them in regards to illegal substance use in your house. For Zara it may but that if she cannot follow the rules she will have to find other accommodations. I would say I think having this conversation before kicking her out would be the more compassionate thing to do.", "She may not be your daughter, but she’s living in your house and having a direct effect on your daughter. If the stuff being on a specific side of the room is the only metric, if I was your daughter, I’d just put all my bad stuff on the other side of the room. \n\nYou should be more direct with your expectations. \n\nI think going from not maintaining any boundaries to evicting her in one fell swoop is a bit extreme. But this has festered for too long as it is. Something needs to change immediately.", "Your house , your rules. If she’s in your house, you will tell her what she can or can’t do.. no exceptions. You need to be really involved in this, and she is like your child: she’s a minor, does not contribute to anything, so you need to tell her what’s what. \n\nYou can’t let them become a “unit of 2” that do stuff secretly, etc. You have the right to inspect the room, because it’s YOURS. \n\nAlso, without her knowing, you need to get in touch with her family, so that you know what you’re dealing with.", "Talk to all the kids about the issues without mentioning names. Then if the problem continues then mention possibility of being kicked out. Also making sure she has a charger off her on.", "Both the kids are drinking so it's not just a friend problem", "You’ve done the right thing, and hats off too you, you’re very kind for taking her in like that. But, this is your house lovely!! What you have worked damned hard for!! So set your expectations and boundaries and if they are broken then make the consequences happen. Also anything that belongs to you of any value or anything you don’t wish to share, lock away in your bedroom, get a safe, and a lock on ur bedroom door!! Key on a necklace around ur neck!! Teens will overstep boundaries and push you to breaking point!! I know this because I was one once, me n my brother were little shits when we were teens… now I’m 40 years old with a nearly 13 year old… I guess my parents are like “haha! Your turn now!!” 🤣🤣🤣", "NTA. She broke your rules and possibly the law.", "If you go straight to kicking her out then yes you would be TA, but if you have a discussion that includes your child, to discuss rules and consequences regarding drinking, and Zara continues to not listen, then you wouldn't be TA. This post seems solely focused on Zara, \"if this was my child it would be completely different\" - it IS your child also, I really doubt a girl that does online school and \"has no friends\" is drinking and vaping weed in a shared room without your daughter knowing. Your daughter is also involved but you haven't mentioned that at all. I know this is not your child, but you agreed to take her in and care for her and that includes discipline.", "Is her mother paying you for her to stay? Is the child under age? Maybe get social  services involved if she doesn't  move. She seems like a bad influence  for your daughter. Wonder why Z's mom kicked her out?", "Stupidest thing I’ve ever read.", "Most of the time, when you hear about a teen who got kicked out by their oppressive asshole parents and then someone takes them in, that person pretty quickly finds out exactly why not even their own parents can handle them.  It isn't every single time, but it is rare that it isn't the case.", "For your peace of mind, it is time to sit them down, show them all the evidence, and say she needs to move on to the other accommodations. If you give them more chances, it will be hidden better, and other plans will be made. It's time to clean house. Anyone living in your house follows rules, whether your children or not, and she stays because she has it easy. Start checking for things you had put up that are valuable, because she probably went through everything while she was home alone all day. Good luck.", "I find most of the people who post in this subreddit AND most of the people who respond to it are in fact giant poo crusted assholes who simply seek to cover their scent by burying themselves in an pile of other assholes. Do with that what you will", "NTA - it’s your home. You should be requiring both daughters to have a small part time job and charge a small amount from Zara but just hang onto it for her and when she moves out on her own give it to her. Explain that if she’s under your roof, you’re responsible for her and therefore there needs to be rules and boundaries in place. You reference A’s alcohol in the post, so is A your daughter? Sit them both down and explain what you’ve found. Explain the rules you’ve now written down so that anyone can reference them anytime without there being dispute over the exact words you used for a rule. Writing communication down is best because then nobody can argue over who said what. You can do a 3 strike you’re out kinda deal, or say first offence this consequence, second offence this consequence, etc etc. I would also try to be in contact with her mother, even just a little. Just to say hey your kid is here, she can stay here if she follows my rules, but this conversation depends on what kind of person her mother is. Why was she kicked out? And if she fights back and says you’re not my parent you can’t tell me what to do then say ok find somewhere else to live. It seems pretty easy to me and the fact that you came to Reddit for this makes me feel like they walk all over you and you have no idea how to even set boundaries or punish them. Good luck!", "You were wrong to let her live in your house in the first place.", "NTA - she's not your daughter she doesn't follow rules", "YWBTA, It's never gonna completely stop, she's a teenager and will just get better at hiding the alcohol. Even if she's not your daughter, you're essentially looking after her now. If you find alcohol, just take it. There's literally nothing your daughter's friend can do about it but leave", "CPS", "YTA. A firm discussion with both her and your daughter is warranted. Set expectations and consequences.", "Zara is taking advantage of your kindness and is a potential bad influence on your daughter but I seriously doubt your daughter will see it that way. Good luck. Love you.", "Time to let her move on. You can't discipline when discipline is working. She has no respect at this point for what you've done for her. Don't blame her only for the alcohol. Your daughter is a part of it too. Expect a possible change in your daughter's behavior after this.", "She won't make better choices. She'll only find better ways of hiding it. I was this friend in high school, and if I didn't get kicked out of my buddies' places I would've never gotten my life on track. It made me wake up.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI a 35f have a daughter 16f. About a year back she brought her friend over because her mom kicked her out lets call her Z. Now she hasn't really done anything wrong this past year until now. I find having a hard time punishing her or holder her accountable because she is not my actual daughter and I don't want to make thinks weird. \n\nMy phone charger went missing, and it keeps randomly appearing then moving. I've asked everyone where it is and no one knows so after two weeks of not being able to charge my phone consistently I went into my daughters room. Z and my daughter share a room, and while searching I found alcohol. I don't know what to do? I know it's A's, because I found it on her side.\n\nZ takes school online and doesn't really have friends, she's already house kept. So I don't know about anyway of punishing her. I've heard from my daughter that Z has found other accommodations but still chose to stay with us. I don't really want to kick her out. Maybe if I say if it happens again I will?\n\nIf this was my child this would be competently different. So if making threats would be bad what should I do so this completely stops? I don't want to got to extreme measures and my son says he listens to a lot of reddit so maybe you can help.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YWNBTA but I think in  your position, I would sit down with both of them, lay out the ground rules, tell them what you found, and that it is not acceptable.  \n\nYou are acting as an unofficial foster parent here, and it's  your house, you have the right to set these rules, and the consequences if the rules are not followed.  If the rules are unacceptable to Zara, she is free to leave.", "You need to decide on have to enforce rules.", "YWNBTA. Talk to her and your daughter about potential consequences. Teenagers are often unable to recognize potential outcomes on their own. If there’s weed and liquor in your daughter’s room and the authorities catch wind of it not only could Zara AND your daughter wind up in detention, but they would both likely be removed from your home and you’d have a long and difficult process proving that you were fit to have your own daughter back. Don’t risk your own daughter’s security for someone else’s. Your daughter may be willing to help curb this behavior if she understands that it could impact her too.", "[removed]", "You are already being very generous, however you took on the responsibility of taking care of her the day you let your daughter bring her in.\n\nHave a serious conversation with her, and loop your daughter in as well.", "Hell no!", "Why would she move out? Sounds like she’s living great with you.", ">I find having a hard time punishing her or holder her accountable because she is not my actual daughter\n\nIt's your house. You make the rules. You don't need to be a parent for that dynamic. If she is living their rent free, and I'm going to guess eating your food, you absolutely have the right to set the rules. \n\nSo first of all, you WNBTA if you kick her out. It's your house. However you will also NBTA if you attempt to punish her or hold her accountable for not abiding by rules you set down as a condition of her living there.", "NTA. But have a sit down with her first, tell her your rules and encourage her to keep the peace. Hopefully she'll appreciate your kindness and behave. If she doesn't, you have no obligation to house her.", "Your house your rules. A warning now and if it happens again bye bye", "If this child is living in your home sit and explain (with your daughter there also) that you will treat her will the same respect you give your daughter but also that you expect her to to act accordingly. She will be held to the same accountability you expect from your daughter and the same the same goes for discipline actions. If you have her in your home the same expectations/responsibilities and actions must apply or she can't be there its not fair on you her or your daughter to expect different,  if she doesn't like or agree then she must find alternative Arrangements. Tell them you found the alcohol and what the appropriate punishment is so a president is set and everyone knows where they stand. \nYou are kind person to take in this child but she needs same parental actions", "NTA- you need to set boundaries. It's one thing to be kind and understanding by offering the shelter this girl, quite another to let he r do whatever she wants. She needs guidance.\n\nNot sure of the exact circumstances , but in general online school is a bad idea, and it seems especially so in this case. I would suggest getting her enrolled in public school", "Not- but 100% your daughter in involved too. This is a teaching opportunity for you, punishment might not be the answer", "You need to figure out social services in your area. What are the options and solutions. If you can afford check the layer too. Is there psychological help available either in school or through social services?\n\nThe kid can be eligible to some help. Even if you decide to kick her out one day, knowing options about emancipation or general help available would be useful. Social services do not necessary work as \"take the kid away instantly\" anymore.", "If she’s a minor living in your house you have the right to punish her. If she can’t live by your rules she is free to find other living accommodations!", "Your grammar is atrocious and your misspellings make this bad.  \nI know you have already decided what to do. So do it.", "You should speak with her parents as well, why are they kicking out a minor", "NTA.\n\nBut let's not \"kick her out.\"  This is a minor child.  So, she needs to MOVE out.\n\n1.  TALK TO HER ABOUT HER SITUATION and her ALTERNATIVES.\n\n2.  SET THE RULES - NO ALCOHOL OR WEED.  Period.\n\n3.  If she has no other options - call CPS.", "This right here.   And explain why you are disappointed in her choices, and she is taking advantage of you.", "Exactly this. I allowed a friend of my sons to come live with us. I wrote up a list of rules and expectations (same rules my kids have). The 3 of us went over them together and signed it so they both understood if the rules weren’t followed the friend had to go.", "Chances are it's also her daughter. I have a hard time believing that her daughter and her friend share a room and are friends but the daughter has no clue.\n\nTime to have coming to Jesus discussion with both of them", "Lol wtf is CPS going to do? Put her in the system for two years so she gets even more screwed up and she’s out in the same situation she’s in?", "All that does is punish the kid.  Don't ever do this", "So they what? Force her parents to take her back so she can be abused? Or so she can go be bounced around foster care and then dumped when she turns 18.", ">You could be opening yourself up to a whole host of legal issues continuing to let her stay. Since she is a minor, you need to call CPS. At the very least get listed as her “official” guardian/foster parent if you choose to let her stay.\n\nThis 100%", "this is the truth. Be an adult, set down rules and expectations. Adult substances are not allowed for either child. There will be repercussions for their use. Just as you would handle it with your own kid. The friend, you took her in and you can't just kick her out.", "Fr Op just ignores that the daughter is obviously involved with the vape and alcohol but doesn’t want to admit it", "Yeah so easy, kicked out at 15 and already hiding alcool at 16, so fk easy right?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I came to say this. No two kids live together in the same room and live completely separate lives.", "Exactly this ⬆️", "Yeah I came barely keep my self alive but if I had a friend who passed away and had kids or something I'd always take them in before letting them go into the system... So many go missing/on the streets or human trafficed it's tragic.", "Foster care gets a bad rap for some reason but it's damn good in my experience and the experience of the kids I met in the system. Generally speaking the only kids who had a bad time in the system were the ones who were completely out of control. I was in foster care from like 13-21, group homes, foster families, and finally an independent living place. It was great and I went from being completely isolated and living in a trailer with my abusive-ass mom to being middle class and fully independent pretty seamlessly.", "She's been there a year, signs point to stealing, vaping and drinking, which she would know are not allowed in that house. She had the choice to go with the rules, and didn't. Lots of kids have it hard, but she got a good chance and ignored it. I've seen worse come thru and still have a great personality and high GPA. They take the help, and work on it.", "It is just not true that in general all abused kids deserve it or caused it by their own behavior. Once it happens, their behavior worsens, sure, so I guess subsequent abuse in cycle can be somehow deserved. \n\nIt is like bullying - it can happen to anyone and once it happens it modifies your behavior so that you are more likely to become victim again.\n\nStranger care has pretty large rates of abuse - from other kids in the house, foster parents, general environment. Those kids are just more vulnerable and too much at mercy.", "My claim is. My mother, aunts and uncles went through the system. It was crooked and backwards as hell and I’m using these terms mildly. \n\nThat being said, every city, county, state is different. If your experience with it was good, then it was good. I’m happy for that. But your experience doesn’t change that so many others have some trauma associated with it. Be respectful of that.", "Well, that’s really great that that’s the experience that you had. However, that’s not the case for the vast majority", "I don't know if I'd say \"stealing.\" It seems like the girl is borrowing the phone charger to charge her own phone and forgetting to put it back in the original location. My daughter also does this and it drives me nuts but I wouldn't classify it as \"stealing.\"\n\nAlso I'm going to go against the grain here and say that a 16-year-old drinking and smoking pot is not something catastrophic that warrants her getting kicked out ... but, yeah, you need to sit down and set terms for both kids. They do better with rules and limits.", "It’s a phone charger.  Not grandmas pearls.\n\nI bet you were the type to lose their shit when their kids took the batteries out of your tv remote and put them in a gameboy.", "Yeah, nobody deserves abuse. The kids I mentioned who didn't do well in the system weren't abused by the system, they just had behavioral issues and couldn't stop acting out. In group homes they'd start fights and break the rules for no reason, in the independent living program (they basically just put us up in some regular apartments, gave us a few rules to follow, checked on us a couple times a day, and gave us groceries and transportation and such, very nice) it was basically the same shit. Wouldn't follow the rules, started fights, committed crimes, etc. The staff in every group home and independent living program I ever went to was extremely nice and the rules really weren't all that wild, and got more lax the better you behaved. \n\nIn the IL program I was in from 18-21 the staff basically just let me do whatever I wanted because I was responsible, well-behaved, and self-motivated, and they had bigger fish to fry. \nLike one of my roommates trashed our apartment, did coke on our living room table, had some older dude fresh out of prison for aggravated assault and grievous bodily harm over and was drinking 40s and smoking Black and Milds with him. That kid attacked me because he owed me $100 and didn't wanna pay, and I pressed charges. They were more concerned with trying to get the kids like that to chill the fuck out, get a job, and go to school than they were with me having my girlfriend over late. \n\nThe group homes were more strict of course but also pretty chill if you just behaved. They all had level systems. At first you couldn't really do much, just follow the schedule and hang out in the common room. But higher levels got an allowance (it was like $30/week, reasonable for a teenager) and to go out unsupervised for a few hours a day and do whatever. In every group home I stayed at I was the only kid able to behave well enough to get to max level, the staff at one of them told me nobody had gotten to max level in like 2 years before I came along lol. \n\nNot a single kid I ever met in the system had suffered abuse at the hands of a foster family, and I personally stayed with like 6 different families for varying amounts of time and they were all fine. I didn't particularly like most of them, but they weren't abusive at all, just not really compatible. And in the group homes and such, a complete disregard for the rules just meant you didn't gain any privileges, staff never got mean with anyone at all, all very professional.", "Is your claim based on literally anything?", "But she broke the rules! Not asleep by bedtime? Find a bed somewhere else!  Put the tp on the wrong way? Straight to jail.", "As someone who’s served my community for years I’ve seen it first hand in that aspect. Growing up my childhood best friends mother had foster children always and while the ones she had flourished it was a fight and they had awful histories with other families. That might be the first “success story” I’ve ever heard from foster care. I also now work closely with at risk populations and can absolutely attest that putting a kid in the system at 16 is not going to be beneficial. \n\nThanks for asking tho 😅", "Sounds like your basis for \"the vast majority\" of foster care experiences being bad is knowing the mom of one foster family. I'll definitely trust my 8 years actually in the system, meeting group home workers, social workers, foster kids, and foster families over that lol.\n\nMy primary reason for vehemently rebuking people's unfounded fear of CPS is that the trauma of being in CPS is far less than that of being in an abusive household. My mom told me all sorts of shit about CPS because they'd taken my sister before I was born and she didn't want me getting into CPS, and that combined with all the bullshit the internet and media in general spread about CPS put me off calling them. I should've called them myself years before I stumbled into their care by chance, and I strongly encourage any kid in an abusive situation to call them. As long as you can self-advocate, you can get through the system just fine and come out on top.", "Dude I know several families that are foster parents and those kids are out through hell. I'm glad you had a good time but that doesn't make you an expert.", "Sounds like your evidence is your very limited experience when the person you responded to actually spoke about working with at risk populations beyond their friend's mom who fostered kids. Maybe try to use your brain next time instead of getting your panties in a wad, cupcake.", "I spent 6 years in the system. You were extremely lucky. Like hit the jackpot lucky. \n\nI wasn't a wild out of control kid, I was a severely abused child and all that happened for me is more abuse. That's from the kids I know and  adults who survived it the norm. \n\nStop acting like your singular experience is the truth for everyone.", "So those families are abusive? Or their parents were abusive and CPS got them out and into non-abusive families?", "At risk populations =/= foster children. Dude could be working with domestic abuse survivors, the homeless, drug addicts, etc. Foster children are a very specific group, at risk population is an umbrella term.", "It's the truth for literally everyone I met lol."]}