{"id": 34514, "submission_id": "190od3a", "title": "AITA for not lying to my sister's husband?", "selftext": "Background: I (M17) live with my parents in a two-room apartment of 40 square meters. For Eastern Europe, where I live, this is a normal apartment. My sister (F24) used to live with us in the same way. My parents occupied one room, my sister the other. I was not allowed to share a room with her, so I lived in the kitchen and slept there most of the time. Two years ago my sister got married and my parents moved into her bedroom and I was given the living room where they used to live. \n\nA few days ago, her husband called me out of the blue and asked where my sister was. No one had informed me of anything, so I said I didn't know. My sister's husband asked if I was sure. Then he called me another half an hour later and asked if my sister had shown up. I was concerned and asked what was wrong. He didn't answer me anything. I started calling my sister, but she didn't answer the phone. My parents were at work and did not answer my calls either. \n\nIn the evening, when my parents came home from work, they were very angry with me. As it turned out, my sister had sent a text message to her husband that she would be with me all day, but she wasn't there. I didn't know my sister was having an affair, I hadn't been told about it, and I didn't know what I was supposed to tell her husband. My parents said I was a traitor. They said that my sister had a fight with her husband because of me and that if they divorced, I would move back into the kitchen. \n\nMy dad doesn't talk to me but loudly tells my mom so I can hear that he is disappointed in me, that I should have known to give the right answer to my sister's husband, that I didn't defend my sister, that I am a bad brother and man and that I did it to get back at my sister because she used to sleep in the bedroom and I in the kitchen. \n\nI don't know how to convince my parents that I really didn't know what I was supposed to say. \n\nAlso my mom said that I will have to call my sister's husband and tell him that I lied and my sister was with me and then I will have to ask my sister to forgive me and only if she forgives me my parents will forgive me.", "created_utc": 1704619226, "permalink": "/r/AmItheAsshole/comments/190od3a/aita_for_not_lying_to_my_sisters_husband/", "score": 177, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole because I didn't lie to my sister's husband and they are fight\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA jesus your family has no sense of morals get out of there when you get the chance.", "NTA \n\nI'm really sorry your family sucks like this. You absolutely should not have lied but I understand you're in a very difficult situation with probably nowhere to go. \n\nI grew up in Eastern Europe / I'm in the UK now / so I know how hard life can be there. Your parents clearly favour your sister. We had a 3 room flat, 2 bedrooms and the living room, and 3 of us siblings / 2 girls + 1 boy / shared one room. \n\nAre you going to university after school? Hopefully if you are then at least you could move into student housing.", "NTA. Never mind their twisted morality, how were you to know to lie? Or what to lie? Should you say, She was here she's just gone, or Yes, but she's in the bathroom? Or what? You didn't know which lie to use, you cannot be blamed in any way.", "NTA. Your sister was doing the stupid behind her husband's back and got caught. You should never have to lie to cover your cheating sister. Shame on your sister and parents for defending stupid instead of coming clean.\n\nHopefully, you can move out of the apartment as soon as you turn 18.", ">my sister had sent a text message to her husband that she would be with me all day\n\nThen it's her fault, for not sending you a similar text message. You didn't even have the opportunity to lie, because SHE messed up (firstly by cheating on her husband, secondly for failing to line up an alibi).", "Damn your family is a bunch of bad people. NTA", "Fuck no if you need to lie your covering someones ass", "Your parents are insane. WTF!", "NTA and for your own mental health and personal safety, GTF outta there as soon as you realistically can and don’t look back. The abuse you are experiencing will only end when you leave them all to their own devices.", "NTA. Your parents should have let you share a room with your sister. And the \"apologize to your sister and then we'll forgive you\" part is awful. It's manipulative. \n\nYou're not a traitor, you care about your sister.", "NTA but your parents and your sister are.  If they expect you to lie for her,  they should have told you.", "How is your sister being a cheating wife your fault? Whenever I hear stories like this I think ‘follow the money’. \n\nThe only way the parents would be accepting the affair is if they were getting a cash handout from your BIL and realise if they don’t fix the situation, the money will stop. Or they’ve realised that SIL has to move back in and your parents will have to support her. \n\nEither way, none of this is your fault. NTA.", "NTA. If they gave you some sort of warning and asked you to say she was with you I could understand their reaction slightly. But for your sister to be using you as her affair alibi without even asking you to cover for her is insane. Sounds like you didn't even know your sister was having an affair, so how would you know to lie? If she gets a divorce, it's absolutely on her not on you.\n\nSorry that would mean you would be back to sleeping in the kitchen though \n\nYour family sound awful, and I hope you can save money to get away from them as soon as you can.", "NTA but man why don't you call CPS ? You sleep in the kitchen !!!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBackground: I (M17) live with my parents in a two-room apartment of 40 square meters. For Eastern Europe, where I live, this is a normal apartment. My sister (F24) used to live with us in the same way. My parents occupied one room, my sister the other. I was not allowed to share a room with her, so I lived in the kitchen and slept there most of the time. Two years ago my sister got married and my parents moved into her bedroom and I was given the living room where they used to live. \n\nA few days ago, her husband called me out of the blue and asked where my sister was. No one had informed me of anything, so I said I didn't know. My sister's husband asked if I was sure. Then he called me another half an hour later and asked if my sister had shown up. I was concerned and asked what was wrong. He didn't answer me anything. I started calling my sister, but she didn't answer the phone. My parents were at work and did not answer my calls either. \n\nIn the evening, when my parents came home from work, they were very angry with me. As it turned out, my sister had sent a text message to her husband that she would be with me all day, but she wasn't there. I didn't know my sister was having an affair, I hadn't been told about it, and I didn't know what I was supposed to tell her husband. My parents said I was a traitor. They said that my sister had a fight with her husband because of me and that if they divorced, I would move back into the kitchen. \n\nMy dad doesn't talk to me but loudly tells my mom so I can hear that he is disappointed in me, that I should have known to give the right answer to my sister's husband, that I didn't defend my sister, that I am a bad brother and man and that I did it to get back at my sister because she used to sleep in the bedroom and I in the kitchen. \n\nI don't know how to convince my parents that I really didn't know what I was supposed to say. \n\nAlso my mom said that I will have to call my sister's husband and tell him that I lied and my sister was with me and then I will have to ask my sister to forgive me and only if she forgives me my parents will forgive me.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Info: why are your parents okay with your sister having an affair? Why do they want your sister to stay married to a guy she is cheating on?", "NTA your sister and parents have no moral compass.  Even if you did know that you were her adultery alibi, lying for her isn’t right.", "NTA. You reacted totally normally to the phone calls. In fact, you reacted with concern for your sister. You automatically went to a place of love rather than assuming she’d done a bad thing (probably, I don’t know her situation). \n\nEven if you did know, it’s uncomfortable to lie about such a thing and people aren’t obligated to. It’s a hell of a leap for them to think this about old sleeping arrangements and it feels a little like they want to pin this general feeling of chaos and specifics of wrongdoings on someone and picked the innocent (but easier?) party - but that’s an assumption on my part. \n\nThe fact that you have been called a ‘traitor’ and blamed for potentially ending your sister’s marriage over her betrayal and her infidelity is infuriatingly mind numbing.", "Nope, the rest of your family are assholes though. Move out asap", "NTA. Look for another set of family. They don’t deserve you.", "You wouldn't have been the asshole for not lying even if she did tell you, fuck cheaters.", "NTA.. bottom line is that if you are expected to lie, you are supposed to know what to say.", "NTA\n\nHe will NEVER believe you if you try to lie to him now. It will only make the situation worse. Let your sister deal with the shit-storm she created & ignore your parents' attempts at corrupting your morals. It's just ridiculous they think he's that ignorant.", "Please move out as soon as you can. You did nothing wrong. NTA.", "NTA. What the f#&k did I read? You did the absolute right thing, don't take it back. Your sister was cheating and your whole family knew. A bunch of AHs. And they are blaming you instead of your cheater sister. Do you have any plans for the future OP? Like going away from college and reduce contact with your parents? Do you have other relatives you could stay with if things get ugly? You are absolutely not in the wrong. By no means. I am sorry but your dad is the bad man and father for having his morals upside down. You did good OP, don't let your family bring you down.", "He said he's from eastern Europe. \nTrust me, 2 bedroom apartments where kids share the lone bedroom and parents sleep in the living room, and another family member on a small bed in the kitchen, is still quite common.", "I'm from France never seen this, but still, if the father said \"you did this because your sister sleep in the bedroom and you in the kitchen\" I can allow myself to think that the father knows it s not normal ...", "Yes obviously OP got the crappiest out of the rooms and his dad knows this. They could have let him and his sister share a room with a partition wall / furniture - it's what we did when we got older, to separate my brother's half and mine and my sister's half of the room. \n\nSome parts of eastern Europe flats are tiny and families make do with what they have. Also when apartments go on the market they are sold per room not bedroom , with 1 \" room \" being the living room which is often turned into a further living space. \n\nI remember having a catch up with a friend who still lives where we grew up and we were discussing how in my opinion it's misleading selling flats as 2 bedrooms when in reality it's 1 bedroom plus the living room ... And she said , well, parents could just sleep in the living room to make do because you don't really need a living room ... To her that mindset is just normal.", "You sister is having an affair and this is your fault??????\n\nsomehow your family’s understanding of blame is mixed up\n\nyou are NTA", "I’d call the BIL exactly as the parents ask, and when he asks where his wife was tell the truth that she was out having an affair. And, also tell him that he got in trouble with the whole family for not lying about it. They all need to be thrown under the bus.", "Your family is toxic and abusive. Get out if you can. Nta", "NTA and how the fuck were you supposed to know you were supposed to cover for her cheating ass? What utter absurdity.", "NTA\n\n How were you supposed to know? If she wanted you to lie for her (which would've been so wrong, but i digress) she should've told you.", "Is this the origin story for the serial killer known as \"The Kitchen Troll\"?", "NTA\n\nIf you weren't told then how were you to know? Even if you did know it isn't your duty to lie for anyone.\n\nI wonder how much of the parents' behaviour is motivated by the fear/knowledge that she'll be moving back in and they'll have to go back to supporting her and extra cramped living. I'm just justifying their actions, but I can see this being at least in part an explanation", "Your family is SOOOOO messed up", "Nta this is ridiculous for them to expect", "NTA. What the heck. \n\nIt seems like your parents have favorite child. Imagine getting the living room after one room was vacant. Gods.", "NTA. You should never be expected to cover for someone else's affair. Your whole family is abusive to you for expecting this", "NTA - how is any of this your fault? The morals are backwards here", "NTA\n\nThe only member of the family with any sense of ethics or morals is you. \n\nGood for you.\n\nStay true to yourself. \n\nDo what you have to in order to get an education. \n\nAnd then move along with your life. \n\nLeave your sister and your parents behind, and don't look back. \n\nGood Luck. \n\nI wish you well.", "NTA - Let's ignore for a moment the delusional family requirements that you should step into the middle of this minefield. Consider instead the fact that you are getting burned for failing your telepathy and \"just knowing\" what your sister wants. The first rule of getting someone to cover for you is to let them know that they have to cover for you. You have to get your story straight before hand.", "NTA For all you knew she was in the hospital after being hit by a car. Your family is thinking you have the ability to read minds. Of course their minds would be horrible to be around if you had that ability. Or they think that you, like them, would naturally know your sister was banging someone else, because of course she would.", "NTA - if you weren't told, how would you know?\n\nAsk your dad if he would still feel like that if your mum asked you to lie to him about her whereabouts?  If he would not like to be cheated on himself he should not encourage the behaviour in his children.", "NTA", "NTA.  Based on what is likely going to happen?  You could probably ask your sister's likely-to-be-ex husband to move in with him after her cheating behind is tossed out.", "NTA- If I’m going to lie, I need to be in on the lie you tell. L", "Nta. Get the fuck away from there.", "NTA go live with your sister's husband, he seems like the only reasonable one", "NTA. I am so sorry they treated you like you were in a Harry Potter movie. Your family sucks. Even if you were aware of what was going on, you should not be forced to lie for your sister and parents. I hope you can see that your parents and sister, from what you described were not treating you right.", "Imagine if she was lying broken in a ditch somewhere, you lied and said she was with you, thus delaying people from knowing something was wrong and searching for her until she was already dead. Would they be all like, \"That’s the right thing that you did. For all you knew, you were covering for her having an affair.\"", "Nta don't lie double down. An let him know the parents knew. Try move out asap.", "Let you parents read this:\n\nYOU ARE IDIOTS SUPPORTING YOUR CHEATING DAUGHTER WHO IS A TRAMP.\n\nLEAVE THE BOY ALONE.\n\nNTA", "Wow.\n\nThis situation is so messed up.\n\nYour parents are assholes and so is your sister. Aside from the moral issues, how were you to know? NTA", "NTA.\nI am amazed how horrible moral codes your parents have.\nThey are more upset at you than your sister who is having an AFFAIR.", "NTA.\n\n Seems your sister is the Golden child here.", "nta, and what the hell did i just read?! your family sounds horrible", "NTA.  What a weird family you live with, they expect you to lie to backtrack the truth you told.  Soon you will be old enough to get your own place", "NTA", "am sorry what", "Your sister and her husband had a fight because of HER actions. She was so full of herself that she used you as her alibi without even telling you. \n\nNTA", "NTA. I would absolutely never cover for someone's affair unless it was a life or death situation. Even so, you had no clue.", "Your parents are terrible people.  They want you to lie for your sister who is an adulteress? And they're punishing you for it when you had no idea what was going on? Don't do it. Your integrity is more important than their toxicity. \n\nNTA", "NTA\n\nThis is crazy. Your parents and sister came up with this stupidity and expect you to lie because she is having an affair?  Maybe she shouldn’t step out on her partner!  \n\nHow long until you finish school and have a job?  \n\nJust bide your time.", "NTA But WTF! If you answered the phone and lied that your sister was there - wouldn't the husband ask to speak to your sister? How were you supposed to lie your way out of  that? \n\nIf you could read minds, you could do it  on stage for money, and afford your own apartment, away from these idiots.", "NTA this reminds me of my short stint in DK where for immigration purposes my x-husband and I needed 1 bedroom & 1 living room. I can not ever imagine them counting the kitchen, that is insane! The living room is bad enough! I hope you get a couple of privacy screens or curtains hung from the ceiling!", "[removed]", "Wow, I think that you should’ve told them your sister didn’t tell you anything and if k was in your position I would’ve told my sisters husband the truth as well", "Third for expecting OP to lie for her", "“People” don’t do this, but human-shaped turds do!", "I mean it’s pretty clear that it all comes down to money. \n\nSister’s marriage financially benefits them by removing a dependent from their household. They do not want her to return to that household, because it will force them to re-shuffle the living arrangements, which got more comfortable when she left. They don’t care what she does, as long as it doesn’t impact their finances or their living space. So in their eyes, when OP admitted to her husband that he had no idea where his sister was, *he* was the one who put the family in a tough spot. If he’d figured out what was going on faster and lied to her husband, they’d all still be comfortable and unaffected by sister’s marital problems.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Id put that one first actually...", "You shouldn’t expect people to lie for you! But if you are going to expect people to lie for you, it’s insane to not even inform them of that fact."]}