{"id": 3481, "submission_id": "z7cfdl", "title": "AITA for not getting my cousin an interview at my company and giving her a reality check about the industry?", "selftext": "I work as an engineering manager at a boutique firm. When it comes to new college graduate roles, we strictly look at candidates from top 20 engineering schools with high GPAs and a degree in computer science or a related engineering field. \n\nMy cousin Anna (22F) graduated from a state school with an undergrad degree in biology last spring. She's been searching for a full-time job for over a year with no luck. Anna has spent her last few months taking Python courses and learning how to code so she can apply to coveted software developer roles. \n\nI posted a couple of new college grad software engineering openings with my company on LinkedIn last month. Anna asked if I could fast-track her application. I told her sure and to send over her resume so I could send it to the hiring manager. I didn't tell her that I was the hiring manager and her resume wouldn't get her an interview. \n\nWe recently filled the roles and we automatically send rejection emails to all other candidates once the role has been filled. Anna and my aunt are texting me to complain that she never got an interview. I told her the hiring manager didn't think she would be a good fit based on her resume. Now they're mad because she's been struggling interviewing for software jobs, she isn't even getting her foot in the door with any \"good\" companies, and the least I could do is \"pull some strings\" to get her an interview. \n\nI asked where else she has applied, she said Google, Facebook, Pinterest, Lyft, and a few other top tier well known tech companies which I thought had hiring freezes. I told her that we're in a recession which tech has not handled well and there's an overabundance of good, experienced engineers in the market right now. And she would be better off going for internships or applying to smaller, less well-known companies to get some developer experience.\n\nNow I'm being called elitist and condescending. Anna's older sister messaged me to call me an elitist prick and say that Anna's probably smarter than half of the kids we're interviewing and she deserved a chance. Anna's a pretty smart kid but she's competing against math whizzes and borderline geniuses, and she just doesn't have the experience we're looking for. \n\nAITA for not working harder to pull strings and get Anna a job?", "created_utc": 1669678137, "permalink": "/r/AmItheAsshole/comments/z7cfdl/aita_for_not_getting_my_cousin_an_interview_at_my/", "score": 149, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole because my advice definitely sounds very elitist and exclusionary from those unfamiliar with my industry or tech. Wondering if I could have used better language or sucked it up and gotten her an interview\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Sorry, but that's not cool on her part and her family. What about the numerous computing science students who have a computing science degree and have literally devoted 4+ years to it. \n\nI know it sucks, but you need to be realistic as well.", "NTA you told her the truth", "NTA. Of course they don't like it, but you're not going to do her any favors by not being honest with her. If she really wants to find a job, she obviously needs to adjust her expectations and aim for something a little more realistic to get started in the field. I work in tech, too, and even in the best of times, most devs don't immediately get jobs at the biggest, most coveted brands in tech right out of the gate, even with an actual degree in a relevant major.", "NTA\n\nYour company doesn't hire people with her qualifications. I don't really know what they expected you to do -  without an engineering degree, it's unlikely Google or Meta or Lyft would interview her either, even in a better economy.", "NTA. Without the relationship with you, she doesn't sound to be qualified for the job. With the relationship with you... she doesn't sound to be qualified for the job.\n\nTaking a few python courses + the family relationship shouldn't outweigh the fact that she doesn't have a qualifying degree for your applicant pool. You would not have been helping if you'd hired her. You'd have only been risking your own standing at work.\n\nOne suggestion. Have her check into computational biology. Its a niche field and she'd likely need to take more programming classes. But with her bio degree, it might be a better fit for her.\n\nIf you're not familiar with it, its about using computers to simulate various aspects of biology. They've been doing it for a long time, but in the last couple of decades it's become recognized as a discipline of its own within biology.\n\nSimilar recognition has happened with computational physics. Both now have full college majors in them available at some universities. A bio degree and programming classes are at least headed in the right direction for it.", "NTA - She needed the reality check.  Family just doesn't understand.", "NTA you told her the truth", "NTA — it suck’s that you were put in this position. The first step is not on the top of the ladder! One step at a time, and it is on the bottom!!!", "NTA. The entitlement everyone feels for you to use up your office goodwill is breathtaking. And given that entitlement not “pulling strings” for her seems like a good idea.", "NTA.\n\nSounds like her mom and sister are blowing smoke up her ass and not telling her how the world works.  \n\nShe is competing against people with engineering degrees, and she has taken a few python courses over a few months, and yet doesn't see why she isn't getting on with some huge tech companies?\n\nAlso, do they think this will make you want to work with her at your company?  If she gets in trouble, they'd probably expect you to intervene.", "NTA.  Are there placement agencies or career counselors that she can register with get some third party/unbiased advice?  OP, I believe your observations, your niece may need to hear it from someone else.", "NTA.  She was counting on nepotism rather than skill.", "While I do understand both sides of this, NTA. Not only do I also work in hiring but I’m also the least qualified person in my office atm. You have to pay your dues and work to be better to get to where you want. For me, that’s years of experience and some extra schooling. I don’t specifically know what she would need to do but you told her the truth and offered her a very gentle solution so that eventually she CAN be where she wants to be. NTA I think your family is lucky to have you. You could’ve just lied or made up something but you took the time to try and help", "NTA You are in a no win situation, my friend. Though you are 100% in the right, whatever you say will fall on deaf ears and you will be the bad guy regardless. The best thing you can do is just take the heat, let them think they are right and hope it blows over soon. I know it sucks, but just remember: No good deed goes unpunished and the road to hell is paved with good intentions.", "NTA, she’s being the elitist one by refusing to consider working somewhere “of a lower caliber” this is the reason she can’t find a job", "NTA.  What a group of entitled assholes.  She does not qualify for positions at the company you work for and gave suggestions to where she could apply to get experience.", "NTA. Tell her to try Twitter. I hear they need people.", "NTA. You are giving solid, practical advice and they don't want to hear it. Sucks to be them, don't do anything more or give any more advice. They won't take it or be grateful.", "NTA for not getting her an interview, pretty AHish to not just be up front with her though instead of playing this weird fucking power trip game with her.", "YTA\n\n> I told her sure and to send over her resume so I could send it to the hiring manager. I didn't tell her that I was the hiring manager and her resume wouldn't get her an interview. \n\nIt's generally not nice to waste people's time and get their hopes up for no reason.\n\n> I told her the hiring manager didn't think she would be a good fit based on her resume.\n\nJFC, are you **ever** going to come clean that this was 100% **_your_ call**?\n\nYou're not TA for giving her some real talk about the state of the industry. You're TA for not doing that **first**.\n\n> applying to **smaller, less well-known** companies to get some developer experience.\n\nI mean — didn't you *just say* you guys were a \"boutique\" firm?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI work as an engineering manager at a boutique firm. When it comes to new college graduate roles, we strictly look at candidates from top 20 engineering schools with a degree in computer science or a related engineering field. \n\nMy cousin Anna (22F) graduated from a state school with an undergrad degree in biology last spring. She's been searching for a full-time job for over a year with no luck. Anna has spent her last few months taking Python courses and learning how to code so she can apply to coveted software developer roles. \n\nI posted a couple of new college grad software engineering openings with my company on LinkedIn last month. Anna asked if I could fast-track her application. I told her sure and to send over her resume so I could send it to the hiring manager. I didn't tell her that I was the hiring manager and her resume wouldn't get her an interview. \n\nWe recently filled the roles and we automatically send rejection emails to all other candidates once the role has been filled. Anna and my aunt are texting me to complain that she never got an interview. I told her the hiring manager didn't think she would be a good fit based on her resume. Now they're mad because she's been struggling interviewing for software jobs, she isn't even getting her foot in the door with any \"good\" companies, and the least I could do is \"pull some strings\" to get her an interview. \n\nI asked where else she has applied, she said Google, Facebook, Pinterest, Lyft, and a few other top tier well known tech companies which I thought had hiring freezes. I told her that we're in a recession which tech has not handled well and there's an overabundance of good, experienced engineers in the market right now. And she would be better off going for internships or applying to smaller, less well-known companies to get some developer experience.\n\nNow I'm being called elitist and condescending. Anna's older sister messaged me to call me an elitist prick and say that Anna's probably smarter than half of the kids we're interviewing and she deserved a chance. Anna's a pretty smart kid but she's competing against math whizzes and borderline geniuses, and she just doesn't have the experience we're looking for. \n\nAITA for not working harder to pull strings and get Anna a job?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. The more I read Reddit stories, the more thankful I am for the block feature on my phone. Good grief.", "Engineering interviews can be brutal - don't they involve maths/logic problems and coding problems?\n\nI say let her try and she'll get humbled QUICK", "NTA your cousin is entitled.  Shes chasing pipe dream jobs wtih out the educational backing or the experience.  I would say go low contact until they simmer down.  There not ready to hear reality.  She's 22 and expecting to be at Google with beginner code courses?", "NTA...\n\nBut please tell her to learn C#.  That along with python should get her into interviews.", "NTA. She's holding you responsible for not getting a job when she is completely divorced from the reality of the situation she is in. She's job searching in a tough market with no experience and little relevant education. And she's only applying for the best of the best. There is nothing you can do to help her or your aunt besides not engaging with them because *they are not reasonable people and cannot be reasoned with*.\n\nIf the situation was different, if you'd stuck out your neck and suggested to someone else that they interview her that would have reflected badly on you, and with their current behaviour, I bet your cousin not only would have tanked the interview, she would have named dropped you the whole way down.", "NTA. Especially because if this is what her family is like now, imagine what they'll be like if she starts working at your company!\n\nIn the past when I was responsible for hiring, if I saw an overbearing or controlling parent in the wings I would be very wary of hiring that candidate. I once declined a paper resume from a kid and when he got outside I could see and hear his dad berating him for not being more firm and demanding to meet with the manager. I went outside and introduced myself as the manager... and let Mr Dad know we only accept resumes online and that some employers would not want to hire his son because his father is clearly controlling and interfering with his son's potential work and no one wants to deal with entitled parents who don't know how employment works these days.", "Working harder? You didn't do anything at all. LOL She doesn't have the skill or experience to work at your company. You gave good advice. The reason she is so unprepared for the real world is because of her family. They set her up to fail. Not you.", "It’s really hard to get a good job with just a biology degree, she’d had a better chance going to grad school", "> It's generally not nice to waste people's time and get their hopes up for no reason.\n\nTotally fair YTA, though I would have gotten the same reaction if I told her immediately. \n\n>JFC, are you ever going to come clean that this was 100% your call?\n\nNah, I'd only get more grief for that. It isn't going to help her any more to know her cousin directly reviewed and rejected her. But for what it's worth, I sent her resume to another hiring manager at my company and to some of my recruiter friends elsewhere. The *nicest* responses I got were that they're looking for engineers with more concrete experience.\n\nSmaller, less well-known local companies was a nice way of saying that she's setting her expectations too high by applying only to places that give out the coveted six figure jobs", "I mean, if all the time she spent was emailing over a resume, I'd hardly call that a waste of time.  And she also needs to learn that sending someone you know a resume doesn't guarantee an interview.", "FWIW, like most here, I think you’re NTA because your aunt and your cousin are delusional. Compromising yourself, your career, and your reputation on a delusion is an awful idea for everyone. Most of all for your cousin, honestly.\n\nThat said, parent is not wrong. I do absolutely think you’re being elitist, and possibly condescending. 6 figures is coveted? That’s automatically condescending. With *just* Python, sure, it’s nuts. I am lucky and niche but I am also not at all special. I do not live in a high cost area, and would not take a job for $100k base even in the current market.\n\nShe still absolutely needs to build a resume, but the word “coveted” rubs me extremely the wrong way. There are many ways to say “wat” to your cousin while explaining reality and, ideally, offering advice.\n\nAs you surely well know, breaking in is the hard part. As you also surely well know from your post, your cousin is behind the 8 ball breaking in. An undergrad degree in Bio and a Python boot camp is going to go roughly nowhere. There are still simple things she can do to set her apart, which you can throw her:\n* devops/SRE/whatever they call it now; there are way more jobs in that land, FAANG style or not\n* public cloud architecture; the principles coding and storing for AWS/GCP/VMs-on-prem are a very easy win that can impress recruiters because that’s how small and mid size organizations deploy\n* networking remains key; does she have a robust Girls Who Code chapter locally? Any open source project meet ups she’s interested in?\n* the point is you can nurture even if she’s not right for your boutique. Frankly, you sound to me like you’re trying to gatekeeper. Don’t gatekeep.\n\nAlso, it’s probably very weird, but I’d be happy to talk to your cousin about how I managed to nerd professionally. I love my job so very hard. She still won’t like it but at least I’m impartial? :P", "NTA. She’s basically someone who’s once carried a plate from the table to the kitchen who now wants to be appointed head chef at a top restaurant.", "Send her an example of a resume (with name redacted) that got someone an interview. The huge difference might be the eye-opener she needs.", "Not an AH for not pulling strings for her.\n\nABSOLUTELY YTA for telling her you would forward her resume to the hiring manager and not telling her you are, in fact, the hiring manager. Perhaps if you'd shared THAT little nugget of truth, you could help her understand what you're looking for and why.", "YTA for not at least putting on a show of a fair interview through a colleague or otherwise - the experience of which would already be a benefit to her, especially if you were able to provide actionable feedback. \n\n**INFO:** - Did you even read her resume? You sound like you never even reviewed her qualifications or considered her for any element. Did you actually assess her capabilities?", "Carnegie Mellon CS grad AND development org manager here: NTA, and she absolutely needs  to have had that reality check.\n\nETA: and I have had the same experience...friends whose kids are just or recently out of school (yes, I'm an old these days) with non-CS degrees but have taken a \"bootcamp\" or two send me resumes (mostly unsolicited) and ask me to \"get them in the door\" at the company I work at. No, sorry, that's not how it works. \n\nThat being said, I do have to say something about the focus on top 20...the best developer I ever met was on my first job out of school; she went to DeVry during the day, and paid her bills at night as a bartender. She could destroy anyone on any challenge that was set before her.", "NTA \n\nNo offence but Anna and her family seen very naive if they think doing some free online course on python will put her on par with computer science graduates who know four+ coding languages. I mean come on...she seriously thought she had a chance getting into Google without a degree in computer science? \n\nYou have given her good advice. It isn't your problem to deal with other people's delusions.", "Yes you can’t expect to be in the champions league when you have not trained for it just because you ‘know a guy’. You have to put in some work. Don’t expect to get what you want. Work for it. And if it means you have to start on lower paying jobs to get you where you want to be then so be it.", "Did they,  though? \n\n\"I'll forward it to the hiring manager\" is very different to \"I AM the hiring manager.\" \n\nIf OP had been honest about their position from the jump, and helped the cousin understand \"this is what I look for and why you don't make the grade,\" this could all have been avoided.", "Dear Mr Musk, I wrote you but you still ain't callin'\n\nI left my cell, my pager, and my home phone at the bottom\n\nI sent two letters back in autumn, you must not've got 'em\n\nThere probably was a problem at the post office or somethin'\n\nSometimes I scribble addresses too sloppy when I jot 'em\n\nBut anyways, fuck it, what's been up, man? How's your company?\n\nI know you probably hear this every day, but I'm your biggest fan\n\nI even got the underground shit that you did with SpaceX\n\nI got a room full of your posters and your pictures, man\n\nI like the shit you did with Tesla too, that shit was phat\n\nAnyways, I hope you get this, man, hit me back for an interview\n\nJust to chat, truly yours, your biggest fan\n\nThis is Anna.", "You'd have to be completely daft to apply to Google without a computer science degree and then still be confused as to why you were rejected.", "That isn't how job hunting works. Companies do not owe everyone interviews with feedback. Interviews take up a lot of time hence why companies only invite the job applications they like to save their time. Anna wasn't the only candidate who was rejected for an interview. If she was given an interview when her application was as crap as another applicant who wasn't given an interview, the company could get into trouble for unfair hiring practices.", "Precisely. even the famous Ali Dia got found out in his first ever game. OP would be questioned similarly.", "If the cousin knew OP was the hiring manager it would be much worse. Then it's *I* rejected you because you aren't qualified. They are already taking it badly when OP has explained the kid didn't have the qualifications. They would have thought OP should have given her the job. Because FaMiLy!", "With the sorts of places and jobs she's applying to now, that bio degree isn't really going to help at all.\n\nWhich is why I mentioned computational biology. I have no doubt that she'd need more classes than she's taken already, at least on programming. She might even need a graduate degree to secure a good job.\n\nBut it at least leverages the bio degree along with programming. If it interests her, it might stand a chance of putting her closer to where she'd need to get to in order to be a good candidate than where she is with the jobs she's trying for now.\n\nIn a way, its like switching majors in college. If you're an math major, you're going to be further ahead if you decide to switch to physics than if you decide to switch to history.", "While you're not wrong, you may be misunderstanding what i was suggesting. \n\nClearly OP has already decided not to hire her - if she's not a good fit for his team then that's done. *HOWEVER,* OP says he wants to impress on her how hard these jobs are? Show her an industry & job-specific professional interview from yourself or otherwise. \n\nGiving someone the equivalent of an exploratory interview (with feedback!?!? NOBODY gets feedback these days!) would be a golden benefit that is secondary only to employment itself.\n\nSo yes, I'm suggesting he had done her the courtesy of meeting her on their level professionally and letting her see what that level of expectation looks like. \n\nInstead he robbed her of the experience without providing any new value.", "Perhaps, because entitlement is a powerful drug.\n\nBut I still think OP would come off better saying,  \"I wouldn't hire you and these are the reasons why,\" instead of fluffing with \"I'll see what I can do.\""]}