{"id": 3583, "submission_id": "z8pdun", "title": "AITA for agreeing to host Christmas when asked instead of my SIL?", "selftext": "My (29F) family consists of me, my mum, stepdad, and his four sons (everyone has partners). This story concerns the oldest son, George (32M), and his partner Francesca (30F).\n\nIn our family, I host most of the family gatherings, because my house is big enough to accommodate everyone staying over. Now, I don't particularly enjoy hosting. The cost is astronomical, it takes a long time to plan, and it's quite stressful. However, I have no problem doing it, and I know that everyone enjoys it, and I certainly prefer being at home. There are upsides, but my point is, hosting is not something I jump at the chance to do.\n\nThis year, however, Francesca asked if they could host Christmas. Nobody was keen on this, as their house is very small, no one would be able to stay over so a good chunk of the day would be spent driving (so there would be no drinking for some), the kitchen is tiny so cooking for so many people wouldn't be simple, and they don't have a table large enough to accommodate us all. Despite all this, on the spot no one could think of a polite way to say no, so we all sort of went along with it.\n\nA few days ago, Francesca sent round a group text asking if everyone would be alright bringing something to Christmas, a food dish of some sort, as their oven wasn't large enough to cook everything from scratch and if we all brought something to warm up, that would be easier. Later on in our family group chat (parents and siblings only) my other step-siblings said it would have been better if I hosted Christmas. Even George agreed and said Francesca was totally stressed out about the planning. At this point, my mum suggested maybe I should take it over, since that would take the stress off everyone and save them all a drive. Everyone jumped on the idea and practically begged me to do it. George said he'd talk to Francesca about it since everyone else was in agreement, and I said okay.\n\nI heard nothing more about it until last night, when Francesca sent me a long message, and she was furious. She said I should have refused hosting when asked, because I knew how important it was to her (which I didn't). She accused me of ruining her chance to finally be part of the family, and of lobbying to host Christmas so that I could embarrass her, which is not true. I tried to explain to her that I was just trying to make everything easier for everyone, and that I didn't offer, I was asked, but it was a bit vague because I was trying not to throw everyone else under the bus. Eventually she just stopped replying. I really thought I was at least saving Francesca and everyone else a bit of stress, but a couple of my friends say I should have let her sink or swim on her own, since she was so adamant about hosting. So, AITA?", "created_utc": 1669808591, "permalink": "/r/AmItheAsshole/comments/z8pdun/aita_for_agreeing_to_host_christmas_when_asked/", "score": 25, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole for agreeing to host because It was important to Francesca and may have given her the impression that we think her house/plan isn't good enough.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - you need to talk to your brother to deal with Francesca and set the record straight. \n\nOnly continue hosting if you want to - otherwise yeah, let her sink / swim and everyone else will have to deal with the consequences of not communicating their concerns with Francesca directly.", "NTA..you were just trying to please the crowd. Your brother threw both you and his wife,  under the bus....assuming George and Chris are the same person.", "NTA- George should have discussed with his wife in the first place that it’s a great offer but it’s just not the best idea. Her going off on you makes me wonder if he said you offered to host it or something. I honestly feel she’s probably more upset that she didn’t think she through when making the offer to host. This really isn’t on you, but everyone needs to speak up if there’s a situation like this again. She probably feels the entire family was talking about her behind her back, which they were and that in general feels shitty", "NTA but her husband is, and so is she. He should have managed talked to her and confirmed with you whether to go ahead or not. If she wasn’t comfortable, he should have said so and pushed back on you hosting. \n\nNo good deed ever goes unpunished OP!", "NTA - the majority of family is the one who chose, and it it seems maybe the brother/her husband didn't explain it to her very well. \n\nI'm not sure how close you two are , but would it be possible to suggest that she either help co-host and / or host it at your house? You can explain to her if you haven't already that it too can be stressful for you and it would be nice with the extra help/less work for you this year. \n\nHope everything gets sorted out and you and your fam bam have a lovely holiday!", "ESH except for Francesca. I'd have said N A H if the family hadn't discussed this behind Francesca's back and then scuppered her plans. You should have checked in with her. No wonder she's hurt.", "ESH.  Was it realistic for Francesca to offer to host?  Maybe not.  But she did, which you should have been grateful for, because you don’t *like* hosting.  Instead, you let the rest of the family pressure you into doing it the way *they’re* most comfortable with.  If it’s not too late to take that back and tell them to suck it up and try something different this year, I would.  But at the very least, there needs to be a *big* discussion before the holiday season rolls around next year about some of *them* jumping in to take this on if they don’t like how Francesca does it, because it should not just fall to you simply because that’s how *they* want it.", "YTA \n\nYou don’t even like hosting. She volunteered that’s clearly a sign that she wanted to host whether she should’ve is another story but that’s between her and her husband. Should’ve allowed her to host that way she could see how hard it is.", "NTA but you should've talked directly to her. The husband is TA tho, he didn't even clear with her if it was okay.", "NTA your family needs to step up especially her husband. I think he may have told her a different story about what happened in the chat. You need to speak to her in person not on a chat or phone. Perhaps you 2 can come to a compromise. Maybe co host at your house and help take all the stress off one of you. The pot luck still sounds good they can bring side dishes and you two could do main together. The rest of family should contribute food and the drinks. No reason one person should be wholly responsible for it.", "I think ESH except Francesca. Obviously her house isn't ideal for regular hosting but she wanted to do it once. She's joining the family and probably wanted to do something nice for everyone. Y'all's reasons suck. So some people have to be designated drivers? People don't want to bring one dish (in my experience people contribute to holiday meals even when the host DOES have plenty of kitchen space)? The thought of being at two different tables is unfathomable? And conspiring behind her back to change the plan sucks. George should have stood up for his wife and made it clear that everyone knows your house is better but it's important to Francesca to make this gesture for the family.", "NTA.  It's clear that your family would be much more comfortable at your house.", "ESH. The family including you was pretty inconsiderate to wait so long to pull the plug before telling her you all weren't comfortable with her house situation. She sucks for lashing out at you, but I can understand her pain.", "NTA - Francesca bit off more than she could chew and your family, obviously preferring to avoid a disaster they could see coming, tried to dodge the bullet.  I think your mistake was in not making it clear from the outset that this request for change of venue was totally other folks' idea.  I would suggest asking your mother to step up, admit to F that this was her idea, not yours.  Or perhaps her husband could bit the bullet and cope with his wife, since he's clearly as aware as everyone else that this wasn't a good idea.", "NTA you literally did nothing wrong. I don’t know what “talk” George had with her but it seems to have painted you in a bad light. Since she’s stopped responding to you, I would go to him and the rest of the family to reach out. Maybe offer to co-host with her, plan somethings together and cook the dinner? This might be a blessing if it gets you some hosting help!", "[removed]", "ESH - except Francesca.  You know it and I know it…The odds are, she wasn’t as overwhelmed as her husband claims.  \n\nYour family immediately stated pushing back at the offer because THEY WANT A HANDS FREE VACATION WHERE THEY CAN EAT AND DRINK ON SOMEONE ELSE’S DIME AND TIME!\n\nOh no! They have to actually spend some money and/or time and bring a dish to share with the rest of the family instead of making YOU cover them.  \n\nOh no! They have to figure out a Designated Driver or get an Uber OR CUT BACK ON THEIR DRINKING  to be able to spend time and enjoy the family.  What a bunch of selfish assholes. \n\nAnd here YOU come, martyr extraordinaire to save the day!  Save the day!   What a great example your going to set for your kids!  Mom is the go to patsy who gets used and abused each year, all over a holiday that is supposed to be about celebrating a guy who actually called for loving each other and giving to each other….", "YTA\n\nFor someone that's not particularly fond of hosting you sure were quick to take that duty back when someone else wanted the chore. Not only did you take it back, you refused to return it to the person that wanted the task. \n\nThe family enjoys not having to do anything but show up, drink and lounge. You enjoy being the holiday martyr. \n\nNow you can crawl back up on your cross and everyone else can go back to holiday slacking. But, trust, you've gained an enemy. \n\nHappy Holidays", "NTA- I'd suggest a compromise. Do it at your house, cause there is enough space, but your SIL can be in charge of the planning and the kitchen. She can come earlier and take over \"hosting duties\" with you.", "YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (29F) family consists of me, my mum, stepdad, and his four sons (everyone has partners). This story concerns the oldest son, Chris (32M), and his partner Francesca (30F).\n\nIn our family, I host most of the family gatherings, because my house is big enough to accommodate everyone staying over. Now, I don't particularly enjoy hosting. The cost is astronomical, it takes a long time to plan, and it's quite stressful. However, I have no problem doing it, and I know that everyone enjoys it, and I certainly prefer being at home. There are upsides, but my point is, hosting is not something I jump at the chance to do.\n\nThis year, however, Francesca asked if they could host Christmas. Nobody was keen on this, as their house is very small, no one would be able to stay over so a good chunk of the day would be spent driving (so there would be no drinking for some), the kitchen is tiny so cooking for so many people wouldn't be simple, and they don't have a table large enough to accommodate us all. Despite all this, on the spot no one could think of a polite way to say no, so we all sort of went along with it.\n\nA few days ago, Francesca sent round a group text asking if everyone would be alright bringing something to Christmas, a food dish of some sort, as their oven wasn't large enough to cook everything from scratch and if we all brought something to warm up, that would be easier. Later on in our family group chat (parents and siblings only) my other step-siblings said it would have been better if I hosted Christmas. Even George agreed and said Francesca was totally stressed out about the planning. At this point, my mum suggested maybe I should take it over, since that would take the stress off everyone and save them all a drive. Everyone jumped on the idea and practically begged me to do it. George said he'd talk to Francesca about it since everyone else was in agreement, and I said okay.\n\nI heard nothing more about it until last night, when Francesca sent me a long message, and she was furious. She said I should have refused hosting when asked, because I knew how important it was to her (which I didn't). She accused me of ruining her chance to finally be part of the family, and of lobbying to host Christmas so that I could embarrass her, which is not true. I tried to explain to her that I was just trying to make everything easier for everyone, and that I didn't offer, I was asked, but it was a bit vague because I was trying not to throw everyone else under the bus. Eventually she just stopped replying. I really thought I was at least saving Francesca and everyone else a bit of stress, but a couple of my friends say I should have let her sink or swim on her own, since she was so adamant about hosting. So, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nShow her some captures from the familly chat and let her see why its not her the problem, but her tiny house for such a big familly.\nLet her bring the food or do the cooking and decoration at your house so she can 'host' the party, and it wont burden you so much.", "NTA. The rest of the family I have my doubts about, though. Since Francesca so much wanted to host, it wouldn't have killed them to do as she asked. A new set of traditions could have been started, and that is not a bad thing. A major load would have been lifted off your shoulders, not a bad thing either. Finally, and most importantly, as I read it, they had already agreed to Francesca's hosting, so it is a rotten thing to go back on their word, just because it would be a little bit more inconvenient than they are used to.", "Yeah, I changed the names for anonymity and then forgot halfway through haha. I've edited it now", "Whilst I agree that the family acted cowardly and the step brother should have been open with his wife, I don't think it's fair to say their reasons suck. Their Christmas tradition is that they all stay together and eat together as a family and, yes, that does include drinking for them. Expecting people to change all of their traditions for an opportunity to host isn't a nice gesture to the family, it's asking for a day in the spotlight. \n\nA nice gesture would have been to offer to come earlier and help OP prepare the meal and alleviate the pressure on her whilst being able to say \"everyone, I made the turkey/this dish!\" Instead she's asked for everyone to come to her house - despite her husband who also lives there clearly not being keen on the idea - and plan in extra logistics for driving/dish preparing etc etc. \n\nFrancesca is the biggest AH here, she wanted her chance to host despite what inconveniences it meant for everyone else. Everyone else kinda sucks for not being open and honest. OP probably sucks the least because I think she was just trying to go down the path of least resistance.", "Yeah, we probably should have been honest from the get-go. It was just one of those situations where in the moment we were all expecting someone else to say something, and no one did. And then we sort of forgot about it, until her text when it seemed like she wouldn't be able to cope. But yes, we definitely should have said something earlier.", "SIL was also late in changing how the event worked due to her small kitchen.", "She undermined herself by asking them to essentially cook Xmas dinner for her and that she'd re-heat.", "My family does not abuse me. The reason I normally do events is because I get them catered, so nobody has to cook. It's not like I'm slaving away in the kitchen alone.\n\nAnd second, they don't need a DD to come to my house, and can still enjoy spending time with family, that's why it's easier.\n\nAlso, we're atheists, Christmas is just about a nice day.", "I said yes because I wanted myself and everyone else to enjoy Christmas. Do I enjoy dealing with caterers and servers running around my house, no, but I wouldn't call it martyrdom either.", "FFS, **no** chat.  The chat has already done enough damage.  Again, I don’t know why so many people seem to think just laying out the arguments for Francesca will fix this, when the problem is that no one could fucking be bothered to do that **before** blindsiding her with “Okay, change of plans.”", "I get not wanting to throw your family under the bus. Something that your brother seems to have no problem doing.\n\nJust type out and list all the reasons given in the group as to why people preferred you hosting to her doing it. And send that to her. Without revealing who said what.\n\nNTA", "You really think Francesca is an asshole for wanting to host one time because \"tradition?\" Lol", "You still have time to fix it. Have you given any thought to helping Francesca host the event rather than just dropping her as host? It doesn't have to be all or nothing, you or Francesca, you can work together. As a perpetual outsider I know exactly how excluded this all makes her feel. Come on and reach out to her...and you'll benefit by having a great friend for life as she will never forget what you did for her. Christmas is a time when we should be coming together with goodwill for each other, not contributing to making someone feel shitty.", "Lots of families do potlucks, and it doesn’t ruin Christmas.  Hell, it might make things more tolerable on OP if other people started bringing their own dishes.", "She didn't undermine anything - they knew the situation when they agreed and knew it would likely end up like this. Then they (including her husband lol) bitched about it in a group chat and asked someone else to do it.", "This is *great* advice…if you never want her to speak to you again.  If I’m Francesca, I don’t give a shit why everyone - my own husband included - thought I was such a terrible pick for host that they went behind my back and forced the job on someone who doesn’t even want it (or claims not to, anyway).  All I care is that they *did*.", "Yes, family traditions matter. They bond people together,create shared memories, and relieve stress for a lot of people who like to know what to expect. I'm not saying traditions can't change, they absolutely can - and should. I'm saying that bulldozing your way in and expecting everything to be done differently and dropping the news less than 4 weeks before Christmas that there was going to be more legwork involved isn't the way to do it. \n\nI think OP's family are a bit much, expecting to be able to just rock up at OP's house and not lift a finger and have their Christmas catered for them in comfort, but that is what they're used to. Christmas is a busy, stressful time of year and now instead of just looking forward to their break they have to figure out who's going to be DD, who's going to prepare what, and how best to transport it. Yes, for many families that's par for the course, but for them it isn't and it's an extra layer of mental resources - including for OP - that they weren't expecting to have to spend on Christmas. \n\nSIL could have done a multitude of things to make changes, including suggesting the potluck at OPs house and asking to bring X dish, or at the very least being upfront when she requested to host and explaining it would mean a fuddle-style Christmas meal. The family should have all 100% been open about not being keen on the idea in the first place, but she let them all agree to come and then dropped the potluck on them *after* they'd already agreed to come.", "Maybe in the US but I have never been to a family celebration in the UK where dinner was potluck (and use of Mum says this is likely not the US). People will bring dessert/ drinks but not the main ime. I would find it very inconvenient personally to bring a dish to xmas dinner if that wasn't agreed from the start and it was the main family celebration. Which is probably the point here - it indicates Francesca bit off more than she could chew and potentially isn't ready for hosting such an important celebration. I don't think she is an asshole though, I just would be honest with her.", "If the family tradition of going to OP's house and drinking and all sitting at one table is THAT important to them, they should politely have told Francesca that when she offered to host.", "Yes, I said that. Twice. Glad we agree."]}