{"id": 3606, "submission_id": "z8vjqm", "title": "AITA for inviting my son's cousins to his first birthday?", "selftext": "For info, I'm 28F, husband is 27M, SIL was 28F.\n\nMy husband and I got married 3 years ago. I've always wanted children. Sadly, carrying a pregnancy would be a huge risk to me because of a medical condition I have. That's why we had to go for other options and decided on surrogacy.\n\nMy husband's sister already had 3 sons (10M, 8M, 3M) and agreed to be our surrogate for a very fair monetary compensation. Unfortunately, due to complications she ended up passing away on the same day our beautiful boy was born.\n\nNext week is his birthday and of course I invited his cousins and their father. Note that I didn't force them to accept the invite in any way. I didn't get a reply, instead the father called my husband and was furious. That made my husband mad at me. Apparently I wasn't supposed to invite them? Which he never mentioned by the way. We already had a fight about celebrating our son's birthday on his actual birthday (my husband wanted to pick another date but I'm not about to let my son feel guilty for something that wasn't anyone's fault). Besides, I feel like it would've been worse if I HADN'T invited them. AITA?", "created_utc": 1669824975, "permalink": "/r/AmItheAsshole/comments/z8vjqm/aita_for_inviting_my_sons_cousins_to_his_first/", "score": 130, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I invited my son's cousins and their father to my son's birthday which coincides with the day our surrogate died\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "OP: \"Hey do you guys wanna head on over and celebrate the day your mom/wife died so I could fulfil my dreams of motherhood?\"  \nAlso OP: \"Why are people mad at me, she knew the risks and we paid her well!?\"  \n**YTA!!!!!**", "YTA\n\nThis is so incredibly insensitive that part of me thinks you must be kidding.", "YTA\n\nThis was in very poor taste. Your brother-in-law deserved thoughtful acknowledgment that a difficult day was coming up, and checking in on him and his children.\n\nYour 1 year old won’t even know it’s his birthday. You absolutely could and should celebrate it publicly on a different day on the year anniversary of your SISTER-IN-LAW’s death. What you and your husband do in private on the day is your own business; but your husband and his family suffered a major loss. It takes a lot to throw a party on the first anniversary.", "YTA-I say this as nicely as possible please learn to read the room. While your son’s first birthday is clearly a joyous occasion and deserves to be celebrated you asked motherless children and a widower to celebrate an event that led to then losing their mom and wife.", "YTA - for calling her 'our surrogate' in the judgment bot. She wad your husband's sister, your sister-in-law, your brother-in-law's wife and your niblings' mother! She might have also been your surrogate but to reduce her to that is to trivialize these very important relationships. I think you have also done that in your head, which is why you have not considered their grief in your birthday plans. \n\nI agree your son should not grow up feeling guilty about his aunt's death but that comes later, when he's older and can comprehend what a birthday is. \n\nIf I am feeling more generous, I'm speculating that your position here is hard, as you have been given the most precious gift in tragic circumstances. If you hadn't asked her to be a surrogate she most likely would still be alive - this could make someone feel very guilty. The way you come across sounds as though you have blocked this out as a defence mechanism, which I think is understandable. Just don't block out these feelings to the extent that you aren't making space for others' feelings too.", "This is a very, very sad situation for the whole family. Your husband lost his sister.  His BIL lost his wife. Your nephews lost their mom.  Also you lost your SIL, which doesn’t seem to be of great importance to you.  Of course your husband doesn’t want to have a party on the first anniversary of the death of his sister.  And your BIL would not be bringing his children to a party anywhere on the anniversary of their mother’s death. YTA, an AH shining like a meteor against the dark skies filled with all other AH. The only proper thing to do is to apologize to all of these people, cancel this party (your son has no idea that it’s his birthday), and hold some sort of small celebration on a different day.  You will still be an AH from what you did, but maybe over time they will forget if you continue to celebrate the birthday on the nearest weekend day until your son himself asks for a change.", "YTA - you just seem to completely ignore the fact that this is the anniversary of your SIL’s death. The FIRST anniversary of her death. Which you are clearly aware of and should have been approaching this with a lot more tact.", "YTA here. I don’t think it was intentional on your part, and maybe you just weren’t thinking, but it comes off as inherently cruel to invite a family to a celebration of life on the anniversary of their wife/mother’s death. You can absolutely want to celebrate your child’s birthday, but you also have to realize that a family member lost their life bringing your child into the world. Neither you nor your child are responsible for her death, but I would hope you at least feel you owe some sensitivity to her family members. \n\nAt the end of the day, if you want to have a positive relationship with these family members that doesn’t result in them resenting you or your child, you’re going to need to acknowledge the loss. Your kid is turning one and will never know what day their party was on. Move the party, go to the cemetery with them, and show them support. And maybe check with your husband the next time you decide to send out invites.", "YTA you invited them to a birthday on the first anniversary of their moms death? How freaking oblivious are you? Their mom is dead because  of your son and you think it’s ok to throw a party on the day she died. The only thing that should be happening that day is remembrance of your SIL, until he is old enough to know what a birthday is your sons birthday does not need to be celebrated on the actual day. Their mom is dead, try to not be a selfish asshole.", "YTA. I can’t even begin to fathom how deluded and narcissistic you have to be to have EVER thought this was ok. The way you wrote this post is beyond disgusting. \n\n**your SIL died giving birth to your son** \n\nIt’s very obvious why you refuse to acknowledge that. \n\nGet help.", "YTA\n\nYou need to realize that everyone else in the family sees you child and sees that your SIL DIED bringing him into the world.  While your child is a blessing to you, to your BIL, he represents the loss of his wife - his partner.  To your nephews, he represents the loss of their mother.  To your in-laws, he represents the loss of their daughter and the gain of their new grandson.  To your husband, he is both a blessing and a curse as he is his son, and the loss of his sister. \n\nYour husband wanting to celebrate on a different day makes a LOT of sense.  The fact that you refused to do so DOES make you an AH... because your child is ONE YEAR OLD.  He won't care when you celebrate, he won't know the difference.   To everyone else, though, they are grieving while celebrating the new child.  \n\nPick a different day to celebrate your son's birthday.  Plan to use a different day EVERY YEAR.  Because the rest of the family will always grieve for the lost of your SIL while they see your son, especially on his birthday.", "YTA. \n\nYou could have done it any different day. Your child doesn't know it's their birthday. \n\nYour husbands nephews will know it's a year since their mum died, and that pain will be there a lot longer than your agro about not throwing a birthday party on the actual birthday.", "YTA. Their mother died. Your baby is a baby. I think you and your family can spend a few years grieving her loss before the parties start. She sacrificed her life for your child, have some damn respect.", "YTA even if unintentionally.\n\nYour sons birthday is also the death anniversary of his wife and their mom, inviting them to a birthday party seems a tad insensitive.\n\nYou got what you wanted and they lost the most important person in their life, not really a cause for celebration.", "YTA. You are not wrong for wanting to celebrate your son who is entitled to be celebrated, regardless of result of his birth. That said, what was the best day of your life was the worst for BIL and cousins. This is an incredibly hard situation. It does sound like you should have talked to your husband before inviting BIL. This also should have been an invitation that was handled extremely delicately and maybe wasn’t.", "YTA. To you SIL might have only been a surrogate who you could afford to pay so that you wouldn't have to meet the same fate; But to those three boys she was their world. To her husband and your brother she was an irreplaceable family member. It is cold, callous and awful to expect them to Celebrate the worst day of those children's lives.", "YTA. So you think celebrating his bday on a different day was making him feel guilty? You’re just happy you got your baby and the hell with everyone else, right? You don’t care about their grief, you got what you wanted, you even mentioned the “fair compensation”, and that’s all that matters to you.", "YTA.\n\nYou should have communicated that you know this must be an extremely difficult time and asked if their father if they would like to be a part of your child’s birthday celebration or if it was not something they were prepared to do.\n\nIt is quite rare to have a party on the actual birthday unless it falls on a weekend - perhaps just celebrating the birthday would have been hard enough this year and you could have gone with the Saturday after the birthday for a few years until the birthday was a Saturday - I mean this is hard for your husband too. Your emotions about your child’s birthday aren’t the only ones that count.", "Info: what have you done in the past year to strengthen and/ or repair the relationship with that family after her death?", "YTA.. your kid’s first birthday is the 1 year anniversary of your SIL’s death. You really think her widower and kids want to celebrate that day?! Or even your own husband who is going to probably blame himself and even you everyday for the rest of his life that his sister is dead so you two could have a baby?!\n\nPlease learn some compassion for people who are actually grieving your SIL.", "info: what kind of relationship have you had with the cousins or their father since her passing?", "Yikes this is bad. Hey everyone come celebrate my son's first birthday exactly 1 year after your mother died giving birth to him. I know you all don't have a wife/mom/sister now but i finally have the perfect family I have always wanted. Party time!!!!! \n\nYou must see how terrible this was. And your son is 1, he doesn't know what guilt is and definitely can't feel it.", "There's a LOT of missing information here. Was the husband aware of her acting as surrogate? Was there an agreement not to contact them?\n\nYou mentioned she passed away from complications from birth. I'm guessing the husband still associates that with his wife's death, and probably has resentment.\n\nAlso, it comes across a little off to invite the sons of the woman who died giving birth to your own son. That's a somewhat harsh reminder tossed back at them when it's only been a year.\n\nI think YWBTA if you press it further. Clearly, the father needs time to process his grief. Also fair monetary compensation doesn't factor into the emotional loss to their family.", "YTA - you put your desires and dreams ahead of the well-being of your SiL and it cost her her life. Then you want to celebrate a one year old who won't remember it on the day this woman died for you. You need to get your priorities straight.", "Did you have the fight about when to celebrate before or after you invited everyone?", "YTA I’m not sure why you think that family would want to celebrate the day they lost their wife/mother. I understand wanting to celebrate your child, but use a little common sense here; you may have gotten your child, but this poor family lost someone very important to them. Your invitation was inappropriate.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor info, I'm 28F, husband is 27M, SIL was 28F.\n\nMy husband and I got married 3 years ago. I've always wanted children. Sadly, carrying a pregnancy would be a huge risk to me because of a medical condition I have. That's why we had to go for other options and decided on surrogacy.\n\nMy husband's sister already had 3 sons (10M, 8M, 3M) and agreed to be our surrogate for a very fair monetary compensation. Unfortunately, due to complications she ended up passing away on the same day our beautiful boy was born.\n\nNext week is his birthday and of course I invited his cousins and their father. Note that I didn't force them to accept the invite in any way. I didn't get a reply, instead their father called my husband and was furious. That made my husband mad at me. Apparently I wasn't supposed to invite them? Which he never mentioned by the way. We already had a fight about celebrating our son's birthday on his actual birthday (my husband wanted to pick another date but I'm not about to let my son feel guilty for something that wasn't anyone's fault). Besides, I feel like it would've been worse if I HADN'T invited them. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. Actually it would not have been worse if you didnt invite them. You need to recognize that your son’s birthday is your SIL’s death day and always will be. It was completely insensitive to invite them to a one year old birthday party. It’s been only one year and they are still picking up the pieces. Not too mention your son is a reminder as to why and who they lost. Let them decide how to move forward in the relationship not you. Your son doesn’t have to feel guilty, but you need to show some empathy. It comes off as you don’t care about her death because you got your child. Show some empathy to the woman who lost her life to give you that child.", "YTA.. so your SIL died leaving 3 kids motherless behind because a adopted child was not good enaught for you and you \"needed a biolocical one\"  in the process you took the mother from her children and now you want them to celebrate the live of \"your beautyful son\" AT THE F... DAY THEIR MOTHER DIED GIVING BIRTH TO YOUR SON.. because you do not want your son to \"feel guilty\" WHAT ABOUT THEIR F... FEELINGS...TELL ME?!!!", "YTA. I'm in shock at how cold you are. She DIED giving birth to your son. Wtf is wrong with you?!?!", "OMG. Are you serious? You are more worried about your almost 1 year old \"feeling guilty\" than the feelings of your nephews, BIL, and husband? Babies cannot feel guilt. Shoot, toddlers don't even understand empathy until around 4/5. What is wrong with you? 100% YTA. You owe your husband and in-laws a massive apology. The tone of this entire post just rubs me the wrong way. You seem to have zero sympathy or awareness of the MASSIVE sacrifice that was made in order for you to be a mother and the pain others will feel for the rest of their lives. Stop being selfish.", "YTA. Along with what everyone else has pointed out should it be so hard to continue celebrating on a different day and explaining to your son later that you don’t celebrate on his actual born day to honor his aunt who literally gave him life. \n\nIt so horrible how you have disregarded the loss of someone who not only played an immense role in your life but was a huge part of your family.", "YTA \neven though yes it would’ve been worse if you hadn’t invited them. It’s very clear you don’t care about the emotional state of your husband losing his sister a husband losing his wife and three children losing their mother \n\nAll to do  you a favor. That’s great you love your child and you don’t want him to feel guilty but understand there is a love one that’s been lost. \n\nEven though youd like to celebrate your  child every birthday just know the entire family is mourning. The loss of your husband sister a wife and mother have some empathy\n\nPick another day it’s tactless of you to ask people who are morning  a lost love ones to celebrate. You clearly weren’t very emotionally invested in your sil but everyone else in the family was be decent  go to the cemetery lay some flowers for that woman say thank you for the life she lost and the life she gave and celebrate your child’s birthday on another day. Be decent stop thinking of yourself.  And acknowledgment of this woman’s death isn’t making your child feel guilty. It’s being a decent person.", "Well this is rough. I can only tell you what I think based on well wild uninformed assumptions. I assume he was against the surrogacy and hates you because his wife and child's mother died and probably hates the kid too. It was unforeseeable and not your fault but yeah... That's how I think I would feel. \n\n>(my husband wanted to pick another date but I'm not about to let my son feel guilty for something that wasn't anyone's fault)\n\nSo this part, your husband sister died on that date too. You should 100% be paying respect  to that woman for the rest of your kids life. Guilt no, appreciation yes. So figure something out because you might not be wrong but you aren't right either", "YTA. And what a senseless tragedy to begin with.", "YTA. Oh my gods. What the fuck were you thinking? The kid won't remember their damn party.", "YTA. You are a vile cruel person to invite kids to celebrate the birth that literally killed their mother without even being willing to change the Damn day.\n\nYou are beyond selfish, and I can’t imagine how your husband can even LOOK at you knowing how cruel and awful you really are.\n\nYou refuse to even acknowledge she DIED giving birth to your child. You are a whole new level of asshole and I pity your child for growing up with such a terrible selfish mother. They deserve way better.", "OMG. This actually has to be one of the most shocking things I’ve read on here. My eyebrows practically shot to the ceiling.\n\nHow could you be so vile? I cannot comprehend your view at all. Their mother/wife DIED that day and you asked them to a celebration of the effective cause of her death. \n\nWhat is the matter with you? YTA. Probably one of the worst on here. I hope your husband sees you now and divorces you and takes as much custody as he can possibly get because this is extremely narcissistic or sociopathic behaviour. I pity everyone one of the people involved in this situation- except you.", "Wtf do you mean you’re not going to let your son feel guilty? You mean YOU don’t want to feel guilty. YTA. Ffs. \n\nEchoing what others said here, your could have made your son’s date of birth a day to honor the woman who gave her life to make you a mother and bring your son into the world. Celebrate your son’s life yes, but how could be so cruel as to ignore the loss? YTA. Again cause I can’t get my brain around this cruelty.", "YTA", "Info: what is “fair monitory compensation” when the surrogate is dead?", "Whoa YTA and then some. \nTheir mom/wife died giving birth to your child and you're throwing a party on the first anniversary of her death???!!! Who does that? \nThe invitation isn't all that bad (though it should've been accompanied with a nice message saying that you always remember their mom/wife and love her so much and understand that your son might bring up bad memories for them, but if they feel up to it, you wanted to make sure not to exclude them. But do not, not now not ever, plan the actual birthday party on her death anniversary. \nThe fact that you don't understand how incredibly inappropriate that is, even though your husband wanted to do the party on another day, is baffling. \n\nOf course your son deserves birthday parties. Every child does, but really, they do not need to be on the actual day. The nearest weekend is fine and if that doesn't work out because that actually does end up being his actual birthday you do it a week early or late. Once he gets older you can explain to him that his amazing aunt died on the day he was born, so that part of the family is really sad that day, so we'll do the party another day (and you do a small celebration with just the 3 of you on his actual birthday, so he gets cake twice, so he'll be happy about it!)", "yta.  Your son is 1 and doesn't care about a dumb party.", "YTA. genuinely just this is bad. You lack any sort of awareness. Why tbe actual hell would they want to come and celebrate on the day their mother died? Like why?", "YTA, you don't have compasion and empathy on your heart, poor kid, end up with a selfish person as a mother, I hope your husband see you as you really are and take that kid away from you.", "Jesus what the fuck did I just read?! YTA! You are OBVIOUSLY the asshole! I just?! Phew boy.", "YTA it's only been a year and you want them to celebrate on the first anniversary of her death??? Insensitive doesn't even begin to describe it.", "YTA mainly for being so ungrateful to the woman who gave you your child. She DIED. Do you really think your husband wants to celebrate your son on the same day he should be mourning his sister? Your son's birthday will forever be tied to your SIL's death, learn some compassion because this will be a thing every year. Your son doesn't know his bday from his pinky finger, why not celebrate it another day, *especially* on the first anniversary of SIL's death. Did you even reach out to the husband first or just make it about your son's bday? 3 kids lost a mother, if you can't feel bad for your husband or BIL, at least for the children who lost a mother when she gave you a son.", "NAH but honestly this is above reddit's pay grade. \n\nThis should be addressed in a counselling session, and any action regarding this day need to be well thought through.", "I don't want to call you an AH but you come across as very, very, self centered and callous. \n\n>Sadly, carrying a pregnancy would be a huge risk to me because of a medical condition I have. \n\nSo you recognize pregnancy as a risk to yourself. Well guess what? Pregnancy is risky to everyone as you have now found out. Just because a woman carries multiple children to term fine does not guarantee that outcome each time. Obviously you found that out with your SIL. \n\n>My husband's sister already had 3 sons (10M, 8M, 3M) and agreed to be our surrogate for a very fair monetary compensation.\n\nShe might have been your surrogate but she was also a  mother and wife. To young children. Money does not replace her in their lives. \n\n>Unfortunately, due to complications she ended up passing away on the same day our beautiful boy was born.\n\nSo the woman, your SIL, gave up her life to give you a child. Leaving her children motherless. \n\n>We already had a fight about celebrating our son's birthday on his actual birthday (my husband wanted to pick another date but I'm not about to let my son feel guilty for something that wasn't anyone's fault).\n\nYour son is barely a year old. There is no way he feels guilty. You are simply pushing your own selfish agenda. \n\nBottom line:\n\nYou want to throw a party on the death anniversary of a close family member. Just because it wasn't your child that lost a mother doesn't change the fact that a member of your husband's family died on that day. Children are now motherless. \n\nHave some compassion for grieving people. Most people don't celebrate their birthdays on the actual day anyway. Have something small for just your husband and child on the day and plan the big parties separately. \n\nYeah YTA.", "NAH. But, Instead of inviting them outright, it would have been better discussing if they wanted to attend. Seeing that child will painfully remind them of their loss, which they are certainly still grieving. I can’t blame them their anger, but as well they should realize that you obviously had no malicious intention. In the future, step carefully around them with your child.", "NAH except you could lend a tad more compassion. I don’t think you are TA for inviting them but you are leaning towards being one with how you are trying to disconnect the reality of the situation. Your SIL died giving birth to your son.  She didn’t “pass away the same day”.  Stop being defensive, you gained a child and he lost his wife and their children lost their mom and your husband lost his sister. He is grieving and hurting, understand that instead of making it about your own feelings.", "Was going to say NAH but the fact that you wrote \"very fair monetary compensation\" changed my vote to YTA. That little fact is completely irrelevant and it makes zero sense for you to throw it in other than to curry favor.", "Yta. I hope your husband leaves you and gets full custody of his child.", "NAH because I want to believe the invite was sent out of good intentions and not out of insensitivity to BIL and his children's grief over loosing his wife and their mother. You received a beautiful glass from what is probably the worst thing that could happened to your BIL and his children.  You get to raise your son and have the family you always wanted while his children now have to grow up without their mother because  of the gift she gave to you. You are allowed to celebrate your son's birth but it was extremely insensitive to invite them knowing that it is the day their wife and mother died.  The day of their mother's death will probably never be a joyous thing for them. I hope moving forward you will leave them in peace", "NAH. There are no rules for grieving hearts, only kindness. No one should have expected anyone to know what the others would want on this first anniversary of the wife/mom's death. \n\nYour desire for your son to grow up without guilt and knowing he is celebrated/loved is valid. If you didn't treasure and celebrate him it wouldn't honour the wife/mom's memory, either. \n\nHang in there, honour the memory of your late SIL, celebrate your son's precious gift of life, be true to your own heart, have compassion for everyone who is grieving, show kindness to yourself and your husband, allow everyone to feel all of their feelings, say sorry for not knowing, but don't expect yourself or others to know how to celebrate both lives; you'll all be figuring this one out as you go.", "NTA. It sounds like maybe your BIL and possibly even your husband bear some resentment against you and your son over the death of your SIL (even though it was no one's fault). I know they will likely want to spend the day as a family mourning, but it wasn't wrong of you to invite them, as a coutesy.", "NTA, and yikes at this whole situation.\n\nTheir father's reaction is 100% understandable. Your husband's isn't.\n\nI'm not sure how, in the year since your son's birth, you don't have a finger on the pulse of your relationship with the father of these cousins, but I'm not in your life.", "Info: Why weren’t you allowed to invite them? Why was the dad angry?\n\nEdit: Yeah, I sound pretty stupid for asking even when it’s pretty obvious. I apologise for that.", "Soft yta, it was insensitive to ask that family to come celebrate the cause of their mother’s death. You probably should have spoken with your husband first how it would be perceived. They probably have something planned to mourn the first year of their loss. You kind of sound like you lack empathy or compassion to\nNot consider that they done want to Watch you smile and blow out candles on cake in celebration of her death\n\nEdit to also add you do sound selfish that your husband wanted to celebrate your sons birthday on a different day out of respect, and so he to could mourn the loss of his sister. She gave the ultimate sacrifice for you to be a mother and now her kids are without a mother. You think your sons going to remember if his 1st birthday was on the exact date. I guarantee all your in laws are going to remember you couldn’t even respect the grieving process for entire family.\n\nHow upset are you going to be when no one on your husband’s side comes because they all chose to honor the loss of his sister, on the first year atleast. Again your lack of awareness is astounding", "INFO So you still see your BIL but never discussed your son's birthday? It never came up? I don't believe you.", "Yta omg, how insensitive can you be.  'hey bro, remember the day you wife DIED and you became a widower and single parent?  Let's paaaaaaaarty!'", "His sister did such a selfless act and ended up dying from it, I can’t imagine the pain everyone is feeling, news flash it was an unfortunate event but I wouldn’t be surprised if he’s cousins resent him or blame him for their moms death! His birthday will always be a painful reminder that they lost their mom while he gets both his parents. You should be so grateful you got a child but you need to do better! They are hurt!", "[removed]", "YTA. \"Unfortunately, due to complications she ended up passing away on the same day our beautiful boy was born.\" and \"feel guilty for something that wasn't anyone's fault\" do not go together. Your husband's sister would not have been pregnant if not for surrogating for you. \n\nPregnancy is a life threatening condition. Professionally managed surrogacy agreements include clauses about the baby, the birthing person, and things like life insurance should anything unfortunate happen to the person doing the job of being pregnant. \n\nYour husband asked you to pick another day and you chose not to. This compounds the grief of your husband for his sister, the guilt he must feel, and to then invite the children of your DEAD sister in law and her husband. What is wrong with you? Apologize. Move the party. ASK your BIL if he would prefer you do not invite them over for any celebration of your son's life in future. Ask him if there is any way you can help him during his grief.", "You don’t seem overly cut up or sympathetic. You mention “monetary compensation” as if that was the main thing - she got paid so, well, tough?! I’m sure that’s not what you meant by this post but it is coming across like, since you got what you wanted, a baby, it means the children and husband who lost their mother and wife should just “suck it up” or even be grateful you invited them to party on the death anniversary.", "YTA", "this story must be fake, no one can be so selfish and heartless.", "[removed]", "Yta. Mega AH", "Jesus Christ.If you are so insensitive just run it through your husband first.It is really embarrassing to ask her husband something like that,when you and your husband,are basically the reason that she died,even if it was an accident.\n \n\nWhy on earth didn’t you talk with your husband? Also,you could have done it an other day.", "YTA kindest judgement would be insensitive to your BIL and niblings grief. Calling you a murderer seems a little rough, did your SIL plan on having no more children before she helped you?  If not she may well have died having her own child. Pregnancy and childbirth is dangerous especially in USA.", "YTA, there is no doubt there. But I do have a different take on the whole party on that day aspect.", "Omg oc Yta. This is heartbraking. I can't believe how some people can do this to women. \nAdopt don't buy.", "Do you have any sense whatsoever?", "Soft YTA, this is your baby that you always wanted and now you have baby and you’re not supposed to celebrate the first year of their life? Everyone knows their first birthday is more for the parents, not the kids. I understand that this is the first anniversary of your SILs death which was tragic and heartbreaking and yes you should have taken this year to allow your husband and his family to mourn but at the same time.. I have questions like.. are they going to be this way every year on your baby’s birthday? Are you worried about how your husband and his family will look at your baby from now on? Instead of excitement and love, are you worried they’ll just see sadness and loss? Maybe do a small celebration with just you and baby on your own and let your husband and his family have their day to mourn and miss their lost family member.", "This is one of the most cold hearted posts I’ve seen on here. YTA", "ESH", "Yta...it's the first year since her passing how can you do this?\nYou can celebrate it on any other day a lot of people do this due to it not being the weekend etc.\nYour lack of compasion to a family who gave you your son is disgusting! \nYou simply only think ohhhhh my son but the boy wouldn't be here without your dead Sil who gave her life for your kid.", "YTA. YTA. YTA. YTA. YTA. \ndo a different day. YOUR family is hurting and grieving. The baby doesn’t know. I also will highly recommend seeking professional help for yourself to unpack all of this. You chose to have a surrogate due to risks for yourself and the surrogate, your sister in law, died.", "YTA. I’d ask you to do some self reflection but considering your username appears to be “mom” then I’m guessing your son’s birthday/the day your SIL DIED, I think I already know what conclusions you’ll come to", "This is the problem I have with surrogacy—too often the surrogate is taking these risks with her body because she really needs money, or feels pressured by relatives to do this for them. Her husband has a right to feel resentment. Sad. YTA", "YTA. You invited the kids and their dad to your kids BIRTH day,  as in, you asked them to celebrate him being born.  The very thing that cost their mom their live!!!\n\nIt would have been thoughtful to dedicate the actual day to your SIL, since you owe your sons literal life to her. It doesn't seem to be anybodies fault, but bottom line is that they lost her. Why would they want to celebrate anything that day,  let alone this?!\n\nAlso, your son is going to be 1. He won't remember celebrating his birthday at a different time, let alone feel ashamed.", "Definitely YTA", "NTA however it will always be a sore spot.  She did you a blessing but sadly her sons lost their mother trying to make you a mother.  You did NOTHING wrong and it was not your fault but it seems like there are misguided feelings still there from Dad and maybe Hubby if he didnt talk to you beforehand.   Your husband also lost his sister and he may also feel guilt along with missing her.  since its the 1 year anniversary consider this year, remembering her and having your childs birthday party on the weekend before or after and just a family celebration with you and your husband that day.  When he is older he will remember, this year he will not", "NtA- they can always decline due to grieving. Is it really a big deal?", "NAH. This is a horrible situation where no one is ever going to 'win'.\n\nOP's son will always have his birthday on the day that his aunt/surrogate died. This will be something that everyone in the family has to deal with for the rest of the son's life. There will always be complicated feelings about this. And while the first birthday can easily be rescheduled for a different day, the family does need to start the process of figuring out how they are going to navigate this moving forward. And it's always going to suck, even when celebrations happen on the nearest weekend because children's parties are hard to do on weeknights.\n\nInvitations are also not summonses. OP's husband certainly knew that the party was on the day of, so the choice to reschedule was already rejected by the parents. At which point, does OP not invite her BIL and niblings? Would that have sent the message that OP wasn't thankful for everything that family has gone through so that she could have her son? That's certainly not the message I would think anyone in her position would want to send. So the invite basically says 'if you want to come, you're welcome.' \n\nThe only thing OP could have done better was to put a note with that said she understood if her BIL and niblings didn't feel up to the party, as that's perfectly understandable. It's not like the son will remember anything about this party.\n\nAnd I would give the BIL a lot of grace. This has been a nightmare year, and this birthday is a reminder of everything he's been through. He's grieving. It's not the best that he's taking things out on OP, but this isn't something you heal from in a year.", "NAH, this is a situation that for obvious reasons hurts everyone. It comes off as selfish as you had to have his party on his bday, its possible to have bdays days before, if you have a party obv you should invite them otherwise you would come off as an ahole as well, but then again if for the indefinite future, your son's bday has to be held not on his actual birthday, he could start resenting everyone for mourning on his birthday for something that wasn't his (or anyones) fault. There's too many aita posts where a child is resented for the mother dying during childbirth for everyone here calling you TA for a situation with no perfect solution.", "NTA- and  OMG- I am so sorry- this is horrible. I would reach out to BIL and just say- I am so sorry, I didn't know, and even if I should have- I am sorry. To your husband- I'm not a fucking mind reader- you have to tell me when there are mines in the minefield so I can avoid them. Not telling me set us both up for this and you have no fucking right to be mad at me for something you didn't tell me and in fact, you owe me an apology for hanging me out to dry.", "NTA", "NAH.\n\nThis seems like a really tough thing to navigate.\n\nLike I totally understand why that family wouldn't want to go.  Unfair or not, the birth of your son is also the death of their mother, and there is likely some blame, as misdirected as it is.\n\nI also don't think it was wrong to invite them to a party, though you probably shouldn't have done it on the actual day.\n\nBut I feel like maybe this should've been a phone to discuss it instead of the way you did this invitation.  That seems like a conversation to be had, not to be surprised with it.\n\nNo, your son shouldn't grow up feeling guilty.  But you also have to acknowledge that your son will likely be seen as the reason those kids don't have a mother, at least for a period of time.   Also, I feel like you are kind of minimizing the fact that she died giving birth here.\n\nThis is just a tragic situation all around.  Good luck to you all", "NTA for inviting them but YTA for completely disregarding your families grief. It's been one year since their mother, wife, and sister died, and you thought it would be a great idea to have your babies birthday party on the same day? When the kid is older, sure... I guess but right now? Why does it matter? It would have been much more consideredate to have done something to celebrate or mourn their loss. Death anniversaries are hard, especially that first one. You come off as someone who is just so happy to have their baby that they can't see the feelings of anyone else around them. I worry this is going to cause you to lose your husband and access to that family.This situation obviously sucks and of course, it's not you or your sons fault, but my goodness please have some level of empathy.", "Oh OP, this is tragic. \n\nYes, you were completely in the wrong. Apologize profusely to BIL IN PERSON. You were given a fabulous gift that cost him and his sons everything. Just go take care of it right now. \n\nAnd it’s okay that you messed up. You love your child and you’re a new Mom. \n\nNAH", "Exactly!  She basically killed her SIL, left 3 innocent children to grow up motherless and widowed a man but doesn’t give a flying fuck about any of it because she has what she wants and that’s all that matters!\n\nOP - you make me sick.  I literally do not have words for how vile and entitled and disgustingly selfish you are.  \n\nYTA", "What really gets me is that fact that OP's husband specifically requested that the party be on a different day and she said no! Why would OP not want to honor the woman who DIED in order to make her a mother? It just comes across as insanely selfish IMO.", "Yes!! The judgement not calling her a surrogate really made me cringe..\n\nIt was her SIL.. the person who gave OP her baby, and died providing that gift. I cannot even imagine the pain and guilt her husband feels about his sister dying after birthing his son.", "The \"fairly compensated\" comment really threw me. Like, this wasn't some random stranger you hired to carry the baby, it was LITERALLY her husband's sister.\n\nAll the money in the world doesn't excuse or negate their grief losing a loved one. And while I can appreciate her struggles with infertility, the child's birth did directly lead to the sister's death.\n\nThe widower and sons are certainly not required to put aside their grief to celebrate.", "I agree with you, what she meant to say,  is she doesn’t want to feel guilty about her SIL death she wants to celebrate her child because she finally has a baby and she wants everyone to join in.  \n\nObviously, she’s the least emotionally invested in this woman as it’s not required to love an Inlaw. Not the way a sibling loves another or husband loves his wife or of course children love their mother. .", "Exactly. Your son won’t realize the actual date until he’s 4-ish.", ">you’re going to need to acknowledge the loss. Your kid is turning one and will never know what day their party was on. Move the party, go to the cemetery with them, and show them support.\n\n\n\n\nSomeone please give this an award", "Exactly this. She didn’t die the same day, she died giving birth. I understand that’s a lot to deal with but it also has to be faced.", "I could not have worded this better myself. I wish tons of healing to OPs family and may she pull her head out of her own ass long enough to realize that the world doesn't revolve around her baby and that the rest of the family is grieving.", "The same as before (We celebrate holidays and birthdays together) except that my husband supports them financially now", "I also really hate that her husband made a reasonable offer to celebrate on a different day, and she refused because she “wasn’t about to let her son feel guilty about something that wasn’t his fault”. This woman is a thoughtless and insensitive AH.", "She invited them to celebrate on the first anniversary of their mother's death if she died during childbirth OP is a monster", "Yeah, this is a big yikes. It's not hard to see how \n\n> Sadly, carrying a pregnancy would be a huge risk to me\n\nPlus\n\n> Unfortunately, due to complications she ended up passing away on the same day our beautiful boy was born.\n\nIs going to be seen as some kind of macabre trade, even though it wasn't meant to be one.", "It's the 1st anniversary of their mothers death, OP is an asshole", "Birthday shouldn’t have been celebrated on the same day. Common sense.", "Their mom DIED. This women is beyond selfish, I cannot believe there are people at oblivious as she is how messed up that is. The women sacrificed her life. Have some damn respect. Have a small party for the baby so he can smash the cake and all that but damn a whole shindig? Give it a couple years. Let these people grieve even if she has no heart.", "Mmh I think that sometimes whether intentions are good or not, it doesn’t really matter. What matters are the actions (or non actions)", "OP wrote this post in a way that circumvents the fact that SIL died giving birth to OPs son. She didn’t simply “die the same day”. She died giving birth to OPs son. Point blank.", "Omg the women died. She should also be grieving. Her baby deserves his birthday but he is 1. Why not give a couple years to honor the women who lost her life to give him his.", "Her husband lost his sister! Of course he won’t want to celebrate on the first anniversary of her death.", "So the husband is just suppose to forget his own sister’s death to accommodate a baby who won’t remember their first birthday party anyways?! It can 100% be held a different day. No matter what, that baby even though he is a blessing, will forever be a reminder on why OP’s SIL is not here.", "He lost his sister. Could you explain your mental gymnastics as to why his reaction isn't understandable?", "Sounds like he didn’t like his surrogate wife dying in childbirth and no one is talking about it.", "My guess would be they'd be grieving the loss of their mother/wife. The event for them was a tragedy.", "His wife died while giving birth to OP's child, so birthday is also anniversary of her death.", "Sorry I should've been clearer, SIL was their mother and my husband says it's insensitive to expect them to celebrate on the day she passed", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Well, their sister, wife and mother died, what do you think?", "It's a toss up, it's a day of celebrating life, one that was lost and one that was given. She could have been more tackfull in the invite, and discussed it with her husband before hand, to see if they should do something together. But I see no reason why she should postpone her child first birthday, even if it's with her and her husband and a cake with a single candle in it.", "I honestly think the best would have been for OP not to even send a formal invitation at first. Have either her husband (or someone else in the family) gently reach out - privately and face to face - and explain that there would be a party for the son and ask if BIL would want him and his sons to be included and then only send the invite if given the okay.\n\nSending an invite as she did meant this poor man got mail that was basically a festive and celebratory reminder that his wife had been dead a year.", "Wow. You are as dense and this women. Their mother DIED. The baby is a baby. She sacrificed her life for this women. Have some damn respect. Her husband probably thought he didn’t need to tell his wife what a stupid stupid and thoughtless action this was.", "I didn't know your wife died giving birth to my son?  What???", "\"Sorry, I didn't know your Wife and your Sister died, I'm not a fucking mind reader\"\n\nClassy.", "i wouldn’t say she “basically killed” her SIL, OP had no way of knowing what would happen during birth. OP is an AH for inviting the husband, but we shouldn’t blame her for something no one knew would happen.", "What OP did was in poor taste, however, TF is wrong with you? OP didn't kill anybody, pregnancy has risks, if you're so eager to blame anyone, blame a failing medical system. YTA", "\"Basically killed\" is completely out of pocket. She's the asshole, but complications due to surrogate pregnancy are not comparable to murder. \n\nI get what you're saying--BiL has the right to be furious, even bitter about what went down-- but SiL's death isn't on OP, whether she's the asshole or not.", "I seriously dropped my jaw when I read that her sister-in-law died giving birth.", "Yo that’s not cool. OP is obviously an AH, but she didn’t basically kill anyone unless she forced her SIL to be her surrogate. That’s not a light accusation to throw around.", "That's a bit much. The invitation was tasteless but if someone passes away helping you voluntarily that does not mean you killed them.", "She definitely didn’t kill her SIL. I also don’t think it’s crazy to want to celebrate your kid’s birthday on his actual birthday, but she could have handled the whole situation a lot more compassionately. ESH.", "Yeah. Fuck her husband’s grief, right? /s", "But, but, but! She was paid fair compensation! \n/s", "And she “ended up passing on the same day”. You mean your husbands sister died giving birth y\nTo your child. She is trying to detach as much as possible to reality, not sure if guilty/grief coping mechanism at play or just cold selfishness but either way needs to look beyond her own feelings.", "You are going to lose your husband and your child with your incredibly selfish and unbelievable cruel behaviour. Wow are you ever an asshole like no other.", "You guys buy a person and murder his mother.", "So you took advantage of a poor family to provide a child for you, leaving 3 children motherless - but fuck them right you got a baby", "NAH. I get what you're saying in that this was kind of a \"damned if I do, damned if I don't\" situation. And I also get that this is going to be their first anniversary of her passing. It's just a super tough situation all around.", "I'd actually somewhat lean towards her on this. It was NOT the son's fault, and changing his birthday would also be weird as his actual birth date will still be used and come up as he grows up.\n\nIts tragic that the sister passed in childbirth, but I don't think inadvertently punishing the kid is right either.", "It definitely comes across as very callous, especially for her surviving children", "OP is not a monster.. but she is in her own world.  Sounds to me like she didn't think it all through.", "I think the fact that she says carrying a pregnancy would be risky for her but states SiL passed away \"due to complications on the same day he was born\" as if it isn't a related thing is telling. She doesn't say \"during childbirth\" or \"she passed away from complications during/after giving birth\". \n\nShe writes it as if the SiL got in a car accident or something coincidentally on the same day. It's like she doesn't... acknowledge that while not to blame, her son's birth caused her SiL's death. They are linked events but she doesn't seem to....acknowledge or grasp that. She got her baby, but SiL died - so sad, anyway - is the vibe she's giving off. I don't know if this is her just...not processing the full picture or being in denial or guilt or if she really is just that type of human. And therefore she can't even grasp that for her, yes, she got a son, but at the cost of someone else's mother, wife, sister, daughter. It's only been a year. It's still a fresh wound.", "That is true. Though in my eyes, I think it is purely a lack of communication that might construe OP as an asshole. Had she talked with them, perhaps it could have transitioned from an anniversary of death into a celebration of life. What the late mother did was a powerfully kind and selfless thing, celebrating that as the last action of her life could be beautiful. I don’t believe thoughtlessness inherently makes OP an asshole.", "You say 'of course'\n\nBut the flip side is not inviting him and learning after-the-fact that 'of course' his cousins wanted to be there, it's the only piece of their mom that's left.\n\nThis was a situation handled without enough communication or tact, but icing out the cousins without even asking could also be seen as unfathomably rude.", "> husband and was furious. That made my husband mad at me. Apparently I wasn't supposed to invite them? Which he never mentioned by the way.\n\nHe has emotions and needs that are valid. He should communicate them, though.", "It absolutely is. For a few years respect this women’s sacrifice. You are beyond thoughtless. YTA over and over.", "You're kidding right? I get you want to celebrate your child but to invite them to celebrate on the anniversary of their mothers death giving birth to your child is definitely not a rational idea. YTA for this thought process. Give them time and space.", "Because it is. Your bil and his children lost their mother due to complications with your baby.\n\nYou owe them an apology for acting so callously and expecting them to celebrate your child's birth on the day they lost their wife/mother...all for *you*.", "You're husband is right. YTA here.", "You sound like a monster. An absolute monster. YOUR SIL, SHE WAS YOUR SIL. NOT JUST YOUR SURROGATE.", "why would you expect them to ever celebrate the reason she died?", "It’s a shame all around. It’s only his 1st birthday though. The first birthday is always for the parents and never the kid. Don’t forget it’s the 1st anniversary of his wife and the mother of his children’s passing. Maybe you should have offered to do something nice with them to commemorate her instead. Of course they wouldn’t have wanted to go to the birthday party.", "Call, text, note, in person conversation. Yes, that would have been better.", "I keep picturing the typical invitations to a child's 1 year party and I'm cringing!  Usually they have balloons, happy things, and cutesy pics on them. I see the BIL opening the card and seeing this and feeling sick to his stomach.  \n\nI wish I could see this invitation card.", "Wow. I guess you know everything. I've seen this exact situation where the baby was celebrated by the surrogate's family as a way to honor the woman's sacrifice. There is no one right answer to this. If she didn't know how they felt, she didn't know. Communication is always superior to assumptions.", "I guarantee you that her BIL and his children absolutely blame her for their wife/mother’s death!  I certainly would.  If OP couldn’t have a child herself, she should have adopted one instead of coercing her poor SIL into having one for her!\n\nFacts are facts:  if OP hadn’t been so selfish and insistent upon having her own SIL be her surrogate, SIL would be alive today.", "And the grief of the children who lost their mother!!! Those kids are 10, 8, and 3!!! I couldn't imagine what BIL and those kids are going through.", "She got her baby that’s all she cares about", "Honestly, the situation sucks. There is no ifs, ands or buts about that. But OP is coming off as completely selfish and insensitive to the whole thing..", "Not really IMO. The only way that this could have been address using common sense, would have been not celebrating the birthday on the same day. It’s not a matter of inviting/ not inviting. The kid is not aware of the birthday at 1yr.\nWhat a tragedy", "A 1-year old cannot feel guilt. It’s the FIRST anniversary, not 5th, 10th or 15th. The deceased’s kids are fairly young (10, 8, 3), and their wound is still fresh. Common sense and sacrifice should prevail, especially for a woman who died for the biggest sacrifice. It’s not punishing the kid, it’s about respect and compassion.", "No one is suggesting changing his birthday, just celebrating it on a different day. Your party doesn’t have to be the same day as your birthday.", "I'm really struggling to understand how she possibly thought it was a good idea.", "I really don’t think her young children are probably interested in celebrating the last action of their mother’s life because it was kind and selfless. It’s been a year. A year. \n\nAnd quite frankly OP framing it as “she died the same day” doesn’t make me think she really is thinking about their pain.", "Her husband asked her to move the day. She dug in and said no, then sent invites to a grieving husband and motherless children for a party ON THE DAY THEIR SPOUSE/MOTHER DIED. That is what makes her an AH IMO.", "Nope she is just a very very selfish person. And yes being thoughtless makes you and ass. That is like one of the main characteristics of an AH", "The “of course” was referring to Ops husband. Who had asked to celebrate on a different day and was told no.  And Op could have spoken to SILs husband and asked him about the party instead of just sending out an invite.", "I just got the invite to my niece’s second birthday party in the mail and that’s exactly what it looks like. And right out says “Let’s celebrate!”. And it makes me sick to think of the dad opening something like that.", "Dude she sent them a party invite. That is crazy. The women DIED for this other women’s baby and she sends their family a party invite for that day. Not a small family get together a party. Holy crap this blows my mind. Have a party for the baby but quietly. Respect the sacrifice. In a few years bounce house and the whole deal but damn not yet.", ">Communication is always superior to assumptions.\n\nSo where was OP's communication in all this? She assumed that the family of the woman who died birthing her child would be happy to celebrate said child on the first anniversary of her death...that's an appalling assumption to make. \n\nIf she took a moment to look outside of herself and her baby she could have had enough insight to think \"maybe BIL and the children won't want to spend SIL's first anniversary celebrating the very thing that led to her death....maybe I should speak to my husband about this?\" \n\n&#x200B;\n\n>I've seen this exact situation where the baby was celebrated by the surrogate's family as a way to honor the woman's sacrifice.\n\nGood for them, but that was their decision. I would suspect that the majority of people may not find it in themselves to do that, particularly on the first anniversary.", "We have no info that she coerced her SIL", "That is an utter projection and a gross take on things. Some people actually love their relatives and take on the risks of pregnancy willingly.\n\nDeath is *always* a possibility in pregnancy.\n\nIt’s a damn shame, but she could have also died carrying a fourth child for herself and her husband. It is a tragedy that she died. But assuming it is coercion, and that it’s the result of someone else’s selfishness, is a *you* issue. Not a true fact.", "Yeah that's a bit much. I offered to be a surrogate for a few people. Some of us are glad to help give someone else the chance to be a parent. \n\nOp is definitely YTA. Being insensitive and selfish doesn't cover how they are acting. \n\nBut, we do know the risk. I'd hate to think they wouldn't celebrate one of her kids birthdays if it had been one of her's she died giving birth too.", "Where did you get that SIL was coerced target than volunteering?", "Alright look no. There is nothing here stating she “coerced” her. OPs SIL made an adult decision to be a surrogate for her, and unfortunately it cost her her life. While I imagine the husband is bitter, he was either okay with it (probably thinking she’s had 3 children already, and simply not imagining a 4th could be that likely to take her life) or he didn’t agree with it and SIL decided to go ahead with it anyways. Either way, that’s not OPs fault.\n\nWhat is OPs fault is being completely misguided in how she went about this first birthday and anniversary of her death. Very callous and at best grossly naive. She did not think through this situation at all. It’s a shame she didn’t talk to her husband before doing so as I can only imagine he would’ve stopped her from the sending the invitations.", "You are reaching. You don’t know that she “coerced her” to do anything. Blaming her is insane.", "I can unfortunately imagine some of it and it's not good. BIL probably hasn't even had a chance to deal with his own grief, because he's holding it together for the kids. \n\nBig problem with parents, we pour until empty, then start mining wells, then steal from lakes and rivers, all to keep the kids cups full. But it is never enough. Because you didn't work on your own river, you built a dam.\n\nBy the time the drought catches up, you realise all the water you tried to provide was momentary, and if you just kept the river flowing by taking care of you, you could have done better keeping those cups full. \n\nThe cups are empty, there's no where to steal water from,  and you need to deal with the devastating effects of drought for all involved, no longer just yourself.", "And that I can definitely agree with.", "I'm also questioning why she approached the father and sons first without running it by her husband. It was HIS sister who died, pretty sure he needed to be involved.", "Oh, you meant the choice of day rather than the choice to invite. Yeah, a one-year-old has no idea what day it is, and moving the date would have been easy.\n\nAs another commenter said, this one is above reddit's pay grade.", "again, I've seen it go the exact opposite way.  Your reaction is apparently the same as the surrogate's family, but it isn't universal. In the other sitch- the family made a big damn deal about the child and his birthday as a way to honor the woman's sacrifice. The two families bonded as a way for everyone to heal. \n\nStop acting like she had any intention to hurt anybody, because there's no evidence of that. If they didn't want to be approached and her husband knew that, he should have said something. It's been a year, FFS- plenty of time for that communication to have been made.", "everybody made assumptions. nobody communicated. one party does not own all the blame for that. Clearly she misread things. One can make an honest mistake and learn from it without being an AH. I expect she's learned quite a lot from the comments. \n\nIn my view, the real judgement is about what she does from here. She can be defiant or she can be humble.", "This was a beautiful analogy. I hope OP reads it. I know I'll remember it.", "I can totally understand what he’s going through. Although in different circumstances I lost my husband at the beginning of November and although we only had 1 child together I had 2 from a previous relationship and I get through everyday for the kids and I haven’t had a chance to grieve properly at all. What you have said makes a lot of sense to me right now. Right now I need to look after myself just as much as I do the kids. Thank you x", "That is a beautiful way of describing it.", "Well she said no to having it in a different day. Says a lot.", "Thank you. It took a lot of years for me to be able to see all the water theft I was doing could not keep my kids from being thirsty.\n\nAnd it still takes A LOT of work to remind myself of that. \n\nUnfortunately I do not think OP has the emotional capacity to understand this. The way they wrote, sounds like SIL was just an incubator", "I am so sorry for your loss. And I am so sorry if that makes you upset, because I used to get so mad when people said sorry. My anger was always 'did you make him die!? No! Then why are you apologising!?'\n\nPlease take care of yourself. It took a few years for it to catch up to me, and it wasn't by choice. My brain just decided 'you're done hiding from this'. Take care of you, you have suffered a life changing event.\n\nIf you are not ok, you cannot make the kids ok. And no amount of strength or perseverance will change that. It will catch up. I wish you all the best. Message me anytime if you need to. Its been 6 years for me, and I had no one to help me on this rafting trip, I will be there for you if you need it xx", "Sending you some love and hugs!", "Seriously?\n\nThe baby is going to be 1 it's not like it knows what day it is.\n\nEither this woman has mentally separated herself from the situation as a form of self-protection from any lingering guilt or she truly doesn't care because she got her baby and that's all that matters.\n\nI hope it's the first one and she can recognize that and be a bit more empathetic in the future.", "No at all. It’s fine. It does make it harder though. \nI hate when people ask “how are you?” I know they mean well but it’s like how do you answer!! \n\nThank you I am very lucky and have a great support network around me. Unfortunately I also have a couple of friends who have been through the same thing. \nI really appreciate you saying that though and it might be easier to reach out to someone who doesn’t know us xx", "I honestly think separating herself from the situation as a form of self-protection is very likely. The way she put it in her post “she unfortunately died the same day” suggests a very real level of disconnection from what happened. She died having the baby. I think this whole family probably needs some very serious therapy to deal with this.", "The petty part is like 'HOW DO YOU THINK I AM!?!?!' but the human part recognises the attempt at being there for you. Its hard. \n\nI'm always available if you ever need a stranger.\n\nYou are strong, and brave, and you're going to be fine. You and the kids xx"]}