{"id": 3621, "submission_id": "z90sdx", "title": "AITAH for telling my wife that it's no longer \"her\" money but \"our\" money, for now.", "selftext": "my wife and I are finally moving in together (long story, don't ask) and today we were discussing finances. \n\nNow between the two of us, I have more bills and all that and have a pretty good grasp of all my bills. \n\nMy wife on the other hand doesn't have any bills presently but saves her money like crazy. She's also not the type of person to make random purchases or anything major for herself.\n\nWe were discussing the process for moving in, discussing a rental property Ive been working towards and so forth when she asked about getting a gaming console that costs about $400. She had stated she will use her own money\n\nNow we will already have one that, though not brand new, can do the job well enough. \n\nI told her that I'm not on board with that idea because once she and I are together I'll need her help to manage the bills. And since she will not work for a bit it's important to conserve as much as possible. Since the whole movie alone will cost us $5000 easily between plane tickets, transport, etc. Which I will need her help on. \n\nShe immediately became distant and upset even after I explained once she works full time and we are financially secure then put money aside for yourself or we can joint the savings and pay together but it's too risky to try and do this until such a time. \n\nSo. AITAH for telling my wife that she cannot use her own money to buy a gaming console and instead should use it to help pay for the move?\n\nEdit: this seems unclear and I apologize, let me clarify the situation. \n\n1. My wife has about $2000 in her savings. The plane ticket alone will cost $1000. She will be coming to my country with only $1000 in our currency.\n\n2. I, on top of having standard bills, will have to pay $2000+ for a plane ticket and probably another $2000+ upon return for the first and last month in rent. I have enough to cover this but moving forward each month will come to about $2200+ to which I bring home $2400 a month this is not fracturing in anything random like fuel costs because I work from home. \n\n3. My wife wanted to spend her remaining balance to a gaming console even though we will already have one. I suggested that we hold off because it may be difficult to get by on a single income until such a time that she finds employment and I may need help with things like food or utilities. \n\n4. I also will not spend any money on useless items because I simply cannot afford to. We both have an agreed upon rule that whatever applies to one applies to the other.", "created_utc": 1669836810, "permalink": "/r/AmItheAsshole/comments/z90sdx/aitah_for_telling_my_wife_that_its_no_longer_her/", "score": 46, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my wife she can't spend her own money on a gaming console and requested she use it to help with the move.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO\n\n> My wife on the other hand doesn't have any bills presently\n\nWhat does this even mean?\n\nWhen you say \"doesn't have bills\" are you using that as shorthand for, like \"doesn't have *a backlog of unpaid* bills?\"\n\nBecause, like: Rent, health insurance, electricity, gas/oil... how does someone just *not* have bills they have to pay?", "this sounds very much like children playing house. Have you not sat down and discussed how expenses will be handled now that you are going to live together?", "Wait, you make 2400 and live in a 2200 apartment. How have you been able to eat at all? \nFrom your replies and such it sounds like your wife is young, still lives with her parents in probably a pretty poor country. \n\nAlso, even if she doesn't buy the console, how long can you even eat for the 400 dollars? This whole international move while you already can't afford rent sounds like an awful plan.", "Info: when you say she’s doesn’t have any bills, do you mean that she isn’t contributing at all to shared expenses or she entered the marriage without debt?\n\nEdit: Her total savings are only 2k? And you’re in Ontario?\n\nHer savings can barely cover a month’s rent in the GTA. \n\nShe can’t afford the move/rent/bills and you will be covering the bulk of the expenses for a while. You two are planning on surviving on 200$ a month and she wants to spend twice that on a console? In this economy?\n\nUhm….yikes. NTA.", "Your post is not painting a clear picture of her finances. She saves like crazy and only has 2000 and is not working. So of course she should pay her share of the move and bills. \n\nYou are making it seem like she has all this money saved for bills, the move and the console but you don’t want her to buy it. In actuality she cannot afford it if she helps with the move and bills. \n\nNAH", "YTA.  It’s *her* money.  By your own admission, she’s more than responsible enough with her savings to be able to afford it.  And if your idea of combining households is “I now have ultimate authority over everything budget-related because I say so,” she really ought to pump the brakes on this whole moving thing before it’s too late.", "NAH. You believe that as a married couple you should make financial decisions together while in her opinion your financial life is separate from your marriage. These individual beliefs don't make either of you 'assholes' but it does make you incompatible. Sounds like an irreconcilable difference which could end up being a major problem if you ever have kids. Might be best to settle for an amicable divorce now. She sounds like a financially sensible woman so I hope she had you sign a prenup for her own protection.", "So let me get this straight. She has a lot of savings and is frugal. You have no savings and you spend all your money. She wants to spend some of her own and now you're saying it is \"ours\" and she may not. YTA.", "ARe you saying you pay rent or mortgage?", "ESH - did you both not have a conversation about how finances would be handled prior to getting married, or at the very least prior to moving in? \n\nHonestly, it sounds like neither of you can afford this at all. Having your wife “not work for a bit” while you have $2200 in fixed monthly expenses and you only make $2400 is frankly insane. $200 wiggle room a month, and I’m inferring from you saying she “saves like crazy” but only has $2k in savings that you don’t have much in savings either and that you’re almost draining both of your life saving? Idk man. Sounds like a bad plan on both of your parts.\n\nShe’s an AH for seeing all that and regardless of wanting to combine finances or not wanting to buy an extraneous, expensive gaming system even though she’s draining her life savings. Now is not the time.\n\nYou’re an AH because you cannot tell her what to do with her money if she doesn’t agree. If she doesn’t want to combine finances and both of your currents funds don’t fit into your plan, you need to change your plan, not force her into this.\n\nYou’re both the AH for not having these discussions and aligning and getting on the same page before you got married. Whether you combine finances or not is each individual couples prerogative, but both need to be aligned and on the same page prior to doing whatever any of this is.", "Holy shit these comments are insane. Your edit adds a lot of clarity and definitely makes you NTA, but even without that a lot of the comments are making a ton of assumptions and being really harsh. \n\nMost people saying YTA have probably never made a massive, life-altering move before. There are a TON of unexpected expenses that come up when moving. Especially since you guys are married, it’s very reasonable to ask her to minimize unnecessary spending until the move is complete.", "It’s her money. Marriage does not make her your property. YTA", "Did you suggest to hold off or tell her to hold off? There’s a big difference there", "I can't help but notice you didn't include ages.\n\nINFO: do either of you know how to budget? Have the two of you discussed how joint finances will work? Are you both on the same page regarding priorities for spending? Do you have any kind of agreement regarding an allotment for \"fun money?\" \n\nThis is the kind of checklist you might want to work on as a couple if you haven't already, or perhaps consider a basic financial or budgeting class. Otherwise the two of you are in for a painful and imminent reckoning.", "YTA for being all over the plaza with your post. You say she is frugal and has large sayings. Then you say that large savings is $2,000 (minus $1,000) for tickets. Among other things that don’t really make sense.", "INFO:\n\n Are you both moving? Caues that is what it is sounding like.  You say you both at paying for plan tickets.    \n\nThis makes no sense if she is moving to be with you", "YTA if she’s smart, she’ll run", "YTA. \n\nYOU have decided that it is \"our\" money, but you didn't sit down to discuss how you are sharing your finances going forward. \n\nAnd even if you do agree to fully shared finances, YOU don't get to make unilateral decisions about what you can afford and can't. \n\nAnd then to top it off, she saves and doesn't make a lot of purchases, and you think you can stop her from making one when you admit you don't have the same savings mentality she has. So how come all this time you could spend while she saved, and now YOU think you can demand she not spend?", "You’re married and you haven’t established finances? Or lived together?", "INFO: is your wife leaving her entire support system behind to move to your country and start a life with you? If so, have you considered that her purchasing this console is something she feels will be something to keep her happy and occupied while she waits on work visas/job opportunities, without having to worry about infringing on “your” things (the console you already have is likely yours) or making new friends immediately? \n\nIt sounds like maybe your wife is a hard worker but at a job that doesn’t pay well, so she normally saves what she can and never makes frivolous purchases. She probably has some anxieties about the move and would like to do something nice for herself and give herself something to occupy her time while she waits to be able to fully integrate into working society in your country. I understand your concerns since frankly it seems like neither of you make enough money to manage this very well and things are just going to be broke and tight for a while regardless. This doesn’t seem like a situation where $400 is going to make or break the budget.", "Hang on. Your wife saves like crazy and has 2k savings? My dude that’s not a lot of savings. That’s like the cost of 1 months rent. Also how does she save if she doesn’t work?", "Yta and i would be rethinking this marriage. You've had seperate finances all this time and want to change now bc it benefits you.", "Oh, dude, you asked the wrong question, in the wrong place, at the wrong time, with the wrong people. You should have discussed financial expectations with your wife long before you got married, certainly before the move and should never have posted here about it (as you can plainly see from the responses). I'm not going to offer any judgement either either way, as I'm sure I'll probably get roasted enough as is. Suffice to say, I wish you luck and try and save a few bucks for the divorce.", "It doesn't matter if you are the A or not.  Divorces happen (mostly) because of infidelity(trust) or money issues(control).  You handle money very differently than your wife and neither of you seem to live within your means.   Ignoring the patriarchal tone of your post, if your monthly expenses are just $200 less than your take home pay, AND your wife doesn't work - $2,000 is not much.   So, neither of you are financially secure, yet you are moving to a different Country and your wife doesn't work?  So, when (not if) you go broke, will you be happy together or resentful?  \n\nGood luck. You're going to need a whole truck full of luck.", "ESH\n\ngoing a different route. It seems you both decided to get married with no thought to how you would actually survive financially. You are seriously over stretched and your wife's savings of $2000 is barely enough to move to your country.\n\nI do agree, with her finances so precarious she shouldn't be buying a new gaming system.", "YTA she has been saving money and you have been creating debt and now you fucking think you should get to decide how to spend her money? I hope she realizes how selfish and sexist you are and stays where she is and divorces you.", "Let me see - so for your marriage you bring extensive bills and your wife brings her savings, and you think you have any saying on how she should spend her money??\nY T A. Learn to manage your own money / get your bills under control before trying to tell anyone else what to do with their finances (specially when they seem to be managing a lot better than you).\n\nEdit: I've seen your edit and it seems like your wife cannot afford to move to your country. NTA.", "ESH.\n\nWhile you're right in that your wife probably shouldn't he spending that money, your attitude is awful and is only going to cause problems because it really does reek of \"my way or the highway.\"\n\nI'm not convinced you two are on the same page financially and you really should get on that before proceeding.", "NTA. I was going with Y T A before the update, but if you're paying the majority of costs including expenses after you move and before she gets a job, then it's not unreasonable for her to wait to make a leisure purchase that would deplete half of her savings.", "yes, you are. while marriages SHOULD be equal in all things, YOU are coming off as \"the MAN of the house\" and what you say, goes! and \"she is the little woman and you know what''s best!\" sounds like you two need counseling.\n\nhappy holidays!", "ESH - this money conversation is LONG overdue. You aren’t automatically entitled to her money, sorry. But she messed up marrying someone who expected her to support them and pay their debts.", "Have you ever expressed these financial views or desires before, or in recent memory? Did your wife agree to this new financial arrangement?\n\nFrom what you've posted alone, it seems like you sprung this on her without warning and just expect her to suddenly be on the same page regardless of what she was saving her money for before now, if she had an idea or goal she was working toward. Up until this exact moment, she was probably saving for herself and for future financial stability's sake. Telling her what to do with her money while also dropping the bombshell of \"It's OUR money now since we will be living together\" does make YTA.", "YTA ahh.. Actually money she saved before marrying you is her money. Only money earn after marriage is \"our\" (well you and her) money.\n\nYou guys should open joint account and start saving towards the move together. Yes you should not have to foot the bill alone, nor should she.\n\nIf she wants to buy a console with her money and it will not hinder you two saving money for the move then you have no right to control her.", "YTA\n\nYou came into the relationship with your debt. The debt belongs solely to you. Just because she is a saver does not entitle you to her savings.", "Your initial write up makes it sound like your wife has no debt and a paid off home (how else would she have “no bills” that she’s responsible for?) and saves a ton. Then in your bullets, you say she only has $2000 to her name and that you both have $5000 in moving costs coming up and she’s unemployed.\n\nThose statements can’t all be true. I’m going with YTA until you can provide a true account of the situation.", "NTA\nHonestly, you should be supporting each other right now, so I get your frustration.\nI don't think it is worth the upset though.", "Yta. I can almost guarantee you would not have the same energy if it was her with all the bills and you with all the savings.", "Sounds like she’s not the type to make random purchases or anything major for herself.\nSo she can buy the console that she decides is worthwhile, even if you don’t agree.\n\nYTA", "YTA. Your wife can do whatever she wants with her `own` money. \n\nHowever, she is responsible for covering any expenses that you will BOTH share (rent, utility bills, furniture, etc.). This includes the moving expenses as well. She is not responsible for any of YOUR bills that you had prior to moving in together.\n\nI don't recommend moving in together if you're not comfortable with how she'll spend her money, especially if she doesn't have a full-time job.", "YTA this was money she had before you came along", "YTA. This should have been discussed before the marriage.", "YTA \nI hope you plan to cover most of the bills when you to move in I feel like you want to combine money to alleviate financial pressure on you and  YOUR bills. \n\nSounds like since your wife saves like crazy. If you guys combine finances, you’re gonna try to tell her what to do her money. You guys are gonna have a lot of fights about that. \n\nAnyway, you can’t tell her not to buy the consul if you also say she saves like crazy. You just want to control the money so that is free to pay Your bills \n\nOr go 50-50 on household expenses to alleviate pressure on you paying your bills. \n\nI hope you do not plan on having children, because when your wife has to take maternity leave, doing 50-50 on essential bills like rent electric, the financial burden will again return to you while the household and child rearing is probably going to be mostly on her. It will be a stressful time Try to cover your household expenses with your money do not rely on your wife’s. \n\nBut I’m not saying she can’t help pay for the move, but if she has a savings stop telling her what to do her money. \nI think she’d be hesitant to combined tbh", "YTA\r  \n\r  \nIt's **HER** money. She has a good savings, has no bills, she has the money and YOU don't. Now you want her to move in and take on all your bills as well, in addition to shared bills such as ulilities. Basically you don't want her to spend anything on herself to make sure she has money to help you pay down your own debt. \r  \n\r  \nHopefully she's on Reddit so she sees this and doesn't to a joint account with you. Her money is her money, not yours. marriage doesn't change that. Also, she's a gamer and wants a new console, I'm a gamer as well (and female) and can tell you that older consoles crap out after a while and won't play the newer games. Jesus man, get over yourself.", "NTA - Some marriages try to have separate accounts and try to have his and her money.\n\nBut that's not how marriage is supposed to work.  All income should be shared between the two of you and together y'all should decide how the money should be spent.  That's not to say both of you must ok every dollar spent.  It's fine to do things like have an agreed upon amount of discretionary spending.  But once the money comes into the family, it belongs to both of you.\n\nThere are those out there that don't know how to have a healthy financial relationship with their spouse and try to make things work by having his and her money.  But that's not how marriage is supposed to work.  After all, let's take the extreme example of a \"stay at home mom\".  Just because she isn't employed doesn't mean the husband \"owns\" all the money he brings home, and it certainly isn't appropriate in such a situation that the husband have full control of the money and give his wife an allowance.", "Based on how you’ve described the situation, YTA.  You’re talking about plane tickets and transport (I’m assuming stuff?) but not who is moving closer to who or if you’re both moving.  The way you’ve written your story, it sounds like you want her to pay for your plane ticket, it also sounds like you want your wife to start contributing to paying off your debt.  This might not be the case, but your writing is putting me in that mindset.  Your debts are yours and her money is hers.  Unless you can come to a mutual agreement, back off her bank account.", "Not enough information.\n\nIf this was your first time discussing money, you need a to know some hard truths.\n\n1.  Both of you have to agree on how finances will be split up.  50/50, % of income, or something else.\n\n2.  How many checking accounts?  1 or 3…. One if you both pool money 3 if it's going to be yours, hers, house.\n\n3.  Neither of you get to tell the other how to use their personal money.\n\nPersonal accounts are never used by the other party.\n\nWhat you said was pretty asshole .  But you need to answer why you feel entitled to it.", "I'm going to go with an unpopular opinion - NAH. BUT - you two need to get on the same page wrt finances NOW! You need to discuss, and agree. There's nothing wrong with couples having separate finances. How one handles money can be a very personal and triggering thing. Money is security, and it's never a good idea to mess with your partner's sense of security. You must also realize that YOUR opinion on how to handle money is not the ONLY opinion that matters, or is valid. Talk with your partner, and involve a counselor if necessary. But you two need to get on the same page before you jump into marriage or moving to a different country!", "YTA", "She brings funds and you bring bills…..and now you want to ‘share’? Lol!! Good one\n\nI hope she leaves your ass \n\nYTA", "YTA. \n\nPerhaps she’ll reconsider coming to your country and having to support you. Sounds like she’s better off without you.", "NTA\nIt's more irresponsible spending then you telling her she's not getting it. You guys can't afford it ATM. Makes sense.\n\nHave you explained to her, that's you'll get her one in time but right now with the expenses you guys can't afford it?", "NTA", "NTA as a wife and mother it sounds like the two of you don't have a lot saved and the move is going to take most of all of what you both have. My husband and I communicate back and forth even before we were married and made financial decisions together before we even started living together. Also sounds like there isn't going to be a lot of wiggle room after the move financially until she finds employment. Maybe if you didn't communicate well you could have come off as a jerk but it doesn't sound like that is your intention. Also that you didn't necessarily say no but said we should wait until later in my opinion is a good idea. Buying new expensive things during a big transition that is unnecessary is not the best idea especially if you don't have 10k or more in savings.", "Your wording on original post is going to get you a lot of YTA - it wasn’t clear that there is an expensive move and she will not be contributing to your shared bills. \n\nI think you two need to sit down with an excel sheet and look at a budget. With your breakdown a new gaming console does not seem like a prudent decision whatsoever. For her nor for you both as a married couple. She should hold up until she gets a new job in your country. You paying all of your *shared* bills while she plays games doesn’t seem logical and I see your frustration and why you are conflicted. But you are right. With your breakdown of prices it is not right at this moment. \n\nCounter offer: Tell her when she gets a job after the move you will buy one for her and she can keep whatever money she may have spent on it on herself if she wishes. NTA good luck on the move!", "YTA. It’s HER money. She saved money up and now wants to get something nice. Just because you’re married doesn’t mean you can tell her what she can and can’t buy with money SHE saved. You sound controlling and that needs to stop. Full stop. \nWhy does she have to contribute to YOUR bills? Is it rent or mortgage? If yes, then fine that should be discussed. My parents shared an account but each paid for their own bills and split groceries, mortgage, and utilities.", "YTA\n\nGood grief.", "YTA", "YTA. She is not your piggy bank.", "YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nmy wife and I are finally moving in together (long story, don't ask) and today we were discussing finances. \n\nNow between the two of us, I have more bills and all that and have a pretty good grasp of all my bills. \n\nMy wife on the other hand doesn't have any bills presently but saves her money like crazy. She's also not the type of person to make random purchases or anything major for herself.\n\nWe were discussing the process for moving in, discussing a rental property Ive been working towards and so forth when she asked about getting a gaming console that costs about $400. She had stated she will use her own money\n\nNow we will already have one that, though not brand new, can do the job well enough. \n\nI told her that I'm not on board with that idea because once she and I are together I'll need her help to manage the bills. And since she will not work for a bit it's important to conserve as much as possible. Since the whole movie alone will cost us $5000 easily between plane tickets, transport, etc. Which I will need her help on. \n\nShe immediately became distant and upset even after I explained once she works full time and we are financially secure then put money aside for yourself or we can joint the savings and pay together but it's too risky to try and do this until such a time. \n\nSo. AITAH for telling my wife that she cannot use her own money to buy a gaming console and instead should use it to help pay for the move?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I think you need to talk again about expectations and responsibilities of married life. Her expectation IMO is not in line with setting up a household together. Bills and living expenses should be considered before upgrading entertainment. You were married before setting up a house and until you can achieve the goal of living together, you both should contribute to the needs of the transition. Not a popular opinion, but NTA.", "NTA. You aren't telling her no, you're telling her not now. She only has $2000 in savings and half is going toward her plane ticket, you have moving costs which you are covering, you'll only have $200 left each month after paying bills, she doesn't have a job, and you don't know how long she'll be without one. If you're splitting bills but she doesn't have a job yet how will she pay her share? If she can't see that finishing the move, her getting a job, and ensuring your finances are stable before spending on luxury items is more important, you will have bigger issues in the future.", "So plane ticket plus console is $1400….out of 2k savings……and she has $600 left. And doesn’t work. And still wants the console. She is a massive asshole \n\nNTA", "YTA for the long story don't ask part.", "Single income household, and its your income? Hella NTA. She needs to be way more responsible with her money if she is expecting to share a place with another entity.\n\nHow she gonna pay for things in the future?", "Nah but you two can't afford this move. Her money, our money... Doesnt matter if you don't have any money, which it sounds like is about to be the case.", "YTA. RUN, GIRL, RUN!!!!!!!!!", "Why are you two even married ?", "YTA", "INFO: I'm sorry, this is still unintelligible even after the edits.\n\nDo you have separate finances or joint finances? You talked about this before you got married, right?\n\nIt doesn't matter how much the move costs or how many game consoles you have. Is she contributing her share of the bills, however you guys worked out what that would be?\n\nWe really need some kind of understanding of how you plan to split expenses before we can make any kind of judgment.", "After the edit definitely NTA.", "YTA.  \n\nWhy does she have to cover your bills?", "I'd say NTA for saying you'd think it'll be a better idea to wait till she's more settled and has adjusted to the new environment before making a big purchase but your delivery is deff YTA", "Nta. You guys have no money. You need to start saving for things like food", "NTA - if the gender roles were switched I wouldn’t think the woman is an AH, I would think she’s being responsible and thinking of the future.", "NTA. When you are married it’s not your money/ my money. It’s ours. You work together as a team.", "NTA I feel like you explained this poorly but after reading your edit.\n\n-She doesn't have a job \n\n- Your covering all of the shared expenses for the new move\n\n-she'll only have 1k in savings before buying the console \n\nI agree with you, now isn't the time for major expenditures until she gets a new job.", "NTA. She only has $2000 in savings and will only have $1000 after buying her plane ticket. $1000 isn’t a lot and should probably be held onto or contributed to the needed expenses. Considering the big change happening it doesn’t seem financially smart to immediately buy a $400 gaming console. \nYou should both have a conversation about finances moving forward, whether you have your own bank accounts and contribute x amount to shared expenses or whether you combine finances and figure out your budgets. Best of luck with the move!", "Maybe young and lives with parents who pays for all that?", "I don’t think this guy has a grasp on anything. The woman’s savings is $2000, and his rent is more than that per month. This sounds so much like a mail order bride situation or something. Or someone the guy met online but never actually saw, and now she’s moving to a whole other country.", "Omg they’re in Ontario? LOL. I live here and I’d be livid if my spouse spent $400 on a gaming console when they didn’t work and had 2k in savings", "Yup. Until I read the edit I was on Team Y T A, but the edit changes everything. $200 a month for food, utilities, petrol, etc is not feasible. I'd imagine in a Canadian winter that would be the heating bill for one month.", "Yeah based on the edit, definitely NTA.", "But from the gist they aren't saving to together, isn't actively working atm, and needs to pay bills for the move as well as other necessities again it's gonna be their house a want purchase can wait to secure their needs first", "Agree with NAH. It’s her money, but it’s also not responsible for her to be spending $400 on a gaming console if she only has $2,000 and expenses coming up. I was prepared to say OP was TA based on the beginning of the post and the title, but the details about everything else made me change my mind. I hope this is something they’re able to work out because money and differences in financial habits could cause major issues in the future.", "Since he edited the post, is 2000$ a lot of savings? She’s moving somewhere where that wouldn’t even cover a rent deposit.", "Did you read this?", "Rent, I wish I was paying mortgage.", "You are totally right that there are always so many extra things that come up in a move, but I’m not comfortable giving n t a here. OP doesn’t make enough compared to rent to live, hasn’t had discussions previous to move-in with partner about how they will split finances, bills, spending money, etc.  OP doesn’t save (although I’m not sure if that’s because they literally don’t make enough money to both house and feed self). So while I would totally explain why any purchases right now might not be a good thing and write out (or make a visual chart or whatever) of all the expenses that will need to be shared, all the weird extra expenses that come up in a move that you aren’t expecting, etc., I’d also say at the very least ESH since it sounds like no one has really thought through everything. \n\nAlso, for OP, once you do iron all this out, an easy way not to argue about fun spending is to budget individual  spending money for each of you into each month’s budget. That way you each get to make independent choices about what you spend on fun for yourselves. If you want something more expensive than that month’s money, you have to save up over however many months it takes to purchase it. Budget combined spending money for going out and doing things together (or gaming at home, whatever) as separate from individual spending money. \n\nAnd have your partner check out linustech on YouTube. She might be able to get a gaming rig that I will work for her for much cheaper.", "What's yours is mine. And what's mine... is mine.", "So she shouldn't contribute to her own move and should make pointless spending while I'm stuck with the $5000 bill?\n\nEdit: or help pay for food, rent, bills until such a time that buying luxury items can be more easily obtainable?", "Suggest to hold off, in the end it's her decision but I explained why I'm not on board.", "This is what I told her, that just until we get things settled that we shouldn't make any unnecessary spending but once we're good then I'll go out with her and buy one too", "We did. Which is why I'm here because we did talk about this but...here we are", "He's an AH for not wanting to subsidize their move and cover all expenses after the move until she finds a new job while she spends what little savings she does have on a gaming console? I hope you made this post before OP posted the update.", "So kinda tsol if we didn't have money for food but she had money for an game console?", "Can you not read? OP would be supporting her after the move.", "Yes, this post was made without of information that he has since added.", "I did, yes.", "Seems like a perfect representation of the post", "So you need to split the rent, that is the problem.  She is hoarding the money for herself.  You should edit your original post to say YOU are paying all the rent, utilities etc", "This sounds like you two need to talk a hell of a lot more about financial contribution to the joint household. Make a budget so you can see what's on the table. One time costs like moving affairs, and periodic costs.\n\nExclaiming that you two can't afford a PlayStation is different than having data (which will help her allocate her own discretionary spending while still contributing to the household).", "When you guys got married, what was your agreement when you discussed household spending?", "I thought you said you had a pretty good grasp on the bills.  Why are you making this move, if it’s going to make your financial situation so precarious you’re not comfortable spending anything beyond the relocation costs?  More importantly, why didn’t you discuss what you were expecting her to contribute *before* now, much less before settling on a location?", "yikes. i think you all should get divorced before moving.", "What should happen is you both keep your personal bills separate. You open a joint account and you each deposit your portion of the monthly expenses.", "It sounds like she has a big savings account from your post. She can split moving costs with you and still buy herself a console. She doesn't need to give up all her savings for your bills though. Your post sounded more like you want her to pay your bills and not let her spoil herself one time (you said she's not one to make major purchases for herself). So yeah YTA. You are trying to control *her* money and how she spends it.", "Info: does she have the money to pay her share and buy the item? Yes, YTA.", "Um yea , you said she doesn’t really buy things for her self so yea she can.", "Deciding someone else’s spending is pointless is a frequent symptom of assholitis.", "I think your nta then. She’s being financially irresponsible and immature. If y’all have agreed to share finances than you did nothing wrong by suggesting she not frivolously spend the remainder of her money on games", "You seem like a sensible guy, I don't know why everyone is being so harsh here.\nIt is only right that you share the costs of everything.", "Yea I did", "Clearly you didn't cause them moving along with bills could be a well off purchase at the moment and to hold it off for a bit cause it might take a hit to her savings is asshole behavior", "Maybe before the update. $2,000 absolutely is not a lot of savings, especially if she's going to spend half of that on a plane ticket.", "That!", "She has maybe $2000 and if that $1000 is for the plane ticket. \n\nI don't want her to pay MY bills but things like food or utilities. \n\nThat takes precedence over a gaming console.", "The original post left out a lot of context. He suggested she has a lot of savings and could easily cover the cost of a console and her share of expenses.", "I'm probably not explaining it properly which I get. \n\nThey're taking it like I'm in control of all of her money, but no. Just for this specific balance of $1000 I don't think spending $400+ on a gaming console is worth the risk of being without food because God knows how expensive it is. $100 can't even feed some people for a week.", "We clearly disagree about what constitutes an asshole. The original post read as if there's enough money to make the move but he didn't want her to spend hers. Simple reading comprehension.", "Did you meet this person before marrying her? Had ANY sort of discussion around finances? Or did you just assume that her money is now yours too?", "\nBills should be split equally 50-50", "You're painting a different picture of her finances than you did in your original post.", "I mean, I wouldn’t buy anything new before a move just in case anything needs to be replaced/emergency happens just until we’ve settled in"]}