{"id": 365, "submission_id": "yi9ovg", "title": "AITA for wanting to spend my own money", "selftext": "I'm 18 and still studying and living with my parents. I'm from a middle income family, not rich but not poor, just average. But my parents are very stingy, grew up kind of poor/not being able to spend alot of money. I worked a few part time jobs during the holidays and earned Abit of money for myself. Today I went to eat kbbq buffet it was $21 sgd ~15usd for an individual at student discount. And it's considered quite affordable pricing here for a buffet. Anyways I told my mom about it and she said it's expensive and I should only eat that kind of food once a year. I got disappointed at that comment. Considering how my parents are strict and stingy, I don't get to eat a $21 meal that often anyways, I was so excited and satisfied to eat today. But you know I don't think $21 is that expensive for food and also there are so much more expensive food and restaurant out there. I told her I worked part time to earn this money so I can spend it as I like. like it's my own hard earned money, it's mine. Then she said I was very disrespect and rude to say that because my parents spent alot of money for tuition(extra classes/programs outside of school) and school fees on me and so my money is their money. Since they spent money on them I \"owe\" them money. The thing is I didn't even ask for tuition or those stuff, they just forced me to go there hoping I will get good grades, when I protested back then they didn't allow it and forced me into it, ofc my mental health was shit, I hated it. So I shouldn't spend my money so uselessly. And she said that her and my dad don't even spend alot of money of food, most of the time they get cheap food. And that im just going off spending my money at these kind of food. And then she said again this kind of meal is what your supposed to have once a year. I got so frustrated I just cried and left. I thought my mom was being extremely selfish for saying that. I just want to eat good food sometimes, it makes me happy you know and she doesn't understand. I feel like my mom wants me to live the same way they lived their childhood, I'm so frustrated honestly. I worked hard to earn those money and it's just a $21 meal and it's not like we're struggling now and can't afford to spend money, we're doing okay financially. so am I the asshole?\n\nEdit, my bad for not giving full context, and some people misunderstanding due to cultural difference: \nI'm from Singapore (Asia) and in our culture most of us live with our parents until we get married and move out and don't pay rent but give allowance to our parents once we start working. I understand that the culture in western countries is different where you'd have to pay rent at 18y/o. From where I am this it's completely normal to not pay rent at 18y/o.and it's considered weird and frowned upon for parent to ask for 18y/o child to pay rent money. We normally give our parents allowance as a form of filial piety once we work full time after graduating regardless of whether we're living with them.", "created_utc": 1667217313, "permalink": "/r/AmItheAsshole/comments/yi9ovg/aita_for_wanting_to_spend_my_own_money/", "score": 10, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) telling my parents that my money is my Money, it isn't theirs. And I would spend it as I like\n2) I might be seen as rude or disrespectful to my party for not appreciating their money\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  I think the lesson for you is not to tell your mom how you spend your money and how much you spend.  If you are actively saving and mindful of expenditures, YOU should be able to choose where your money goes.  You're allowed to splurge sometimes!  I hope you enjoyed your buffet!", "NTA.  You earned the money and you can spend it on whatever you want.", "NTA, it sounds your mom agrees it's your money just doesn't like how you're spending it. I think the goal should be to realize that buying food out is a luxury, but honestly if you calculate you can afford it once in a while then why not.\n\nFrom the way your mom sounds, anything you do that isn't what she wants you to do she'll claim as disrespectful no matter how minor. You kind of have to get used to it and figure out how to cope with it while still enjoying your life.", "NTA its giving \"im gonna do this for you but not because i love you but just so i can hold it over your head.\" You didnt ask for her to do that, you didnt ask her to have you. She had a child that she kept, if she didnt take care of you it would literally be child neglect. She chose to pay tuition (i assume because she wanted her child to have a good education) its very nice but thats on her once again you didnt ask for it. See it as a gift really. If she were to ask for it back or something of the sort id start saving to move out.", "NTA. They are your parents, they are doing what they are supposed to do. You didn't choose to be born so they can fuck off with the guilt trip.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm 18 and still studying and living with my parents. I'm from a middle income family, not rich but not poor, just average. But my parents are very stingy, grew up kind of poor/not being able to spend alot of money. I worked a few part time jobs during the holidays and earned Abit of money for myself. Today I went to eat kbbq buffet it was $21 sgd ~15usd for an individual at student discount. And it's considered quite affordable pricing here for a buffet. Anyways I told my mom about it and she said it's expensive and I should only eat that kind of food once a year. I got disappointed at that comment. Considering how my parents are strict and stingy, I don't get to eat a $21 meal that often anyways, I was so excited and satisfied to eat today. But you know I don't think $21 is that expensive for food and also there are so much more expensive food and restaurant out there. I told her I worked part time to earn this money so I can spend it as I like. like it's my own hard earned money, it's mine. Then she said I was very disrespect and rude to say that because my parents spent alot of money of tuition and school fees on me and so my money is their money. Since they spent money on them I \"owe\" them money. The thing is I didn't even ask for tuition or those stuff, they just forced me to go there hoping I will get good grades, when I protested back then they didn't allow it and forced me into it, ofc my mental health was shit, I hated it. So I shouldn't spend my money so uselessly. And she said that her and my dad don't even spend alot of money of food, most of the time they get cheap food. And that im just going off spending my money at these kind of food. And then she said again this kind of meal is what your supposed to have once a year. I got so frustrated I just cried and left. I thought my mom was being extremely selfish for saying that. I just want to eat good food sometimes, it makes me happy you know and she doesn't understand. I feel like my mom wants me to live the same way they lived their childhood, I'm so frustrated honestly. I worked hard to earn those money and it's just a $21 meal and it's not like we're struggling now and can't afford to spend money, we're doing okay financially. so am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta. If you work you should be allowed to treat yourself every once in a while", "Why even mention it to your mom?", "If you are living at home as an adult and not contributing financially to the house (rent, groceries, etc.), all the while you are going out to eat and living a slightly more \"extravagant\" lifestyle than they can afford, then yes, YTA. \n\nIf your parents were not being very generous to allow you to live at home, presumably you couldn't afford this.", "NTA and I wouldn't tell them anything else about your eating habits. Some things can still be private even in a different culture.", "I think YTA but it depends on a few things. Are they currently not charging you rent and paying for your tuition? If you’re living with them at 18 and they’re fully paying for boarding and tuition then you’re def the ah. They are being stingy and scrapping by to allow you to go to school and live in the house you’re in.", "Maybe she just wants you to save for a house for when you’re older and married? Every penny counts. I say this based off of being a mother myself to a teenager.", "Thanks! That's what I thought too, I actually am actively saving money right now and just treated myself to a occasional fancy meal. So I was pretty disappointed with my mom's response but at least I learned not to tell my parents about my spendings early on.", "Yes I thought so too that eating out is a luxury, forgot to mentioned that I do keep track of my expenses and have saved a few thousand and going on. So I do think $21 is not that much compared to what I'm currently saving. And your kinda right I think I'll have to figure out and cope with my parents regarding money, probably not tell them my spendings and all. Thanks!", "OP is 18 and no longer a dependent minor. They can live by the rules of their parents giving them free room and board as an adult, or go float financially on their own.", "She asked me what I ate for lunch lmao it started there", "Copied this from another comment, my bad for not giving full context\n\nI'm from Singapore (Asia) and in our culture most of us live with our parents until we get married and move out and don't pay rent but give allowance to our parents once we start working. I understand that what you have said is the culture in western countries but form where I am this is normal and it's considered weird and frowned upon for parent to ask for 18y/o child to pay rent money. We normally give our parents allowance but I guess that's something similar to rent. Also we give our parents allowance once we start working full time regardless of whether we're living with them or haved moved out.", "Sure, but they are the parents. They had the kid, deal with it. He earned money he didn't have to, and that money would never be his parents anyway.\nSo NTA.", "I'm from Singapore (Asia) and in our culture most of us live with our parents until we get married and move out and don't pay rent but give allowance to our parents once we start working. I understand that what you have said is the culture in western countries but form where I am this is normal and it's considered weird and frowned upon for parent to ask for 18y/o child to pay rent money. We normally give our parents allowance when working full time but I guess that's something similar to rent.", "I respect and understand your point of view, I am actually saving money right now for the future it's just that I treated myself to a nice meal today. Also understand that every penny counts. Personally for me I do not wish to be living stingily as my parents are and want. I just thought that there's more to live then just saving every single penny, it's good to spend some money once in a while, because lives short anyways, it's healthy to do something that makes you happy.", "Sure, and even then the parents are still the AH. They had the kid and if they don't do everything in their power to have him succeed they are assholes. I am ok with cutting him off if he was failing school or something like that. But this is him making and spending his money.", "So you still aren't contributing financially to the household as an equal, but are using your money to live more flashy lifestyle than them. \n\nI double down on YTA. \n\nTake the gift of free rent they are giving you and save up for your future. Or, if you don't want to live by their rules, move out.", "I stand by what I said. If they are fully supporting him as an 18 year old then it’s their right to be upset if he’s not contributing to the household. It’s not a parents responsibility to forever pay for and support their kids. Eventually (and starting around 18), it’s the parents job to teach kids about bills and responsibilities. \n\nThe parents didn’t handle this super well, and they could have been more up front about expectations (or just charge him rent or a portion of tuition costs), but it seems to me like he’s not appreciative of their 18 years of being “cheap” to afford him his current situation.", "Ahh ok - well this may be a cultural difference then.", "You’re right, ultimately it is your money, you did work for it and you’re being responsible which is what matters most.", "You don't understand this is a cultural thing in Asia. Most parents won't ask for kids to pay rent money it's just considered selfish and unloving. Instead their children will give parent allowance as a form of paying back for raising them like filial piety once they work full time after graduating. Maybe in your culture 18y/os have to pay rent but here we don't we give allowances.", "I dont care. Follow your parents rules and accept you are an asshole for going against them and spending money (that they are effectively gifting you) frivolously and against their wishes; or move out and struggle financially on your own. \n\nThose are your choices.\n\nYTA.", "So, OP is giving their parents money, but because they called it allowance instead of rent, they’re automatically the asshole?"]}