{"id": 3652, "submission_id": "z9gjm5", "title": "AITA for calling my Husband's job a hobby and that maybe he should give it up?", "selftext": "My husband and I are very happily married for 5 years and have a 2-year-old daughter. I'm the breadwinner while he is the primary care giver for our daughter. Our schedules work for the most part but I really need more time to decompress. I'm a lawyer while my husband works in academic research. Our days start by me getting up around 7 to get breakfast ready and my daughter would wake up around 7:30. I will feed her and then go take a bath together. My husband would be up by 8:30am and he will be dressed and ready by 9 as I leave. I try to finish work till 5-6 but end up usually finishing by 7:30-8pm on good days. \n\nDuring this time, my husband cleans up the house, makes lunch and dinner, drops of lunch for me and runs his errands for the house. He also plays and takes care of our daughter while also teaching her both our native languages. He will get some of his work for his job that he can do remotely done when she takes her naps. He will leave for work around 6:30, his work is walking distance from our place while mine is a drive away. Since, I'm often not able to make it home, our daughter will be with either his mother, my sister or our neighbor who also has a 2-year-old. This puts additional pressure on my plate to get home quicker to relieve these people from this additional duty. My work already required me to work twice as hard as most of my counterparts because this is such a high-pressure job with a lot of internalized sexism. I had cut my maternity leave short and come back early because my coworkers warned me about how people were eying my clients and position. Just to prove myself, I had to work even harder. \n\nWhen I get home, I'm burnt out. I don't get any time to decompress really as I have to take care of my daughter as soon as I get back until her bedtime at 9. I'd then finish whatever little work I can which I had to abandon to get home in time. By 10 I'm spent and just crash in my bed and maybe get an hour to myself until I fall asleep. My husband will come back around 12-12:30am and fall asleep. \n\nThis was working but I'm spent. I can't do this anymore. If my husband quits his job, I won't have the extra pressure to rush home nor would I have to wake up early and take care of our daughter right away. I'd also be able to get at least some time to myself. His job doesn't really pay as much and mostly covers his personal expenses and a few bills which my salary can easily cover. I pay for most of the stuff here and it's important that I am able to work at my best for that salary\n\nI had a conversation with him where he was very defensive and didn't want to quit as its fulfilling and has been his dream for a long time despite it not being practical at this point in life and well out of frustration, I called his job a hobby since it doesn't pay much and doesn't really contribute to the household. I know it was harsh but at the end of the day it is the truth. He's not been his cheery self for a few days now and is barely talking to me. AITA", "created_utc": 1669875719, "permalink": "/r/AmItheAsshole/comments/z9gjm5/aita_for_calling_my_husbands_job_a_hobby_and_that/", "score": 205, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I called my husband's job a hobby and asked him to quit because I need his support now more than ever since I am having a very hard time balancing thing and his job is not as important to run the household. I feel like an AH because what I said was harsh and my husband is very upset with it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA\n\nAcademic research is a real job!  Aside from running the experiments and doing other types of research activities, it also involves things like teaching classes, mentoring more advanced students, writing papers and giving presentations at professional conferences to share the things you've learned in your research, and much more.\n\nIf you're getting paid to do something, it is a real job.  Even if it doesn't pay as much as being a lawyer.  \n\nPublic school teachers aren't paid much, but it is a real job. The janitor who cleans your law office isn't paid much, but it is a real job. If your firm has a secretary or receptionist, they aren't paid much, but it is a real job.  When your daughter is ready for daycare or preschool, the people who take care of her and teach her won't be paid much, but it is a real job.\n\nYour husband is putting in a full day's work of childcare and housecleaning, and then turning around and doing another full day's work of academic research, something that requires one to be at the top of their game in terms of focus, intellect, and creativity.\n\nIf your job is supposed to end at 6:00, and you are routinely staying until 7:30 or 8:00, you have poor time management skills. \n\nAnd if your agreement with your husband is that you will come home and take over childcare when he has to go to work, and you are instead staying at work that late, you are betraying his trust and your word to him.\n\nYou don't say what type of research he does.  But universities and colleges do not pay people for their hobbies. The government and various foundations do not give out grants just to fund people's hobbies.  Whatever his field, the things that he discovers in his research help us better understand and interact with the world. \n\nThe computer you use for your work, the online databases that make your research into the law regarding a case, the carpet on the floor of your office, all exist because people were doing basic research that laid the foundation that allowed these things to be developed.", "YTA, if your salary can pay for so much more hire some help. Can your husband change his hours to work during the day and you guys pay for daycare? Working outside the home is important to some people. His work sounds important to him", "YTA - the fact that you make more money is irrelevant here - it sounds like your husband definitely contributes fairly to housework and childcare - academic research is an important field and NOT a hobby - you’re a massive asshole for belittling his job like that. If you make good money, why not hire a nanny who can relieve the pressure you feel to rush home? You need to check yourself and apologize to your husband for trivializing his career.", "YTA. This is so rude and dismissive. You're husband isn't to blame for your inability to put boundaries in place with your work. If you should leave by 6 leave by 6. If you can't  ever leave by 6 then hire a nanny for the regular hours you guys need, or have a conversation with your neighbour/family who are currently filling the gap about having a more concrete arrangement so you don't feel you' re putting them out. \n\nYou could have talked to your husband or your work or your friends and family about options, dictating how you want him to live his life around your schedule is AH behaviour.", "YTA. You’re making this out to be about his job when in reality, it’s your job that’s the problem. It’s a pressure cooker that made you cut your maternity leave short and you get home when most people have already eaten and are watching Jeopardy. Yes, yours pays more, but it’s your job that’s wreaking havoc in your life. If your husband is getting paid for what he does. It is not a hobby. It’s only a hobby if he is self-employed and is running in the red from year to year. Also, when you had a child, this is what you signed up for. Without that time with her, the two you aren’t bonding as mother and daughter. Are you proposing that your husband now spend every waking hour with her while you work all day, come home, and then crash on the couch? A few weeks of that and just wait and see how you feel when she prefers daddy over you in everything. It will only build animosity between you and your husband and daughter. Be a good lawyer and instead of going to trial, try to reach a settlement. Instead of “either/or” thinking, think “and.” How can both of us do our jobs? Have you thought about finding another job that isn’t quite so demanding? Have you thought of every possible solution where you and your husband can work this thing out? In the end, what you did was elevate your work above his and that’s pretty crappy. If that’s your attitude about it, you’re looking at some really unhappy days ahead.", "YTA \n\nHe cleans and makes lunch and dinner!\n\nYou do the morning run but don’t want to “rush home from work at 7pm”. Ummmm. Why did you have a kid?\n\nHe loves his job. So he keeps his job! \n\nYou need to find work, life, balance better. Not stay at work 500 hours and worry about working more to prove yourself. Basically you had a baby, work like you had a baby, don’t cut your maternity leave short to stop your colleagues taking your job! Personally I’d say look for a better and more fulfilling job in a more supportive workplace. Don’t ask your husband to give up his work to support your toxic work environment", "YTA. You can't expect him to be \"cheery\" after you insulted his work just because he doesn't make as much money as you. Instead of forcing your husband to give up his career, hire a sitter so you don't have to rush home.", "YTA. So you spend less than 2 hours per day with your child and you want your husband to quit his job so you can parent less. Got it. Again, YTA.\n\nYou're the one who chose to dedicate your life to your firm instead of your family, don't expect to drag your husband down with you.", "YTA, honestly it sounds like your husband is carrying most of the workload at home. While you seemed to have actively put yourself in burnout by going out of your way for work. I understand that you’re the breadwinner but that means nothing when your husband is pulling more than his fair share of the weight when it comes to your child and home.", "YTA for calling his job a hobby and telling him to give it up. Would it be possible to hire a sitter or nanny? There are other ways to get the help you need besides forcing him to quit something he's passionate about", "YTA - if the roles were reversed and he was the breadwinner, saying your job is nothing but a hobby and asked you to quit, how would that make you feel? You'd probably think he was sexist, selfish and being oblivious to your feelings and selfworth.\n\nHave an actual conversation with him, try and find a solution that can work for both of you.", "YTA. \n\nYou want him to quit your job *so you can dump more child care on him so you can work more*.", "YTA. \nWhile i can sympathize with having to prove yourself as a woman and the added stress it gives, it does not give you the right to act the way you are acting. Telling him his job is basically “meaningless” and telling him he should quit is extremely selfish. How would you feel if sometime told you to quit your career because it wasn’t a “real job”. \n\nI’m very interested in seeing what his job is, to see what you classify as a “real job”.", "YTA\n\nWhat if your husband says you should quit because it stresses you out and you are not helping him out with childcare?", "YTA\n\nyouve shown yourself to be money focused and dismissive of something highly meaningful in the eyes of your loved one. no point in apologizing because you say 'it is the truth'...gee.\n\nthe guy probably has some serious doubts about you as a human. I dont think he is just hurt by your hurtful behaviour. I reckon he is wondering if his efforts (family, kid, 'hobby') are even worth it for spending a life with someone like you:/", "YTA. His “hobby” is likely keeping him sane. I’m not reading here that he has any more downtime than you, and he’s clearly pulling his weight in terms of the household. \n\nYou’re in a stage of parenthood that is absolutely brutal. I honestly don’t really remember much from those years (I’m also a breadwinner and mother) - it’s just a blur with some photos to remind me of what I did. It will get better for you both, but right now you both deserve to have what you need to get through it. \n\nHire someone to watch her if that’s within your budget so you both have some breathing room. Survival itself is an okay goal for the time being.", "YTA and demeaning. You know you can find another job that allows you to have a work life balance. Your husband's job isn't a hobby. Maybe it's time for you to get off your high horse and hire a nanny.", "You're a massive AH and I'll echo those who've suggested you spend of that money on help.", "YTA. You showed utter contempt for his job by calling it a hobby. You get paid more but that doesn’t mean your job is somehow superior to his academic research. As for him quitting, I certainly wouldn’t if I were in his shoes. You don’t just leave academia and then easily return to it. Plus why should put himself in a position where he’s completely dependent on you financially.\n\nI understand why you can’t maintain your current pace but perhaps you should consider a different job with not as many demands.", "YTA. There are so many issues you face as a direct result of choices you make but that you hold other people responsible for. You are being condescending when you tell your husband his job is nothing more than a hobby. What you are suggesting is that your husband should dedicate his life to seeing your needs are met. How about you change your job. There must be other ways to work as a lawyer than the position you currently hold.", "YTA\n\n\nWhy did you have kids if you don't want to be a parent?\n\n\nAlso, it sounds like you have the funds to get a childminder/babysitter until you get home from work. So why not do that?\n\n\nYour husband isn't a servant. Maybe stop treating him like one", "So you want your husband to quit his job so you can sleep in later and stay at work later? Meaning he’ll have zero breaks, personal, or decompression time. He’s doing the childcare and teaching her 2 languages, on top of managing the household; him going to work is his decompression time.  Just get a nanny.  YTA", "YTA- you want to sleep later and have more alone time. You clearly only care about yourself in this situation", "YTA, just reverse the roles and see how much of a massive AH you are.", "YTA No amount of career success is worth failure in the home. You would likely work longer hours and lose your relationship with your child and husband.", "YTA\n\nInstead of devaluing your husband and putting down his career choice, put more effort into finding childcare, since you can obviously afford it. I don't see how someone as educated as a lawyer doesn't understand that having him quit his job decreases your household income more-so than hiring a nanny or using a daycare would. If you're uncomfortable with a nanny, then you should 100% be on a waitlist for a daycare.", "YTA. You want to be able to take a break and get out of caring for your daughter but if he quits his job then when would he get a break? You’re not valuing his work that he does all day around the house. I have friends who are breadwinners too and they all take care of their toddlers after their day stops at 6:00 and they put their kids in daycare so their husbands can pursue other interests.", "YTA, him quitting wouldn't really fix much of your problems, your reasoning behind why it would help is flawed, it wouldn't dramatically change your life as you think, i think you just want to take out your anger upon your husband and try to control him.", "YTA\n\nYour work is making you unhappy and it’s your husband who has make the career changes, that doesn’t sound fair.\n\nYou may be the breadwinner (which is great), but that doesn’t mean you get to undercut his work, especially if he has a passion for it", "YTA. Imagine being upset over a job he loves. He deserves a divorce and someone who will support him.", "be a better parent and partner; be there for your daughter and husband. You’re exhausted? So is he, working and taking care of a kid is no easy feat. Even if he did become a SAHP, it wouldn’t be an excuse for you to slack off on childcare In the evenings. You just want an excuse to overextend your husband.\n\nCalling his job a hobby is rude and dismissive of his work.  \n\nYta", "YTA\n\nHe's doing his fair share, even more by the sound of it. He wakes up early with you, does his chores, takes care of your daughter, get you lunch, before leaving for work. And then he'd come home really late to do this cycle over again.\n\nA lot of women will kill for that kind of guy. I'd kill to have a father like this. And you're complaining you have to be a **mother** when you get home? Welcome to being a parent, fucker! It's crazy, and busy, and you're always gonna be burnt out. \n\nYou should leave that man, so you can see how many women would flock him. Maybe he'll find someone who does not look down on his life's work, when he's done nothing but be an exemplary husband and father. \n\nI have seen way too many family broken up because the man hated their wife for making them stop their \"hobbies\", I'm sure  you'll be next on that list. Making an ultimatum betweennyou and their \"hobbies\", the man will always choose you but they will hate you for it. Slowly, and surely. Like a roof leak, before you know every foundation of you marriage is molding and crumbling.\n\n Fastest way to lose your man's heart. Kill their passion.", "YTA. Your husband does all the child care. Housework & has a job!\nYou want him to quit so you don't have the pressure of rushing home. What about the pressure of him having no one to help with the child. You sounds like a selfish A Hole!\n\nIf the roles were reversed you wouldn't like it.\n\nI could say a whole lot more about my opinion on your child's routine but I'll keep my judgements to myself.", "You just sound bitter and jealous that he’s in a job he loves and enjoys and your busting your ass and miserable, you didn’t even say what he does", "YTA. It’s not fair for you to ask him to quit a job he loves so that you can have more time. You should really hire a nanny for the day. Then your husband could go to work earlier maybe and get home earlier to help with your child at night. Then maybe you could also have time together. Because the way you describe it, you guys don’t really have very much time together.", "YTA. You just shat all over work that is meaningful to him. It may not be practical for your household, but reserch of all types make our societies better. Medical research extends and enhances our health. Ecological research repairs and helps us understand environments that are crucial for our survival. Meteorological research helps us to understand, predict, and prepare for severe weather. Even NASA's research has enhanced our lifestyle. Memory foam, anyone? Without research, we'd still be using lead in our paints and gasoline. I coud go on...", "Wait. Wait. He cooks, cleans, speaks numerous languages, handles childcare and conducts academic research all while maintaining a cheery disposition? You absolutely need to divorce this man immediately. Please give him my number when the divorce is final so that I can explain to him what he did wrong.", "YTA, maybe you should first imagine what it would be like if the roles were reversed.\nWhat makes your job more important than his job? Salary is not the correct answer here.\nYou have chosen TOGETHER for a child, then you should also take care of your child TOGETHER.", "YTA. a major one. You have zero right to ask him to give up his dream just so you can decompress. i’m sure that him leaving for work is his way of decompressing from the stresses of watching your child all day, which is a job in and of itself. If you want to decompress, figure out a way to leave work earlier and do some work remotely. you say his mom watches your daughter while he leaves? so why is that such a stressor then for you to get home? figure it out before your marriage fails, because insulting your husband isn’t going to work.", "YTA\n\nClearly you need a reality check if you are dedicating that much time to work and want to increase your workload. \n\nNevermind the fact that you husband is in effect balancing TWO jobs, aka the full time home-maker and his actual job, and you think YOURE the one who's burnt out? \n\nAdults need outside interaction, away from their home and children. Child free time is especially important for him since he's doing the lions share of the work where your home and daughter are concerned. \n\nThe fact you have devalued his job to the point you called it a hobby is ridiculously offensive and you really need to take a step back and stop treating your partner like he is nothing more than a slave to your career and ambitions while telling him at the same time that what he does holds no value.", "YTA.  You completely devalued his career.", "YTA for calling his job a hobby. You are killing yourself at a high-pressure job that keeps you working late and seems to make you miserable. Why don’t you look into compromises such as joining a less high-pressure firm, starting your own practice, or hiring a permanent nanny?", "YTA. Just like you say his job isn’t practical, why can’t you change jobs? You demean and degrade your husband by likening his job to a hobby. Were i your husband id consider at best a separation and at worst a divorce. Do you even respect him and what he wants?", "YTA. Fill in his shoes. He wakes up at 9, take care of daughter and chores for 9 hours and then goes to work for the next 5-6 hours. And you belittle him? I have heard that all lawyers are AH by defult by you madam are off the charts. Well, happy divorce, i hope he will get a great lawyer.", "This can't be real. How could you type that out and not know YTA?\n\nYou want your husband to give up working outside the home, so he can spend those same hours working inside the home. When is his break to decompress? He's already working all day the same hours as you. Then, he works more hours at night doing something he enjoys. And you want to take that away? \n\nDo you even want to bond with your child? It sounds like she's a chore you want someone else to deal with so you can work 16+ hours a day. That isn't healthy - physically, mentally, or emotionally. It's no wonder you're burnt-out. Your husband changing his schedule isn't going to change that.", "YTA. Hire a nanny.", "gross absolutely disgusting. if my partner called my dream job, something i’m proud of and worked hard to get to a fucking hobby? you just threw in his face that the thing he’s passionate about is basically useless! personally i wouldn’t even wanna be with you anymore   don’t be surprised your hubby doesn’t wanna talk to you after this mans already busting his ass and the one thing he’s proud of and enjoys you are telling i’m too quit for what your own benefit ? also why would he want to be financially dependent on you alone ? that’s a big step to take", "Academic research gave us the internet. Academic research gave us penicillin. Academic research is one day going to cure cancer and AIDS. Achievements of incomparably higher value to society. Not a hobby and you’re the AH", "Not only did you call his job a hobby, which is disdainful, demeaning, insensitive and honestly  very mean, but you threw it in face that you earn more than him. Does you earning more makes you the one callshotter , arent yall supposed to be in a partnership? Do you usually look down on him? Because today you sure did so.\n\nDo you think running around taking care of your daughter, getting you your lunch AT YOUR OFFICE, and working at the same time isn't tiring ?\n\nYou're so focused in your ambition you're acting self involved, dont you think your husband deserve some childfree moment in his day? Some adult conversations ? When youre home at night do you talk with him? Ask about his day? Or are you too engrossed in yours that you forgot that your husband is also a human being? \n\n>If my husband quits his job, I won't have the extra pressure to rush home nor would I have to wake up early and take care of our daughter right away.\n\nYeah and if you cut back on hours yours husband will have less pressure on his plate and your baby more time with his mother. But apparently that isnt a priority to you,  parenting even less than 2h/day is. \n\nCool of you to be so sensitive of others and rushing to get your daughter off of your acquaintances plate, how about some of that for your husband as well?\n\n YTA .", "YTA. Hire a nanny. And yeah yeah you did already and didn't like them. Gee, I wonder why? You sound insufferable. \n\nHire an au pair then and apologize to your husband who basically moonlights as an errand boy, housekeeper and parent all rolled into one.", "Ooof, YTA and you know it. \n\nIf my partner said that to me, they’d be my ex partner no matter how much money they were bringing in. \n\nI agree that this arrangement doesn’t sound sustainable. But from my perspective that’s more because your workplace is toxic and sucks. I’m not sure why your husband should have to give up his career that he enjoys because of that. \nIt is certainly not true that his job is a hobby because it doesn’t pay as much as yours. \n\nYou’re clearly smart to have gotten where you are, figure out another solution. And apologize if you value your marriage at all.", "YTA. During your funeral, noone will compliment on you being a hard worker. But your husband will talk about what type of wife you were and your daughter will talk about the memories she has of you.", "INFO: Do you even like your child? You work 10+ hours a day then come home and are \"forced\" to spend -at most- an hour and a half with your daughter before you're able to bail on her to work a little more? Seriously?\n\nYour husband and daughter and job are not the problem. You are. I get that it's a dog eat dog world out there in corporate America but you're the one working 80 hours a week and blaming your husband's job for **your** exhaustion. Your family or your job. You're gonna need to pick one eventually. Though at this point I wouldn't be surprised if your husband picked for you.", "I read your responses to some of the comments and they solidfied that you are an AH. Yeah, academics aren't paid well, but let's look at what he does during the day:\n\n  \n\"my husband cleans up the house, makes lunch and dinner, drops off lunch for me and runs his errands for the house. He also plays and takes care of our daughter while also teaching her both our native languages.\"\n\n  \nThat sounds like a huge contribution. No, it's not money, but how much would cost if you had to pay for it? There are so many working parents would love this arrangement and all you seem to be focusing is money.  Seriously?", "YTA. This sounds like a you problem, and you're just feeding into all that misogyny by playing their game.\n\nYour husband's job is important too. It gives him a sense of purpose, contributes to the household income, and he could well be setting the groundwork for a good career. Something has to give - but he doesn't need to sacrifice himself at your alter", "Omg YTA. You're working 10 hours a day, parenting for 2-2.5 and getting an hour to yourself. Your husband is parenting for 7 hours, while working and doing housework, and working for 6 hours outside the home. When is his hour to himself?\n\nThe parenting is not what is burning you out, its your job. \n\nAnd yes, as a former academic researcher, him taking three years off will severely hurt his chances of coming back. Permanent jobs are damn near impossible to find and if he's got one and its close by, he might as well have hit the academic lottery. It doesnt matter how much his boss likes him, his job will be in high demand and wont be there for him.", "YTA - I feel terrible writing that, but you are. My husband and I were in a similar position 4 years ago and we had to drastically change our expectations to fit around our kids. I’m a lawyer as well, I moved roles and sectors to be home for my kids and partner. I know it feels overwhelming now, but start putting feelers out. \n\nAlso there are many reputable agencies that will support you finding care. Again, I was in the same boat (long waitlist for childcare facilities). Ask around and start interviewing. It took me probably a solid 12 months to find someone who works well with our family. She’s been with us for 3 years and we would move heaven and earth to keep her on (increase pay, support her bringing her grandchildren over, extra food, etc). I agree, it’s so hard finding someone you trust, but def start now. \n\nYou might not have time for it, but start seeing a therapist for you. What you said to your partner is really belittling. Remember, you’re in this together. If you start “fighting each other” it’s already over. Apologise to him and start therapy about learning how to communicate your needs in a constructive manner. \n\nBest of luck OP", "YTA. I also read some of your comments. I can understand finding the right fit for a nanny can be hard but have you looked into a company that help you find one that will fit with your family and send a different one when needed?\n\nYour husband deserves to be able to go after his career too. And what you said crossed a line.   I know are are stressed and at a point but getting your husband to give up his work is not the answer when you both have the means to pay for professional help.", "YTA. I dont even need to explain since so many people already did. And it doesnt help anyone when they give you the solid advice of hiring a nanny and all you say is \"no we had terrible experiences in the past.\" That gives no context to find further solutions, and to me, it sounds like you guys just gave up because maybe one nanny was a little too lazy and you consider that a \"terrible experience.\"", "If I were your husband is be telling you to quit, I'd also ask you if you can give up your hobby.\n\nDo you even respect your husband?\n\nYou spend what 2/3 hrs a day with your daughter, your husband spends all day with her, does the chores and goes to work, because that is WHAT he's doing. You may not think it's work but research is essential in anything.\n\n\nYTA and a massive gigantic AHOLE at that.\n\nTake a hard look at yourself ,because you might as well be separated.\n\nYour husband likes his job if he's happy then what's the problem. He does housework, Looks after your daughter and works.\n\nYou need to start respecting what your husband contributes to your relationship.", "YTA You’re so casually dismissive of what he does.", "YTA - it is not material to the discussion but you should know that academic research is publish or perish. Projects and grants have timelines. So taking time off would set his career back significantly at a minimum and he might not be able to get back into it.\n\nYou picked a brutal job in a generally tougher career path. That’s on you. You picked the career path and your area and your company.\n\nEither hire help or find a way for you to work less or get a different job in the field.", "YTA. \n\nYou will absolutely regret prioritizing your job over your family.", "YTA: you have a kid you don’t want, and your pissed that you have to do the work for someone you didn’t want in the first place. Your mad that he’s fulfilled in his job vs you working your ass off at a firm your not happy in and you cannot figure out how to change your life without ruining someone’s else’s.   You need to make some major changes before your spouse divorces you, takes the kid and finds someone more emotionally available and less abusive/ neglectful. It’s not hard, most women would kill to have a spouse who does half that.", "YTA, your comment to him was completely rude and dismissive. If you don’t mind, could elaborate on what terrible experiences are keeping you from getting a babysitter/nanny?", "this post is just all about you, your tired ? so is he. He’s with a toddler all day, then goes to work, then gets home to sleep and repeat. you get an hour, does he ? \n\nyta if you have so much money hire a nanny, 25 an hour if you need 2 hours it’s 50. not bad. & if you feel so bad about your mom/sis/neighbor babysitting you can offer them something in return.", "YTA.\n\nSeriously. Do you own a mirror?", "Not sure why OP bothered to have a child because clearly she doesn't want to be a parent.", "YTA, I completely get the pressure of being a woman in a male dominated field, but the fact of the matter is that you’re putting your job above your husband, and that’s not okay. If the roles were reversed, I’d tear you apart for demanding this. You need to find another solution than to force your husband to give up everything he worked for.", "YTA why can’t you change your job if your environment is so toxic? A fellow female lawyer here. There are so many options for us to choose from. I can’t imagine staying in a place that would be so draining.", "YTA. Take it from someone who was the breadwinner and completely worked herself to the bone for nothing while her first child was small. It wasn’t worth it. I crashed and burned but stayed because we “couldn’t afford for me to leave.” Guess what? After crashing and burning, I found something much, much better that pays more and gives me a much better work life balance and I’m actually present for my kids’ lives. It’s possible. Possible, and 100% worth it.", "YTA you want everybody to be miserable. This is not and will never be a solution, it just sound easy right now because your tired. \n\nFind a nanny that suits you by asking help from your family and by doing a background check and all. It will take time but you will be both more happy.", "YTA and a really bad one too he needs to leave your ass", "YTA because you were condescending and dismissive of his work while he also takes care of the kid and house all day. Put the kid in daycare, both of you work a regular day and then spend the evenings together. If you have to work later it should work out because he will be there to pick her up from daycare and take care of her until you get home.", "INFO: If you are well of financially why dont you hire a nanny or some other help. Not sure about where you are located but over here there is daycare as well for children at the age of 2.\n\nBeside of that: YTA - You know your husband may be exhausted and overwhelmed as well from childcare and household duties and his work may be his outlet to deal with it.", "YTA you want him to quit his job so you don’t have to spend *any* time with your daughter.", "YTA. Take on less clients", " I'm a self published (semi successful but the bar is through the floor for self published authors so it's not impressive). Anyways even though I have had some success I don't make money off it. My husband has an amazing job to support us both. AND YET he has never once belittled my work even if it doesn't make money. He has never looked down on it or me. He has never spoken to me in the way you spoke to your husband. And your husband actually makes money, even if it's not as much as yours!\n\nMy in-laws were sort of the same. My FIL had a good paying job and my MIL worked as a church secretary. Her salary was miniscule and they usually donated more to the church than she actually made and YET my husband and FIL never looked down on her or her work. They never spoke about her like you are speaking about your husband.\n\nHousehold contribution is not just financial. Your husband does most of the childcare and has a job! You have a job and a little child care. Both are hard. Both are valid. Don't you dare look down on your husband. If it's too much then you need to hire help. Maybe start paying your family to watch your kid if you don't want strangers. \n\nYou have plenty of options. Apologize to your husband! YTA!", "YTA. Find a better sitter. With references, special education, etc. Or pay the neighbor/relatives. Husband doesn’t need to quit just because you can’t find a healthier workplace. He’s already doing most of child care.", "YTA life's hard and when you love someone you work hard to build them up. Not tear them down. Hire a babysitter to come into the home for a few hours in the evenings a few days a week.  I would tell you to apologize but, i don't think you would really mean it.", "YTA. I am well aware sexism still exists in law firms but I guarantee there are other women with JDs who will know what agency to go through to hire a nanny or au pair. Or at least have advice on how to do so. If not at your firm then within the larger legal community. \n\nTalk to YOUR lawyer about your no compete and see what the options are. People switch firms all the time. It’s not impossible. \n\nAcademia is not a hobby. Your husband is pulling his weight and caring for your daughter, he’s not being a deadbeat. \nIf the roles were reversed I think there would be more suggestions of financial abuse. I think you owe your husband a massive apology, he sounds like a decent one. Take the L on this and start discussing solutions.", "Yta do you even want to be parent since it so inconvenient for you. Why would you have a child if you are not ready to make the sacrifices that come with being a parent. He has clearly adapted to being a parent and does a lot of the work and caregiving. And here you are complaining YTA", "You sound exhausted, frustrated, and like you carry the weight of the world. You do not have to work the hours or the job you are working. You can change if you really want to. It might be the best thing you ever did. You are unfair to your husband for stating he should quit his job because you think it would help you do your job. YTA here. You and your husband should sit down together and figure out what’s in your whole family’s best interest.", "YTA, absolutely. \n\nJust like we tell every asshole breadwinner man here with a SAHM wife, being a full time parent at home is most certainly a job. Jobs that don’t contribute money (or his academic job that doesn’t contribute a lot of money) ARE STILL JOBS THAT INVOLVE WORK. He is still working two jobs, as far as I can see. \n\nIf you feel stressed about having to rush home, I get it. However, you have plenty of resources available to you to hire a sitter. I saw you had poor experiences previously- do you pay your neighbor or relatives for watching your child? Have you asked if one of them could consider doing it, paid, full time? \n\nAs a woman myself, I completely understand feeling the need to prove yourself in a field fraught with misogyny. Your roles at home are the reverse of the “norm”. You are a woman in a difficult field who is supporting your household, but you are still falling into the same mentality that your male counterparts have. Your husband works to raise your child and take care of your house. That is one of his jobs. His other job is his passion. \n\nBe better.", "YTA. You have breadwinner privilege. You don’t understand how mind numbing and difficult his contribution is, you don’t understand that adults need to cultivate something beyond their parental life. You need to be grateful of everything he does and work towards resolution together, like him waking up early half the time and ordering take out. You can’t put this all on another person who doesn’t want it", "YTA. holy shit, without a shadow of a doubt, YTA. your husband does literally everything as well as working & you want him to give up his only \"spare\" time (except it's not spare time, & you know it) so you don't have to do anything in regards to your child.", "YTA sorry but you are, you both work he looks after the house and your daughter he then goes out to work at 6:30 comes home at 12:30 am he doesn’t get time to himself either.\n\nAre weekends free of work? If so you could either on sat or Sunday split the days so Saturday one gets a lie in Sunday the other one.\n\nIf you try and get him to quit his job he may end up resenting you. Looking after a child is long hours and it never stops.", "YTA. Academic research is not a hobby and maybe you should get a nanny since you make enough money.", "YTA. \n\nFind another legal job. There are so many. Not all have grueling hours", "OP. Don’t know if you’ll read this but just imagine if the gender roles were reversed. \nWould you want your husband to tell you to quit your “hobby” forever if he was the beard winner? Would you want to depend on your husband for money? \n\nYTA. This is what many men around the world do every single day. Work, get home and spend time with the kids. Put on your big girl pant because this is what you signed up for when you had a child. \nIf this post was about a man telling his wife to give up her “hobby” this post would be on fire because of the disrespect you’re doing to your husband by calling his job a hobby.", "YTA it’s his dream (which you insulted by calling it a hobby) and you want him to quit so you can have alone time? Welcome to kids lady, alone rarely happens. Hire a nanny.", "YTA we in similar positions except I have 2 little girls. I work in the motor industry so u know i understand the sexism, late hours and burnout but ur husband is a man they dont do well dependant on a wife leave him alone and toughen up ur a mom and u decided to take on a mans world we have to be tough as nails to survive not take out the husbands masculinity to succeed.  \n\nOn a side note no where in ur routine did i read time for husband and wife. U should rather rethink ur schedule or u going to loose ur husband and child in the end.", "Info \n\nOp why are you still here? \n\nThe YTA are the majority and you haven't accepted that in a single one of your comments. You're instead protesting and comming up with more and more excuses for why you think you're not in the wrong despite what Reddit is telling you, so why are you here? \n\nEither accept the verdict or get off this subreddit.", "YTA \n1. Academic research is not a \"hobby\" and you should know this by now having married an academic researcher.\n2. Your husband also needs time to socialize with adults\n3. Why do you want to spend even less time with your kid? \n4. If you have so much money just hire a nanny", "YTA. \nYour comments also show how stubborn you are being, refusing to see any point of view other than your own. Why did you come here if your were going to refuse to understand people's judgement?\n\nStop making excuses and actually absorb what some of the comments are saying because right now you are presenting yourself as a toxic unsupportive spouse and a resentful parent..", "YTA. Just hire a damn nanny.", "YTA. \n\nSo let’s break it down… your husband takes the load of parenting and household chores, your husband works but you diminish his work on a basis of “bUt I gEt pAiD mOrE,” you barely have any time for your daughter but “hey since daddy’s job is a joke to me he should quit so I can spend even less time with my daughter” (I know you didn’t call it joke but that essentially how you see it since you don’t see how important and valuable it is for him) \n\nYou need to prioritize your daughter a little more, you need to value your husband even more and realize the work he does is important to him and you need to start respecting it.  \n\n You talk about all the money you make then hire a baby sitter so he can also have more down time…. But I would suggest on cutting your work time, to spend time with your daughter. Idk how old she is but she’ll grow up way too fast and you are gonna miss it, think about all the moments you’ve missed already. When she’s older she’ll be the one not wanting to spend time with you since it wasn’t something you did with her.", "ESH. Like you said, it’s clear this isn’t working for you anymore. You’re both working, tried sitters and mutually agreed it’s not for you, and you’re both exhausted. But you’re first spoken option shouldn’t have been “quit your job”. And you definitely shouldn’t have called it a hobby. \n\nApologise for demeaning his dream job, say that it was because you weren’t thinking and you’ve been so stressed. You both need to talk about this. It needs to be several discussions with mutual respect and compromise (that means with your job as well), and you both need to agree to some big changes. \n\nI put ESH cuz it takes 2 to tango. It’s insane that you regularly leave your child in the care of neighbours. It’s insane that you barely see your husband, and that either of you thought this could work when literally half the day has either one or both of you out of the house.", "so much sexism here.\n\nif the genders were reversed OP would be labelled a nonexistent parent and abusive spouse\n\nYTA", "I don't think you're TA. You're both basically acting as single parents. You have no time together. It's not working. If he wants to work, the responsible thing to do would be to work daylight hours and find alternative childcare.", "YTA. Honestly it’s tough, I understand that. Parenthood, and marriage require sacrifices. It’s okay to feel overwhelmed and feel like you need to vent. Communication is key. It’s up to you and your husband to figure out TOGETHER. it’s so easy to get caught up in day to day life, but you guys aren’t on the same page. Sounds like both of you need to make some changes.", "Get a nanny. You had a few bad babysitting experiences. That’s rough. Take your time to interview and get a nanny you trust. \n\nI’ve worked in BigLaw, and I viscerally understand where you’re coming from. But if you can afford to go without his salary, you can afford to dedicate that portion of your income to a nanny. Having a few bad babysitting experiences is not an excuse for not taking the time to interview and find good childcare.\n\nSympathetic YTA.", "NAH. You weren't right in dismissing his career. Wouldn't go as far as to say you're TA but it definitely was rude. It must be really hard to work this much and have the added pressure of having to come home and take care of your kid. It's probably harder since society expects the mother to give up and be more mothering to the kid. While I see your pov it wasn't cool to tell your husband to quit his job because it's just a hobby. The alternative is that he takes his job more seriously and finds a nanny. Just like society expects you to mother the kid they probably expect him to keep his job. If he works harder I'm sure you can afford to hire a nanny. Apologise first then sit together and find a solution that works for both of you.", "Soft YTA because you seem beyond exhausted, but referring to his job as a hobby was an AH move. \nYou asked him to quit and he said no. Respect his boundaries and get a nanny. \n(Btw if the roles were reversed nobody would blink twice about the hard working male attorney working until 8pm to provide for his family, so for starters you probably need to take some of the pressure off yourself).", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I are very happily married for 5 years and have a 2-year-old daughter. I'm the breadwinner while he is the primary care giver for our daughter. Our schedules work for the most part but I really need more time to decompress. I'm a lawyer while my husband works in academic research. Our days start by me getting up around 7 to get breakfast ready and my daughter would wake up around 7:30. I will feed her and then go take a bath together. My husband would be up by 8:30am and he will be dressed and ready by 9 as I leave. I try to finish work till 5-6 but end up usually finishing by 7:30-8pm on good days. \n\nDuring this time, my husband cleans up the house, makes lunch and dinner, drops of lunch for me and runs his errands for the house. He also plays and takes care of our daughter while also teaching her both our native languages. He will get some of his work for his job that he can do remotely done when she takes her naps. He will leave for work around 6:30, his work is walking distance from our place while mine is a drive away. Since, I'm often not able to make it home, our daughter will be with either his mother, my sister or our neighbor who also has a 2-year-old. This puts additional pressure on my plate to get home quicker to relieve these people from this additional duty. My work already required me to work twice as hard as most of my counterparts because this is such a high-pressure job with a lot of internalized sexism. I had cut my maternity leave short and come back early because my coworkers warned me about how people were eying my clients and position. Just to prove myself, I had to work even harder. \n\nWhen I get home, I'm burnt out. I don't get any time to decompress really as I have to take care of my daughter as soon as I get back until her bedtime at 9. I'd then finish whatever little work I can which I had to abandon to get home in time. By 10 I'm spent and just crash in my bed and maybe get an hour to myself until I fall asleep. My husband will come back around 12-12:30am and fall asleep. \n\nThis was working but I'm spent. I can't do this anymore. If my husband quits his job, I won't have the extra pressure to rush home nor would I have to wake up early and take care of our daughter right away. I'd also be able to get at least some time to myself. His job doesn't really pay as much and mostly covers his personal expenses and a few bills which my salary can easily cover. I pay for most of the stuff here and it's important that I am able to work at my best for that salary\n\nI had a conversation with him where he was very defensive and didn't want to quit as its fulfilling and has been his dream for a long time despite it not being practical at this point in life and well out of frustration, I called his job a hobby since it doesn't pay much and doesn't really contribute to the household. I know it was harsh but at the end of the day it is the truth. He's not been his cheery self for a few days now and is barely talking to me. AITA\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "He works all day in childcare and home keeping and then goes to work. You work all day and go home to child care and home keeping.\n\nNeither of you is getting a better deal here; and while on a practical level your job contributes more financially, it’s demands are no less important than your husband’s job demands.\n\nThere are other solutions. Stop trying to rush home. Set up a routine situation with his mother, the neighbor, or whomever else. I know you said you had bad experiences with babysitters / nanny’s but keep looking. \n\nThe solution isn’t for him to give up more than you. It’s to come up with a solution that takes some pressure off both your plates - asking him to give up his career takes pressure off YOUR plate but creates a whole sense of pressure for him by having his career stall out for 3 years and strapping him to 24/7 child care.\n\nYTA for calling it a hobby BIG TIME and for not reopening the convo about a solution that takes some pressure off you both. \n\nI understand your hours and empathize with them and also understand how specific law practice can be. But - no one, not you or him can do it all, and you have to come up with a solution that works for both of you, and mutually eases stress, not just eases your schedule.", "I suggest hiring someone to help with the kids for as many hours as possible to alleviate stress for this busy family.", "This sounds like a you problem, and you need to get your priorities straight. YTA.", "YTA - it doesn’t sound like he really gets a break either. He gets up, after you leave for work he starts his day of taking care of the house, taking care of the baby. Then he goes to work doing something that means something to him. When is his couple of hours to himself? I have been a stay at home mom and a working mom. Both are exhausting, yet you seem to think that you having me time is more important than his work that he loves. Either hire a nanny to come to the house until when he leaves for work (because you don’t like daycare) and keep them there until you get your me time. Or suck it up like the rest of us with kids do and get your me time as it is available, no matter how limited it may be.", "My god, what a horrible thing to say to someone. It's so arrogant and dismissive, essentially \"Oh honey, I know you have this little hobby and it's cute, but it's not really worth anything because the pay is lower than mine\". I get paid less than an academic as a Genetic Technologist so I guess that's a hobby too. Sorry kiddies, someone else will need to monitor your cancer as their hobby so other people have more time for proper jobs like lawyers.\nYTA, and you have a hell of a lot of apologising to do. He's probably very hurt, and you need to think about how much you respect him as an individual and not just an assistant. If you were a man I'd assume this was the 50s.", "YTA and your real issue is your job, not your husband, and your solution is to give more of yourself to working at a toxic firm with toxic colleagues. Your husband quitting his CAREER (not hobby) won’t make you any happier or less stressed. Not to mention missing out on the most important years of your daughter’s life and development. What kind of role model are you being to her to keep sacrificing your family for work?", "YTA. Whoever it was that told you you can have it all was lying to you. You can’t. You want a high-pressure career, a child, AND down time to relax? That’s hilarious!", "YTA Ma'am it seems like you need to reevaluate because your husband cooks, cleans, takes care of his kid, runs errands AND Is keeping a job. I understand that you want to have some time for yourself but what do you expect??? It sure does sound like you want someone to parent you child so you can work come home and lay around. I get you have alot of pressure on you but you didn't think about that before you had the child? So your telling me your husband is supposed to drop everything to take care of the kid he clearly does alot for?? So you can have nothing to do? And if you under so much pressure, then maybe you shouldn't care so much about what people at your job think of you. They're opinions don't matter, you dnt have to\"prove\"anything to anyone? And you know therapy works too if your under that much pressure. Please do better and stop being so selfish you had the child so parent it?? It's literally 2 hours!?!?!? Actually less than two hours, and that's just so much for you..? You literally came on here and asked \"AITA for not wanting to parent my child so much so that I asked my husband to give up his passion?\" Like come on now ma'am.\n\n (ALSO VIRTUAL THERAPY IS A THING SO WHILE YOUR AT HOME BEING A PARENT FOR THOSE 2 HOURS MAYBE GET ON THAT) \n\nedit: spelling, grammar", "YTA because in this job market there are plenty of quality openings for in-house counsel, which typically require fewer hours.", "I sympathise that you're tired. I also see that everyone has given a unanimous judgement along with harsh (albeit perhaps true) comments on your parenting, so I am going to stick to the title question.\n\nYTA.\n\nBelittling someone's job that they love is an AH move. He works hard at his job, too. It brings in money. It is also, as stated by you, is his DREAM. You belittled the dream of the man you want to spend the rest of your life and that is incredibly hurtful. The reason he is being quiet is because he didn't expect YOU to be someone who could hurt him like that. You also may have hurt his masculinity. Men who aren't the breadwinners can be a little insecure about it. Maybe this isn't the case but it wouldn't surprise me. You have suggested that you look down on his JOB and his dreams. I harboured a lot of resentment to an ex because he belittled my job (even though I was earning a lot more than him and paying for holidays) because it hurts to be looked down upon by someone you adore and look up to.\n\nApologise to you husband for your comment but don't be surprised if he can't forgive and forget. You may have irreparabley damaged your relationship with him and his view of you.", "Sounds like your husband is doing a great job as a dad. Honestly, I think you both need to cut back on your outside-the-home workloads. You don’t need to kill yourself to impress your coworkers. Care a little more about being present for your family.\n\nWould you lose your job if you stopped working at 5 and came home to have dinner with your husband and daughter? If you need to get more done, maybe you could work at home from 8 to 10 pm, after your little one is asleep. Same amount of work in the day, but you’d have family time together. Similarly, your husband could cut back to just working until 10, so you both get some time together at night. You don’t sound like you are in desperate straits financially. Let off the gas for a while to make some room for margins in your day.\n\nYou could both make a few compromises to make this all work a lot better. Talk to a counselor if you need to. Marriages and families don’t hold up well under the strain of having zero downtime together.", "YTA.\n\nFrankly I don't care why your life is stressful, but calling his work a hobby is inconsiderate, snobby and insulting.\n\nYou obviously are willing to prioritize your work over your family. Well, okay, but don'T whjin e about it and try to belittle your husband. It's absolutely your choice to have your job exhausting you. And yes, I'm a lawyer for 22 years, I know your type: putting work in first place and then act surprised if your private life falls apart.", "YTA LOL Who wrote this Charlotte Pickles? His life is hectic as well and you're both doing a great job, but maybe you should invest in daycare, or a pt time nanny.", "YTA\n\nyou cannot expect him to give up his career ... how about you compromise a bit on yours! You are not being a good partner or parent!", "Find another firm that treats you like a human with human goals.  I wasn't aware that the goal of all lawyers was to be completely child/spouse free for the rest of your life in order to just accumulate money for the sake of it ..and I guess clout?  \n\nIsn't the point of being stable in a career to be able to raise and spend time with family without the stress of always being away?  Don't let this firm fool you.  There are others out there.  \n\nRun this by your husband: have him pick up more hours and be the main breadwinner so that you can find a place that allows you to be around for the family without feeling guilty for wanting a very obvious and human thing.", "YTA - You are a parent. That involves some level of actual parenting. You want your husband to quit his job so you can parent even less? When exactly do you plan on seeing your child? If your salary is so good then hire help and quit using people’s goodwill because you’re unwilling to get home on time. Your priorities are all wrong and your time is no more important than your husband’s.", "it might be  hobby to you as a high flying  lawyer but he needs  an outlet  to , hire a nanny so he can go to work during the day  then you can both share the load  when you get home   set a time.  surely your job isnt that highly  prioritise over your family  that you cant  be home by 6pm   .", "YTA. All I’m hearing is how hard having a family is on you. You have to get up early to take care of your child. You have to “rush” home to pick up your child. You have no time to decompress. You don’t think it’s fair. You don’t think it’s working.\n\nAnd your husband? He does the majority of everything to do with child and house and it’s still not enough for you. You want him to quit his job, let you lie in, let you work late, give up his own enjoyments so that you can “decompress”. This is what being a working parent is. It’s not fun or relaxing or rainbows- it’s hard work.", "Why are you putting your job over your family? YTA", "people around here have problems with the breadwinner parent as always\n\nif she said she already tried the other alternatives and it didnt work, why this makes her the ah?", "YTA. Without a doubt. It just sounds as though your concentration is on you and you only.\n\nHaving read through some of the responses on ways you can resolve this, it just seems as though you have a lot of excuses. You are unsupportive of your partner and daughter.", "YTA-", "YTA\n\nAs a women, I really understans the pressure you have on yourself and the need to fully dedicate to work tp get what you deserve, but you are looking this the wrong way.\n\nWhy did you decide to have a child? Why can't ypi cit back on work? Instead of yoir husband quitting, maube you can also cut back to something that instead of burning you out, can also be fullfilling.\n\nAnd you should apologize to your husband. It was disrepectful and he doesn't seem to be doing nothing wrong to deserve you lashing out...", "Your Husband sounds like a Gem he deserves better same for your daughter!  YTA", "YTA. Your husband do most part of the household and you also asked him to leave his job? Finally, If your husband quit his job, you’d be economically less stable: if something happened to you? If you lose your job? He must continue to work for your daughter and give a major stability to the family I think", "INFO: You mentioned that he will drop your daughter off at the neighbors or your sister but that it adds additional pressure. Are you paying them or are they doing you both a favor? If it’s a favor, consider paying them hourly for watching her so that you feel less pressure to rush home. Perhaps that could help?", "YTA. Hire help instead. Because, once your child is a bit older, having left the workforce will have hurt your husband's career. It isn't his fault that you chose a difficult career. Now, if it were something that he could easily go back to after leaving for a couple of years, that might be different. If it were costing money for him to work, that might be different.  Just remember, your baby will grow and need less, so how things are right now, is NOT how things will always be. If someone can afford help to get through those early couple of years, then it is worth it.", "YTA.\nHe's already spending whole days with the kid - and believe me or not, it can be completely draining. Since you mention that the two of you never planned to have kids, it's safe to assume that he never planned to be a SAHP. Those working evenings are the only thing that gives him a chance of having some contact with other adults and focusing on something that is not childcare and household chores - so it's basically a matter of mental health.", "Yta\n\nI suggest keep looking for a full time nanny. To feel at ease, set up cameras in your home to check out your child and nanny once in a while.", "YTA. But I think it’s because you’re in the thick of it. I highly recommend doing therapy. If you have a private office you can do it on your lunch break via Telehealth. You sound like every client I have when they’re so far down in the hole they just don’t see any ways out but there are ways. Your comment to your husband though was beyond disrespectful.  You should grovel for how big of an AH you were in that moment. Just because he is not in a toxic job and it pays less and does not make it a hobby. I would question if you’ve always been this cruel and judgmental and controlling, or is this residual anxiety and depression from being 20 exit past burnt out? If you guys aren’t surviving the now fix that before you’re worried about the college fund. And also non-competes really aren’t that enforceable. You really should look into this more.", "Why not divorce him and give him full custody with visitation rights for you? Then you can just pay child support and occasionally visit your daughter, if you feel like it, without having to make any meaningful sacrifices. YTA", "YTA you put your needs hundred percent on him. You also made up your mind on a solution already which is hundred percent on him. This was extremely unfair, he already does most of the household and caretaking, what exactly gives you the right to decide he should also do the rest? And saying it's you earning goes towards financial abuse. You need to have and honest and open (meaning don't be stuck on a solution you already made up by yourself) on the needs and what can be done to relieve you. How you addressed this was just super selfish and very disrespectful to him.", "It seems like your job is not really working for your at this point in your life. Your husband quitting is not a solution for your problem, I think you need to take a long hard look at your life and priorities and figure out how to get yourself out of this burn out. \nSoft YTA from me, you sound exhausted.", "Hire some help", "Get an au pair", "YTA. Why even have a kid if you clearly don't wanna spend time with her. You want your husband to give up his work and freedom to be with the kid. So that you can work more.\nIf you have a such a big salary, why not HIRE the help untill she can go to day care? This kid won't spend time with her mother at all at this rate and we'll don't be surprised if in the future she doesn't wanna visit. This is neglect. Is your work more important that your child? If not then find balance. \nAlso if it pays it's a job not a hobby.", "YTA. as a full-time nanny, hire a nanny! there are plenty of really great ones out there that your child could form a real bond with and who will stick around for a while. i know firsthand how difficult it can be to not have any adult interaction throughout the day, and i get to leave after 8 hours. it would be worse for your husband, especially because he’s not willing to give up his work. really think about what you’re asking him to sacrifice here. and then ask yourself, is it worth him resenting you?", "So your asleep by 11 and up at 7? I can only dream about that much sleep each night!", "YTA, how do people like you exist? You're a robot, a slave to your job, Jesus lawyers really are the worst even to their own family.", "YTA and delusional. You didn’t came here for advice or actual opinions, you came here hoping someone will validate you and your f’ed up way of thinking. In the comments you keep making excuses as to why you’re so incredibly selfish, acting like you understand how big of an AH you are but in reality you dont. Appreciate your husband more because if you keep acting like this you will lose him and probably your daughter too since you are unable and quite obviously dont want to spend time with her. Stop trying to justify your selfishness, you are an AH.", "YTA for calling it a hobby. I get it though I've managed to nearly double my salary in just a few years. My wife became a sahm mom because of this. She's found some side work to help contribute or at the very least indulge in guilty pleasures without taxing on the main household income. That being said I would never call her work a hobby. I like my couch but I don't want to sleep on it every night. \n\nPay does not always equal effort. I'm currently making the most money I have ever earned and it's the easiest job of my life. Parenthood is a tough job and a thankless one. He may want to do something where he feels like he's accomplished something. Recognition and reward are important. I don't have the solution just some small insight I wish you the best of luck though.", "YTA - it’s not a hobby at all\n\nIt’s a job and you were incredibly insulting and dismissive to the man over it \n\nYour husband has the right to job outside the house, just as you would if you were the primary parent \n\nIf your job is causing so much issue, maybe it’s time to find another one? Especially since you hate it\n\nThen you get a job you like and more time with your daughter\n\nAlso you realise you get about like 2 hours with your daughter, and if your husband did what you asked, you would have even less time with her\n\nYour daughter needs you around, not burning yourself out at a job you hate that will eventually leave you cold and jaded", "YTA It seems like your job is the issue here, not his", "YTA\n\nYou keep saying \"kids are expensive\" but without childcare which you aren't paying for, kids aren't actually that expensive.  I assume student loans or mortgage is your biggest monthly expense.  Not your child.  \n\n\nThis isn't sustainable for you, regardless of your husband.  You seem very resistant to admitting looking for a new less stressful job would be good for your family.  But it would be good for you and your health long term too.  Asking your husband to change his life will probably not help your stress and make him more depressed and unfulfilled. \n\nIf you aren't happy with your life, you have the ability to change.  You aren't forced to keep this job.  Or live in a high cost of living area.  Or to not have childcare help.  No one is forcing you to be miserable", "YTA, you prioritize your job and your life over both your husband and child.\n\nYou spend only a few hours with your husband and child a day. There is something wrong with that.\n\nYou say you have to rush home to get your child from people watching her. Try rushing home for once and just spend time with your child and husband.\n\nYou sacrificed your maternity leave time to go back to work. Time you could have spent bonding with your child for her early development. You sure have your priorities…\n\nThis coming from a family of lawyers. Yes the job is stressful, demanding, and cutthroat. You stated in your comments you don’t have a choice. Everyone has a choice, you could work your own practice, switch firms, cut back on hours/less pay. \n\nYou have put your job and money over your family. I wish the best for your husband he sounds lovely.", "I replied to some of your comments and i’m gonna summarize in one now, first, YTA, calling your husbands job a hobby just because he makes less than you if very demeaning and rude, of course he’s upset, also he does basically all household chores and child care during the week, have you heard of unpaid labor? Taking care of children in not only a physical task, but also emotional, his job probably really helps him with dealing with that since its something he loves. Second, I understand that you very clearly like a more expansive lifestyle but now you have a child, accident or not, you’re gonna have to wake up and change your plans, no you’re not gonna go on lavish vacations or expansive restaurants at least for a long time, that (sadly) comes with it, and you’re gonna have to downgrade a lot so you can not only help your husband, child care is both of your responsibilities, no matter who works more hours or gets paid more, but to also spend time with your daughter, love and affection are way more important that money, although i applaud you for saving for her future, you’re gonna have many many more years for that, at least help now while she’s little, its the hardest stage, im sure you can take some blows in your career now but get back on your feet later on, this is fixable you’re just gonna have to be more flexible. Also the whole nanny thing, i agree with you, its hard to find someone you trust and its always better to be safe than sorry", "YTA and if your husband posts from his perspective best believe all the comments will be telling him to divorce you and run. He busts his ass everyday to look after his daughter and maintain the house then goes to work in the evenings. I say his daughter because you spend what? 2hrs a day with her and your complaining about having to do that? Sort your disrespectful ass out or your gonna come home to an empty house and divorce papers", "It also doesn't sound like he gets much of a break either, yet hasn't asked you to change your job that you obviously value so highly.", "YTA only thinking of yourself. Selfish and entitled. \nNot once have you mentioned how you think he would feel. Not once have you mentioned how he is supposed to have money for himself since you would be making him financially dependant on you. \nNot once have you mentioned that you want to spend time with your child. \n\nIt takes two to make a baby well congratulations you now have the responsibility of caring for that child. \n\nI just hope to god that you don't want another child.", "INFO: Just to clarify your schedule, it looks like during the work week, you're responsible for your daughter for about an hour in the morning, and usually about 1-1.5 hours in the evening (unless you manage to get out of work early. So usually about 2-2.5 hours total per day. The rest of the time, shes either being cared for by your husband, or with a family member or your neighbor. Is that accurate?", "Info: If he quit his “hobby” and started doing the mornings, and you could then work later because of this too, when will you see your daughter and when will your husband get a “break” from parenting? Seems he’d be giving 100% at home with no personal time. It already sounds like he also gets no decompression time, which you’re saying you don’t get either", "You have valid points.  Have a calm discussion with your husband.  Perhaps you could find a highschool girl to help around the house in the afternoons?", "Okay so YTA for calling his job a hobby. But honestly N T A for asking him if he would want to stay home. The underlying message isn't what causes the issue it is how you presented it. It was very much a dismissive, and rude way to handle the situation.\n\nBut you guys should sit down and talk. Maybe you could switch firms or choose a different job. I get it being hard and having to keep up.\n\nBut there are options you guys could minimize your life and living situation and maybe you could stay home. But this needs to be a discussion a real discussion between you to.", "Gentle YTA. \n\nYour husband deserves to feel fulfilled, too. Law firms are no joke, and I totally understand how being a woman in a male dominated field means you have to work twice as hard. If I may, perhaps you could try to find an in-house counsel position? They typically pay very well, have much less stress, and require you to work normal hours.", "sounds like you have over extended yourself, and you underestimate the burden that your partner takes on every day. he is responsible for a lot, and him being able to do this job that he enjoys is something that he does for himself. everyone needs time to dedicate to things they enjoy doing. *he is not responsible for the fact that you don’t have your own time for hobbies or you time.*\n\nyou need to either tone down your commitment to work or hire extra help. you do need time to chill out and relax, but your husband deserves that too.", "The Husband probably also does not feel great about being so far from being the main breadwinner. Not only does he out in more time with the kid, he then also has his partner throwing that pay gap into his face. And then degrading it as a hobby. Talk about a dagger to the heart.\n\n\nAnd I haven't seen anything from OP talking about how her husband feels about all this. All comments are just me, me, me. Or weird excuses on why she refuses to solve her own problems. Like downsizing a bit, or brushing off hiring any sort of professional caretaker with \"We had some bad experiences\".", "Just imagine if a man was the one that wrote the post. A man belittled his wife’s job. \n\nShe’s getting off too easy. Millions of good fathers work 12-14 hours a day and come home to still spend time with their kids and help out around the house. \n\nShe gets 2 hour with her child and she’s calling it quits. \n\nNot only does he have a job, he also takes care of the house 100% and spends time with his daughter. Like seriously people. Just imagine how on fire this sub would be if a man told his wife; that did 100% of house chores, did child care, and worked; to quit her “hobby” because he was tired. He is tired and doesn’t want to deal with the child.", "This! I wish I could upvote this so many times!", "All of this!", "Yeah as a research assistant I'm so fucking offended at this woman's audacity.", "Seriously OP. Get your ass home by 6pm. Downsize a bit if you have to. \n\n(It's reddit, i know. But im picturing her in red bottoms driving a jag. Yay reddit 😉)", "I can't believe OP calls academic research a hobby! So crazy! I was thinking he was writing a self-published novel or making art or something like that when I read the title. Unbelievable. \n\nMy husband is a scientist and worked in academia for years - it couldn't be further from a \"hobby\". His science \"hobby\" now pays for me to pursue my actual hobby of painting full-time. \n\nI know plenty of lawyers in tough firms that manage to have a better balance - they also respect their SO's occupations. OP should downsize, reduce some superfluous expenses and hire a nanny if she doesn't want to switch jobs.", "It is but I'm not asking him to give it up forever. Just until our daughter starts kindergarten. We did hire a sitter a few times, but we had some terrible experiences, and both agreed not to for the time being. The good daycares all have long waitlists and the other are in a bit shady area and we fear for our daughter's safety.", "Sounds like he contributes more! He's running around doing all the chores, doing her lunch, raising their child and then goes off to work. She doesn't have a husband she has a... Bang butler?\n\nEdited for bad morning spelling.", "Not only that but the fact he is a house husband who does everything including taking care of a toddler which can be exhausting and mind numbing day after day after day. What about his need to decompress and be with his adult colleagues for adult conversation and company. He is merely a nanny for her and picks up her slack in parenting and lack there of. Yes, she is n a high pressured job, blah blah blah and I understand that but they the fact of the matter is she chose her profession and knew going in that it would be a time consuming challenging job. Her choice therefore she needs to deal with it and do what must be done at home which is to at least spend the few hours that she gives her kid a day. Her priorities are messed up- career before motherhood and home/ family responsibilities. To belittle her husband who seems to go above and beyond in his support of his wife’s career ambition is grossly unfair and uncalled for.", "He's a fuxking teacher. She's an AH", "We were both child-free. I don't like to say it, but she was an accident. A 1 in a million baby. My husband had a vasectomy which unfortunately reversed, and my IUD clearly failed. We were originally going to abort but I couldn't go through with it and we're both happy about it. We don't regret our daughter especially my husband. I would like to have a better work-life balance, but my profession literally compels us to work the way we do", "we did hire a sitter a few times, but we had some terrible experiences, and both agreed not to for the time being.", "That's 2 hours a day currently. Her plan is to to spend zero time with her daughter. Dad will take care of morning, so all she has to do is get up and go to work. And since dad will be home and she won't have to rush out of work at 8pm, daughter will be asleep when mom finally comes home. \n\nSounds great, doesn't it?", "Replying to the top comment so maybe it gets seen get an au pair… but also you’re missing your daughter’s best years", "Oh please if the OP were a man everybody would be fawning and applauding him for feeding and bathing his daughter every morning before heading off to his attorney job to provide for his family. Nobody would blink twice about him getting home late.\nEdited to add: by “everybody” I’m talking about society in general (the OP brought up the misogyny in the workplace).", "If I could choose another career at this stage, I would in a heartbeat, but the truth is I can't. It's easy to say that I'm dedicating my life to the firm, but the harsh realities of the profession compel me to. I'd love to quit and spend more time with my family. We financially can't afford for me to lose my job. His job is not enough to sustain us without heavily depleting our savings until I'm able to get another job should I quit", "we did hire a sitter a few times, but we had some terrible experiences, and both agreed not to for the time being.", "I agree and would argue that the husband’s job is fundamental to his well-being and allowing him to do his job as househusband and loving dad so well. OP, YTA.", "The only reason I say it's a hobby is because it doesn't contribute to the household. Do you know how miserably underpaid academic research is. I'd be more than happy to support it if we could make it work logistically and right now, I'm sorry but it can't work.", "He can't because his job will not be able to sustain us. I would love to quit and spend more time with my family. I practically can't", "Life is expensive, kids are expensive. Without completely upending everything, we can't change our current predicament. We can't afford to not focus on money right now.", "This! I don’t understand why people with schedules like this decide to have children. Men or women.", "I would like to change my job, but children are expensive and right now I can't afford to change jobs. Moreover, I don't even have time to look for a new job.", "But then she wouldn't have as much money. Then she would have to make sacrifices. 🙄 OP was childfree and the baby was a big oops despite birth control. I think she's working to maintain a certain standard of living. If you make so much and can't afford childcare you may need to think of downsizing or finding ways to live cheaper so you can get childcare.", "I wish my day could stop at 6 and daycare or a sitter aren't an option at moment due to long waitlists and bad personal experiences. Our original plan was to have a sitter take care of her but after some terrible experiences we came up with our current schedule.", "Came here to say just this. If OP is finishing work by 8pm on a good day, they’re still going to come home exhausted. They might gain 1 hour of time to themselves, but that’s probably not going to be a dramatic change. What’s more likely is that they’ll work even later and still feel burnt out.", "we did hire a sitter a few times, but we had some terrible experiences, and both agreed not to for the time being. We do have weekends together and that's more than enough for us at the moment. We hope to get more time together once she starts having school and kindergarten. Also at that time, he could just start his job once again", "Right!?! And don't forget he runs the household errands and BRINGS LUNCH to OP!", "I love my child. I take care of her full time over the weekend. She's my responsibility from morning to evening except mealtimes. At evening, she goes to my parents and it's my husband and my us time. I have to work 10+ hours because I need this job right now. My husband knows that if it comes down to it, I'll always choose him. He will never ask me to quit though because he knows how integral my job is for us and especially our daughter's future.", "They used to be child free and the baby was a big oopsie despite birth control.", "We spend Saturday evening to Sunday Evening together. My mom takes my daughter during that time", "Literally everyone is calling her an asshole.", "Everyone here is rightfully ragging on OP, what more do you want?? What sexism is happening here? 🙄", "Sorry, valid points? What the f. You have never been in succesful relationship, right?", "Are you crazy?!? There is not one single valid point in the whole post! Just bitterness and extreme assholery!", "You’re asking him to give it up for three years. Do you think he’ll be able to just get it back, pick up where he left off?\n\nIdk what the bad experiences with sitters were, but you’re going to have to figure it out. \n\nI sure hope you didn’t tell him his job was a hobby.", "You can keep looking for a nanny and get on the wait lists for the good daycares and telling him it was hobby just sucks on every level.", "You are asking him to give up forever. Have no illusions about that.", "??? Then find better options. Kneecapping your husband's life to better yours is not the solution to your problems. Thoroughly interview and background check people who need the money and have plenty of time and leave your husband's source of fulfillment alone. I am appalled whenever men try to make this decision for women and the opposite is equally ridiculous (if you have the money to hire someone).", "Or he could ask you to slow the pace of your career and work less hours or find a lower stress position so that you don’t feel over pressured. See this goes both ways.\n\nI’m going to put this in clear writing. YOU ARE NUKING YOUR MARRIAGE by demanding (not asking) that your husband quits his job. Stay at home parents are only happy as stay at home parents if they CHOOSE to stay at home, a well-researched fact. You are asking him to trade in his happiness and fulfillment so that you can increase yours. You are telling him what he does doesn’t matter as it doesn’t serve a purpose for you. What you’re asking from him is to take all the parental responsibility. You don’t want to be a mother to your own daughter. You don’t want to wake up early to spend time with her or even rush home to see her before she goes to bed. You’re right that things are currently unsustainable but how you’re going about solving things is all wrong.", "Then consider hiring a mother’s helper - someone who works while you are home. That way you still have to come right home but there’s some space for decompression because you have help. \n\nThere are other solutions, you may need help to find them, but your husbands need deserve attending to too, and he doesn’t sound any less over worked then you.", "You at least out your name on the waiting list?", "You've completely skipped over nannies here. They're not the same as a babysitter, a nanny can take a big load off with both childcare and housework (paid properly for the position, of course, which it sounds like you certainly can).", "it is not fair that you have to work more than your colleagues, life is not fair. \nbut you lose yourself, you want him to quit, to work even more, to alienate yourself from them even more, and you'll end up burned anyway.. \"stand on the ball\". think carefully, this path is not good, you will lose yourself and your husband and child because of a job where you will be replaced in an instant. start thinking about a new job, a smaller company, fewer hours, probably a lower salary, but maybe you will be happier and more satisfied. you know yourself best..unfortunately we can't have it all..", "And what do you think would happen to your career with a 3 year break? If you wouldn’t do it, it’s not fair to ask your husband to. \nAlso you are willing to sacrifice his mental health at the altar of yours. Your marriage is unlikely to survive you being this selfish, and then you will have ti juggle being a single parent and your workload.", "If there’s a long waiting list, why aren’t you already on it? The best time would have been awhile back, the second best time is right now.", "Can I give you some advice from someone who got sucked up in that corporate nonsense?\n\nHonestly, learn to set boundaries with work. Force them. Give yourself days off, holidays, good home times! \n\nYou will burn out before you make partner if you continue with what you are doing. Plus the glass ceiling is still there for women so you need to work harder to achieve the same as your male colleagues. Is that what you want? Do you really want to put in all that effort then miss the small fun things and find you still didn’t do enough and didn’t make partner. \n\nSet some healthier boundaries for yourself. Force it. Your job will soon learn that this is to be expected and back off. They will. But the more you allow them to push you to stay late and you take that out on your husband then the more you are guilting yourself and will burn out faster. \n\nLearn to set professional boundaries now. Before you turn 59 and realise you missed out on your entire life", "Ah. That explains it. It definitely sounds like you have a lot of regrets about having a kid. \n\nThere may come a time when you are forced to choose between your family and career. If you want a career, go for it but you will need to accept that may mean losing your family. For some that's what will make them happy. No shame in that. \n\nWhatever you do, you need to start being honest with yourself about what you want. It sounds like you want the career more than your family. I would sit and have a long talk with your husband about what you want and figure out how to move forward. And apologize to him.", "“We don’t regret our daughter especially my husband”.\n\n“My husband had a vasectomy which unfortunately reversed”. \n\nYikes. Poor kid. \n\nI would argue this is not about your husband at all. It is (surprise) about you and your suppressed regrets about having a child, when you so clearly prioritize your career above all else. \n\nMaybe some therapy would do you good, so you don’t end up resenting your family.", "What if you set days/hours and paid your sister/neighbor/MIL? Then you wouldn’t be so rushed to get her.\nAlso, even though your husband doesn’t make as much, it’s priceless for mental health. Don’t let him quit and resent you for it.", "\nI would like to highlight that you're asking him to go from academia to Baby Shark 24/7. Think about that. I mean truly, deeply reflect on what that would feel like for him every day. How would you handle trading court documents for See Spot Run? Would it be rewarding and fulfilling? \n\nI was someone who was in your husband's shoes, with a partner that made more, trivialised my job, and convinced me to give \"taking time off until the kids are in school\" a shot. Going back just never happened. There was always a reason, my partner was too busy at his job and too exhausted to help me with the kids. It was never \"the right time\".\n\nI initially resented my partner for trivialising my career and ignoring my need for mental simulation and every day that went by fostered that resentment. After a year, I hated it. After three years, I hated him. At year five, I decided to leave. We made it another seven years, but I couldn't get over that resentment no matter how hard I tried.\n\n\"The time being\" is over now. If you like being married you need to sort a sitter and tell him that you've found a solution that doesn't cost his sanity. Then you need to apologize. He will leave you if you keep this shit up. Seriously, if you can lawyer, you are capable of overcoming your inability to find a nanny. Find the time.", "Where did you find these sitters? What was terrible about them?", "I bet she wishes she were a man in the 50s", "Apparently you haven't been on Reddit long if that's what you think", "I’ve read many posts just like this with the genders reversed, and they get the exact same advice and criticism.", "New to AITA I see.", "What sub do you think you’re in?", "Bullshit. Reddit is the first place where a man is (rightfully) attacked for not actually parenting the child they fathered. \n\nThis woman wants to abdicate being a parent. If she were a man, oh the ugly.\n\nYTA, sadly.", "I had a husband like OP. Note the \"had\". \n\nI can assure you that I give men the exact same criticism when they post self-absorbed shit like this. My husband works a whole fucking lot, but he finds time for us. I don't know how he does it, but he does.  \n\nAs for me, I work my ass off doing three different jobs 7 days per week (~70-80 hours and some of that is out of town work). I still make time for my kids. I still make time for my husband to get a break, too. Do I have a social life or fun hobbies? God, no. But I choose to have a family and I love them so I show up.\n\nIt's not about gender. It's about OP being a complete asshole. If *nothing* else, she could have asked him without telling him his job doesn't matter. Like, \"Oh, your life's work? Yeah, nah. It's not as good as my life's work and I don't value you or it as much as I value myself and my career... Wait! Why are you being so cold to me?\"", "Drop the misandry. It's gross.", "Nah, he'd get called a lazy dad. Cause that's what he'd be. Seen it many times.", "Absolutely", "They would if he called his wife's job a hobby and was pushing her to quit.", "You could always look for another job before quitting - you know, like most people do when they want a different job. Yes, highly-paid lawyer jobs come with long hours, but there are also options that pay less, but require fewer hours in turn. Is there really nothing like that available where you live?", "Why did you have a kid if you don't even want to raise one?", "Why can't you go in house? Are you not in a specialty that translates. In house lawyers work way more manageable hours.", "There are other careers as an attorney that do not require the long hours. It would likely require you to leave a law firm and enter a position as in-house counsel for a specific organization. But that's a fairer compromise than to make your husband give everything up, as it sounds like he did the last round of compromises in going to part-time.\n\nIf your husband quits his job so you can have time for yourself, what time does he have to himself?\n\nYTA", "Hire a nanny then", "Wow, you sound *exactly* like every AH husband 'breadwinner' who gets evicerated here on the daily for belittling his wife's job and demanding that she quit so he can sit on his ass after work and not be a parent to his kid. \n\nYTA- Right now, your husband is doing 2 full time jobs and here you are, bitching because you have to pull your weight, too. Stop messing around with babysitters and hire an actual nanny for your kid.", "It doesn’t contribute to the household? Is it unpaid? Because if there is any money coming in, it’s contributing. He is, in essence, doing more than you because he IS bringing in money and parenting your kid.", "Shouldn't a lawyer be better at arguing their position?", "no, it can't work for YOU because you think your life is so much more important than his.get a reality check", "Underpaid and not paid at all are different. His job contributes, and he contributes in other ways as well", "All your comments are about how you yourself feel. On how you are unhappy with this status quo.\n\nHave you even considered how your HUSBAND feels about all this?\n\nEven when facing the reality of the pay difference, I can see how earning so little also feels like shit to him. Not only does he get that thrown into his face by you. But then you additionally degraded his role by calling the job a hobby. YTA. You couldn't have placed the dagger more sinister.\n\nThis whole thing is actually not that hard to \"solve\".\n\nYou are very focused on not wanting to quit or cut hours in that job. And also that downsizing etc is not an option.\nSo just let us assume this is a given factor and no way around it.\n\nIn that case: Hire a fucking nanny dude. That is the only thing that will get you out of this hole, without fucking over your husband by forcing him to be a stay-at-home home dad for more than a decade.\n\nAnd no more of that \"We had 3 bad experiences\" bullshit. Research every professional agency. Work out a proper interview process to touch on the basics of what you need from them. Then trial & error nannies until you found one that gets the job done. Throw money at the problem with money. It obviously is your only resource. This is your only option. And if you refuse to see that, or just can't, then you're either plain wrong or there are some other non-mentioned factors hiding in the bushes.", "OP, stop thinking of it in the monetary sense and thinking it in the eq sense. You literally just said your husband is useless. You expect him to be happy about it. Imagine he just said you are only a money-making machine. How would you feel?\n\nEDIT: Just forgot your past experiences and hire a nanny or babysitter and furthermore the people you are supposedly worried not even said a thing.", "Hire a nanny.", "How about moving into something cheaper? Seems like you have an expensive lifestyle, and don't want to give that up... But that's what comes with children, sacrifices...", "People have kids and survive working a lot less then you. Your kid isnt going to even know who you are in a couple of years. But will remember the resentment you have for having to spend a second with them.", "Oh stop it. I am a freaking bartender with 4 kids (I absolutely love my job and wouldn’t change it), if I can survive on that on my own, you can figure it out.", "now you are making a reasonable and acceptable statement:) you see the difference though between this reply and the statement you made to your loved one though, right?", "You should have thought about all of these things before deciding to bring a child into this world.", "Then you will need to make changes and sacrifices.\n\nPeople have raised kids successfully with a lot less and people have also raised AH kids with money.\n\nYou keep saying you have no options, but you're just taking out all your stress on the people around you.\n\nYour so stuck with this situation you can't see the mountain behind this mountain.", "All your responses are full of excuses and \"me, me, me\". Sorry to inform you Sweet Pea, you're in a relationship not a dictatorship and your partner has a career as well.", "Sure, children are expensive but don’t use that as a reason you can’t change jobs. The entire reason you are here is because you suggested to your husband he gives up his job!\n\nI feel for you that you didn’t plan your daughter but she’s here now. Pre-school is hard but this time will pass… and since it’s fleeting you need to ensure you don’t miss it. Your work/life balance sucks and you’ve allowed yourself to be drawn in and perpetuate a work culture of living to work. No thanks!\n\nYou have tried sitters and it didn’t work - maybe try again? I can understand that you both agreed to not go down that route but how is that a hard and fast rule that therefore means you’ve determined telling your husband to Jack his job in is a sensible alternative??\n\nYTA.", "If that is the decision you chose to make then you must accept the consequences.  Personally I think that is nothing but an excuse to not even try.", "I don't believe you can't afford to change jobs, nor do I believe you don't have time to look for a new job. Those may be the justifications you tell yourself, but that's nonsensical.", "If you can’t afford to change jobs, maybe downsize your bills every month, get rid of the ones you don’t need? Some of us have multiple kids, are single parents (in my case, not by choice after 18 years of marriage), and manage to take care of our kids without a lawyer’s salary, which I guarantee is more than I make. I drive a used car, we don’t take fancy vacations, I prioritize what we need vs wants.", "So why decide to have a child?", "Children are expensive because of daycare, and initial investments into their safety.\n\nYou work there because you **like working there.  It could be for prestige, money, or getting away.**\n\nYou sound just like my sibling, always a martyr. \"The whole world thinks I'm a bad parent!\" You make life harder for yourself.\n\nHere is a foolproof plan. Hire a babysitter while you are home. Then, At your house apply for jobs.", "Lol yeah, there's no way in hell they can afford to have the husband quit his job and NOT afford childcare. Especially since she makes enough to cover what he adds to the household income, apparently. \n\nIt truly is unfortunate that she seems to see her husband as a tool rather than a human being. Why else would she forego getting childcare? No need to get a new hammer when you've got one that'll work.", "Hire a nanny.", "Yeah. I bet your husband would have a different reply to this.\n\nWhat would HE say if he was asked about your hours, and a nanny?\n\nYou sound exhausting.", "Forget the sitter. Hire a professional nanny.", "OP, you really need to take a long hard look at your life and figure out if you're prioritizing the right things. \n\nYou don't have to be very well off to give your child a happy life. You can reduce your costs to reduce your workload. Smaller house, cheaper cars, less extravagant lifestyle, etc. Not focus on climbing the ladder at the firm and do well enough to keep your job. \n\nThere are options, but you're refusing to accept them for some reason. I suspect it's because you do enjoy your job, have worked hard to get where you are, and really don't want to lose your position. Truth is, parenting comes with sacrifices. Is it going to be your lifestyle, job, or family?", ">He will never ask me to quit\n\nYou should have shown him the same level of respect but you didn't and now you wonder why he is mad?", "You said you take care of your daughter full time over the weekend.", "I do. His work loves him. His boss suggested it to us when we met her recently and the topic of how tough life with kids can be. She could see how exhausted I am.", "In academia things change fast. One of my professors has a friend who started writing his PHD on monitoring quality of carrots and referred to them as a vegetable throughout the entire thing. Just as he was about to finish UE decided to start classifying carrot as a fruit", "Sorry, there's no possible way to take a few years off from academia. This would be permanent", "Yep, had it for a year now. We don't live in a place that was geared towards having children. with her being born during COVID, we couldn't even move. We're trying to get another place but it's very hard. We're also saving up for a house in another area which has 16hr daycare services for doctors and people like that. We got our name in their list as well.", "We've been on them for a year now. It's ridiculous", "I wish it were that easy. It's a complete boys club. If I can't stand next to them, they will squash me. I took this job because of my mentor who worked here. She \"retired\" due to health reasons during my maternity leave which is why I was left unprotected and had to cut short. We can't afford to lose my job especially now that we have our daughter. Had we still been childfree, this would've been resolved so long ago", "We did offer but they all rejected. They don't want the responsibility to be permanent. MIL was initially supposed to be our back up and support. She then backed out suddenly. The number of times we had to beg all three of them, but they don't want it. I'm fine with them thinking of me as a bad mom because the world already thinks so since I'm the one who has the long working hours, but they also make comments about my husband. It's infuriating. We are helpless though. So, to make sure my husband doesn't get any flack because he's the best dad ever, I have to make sure I get there on time to pick her up.", "Let's see, one of them basically got her boyfriend to come over and ignore our daughter. She was a relative and had experience btw. \n\nThere was the nanny would who fell asleep with headphones on while our daughter cried so much, and a neighbor called us. We got cameras after that.\n\nThere was a highly recommended nanny who decided to take our daughter on an unauthorized outing and didn't pick up when we called to check in when we couldn't see her on our camera's. Luckily, she came back, and her battery had just died.", "Lol you think Reddit has anything to do with what I think? That’s adorable", "I’m talking about real life, not Reddit posts lol", "lol I’m not going to change my opinion because strangers on Reddit don’t like it.", "Lol you do know there’s life outside of Reddit, don’t you? What happens in a sub on Reddit is not a real indication of what happens in the workplace and family lives in the real world.", "I understand it in theory, it's also what I did. But when are you expecting her to look for a job? If she's already this burnt out, there's not going to be energy to look for a job (and yes, that actually takes a lot). Also when describing her day.. I really don't see when.", "Our daughter wasn't planned. We were child free. We never wanted to be parents. We had less than 8 months to figure things out. We made a plan. It relied on a bunch of external factors like my mentor shielding me at work and us being able to find some form of help like daycare or nannies. During my maternity leave things went south and we had to make a plan on the fly.\n\n&#x200B;\n\nEdit: Before you start accusing, we don't regret our daughter. We love her and wouldn't have it any other way. She may have been a surprise but she's our surprise", "again, we did and terrible experiences. We don't want to put our daughter at risk.", "THIS!!!!! Perfectly said!", "OP says they were child free and this baby was a big whoopsie despite birth control. I think they had a high standard of living before the kid. I don't think OP is working for the basics of what's needed. I think they're working to try to hold on to some of that child free standard of living. She's trying to have her cake and eat it too.", "The hours OP describes sound like big firm hours. There definitely are other attorney positions with less grueling hour requirements. It’s a choice.", "I legally can't practice in the same field as my current one should I quit without moving and losing the support system we have here and also costing my husband his job anyway.", "We haven't taken any fancy vacation since I found out I was pregnant. We live in an expensive area at the moment and a lifestyle that was not geared to have children. Most of our money goes towards basic necessities, our funds for college, house, etc and our daughter. The fanciest place we've eaten out was Panda Express", "Because I couldn't go through with the abortion.", "I think she needs to be honest with herself and admit she doesn't want this life. She clearly doesn't want to be a mom. She needs to divorce him and let him find someone who wants to be a parent with him.", "She's done that, too and didn't like the nanny. Seems like the only thing she hasn't tried is get rid of her book of excuses and looking at options other than her husband quitting.", "we did. We tried both. At the moment, we don't really trust anyone new.", "I feel like you’re coming up with a lot of excuses to justify your selfishness here - if you aren’t comfortable with/able to get into daycares in your area - hire a good nanny who can stay home with your kid in the evenings! If you’ve had bad past experiences with sitters - do your homework and interview potential candidates/get recommendations from friends, etc! I have yet to see a good reason why your husband should give up his career.", "Three years is a long time. His work may love him, but a lot can happen in that time. He will be replaced and forgotten, and even ifhis boss loves him she might get promoted to a different position or move companies.  How would you like it if you were asked to take three years off?", "You mean his hobby buddies right ?", "Does he look exhausted?", "YTA\n\n\nAcademia does not work like that. It penalizes quite heavily gap years, regardless of what his boss guarantees.\n\n\nIt is terrible the misogyny in your field. And trying to balance your work with your life at home is taking a massive toll on you. However it does not give you the right to dismiss your husbands job. Even if economically you think academia is a hobby - welcome to the reality of a lot of people including my own husband and myself - does that mean that any other job that doesn’t pay for your lifestyle is just a hobby - which is most of the jobs out there?\n\n\nEarning that much money, you could make your life easier on you and yet, you focus on the flexibility your husband has? Even though, he also takes care of you with that flexibility?", "Get out of here, academia, you’re drunk. Carrots are vegetables!", "I understand everything you are saying. Worked in a complete boys club and succeeded all my goals!!!! \n\nBut did I?\n\nI missed out on sooo much other life. I was so stressed and it has affected my health. Now I’m older my health is screwed because of the stress I put my body under to succeed!\n\nSo even though I succeeded at all my work goals, did I succeed at my life goals. \n\nOnly you can answer those questions. None of the questions or answers are easy. But do you really want your partner to give up his fulfilling job so you can devote more hours to a toxic environment that made your mentor “retire” due to health issues!\n\nAll I am saying is maybe take a small step back, don’t try to be perfect and succeed the most, maybe aim for average, take time, live life and enjoy sh*t!\n\nGood luck", "Oh hush. You sound like you're arguing with yourself.\n\nYou don't WANT to change. You resent your child. You can absolutely afford to downsize, you just don't want to.\n\nI sincerely hope that you get some therapy, and that your daughter never knows how you're feeling about her rn.", "Stop making excuses. There are always options. All I hear is me, me, me. I don’t hear anything about what your husband needs and what your child needs.\n\nETA : no one comes to the end of life and says I wish I’d worked more.", "Can your husband do half days on the weekend, instead of weekdays? Then only three weekdays would need to be covered, maybe one per MIL/neighbor/sister, and if it was only one day a week that may be easier for them to commit to. That would give you a break at least two days of the week", "If all of your babysitters are shitty there’s one of two things happening:\n\n1. You’re unreasonable and micromanaging and they don’t want to work with you\n\nOr \n\n2. You have terrible judgment on babysitters.", "Go to a reputable agency and get a professional. Stop micromanaging", "SHoul have kept the third.", "Third one should have been given a warning... Then fired if this repeats.\n\nSo stupid", "I give the same criticism regardless of the platform.", "We won't ask you to. We will just downvote the shit out of your opinion instead.", "If you're coming on here expecting all of these people to be NPC's with fake life stories set up just for your entertainment you need to get off the internet for a while", "\"We don't regret our daughter\" \n\nNo, you just want someone else to raise her and get all the credit", "Honestly this seems like a decently important piece of information. Maybe include it in the post. I don't think it's going to change the ruling, but I definitely empathize with you a bit more knowing you didn't plan for that part of your life.", "Get a nanny or an au pair don’t limit your husband. Since you can pay for stuff. Pay for an au pair or nanny to relieve the pressure. His job is not a hobby. He needs human contact too", "You may not regret your daughter, but you are asking your husband to give up his dream. It’s not his fault you are in a profession with ridiculous hours. You want to offload your pressure on to your husband so he won’t get a break between 8.30-8.30 - on a “good day”, and on top of that you will have taken away his outlet for any sort of personal fulfilment. Which you have already denigrated as a mere hobby that you see as worthless. YTA. \nYou need to make more effort at finding outside help.", "Sorry for your bad experiences, but you are refusing to solve your own problems. It sounds like neither of you consent to being a full time SAHP, so that option is not on the table. \n\nWhat will it take for your to get on board with a nanny? You can have security cameras, you can have neighbor/grandma check in on them, you can have background checks. \n\nYou chose to have kids in a 2-career household. You will not be able to do this alone. You need paid help.  Sounds like husband already contributes more to chores and childcare, so you aren’t entitled to more sacrifices from him.", "Your refusal to fund a way around your problems is not an excuse to treat your husband's career as expendable because it's inconvenient to you.\n\nAs others have already pointed out, leveraging to spend even less time with your child might not be a great parenting decision. YTA.", "So there’s a non-compete in your contract? That is a good reason to stay, but it doesn’t solve the problem, as leaving isn’t an option, and asking your husband to be your housewife does get you a deserved YTA. Kids are hard work. I don’t know a single parent who isn’t exhausted. Unfortunately, you have limited options.\n\nSo, logic. \n1. You are burning out but cannot work less hours without losing clients/cannot get another job in your area of law locally due to a non-compete. \n2. Your husband has a full time job that he loves but does not pay as well. \n3. Your husband takes the vast majority of childcare and housework duties in addition to a full time job. \n\nYou are both stretched thin. You need to take some of the load off somehow. \n\nA nanny or a housekeeper is the obvious answer that a lot of people have posed, which you reject due to a bad experience. You are a new, first time parent who had a scare. Rationality isn’t expected in your circumstances. But you do see that you don’t really have any other options, right? \n\nChoices:\n1. Your husband resents you because you belittle his work, you keep pushing and either he gives in, and likely resents you for it/you fight until your relationship breaks down. Congrats now you have a custody arrangement to deal with. And a divorce. Expensive and time consuming, plus obviously emotionally difficult. \n2. Your husband surrenders his passion and is very unlikely to get his job back in three years - no matter how much they like him, academia is insanely competitive - like have to wait for someone to die for a job to open up competitive. You are asking him to do the same thing wives did for husbands for decades… but there’s a reason feminism happened, it’s often a terribly unfulfilling life, and it rendered the non working spouse to be dependent on the breadwinner. He’s unlikely to thank you, and your relationship will be damaged. \n3. You put in time and effort to find someone trustworthy to provide support in either housekeeping or childcare - look for someone with a great reputation, experience, references etc. Agencies exist that cater to more discerning clients, and they have great, experienced people. You will pay more for these people, but they may be able to provide greater peace of mind? \n4. Enlist family members or your support system you mention if they are local/available. Otherwise see option 3.\n5. Continue status quo. Risk potential crash - which would be devastating to both your psyche and your career, as you’re likely aware.", "The support system of people not taking care of your child?", "How long is the non-compete? We hired someone in a different role to wait out his non-compete.\n\nNot sure if it would work in your field.\n\nAlso why are you shutting the door on sitters after bad experiences you can count on one hand?? It seems like you are running out of options and voluntarily shutting the door on a possible solution.", "Why can't you legally practice in your field if you quit? Your current employer can't prevent you from working. As a lawyer you should know that better than most.\n\nAlso, you're on the road to divorce.", "Welcome to having children, accident or not you’re gonna have to adapt your lifestyle so you AND your husband are in a happy place, if “downgrading” your expansive lifestyle fixes that, sorry, but ur gonna have to. Many people don’t take lavish vacations and go to expansive restaurants right after having children, it comes with it, ur right, they are very expansive but you can’t expect your husband to do everything", "Again, like I said in other posts, you keep making excuses. If you don’t want to make changes then suck it up and deal with the only cards you are willing to play. I was a SAHM mom for 12 years, I worked from home while my ex husband worked 6 days a week, 12 hour days. I didn’t get any me time until my youngest was in preschool. I went years with my whole life being focused on kids, working from home, and sleeping as I could. My youngest 3 are each 2 years apart (my oldest is 5 years older than the next). Two of my kids were the happiest oopses I have ever had. It was hard, so hard. Because of my ex’s hours, I also didn’t sleep much. I exclusively breastfed the youngest 3 for 18 months, who got up with them at night? Me. I went years without uninterrupted sleep along with no time for myself. But I chose to have my kids and I wouldn’t have had it any other way. That was the choice we made.\n\nNow that I am single (he cheated, got her pregnant, and left, it wasn’t my choice) I have 3 teenagers and one adult son who just moved back home. I work 50 hours a week, typically 6 days a week. If you think a 2 year old is expensive, try having more kids in sports and competition dance. We live in one of the fastest growing communities in the US and it is expensive (not NYC expensive, but definitely expensive). I refuse to take our kids out of this school district, so I won’t move to a cheaper community. I made the choice. I work my butt off and here I am at 2:49 AM getting my me time when I have to be up in 4 hours to take kids to  school and then work 11-12 hours tomorrow. I’m not saying this to be all woe is me. I’m saying it because this is the life I chose, I’m not willing to make changes that could lead to less hours at work, more time for myself. So I have no reason to complain or insult someone else. If you aren’t willing to make changes so that you can get that time you want, you just need to deal with it until your daughter can go to preschool or kindergarten. \n\nIf you aren’t willing to do any of the things people are suggesting, then you have to live with the situation you are in and try doing it without putting down your husband’s work. It sounds like he is an Angel of a man who does a lot to make sure the housework and child care are distributed so that you can work the hours you claim you have to work.", "So you chose to have a kid you aren’t equipped to raise. I read all your responses to see if there’s any redeeming qualities about this situation but unfortunately I couldn’t find any. Good luck at your law firm, when your partner realizes you aren’t worth the headache, it’ll serve you well.", "You've definitely got the excuses part right. I have a feeling the only person OP thinks is competent enough to do literally anything, is OP herself. \n\nI would never wish harm on anyone, but wouldn't it be interesting if hubby suddenly was no longer able to do all of the other jobs he does aside from his \"hobby\" aka running the house and raising his daughter. I'd bet money OP couldn't hack it.", "Then try daycare. I'm sure you have an excuse for why that won't work, too.", "Interview and vet them better, make a deal to pay one of your current go-to childminders so you won’t feel guilty, or accept that you’re going to be exhausted for the next 3 years. You can’t expect your husband to give up something he loves that gives him a chance to be out of the house. You barely interact with your own child on a day to day basis.", "Well, it’s either find someone you can trust or continue being burnt out because making your husband quit his job that he loves is absolutely and completely selfish and unreasonable.\n\nAs someone who’s doing a job I love that pays very poorly - if I didn’t do it, I’d be miserable and insane. 7 day a week child and isn’t for everyone and it’s probably your husbands only ‘me time’ from the schedule you’re describing!", "Totally irrational to think that because of this there are no good nannies out there.\n\nYou are basically refusing to solve your own problems. Instead you shift the problem to your husbands job.\n\nInterview better. Check more firms. Research more about them. It is not high-tier rocket science. Fucking Up your husbands live with such an irrational excuse on why you're not taking the easiest solution is totally idiotic.", "Then that’s your issue to work through. Try again.", "She's the head of the lab. She's not going anywhere unless something really tragic happens even then, her second will probably get her position who is my husband's best friend.", "This made me chortle.", "Also, snails are inland fish. I want to get high on whatever those people are high on", "That's not a bad idea. My mom helps us on weekends anyways so it can make things simpler. It's actually a great idea. I should talk to him about it tomorrow. Thank you so much", "Micromanaging? My husband was in charge of handling them. I just paid their salary. He was confident with all of them because they were recommended ex-employees of friends and family.", "She was gone for an hour and a half.", "You think I don't hate myself enough that I almost missed crucial stages in her life? I would do anything to not have to be the bread winner, but both my husband and I realize that it has to be me. At least for now. I love spending time with her, but I cannot have the fact that I need to get her looming over my head while I'm at work. I can't afford to make mistakes in that cesspool.", "I am at 3000 characters, there was so much I wanted to talk about.", "While it should be included, doesn't change anything. If the kid is important, move to a different area & job that affords a significant presence in the child's life.\n\nOtherwise, she doesn't actually care about raising a kid, just her own needs(cause \"career\" trumps all).", "Well done. Very succinctly put forth.", "It's not the best but it's what we have", "Many workplaces have a no compete clause in their contracts, meaning you cannot work for a ‘competitor’ once you quit your current place of work for however many months.", "It's so sad for the husband and child. Both are treated like burdens she's having to carry instead of being loved and respected family members.", "*The wait-list.* The one she's definitely not actually on.", "It’s academia. Personal relationships matter, but it’s still an incredibly competitive field, and in three years he won’t be in touch with any recent developments in his field that haven’t been made public (which usually takes years due to publishing standards). \n\nYTA, and don’t blame it on your job because 1.) you haven’t tried to look at possible alternatives and 2.) you belittled your partner’s life work. Get off of your incredibly expensive high horse, apologise, and try looking for alternatives.", "Calculating on a safe return after three years is extremely unreliable. No matter what you tell yourself here", "Okay but you didn't answer the second half of the question. What if the roles were reversed? Suppose your husband earned several times what you currently earn as a lawyer, and asked you to quit your legal hobby and take care of the home? Would you happily agree? Would you not be offended by him relegating your entire career as an attorney to a mere hobby?", "Well you’ve certainly got it all figured out, what do you need us for?", "Don’t forget to tell your husband what you will be sacrificing in this little negotiation, since you want him to give up, weekends, and presumably family time, since it doesn’t sound like, you two spend any other time together. \nYou are all anout what he should give up, and don’t care much for his fulfilment, so if you approach this conversation like that, expect him to rebuff you.", "Wonderful, good luck!", "I find it really hard to believe that ALL of the recommended babysitters or nannies hired were terrible. In my experience, as an Early Childhood Educator, parents who run through caregivers are usually difficult or let their child get away with anything. There were multiple nannies and only one common denominator: your family. Also wow, sound more condescending.", "This reads like the plural  “you and your husband” and not necessarily you specifically. \n\nThe point being made is: Either y’all are hiring the wrong people or yall are horrible to work for.", "Why is it that you view nothing as your fault? It’s either your husband who is wrong, or it’s your work’s fault. \nWhat responsibility are you taking? Spent the weekend researching nannies and daycare yourself since your look down on his choices so much.", "Where did they go?", "Most of the time, especially for a kid as old as two, parents will outright ask the nanny to take the kid outside at least for one and a half hour....\n\nI wouldn't be surprised how she just assumed it's the same as everywhere else. The battery sounds like an unfortunate one time experience. (Also damn, I'd be so uncomfortable babysitting with cameras everywhere)", "You can't even give your daughter 2 hours of attention a day \n\nNo. I don't think you feel bad and I don't think you are a good parent \n\nYou care more about your success and happiness than your family and their happiness", "> I would do anything to not have to be the bread winner, but both my husband and I realize that it has to be me.\n\nWhat steps have you taken to change this? Because you've made several comments along these lines indicating you'd rather have more time at home, but unless you're actually doing something about it, then it's all just talk. And talk is cheap.\n\nIf you're serious you should be working towards changing this.", "The word count doesn't apply to edits at this point. You can add to it without being penalized.", "Honestly OP, I don't think you should be putting so much pressure on yourself to be the sole bread winner. Your work life balance sounds absolutely crazy and working 50+ hours a week with no time with your family isn't healthy. Do you not have family nearby like your or his parents/siblings that would be happy to help with childcare? \n\nI would see a financial planner as well to work out how you can achieve your financial goals or your acceptable standard of living without killing running yourself into the ground with work. It may be that you have to make some lifestyle changes or it'll take you longer than planned to reach your goals. \n\nGentle YTA for being dismissive of your hubby's job.", "Those are not typically enforceable. They're just used to scare you into thinking like op does. They can't prevent you from working.", "Agreed :( I hope that she gets a wakeup call about what's truly important before she loses both.", "If he asked me to quit my job and was making more than me, I'd do it. Law used to be fun and my passion until I got my job and saw how truly awful it was. I thought I could change things around here, so I tried to get up the ladder. I did make some positive changes and I like to think help pave the path for other women along with my mentor. Then I got pregnant. The fight to change things is no longer worth it. I hate my job now. I would do anything to have the passion and excitement he feels about his job.", "Sorry about my tone. I know you're trying to help but I'm a little on edge and the love of my life hasn't spoken to me for the last few days despite me apologizing multiple times.", "Feels like you're taking your day out on op rather than offering anything constructive at this point. I'm saying this as someone who agrees with your premise and I don't really like op.", "What success? I have to work the way I do to be able to keep paying the bills. I haven't gunned for anything on a professional level since I came back. I don't care about promotions or titles or getting the bigger office. All I care about is that I am able to provide my daughter with a good future and hopefully not miss out. \n\n&#x200B;\n\nFine I'm a shit parent. You got what you want? Don't you think I know that. Do you want me to give her up? Should I just sign away my rights and just run away? Will that make you happy???", "Her previous company can take her to court if she works with a direct competitor, as I assume she has her own clients and knowledge about the business. The company will want to protect their own interests, which is why the clause exists for workplaces where information is sensitive.", "So true. :(", "So it kind of sounds like you're burnt out from your job more than your parental responsibilities, and you're envious that he enjoys his job while you hate yours.\n\nRather than making him quit his job so you're both miserable, why don't you look at changing to something less intense? You might take a paycut, but would it be more of a paycut than him giving up his job entirely? And even if the answer is yes, surely the improvement to your quality of life would be worth it?", "His job that you want him to quit…", "So you're trying to make him as miserable as you are?\n\nGet out of this heinous job, find something with a charity or non profit and make a difference the way you wanted to. Respect your partner's work and accept that earning less does not diminish the work of the worker - it diminishes the priorities society has established.\n\nMaybe you can save your marriage if you wake up now. Your job is not more important.", "I would say I hope he leaves you. But, you probably be happy this way he can have sole custody and you don't have to bother with your child.", "The love of your life is hurt because you chose to put yourself and your career above him, your kids and your own mental health. The love of your life is hurt because you chose to belittle his field of work, and you told him to quit something he genuinely loves to do so you can continue to self sabotage yourself to ruins.", "I had a great day but thanks for your concern \n\nSorry for hating dead beat parents who can't be fucked raising their kids.\nMaybe it's from working with amazing kids who have parents like OP. \n\nOther people have already offered solutions and OP just doesn't care and doesn't want to make a change.", "God i can see ur gonna be the mom that goes “well i guess im just a terrible mother then” if ur daughter brings up issues she has with u in the future", "The problem is that you are extreme. You act like you must live in poverty, or are rich and working 15+hours a day. You do the extreme thing with the nanny situation too. \n\nFind another job while you are working. It's not that hard. Lower your standards of living. You don't need the best school districts, your baby isn't even going to school yet.  You can even downsize. Sure your kid will have a bit less, but she'll know your face.", "Bullshit. You can't be a very good lawyer if you are only making the minimum with your husband's income as well \n\nYour pride is far bigger than the love for your daughter or husband \n\nThis entire post you have painted yourself as the victim but the truth is husband is working far more hours than you, as he is being the parent and working. \n\nAnd you don't understand it isn't about making interent strangers happy. It's about actually taking care of the kid YOU DECIDED TO HAVE", "Try to let the haters roll off your back. As a former CF person that has a 2 yr old daughter now, I commiserate with you. You're doing your best. \n\nFortunately I was in the position to give up my job and eventually care for her.\n\nYou might consider a foreign au pair as an option if it's available to you... I know a family where I live that has one and they love it.", "I don't have any concern for you or your day. I was being polite. Chill the fuck out. Nobody likes a bully. Just because op is an asshole doesn't mean you should be also.", "I am not making the minimum. I make good money but that requires me to work the way I do. We need to have a college fund, a savings fund, an emergency fund and a healthcare fund. We also have a house fund because soon my daughter will need more space in a few years.", "We don't have space for that right now. Maybe once we're able to move."]}