{"id": 3712, "submission_id": "za1r7i", "title": "AITA for getting a trophy for my daughter who lost a competition?", "selftext": "My daughter's school had an art competition for the younger grades. My daughter spent night and day working on her painting. Any spare moment she had, she'd be busy in her room with it to the point that we'd even argue with her to take a break or eat. For some reason though she didn't even make the top 3. I know moms will always think their child's work is perfect but her painting was 1000% better than the people in the top 3. The winning paintings were bare and basic. And I know I'm not biased because there was one painting which was phenomenal (also didn't make top 3 btw) that I admit was better than my daughter's and other parents mentioned they thought she make top 3. I'd post them here for you guys to rank them yourselves but that wouldn't be appropriate or kind to the other kids. Anyways, my daughter was very disappointed by her loss and was very demotivated.\n\nTo cheer her up I asked a friend of mine to make her a fun little trophy, similar to the 1st place one used at the competition, to give her regardless because her artwork was beautiful and definitely deserves a reward. I organised a little prize giving party thing with my friends and family in our house and gave her the trophy. It obviously isn't the same as actually coming 1st and being recognized at the school but she loved it and clearly appreciated the little recognition we could give her. I posted a picture of it and some school moms said that I was being disrespectful to the competition and offensive to the actual winner since it undermines their work/title. I doubt any 10 year old is looking at statuses but alright. Aita?", "created_utc": 1669932885, "permalink": "/r/AmItheAsshole/comments/za1r7i/aita_for_getting_a_trophy_for_my_daughter_who/", "score": 51, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > It a replica of the original trophy although still somewhat different so i see how it can be offensive\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Bruh. Just take her out for ice cream, applaud her efforts, tell her that you like her painting and why (use specific examples like her choice of colours etc). If you really want to up the ante get her ice cream AND take her on a weekend trip to your nearest art museum and make it a fun learning experience as well as an opportunity to bond with her parent.\n\nI understand she was happy in the moment but she’s going to eventually realize that she got a pity trophy and be embarrassed of having it displayed. As a kid who got participation certificates I can tell you that I trashed them when I got a bit older and realized what they were.", "YTA because you're setting your kid up to think that a) trophies are what matters, not the effort you put in or how you feel about your own work and b) that what mom/dad thinks is more important than the people actually grading your work", "I'm going with YTA. The thing is, we don't always win even when we do phenomenal work. Part of growing up is learning to take that hit. That doesn't mean you can't take her out or celebrate her work. Her hard work should be applauded. But she hasn't learned to accept defeat gracefully now. I know it sucks seeing your kid let down but those let downs help them grow. This was a wonderful opportunity for a \"You win some, you lose some. Don't let those losses stop you\" conversation. Instead you told her she should always win.", "YTA.  \n\nKids need to learn that not everyone wins, that way they understand to have realistic expectations.", "YTA Art is subjective and it you should just tell your daughter while her work is great and you love it, it just wasn't right for what these judges were looking for. You're not helping her by giving her that trophy. You could have just taken her out for a dinner or something but by giving her a trophy and a whole party you're not teaching her the lessons that will help her win contests in the future.\n\nI say this as someone who has been drawing and entering contests since I was a child. Sometimes it's about making sure you meet the criteria for the contest, not just producing good artwork. I've learned by going to talk the the judges in the contests to find out what I was missing.", "NTA", "Gentle YTA, because you're obviously not doing anything malicious. A better strategy would be to teach her that there's nothing wrong with not winning, and that the value of her art is not based on what people think about it, or how it compares to other works. Teach her to be happy for the winners, even when she's not among them", "NTA", "YTA purely because kids really need to learn that they aren’t going to win everything, even if they put a lot of work into something. I’m not saying you’re the AH for doing something for her daughter to appreciate the effort and work she put in. But giving her a trophy and making up for the loss is not good. Mommy can’t always step in and make a trophy every time they don’t get first place because she knows better.", "yta.  Children who are not taught how to deal with loss become adults that do not know how to deal with loss.  You are the problem.", "NTA You gave her a little trophy to recognize her great work and let her know that shes not a looser just because she lost this particular competition. You wanted her to feel good about herself and you put a little celebration together for her so she would nothing wrong with that. I remember the movie little miss sunshine where the grandpa says \" a looser is some one who's so afraid of not winning they dont even try, now your trying right? then your not a looser\". Words of wisdom.", "ESH. You should reward your kid with something other than a physical trophy. \"Hey let's get ice cream to celebrate how awesome your work was\"\n\nYk what I mean? That trophy will likely remind her of the real trophy she did not get. \n\nThose moms are dramatic and they need to find other things to worry about.", "Info why not just proudly hang your daughter's work somewhere nice at home to really show her that even though the judges didn't appreciate it. You and your family love it enough to hang it somewhere nice?\n\nAlso as others suggested just treat them to icecream or something they really enjoy anyways? \n\nWhy hang a participation trophy when you could frame and hang the art she made nicely somewhere in the house??", "NTA - you recognized her effort, which wasn't for nothing. Recognition of effort can go a long way to building confidence in success and that is important, especially when it's more common for women to doubt their own ability, even when they are successful.", "ESH. This was a teachable moment that you kind of dropped the ball on because you were afraid of hurt feelings. That being said, the other moms should mind their business", "A reluctant ESH \n\n\n\nThe other parents can mind their own business.\n\nI love you wanted to celebrate your daughter and acknowledge her work. \n\nI get wanting to celebrate your daughter and her work, I just think there are other ways. You could have had the gathering and friend’s/family could write in a booklet what they feel looking at the painting, what they think of it. Have your daughter talk about what she liked about it, why she liked doing it? You could still celebrate her, but not necessarily with a trophy.  \n\nMaybe make something with the painting….cards, a mug, a shirt, a piece of jewelry. I think Artsonia does this or maybe Shutterfly.", "NTA, I don't think you were disrespectful to the parents. After all, the party was for friends and family and I doubt you made a whole speech putting down the other kids. It's sweet that you support your daughter in this way. I wouldn't worry about the school moms, what's important is that your daughter feels appreciated for her hard work.", "YTA. The reward should be the beautiful art piece that your child created and which all of you treasure. Instead that's been made meaningless because you threw a participation party. Way to use that A+ parenting and really show your kid what you value.", "NTA for giving a trophy because it's good for parents to be biased and support their kids for hard work regardless of whether they \"win.\" HOWEVER, posting it online does come off as petty rather than supportive, since as you noted it's not like your daughter is looking at the posts.", "If the painting was good, offer to buy it from her for a few bucks and then hang it on the wall in your house to be enjoyed and appreciated.  \n\nI don't think the replacement trophy makes you an AH, but it probably does give the kid the wrong idea about how competitions work.  Eventually she'll think of it as a loser's trophy.  It's none of anyone else's business like some kid is gonna be disrespected because someone else gave their kid a replacement trophy.  They have the real trophy and everyone knows the difference, including your daughter.  Anyone complaining about it disrespecting the winner is a nosy busybody trying to invent something to be offended about.  NTA", "YTA. You gave your daughter a participation trophy. The competition was looking for something specific and your child didn't meet those requirements. \n\nThe better way to handle that IMO is to ask the judges what she could have done differently that would have improved her chances of winning. Ask for constructive criticism for her to improve on.", "NTA for getting it for her, but maybe TA for posting it. I don't even think it's appropriate to make an elementary school art exhibit into a competition. It should have just been an exhibit. And who were the judges? Did they know who made each painting?\n\nAnyway, I think it's fine that you recognized your daughter's hard work. I would emphasize the effort, not the result, as that will serve her better in the future.\n\nHowever, posting it on social media was not about your daughter. It was you saying, \"Look at this great thing I did for my daughter. Aren't I a cool mom?\" Parents want to publicly document everything they do for their child and open themselves up to criticism, but then they get butt hurt when someone judges their parenting. Nobody even needed to know you did that.\n\nYou already had a little celebration for family and friends. That was probably enough.", "Dude you literally could’ve hung her artwork at home. YTA, your daughter needs to learn she won’t win/get everything in life", "NTA. BUT… it’s important to teach kids how to lose. So while you are praising your child for hard work, effort and talent it’s also important to let her feel loss and failure and know how to deal with it in the real world because it’s a necessary skill to have as an adult.", "NTA - the other parents need to unbundle their panties", "NTA-you posted it on your personal site and it was a family event.", "**NTA** \n\nYou  did not pretend  she won the school trophy and you can give your own family trophy if you want to. \n\nI think it’s lovely that you did to reward your daughter for all the effort she put into it- and because you yourself love the artwork.", "YTA. Congratulations for bringing up another special snowflake into this world, we really need more of them!", "An ACTUAL PARTICIPATION TROPHY!!! YTA.", "NTA for doing this for your daughter...that was very nice...but I can see how other parents might think you were making a statement about the competition and the winners.\n\n(the cynic/realist in me also thinks that by 10 years old kids need to learn that sometimes stuff happens that isn't \"fair\".)", "NTA. Your reward you gave to your daughter in no way diminishes the awards given by the school. It the mom’s who have an issue with it so F them", "YTA. Things like this is why the world is full of entitled, self centered, sh\\*tty people. Learn to lose. Learn to accept that you are not diminished as a human by not being in the top 3. Learn that working harder than everyone else doesn't mean you are going to be the best. Learn to be upset, rethink your strategy, adjust your technique and get back on the horse. Those are useful skills to have to navigate life. Having your mom buy you a participation trophy and a ceremony teaches you nothing but how to be entitled.", "NTA is what I was thinking all the way through, but then those last couple of sentences? You crossed the line into A", "Soft YTA. I’m all for supporting our kids but I’m also a fan of dealing with things honestly. Sometimes you win, sometimes you lose, sometimes it’s fair and sometimes it’s not and part of growing up is learning to accept that. I get that you’re well-meaning, but I think there were better ways of celebrating your daughter’s hard work. Instead of giving her a made-up participation trophy, why not have her work professionally framed and hung in a prominent spot in your home for everyone to enjoy? You could have surprised her with it at your celebration party, posted it online talking about how proud you were of her talent and you wouldn’t have stepped on anyone else’s toes in the process.", "YTA. You stole a growth opportunity away from your child. Kids need to know that they can fail/lose and it will be okay. That is how they develop resilience and learn how to bounce back. There are going to be many more and higher stakes losses for your child that seem unfair because that is life. If you “fix” every loss for her, she will not learn how to handle failure and will meltdown when you can’t fix it for her. When she doesn’t get into her first choice college, a person she likes doesn’t like her back, she doesn’t get hired for a job she wants and on and on.", "Soft, YTA.  Your heart was in the right place, but you messed up, just a little. I think going forward,  maybe you should have a talk with your kiddo? Explain to her that even though she didn't win the contest, you got her the trophy because you saw how hard she worked and how much time, effort and passion she put into her project? And that you are so proud of her dedication and work ethic? And that even if she didn't win, this time, there will always be other competitions and opportunities that you are sure she'll win if she continues to work hard and grow her skills? You know, the whole \"If at first you don't succeed,  try and try again.\"\n\nI know its hard, as a parent its heartbreaking when our kids experience dejection and disappointment, and our first reaction is to take that pain away and make them feel better. But it's also our job to ensure that they learn from these hardships and process them in a healthy way, and grow up to be well rounded individuals, who can handle what life throws at them. Best of luck,  OP", "YTA \nOh man very cringe. How embarrassing for your kids and your family. And then you post it on social media. \n\nYou gave a knock off trophy to your daughter after she lost a comptetion. Wow.\n\nArt is subjective, whilst her art may have looked the best to you, it obviously didn't to the judges. You win some, you lose some. This would be a great teaching lesson to your kid.\n\nYou could have hung the art somewhere in the house, take her to her favourite restuarant or do an after party celebration to show support but the knock of trophy just makes this so \n\nImagine when people ask her about the trophy hahahha", "NTA. I normally dislike the idea of \"participation trophies\", and even as a kid I easily understood which trophies were actually worthless junk. However, the amount of effort you put in for your daughter made it a GIFT, and a celebration with people who care about her! You acknowledged that she worked hard and decided to reward her for it. It's okay to bend the rules once in a while to keep your kids spirits up. However, I would just be careful putting down the other paintings like that. Depending on the focus of the party, it does tread dangerously close to Y T A territory. Obviously someone thought those painting deserved their awards, and it's not healthy to teach your kid to search for reasons it was \"unfair\" that they lost.", "NTA.  You are commending your daughter for her hard work. You aren't saying to her \"Everything you do is perfect by virtue of it being done by YOU\" or \"you're better than those other kids.\" You are recognizing that she really put her heart and soul into this.  You've given her validation that came from the people who love her, and not a bunch of strangers. NTA at all. You're a good parent!", "NTA Art is subjective and I think encouraging her creativity is important. If this is something she enjoys and is passionate about, why not encourage and celebrate her hard work? If you didn't reward her as you did she may decide to give up what may be a hobby and/or a career she enjoys or is passionate about. \n\nNow, if you went to the school fought with them and forced them to give a trophy to everyone, that'd be a different story but you didn't. You rewarded her hard work as any parent would.", "Ahhhhh I’m on the fence of it all. I don’t agree with giving your kids a back up trophy. I’m sorry but that is just not the right message. You could of done a whole celebration and framed her painting to hang in the house or something and I fully support you backing up your daughters ambition. \n\nSo the trophy thing was a little too much but understandable you’re her mom. But also life just straight up isn’t fair a lot of the time. She very likely got screwed (cmon, a school competition being fair? As if *cher voice*). So awesome job validating her effort. But cmon posting on fb with it visible? 100% that other mom overstepped. “Disrespectful of the competition” is an effing insane take. But I don’t know odd move. \n\nInstead of making the celebration about her hard work and how proud you were *regardless* of outcome because she has true talent and is driven to do the hard work, you kind of morphed it into no they are wrong and here is a trophy to prove it (and clearly it irked that psycho mom). \n\nI’ll go gentle, gentle YTA with a close NAH here.", "NTA.  Although I don't understand why you had to post about it.  But, ok.", "Absolutely NTA. You should be parent of the year (unless you posted here to get this particular reaction)! I'd do the exact same thing for my son!\n\nAnd just to point it out, the reason why a good painting wouldn't win is probably political. Kids' parents had connections, bribery, jealousy other kids had better art, suppression of better skills, etc.\n\nYou did real good! Except for competing with the official trophy by posting it. Doing that was just an attempt of getting attention or overwriting the official trophy (all of this assuming you truly were unbiased). Your daughter was very happy with what you did. Stick with that, very nice of you.", "NTA - I know the whole participation trophy idea has a bad rap, but you should be rewarding someone’s hard effort, not results.  That’s absolutely in your wheelhouse as a parent and I commend you.", "NTA. My parents once did this for me, it is actually quite healthy. didn't make me a sore loser or anything, just cheered me up. The other moms sound bitter.", "Yta. Can't baby your kids forever. You should teach her in the real world she won't always be first, number 1, win, best pick, or top rank.", "YTA There we’re teachable moments that you negated here", "NAH for celebrating your daughter's hard work with your own trophy and party in her honour. She worked really hard and recognition from parents can go a long way.\n\nPosting photos of your celebration online was a weird move. Did you post this on your private account's page, or on the school's page?\nIf it was posted on your account and you didn't \"@\" the school, NAH.", "NTA", "Info: how was the competition judged? Was it \"likes\" based or judged by the art teacher?\n\nWhat rules did the competition have? Was there a specific subject matter or art style that should have been used? \n\nLike in my school we always did an art contest for red ribbon week, a week dedicated to being drug free. But every year had a different theme you had to incorporate. Like one year was about saying no to drugs, one year was specifically about tobacco use, one year was specifically about drinking. Etc. Etc.", "\"Well, the world needs ditch-diggers too\".\n\n-Judge Elihu Smails", "YTA - Participation trophies are a large part of what's wrong with this society right now.  Not everyone can win, not everyone gets a prize.  People need to learn to take losing with grace and try again.  Art shouldn't be about the prize anyway--it's about expressing yourself.  You devalued all of that and missed the change to help your child learn valuable lessons.  If she's going to pursue art, she better start getting used to rejection, because it WILL happen.", "Can u show the painting.", ">And I know I'm not biased because there was one painting which was phenomenal\n\nJust because you're not utterly blinded to all the other art doesn't mean you're not biased. \n\nThere were so many lessons your daughter could have taken from this experience. That winning isn't the only measure of quality. That putting in good effort is satisfying on its own. That you can't control how good other people are. That others receiving a better score/rank than you doesn't undo the value of your own work. \n\nBut instead you reinforced that winning equals getting a prize, and that if you don't get a prize, you've been cheated. \n\nI don't quite want to call you TA, because I don't think you actually hurt anyone in a real way, but I do think it was short-sighted and rather silly; and that if you keep doing this long-term, it WILL hurt your daughter when she has to adjust to the real world as an adult.", "It was your business to give her a trophy if she won or not. But why did you have to post it for others to see? I don't think that was a good idea.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy daughter's school had an art competition for the younger grades. My daughter spent night and day working on her painting. Any spare moment she had, she'd be busy in her room with it to the point that we'd even argue with her to take a break or eat. For some reason though she didn't even make the top 3. I know moms will always think their child's work is perfect but her painting was 1000% better than the people in the top 3. The winning paintings were bare and basic. And I know I'm not biased because there was one painting which was phenomenal (also didn't make top 3 btw) that I admit was better than my daughter's and other parents mentioned they thought she make top 3. I'd post them here for you guys to rank them yourselves but that wouldn't be appropriate or kind to the other kids. Anyways, my daughter was very disappointed by her loss and was very demotivated.\n\nTo cheer her up I asked a friend of mine to make her a fun little trophy, similar to the 1st place one used at the competition, to give her regardless because her artwork was beautiful and definitely deserves a reward. I organised a little prize giving party thing with my friends and family in our house and gave her the trophy. It obviously isn't the same as actually coming 1st and being recognized at the school but she loved it and clearly appreciated the little recognition we could give her. I posted a picture of it and some school moms said that I was being disrespectful to the competition and offensive to the actual winner since it undermines their work/title. I doubt any 10 year old is looking at statuses but alright. Aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA Sometimes you win and other times you lose. And while losing sucks, it is a part of life and part of being a parent is teaching our children how to handle those losses. You didn’t reach her anything.", "My college bf in college actually cussed me out because I had won more awards than he had during graduation. His family had enabled his belief that his entire value laid in his academic achievements. \nYou have good intentions, but in the long run you will be harming your child if you keep doing this. She needs to be able to be ok not getting awards.", "So you're not comfy posting pics of all the entries but you want us to take you and others word that your daughters art rocked more than any of the actually chosen 3 entries art have ever rocked before? \n\nNo..Youre fittin to raise an entitled spoiled kid and teen who thinks trophies go to everyone that works hard. \n\nTrophies go to chosen individuals but a congrats can go to anyone.\n\nYou need to tell your daughter sometimes we don't get the things we really want or work hard on. It's LIFE. Not the end of the world. \n\nYou can't always he there to bail out your daughters feelings from the feel bad jail. We all lose thems the breaks \n\nYta", "The trophy thing. Weird, wouldn't do it myself, but whatever. Feel like there are many better ways to tell your child you're proud of her than to essentially override the judges decisions.\n\nWhat I don't get is why you felt the need to post it. Your friends and family were already there apparently, exactly who were you posting it for? What were you hoping to achieve? Because: \n\n>some school moms said that I was being disrespectful to the competition and offensive to the actual winner since it undermines their work/title. I doubt any 10 year old is looking at statuses but alright\n\nApparently the audience was other school moms, some of whom may have been parents of the kids who DID win. Is the 10 y/o checking statuses? Probably not, but their friends and family could well be. The judges? Trying to make sure they knew you thought they were wrong?\n\nFeels pretty passive/aggressive to me.", "YTA come on are you going to pack her lunch every day when she’s 30 too? And come over to make her bed? Let her learn life’s lessons please. Hug her and tell her you’re proud of her effort", "Of course YTA.", "Soft YTA. I think you were trying to do what is right, but the reality is kids need to learn that they will not always win, and that life is not always fair. The best thing to do here would be for you to praise her efforts and how hard she worked and emphasize that that is what counts. Then maybe take her out to dinner to celebrate her hard work. A trophy was not necessary and it was really not necessary to post anything", "NAH in my opinion, art is to the taste of the observer. While you were trying to make her feel better maybe try a different approach next time. My sister went through things like this as an artist all the time, it broke her heart but all we did was reassure her while she may not have won, her art was it’s own type of beauty.", "ESH. I was once a young kid and it seems that schools havnt changed and their awards still don't go to those who deserve it. I think it's healthy and apart of life to not win and to be disappointed. You could have taken her out to dinner and told her how good you and some other moms thought she did and how she should have won but things are almost never just and fair. However you shouldn't have made a whole ceremony giving her a trophy and making it a big deal that winning is everything. That's improper praise that may lead to a lazy and entitled child. I'm sure she will be fine but I definitely would not do something like that again. My parents never did stuff like that and I grew up with the mentality that winning is nice but not everything and losing doesn't mean I suck or that I am not appreciated. Whereas I've had friends who were always praised for everything and ended up being either mamas boys or insufferable entitled people who didn't take rejection or failure well at all because they never really dealt with it as a kid.", "NTA for what you did for your daughter.  But you have to be careful with things like that.  What you gave her was a participation trophy.  Posting it on Social Media was a bad idea because it does undermine what the other kids did.  And Yes, 10y/o's do look at social media.  It's 2022 for crying out loud.  Not all but enough to give doing something like this a bad rap.  Making your daughter feel good about her work was a great thing to do.  Posting it on social media and undermining the whole premise wasn't.", "I know you are trying to help her but YTA. Award ceremony? Trophy? What's wrong with just hanging up the art and giving her a hug?", "When there was clear bias as said herself in the competition itself how is she being an asshole", "The angle I was trying to go with was teaching her that at home, she'll always be a winner and that no matter what happens outside, she'll get support and recognition for her work at home.", "I can get behind this response.", "I posted a picture of all of us since it was a nice picture and I love sharing those moment. I didn't say anything about the competition or anyone.", "I posted it privately and didn't @ anyone. It was more of a family (and friends photo) but the trophy was visible.", ">how was the competition judged? Was it \"likes\" based or judged by the art teacher? \n\nThere were 3 judges, I couldn't recognise any of them but they were apparently teachers at the school. No idea whether they were art teacher or not but the art teacher who teaches my daughter wasn't on that panel or at the competition.\n\n>What rules did the competition have? Was there a specific subject matter or art style that should have been used\n\nI don't recall there being a specific theme or much rules. There was some guideline but it's slipped my mind. I'll ask my daughter to remind me and edit this comment later.", "Honestly we'd need to see the work to know if there was actually a bias. Sometimes \"plain\" art has better technique and general quality.", "You do realize that art is subjective, it’s in the eye of the beholder. I’ve competed in enough dance competitions to know that you don’t please everyone. \n\nIf she can’t separate herself from her own parental bias, she is the AH for not teaching her daughter to take a loss and pick herself up. Failing can bring such growth and learning from your failures can drive you to be better. \n\nInstead she gave her a worthless participation trophy and chose to teach her daughter nothing. Big Fail!", "There will always be teachers with biases. They still will be the ones grading your work and determining if you pass a course.", "She won't always be at home, though. She will not always be a winner. The sooner she learns to deal with that the better.", "I totally get that. I have a child that same age and she's a really emotional kid. Losses hit hard. But it's part of their growth to take their losses. You can let her know she's always a winner at home without going so far to make her think she always deserves a trophy.", "But then you are giving her a placebo to make her feel better instead of giving her tools to succeed in life. \n\nMy daughter and I have competed in many dance competitions. We didn’t always agree with the judging, but I never gave her a fake trophy as a bandaid. I explained to her that there will always be someone better than us and life isn’t fair. But strive to do your best and you will always be proud of yourself. Validation should first come from yourself and not necessarily be accompanied by a win. Failing and getting back up can be so much rewarding. \n\nYTA", "You can teach her recognition and support and praise without having to get a winners trophy. So you tried to teach her good lesson , but kinda threw in an extra bad lesson on top, that might have an impact on future times when she doesn’t win.", "Then I guess I don't see anything wrong with it. It still feels odd, but not necessarily wrong.\nI'm glad the party made your daughter happy. : )", "I'm sure there is a bias here, OP's bias against art her kid didn't make.", "Art is subjective and I will admit it's wrong to have parental bias but encouragement is different from taking a loss rather than tell your child you tried but to encourage her love for Art the op isn't an asshole because she gave encouragement to her daughter at the end of the day realizing that you did your best and to keep trying is better learnt", "<3", "Yes and that’s what she should have done. Instead she made a trophy and told her daughter they made the wrong decision. \n\nLife isn’t fair, we all know this. I find that learning that younger makes it so much easier to go through life. Also knowing that she could work with the ideal to get better and not get that trophy, will help her daughter so much more. Then she can compete with herself and work on a healthy relationship with competition. To also enjoy art and get better at it.", "Well what's done is done as far as I'm concerned as long as the kid knows that she's being encourage in her endeavors, op did an ok job with the parenting"]}