{"id": 3728, "submission_id": "za61l6", "title": "AITA For telling my neighbor to stop playing in my driveway?", "selftext": "Long story short I opened my garage to bring the trash around to see my neighbor and his two kids play with a plastic bat and ball literally in my driveway to across the street. The kid was standing halfway up the driveway and the dad was across the street throwing underarm pitches to him. I went up to the father and i was like, “can you play in your own yard?”. He gave me a stare and continued to play for awhile in my yard until my friend pulled up in my driveway. We have issues with these guys pretty regularly. To being loud past 11pm to leaving trash in the yard. I just think it’s pretty disrespectful to play in our driveway when you literally have your OWN. What do y’all think?", "created_utc": 1669942463, "permalink": "/r/AmItheAsshole/comments/za61l6/aita_for_telling_my_neighbor_to_stop_playing_in/", "score": 80, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I told my neighbor to stop playing in my driveway\n\n2. It might make me seem possessive and rude.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Same situation here. Kids play in my driveway and backyard instead of their own. I ignored it until I started finding trash and toys on my property, and then gum and food stuck to the side of my house. A couple months later, the older kids friends were parking in my driveway when visiting them. That's where the line was finally drawn. I don't want to be \"that\" neighbor, but there's truth to the \"give an inch, they take a foot\" saying.", "NTA. That's not a good neighbor.", "**NTA**. This is a huge safety and liability issue. Protect your boundaries. God forbid the kid continues to think it's acceptable and is playing behind your car when you aren't aware. \n\nProtect yourself.", "NTA. That's what sprinklers are for?", "NTA.  The only times I can remember neighbors playing in my yard is when I was a kid myself.  There was a swarm of like 15ish of us who were within a few years in age who played together sometimes, and that would often end up with water balloons or water guns going over large parts of the street.  There were a couple houses where we avoided the yards because we’d been told to, but everyone else was pretty tolerant of us.  Probably helped that we were good kids and didn’t mess things up, stayed out of flowerbeds and such.\n\nBut that’s a very different situation from one household choosing to use your yard instead of your own - that’s entirely different.", "NTA\n\n1.  If they get injured on your property, you can be held responsible for their bills, which means your homeowners insurance will increase. \n\n2.  They were trespassing on your private property. \n\n3.  They could damage your home, vehicle, or property throwing a ball. \n\nIf it happens again, send a cease and desist letter. Get cameras up in case something happens, or they try to retaliate.", "Nta. Your property your rules.", "NTA \n\nI wouldn't call the police but I would drop in the next time I passed by to find out what the law actually says. \n\nI'd probably let the parents know that I stopped by the police precinct, if it persists.\n\nThen I would follow the directions given to me, if the behavior persists.\n\nI would be less concerned about being \"that\" neighbor than I would for having an uninvited person injured on my property, or my property damaged by uninvited people.", "NTA. I’m concerned by playing ball from across the street. I’m afraid one of the kids would get hit by a car or something.", "NTA.\nAside from them having their own yard, if one of them gets injured on your property, they can sue you for damages. \nCall the cops next time and have them removed. Trespass them if necessary.", "What if a child got run over because they were playing in a driveway? NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLong story short I opened my garage to bring the trash around to see my neighbor and his two kids play with a plastic bat and ball literally in my driveway to across the street. The kid was standing halfway up the driveway and the dad was across the street throwing underarm pitches to him. I went up to the father and i was like, “can you play in your own yard?”. He gave me a stare and continued to play for awhile in my yard until my friend pulled up in my driveway. We have issues with these guys pretty regularly. To being loud past 11pm to leaving trash in the yard. I just think it’s pretty disrespectful to play in our driveway when you literally have your OWN. What do y’all think?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", " NTA. That’s a liability if they keep doing that and someone gets hurt on your property.", "NTA. I hate to be this person but next time you need to call the non-emergency police number. If those kids get hurt in your yard, you're on the hook. It's awful neighbors can't be respectful.", "NTA. It's your property - end of story. Also if someone gets hurt on your property, I'm not sure if they could sue or not, but I would be concerned about that.", "I need to move out of the city. I’m glad I’m not the only one who goes through this.", "Exactly, the safety and liability issue. OP is definitely NTA", "[removed]", "This, my driveway and our neighbors’ driveway are next to each other. I was coming home and turned into my driveway, only to stop suddenly to avoid hitting the neighbor’s two kids sitting in my driveway hidden by their mother’s car. \n\nHad I not been driving slowly they would have been hit. I had no way of seeing them until I turned in. After that incident we fenced in our front yard and gated off the driveway. There were many other issues prior but that one sealed my decision to get the fence done.", "I would think so."]}