{"id": 3731, "submission_id": "za5aac", "title": "AITA for telling my husband to leave me the hell alone for the night?", "selftext": "[removed]", "created_utc": 1669940672, "permalink": "/r/AmItheAsshole/comments/za5aac/aita_for_telling_my_husband_to_leave_me_the_hell/", "score": 47, "replies": ["Your post has been removed. \n\n#Do not repost this without contacting the mods for approval, including edited versions. Reposting without explicit approval will result in a ban.\n\nYou did not properly respond to the judgement bot. Your reply must clearly and directly address why you think you may have wronged the other party involved in your conflict.\n\n\nWhile your post was automatically approved by the bot, after reviewing your response manually, we found it did not properly address the question.\n\n\n[Judgement Bot FAQs](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_judgement_bot) ||| [Subreddit Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n\n\n#Please ensure you have reviewed this message in full. We will not respond to PMs to individual mods. [Message the mods](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) with any questions.", "He didn’t want someone to possibly take something he was fixin’ to give away anyway?", "I think your husband overreacted.  NTA", "Him saying the thing about no one listening makes me think it’s not really about the file cabinet for him, something else is going on. NTA but I’d try to talk when you’ve both cooled off because yes, he had an extreme, insane overreaction. It’s also super weird and not at all normal that he’d be so adamant about your coworker not being in the house.", "NTA. Fear makes people do weird thing. Be irrational.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have a co-worker picking up an old desk and file cabinet in the morning. \n\nMy thoughts were, hey, let's get them on the front porch since husband won't be home in the morning to help (no way I could move these myself). He is adamant about no people in the house we don't know. Technically he doesn't know the co-workers., so he's good with idea initially. We also have cats who might get out properly wrangled, front door is only 1 door. \n\nWe both take care to move these items onto the front porch. Especially careful to not scratch up our floors, and the cats were all fooled with treats into a room with no risk of getting out. \n\nAbout 20 minutes later, we both see some possible dumpster divers getting into a dumpster of a house that is soon to be listed. I say \"well, it's dark,  but we don't know what they are doing. They might have been told to take what they want, no way to tell. Whether it was illegal or not, if you are getting stuff out of dumpsters you probably need it worse than a landfill does. \"\n\nHe just loses his shit. \"I'm not inviting junk collectors onto our property! I don't want shady people around!\" Literally after all the care we did to not scratch the floors, he pulls this stupid ugly old file cabinet back inside. No thoughts about the cats escaping (indoor only) and no regard for the floor, which he did in fact fuck up. \n\nHe just kept saying he thought people would take stuff off of our porch uninvited. We have patio furniture that cost nearly 1k. It's been on the front porch for 2 years. The furniture on our back deck that also was not cheap. \n\nI told him after he freaked out and threw the old file cabinet back inside, that he was being ridiculous and he should fuck off downstairs for the night. \n\nI feel kind of bad for getting that pissed.  He just kept saying \"No one listens to me!\"  But he had said nothing about these items being on our porch until he saw the \"maybe\" dumpster divers. \n\nI don't know. What are your opinions?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Well, I told him he was being psychotic and a complete asshole. Maybe I'm the asshole for not understanding why someone can flip shit about another person taking free things, even if they weren't for that particular person.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "“No one listens to me” is one of my father’s favorite lines. Yeah, no one listens when you’re being ridiculous. He gets angry because he wants *obedience.* NTA but I think he could use some counseling to address whatever is going on here.", "NTA - your husband sounds like a child having a temper tantrum.", "ESH he overreacted and you sent him away for it, as if he were a naughty child.", "What kind of neighborhood do you live in? Is it a high crime area? If not, then NTA.", "ESH\n\nHe has laid out a clear boundary about not wanting someone he hasn't met in the house, he communicated to you how he feels. He did overreact about the stuff being taken, I'll give you that. You overreacted as well.", "Yes I just don't understand.", "The whole response he had left me uncomfortable. The only solution he'd had when trying to rehome the furniture was to call a local outreach service (ok, people you don't know on you're property and most likely serving community service). So he was ok with those folks but not a co-worker of 3 years coming in the house? He was ok with the charity coming in the house. I was not.", "Well, he has a whole ass man cave, 2 bedrooms and a bathroom. He's fine. Me, not so much.", "Control. He wants to be able to give it to who he wants even though it’s basically trash. And why can’t your coworker come inside? You know her correct?", "He just sound weird and paranoid or something. Does he have other issues?", "The co-worker you have a 'permanent' connection to- the charity people you do not. He probably feels threatened by coworker and doesn't want another man in *his* house.\n\nTo the people digging around, I think he was being classist, despite wanting them to go to charity.", "Good luck with your husband.", "More control.", "Worked together 3 years. He is weird about people coming inside.", "Yeah, he needs therapy.\nNTA", "Well tough luck for him since he knows that you can’t carry it out yourself. Can’t have your cake and eat it too. But he does not sound well mentally either. Hard to tell if it’s anger issues or what but it’s not a good look at all", "Why is he so uptight? He sounds like a pain in the ass to live with."]}