{"id": 3734, "submission_id": "za2jxg", "title": "AITA for spitting out food in my girlfriend's car?", "selftext": "I don't really think I'm TA at this, as I really felt I had no other choice. Would like to hear thoughts if anyone thinks I am TA tho \n\nI(26)M, have ADHD - and some sensory issues that come with it, I'm mostly fine around food. And it barely interferes with my normal life — except when it comes to eggplants and oranges. Especially eggplant \n\nThe texture feels so wrong in my mouth - I literally cannot bring myself to physically swallow it, I gag on instinct. I just want to get it out ASAP out of my mouth - you get the point. It makes me feel awful.\n\nMy(27)F girlfriend, let's call her Izzy, she loves eggplant. She orders it when we're at a restaurant everytime, and although I have no problem with her eating what she wants, she always tries to talk me into trying one aswell - saying I just \"dislike\" it, but if I try maybe it'll be an acquired taste, and that I'm being dramatic when I say i physically can't handle it.  \n\nToday, Outside of work - she waited for me in her car. She brought 2 pitas she claimed to be \"falafel\", she brought me untainted falafel before this - so I didn't suspect it. \n\nI started eating, and at first everything seemed fine. But then I took a bite and felt *it*. The texture I hated so much. I kept chewing, I thought maybe it's a pickle. No. I could never mistake the Nausea, I tried to swallow and gagged as usual. It was eggplant. \n\nI tried to get a napkin from the glove compartment to spit it out (We store wet wipes and napkins there) and found none, I turned to my girlfriend and she just kept focusing on the road, ignoring me. \n\nEventually, I couldn't hold it anymore. I gagged one last time and it got on me and the car seat. She freaked out, asking why would I do that. I asked her why would *she* try and make me eat something she knows I hate. She claimed it was to help me stop being picky, and that she thought she'd catch me liking it if I didn't know it was in the food. \n\nThis led to an argument, me trying to emphasize how fucked up this is of her, and her claiming I'm throwing acts and ruining her car just to avoid eating something I don't like. \n\nAITA? Most of my friends are on my side, but others say I should've spit it out the window or found another way, not on the car seat", "created_utc": 1669934556, "permalink": "/r/AmItheAsshole/comments/za2jxg/aita_for_spitting_out_food_in_my_girlfriends_car/", "score": 59, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I spit the food in the car, my friends pointed out I could've done it out the window or searched another solution\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\n> She claimed it was to help me stop being picky, and that she thought she'd catch me liking it if I didn't know it was in the food. \n\n#That's fucking abusive.", "NTA. Oh dude.... that's fucked up. I would be seriously reconsidering your relationship at this point.", "This is not about you vomitting in the car. This is about her not accepting your food sensory issues.\n\nDo you trust someone who on purpose feeds you food you can't eat without feeling sick?\n\nComming from a family with food sensory problems. If i put somewhere mushrooms in, I will tell. And if known in advance i buy the kind a mushroom they actually can eat (it is a little bit mroe pricey) Things like this. This is just one of the long list.  \n\n\nEdit NTA.  Food sensory issues is a real problem... Maybe next time try spitting it out of the window. But what happened, happened. And I hope she learned a lesson not to mess with it.", "NTA- even if it wasn’t a sensory issue… even if it was simply you don’t like it…. You set a boundary that she continuously attempts to break. If it hasn’t changed by now, it never will. Break away, and go find yourself someone who will respect you as a human enough to respect your boundaries.", "NTA. It is never okay to fuck with someone’s food. That is a basic, simple rule that people don’t seem to get.", "NTA, that's so fucked up of her to do. I'd go so far as to say it's abusive too.", "Yes you could have tried to get it out the window but she is completely out of line for trying  \"to help me stop being picky,\".  You are an adult who can decide they hate a particular food.   NTA and I would rethink this relationship.", "NTA, she knows your strong aversion and decided to trick you into eating it.  Annnnd that's how she found out how to steam clean her car.  Honestly, I'd be re-evaluating this entire relationship.  She doesn't respect boundaries and will go so far as to trick you.  What if she does the same to someone with a deadly food allergy because she thinks they're just dramatic?", "NTA That was a super messed up thing for her to do.", "NTA. Your girlfriend is for tricking you into eating something she is well aware you have issues with. Reminds me of asshole people who don't believe in food allergies, and try to sneak allergens into other's foods.", "NTA. Your girlfriend is fucked up and honestly mean.", "NTA.\n\nSomething similar happened to me - I'm sensitive to gluten, so I CAN swallow it and not notice a thing, but in an hour or two I get these cramps in my bowels that hurt to a point where I just bend over and am unable to move because of the stabbing pain.\n\nMy wife's grandma just doesnt believe me, since when I took a test for Celiacs, it came back negative (doc told me that for best results Id have to eat gluten for about two weeks before the tests come back fully positive, not willing to go through that), so she thinks Im making it up to feel special or something.\n\nSo almost every time we go to her place, she'll try to feed me stuff with flour in it and gets offended when I refuse to eat it. Last time she made potato soup. I asked her if she put any flour in it and she said no, so I happily eat away. An hour in, Im getting cramps and Im twisting on the floor in pain. Wife asks her if she's sure she didnt put any flour in and she goes \"Well, just a little bit, that can't be it, he probably ate something else before he came here!\" I'm NEVER eating anything from her ever again and refuse to talk to her now.\n\nI often remark how would she like it if I brought her come weed cookies or candy laced with LSD and didnt tell her about it. I know, overkill and very unethical, would never do it, but I fantasize about it when Im mad at her", "NTA\n\n\nYour gf is the asshole. Why would you stay with someone that crosses your boundaries?", "NTA, though ideally you could've spit it out the window instead. This doesn't make you an AH imo though, that's like stabbing someone then getting onto them for bleeding everywhere", "NTA - the fact your girlfriend did that to you is bad enough, but that she did it in her car and then had the nerve to be that mad at you is awful", "NTA.  \n  OP I have sensory issues with ADHD & food as well and I honestly just tell people I’m allergic for exactly this reason.  I have the same issues particularly with mushrooms and seafood (though I’m getting better exposing myself more at my own pace).  I also don’t think you should be blamed too much for spitting it out in the car, since it is an involuntary action and you were looking for a napkin.  Like I said to someone else it’s basically like vomiting - You might be able to hold it for a few seconds but it’s a panic situation, and you even tried to find something to spit it into.  Yeah, too bad you didn’t think of the window a little faster, but it happens.  \nI think you need to sit your partner down and explain to her that this isn’t being picky - It’s a involuntary reflex and it makes it literally impossible to get it down.  If she’s open to the idea, some reading on ADHD that could be a good way to go.  SPD (sensory processing disorder) is also very common among adults with ADHD, and can go beyond foods to things like scratchy clothing or tags, etc…\nThis is the first link I found, but it could be a good place to begin.  I would also try to bring up adult ADHD specific articles since it’s quite new research and I wouldn’t want her to continue infantalising you.  \nhttps://www.additudemag.com/women-with-sensory-processing-disorder/\n\nThat brings me to the final issue - Breaking up.    Yes it’s a silly thing to break up over, and she probably thought she was being helpful in some way, but if it’s a continuing issue or the latest in a string of similar events it borderlines abuse.  Her willingness to look into your condition and try to understand or at least be empathetic to your needs when you share with her will tell you what you need to know.  She needs to understand the real issue isn’t spitting up in the car, it’s that she basically caused your condition to flare up and she did so intentionally.  You’re not a child and not just a picky eating toddler.  You need to be clear so she understands very firmly moving forward that this will be lifelong and not just a phase.  You may choose to eat some of these things if you so decide, but it will be on YOUR terms.   If she continues ignoring your needs then it might be time to consider breaking up.  I left my partner over something that was sort of silly when taken alone, but when looked back at (especially now with clearer eyes) I realise it was emotional abuse and a lack of empathy or attempt at understanding my ADHD and there was a real pattern of it throughout our entire relationship.  It wasn’t what I wanted out of a partner.  This is her chance to show what kind of a partner she is to you.  \n\nBest of luck OP, you got this.", "NTA - I would seriously have a word with her about respect and boundaries or this behavior will not change.  That is so fucked up and there are no excuses that would make this better.  She knew what she was doing and just flat out didn't care.", "NTA. She doesn't deserve a boyfriend.", "NTA. She's lucky you didn't puke all over her car. It sounds like your girlfriend is deliberately refusing to understand the issue. I have similar food issues and will 100% throw up if I accidentally eat something that triggers it without knowing\n\nEven if you were just being picky, who is she to try to 'fix' you? Is it really that big of a deal if you don't like eggplant?", "NTA, that bizarre to force and trick you into eating foods she likes. That's not normal.", "NTA. She keeps blatantly ignoring your boundaries. You can do way better than her, she sounds incredibly abusive. She’s more angry about what happened to her car than what happened to you. Think about that.", "NTA She purposely crossed a major boundary for you and it doesn’t get more disrespectful than that. A partner that cares would never consider doing something like that. I would reevaluate the relationship because it would be hard to trust them again.", "Fuck her car seat and fuck her. As others have said go ahead and break up with her OP. She might \"love\" you but she sure af doesn't respect or listen to you. People like her really annoy tf out of me because they make ND things that are not personal and not even remotely about them(most of the time) and not only make it about them but also think its something they need to \"fix\".\n\nDon't let anyone convince you that this wasn't malicious on her part. Not fucking with people's food, or tricking them into eating something they can't have(doesn't matter the reason) is the bare minimum of human decency. \n\nNTA", "You are NTA, she tried to play a cruel food prank on you and frankly, getting her car messy was her own fault.", "NTA. I mean, offer to clean the car, but it's absolutely messed up for her to feed you something she KNOWS makes you gag. Like, wildly so. People without food/texture aversions sometimes can't or won't understand how bad it is. Like, your options were spit it out, or *throw up all over her car* if your aversions are as bad as mine can be. \n\nOne of these is a lot easier to clean up! It's the spitting it out! You made the best choice!\n\nHer being weird about you not eating eggplant is HER problem, not yours.", "NTA She knowingly served you something she knew would make you gag. She essentially tried to poison you. \n\nYou could've tried to spit it out the window, but she FAFO. Also, I imagine the anxiety was building as you tried to find a way to get rid of the offending food.\n\nWhat she does was such a breach of your boundaries, surrounding your mental health, and a breach of trust. How will she expect to be able to get you food ever again? I'm surprised you still consider her your gf honestly.", "NTA. You said to her that you couldn’t handle the texture of it and she forced you anyway. People sensibilities are different and she should have understand", "ESH, mostly her. Regardless of your ADHD, your gf shouldn't try to make you eat something you don't want to for ANY reason. That's just childish, weird and rude. She's absolutely TA and you need to have a chat with her about respect.\n\nThat said though, you absolutely could have spit out the window. There was no reason for you to do it on the dang seat.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI don't really think I'm TA at this, as I really felt I had no other choice. Would like to hear thoughts if anyone thinks I am TA tho \n\nI(26)M, have ADHD - and some sensory issues that come with it, I'm mostly fine around food. And it barely interferes with my normal life — except when it comes to eggplants and oranges. Especially eggplant \n\nThe texture feels so wrong in my mouth - I literally cannot bring myself to physically swallow it, I gag on instinct. I just want to get it out ASAP out of my mouth - you get the point. It makes me feel awful.\n\nMy(27)F girlfriend, let's call her Izzy, she loves eggplant. She orders it when we're at a restaurant everytime, and although I have no problem with her eating what she wants, she always tries to talk me into trying one aswell - saying I just \"dislike\" it, but if I try maybe it'll be an acquired taste, and that I'm being dramatic when I say i physically can't handle it.  \n\nToday, Outside of work - she waited for me in her car. She brought 2 pitas she claimed to be \"falafel\", she brought me untainted falafel before this - so I didn't suspect it. \n\nI started eating, and at first everything seemed fine. But then I took a bite and felt *it*. The texture I hated so much. I kept chewing, I thought maybe it's a pickle. No. I could never mistake the Nausea, I tried to swallow and gagged as usual. It was eggplant. \n\nI tried to get a napkin from the glove compartment to spit it out (We store wet wipes and napkins there) and found none, I turned to my girlfriend and she just kept focusing on the road, ignoring me. \n\nEventually, I couldn't hold it anymore. I gagged one last time and it got on me and the car seat. She freaked out, asking why would I do that. I asked her why would *she* try and make me eat something she knows I hate. She claimed it was to help me stop being picky, and that she thought she'd catch me liking it if I didn't know it was in the food. \n\nThis led to an argument, me trying to emphasize how fucked up this is of her, and her claiming I'm throwing acts and ruining her car just to avoid eating something I don't like. \n\nAITA? Most of my friends are on my side, but others say I should've spit it out the window or found another way, not on the car seat\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA sounds like there are 2 foods you are beyond averse to. She knowingly fed you one without your knowledge or consent. She violated your trust. That is beyond disrespectful. I don't even know the word for what it is and I have an expansive vocabulary. \n\nIn that moment, I don't know how you were even able to take the time to look for a napkin. No way you could have dealt with a window. She's kinda lucky you didn't spit it on her.", "NTA. You tried to find a napkin and kept it in as long as you could. Why is gf so freaking obsessed with you eating eggplant. You told her it makes you gag. It's her fault that it got on her car seat.", "> I turned to my girlfriend and she just kept focusing on the road, ignoring me.\n\nlol", "Hard NTA. WTF! This is Totally Messed up. This behaviour controlling and Manipulative! She’s got not respect for your boundaries. Honestly, I wouldn’t blame you if you Threw up on her!", "I don’t usually comment on these but NTA. I have ADHD and sensory issues and my partner is very accommodating and understanding. If I’m eating pudding and I bite into something hard all of a sudden I will puke. It’s not just pudding but it’s an example. Your partner isn’t respecting your boundries at all! It’s rude and disrespectful and she needs to understand that this isn’t something that you control. I’ve been trying to “work” on mine for years with no luck. It’s not a easy thing to combat. She’s not being supportive and she’s going behind your back to purposefully put you in a bad spot and then making you feel like a asshole for it. Gaslighting. It’s not right and not fair to you.", "NTA", "NTA... She knew what she did. She got a result she did not like.  To bad.    You really should think about where you are going with her.   Why she would hide food you can't tolerate is wrong. It's like when someone hides meat in food a vegan eats. I don't understand peoples need to try to force food issues.   I have mild texture issues with food.  So I can't imagine an extreme form of it.  I do agree eggplant texture is odd.   I don't eat it.   But really for her to be sneaky like this. What else will she try.", "NTA. I feel really bad for you. I don’t have many foods like this, but I know what it feels like to not be able to get something down - and then when you start thinking about it, it’s gonna come up.", "NTA - you are a grown man, not a little kid who needs to be tricked into eating food he doesn’t like.", "NTA.  Your girlfriend needs to be replaced.  She played a stupid game and got puke in her car.  She deserves much more.  Not sure why people think it’s any of their business or right to “sneak” other people food.  Fuck that.  Selfish juvenile behavior.  Did she get a good power trip manipulating you?", "You should’ve spit it on her!  Why can’t partners just be supportive and kind anymore 😞 always having to be the AH.", "Esh....because seriously knowing how she keeps egging him in about it....by this point in time people who deal with someone in their life that keeps pushing them to try crap they don't like need to reject food they give them or start inspecting their food before eating it.\n\nToo many stories on here about food and sht like this and yet no one looks in their food before eating....serves you right dor eating something without checking its contents especially if the gf gave it to you knowing how she is.", "NTA but why are you with her? She's not going to stop.", "NTA, your girlfriend sounds like my mom. I had instant trauma reading this because this is what my mother spent my childhood doing to me. For me it’s eggplant and bell peppers.", "Yta....so no wet wipes and oooh let me roll down the window didn't cross your mind. Wow", "Why couldn’t you spit it out the window??? Why on the car seat. You had time to look for a napkin, you had time to open a window. Soft YTA", "I've been thinking a lot on wheter I should break it up with her over this, but it sounds childish breaking up with her over a vegetable - \n\nBut if she went this far just because she thinks I'm \"picky\", it's scaring me", "This. Lying about people's food is ALWAYS a hostile action. It shows incredibly disrespect for a person and is potentially very dangerous. \n\n(I can think of some weird edge cases where it's justified (I must poison my kidnappers to escape!) but it's still hostile!)", "She usually isn't like this, of course - she does make the comments I spoke of and it gets tiring, but she keeps going on and on about how she's just trying to do me a favour. \n\nI believed her and mostly forgave her for those, but after this - this is definitely not easy to forgive now/ever", "It’s an involuntary reaction while he was searching for a napkin.  Guy literally couldn’t hold it.   It’s a gag reflex, it would be like you having vomit in your mouth.  You might make it to the washroom, but you might not.", "It sounds like OP gagged and some food fell out, tho, not that they just decided to spit it all out.", "Should have spit it in her lap.", "As someone with sensory issues, the assumption that OP had the opportunity to reason that is a bit off. It can be incredibly distressing and the only thought you have is \"oh god make this stop asap\". She has clearly been warned of this before and intentionally gave OP food that would cause distress. NTA but they either need couples counseling or OP needs to ditch the shitty partner", "Haven't you already posted a judgement? I don't see the point of doing it again", "its not \"oh this doesn't taste good let me get rid of this\" its sensory overload. its distressing. if gf didnt want OP to gag in her car she shouldn't have *intentionally fed him food he has told her not to get him.* she lied to him to get him to eat food she had been told is distressing to him and is expecting him to apologize", " No. Fuck that.", "Even so, the gagging and spitting really aren't the biggest asshole-inducing problems here...", "Let me assure you, this is not about the vegetable. The vegetable is the inciting incident, but it reveals a lot of really unflattering things about her as a person.\n\n\\-She doesn't respect your preferences or needs when they conflict with hers.  \n\\-She thinks you should change your preferences and needs so they match hers.  \n\\-She is willing to lie to you about your food (an inherent red flag of monstrous proportions).   \n\\-She doesn't believe you when you tell her about your experiences (like \"eggplant is awful for me and I will gag if it touches my mouth, and I do not like gagging\")  \n\\-She makes the consequences of her actions (food all over the car) *your fault* when she intentionally withheld the information you would have needed to make that situation not happen (the information being the presence of the eggplant).\n\nIf she is like this about a *vegetable she likes a lot*, what happens if it's something more serious?", "It's not breaking up over a vegetable, it's breaking up because your partner refuses to respect your boundaries. You deserve better!", "Honestly I would. What were to have happened if you actually allergic to it. This women sounds like an abusive controlling person. She’s lucky you’re so sweet about it. I know people who if they say they don’t like things they would do that on purpose. Like karma", "NTA- This isn't about food. She lied to you. She gave you food that makes you ill. She doesn't respect you or your boundaries. She then \\*blamed\\* you for reacting the way you had said you would. These are red flags you need to consider.", "It’s not about a vegetable.  It’s about her controlling your food, deceiving you and making it impossible to trust her around your food.  She did it herself.  Why does she care if you eat picky?  It’s not a broken - fix it thing.  Such obnoxious behavior.", "You’re not breaking up over a vegetable. You’re breaking up over her not respecting your autonomy.", "I have adhd also and there are certain foods I don’t like at all (sounds weird blue cheese, jello, and gravy things like that aren’t my thing) My bf of 3 years thinks it’s funny and will poke the bear but he’s never overstep that boundary. If she truly cared she wouldn’t try to force this stuff on you", ">this is not about the vegetable\n\nI'm just disappointed this didn't mention Iranian yoghurt", "I need a sticker that says \"it's never just about the food item in question\" given how often this comes up!", "Is the Iranian yogurt going to become the new two broken arms reddit reference now?", "I was going to! Lol"]}