{"id": 3808, "submission_id": "zb004v", "title": "AITA for calling my mother-in-law multiple times to check up on my baby while I was on a trip with my husband?", "selftext": "I went on a 3-day trip with my husband. I didn’t want to go as our baby is only 8 months and being away from him for more than a few hours and a plane ride away made me feel anxious but going on the trip was important to my husband so I agreed to go.\n\nI called my mother-in-law multiple times to check up on my son while I was away. She told me he was fine every time but I kept calling whenever I was worried. My husband asked me to stop as he said I was ruining the trip and I would make his parents feel like I didn’t trust them with our son. During the trip we had dinner with an associate of my husband’s and I excused myself twice so I could call to see if my son was okay as the first time he was crying.\n\nWhen we got back to the hotel my husband was really angry at me and he said I was being ridiculous. We had a fight because I told him I wanted to go home and I only came on the trip because it was what he wanted even though he knew I was worried about leaving our son alone. He’s been pretty silent with me since and only speaks to me if I speak to him directly.\n\nAITA?", "created_utc": 1670020189, "permalink": "/r/AmItheAsshole/comments/zb004v/aita_for_calling_my_motherinlaw_multiple_times_to/", "score": 858, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I kept calling my mother-in-law to check up on my baby while I was away for a few days with my husband. I called even while we were having dinner with an associate of my husband’s even though he previously made it clear he wanted me to stop calling his mother.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: define \"multiple times.\". Once a day, once an hour?  How often were you calling home?", "YTA, my dear. I know you love your son. You just want him to be safe, happy and loved. That makes you a good mom. But calling twice during one dinner? That's obsessive and controlling.\n\nThis is not your in-law's first rodeo. Your husband is alive so clearly they can handle keeping your son that way until you get back. Your behavior is smothering and you are burning the good will between you and your in-laws. Your son is 8 months old - not 8 days. Unclench a little for everyone's sake. \n\nAlso, you agreed to go on this trip with your husband. Then you behaved like such an obsessive train wreck that your husband felt upset and angry. When he expressed his disappointment, you told him you did this as a favor to him. If you want to alienate your husband, you're on the right track. Tunnel vision on baby is not healthy for the family unit. Nor will it encourage strong self esteem in your son as he grows older.\n\nWhen obsessive worry strikes, tell your husband. \"I am feeling that obsessive need to check on the baby again. Can you help me to calm down with some reassurance?\" If he cares about you as a partner, he will remind you that all is well. You are being a good mom by allowing your son some bonding time with his extended family. AND you deserve some time to be yourself and relax. You work hard as a mom. Love yourself enough to let go of the worry.", "Twice during dinner? Im going to tell you something you may be too blind to see because you are concentrating on being 100% mother. Being a non-present wife is affecting your husband and he wanted your attention and time. You cannot forget to date/love on your partner. I get it as a baby can consume your life and attention, but do not miss the signs from your husband. YTA", "NTA for being concerned about your baby. \n\nYTA for calling excessively. If you don’t trust your in-laws to care for your baby, then don’t leave your a baby with them", "YTA \n\nCalling to check isn’t the problem, it was obsessively calling that was. You called twice during a dinner, I am unsurprised that your husband was unhappy.", "Info\n\nHow many times did you call?", "How many times a day did you call? Like 3-6 seems valid.  20 is too much", "This isn't an AITA problem, this is a marriage counseling problem", "INFO: what are you doing to address your anxiety?", "Yta. Obviously they would call you if there was reason to worry. Do you think they'd just wait for you to call again to inform you something was wrong or had happened?", "NTA but post partum anxiety is a real thing but less well known than post partum depression. You should consider whether you are anxious for your kiddo in other situations (or if you can identify being controlling of your baby in order to avoid becoming anxious). If so, a mental health evaluation could be helpful for you.\n\nI couldn't be away from my kiddo at that age, she would not take a bottle and barely was interested in solid food. So if you are still breastfeeding and just pumping to get through the trip, you might have some additional hormonal weirdness exacerbating your mood, because your body is off its rhythm.\n\nMany people don't travel without their babies until they are toddlers or older. Your feelings of not wanting to be parted are normal. (Some parents don't mind at all. They're not better or worse parents, they just feel differently about being apart.) But it won't help your relationship to ignore what you feel and just do what your husband wants. You need to find a way to communicate and not engage in false compromise. Next time respect your own needs, while still examining other ways to meet them. Maybe a day trip first, or planning for your baby sitter to send you a text every couple hours, or any number of other ways you could build up to being comfortable enough being apart, to focus on your husband and your marriage.", "Kinda.  It is hard to be seperate from your child but it is something you have to learn to deal with.  Your MIL may be more understanding than your husband but she may get annoyed too.  You and your husband need to be on the same team and be strong parents and better comminicators for your child's  sake", "yeah that's a little extreme; YTA\n\nClearly there was no issue making calls so she could've called if something happened. You were interrupting everyone else over nothing", "YTA Kids change marriages and it is important to make sure effort is put into the relationship. It looks like your husband was missing his spouse and wanted a weekend away to re-connect. You called obsessively and then had an argument about it because you couldn’t see past baby. Worrying is normal. Anxious is normal. But your partner also time and attention.", "YTA", "ESH. Your husband should have listened to you when you told him you didn’t want to go in this trip. However you’re an adult so he didn’t force you to go. Calling your MIL excessively throughout the trip was a bit much and getting up twice during the business dinner to call her was just rude.", "ESH, except your in-laws.  Your husband shouldn’t have made you go on this trip if you weren’t ready to be away from the baby this long.  You shouldn’t have agreed to go on the trip if you were going to be this anxious the whole time.  And both of you need to get a handle on how you’re going to make time for each other until you *are* ready to leave the baby for a long weekend getaway, and when you think that’s going to be.", "INFO: Did you guys discuss the fact that you weren't comfortable leaving the baby or did you just do it simply to make him happy? If you didn't discuss how anxious you were about this, there are much bigger problems at play here.\n\nIf you did discuss it and you went just to pacify him, you are doing a HUGE disservice to yourself.\n\nIf you discussed it and he just wouldn't take no for answer, then he would definitely be the asshole.", "NTA - you weren’t ready. This isn’t uncommon. Your baby is still young", "I'd say NTA from the perspective of hearing about separation anxiety when it comes to a mother being away from her baby.Tho, I think you should try to discuss with you husband again, and deffo apologize to your MIL and try to explain to to them that it isn't that you don't trust them but that you haven't been away from your baby for so long until now.", "NTA. 8 months is early to be away from your baby. You went on the trip; that’s your compromise. His should be understanding that you are concerned and want to check up on your kid, maybe more frequently than he thinks necessary and keep his mouth shut about it.", "NAH.\n\nParenting can be really difficult. Your separation anxiety is understandable even though you should have been more considerate. His offense at being constantly checked on is also understandable, but he should have been more sympathetic.\n\nSometimes life is just hard, and we are mean to each other. Apologize, learn, and move on.", "IMO NTA. I still call my family when they watch my kiddo when I am at work. I feel bad putting my kiddo on them, and I like to make sure everyone is okay, so I can help work things out if there is an issue. I have been calling someone watching my kiddo since the beginning. I think it is a normal desire, but I also wouldn’t have gone out of town in the first place.", "NTA. This is a typical first time mom issue. You'll get more relaxed as time goes on. Remember, you in-laws have plenty of experience being parents. They raised your husband, didn't they? I'd be willing to bet your MIL didn't mind your calls to check on your son at all.", "YTA , I’m assuming she did a decent job with your husband , if so she probably can manage", "You didn't want to go, but your husband is mad at you for \"ruining the trip\" by worrying? Sounds like the trip wasn't good for you in the first place. \n\nIt's completely normal for new parents to have a hard time leaving their kids at first. I'm sure that at some point, you'll be more comfortable with it, but you're not there yet and that's okay. Doesn't sound like he really cared about you enjoying yourself on this trip, though. \n\nNTA.", "YTA. In a few years when your marriage falls apart, remember this. \nIn 12-15 years when your son will refuse to talk to you because you are suffocating him, remember this. Get professional help. YTA", "Asshole and marriage problem", "I’m feeling stress just reading this. It’s important for you to find time to be away from your child, have a break, have time with your husband alone, but you are not yet comfortable and ready for a plane ride away trip. \n\nI would suggest doing a shorter trip and closer to home or rent another room and bring your in-law with you. \n\nI think feeling worried is super normal for the first kid. It will get better. \n\nI don’t think YTA, you’re just not ready for a big trip like this… yet.", "NTA\n\nNot even a little bit.", "YTA\n\nYour marriage is important and you need to value it or you might find yourself being a single mother. Your son isn’t the center of your marriage. Your husband is. Never lose sight of that. \n\nGet therapy for your anxiety before it gets worse and cause bigger problems. And apologize to your husband. You have a lot of making up to him to do.", "ESH - he made you go before you were ready and you clearly kept acting in an irrational way.", "ESH\n\nYou should have texted her instead of calling so many times. I'm sure it was disruptive to her if she was busy with the baby, trying to get him asleep or trying to get some rest herself after putting him down for a nap. Leaving dinner twice is excessive. Your baby was in good hands, I'm sure, and your MIL would have called you if something happened. \n\nYour husband sounds a bit selfish and immature. He doesn't have that special bond mothers do but he could at least sympathize with you. Pouting and giving you the silent treatment is a way of punishing you and that's not fair.", "NTA.  My mum lives 5 mins sway from me and I trust her with my kid. When she looked after her at about the same age I rang her every hour to make sure she was ok. She's 4 now and I still call every 2 hours to make sure everything is ok. \n\nYour husband is being the AH. It's your job as a mum to make sure your baby is alright. Seperation anxiety works both ways.\n\nThose ppl saying your obsessive calling is bad - pfffttt. The baby is 8 months old and this is her first time being so far away from him. Over time her anxiety will lessen, but this is a reasonable way to feel. ALSO ringing twice during dinner because the first time he was crying isn't excessive or controlling, its a mother worrying about her crying baby.", "I’m going to go against the grain and say nta, it sounds like you weren’t ready to leave the baby over night and did so too early. I didn’t leave my first over night until he was 2. Some people are able to sooner others take longer to gain that comfort. I would also want pictures and phone conversation to reassure me everything was okay.", "ESH your husband shouldn’t have pressured you to take the trip if you weren’t ready, but your shouldn’t have gone if you’re not ready. Also, calling multiple times a day (including twice during a single meal) is excessive.", "ESH", "Yta", "This is the perfect example of when Reddit is ridiculous.\n\nYour husband pressured you to go on a trip you weren’t really comfortable with, and didn’t support you in managing your anxiety. THEN, he berated you and gave you the silent treatment when you acted in a way that he didn’t approve of without psychosocial support.\n\nThrow the whole man out. NTA", "YTA For neglecting your husband, not trusting your in laws and being overly obsessed…get therapy before your husband leaves you.  I have seen this happen with my old neighbor, once she popped out a kid her husband was pushed to the side, he dumped 2 years after the birth of their daughter.", "NAH\n\nFor the well-being of yourself, your son, your marriage and relationship with your in-laws, you need to evaluate why you didn't trust leaving him with them.\n\nIt will be good for your son to learn to trust others to meet his needs. \n\nIt will be good for your mental well-being to know that others are able to competently to care for your son.\n\netc spouse . . .\n\netc inlaws . . .\n\nWhat if you had to go to the hospital for a few days or got COVID, wouldn't you feel better knowing your son had adults, other than his parents, in his life that he trusts?\n\nPerhaps a flight and 3-day was too much for the first time leaving him. \n\nThis is super important for your own well-being for you to work on. \n\nFind your trusted support network, and then talk yourself into trusting them.", "I bet the person who understands this best is your MIL. In a few years you’ll be laughing about this.", "NTA, but you need to deal with your anxiety and learn to relax, your baby is with a trusted relative and safe. If you can’t go out or away with your husband for a couple of days your relationship is going to deteriorate.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI went on a 3-day trip with my husband. I didn’t want to go as our baby is only 8 months and being away from him for more than a few hours and a plane ride away made me feel anxious but going on the trip was important to my husband so I agreed to go.\n\nI called my mother-in-law multiple times to check up on my son while I was away. She told me he was fine every time but I kept calling whenever I was worried. My husband asked me to stop as he said I was ruining the trip and I would make his parents feel like I didn’t trust them with our son. During the trip we had dinner with an associate of my husband’s and I excused myself twice so I could call to see if my son was okay as the first time he was crying.\n\nWhen we got back to the hotel my husband was really angry at me and he said I was being ridiculous. We had a fight because I told him I wanted to go home and I only came on the trip because it was what he wanted even though he knew I was worried about leaving our son alone. He’s been pretty silent with me since and only speaks to me if I speak to him directly.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA.\n  \n> During the trip we had dinner with an associate of my husband’s and I excused myself twice so I could call to see if my son was okay as the first time he was crying\n  \nYour son is 8 months old, he’s going to cry a lot and be fine all the time unless he’s severely injured and wouldn’t be on the phone… He was with people you and your husband presumably trust or should because they seem to have taken great care of your son. \n  \nYou were in a business meeting basically with your husbands colleague and you kept leaving the table and not present. Unless someone’s contacting me I don’t even look at my phone at mine or my SOs dinners we go to work network. It benefits your son, yours, and your husbands futures to network well so you can provide more for your son.\n  \n> When we got back to the hotel my husband was really angry at me and he said I was being ridiculous. We had a fight because I told him I wanted to go home and I only came on the trip because it was what he wanted even though he knew I was worried about leaving our son alone. He’s been pretty silent with me since and only speaks to me if I speak to him directly.\n  \nYou are KILLING your marriage.\n  \n\n  \nYou can’t give up all of you or your marriage to obsess over your son.\n  \n**It’s not good for your son, you, or your husband.**\n  \n\nYour son will grow up sooner than you know and you’ll want your marriage to the person you also love to still be there. Your son is probably going to want his dad still there.", "ESH\nTrust you instincts. If your husband doesn't understand your stress and anxiety on leaving your 8 month old baby then he is the biggest AH. \nThe baby was growing inside you for longer than he has been out of you.  It is natural that you want and need to be with your baby and he with you.", "Yes...YTA.  I get it...your worried about your child but please appreciated that your making everyone around you miserable", "YTA.", "Helicopter parent.", "I’m only saying NTA because over a year later after my twins I still have very bad PPD/PPA. I hate leaving them & call/text constantly the rare occasions I leave them. You are quite possibly being the A to your own mental health though.", "YTA. I have a little baby myself, I get it. A phone call followed by one, MAYBE two texts might be fine. You went way overboard. Calling twice during dinner is a bit insane. \n\nIt’s fine to love your baby but you cannot lose every part of yourself in being a mother. You’re also a partner too and this was a brief moment where you could both be yourselves together. You owe him an apology & you need coping strategies to deal with your trust & attachment issues. \n\nGood luck OP. YTA", "Yeah I would leave my8 month old either. All calls justified.", "NAH.  Maybe set up a quick text check-in schedule moving forward.", "Info: 8 months? Did he pressure you into going on this trip because he wanted 'alone time' and thought a hotel stay would mean your gratitude/focus would be with him?", "NTA. You weren't comfortable leaving your baby but did to appease your husband. An eight month old baby is really, really young. I would not have felt comfortable leaving my baby for three days at that age. I would have been nervous and anxious as well. And if I had to be apart from my baby, I would have definitely called more than once to check on my baby. \n\nI am wondering why your husband didn't just let you take your baby with you? Why was he pressuring you to do something you didn't feel comfortable doing? And then, after pressuring you to leave your baby behind, he is upset because you missed your baby and wanted to call home and check in on your baby?! What an AH. You're not the AH, OP. Your husband is.\n\nWhen my kids were little, we always took our kids with us when we went on vacation. My kids were (and still are) the light and joy of my life. I loved exposing them to new places and experiences and just having great quality time with them on our vacations. I never would have considered leaving an eight month baby at home. I was a breastfeeding mom and wouldn't have jeopardized my milk supply. Anywhere I went, my babies went. I'm sorry your husband pushed you to do something you didn't feel comfortable with.", "NAH. You weren't ready for this trip, you and your husband should have found some sort of compromise like maybe taking a different trip closer to home before a trip where you're a plane ride away.", "NAH but I do feel for you is was to soon to leave your baby I had post partum depression after my first was born and I had a really hard time trusting anyone beside myself with her. My mother couldn’t even hold her the first year. If we had cellphones at that time I would have called the whole trip. But it isn’t healthy for you to worry this much. Your husband and you need to have a good talk about what you are experiencing and how to deal with it together. Please go see your doctor and discuss your anxiety and your feelings. I wish you well and send you a virtual hug.", "Honestly, sounds like your husband's the AH for forcing you to go on the trip. But you posted, so I imagine there's more to it.\n\nINFO: How many times are we talking? I don't think it's at all odd to be checking on your child, especially one so young, so I wouldn't think you'd be asking this which makes me wonder if it wasn't significantly more than most people would consider normal.  Also, why did he insist so much on you going?", "OP says twice in a dinner, that's way too excessive", "I had horrible separation anxiety from my son and my husband did a great job with the reassurance. It really does help.\n\nThis was so lovingly written, I hope OP sees it.", "This is kind and thoughtful advice and I hope it resonates with OP. :)", "And herself!  OP, you are still a person with an identity that is not wholly described by \"mother.\" It is ok and a good thing to put time and attention into the other aspects of yourself.  Maybe 4 days away was too much to start with.  Have you done any date nights?  Day trips?  What is the longest you have taken for something other than childcare or sleeping?  Being 100% mom time is not sustainable for you or your relationships.", "🙌🏻", "\\^This.  If I babysat for someone who kept calling me non-stop, that would be the last time I babysat.  Of course grandma wouldn't take that hard stance, but that doesn't mean she isn't infuriated by the seeming mistrust.", "Twice during dinner? I think it was closer to 20.", "She called twice during a dinner... clearly way too often, that's pretty ridiculous", "She obviously did not because he is an AH", "Oh my God, no. Being anxious about being away from an 8 month old baby is NOT suffocating a child! At that age, moms and their babies are intensely connected and attached to each other and that is a good and positive thing. Attention, connection and closeness is what babies thrive on. A healthy mother-baby bond is a great thing; and a mom being anxious about being separated from her 8 month old baby for three days is perfectly normal. An eight month old baby is still very young and very dependent. \n\nI find it shocking that people are telling this woman that she's the asshole. Leaving your baby for the first time is a really big deal, especially when you're gone overnight. I am finding myself wondering how many people who are commenting on this thread are actually parents, because the judgments people are making seem way off base to me. Most new moms experience anxiety when they are away from their babies for a length of time. This is completely normal behavior.", "And how many kids do you have? This is PERFECTLY normal behavior for a new mom, away from their child for the first time ever.", "Yiiiiiikes. Whether or not OP is obsessive, you definitely are.", "All. Of. This!! \n\nI have 4 and while I'm not the overprotective worry wart I was with my first, I still txt anyone watching them - including my husband - to make sure all is okay (not that I think my husband is a bad dad, he's not, he's awesome but just my need to know my babies are okay)", "Definitely too much during that dinner. I was more curious if the dinner was an anomaly, and she called once a day the other days, or if twice an hour all day every day was happening.", "That’s my guess too.  Hopefully, OP answers", "She mentions the baby was crying the first time. I got the impression that she wasn't calling at that rate the whole weekend, but that she specifically called the second time because it was hard hearing him crying the first time.", "100%  Neither can I understand how so many people think that it is OK and even a good thing to be away from a very young child for this long to keep a grown man happy.\nAbsolutely unnatural and wrong.", "I have two kids. They are 5 and 3, so this phase is not that long ago. OP’s husband is absolutely an AH for pushing OP to go on this trip when she’s not ready. OP is absolutely going beyond normal first time away anxiety. She needs to realign her expectations, or get some mental health help.", "I'm really not - she's my responsibility. Not only am i making sure she is ok, I am making sure my parents are ok and she isn't misbehaving. They have never been offended or seen it as me not trusting them. \n\nAs a result my child is secure when she is minded by people because she knows she will talk to me. She is very confident in herself and doesn't suffer from seperation anxiety going to daycare like half of the kids she goes with. \n\nThe phone calls last maybe 3 minutes.", "Based off of her saying that she \"kept calling whenever she got worried\" and that she gets anxious when away for more than a few hours...\n\nI'm going to take a shot in the dark and say at least 10 times a day.", "All I can say is that reddit skews young and male. Any young man who has never given birth to nor nursed a baby has no idea what the intensity of that bond is like. I never in a million years would have gotten on an airplane and left my 8 month old babies for three days! \n\nI can see I've already gotten downvotes. I can just about guarantee that none of the people downvoting me are mothers. Mothers understand. And people who aren't parents often have no fucking clue.", "That's ridiculous. She left her child for the first time and called a bunch of times to check in, and you think that requires mental health help? That's really a stretch. If OP did this every time they went away, that would be an entirely different story, but first time away from your baby, this is absolutely normal and common behavior.", "She called twice during one dinner. That’s not logical, and a level of fear that can create bigger problems down the road. That absolutely warrants a check in with a therapist. I’m not recommending she’s committed, I’m saying she could talk to someone.", "She called twice during one dinner because the baby was crying the first time and she wanted to ensure the baby had calmed down. How does that require a therapist? Again, if this was a repeated pattern, I would agree, but the first time away is excruciating and completely unfamiliar territory.", "It’s an eight month old baby, it cries. Checking back on that is a text, at most. Not a whole ass phone call during dinner. \n\nAlso, why are you so against therapy?", "I have nothing whatsoever against therapy. I think its preposterous to say it's necessary after this single event though, which again, was completely normal for a new mom.", "I’d argue it was necessary when she first felt anxious about leaving the kid", "Lol. You think a mom needs therapy for being anxious for leaving her baby for the first time, but you don't think Kanye needs help? OK.  That tells me everything I need to know.", "Info: what is “multiple times”?", "NTA but please talk to your doctor about your symptoms. Being that anxious is a little concerning and may indicate you need help. Anxiety is paralyzing and can have a terrible impact on your quality of life. (And for all the Y T A, anxiety is an actual mental health issue caused by neurochemical imbalance! You can't just willpower your way out of it!)", "NTA.  So many children would be blessed by having a concerned and loving parent like you!", "NTA. Your husband is a huge AH for forcing you to leave your baby for 3 days and then getting angry you were anxious about being away from your son. Do these yta answers even have kids? He guilted her into leaving her baby for THREE DAYS when she wasn't ready to do that but redditt is worried about his feelings and whether she pay him enough attention. What about her feelings? I was very anxious about going out without my kids when they were small. I would have actually preferred not to go out for dinner at all and stayed home as a family. But my husband wanted time alone with me and I loved him. Calling home to check on the kids (regardless of which trusted family member was looking after them) helped me relax and have a good time. My husband understood that and my feelings are important to him. He never, once complained about me checking on the kids and that was just going out for dinner and a movie at that age. Has your husband even acknowledged how hard it was for you to go with him or said thank you? I bet he has never once asked what he could do to make this trip easier for you if he is whining because you called to check on the kids, heard them crying and then called again to check they were okay and calmed down again later. Everything is about his feelings.", "NTA! I wouldn't have gone through! 8 months old, and that far away, hell no! I would have been calling too!", "HELL NO NTA!!!!!!!!!! Checking in on your baby is good parenting; you’re a concerned mom!!!!! I’m certain this is because your husband wanted more of your attention. And it’s possible he deserved more… but you’re NOT an AH for being concerned about your infant.", "NTA. have you considered talking to your doctor about postpartum anxiety??", "YTA for being obsessive. Your husband deserves some of your time and attention. Don’t forget that you’re both a partner and a mother", "ESH. You're calling excessively but your husband made you go on a trip you didn't want to go on when you were 8 months postpartum which is also a pretty dick move frankly.", "YTA! This is not healthy behavior.", "Gentle YTA. You need to seek some help in regards to anxiety. This isnt normal, and will start affecting your health and marriage, if it hasnt already. Chances are your husband noticed some things and urged the trip to get you some breathing room.", "YTA. If you cant bear to do something, do *not* agree, even under presure, to do it. Multiple times in one dinner is an unreasonable amount to call to check in. Get a backbone, youre allowed to stand by a \"no\".", "NTA\nOne time I left our firstborn with my husband, his father, who was a very capable and involved parent. I wrote our detailed instruction. While reviewing them with me, he said he felt like I didn't trust him. I said I do, but I needed to go over all the details in order to relax! Leaving a baby is hard, being nervous is normal. Many people would NOT leave a baby for a multi-day trip. Make sure your in-laws know you trust them but still have a need to check-in. Twice during dinner is a little excessive. \nBut not talking to your wife, or listening to her point of view is also excessive.", "YTA", "NTA. Your husband pushed you to go on this trip knowing that you weren't ready, and you're clearly having anxiety. I think you need to sit down with your husband and tell him how you're feeling.", "I don’t care how many down votes I get, NTA!  You obviously either weren’t ready to leave your child or weren’t comfortable with whom you left them.  As a mother I don’t care about anyone’s feelings, if I’m worried about my child I’m checking on them.  I can understand your husband’s frustration, but then he shouldn’t have pushed you to leave your child when you weren’t ready/comfortable!", "YTA.\n\nGood luck being a single mother because you are destroying your marriage because you can’t control yourself.", "ESH, you absolutely shouldn't have gone if you were going to spend the entire trip blowing up the phone.", "YTA and a big one.  You are overly obsessed in fact.  Your son was fine and you did ruin the trip. You called once and he was crying?  Seriously?  He has never cried in your presence?  You need to get a grip on yourself before you ruin your relationship with your Inlaws and the one with your husband.", "YTA for insulting your in-laws.  I hope they never babysit for you again", "OP getting checked for postpartum anxiety would probably be a good idea. A family friend got diagnosed and treatment helped her a ton!", "Oh man, ladies. I have to disagree on this one… I mean to say, you’re totally right that OP needs to be her own person, needs to maintain a relationship with husband apart from baby, etc; I get all of that… but when it’s an infant, it makes sense to me. My kiddo is now 10 and I maybe text my mother in law once to check in. As an infant, and esp if it’s the first baby… I think that sort of anxiety is pretty normal. Maybe it’s not ideal, but she’s not being an AH, she’s just worried.", "Calling 6 times per day is probably excessive. Either the baby is super-easy and everything is fine so nothing to worry about… or else baby isn’t easy, grandma has her hands full, and doesn’t have the time/energy to talk to mom every other hour.\n\nSeriously, though, won’t grandma call/text if something is really wrong?", "Thank you - finally someone with common sense.  It sounds like hubby pressured OP to leave the baby.  I’m a mother of four and grandmother of 6 and neither my daughters or I left a baby overnight at that age.  The first time I left my kids and my daughters left theirs, it was a night away locally and we all checked in frequently.  Heck even when my grandkids were older I’d get one word texts that just said “pictures”.  To suggest OP has marital problems or PPA because she didn’t want to be that far away for that long are ridiculous.  It’s normal to not want to be separated from your baby by that much distance for that long.  Hubby is the one that’s an AH.  It doesn’t even sound like MIL has a problem with the calls based on OP’s post.  Assuming MIL is not one of those MIL’s I’m sure she understands.", "If she's so worried that she needs to call back a second time during dinner because the baby was crying (something they do all the time for completely benign reasons), she needs therapy. This is not normal worry.", "I disagree.", "Well put. This is bizarre behavior that will drive her support system away when she needs them most.", "tbh it just sounds like she is coming up with any excuse to call again. babies cry, go figure", "NTA. This sounds like insensitivity on other people's parts. I think they could have had more understanding about how difficult this would have been for you, especially if you already said you had a hard time before even going into something. The fact that you mentioned that he had dinner with an Associate made me think that this was a business trip. I think a caring and empathetic husbands and father would have understood that you are simply concerned about the child you gave birth to. The fact that he was angry rather than wanting to understand where you were coming from, means he is prioritizing his feelings over that of a child. He's the one who has more emotional maturity and control, he should maybe extend some empathy to the baby.", "NTA!!!!! Your kid, your life, your feelings. \nIt seems to me that the phone calls are for you to feel better/comfortable, not because you don't trust your inlaws - they should know better and should support you and not take it personally. \nMy mom will text me to check in if she calls and baby/toddler is crying so I have to hang up. It's not controlling or lack of trust, it just feels good to know for sure that someone you love is okay and is feeling better (not crying).\n\nAlso 3 days away from 8 mo is alot; personally I wouldn't have gone or I would have brought baby (but everyone is different). \nAlso, you are a good mom!!! Just gonna assume the internet is being mean and you might need that reminder.", "YTA. \n\nYou realize your mother in law has raised a child before maybe even more than one. Babies cry all the time, it's the only way they have to communicate. It's rude to not trust your mother in law and it's rude to spend your whole trip calling to check on the baby. You can't soothe them over the phone so stop.", "Helicopter mom alert....\n\nYTA", "NTA and I can’t believe that people are saying you are. If I had rung and my baby had been crying I would have rung back to see if they had settled. If I was looking after a baby I would send a message letting the parents know he had settled.", "YTA for excessively calling. A few times a day (once in the AM, before bed) wouldn’t be so bad but that amount is a lot. I think you should speak to your dr at your next visit. If you are extremely worried, it might be something deeper.", "NTA\n\nI’ve said it before and I’ll say it again: Reddit aita is not the place to ask questions about parenting, especially babies. So many people on this sub have no experience being parents, and those that do often don’t have experience being empathetic and attached parents. 8 months is far too young to be away from your baby for three days. The fact that your husband insisted on this when you clearly told him you were not comfortable makes him the AH. If he wants to be a big baby and give you the silent treatment because you were appropriately anxious then go ahead and enjoy the silence.", "YTA - I get that you're nervous is a new mom, but you need to trust the person you left your child with. Your husband same to turn out okay so you need to let loose a little.", "NTA. I wouldn’t have gone on the trip at all when my son was the age. I give you kudos for even trying. But maybe next time trying compromising a date or something that you can do or enjoy at ease and you can concentrate on your husband.", "If you have had ongoing challenges with anxiety, no, NTA.\n\nHowever, as a mother myself, I have to say you might need to learn to relax a bit. My kids are older now but my son is autistic and mentally a toddler, even though he is physically a teen. I struggled with learning to trust him with others until he was 6. I gave up & began to send him to school only when I had a breakdown from the sheer exhaustion of caring for him 24/7. Even parents who have perfectly developing kids go through a lot of stress parenting and it gets really stressful when they become teenagers! \n\nYou're lucky that you have an extended family to help you with him. It helps a lot... so learn to trust people with your son. It makes a huge difference. Think of it like this -- if your MIL did a great job with your husband why would she screw up with her grandson? That makes no sense! So relax. It'll be fine. \n\nGood luck & happy parenting! \n\nHang in there.", "NTA - for those saying otherwise, shame on you! \n\nShe is a mother of an 8 month old baby. It's perfectly normal to feel this way, particularly if a) you're not ready to leave them yet and b) it's your first time spending time away! \n\nGood for you mama. Don't feel bad for calling to check up on your child. Your husband sounds like he needs a clip around the ear.", "Your baby is 8 months old, not a newborn. Your MIL has raised children before. You had a chance for a quick getaway with your husband, and you blew it because you had to obsessively bug your MIL during a working dinner with your husband's associate. YTA", "I'm going with NTA only because it sounds like you have post partum anxiety and I know how it feels to have that uncontrollable sense of impending doom for the people you love the most. You WBTA if you don't talk to your doctor about it. You can even start with your OB if you feel more comfortable with them and they can get you set up with a short term medication and likely refer you to a family medicine doctor or psychiatrist for further medication management. \n\nSometimes your brain chemistry and hormones betray you and that's okay...just don't be afraid to ask for help. Wishing you the best, OP.", "Your husband is TA for pushing you to leave the baby before you are ready.  You’re a soft AH for calling too much, and for allowing him to pressure you. I can’t imagine leaving a baby that young for more than an evening out. (And I was not a helicopter parent by any means and have a very independent and successful young adult child.)", "NAH. Check in with your doctor this sounds dangerously like peripartum OCD. Intense fear related to the baby (obsession), followed by a soothing action that doesn't truly alleviate the fear (compulsion). This is dangerous to yourself, your baby, and your relationship. It's time to seek help.", "A mild YTA (answer to your question) \n\nIt’s hard to be away from your LO, and it’s okay to want to check in but calling twice during dinner makes you the mild asshole. Your MIL would have alerted you immediately if there was a problem, and it sounds like it was an important business dinner for your husband. \n\nClearly you weren’t ready to leave baby in that capacity. You probably should have started smaller (an overnight staycation for example) I doubt your MIL was annoyed by it though so don’t stress about that. You need to apologise to your husband about leaving the dinner but don’t apologise about your anxiety. Maybe he also misses spending time with you as a wife, maybe you can organise a staycation over New Years so you can build up to leaving your bubbah for longer periods.\n\nGood luck.", "NTA. What in the world are all these YTAs about? It’s an alarming snapshot into how hard we are on mamas. OF COURSE you wanted to call back and check on your baby since he was crying during the first call - your nervous system was probably so so jangled from hearing your baby cry and not being able to comfort him! Fighting our primal urge to be connected to our children in order to please a husband (or a society) is not such a straightforward process, it can literally be physically painful. If you’re not ready to be away from your baby, you’re not ready, and so your actions reflected that reality perfectly. Your baby is lucky to have such a connected mom and I’m sorry your husband sees that as an impediment, rather than perfectly natural.", "YTA, but I think you are having some major anxieties regarding your child that I think you should consider reaching out and asking for help about. Consider a therapist, or even just talking to your obstetrician or any doctor about your anxieties and fears and see if they can offer you any support or skills to healthy cope.", "It seems your husband missed his wife and wanted to spend time with her and reconnect.\n\nThis was your response to him : \n\n>I only came on the trip because it was what he wanted\n\nNgl i understand that he doesnt speak to you, if invited someone I loved on vacation and they didnt really pay attention to me and then said \"i dont even want to be here\" i m sorry but i would find it difficult not to be hurt.\n\n\nI understand you being worried, i REALLY do, but i dont think this was the way to go about it or that you should have said that in that specific way. Please apologize. :/", "I did this with my own parents when I was a new mum, I had seperation anxiety and mum guilt so bad.. I still flick a text and he's almost 6. \n\nHis dad made me go out to \"reconnect in our relationship\" at 17 days old and I cried and cried, my boobies exploded and I went home and I spoke to someone and that was, what caused my intense anxiety. \n\nI know I'll be more chill with number 2 (she's born in 9 days!!) Because I know what I won't be doing and what I'm comfortable with now.\n\nI don't think you are an asshole. I think you aren't ready to be far apart for long periods yet, has anything else happened to make you so anxious and worried??", "IN FO: why did you go if you were so scared?\nYta", "I can’t believe all of the YTA responses.   \nshe’s a young mom with an 8 month old baby that she instinctively didn’t want to leave in the first place.  I agreed to a trip with my husband when my baby was about that age and my MiL also watched my daughter. I called as often as I wanted and my husband and my in-laws had ZERO problems with it. My husband called frequently too or asked me to call.   \nmy daughter wasn’t smothered  at all. She’s a successful 34 year old now and has two kids of her own that she doesn’t leave to fly elsewhere.  She quit a job over travel requirements and started her own company so she can be home And not travel.  \nthe only AHs here are the husband and in-laws (if they are giving her trouble too) and the harpies here calling the OP an AH.", "Holy shit, but you’re condescending.", "I don’t have kids so I honestly don’t know but if you knew it was an important business dinner wouldn’t you call to check on your child before the dinner not during? I feel like that would be annoying to me if my spouse knew we were going to dinner but picked during dinner to call when before dinner would have worked. I even get the calling again to check. (Although I wonder if a text would have worked) But twice in one dinner seems excessive when it seems like there were other options to check up on baby during dinner.", "Ironic you mention for the husband to listen to his wife, yet wife isnt listening to her husband. \n\nEither way, I dont see this marriage lasting much longer at this rate. Communication is at zero and OP is now a \"mumma\" and not a wife or even her own self anymore.", "Husband is not gonna be around at this rate. I love all the N T A answers in here, theyre coming from teenagers and people whos whole identity is \"im a mumma\" crowd.", "For goodness sake. This is ridiculous.", "Are you advocating for domestic violence? Bro grow up", "Agreed", "What gets me though is why wouldn’t you call before the dinner? And then maybe need to call during. It’s odd to me that she had to call twice during the dinner.", "NTA . First time? 8 months old? It's not about trust it's worry. No one should fault you for that, but leave baby for shorter periods when you get back to convince in laws it wasn't them, and to desensitize yourself some. If the level of stress you feel doesn't come down with some exposure, seek therapy. It will help ease your mind overall at the very least", "NTA There are plenty of ways to connect with your husband that don’t require a 3 day trip and a plane ride. It was cruel of him to insist. Your baby is still very young and can’t even talk to tell you if anything happened while you were away. You and your husband need to come up with a plan for meeting everyone’s needs, but it doesn’t require you to leave your baby like that.", "ummm.... you DIDN'T leave your son \"alone.\" he was being taken care of by your mil. 😵‍💫\n\nYTA. i get that you were concerned and anxious, but unless you have some unspoken reason for not trusting your mil, you over-obsessed on something that you didn't need to.", "YTA - and so is your husband to make go on this trip. It’s not 1990 anymore. Set up a cam in the baby room of your in-laws and check online. Text them instead of calling.", "When your husband leaves, everyone will call him an asshole for leaving his wife and the mother of his child. No one will say anything about you tapping out as his wife.\n\nYou’re not his wife right now and he is trying to be with his wife…you just want to be a mother\n\nEdit to add: YTA", "YTA. \nI’m not a parent, so I can’t speak on how it feels to be away from a child that young. \nHowever, unless there’s some reason you didn’t trust your MIL, which it doesn’t sound like you do because you let her watch your child, calling twice during one dinner because he was crying the first time was excessive. He’s a kid, kids cry, especially at that age. \nI understand you’re feeling some separation anxiety, but that was an AH move. \nYou could’ve waited and called again later for bedtime, or first thing the next morning.", "Youre not an a-hole for being worried, but you do seem to have a lot of separation anxiety. Post partum seems too exptreme a term, but it Can cause these kinds of anxieties. \n\nI think it would be really good for you and your spouse if you looked into therapy to help cope with these feelings. If you truly trust them, then apologize to your partner and in-laws, and explain that you're experiencing a lot of anxiety being too far for too long. It would help to establish that understanding, and find ways to work on it.\n\nI suggest just requesting, idk, texts or photo updates every now and then. That would cut out the need for calling, but it would still give you some reassurance with regular updates.", "NTA Leaving your baby for the first time is incredibly hard. Especially less than a year old. Your husband is the AH for pressuring you.", "NTA.\n\nBaby is  8 MONTHS OLD. The majority of primary carers find it excruciating being apart from baby. It isn’t depression - it’s a normal bond. \n\nAnd to all the people saying you’re not being a “good wife” - seriously? He’s not being a good husband. He hasn’t recognised your needs at all. \n\nINFO: how exactly did your husband convince you to go? Wondering if there was a fair whack of manipulation.\n\nI know that my hubby would never request that we leave our babies overnight with anyone.", "Probably not MILs first time with a crying baby….", "Oh great, another helicopter mom in the making. We get it. You’re a mom now. You’re obsessed with your baby. But you know what else also needs your time and attention? Your husband and your marriage. Your relationship is the foundation of your family. It is fundamentally important to the health and happiness of your child. Your MIL is capable of caring for your baby. She raised your husband, after all, and you deemed him AOK enough to marry and have a kid with. Babies cry. It’s what they do. I think your baby will survive, and you can survive an effing hour without nagging your MIL. If you want your marriage to survive, too, chill the eff out and give your husband the attention he deserves for half an hour. YTA.", "This is showing your own anxiety is the issue. I hope you can get a handle on it soon.", "you weren’t ready yet, and that’s okay. hope you’re back with your baby now 🤎 and i hope your next vacay is anxiety free", "Oh God…you’re gonna be that parent….good luck to you child and any thing he wants to do.  YTA, your MIL hasn’t given you ANY reason for you to be so obsessive.  Get over it, your baby will be fine!", "NTA", "NTA- for your first child, perhaps a 3\\_day trip was a little too much of an ask at 8months. I couldn't imagine going through that with the first child. Even 24 hours was painful. \n\nLooking back and having other kids... I'd gladly take a three day and call perhaps once a day and that would be plenty... if I remembered. Hell, right now I'd love to go on a two week and call once I landed... back home ;) I'd figure, \"They know my number, if there was an issue- someone would call.\" You're a first timer. It should be expected.\n\nI was gone 48 hrs once and my plane had me delayed and I FREAKED out because I wasn't going to be back in the allotted time I mentally allowed myself for being away.", "I worry a lot, but we left our daughter overnight with her nanna and I called (or messaged)three times. Once when we got where we were going. Once before the evening (it was a wedding so in between the ceremony and the getting half cut) and once in the morning before we came home. \n\nYou need to speak to someone about why you’re so keyed up and worried, I absolutely trusted my mil to handle things and ring if she needed to. My daughter has just asked to have a sleep over, over nanna’s, but she’s a lot older now. I assume it’s because she knows nanna will let her (safely) get away with stuff I won’t!", "NTA Your husband should not have pushed you to leave your baby.  It makes me so sad to read this and all the \"yta\" comments:(. In my country its a common saying that you can be away from your child one day when he/she is one year old. If it feels right for you and you baby. I have a 8 month and I have only been away from her for maximum eight hours ( while her dad was with her). I would be devastated if I had to leave her over the night to anyone except her dad.  \nAll the comments about that you should leave your baby feels very old-fashioned and does not respect our parental instinct.  I also don't understand how it could be okay for your husband to leave your baby? Is he taking care of her/him? Do they have a strong bond?", "I'm going against it, NTA\n\n*This wasn't a 'romantic trip' for the two of you.*  It was work related for your busband. (Having his associate at the dinner for two would be pretty weird) \n\nThe trip was about him, and you went only to please him.  \n\nFor the future, train yourself. Go for a few hours, then a day, built it up. He took you far away for three whole days. No wonder you got anxious. \n\nAnd the two calls I see people tripping over... well yes, your baby wasn't happy. So you were unhappy. Then you checked again to not feel anxious too long. You probably did a lot better after the second call.", "YTA I’ve been babysitting my nephew since he was 3 months old and his mum still does this constantly - even though she’s the one who asks for a babysitter and he’s been fine every time (he’s now 1). It’s infuriating caring for a baby and constantly having to pick up the phone - especially when he’s upset because he’s hungry or tired. It makes everything ten times harder. You just get them settled and the phone rings again.", "Yeah, calling a couple times a day would have been fine. Twice during dinner is over the top. He's a baby, babies cry, I'm sure MIL knows how to care for a crying baby. Look OP, as your kid gets older, you're going to have to get used to this sort of thing. YTA", "Thank you! I do not understand all these y t a comments. It's totally ok to not be ready to be away from you baby for 3 days at 8 months. But you and your partner need to communicate about that. \n\nHubby pressuring you to come without bub when you weren't ready wasn't fair. You agreeing to go when you weren't ready wasn't fair. You should have brought baby with you or stayed home. \n\nAs for how much you messaged/called the first time my SIL had my son for a few hours she sent updates on the half hour. I didn't need it (i actually prefer not to get updates - but my son was over a year before anyone other than his dad watched him), but it's what she appreciated the first time she was away. Different ppl have different needs, that's ok.", "I agree. Especially if they hadn’t built up to it; going out for a day then overnight etc.", "Agreed, I wasn’t comfortable leaving my\nSon overnight until he was 18 months old", "If this trip is supposed to save the marriage, why is anyone in a business meeting?", "Well, being a Mom is your most important identity imo and it certainly is to your children and to the world at large, if we don’t have 100% Mothers and Fathers, we won’t have healthy functional Adults to bring their great gifts to the world, the key is while fostering that identity you can still nurture your other relationships especially with your husband and you do need to be a 100% Mom and that is sustainable bcuz as we’ve seen on this subreddit if they’re not 100% it is ugly and these kids end up in therapy or going lc or nc, I mean you need to put 100% into everything you do especially a parent but I think what you meant is you don’t have to ignore your other relationships to still be a good Mom, I think OP and her husband need to probably compromise more  and communicate in a healthier way bcuz she clearly wasn’t ready to leave the child alone yet and overcompensated for that so they need to definitely have better communication skills and I think it seems like once was enough during dinner to check on her child but again there needs to be better communication and compromise skills between OP and her husband.", "I'm not a parent at all, but it sounds like OPs husband doesn't give two shits about how OP feels. Pressures her into going on this trip, then instead of comforting her about baby probably being okay and being understanding, complains he's not getting enough attention - I wouldn't be surprised if husband is jealous of the attention baby gets. OP has two babies.", ">babies cry\n\nTIL", "Stopping during dinner to call is extreme on its own.", "YTA\n\nYou'll get used being away from the baby... shared custody does that. \n\nWith your obsessive calling and the fact your husband was being so adamant on needing this trip it shows your marriage is on the rocks.", "NTA  your husband shouldnt have pressured you to leave your baby if you werent comfortable. And could've at least been understanding that you were worried.", "NTA just a loving and anxious mom who didn’t want to be prised apart from her baby \n\nStand up to your DH and tell him you didn’t want to be there and you want to go home to your baby \n\nYou’re very anxious and I’m worried about you \n\nPlease get checked out for PPD and tell your dr how you’re feeling \n\nYou were not ready to leave your very young baby for three whole days - great for moms who are comfortable with doing that - it didn’t suit you \n\nMake your feelings known and go home", "NTA You're a new mom. It is TOTALLY normal to freak out over being away from your 8 month old baby. That being said, for your own sanity and your relationships, you need to learn to relax a bit and let go. You don't have to be hyper-vigilant mommy mode 24/7. If the baby is safely with someone else, relax and be you again. It sounds like your husband was wanting his wife to be present and instead got a helicopter mom.", "YTA. Get a grip and some therapy. Calling each day would be totally normal. Calling twice a day would be a bit much but understandable for a new mother. Calling twice in a meal is obsessive and harmful to you, and similar behavior will eventually be harmful to your child.\n\nBabies cry. It is totally normal. There was no reason to call back a second time, your husband has every reason to be angry.", "NTA. I had bad anxiety with my baby for the first year, that my midwife thought I may have ppd but I personally felt it was more postpartum anxiety. \n\nMy partner and family understood. We waited until my anxiety was under control before we made trips away from the baby.\n\nThe ones who say Y T A do not know how bad postpartum anxiety can get. All this support for depression but when it comes to anxiety, people just expect you to just get over it. Luckily I had people on my side. \n\nEven a few hours away while MIL babysitted, she would send me several photos to ease my anxiety and wouldn’t be offended if I phone a few times during that time. I was surrounded by good, understanding people.\n\nIt took a year after birth for my hormones and anxiety to return to normal. But talking to my midwife about my fears helped a lot, you should consider talking to the doctor if you feel it’s too much to handle.", "Do you have postpartum anxiety? Because the obsessive calling is too much. If you don’t have it, YTA. But whether you do or don’t, you need help. Because this level of anxiety isn’t healthy.", "NTA. \nAnd that baby is way too young to be away from both his parents for 3 days. No matter how good a job your MIL is doing, it’s too long.", "YTA\n\nWe get that you're worried about your child, but your husband is right, it sounds like you don't trust that his parents can take care of the baby. If something was wrong, they would call you.\n\nAnd you probably hurt your husband's feelings. He might've wanted you both to relax a little before going back home because you are clearly stressed with the baby. It was only 3 days. Telling him you didn't even want to come when he wanted you with him probably hurt him.", "Yea sorry but I left my 4 month old with my MIL for a whopping 1 and a half and I was nervous wreck. Thank god my husband isn’t dumb enough to talk shit when I am huge ball of anxiety especially after the 15 lb bundle of joy that I just, ya know pushed out of my vag. NTA but don’t agree to something like this until you’re ready.", "NTA\n\nI am sorry that everyone is ragging you. I completely understand how you felt. You had never left your baby alone, especially with this being your first child. I don't care who your child is in the care of or how much you trust them; worrying will be there. I also understand you calling twice during dinner, the first time, he was crying, and the second, you just wanted to make sure he was ok. Some people ignore the seriousness of separation anxiety when they are pressed to leave their little ones behind. In my opinion, until you are completely comfortable leaving him behind, you might not want to go away for days at a time. I wish you the best, momma.", "NTA. You left your baby, when you were not ready to leave your baby. My advice would be to not go out of town without your baby until the baby is older.", "YTA.\n\nNothing happened and you didn't listen to your husband.\n\nYou're also creating drama cuz now it's affecting your husband, his parents and his associate will think badly about you two whether you like it or not.", "NTA, your child is a baby. Dont let society make you feel silly for not wanting to be away from your infant, it isnt natural to be away from them. Your husband sounds like the AH for not respecting your feelings.", "NTA\n\nYour baby is only 8 months old for goodness sake, of course you didn’t feel comfortable leaving him! He knew full well you would struggle and guilt tripped you into it anyway, then whined when the inevitable happened! It must have been so hard for your baby to suddenly not have you there as well. It’s not natural to be separated for so long. \n\nAlso, by the sounds of it it wasn’t a business meeting at all, but a meal with a work colleague. Who cares if you left the table briefly twice! The sulking and giving you the silent treatment afterwards is beyond pathetic.", "Nta. The baby is still young and i presume it is ops first child of course she is anxious. Husband shouldn’t have pressured op to leave their 8 month alone is she isn’t comfortable.", "NTA. This is your very first trip away, right? Of course you’re anxious! Your husband should be a lot more understanding.", "NTA.  Oh hey, you know we have these neat inventions now.  They're called cell phones.   Your MIL, knowing you were an anxious new mother, could have sent you pictures and texts telling you your baby was okay the whole time, just, you know, to be nice and supportive.   Your husband could have told the associate you had to leave the  baby at home and needed to call to check in.  The associate would probably be more understanding than your husband was.   Everyone but you was the A H here.  I'm sorry.  They could have made it easier, even made it a loving, supportive time.  Instead they had to make it like you were being the bad guy for caring about your infant.   Ugh.   Don't let them make you crazy, stick to your instincts.  Tell your husband to grow up.", "YTA you should seek medical help before having to raise that child by yourself.", "NTA. \n\nFor all the people saying \"I'm not a parent but ...', no. If you are not a parent, you couldn't possibly understand what it means to leave an 8 month old. She has had this baby inside her (likely 9 months +) longer than his age (8 months). \n\nThis has nothing to do with trust issues with MIL. It has everything to do with the baby. Babies at that age start to have separation anxiety too. \n\nOP, you don't need help. You just need your baby which is completely understandable, especially for a first time mom (I'm assuming). 3 days can be a long time to be away.", "NTA. Baby is only 8 months old, my eldest was 4 before I agreed to be in a different city, never mind a plane ride away. You said it would make you feel anxious, he wanted you to go anyway - and surprise\nSurprise you were anxious! Your MIL was a new mum too remember- have a chat when you get back I’m sure she won’t take it personally that you were calling! \nAnxiety as a mum can be all consuming, it is good to get help and support, and give yourself a break. Yes, it’s good to focus on your relationship with your husband too but give yourself a break, it’s only been 8 months!", "YTA.", "YTA, not for checking in but twice during one meal? Your MIL brought up your husband she knows what to do and would call if anything happened if its your first child, the anxiety is understanding, but you should be able to manage a meal", "She didn’t want to leave her baby! OP says that in the post. There was clear discomfort with the situation. \nAs a mother herself, I’m sure her MIL understood.", "6 times is wayyy over the top. Be real", "3-6 is valid.  To be reasonable I'd say two at most!!!", "Yep, same. \n\nMy anxiety was so bad, and I scored high on PPD tests, my midwife thought it was PPD, but I always thought it was more postpartum anxiety, because I loved my baby and looking after my baby felt so natural. I didn’t struggle with my baby, I struggled with fears and anxiety about her safety (present and future) that it would keep it up and night and make me cry. \n\nHad to sit in the back with my baby in the car, to make sure she was okay, because of fears of her not being strapped in properly and suffocating in the chair was just too much.\n\nLuckily I was surrounded by good people who understood. Waited until my anxiety was under control before we took trips (just a few days) away from baby.\n\nIf my MIL was babysitting even just for a few hours, she would often send photos to ease my anxiety and lessen my need to phone, but if I did phone, she wouldn’t be offended. My dad and his wife were happy to ease my anxiety too. My partner didn’t pressure me to do anything I didn’t want to.\n\nTook a year before my anxiety started returning to normal levels.", "100% agree. When my baby was 8 months, I wasnt able to leave him for more than a couple of hours. Not just me, but my husband too. It caused too much anxiety for the both of us.", "Well she might be better off since her husband guilted her into going on a trip she wasn’t comfortable going on. My spouse would never.", "Yes! You can be a great mom AND nurture and grow your own identity", "Yeah, these y t a comments are really insensitive tbh.\n\nI bet OP is feeling extra anxious because she felt pressured to take this trip before she felt ready. She could have done with a little more kindness and caring from both her husband and her MiL.\n\nI'm not ready to leave my 10month old overnight yet and my daughter was almost 3 before she spent the night away from me (mainly because covid and whatever). I'm sure my mum rolls her eyes when I txt to check in when she's babysitting and my husband will tease me but they both understand why I do it.", "Yeah, I can barely be away from my 8 month old for a few hours before I want to see him again. I can't imagine going days without him at this point.", "There comes a point when its not healthy for a parent to not be able to leave their child. That's not healthy for the child, parent, or parent relationship. The child needs to learn independence at some point. There is a fine line between caring and unhealthy controlling obsession.\n\nEdit to add: my mom almost lost me before i was born. She was afraid to let me out of her sight. I am 40, and still struggle with anxiety issues from the way i was parented.", "Being a good parent and ONLY being a parent are not the same.\n\nGood parents model the behaviors they want their kids to show, including self care, moderation, and doing things you enjoy.\n\nIf the only thing your kids see is a parent who allows parenting to be their entire personality - with no breaks, no self care, and no moderation - they arent doung a good job.\n\n100% parenting is an unrealistic and ridiculous standard to hold any human to. Good parenting, including self care and relationship time away from kids, is the right standard.", "Yup. 1st time in 8 months that the baby cried. Totally justified /s\n\nGet a grip", "I don't think anything suggest MIL was being uncaring - did OP say in a comment MIL was annoyed by the check ins? \n\nBut otherwise 100% agree. I've had 1 night away from my 18 month old. And only because I'm pregnant and I didn't want his first time away from me to result in coming home to a baby. I can count on 1 hand the times he's been away from me more than 30 minutes.", "He's 8 months old - in fact, secure attachment reccomendations are for children under 30 months not to be away from the primary carer for extended periods (like over nights) regularly to support development. And at 8 months many children are still breastfeeding (as per WHO and AAP recs to ebf for 6 months, and continue for 2+ years if mum and bub want to). \n\nSecure attachment supports children to develop independence. I am a sahm with my son full time (and have a degree in early childhood education). He is incredibly independent and adapt at taking risks, because he is secure in his attachments to me and his dad. \n\nDon't conflate issues of anxious parents later in life with normal variations of parenting choices in infancy. \n\nNothing wrong with being Ok being away from your kid, but also nothing wrong with OPs parenting choice.", "Whoa whoa, where are you getting that the husband is jealous of his own son? Did you really just call him a baby with absolutely zero evidence of immaturity?\n\nHis own parents are watching the child, of COURSE he is upset because OP clearly doesn't trust the people who raised him to take care of his own child for a couple of days.", "I think we must not being communicating the same way or I am not, I mean you can’t be 99.9% a parent, I mean you have other relationships with other people which you should nurture but if you’re not a 100% a parent your children are going to have issues but I don’t think I must be communicating this properly so I just give up. Last time I checked you give 100% to everything you do but being 100% a parent, no way, I don’t know what people think being a 100% parent is but apparently its unattainable, no wonder this world is so screwed up.", "Fair point, you're right. It's the husbands behaviour that was lacking. Perhaps MiL was totally understanding.", "Clearly OP is suffering from anxious parenting if she can't go more than a few hours without checking on her child.", "I'd say invalidating how your partner is feeling is immature, yeah. Feelings may or may not be \"reasonable\" but they feel the same either way. Nowhere does OP say they don't actually trust the parents. They're away from their kid and have anxiety about it, how does the husband throwing a tantrum about it help?", "Her child is an infant…. Not a grown adult??? It’s completely NORMAL for her to have these feelings. She was pressured to leave her baby which has resulted in these extra feelings of anxiety.", "No she has an 8 month she may never have been away from before. She is not only away from it, she is a plane ride away for 3 days. \n\nIs she anxious. Yes. That does not mean she is in any way a bad parent or not allowing her child to develop independence? No not at all. \n\nYou're reading a lot into this that is not in anyway states or implied", "1. The anxiety is HER problem. It’s unreasonable to be so anxious about an 8 month old with the in-laws. Everything else is irrelevant because she has an obsessive anxiety issue.\n\n2. She’s so obviously neglecting her husband. Calling 2 times in one dinner lmao. He’s definelty felt like shit these last 8 months.\n\n3. I really hate this desperate desire to baby mothers and pregnant woman. He should comfort her??? What the fuck. She’s being obsessive. She should grow the fuck up and see a damn therapist. It’s not on him to be obligated to comfort her damn unreasonable feelings. What an absurd thing to say. And how is that fair to her husband. She’s acting unreasonable and you have no right to be upset. Instead I’m gonna blame you for not comforting her.\n\n4. Calling that often basically implies you don’t trust the parents. Lol it’s not a stretch. \n\nAgain the simple answer is…. You’re anxiety is your problem. You don’t get to shift that responsibility and blame on anyone else. And you don’t get to be an obsessive mother.\n\nIf you got PPD, I’m sorry. But you’re a parent now. Which means you don’t get an excuse anymore. Idc what’s wrong with you, you have to act like a damn normal parent. There’s 0 fucking excuses the day I become a parent.", "NTA. I cannot believe these comments. Yes, OP was calling excessively. Because she was pressured into being away from her 8 month old for 3 days, a plane ride away! Obviously couples need time for themselves, make time for dates or outings without baby. Grandma seems willing to help. There was zero reason to pressure his wife into this, and then get mad at her because she is not having a good time. On a trip she didn’t want to go on in the first place. Very few new moms want to be that far away from their infant for that long.", "NTA. You are understandably anxious and your husband is selfish. You should not have left your 8 month baby back.", "NAH at all your husband wanted a trip as a couple but your not ready for it. I won’t judge either of you as AH", "I would have found it hard to leave an eight month old for more than a couple of hours. I’m sorry you felt you had to.", "NTA it's normal to be anxious about leaving a baby for the first time. It doesn't mean you don't trust your MIL. \n\nI'm also guessing, if you're being honest with yourself, you're feeling guilty about leaving him with your MIL. Like he's going to feel like you abandoned him. (You didn't and you haven't done anything to feel guilty about)\n\nIf you're still checking in this frequently in a year or two then that's a different issue but you'll probably get more comfortable leaving him with family as time goes on.\n\nI think your husband needs to chill out and be a bit more understanding that you leaving your son for the first time for an extended period is going to make you feel guilty and anxious (especially as I guessing he has probably been away from your son most days so is used to not being RIGHT. THERE. if there's a problem and you probably haven't). \n\nBut remember you didn't leave him alone you left him with a family member you (hopefully) trust who loves him and also wants what's best for him and stop beating yourself up.", "Esh, calling as much as you did is a little worrying and there may be more things at play for you: possibly ppd which you should maybe get checked for just for your own peace of mind. That being said you clearly weren't ready to go on this trip but you felt obliged for your husband. I sympathise with you as I hate being away from my kids for that long and my oldest is 10, she recently went away for 5 days on a residential and I hated it (phone calls weren't allowed) but she had a ball and I never let her know how hard it was for me cos not being able to talk to her once was very difficult.", "This might be an unpopular opinion, but I do not think OP is the AH! No one is. It seems to me that OP was not ready to be apart from her son for multiple days yet and that is ok! I wouldn't have been able to enjoy a trip away from my son when he was 8 months old, he would've been constantly on my mind and i would have been miserable and worried. Attachment goes both ways, it's a symbiosis.\n\nYour husband isn't experiencing what you are experiencing as the primary caregiver and so he couldn't have known how this would be for you. The real problem here is that you agreed to a trip that he wanted that you were not interested in at all and which is causing you great anxiety just on order to appease him. The best thing to do would be to learn from this and next time follow any serious inner cues.\n\nThis isn't about doubting MIL's ability, it's simply being worried about the baby. For those of you trying to diagnose OP, this kind of attachment and attunement is also pretty normal! Q\n\nAlso: my dear, it will get better and easier as time passes! No need to rush, take motherhood at your own pace. You WILL get back to a place where you will be able to have those \"freedoms\" again, in your own time.", "NTA I empathize with your husband because you are letting your anxiety get the better of you. However, your husband needs to understand that whatever is going on in your head is real for you. He is TA for dismissing you.", "Post parturition anxiety is a real thing. See a professional", "Soft YTA.\n\nHave you spoken to your doctor about postpartum depression and postpartum anxiety?", "Info: how many times did you call in 3 days? You excusing yourself from dinner twice to call, a time that would be inappropriate, indicates you called obsessively. A quick check in in the morning and one at night is fine. Being away from your baby is good for both of you. It’s nice that your baby has grandparents that are willing and able to care for your child, take advantage of it. Your baby will only benefit from having more people they are comfortable with and they love. You being anxious about it is about you and has nothing to do with baby. Baby is fine.", "No judgment but have you checked with your doctor? Lots of new moms suffer from PPD and separation anxiety. Please check into it and take care of yourself.", "YTA, to obeying your husband and putting him over your child. \nIf you don’t feel like leave your kid, DON‘T!!!!", "YTA. You’re so worried about your baby when it’s pretty clear you need to be worried about your marriage.", "Ok, so while I think it was wrong of you to phone that many times, I don’t think you’re an AH, I do however think you might need help, as the amount of phone calls is a bit excessive.  I don’t think your husband is necessarily the AH here either, but he should be supporting you, and it doesn’t look like he is, he’s being childish by being silent.  I think ESH because you shouldn’t have called that many times and he shouldn’t be giving you the silent treatment.", "Soft YTA. OP this behavior is not normal and I hope you will speak to a doctor/therapist. I can’t imagine the suffering you are going through worrying like this. Please get the help you need. A healthy mother is the most important thing for your child. If not for yourself, do it for your son.", "ESH. \n\nIt is 100% OK to check on your kid every day while away, but if you’re so anxious about it, you need to get checked out to make sure you don’t have postpartum anxiety. \nI do, and I did the same thing. I’d obsessively check on my son, regardless of where he was. Even with his own Dad. \nI still do it from time to time, but I also don’t let anyone watch my kid so I don’t have to do that. \n\nYour husband should have not pushed you to go on a trip when you were not ready. He also should be more understanding that you were feeling anxious and probably couldn’t help yourself. \n\nI will say this, as a “2 Under 2” parent: you need to find a way to spend time with your husband when you’re not in “Mommy” mode. Motherhood is a 24/7 job, but for the sake of your marriage, you need to be able to shut it off for an hour or two and just be his wife. \nIt’s tough, it’s something I still struggle with. But it will do wonders for your marriage.", "Overall I'd say you are not an AH. However, you do have a problem. You are becoming a helicopter mom! You probably have postpartum anxiety. It happens.  It isn't ok to the extent that you have it. You need to see a doctor and get some help. You need to understand that part of being a good mom is also to give the baby time to be away from you. You need to take care of not only the baby but also the baby's parents. Both of them. You just sent your husband the message that he is no longer important to you.  Is that true? If it is then let him go now so he can find someone who WILL value him.  If not you need to get some therapy so you can genuinely work through how to handle this new dynamic.  Good luck!", "Gentle YTA. You are being irrational: your MIL has more experience in keeping babies alive than you do, and constantly interrupting with phone calls all the time doesn't help. the baby might also cry because the ringtone wakes him up.\n\nHyper anxious obsessive helicopter parents damage their own lives and can cause trauma to kids. I would encourage you to seek professional help to nip this in the bud and help you manage the situation healthily as your baby keeps growing.", "Remember your MiL has been a mother for soooo many years, you have only been for 8 months. I’m sure she manage. And your child sure needs to be able to be around other people bc you sound really clingy bordering obsessed…🤷🏼‍♀️", "YTA\n\nOnce, maybe twice a day I'd understand. But you called twice during a single meal! Calm down! Your kid is 8 months not 8 days", "Yta ... I would get this if these people hadn't raised a damn human before. . You married the human they raised if you don't trust them  ..then by default you don't trust your husband to take care of his child so which is it", "YTA your baby is not “*alone*” as you say. He is with two very capable adults who raised your husband chill tf out it’s 72 hours. Apologize to your poor husband for even agreeing and giving him this vision of an amazing and relaxing getaway with you when you clearly aren’t ready.", "YTA-grow a spine. If you didn’t want to go, you should have said so.", "YTA. You called twice during one dinner. I would be upset if I were your husband. That’s excessive.", "I have an 8 month old son who I haven't left for more than 5 hours once (in hospital) and this is just the nicest thing I could have read and has definitley made me question being so clingy when he has loving grand parents who would watch him, idk I know this wasnt meant for me but as a first time mum whos kinda young (24) its lovely to read so thank you", "Adding on, unfortunately, constantly missing those signs can lead to separations, and full time mom goes to single mom.", "I'd rather ask why OP compromised on not having her child around if she feels being attached  to the baby is so important (what I would understand).\n\nMaybe next time listen to your intuition and stay with the baby, not join the husband on a random trip...\n\nThus: ESH. You for comprising against your priorities and husband for not understanding your needs.", "Thank you! \n\nWe had previously lost a child, and I was so anxious at the idea of one of us (my husband or I) not being with our daughter for the 1st year. Even my 1st separation from her was when I was recovering from a procedure, my best friend stayed and took care of me. While my husband took her to met her grandpa for the 1st time for a 6 hour drive to a different state, for 2 days. My husband and I FaceTimed 10 times while they were gone.", "Finally some reason. I breastfed my kids and did not leave them over night until they were over a year, closer to 18 months. First of all I didn’t want to be apart from them, second I sure didn’t want to wake up to pump. I waited until I felt ok with it and I did not have the urge that OP was feeling to call all the time. 8 months is still so little. It was wrong for her husband to push her into that (they can find better ways to connect than going on a weekend away).", "Yep. Spending 3 nights away from your baby is huge. I don't think I'd agree to that long a trip away from my baby and if I did I know my husband would be understanding of the fact that I will need to check in a lot. Understanding is needed not judgement", "Shocked there aren’t more NAH. There’s several reasons for OP to not be ready and anxious about leaving a 8 month old, and valid reasons op husband wants time alone. Sounds like both parents are burning out and need to improve communication", "Perfectly said.", "I mean she is definitely overly anxious, but she shouldn’t have been pressured to go in the first place. He should apologize to her for pushing her into this trip and then treating her like shit because she’s not having a good time. I don’t see why they had to go away for 3 days, that far away. Grandma seems willing to help, they should go on regular dates. Baby steps.", "If you're not a parent than you just don't get it. If you can't speak to how it feels to be away from a child that young than you clearly can't judge this woman. 1", "She can't just switch off being a mum! This was her first trip away from her very young baby. There are plenty of other ways to keep the connection with her husband but a 3 night trip away is clearly too much.", "You are calling once an hour to check in on an 8 month old? \n\nThat isn't \"pretty normal\" \n\nThat is a sign that your anxiety is controlling you", "I can't even imagine what you think the husband should have done. She didn't know her own 'needs' when she agreed to the trip.", "Calm down it's a figure of speech.", "I get the feeling that she didn’t want to go but husband pressured her because it was important to him", "Genuine question: what about during the working day? Few countries have extended maternity leave like Sweden, most in Europe have up to 6 months hut, as far as I know, in America is far less. A working day can be long, equivalent to a night away... How is it sustainable/desirable that a parent stays almost 24/7 with a kid for almost 30 months??", "I never stated a child should be with their primary caregiver 24/7 for 2.5yrs I said extended time away from caregivers such as overnights is discouraged from occuring regularly. There are times that may be needed or desired - my 18 month old has had an overnight once. And there is a big difference between extended periods of time like multiple days, and together 24/7. \n\nThe important thing is genuine and authentic interaction with your child when you are home, regardless of how long that is. Personally, I would say my son is securely attached to both me and his father - while I am his primary attachment being the sahp, his attachment to his father is very secure despite him working full time. \n\nThe 30-month figure is usually used in cases referring to custody arrangements, as a guideline for how to build custody overtime, with overnights with the non primary carer being recommended from 30 months, in most situations (there is debate on the actual number of months, and of course this us dependant family to family based on the attachment of child woth each individual parent, some children are ready much earlier I'd securely attached to both parents). \n\nFrom my research, ideally, birth parents should be supported to remain home for the first 26w to maximise opportunities to develop secure attachment and support exclusively breastfeeding as per health recs. Birth parents being able to access 26w of mat leave is associated with better health outcomes for both the parent and child in this dyad in the long term (and it actually costs the government less money to fund this, when the associated health costs are considered for countries with good public health care systems). \n\nWhen a parent is not able to access that leave, ensuring responsive care to your child when you are able to be present. Responding to your child's needs builds attachment. And the times we don't do this well, repairing the relationship so they know we are unconditionally there. \n\nhttps://raisingchildren.net.au/babies/connecting-communicating/bonding/bonding-babies\n\n\nhttps://psychcentral.com/lib/five-ways-to-create-a-secure-attachment-with-your-baby-without-sharing-your-bed#3\n\nhttps://raisedgood.com/everything-you-need-to-know-about-secure-attachment/\n\n(Some custody sites referencing overnights from.about 2.5yrs -\n https://www.cominosfamilylawyers.com.au/parenting-arrangements-0-to-4-year-olds/\n\nhttps://www.familyeducation.com/family-life/divorce/custody-child-support/age-appropriate-visitation\n\nhttps://cristinlowelaw.com/how-age-plays-a-role-in-child-custody-cases/", "Nope, you don't get to talk shit about parents with PPD. That's fucked up.", "NTA\n\nYou couldn’t pay me to take a trip away from my baby, especially under 12 months.\n\nIt is very natural for a mother to want to know how her baby is getting on.\n\nYour husband is selfish and your in laws lack compassion.", "NTA you didn’t wanna be away from your baby. You weren’t ready, you felt anxious, you soothes that anxiety \n\nYour husband is a big AH tho", "YTA", "NTA your baby is only 8 months old. Most of my mom friends haven’t left their kid for an overnight until at least 1 yr old (not that it’s a standard but it shows how long it can take to get comfortable with the idea).\n\nYour husband for some reason strong armed you into going on a work trip you weren’t ready to go on and is now throwing a man tantrum because you aren’t giving him enough attention/ offending his delicate parents (any reasonable grandparent would 100% understand a flurry of calls the first time they look after their grand kid overnight).\n\nYour husband is being an uncaring jerk and you clearly aren’t ready to be separated from your baby yet which is completely reasonable. You may have some level of anxiety to work through, but at 8 months your urge to be with and protect your baby is still super strong.", "The first trip I took after birth was when my son was 1y3months. I was anxious and nervous but glad I could spend some time alone with my husband. I used to call to check how my son was but every time he was crying if he would see me on the video call or hear my voice. So I stopped not wanting to hurt him even more, enjoyed my time, knowing he was in good hands with my MIL and when I came home it was like I haven't left. Is normal to want to be 100% there but you are a human too, you deserve to relax a bit.", "YTA. \n\nYou are the AH and a lousy mother. A good mother wants what is best for their child. As children, my mom was a great mom, but she shared my brother and me with our grandparents. It greatly enriched our lives. My brother and I shared our children. Our kids are now independent but always had a close tie to their grandparents-relationships that they treasured. \n\nYou are selfish not loving. You are going to create a situation where either the child is so dependent upon you that the child can never be truly independent or the child will find you so smothering that the child will go no contact. Grow up!", "NAH\n\nits normal to be anxious on your first trip away from baby. But you need to realise this is just you being anxious, your baby will be perfectly cared for by his grandmother.  \n\nI suggest that you try and relax , not worry and enjoy the break as you will be back to full time baby caring soon enough.", " NTA. I encourage you to talk to your physician about postpartum anxiety. It can show up any time in that first year. \nI am not a doctor, but I have had postpartum anxiety and understand how uncontrollable these worry thoughts are. You are not the asshole because I think a lot of this feeling is out of your control and your husband needs to pay attention and not see it as a personal slight. Your cup is overflowing right now and you literally don’t have capacity to handle anything else. Please consider reaching out to your physician or a counselor. This is extremely common and you are not alone. You are a great mom.", "This is anxiety. The only way you become an ass hole here is if you continue to ignore these symptoms while making everyone work around you. \n\nAlso, you will feel so much better after addressing it I promise!", "NTA. Time with your husband is important, but until you feel comfortable being a plane ride away (and I didn’t when my kids weee under a year old), that time can be spent as outings that are several hours long.", "A gentle YTA.  I have three kids and I have left them with one grandparent or the other from time to time over the years so I understand being nervous being away from your little one for the first time. But unless there was some reason to mistrust your MIL, one phone call per day, at a time when you're not actively doing something (end of the day, for example) should be sufficient.", "NTA it is absolutely normal to not want to leave a child so young and travel far away. Sounds like he bullie d you into it. His behavior sounds childish.", "I think people are being too hard on you - I would have been a wreck if I had left my baby for 3 days. I think I understand how you were feeling. I think next time, just be honest with your husband that you don't want to leave your baby for that long and don't go on the trip until your child is older and you feel more comfortable. NTA", "I’m not going to call you an AH, bc I feel like you’re experiencing some postpartum anxiety. That can really warp your mind, and it’s no joke. Please speak to you OBGYN about this and they can refer you to someone to talk to. Checking on baby once or twice a day is normal. Calling twice in one dinner is extreme. Your husband is frustrated and he has every right to be. However I do hope he can see that it isn’t an issue of you just being untrusting. You are clearly going through something and you need to get some help. It’s totally normal and you’ll be okay if you get that help. After my daughter was born, I didn’t sleep for like 6 months. I had anxiety whenever she was with anyone else, including her dad. I explained to my OBGYN what was going on and I got some good help. My kiddo is 1 1/2 now and things are so much better.", "NTA. you’re 8 months PP. don’t listen to these people, it’s perfectly normal to be attached to your baby. hormones are intense too. it’s a couple phone calls is it really such a big deal? (i’m 9 months pp)", "Is this your first child not the asshole but when you get home I’d explain to your in laws why you called as much I’m sure your mother in law will understand I’m a mom of three and still would call my kids are 6M 3F and a three month old I still call and check on them multiple times and they are mostly with my husband", "Uk ur husband needs u too, right? Ur son is safe and in trustworthy hands. U want to stay married, then u need to realize it's not just about ur son 24/7. YTA, u need therapy, and both of u need marriage counseling. Be better, OP, or u will lose him.", "I’m so sick of the “well the (grand) parents raised a kid just fine” comments. People are allowed to be connected to their kids in their own way. Calling and checking in probably was less about being worried for kid, but a way to calm her own anxiety which at 8 months postpartum is perfectly normal.\n\nHusband should have listened and not made her go (seems like it was a business trip anyway so why did she need to be there?), or spoken to his parents and asked them to check in frequently so she could feel more relaxed and actually enjoy herself.", "I'm going YTA but it depends on what you mean by 'multiple times.' Twice in one meal is definitely unreasonable. Wanting to go home part way through the trip (for no just cause) is unreasonable. Refusing to let go and enjoy yourself even a little and insisting on ruining the trip is absolutely unreasonable. Get control of your emotions. It's good to love and be concerned for your child, but he's with people whom you have no reason not to trust. Climb back down.", "NTA\n\nIt's hard to leave your child for the first time. It was nice that you wanted to support your husband. He should have shown you similar consideration knowing that you were anxious leaving your son behind FOR THE FIRST TIME!!!\n\nYou're husband is an insensitive dick.", "Hey. You should talk to a doctor, hun. Best of luck to you. ❤️", "YTA for calling twice during dinner. You need to spend time with the husband. Mommy anxiety is a real life problem, but it appears you have a little more than that. Have you spoken to your doctor about this and potentially anything else going on postpartum? I had postpartum depression and this sounds a like my symptoms.", "I won't call a worried mother an AH. but I will say this. Your mother-in-law has gone thru parenting at least one child. she knows what to do! A healthy amount would be to call twice or a maximum of thrice a day to find out how things are. Trust your mother-in-law to tell you if something is wrong. Calling twice at dinner time is in my opinion excessive. Do be more considerate of your mother in laws experience and her time!", "There’s calling to check on your child and there’s what you did. YTA.", "YTA. Once a day, toward the end for a quick catch up is fine. But twice during dinner? That is seriously helicopter mom action. Your MIL raised your husband, trust that she knows what she is doing. And that she will call if she needs to tell you something", "YTA. I hesitate to give that judgement because I don't want you to think you are an AH. It sounds more like you are a first time mom who is dealing with postpartum anxiety that you may not even realize you could have. If being away from your baby causes you enough anxiety that you feel like you can't leave baby with trusted people for more than a few hours it would be beneficial to you to call your OB/Midwife and explain to them how you feel.", "Does anyone else hear a helicopter? YTA.", "YTA. Yeah that’s a little obsessive! Maybe go to a doctor and get your anxiety treated.", "NTA but before I get flamed, consider this: Behaviors related to mental illness may result in AH-like behavior but that’s not the same as actually being an AH. I hope OP will get screened for postpartum depression and consider treatment for what she’s experiencing. Life doesn’t have to be this hard.", "YTA. Couldn't text?  Don't trust MIL to call if there's the slightest issue?  You did agree to go.", "“Your husband is alive…” what a low bar. A lot has actually changed in the last 30 years about baby care and many grandparents don’t bother to check what’s changed and assume everything is the same as what little they remember of having a baby themselves.\n\nPressuring a mother to leave her baby before she’s ready does more harm than good. The husband is an AH.", "She might be suffering from PPA. I’d definitely have her see a therapist. It’s not a fun place to be.", "are you serious? 8 months pp it can be so hard to leave your child especially overnight. i think it’s crazy that he separated them when she wasn’t ready", "I agree. ESH.  Especially the husband who pressured OP to take a multi-day trip when she obviously was not ready. It is not good to call many times in the apace  of a single dinner, but that wouldn't have happened if he had not pressured OP to leave the baby. \n\nI question all these Y T A s and wonder if some of them are mothers. I would not have left my 8 month old overnight. Let alone multiple nights. A few hours? Yes. Also, if you are breastfeeding (no info from OP here), then being away for so long is really not good. Pumping is a chore. I would not have left my singleton son at 8 months, nor my twins. And my husband would have never asked that of me. The trips we took at that age had to include kids, otherwise it wasn't happening. Those babies need their PARENTS. Especially their mommy, especially if they are breastfed.", "yeah i’m having so much trouble understanding the YTAs. i’m 9 months pp, none of these people must be moms lol", "How’d that affect your marriage?", "Why would this be postpartum anxiety? No one I know would hav considered traveling without their baby at such a young age!!! I see a mom who was push d into something she was not ready to do.", "[deleted]", "If the baby has loving grandparents there is nothing better for them and you. I loved my grandma so much.", "Like when they are teenagers and never call or text you back!  Or they respond with \"k\" when you ask them something important!", "Maybe it was a long dinner and if my child was upset the first call, I’d also check in later to confirm they calmed down.", "If I was the OP’s husband’s boss I wouldn’t think anything negative of a parent excusing themself from dinner to call and check on their young baby. OP isn’t the employee anyway.", "Husband pressured OP into going? Are you saying that OP doesn't have control over her own decisions and did not have the power to say no when husband asked? \n\nIt may be normal to not want to be separated from the baby but if that's the case for her then she should have taken steps to make sure it didn't happen.", "I can’t speak for PP, but my husband and I have 3 kids under 6, and we never left any of them overnight in the first 18 months. In fact the first time we were both away from our eldest was the night I went into labour with our middle kid, she was 2 at the time, and when I went to hospital to have our third, we didn’t need overnight care because our third baby was born in the daytime.\n\nWhen we have dates, we pick a time during the day when the two oldest are in school and my mum can watch the youngest for a couple of hours.\n\nRomance and making space for your partner doesn’t have to look like making yourself and your baby miserable for three days to go to a hotel.\n\nOur marriage is really happy. I’m so glad I married an adult instead of an attention-seeking baby who gets jealous when I have to give my children my full attention.", "I know I can’t, I said that, but that doesn’t mean a call couldn’t have waited the half an hour or so dinner would’ve taken. \nOp is TA for agreeing to go on a trip that she says herself was important to her husband and then ignore him and his reasonable requests for a dinner without interruptions to check up, it’s not as if he banned all calls completely.", "Because OP called twice in the space of probably an hour. That’s not normal", "It feels like no one answering this lady has kids. My heart still breaks when my kids cry, and it’s hard when it’s your first baby and you’re not there to help them when they need help. Shit, my husband would call a second time himself. I left my 6 year old and my moms and she cried when I left and I called 10 minutes after (with my husband who also wanted to call) to make sure she was okay and stopped crying. It’s totally okay to care about your kids when they are upset, id be concerned if she wasn’t. In fact, I’m concerned that her husband seems entirely disinterested in how his kid is fairing for 3 days. 3 days is a long time for a first trip away for the baby AND for mom. I mean for reference 8 months old, they might just have started crawling, they aren’t talking, they’ve only recently started sitting up completely unassisted. Baby is still taking breast milk/formula. They are still so little. He should have been more supportive of his wife, and she should have spoken up if she wasn’t comfortable going, but it sounds like he pushed.", "Agree to disagree.", "Did you miss the second line of the post?\n\n>I didn’t want to go as our baby is only 8 months and being away from him for more than a few hours and a plane ride away made me feel anxious but going on the trip was important to my husband so I agreed to go.", "Yeah I also have a 10 month old and there isn't anything that could get me to drop her off somewhere for half a week. \n\nIm even nervous because she's going to a babysitter for a couple hours so I can go get my hair done. \n\nBut that's how Op should have been allowed to do things. An hour here or there to get groceries. Not 3 nights before she was ready. \n\n\"But the husband needs husband time\" sure. Than go to a three hour movie. Or have MIL take the baby for a single night. He signed up to be a parent too. And I literally don't know anyone who did overnights away until after the first year.", "Sounds like bullied. \"It was so important to him\". She didn't want to go, and baby went to his mom. This was about him.", "Do you not understand how emotional bullying works? He’s laid it on thick about how much time she spends with the baby and how he needs attention too. He’s made her feel guilty.\n\nShe could say no, except he’ll only be more emotionally abusive until she feels so bad she gives in.", "Parents having PPD isn’t an excuse to not be a good parent lmao.\n\nAnd being an obsessive parent certainly isn’t healthy. \n\nYour mental health is basically irrelevant when ur a parent. It’s your job to fix it. Get on meds, go to therapy, go biking idc. You get 0 excuses with ur kids. Cuz ur kid isn’t at fault and ur responsible for them. End of story.", "OP isn’t even obsessive. Her baby is under 1 and she didn’t want to leave him behind anyway. Her behaviour is more reasonable than you think. Her husband is an AH.", "YTA. Postpartum anxiety is a bitch. Mine developed into general anxiety but only about my kid. Your kid was in good hands, your MIL even entertained you by answering every one of your calls, but calling twice during dinner because \"he was crying the first time\" is extreme. Babies cry, freaking out doesn't help. I'm confused why you couldn't just shoot them a text instead of calling every 2 minutes.  You're going to push your husband away.", "So very softly YTA. Two calls in one dinner session is a lot. Next time you go out like this without your baby, set specific times to call. Being a first time mom is hard, I get the mom anxiety,  but it's not good for you, your baby, of your marriage.", "I know everyone is saying YTA…but postpartum anxiety and depression is a real thing. While it is normal to worry about your child when you are far away for the first time, the fact that it interfered significantly with your experience with your husband and your trip is concerning. Please get help, so you can reconnect with your husband and build a healthy connection with your son as he grows up.", "NTA bordering on N A H\nYou sound like you have postpartum anxiety (or regular old anxiety) and you need to get that checked out so you can get help for it. Your husband and in-laws are kinda AHs for not recognizing the signs.", "Ok I have a question for those saying she’s TA for calling MIL so often and for not spending more time away from her child: have you had a baby? \n\nWell I have, and leaving an 8 month old for 3 DAYS is a LOT for a SAHM. Yes ofc you can be a mom and “have your own identity” but when they’re this little and this helpless and can’t communicate except by crying, it’s up to mom to decide when she’s ready to have “alone time”. It’s no one else’s call. Dad should not have put her in the position of having to decide between him and the baby. That’s just setting everyone up to fail.", "NTA. There are a lot of people saying that if you didn’t trust your in-laws to take care of your baby then you shouldn’t have left him with them. From experience, I don’t think it’s a trust issue, it’s an anxiety issue. And I get that the first time you called your baby was crying and sometimes that’s triggering. I don’t know if you nurse but hearing my baby cry would always trigger me mentally and physically and sometimes, I would call back to see if he was OK. It’s not that OP thinks that her in-laws are torturing the baby, she just needs to check for her own peace of mind because clearly she has some major anxiety being away from her child.", "NTA you were having anxiety.  You were being a pain on the ass", "It seems you were bullied into this. 3 days is a very long time for the first trip away from your 8 month old. Your husband is the AH for the way he’s behaved.", "YTA but kinda lightly. YTA for obsessively calling, not for being worried. You’re a new mom. That being said your husband has every right to be upset and I would take great insult to the comment that “you only came to please him,” when it was supposed to be a trip for the two of you. Your husband is going to start feeling neglected if he doesn’t already.", "YTA\n\nI’m going to tell you something that was said to me as a new mom that was hard as hell to understand in the fog of new motherhood but is actually really important:\n\nYour kids will always be of paramount importance in your life but unless you want to be a single mom, you need to realize that your partner should also be a priority.\n\nYes, kids are kind of apparently all consuming but they really shouldn’t be. Making space for your partner and your relationship is really important for the future health of that relationship. And remember, someday that baby will be all grown and put of the nest and then what happens?", "I’m not going to say YTA but for voting I think that’s what it needs to be. It wasn’t the calling multiple time, it was the calling in excess. You can’t be whole or present with your husband. This is going to have severe issues in your marriage as you can see now. Your baby isn’t a newborn. I really think you need to get scanned for PPD or PPA. While leaving your kid for the first time is hard, you also need to exist outside of ‘mom’ you need to exist for your husband if you don’t want your marriage to fail. You need to exist for yourself and your behavior is not healthy.", "I'm going to go with NAH. As a mom with a 6 month old and anxiety, I can empathize with you. I'm not ready to leave my child overnight. Your husband wanted quality time together after 8 months into this very different and challenging life stage, which I can also emphasize with. \n\nI think you all had good intentions, but maybe went too big with this 3-day trip. I'd suggest exercising compassion towards each other's feelings and needs, and keeping to shorter trips for a while. Also,  thank your mil and apologize for your anxiety getting the best of you. It likely wasn't a lack of trust on your part. For me at least, my anxiety is a physical reaction. My mind can respond with logic and know my anxiety is over- the-top, by my heart races and my chest feels tight until I check in on whatever is causing my anxiety. Take care of yourself and your family and be well, mama.", "NTA you should have maintained a no for the trip though. I had zero interest in being away from my kids until they were toddlers, so overnights had to wait a few years. No regrets.", "YTA\n\nYou need therapy", "YTA.\nTwice.. and you're wondering why he's upset.", "YTA\n\nYou are so focused on your role of “mom” you are neglecting your role as “wife”. Your husband wanted to spend one-on-one time with you on this trip, and instead you obsessively called your MIL about the baby who was definitely fine (babies cry, not a big deal, I’m sure your MIL knows how to handle a crying baby considering she had her own kids). Not only did you probably irritate the hell out of your MIL, you gave no priority to your husband who wanted you to be present in the moment with him and spend time together. Keep this up and your relationship is going to fall apart. Not healthy for your marriage at all. Time to apologize and start going on dates with your husband and giving your time as a couple extra attention and care.", "NTA. He ignored you when you said you were not comfortable leaving. 8 months is not that long in the grand scheme of things. Your body is still healing from the birth. You just don’t bounce back. Anyone saying you were ignoring your husband’s needs don’t seem to get that he ignored yours big time. You did the best you could in the situation. Give him a cape and let him be super mad. I would have called when I wanted to. Even during dinner.", "NTA. You got scared because you felt that you were too far away from your baby. It would be better if you had insisted on staying home in the first place, but you were being pressured to go, so you thought maybe you were wrong to feel that way and you relented. Also, it probably surprised you just how strongly you felt. I am one of those moms who could not leave my children for more than a few hours—certainly not over night—until they were at least a few years old. And then I was fine. Both daughters grew up to be very independent and I was never over-protective in any general way. But when they were little like that—every instinct in my body told me to stay with them.", "Look it’s your first baby. It’s hard leaving them for the first time. But the baby is with his parents. You’re constantly calling which makes everyone feel like you trust no one. And then you weren’t engaged with your husband because you were too distracted with worry about the baby. You need to apologize to your husband and tell him you weren’t prepared for the anxiety you were experiencing being away from the baby and you handled it poorly.", "YTA. Calling two times in the middle of a dinner is ridiculous. Newsflash your in laws have done this parenting stuff before. If something was wrong they would’ve called.", "YTA…you called TWICE during the course of 1 dinner?! You’re a little obsessive don’t you think? I understand the worry about leaving on a trip with a child under 1 but you are showing that you don’t trust your in laws to take care of their grandchild given how frequently you called on a 3 day trip. You should only be concerned if they ever gave you a reason to be but if not, you have to trust your son is well taken care of. Calling once an evening to check in on how the day went, etc I think is more than fine but calling all times of the day and many times is too much.", "YTA - I was with you until you got to the point of explaining that you left the table twice during a single meal to call.", "You obviously weren't ready yet to leave the baby behind for a few days and that's totally forgivable in my opinion.\n\nNTA", "YTA. If you did not want to go then you should have put on your big girl pants and stood up for yourself. Tell your husband you were not ready. Calling twice during dinner is excessive since you are already miles away and what more can you do from where you are other than irritate the hell out of the caretaker. Babies cry and unless your in laws are totally incapable, they have it under control.", "INFO: how many times did you call?", "wait till you get to the terrible 2’s and they cry bc of reality", "OP - if you were providing your very best care to an infant would YOU enjoy call after call after call second guessing your ability to keep a baby alive and happy for three days? No, you’d be annoyed AF. So why can’t you understand how your behavior towards MIL is wrong? Not to mention your overcontrolling behavior is stopping MIL from providing said good care because she’s too busy fielding your phone calls and repeating the same answers. You’re a mom now, try harder to practice good mental health. This isn’t it. Therapy works best.", "NTA. It was your first time away from your baby. It's only normal to be worried about them. I video chatted with my daughter a lot the first time I went away without her. Don't let anyone make you feel bad about missing your baby.", "NAH - you have post partum anxiety. Please get some help, it won't get better on it's own.  ❤️", "Gentle YTA. Your son is growing up. He needs to bond with his extended family and was in good hands. What are you going to do when he goes to school in a few years? How is he going to make friends if you don’t allow him to go over to other kids’ homes? Yes he’s still little but you need to talk to your physician about then anxiety before you wreck your relationship with your husband and wind up with a dependent momma’s boy who will be living in your basement in his 30s without any future.", "It’s completely normal to have anxiety being away from your baby for the first time. All mothers experience it, yours was a bit more severe but doesn’t change anything. It’s not something your husband would understand and I’m pretty sure his mother was annoyed but it’s your child. Having severe  anxiety being away from your child as a first time mom is a real thing.", "As a mom who had PPD and PPA I get it but you made several asshole moves here, OP. The PPD/PPA side of things doesn’t excuse assholery. YTA.", "YTA, but mild. You seem to be having some separation anxiety that you should probably look into. Sometimes babies have separation anxiety and there's nothing a mother can do about that, but when it's the mother having separation anxiety, that's an issue that CAN have something done about it. \n\nIf in eight months you've never permitted yourself to even go grocery shopping without your kid in tow and allowing someone to watch the infant for a few hours, even to give yourself some \"me\" time, then it's a deeper seeded issue you need to address before your normal relationships start building resentment. \n\nIt's perfectly fine to call/text in the evening to see how mother in law is doing, but to call multiple times a day and twice during a single dinner is an anxiety that you're not recognizing, and I think being given an A-hole score isn't going to help you, but if it's the only thing that will make you recognize you have a problem you need to address, then you need to take this post as a wake-up call and get yourself some help with your separation anxiety issues over your baby.", "I'm not going to pass judgement. I can see both sides...but only from the lense of \"you have postpartum anxiety\" which I know a thing or two about. Outside of that reality, you made the vacation and dinner uncomfortable for your husband and I don't blame him. You should probably talk to your doctor about doing a post-partum mental health assessment. It can last for years.", "NTA. People saying Y T A don't know or don't care about anxiety. Your husband should have been more empathetic and supportive too. It was just too long, too far away, too soon. You will do better in the future.", "NAH. It sounds like you’re really struggling to be away from your baby. And you and husband aren’t communicating well about this stress.", "YTA.\nYou are being a helicopter parent. If you continue to do that throughout your kid's life, not giving him any freedom to be away from you, he will either grow to resent you or not learn to live without you. \n\nYou are also going to push a wedge between you and your in-laws.\n\nYou need to not be so paranoid and calm down.\n\nEdit: Consider some counseling or therapy. As other people pointed out, it could be post-partum anxiety.", "Pretty sure she said that she didn’t want to and also I bet she didn’t realise how hard it would be.", "This is the only right answer. \n\nESH.", "My kid's just about the same age as in the post. If my wife couldn't go out to dinner with me without having to obsessively check on the baby, I'd be pretty annoyed. Just because you also did a behavior doesn't make that behavior normal or healthy.", "I only agreed to let my daughter sleepover my in-laws for ONE night at 8 months because we had moved across the road from them. Before that? No way. \n\nAnd now at 2 years old, the max she can sleepover is two or three nights. Even then, she comes back home in the day to be with me. My in-laws fetch her in the evening. \n\nTo be somewhere that's a plane ride away? A hard & definite no, even at 2 years old. \n\nNTA, at all!", "I was thinking along the same lines, the calls sound like they’re bordering on obsessive which is a little beyond run of the mill mum away from child anxiety", "How so?", "So she shouldn’t prioritize herself over her husband wtf", "Just for the record, I never stated that I engaged in that behavior; nor do I believe that “just because I do it, it’s healthy.” I said that her anxiety and worry makes sense.", "Wait for baby number two, OP. You’ll barely turn your head when he falls off the bed.", "[deleted]", "Babies cry for any reason and no reason. I was giving my daughter a bath last night, took her diaper off, started bawling. But then she got in the bath, she started splashing and was happy as could be. But then it was time to get out of the bath, and once again, she lost it. \n\nYou know the problem? She was tired. It was time to go to bed. Babies cry, and that's just a fact you have to live with as a parent.", "Are you a mother?", "What is being a 100% parent mean can you explain?", "[deleted]", "It was in response to the sentence that follows below that a fellow Redditor said.  “OP, you are still a person with an identity that is not wholly described by \"mother.\"- And my responses are based on this if that helps explain it better.", "It's really cute when childless people have strong options about this stuff. Please never put a child and partner through the firemage007 parenting experience, you sound like a nightmare.", "INFO: was there any trauma during pregnancy and birth, or any serious illness prior to this trip? What's the anxiety stemming from?", "Esh except inlaws, OP I'd really reccomend looking into getting help for your anxiety, I've never had children so I cannot understand your experience but I do have a severe anxiety disorder and you seem to be really anxious and it is affecting your life and your husband is a bit insensitive but he seems to be wanting time with you just not being understanding necessarily. Anxiety can be helped, I wish you luck and wonderful times with your kiddo and family <3", "Yta. Your baby wasn’t alone. And the fact that you left a dinner twice to call- what is wrong with you?", "NTA\n\nDo not listen to anyone who makes you feel bad for missing and wanting to connect with your baby. They are wrong! You are just being a good mama.", "YTA—your calling was obsessive and ruined the trip for your husband. Your MIL presumably raised at least one child and is capable of taking care of your son. It’s fine to check in but you went way overboard, especially during dinner.", "Yes YTA for agreeing to a trip you weren’t comfortable with and then calling your in laws nonstop. It’s good to take time away. We did for the first time around 8/9 months but would’ve done so much sooner if not for covid concerns. Everyone is different, but you need to take some time for yourself and your marriage too.", "ESH - your husband shouldn't have forced the issue. There's no way I'd be comfortable leaving an 8 month old with someone else for three days. However, did he force this because he wants your attention? Calling multiple times during a single dinner is over the top so you probably need to address your anxiety in that regard. If you had been in the same city and just gone out for a couple hours would you have called as much?\n\nThere are some larger issues here, but honestly I'm baffled at the idea of leaving a kid who is under a year old with someone else for multiple days.", "YTA. That’s obsessive behaviour. I’m embarrassed for you. Will you be attending school with him everyday also? On dates? When he loses his virginity? My mistake. You won’t let him go on dates. 🤦🏻‍♀️", "ESH \n\nOP, you should’ve stood your ground and not have taken the trip. Your anxiety is understandable, but your behavior was excessive.\n\nYour husband should’ve understood that you did not want to leave your eight month old baby.", "NTA. You are allowed to feel anxious about leaving your infant alone, you call 500 times if you want to. Everyone saying that you overreacted is underreacting.", "I’m going against the grain but NTA.  \nI get where everyone is coming from with the excess of the calls but from experience it’s sounds like PPA and that is no joke. Definitely see someone about it and try to get on some medication it helped me so much.  Again though I don’t think you are the A H I just think you need help.", "NAH. This was me, especially with my first. I then got treated for post partum anxiety and it made a huge difference. My husband couldn’t understand what I was going through until I could understand it and with the help of a therapist I was able to work with him through it. He just saw a fixation on the baby. The second time around I knew to just get treated.", "I don’t think your an AH. A few years ago we left our 3 yr old son with my parents for 5 days and went on vaca. We called once a day and it was obv my mom was a little irritated we didn’t trust her. It was a fun vaca, but a little awkward for everyone so we haven’t done that again.", "NTA - I would not have been able to resist calling either at that point PP but I’m also quite sure I was suffering from PPA. Probably worth calling your OB for some guidance, they can certainly help!", "YTA\n\nSeriously you are allowed to be away from your child for a couple of nights. This anxiety is not healthy, your adult relationship with your husband is really important, every couple should have adult time together without your children even if they are still a baby.\n\nTo be a great parent and partner you have to care for yourself and your relationships. This also sometimes means adult alone time. You have to trust those around you to be capable adults who know how to look after a child, after all your MiL did it OK the first time around.", "I' going to go against the grain here, and say NTA. You are a first-time mother. I was too, once, and leaving the baby was something that was very very hard for me. Oh sure, I could do it for a few hours, but for a few days? No way. She was my baby! She grew inside my body! To be away from her was like being away from a part of myself. Unlike most Redditors here, I understand where you are coming from. Take a deep breath, though, it's going to be okay. You two are tight. And welcome to motherhood. It's a wild ride.", "NTA it was clearly too soon for you, your husband should be understanding of that.", "NTA, that's 8mo baby. I'd be more concerned if you weren't fretting about him.", "NAH. Please talk to your doctor or a therapist. It sounds like you’re struggling and you deserve support. You deserve to be able to enjoy your time away from your child.", "YTA. And a ridiculous helicopter mother.", "ESH. Husband has a right to want to spend time with his spouse. She has a right not to be ready. You both suck because you both, from this story, are not communicating with each other. \n\nExplain to him the anxiety you are feeling. A lot of people in the sub are basing it off their own experience or even their lack of. Your hormones are all over the place, post partum isn't just one flavor. You have to become used to the possibility of being away from your son a little bit. Obviously this cold turkey method isn't for you. Take it step by step but communicate to your husband. 5 hours to 3 days is a scary jump.  I get it. You both had this baby, as a unit (maybe?), start slipping back into communicating again as a unit.\n\nEdit: Spelling", "People calling you TA have no idea what it’s like to have extreme separation anxiety from your baby. It gets easier as they get older but 8 months is still so early. I wouldn’t have been able to go and think I would be in the same boat.", "NAH\n\nYou aren't ready and need to figure out why you are SO anxious about leaving your son with supposedly trustworthy people. \n\nYour husband is probably starved for attention and wanted a few days COMPLETELY away from your kid so you would be more likely to actually interact with him. \n\nAre you and him doing anything, just the two of you, when you're at home? Where you aren't calling the babysitter, or talking about your child the whole time you are supposed to be spending time with him?", "I mean it really depends on the mother in law and your relationship with her. This is a specific situation type thing.", "YTA wtf you left a professional dinner twice because \\*checks notes\\* a baby was crying? Babies cry. That's literally all you do. Are you gonna do this when he goes to school? your mil clearly knows how to take care of children, and 1. you're telling her that you don't trust her and she's never gonna wanna watch him for you again, but you're also telling your husband that you don't respect him, his coworkers, or his special time with you.", "YTA. I also want to point out the OP never replied when she was asked if she told her husband that she didn't want to travel and explained that she was anxious. \n\nIt sounds like she kept her anxiety to herself, went on the trip to please him and then threw that in his face and was extremely clingy and controlling to the in-laws. \n\nNext time stay at home OP, no one can force you to travel and leave your baby against your will. It's best to stay at home than to behave like this.", "Her husband is an adult. The baby is a baby. Gimme a break.", "Where does is say she was forced?\n\nShe is an adult; she can say no.", "The difference is the obsessive calling. Of course it’s normal to call and check on your child! Like she’s a first time mom, of course she’s going to worry. But calling so much she walked away from dinner twice!? What does that mean for the rest of the trip when she wasn’t even distracted being out with other people!? She must’ve called way too much.", "Don’t forget to take time for yourself, mom! I have a 9 month old and only recently starting detaching from my little one more and more. We got a babysitter just so I can have a few hours of time to poop, shower, grocery shop, etc. without having to worry about baby. You wouldn’t believe how much better it can make you feel mentally to have a small break. Baby loves spending time with the babysitter and then we both get super happy when we see each other again. It’s almost like we have a nice little break that makes us appreciate the time we spend together more.", "Not only that, but calling so much is actively hindering MIL from tending to the crying baby!", "OP needs to learn to self soothe and not give in to the anxiety and worry. Notice that OP said they left their baby alone. That's anxiety talking.", "I was hoping someone would write that so I don't have to be the only weirdo that would never leave such small baby for so long, except for an emergency.\nNTA, the husband is TA for forcing OP into this and not being understanding for her feelings, that are completely normal for a young mother.", "Came here to say this! He shouldn't have made her go on a multi-day trip that required flying before she was ready. While I agree, the amount of times she called is excessive, the desire to check in that often is sooo strong! The first weekend I spent away from my baby was for my friend's Bachelorette trip. While everyone else took a 30 minute ferry to the destination, I drove 2 hours in my car to make sure I could leave at a moments notice. Knowing that I had a way back on a time table that I could control, helped me relax and enjoy myself with friends.", "Not only overnight but a PLANE TRIP away from them. If there's an emergency it would take hours to get back to them. I don't blame her a bit for being anxious. NTA", "I thought that too. It’s obsessive unless you have PPA then it’s pathological and needs assistance", "This is not PPA, but natural motherly instinct. The child is to young to be left without parents for so long.", "You don't value husbands that much, now do you? The husband was worried about their relationship, and yes, even mothers should take that into account. She needs therapy.", "I didn't manage to leave for 3 days until my babies were almost 3. I nursed them until they were 2 1/2 and they were garbage sleepers. I didn't want anyone else to have to deal with that.", "I have two teens. I didn't leave them overnight except when the youngest was born until they were 7 or 8. My husband and I have been together 22 years so it obviously didn't affect us.", "No one you know has *ever* traveled without their kid before 8 months of age? You don't know any moms who work corporate jobs? I would have considered traveling without my kid if it hadn't been COVID. Would have been nice to get a full night of sleep, honestly.", "I know lots of people who have gone away for a couple of nights when there babies were younger than 8 months.", "8 months old is plenty old enough to stay with relatives for a day or two while mom and dad do something else. \n\nI see a mom who is developing an unhealthy, obsessive attachment to her child.", "Because her worry is preventing her from being able to function in a healthy manner. The family friend I mentioned was diagnosed because she was constantly hovering over her baby afraid they were going to die if she wasn't watching them 24/7 (she was a medical examiner and had seen several dead babies / children). Seeking treatment lowered her stress levels and allowed her to enjoy motherhood more.", "This was a mom pushed to do something she didn't want. However, she should be checked for post partum. From my experience, I had the same obsessive pattern with my son. It took me getting on medication to lower the obsession I had. I mean if I was away for 2-3 hours I'd call his father to check on him or stop by the daycare. Loving your child is fine. Obsessing over them to the point I was is not.", "I agree! I am child free and sympathize with OP. Her husband sounds like kind of a jerk!", "You were around your daughter, so that was different. You saw that she was crying for no reason. This lady was a plane ride away, hearing her 8-month-old baby cry through a phone. Have some sympathy. It's insane to go from a one-night stay to a three-day stay.", "This is one instance. Her first time being away from her child and she was away for 3 days. Having anxiety about being away from your child for the first time is normal. Active mothers don’t take 3 days away from their baby as a first time away. This isn’t a constant thing, this isn’t like she’s taking drugs. She wouldn’t have known it would affect her the way it did if she’s never been away from her child."]}