{"id": 3831, "submission_id": "zb8f1n", "title": "AITA for not having the waiter correct our bill at an expensive restaurant?", "selftext": "It’s actually my husband, we deliberated on what to do but ultimately he was paying so I told him he gets to decide. We went to a nice restaurant and the bill should have been over $200 but when they brought it, it said $38. We were obviously shocked. I felt really bad like we should tell them, but my husband and cousin said it’s their fault, they should’ve seen it. So he put the card with the bill and the waiter didn’t come back and say oh I noticed we messed up your bill or anything, they just charged what the bill said. But I’m wondering what other people would have done. Since we didn’t have to pay so much we ended up leaving a really good tip.\n\nEdit: I did want to add that it’s not a typical kind of restaurant with one waiter. We were served by like 5 different people. So hopefully that will keep any waiter from getting in trouble, I didn’t even know that was a possibility as I have never worked in food service, only retail.", "created_utc": 1670044499, "permalink": "/r/AmItheAsshole/comments/zb8f1n/aita_for_not_having_the_waiter_correct_our_bill/", "score": 62, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > We did not notify the waiter that we were billed incorrectly and, therefore, only paid a fraction of what we should have.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA why would you want to weasel out of paying what you rightfully owe? It’s not suddenly ok to steal just because it’s from someone you think can afford the hit. People with good morals don’t do shit like this.", "YTA\n\nMy thinking about this has changed over the years. Yes it’s the restaurana fault but at bottom, you’re taking something that wasn’t meant for you. I didn’t care when I was younger but I pride myself in doing right by other people more now.", "If you're in a financial position that a $200 meal out is a reasonable expenditure it seems pretty rich to be all tee hee, I thought we were taking money from the wealthy owners pockets, not front line staff while not recognizing for tons of people you're an equivalent to those wealthy owners. Would it be acceptable for someone to rip you off given the circumstances and their perception of your financial situation? I'd argue not and that y'all are thieves and yta.", "YTA; Your husband is a bigger one. \n\n1. if you ask for something and enjoy it the honorable thing to do is pay the correct amount for it. \n2. the waiter or waiter's will probably have to make up the difference and chances are your husband didn't tip on the correct amount either to defray the cost\n3. Just because they made a mistake (have you never?) doesn't make it right to take advantage of them. \n\nDoesn't matter if it was a privately owned restaurant or a multi national chain, right is right and wrong is wrong. You wouldn't be asking if you didn't already know it was wrong.  I'm sure the same people who will put their own hair in the food or pride themselves on cheating a restaurant out of a free meal will disagree with me.", "YTA. That’s theft.", "YTA  You knew the bill was incorrect, and you said nothing.  That is called theft.  Someone paid the tab for your extravagant meal....likely someone on the waitstaff.  It came out of someone's pay.....your meal cost someone else money out of their pocket.  \n\nI wouldn't feel very good about doing this, knowing that someone got unfairly stuck with the bill for food you ate and enjoyed.", "YTA.  No \"deliberation\" is needed in such a situation.  Any decent person should immediately call out the error and have the restaurant correct it.", "YTA. So are your husband and cousin. The staff made a mistake but you all lied on purpose. You should go back to the restaurant and pay what you owe. You keep trying to reassure yourself that it isn't a big deal but the waiters will end up losing money because of your lie. They're not the ones who own that big restaurant. They're just trying to earn a living. I bet if they overcharged you then your husband and cousin wouldn't hesitate to say something. What you all did was wrong.", "YTA \n\nYou correct the bill. Period. You are stealing.\n\nYou enjoyed the restaurant’s atmosphere, ordered your meals, and ate and enjoyed them. You should pay for the service and the food. It’s not about local restaurant vs. big food chain or anything. It’s about honesty and paying for what you got. The chef, waiters and other staff need to get paid and food needs to be bought. \n\nSomeone made a mistake along the way, and so you, as adults, who noticed it, fix it. Call the restaurant or go back and pay. \n\nThe waiter or others may even have to cover for your dishonesty depending on the restaurant.", "YTA, Just because you can doesn't mean you should. \n\nLet the the server know about it and let them make the call about whether or not they want to correct it.", "YTA.  You were dishonest.  You know what you should have paid.  Instead you stole.  I miss when honor was important.  If it had been the other way, you would have demanded they not overcharge you.  You agreed to pay the amount listed in the menu when you ordered.  It’s the staff that will get squeezed in this.  Uncool.", "That waiter will get in trouble because you all refused to be honest. The tip won't make up for it.", "YTA. Where I worked, if a manager (and likely would) see that they would assume i was giving you free things, I'd get in trouble for that first. Once I proved i wasn't, they would have me put my tips towards the cost of the bill, maybe even making me pay the rest of the bill. What an AH move, you don't get to say, sorry, I didn't know. You know stealing is wrong, sooo...", "YTA... it's most likely they gave you the wrong table's bill, which means when they go to bring that table their bill the restaurant  is going to have to eat the difference,  which is ultimately going to come back on the server.\n\nI've had it happen when I was serving and it sucks.", "You can put your money (literally) where your mouth is and do the right thing. Call the restaurant and tell them you noticed the mistake on the bill and offer to rectify it. \n\nor\n\nYou can make all the excuse you need to make your self feel like you and your husband aren't huge AH's an do nothing like you have been.", "If the restaurant had charged you more would you have paid without a question? Use the same logic and arrive at your conclusion. YTA.", "YTA. You ordered expensive food but didn't pay for it. That's theft. The wealth of the restaurant's owner is utterly irrelevant. You didn't pay for a product you consumed. Theft is wrong no matter who you're stealing from. It's just as wrong to steal from a rich person as from anyone else. And considering what others have said, that the waiter or manager is going to have to pay it, then the theft isn't even from that rich person. Which, by the way, most restaurant owners are not. Owning a small or medium sized business doesn't make the owner rich. Many of them struggle to pay the bills just like everyone else. Go back there, or call them, tell them what happened and make it right.", "YTA- \n\nThis sounds like you got handed the wrong bill... And you knew that... And you thought tee-hee guess we won't pay for our food and drink after all, how fun! \n\nAnd some waitstaff who made an error in the table number or grabbed the wrong check from a stack ended up paying the difference.... Which is going to suck for that person so bad... Especially because you had like five different servers so the person who handed you the bill likely had a mix up of either tabel number or which bill they handed you... \n\nYTA", "You stole. Plain and simple.", "Yes YTA, it was a bad thing to do. But my dad has same attitude, never correct a mistake in your favour in these situations", "YTA\n\nYou mentioned that multiple waiters were serving you.\n\nI'll tell you what probably happened from an admin point of view. One waiter took part of your order and another took another part of your order both opened different accounts on the point of sale system.\n\nWhen you asked to pay the waiter only took the bill from one of your accounts.\n\nYou ate your entire order. You know you didn't pay for it. Yes, they made a mistake, but you stole.\n\nThere's going to be a table on the restaurant point of sale with the rest of the bill that's unpaid.", "YTA\n\nI’ve been on the side where my cheaper meal was paid by someone else and had to wait half hour to pay for my meal while they fixed the issue so the waitress didn’t get into trouble. Pay your bill! \n\nMine was like $120 for a family of 4. Theirs was over $200 for their family of 4. They knew what they were doing. You really have to be shitty for doing this. Go back and pay your bill if you can’t comfortably offers $200 then don’t spend it", "I agree with everyone in here but there’s no way all these people would have fixed it. It’s like 100% against you. Everyone has had this happen in one form or another and no way 100% of commenters corrected it. That doesn’t make it ok, just know OP, this isn’t a real answer of what people would do but what you should do. \n\nBtw I wouldn’t have fixed it when I was younger but now I think the only you thing you really have is your integrity that can’t be taken away. So best to just do what’s right (whatever that means to you, but is pretty much the same for everyone).", "YTA.", "Just go back to the restaurant and pay the difference? Unless you love eating food that had been paid by a waitstaff’s salary cut? Shameful behaviour", "YTA. It’s unethical, plain and simple. You knew it was a mistake, and you took advantage for your own gain at the restaurant’s expense. Who knows, maybe someone actually got fired over this. Any which way, there were victims. There is no gray area here - that was theft.", "Teacher here, here’s my lecture. We talk to kids about integrity, making good choices when no one is watching. When you notice someone has integrity, it’s a sign they’re trustworthy, a good person to be friends with, someone you want in your life. It’s a characteristic that helps to develop a strong sense of self and enables one to be a valued community member. So, you lacked integrity in this instance. Not the end of the world, but don’t make a habit of it. It will erode the trust you have of yourself and impact how others see you.", "YTA. I believe in karma and you will end up losing a lot more than $200 soon.", "NAH. That’s a pretty big mistake, but it’s 100% on the restaurant. You were right to leave a good tip. Unfortunately though, if it were the waiters mistake they could’ve been held responsible. I worked at a restaurant with a terrible owner and he would’ve charged me the difference", "NAH, it’s the restaurant’s responsibility to charge you accurately not yours.", "lol i'm sure the restaurant will survive. NTA.", "YTA. Someones paid for that out of pocket. If the bill was higher you would have pointed it out, so do the same when its lower.", "YTA\n\nAlways do the right thing. Karma can be a bitch. That was a large mistake and you knew it. The right thing to do is to bring it to waiter's attention. What you did amounts to theft.\n\nI had a similar thing happen to me when I was entertaining business clients at a high end place. I let the waiter know. The manager came over to the table, thanked me for my honesty and told me that he applied a 20% discount to show his appreciation. Added bonus my clients were impressed and they called my boss the next day to say how much they appreciate doing business with someone that they can trust.", "Lol NTA at all, good for you \n\n- a former service industry worker and manager", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIt’s actually my husband, we deliberated on what to do but ultimately he was paying so I told him he gets to decide. We went to a nice restaurant and the bill should have been over $200 but when they brought it, it said $38. We were obviously shocked. I felt really bad like we should tell them, but my husband and cousin said it’s their fault, they should’ve seen it. So he put the card with the bill and the waiter didn’t come back and say oh I noticed we messed up your bill or anything, they just charged what the bill said. But I’m wondering what other people would have done. Since we didn’t have to pay so much we ended up leaving a really good tip.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA ..  thats theft.  You knew it was wrong and you didn't correct the matter. You benefited from it. Theif.", "YTA. You knew it was the wrong thing to do and you went ahead and did it anyway. Someone is going to pay for your dishonesty, and it’s not going to be the restaurant owner. Is getting over on the restaurant over an honest mistake really worth a waiter potentially losing that amount out of their tips, or even worse, being fired? No, it’s not. At least to honest, decent people. Imagine if that person needed the tips they would make that day to pay their utility bill and now have their power shut off because of you. Probably not the case, but not out of the realm of possibility. Also, if your husband is so quick to be dishonest in this situation, what else is he quick to be dishonest about?\n\nBottom line is this: it’s always the right thing to do the right thing.", "YTA. Customer did this to me once, and I didn’t get any tips the rest of the week to make the money back. I hadn’t even been serving them - I’d just taken the payment. \nHonestly - if they’d left ONE thing off your bill I could understand where you were coming from but OP, you’re talking about a $160+ difference! \nI hate to say it but you seem seriously naïve if you think that that amount of money isn’t going to be retrieved in some way from the restaurant staff.", "YTA stop justifying it you could have gotten people fired who knows you could always go back and pay", "Well let’s flip it around. If the bill should have been $38 and they charged you over $200 would you have just been like, oh well, and just paid it? No you would have demanded they correct it.", "If this was US, and the servers get tipped in lieu of decent wages, then I would  also assume you tipped as if the bill was $38 and if for nothing else that makes YTA. But the fact that those servers probably not only lost what you should have tipped but also probably had to pay back what you mistakenly were not charged for you, you may have really effected someone’s income.", "YTA someone working in that restaurant most likely paid for that. That means that they ended paying for serving you.", "YTA!! You need to work a job in food and retail to understand what it’s like to deal with people who don’t understand.", "YTA. This actually just happened to me at the mechanic, the guy forgot to charge for my oil change, and I noticed and corrected it right away. In turn he actually gave me a discount on the oil change for being honest. It doesn't take much to be a decent human being.", "YTA , borderline theft , Not to mention a single waiter or all the waiters could have possibly been charged out of pocket for that simple MISTAKE . How would you feel if someone came to your job and took advantage of a simple mistake you made to save a couple bucks ?\nI’d suggest McDonald’s as a better suited restaurant with attitudes like that .", "NTA - And I understand your dilemma. Every post after about the first 10 just want to jump on you and call you a thief. They all wish they were in your shoes. You could go back to the restaurant and tell them you didn't notice because your husband put the card with the bill. When you reviewed your statement that's when you caught it. This choice is up to you. Sorry people are so ugly to you.", "If you didn't know, it was an accident.\n\nIf you did, it's a crime of opportunity. Although it is not as bad as joyriding a car left running.", "If it's something soulless chain store owned by some conglomerate, I usually won't say anything. Like I probably wouldnt say anything if the dude checking me out at Kroger rang up poblano peppers as jalapeños saving me like 75 cents. But if it's small store or restaurant, I always point out their mistake and ask them to adjust the bill. Especially if they undercharge alcohol. I hate to stiff a small joint out of one of their most profitable items.", "I do get this and agree with it. My husband pointed out that it’s a big business that makes a ton of money, so the rich person isn’t going to be hurt by this, but if it was like a ma and pop shop then he definitely would’ve said something.", "What is with everyone in these comments assuming things? We can’t usually afford things like this but it was a very special occasion we were celebrating and put aside money for.", "I 100% agree with the first thing you said, because the food in my opinion was worth every penny. He actually paid almost twice the tip he would have if he did 20% of the correct cost, I hate that everyone keeps assuming even more negative things because of this, this is the first time we have been faced with a dilemma like this. We aren’t bad people, just made a bad choice.", "Someone else said that too. I don’t quite understand how it’s straight up theft, considering they are the ones that made and handed us the bill and then when we gave them our card they had the opportunity to come back and tell us they made a mistake but they didn’t. I can see it as taking advantage of someone’s mistake but I don’t see it the same as like pick-pocketing or robbery", "We assumed it would be coming out of the wealthy restaurant owners paycheck which didn’t feel as bad, even though it is, just Certainly not as bad as coming out of the waitstaffs pay! That would be awful and I really hope it doesn’t. But I do see what you’re saying. It puts it into perspective when you say it like that. Although I will disagree with calling it theft, I think theft is a strong word for not correcting someone’s mistake.", "You’re right, if they overcharged, we definitely would’ve said something, that’s a good point. I’m not necessarily trying to reassure myself, I just am trying to understand y’all’s side and my husband point of view. I think also it’s not a sure thing it would come out of the waiters paychecks. Also we didn’t lie, we just didn’t say anything when they made a mistake which I would say is just more withholding information. Still not good, but not as bad as lying.", "This would’ve been the best choice", "I’m honestly glad you told me this cuz I really didn’t know, despite what you and everyone else thinks.", "Waited tables. This is exactly what happened. The chefs and the bar won't make anything without a ticket, and a ticket only gets created when the order is added to a table. The server could potentially lose their job over this if it wasn't their first time. OP is a major AH and stole from the restaurant.", "Oh no I really hope that doesn’t happen!", "This is our views too. This restaurant is like in between, so it felt like a grey area morally. But ultimately I think it would’ve been better to pay.", "I get that inclination but then being a big business doesn’t make it better or more moral.  It’s not about whether you could use the money more or otherwise you could justify a full on dine n dash. It’s about how you want to conduct yourself. You should not want to steal, you should want to pay your own way, not take advantage of anybody, good or bad, etc.", "The restaurant may be a big business, but the difference in the bill will come out of the waiter's tips (at least, that's how it usually works, according to friends who work in the service industry). So that could mean that the waiter(s) who served you end up making no money after a whole night of work.\n\nIt won't make a difference to the restaurant owner. It will make a difference to the minimum wage servers, though. YTA.", "Don’t worry they will just fire the server", "Doesn't matter if it's big business or not.  The company doesn't write off the loss.  It deducts it from the wages of whoever was responsible for not noticing the mistake.  The server, or the shift manager.  Don't delude yourself into thinking the company ate the loss.  That is the problem with doing this kind of thing.  Someone with a whole lot less money than you and your hubby ended up paying dearly for that mistake.  What you did was wrong, so please don't attempt to justify it with pathetic excuses.  It was wrong, and you know it was.  Otherwise, guilt would not have brought you here.", "Same logic as saying \"sure I murdered that person, but they come from a large, wealthy family. They will be fine without one.\"", "The thing is that they could charge the waiter for it (or whoever is in charge of billing). So you're not stealing for huge conglomerate, you're stealing from poor person working in restaurant industry.", "Lots of people could never afford this, ever.   How would you feel if someone decided that you could afford to absorb a $200 loss because they were living hand-to-mouth and you have enough money to save up for restaurant outings?\n\nIt puts this incident in rather a different light, doesn’t it?   You are incredibly privileged to be able to afford to eat at this restaurant *even once*.  Imagine if someone stole from you because of that privilege.", "Because YOU assumed you were stealing from people who could naturally afford it because, well... why were you assuming that again? \n\nIdc what you can and can't afford, I have the luxury and blessing of being able to so on a whim if inclined. It doesn't make it acceptable for someone to rationalize stealing from me because of their perception of my financial situation though, does it? Or do you really not see the hypocrisy in your defensiveness here?", "Doesn't seem like it was much of a dilemma, they just went \"woot free stuff\" and stiffed the waiter. I get the impulse, but I couldn't live with myself if I had done that.  \n\nThe assumption that he hadn't tipped was just a judgement call on his actions with the bill. \n\nWhat I'm wondering is, if the food is really good, how will you be able to bring yourselves to eat there again knowing what you did to the poor waitstaff?", "You can try to bullshit your way around this with all the excuses in the world. Did you order the food and wine knowing what it would be? Did you consume it? And then you think somehow human error negates that, or absolves you of paying for what you actually ordered?\n\nHow would you feel knowing that the servers had to pay for it? Or look at your edit - ‘hopefully no one will get in trouble’. So, you may have impacted a server’s job because you saw some seedy way out of paying for your fancy $200 dinner.\n\nShame on you.", "Unjust enrichment - same as stealing.\n\nYTA.", "So if someone dropped their wallet in front of you in the street would ‘take advantage of their mistake’ and just take it for yourself? You don’t sound like good people", "Crimes of opportunity are still crimes. You can call it \"taking advantage of someone's mistake\" but at the end of the day, you knew for a fact that you ordered and ate over $200 worth of food and drink, and you only paid for $38 of it. As such, you deliberately stole over $150 of food and drink. \n\nLet me put it this way. If the restaurant had *over*charged you by $200 and you had failed to notice and they had failed to correct it, would you still have applied the same logic to *them*? Would you have just written that off as them \"taking advantage of someone's mistake\", since by your own logic *you* should have been the one to notice the incorrect price? After all, you would've had the opportunities to notice and correct it upon receiving the bill, putting down your card, *and* signing the receipt. Would that error be your fault or theirs? Would the restaraunt workers still be NTA in your opinion if they noticed the error and simply didn't tell you, since your overpaying would be advantageous to them? Or does that logic only apply to you?", "If you had kids, what would you teach them to do in this situation?  I don't live in the US, so a mistake wouldn't come out of the staffs paycheque, but it's still immoral.", "It's still theft. When I was 17, somehow the bank deposited $200 into my account. I was at the bank machine to take out my last $20 when I saw the over deposit. Thinking I won the lottery, I took it all out and spent it at the mall. The next day they figured out the mistake and when they went to rectify it, it wasn't there. I was called down to the bank, and I got a talking to by the manager, and was told I could be charged with theft, because I knew that money wasn't mine. I had to take back the stuff I bought, and borrow money to cover the shortfall.\nThis I a pretty much the same thing. You got someone else's bill, you knew you owed more, but you didn't say anything. You paid by bank card and it will be traceable. You should own up to it and go back and pay what you owe before they investigate it.", "You know the charges are incorrect.  You eat the expensive food, and never come clean that a mistake has been made and you didn't bother to be honest with the staff to point out the mistake.  That, my dear, is stealing.  No pretty way to reshape it.  And the staff who worked the register or the server, or perhaps even both ended up having to make up the difference because the drawer at the end of their shift came up short.  They are, indeed, responsible to make up the difference of the money missing from the coffers.", "What do you call it when you take something, error or not, without paying for it in full? I'm very curious.", "Go back and pay your bill. If not, your a thief", "It is theft.  You ate the food and used the service and did not pay for it!!!!!!", "You took something without paying your fair share. That's textbook theft.", "Nope, it's lying. You chose not to tell the truth so you lied and that is bad.", "You *are* trying to reassure yourself (and being very defensive) by repeatedly claiming that a lie of omission isn’t as bad as any other lie.", "They may have even been so thankful for your honesty and sent you another round of drinks or something. You could’ve left the restaurant feeling like you did something good for the waiter and the company. What goes around comes around, and you have left feeling guilty enough to ask Reddit. You still have the opportunity to call the restaurant and have them run your card for the right amount.", "I worked at mom and pop places where they for SURE would've made me pay the correct bill out of my tips that night before leaving and for corporate restaurants that would've done the same thing AND written me up for not doing my job right. Big business doesn't get hit in the pockets over $200. It's still the little guys. Mr./Mrs. \"I have 4 franchises, I'm rolling in $$\" will never even hear about something like this. It would be handled right there with that server, they pay the price.", "Are you going to go back and pay the difference now that you do know?", "if the tips are pooled and then split evenly between waitstaff then you might’ve also fucked over the waitstaff who has absolutely no part in the mistake", "If the till doesn't tally, the owner may think the waiter stole the money and fire them.", "I still don’t think it was your fault if that was the case", "Yeah that makes sense. I appreciate your input.", "I truly hope this is not the case. If I had even thought this was a possibility I definitely would’ve said something", "They really lower peoples hourly wage every time the company loses money? That’s what I’m not understanding. I’m truly asking because several people have said this. I mean Walmart doesn’t change their workers pay when people steal.", "It’s really hard to take criticism/advice from people who over-exaggerate. This is obviously no where near as big as murder. A wealthy person would be totally fine without $200. But I know that doesn’t mean what we did was right, just pointing out it’s very different from murder.", "It’s truly a disservice to you to assume things about people. We had a whole discussion/argument for a good 10 minutes before sticking the card in with the bill. He would’ve tipped either way, he just tipped way more. We never imagined it would hurt the waitstaff.", "This.\n\nYTA", "You do realize the point of this post was to find out if what we did was wrong, right? I have no reason to lie, I did not have any idea that it might affect the waiters in any way. I was always told that waiters are paid a very small hourly rate and then their tips, so I assumed the rest would have no bearing on their paychecks, only the business owners.", "Well I mean I do feel bad, I never wanted my husband to do it in the first place. But I’m not gonna sit here and agree that it’s the same as telling someone an untruth, if the waiter would’ve noticed we would’ve said oh yes of course change it. I think there is more grey area than people are allowing for.", "Even though it is illegal in most states to deduct mistakes from employees pay, you can Google and find that it is somehow still the norm to punish employees this way in the restaurant industry...", "And yet you didn’t. YTA", "I mean, sure, but as someone who's worked retail that's also a different kettle of fish because:\n\na) Walmart doesn't change the worker's pay *directly*, but they do change policies that affect the employees in a negative manner (like putting frequently shoplifted items in locking cases and making them have to take time away from other tasks to go unlock them) and often results in pay loss indirectly due to making them out to be \"less productive\" when it comes time for bonuses/promotions.\n\nb) They also ignore it *deliberately*, at least for the petty shit, because they're waiting for the shoplifter to either become a chronic enough problem or steal something valuable enough that they can hit them with the big charges.", "Yes, restaurants really do this.  They will find the person who was responsible for not catching the mistake or the one who added the numbers wrong, and it comes out of their pay.  A cashier who undercharges mistakenly will also have to make up the different in pay.  Both my kids worked in retail, and both had costs deducted from their pay if a mistake got by them.  Companies are so rich because they don't lose money from their own pockets.  It's the small workers who get the brunt of it.", "If lowering to zero counts then sure", "Luckily, I'm looking to be of service. It may be rude to make assumptions, however it's also natural to do so. \n\nOnce a cheater always a cheater is something not many people argue about. Same goes for thieves and cheapskates. So I don't think it was too far of a stretch.  \n\nI'm glad he at least tipped, but I doubt it was a $200 tip that would have made up for the difference.", "Got it. You are not a cheater. You are a 10 min later- cheater", "The fact that you discussed it for 10 minutes makes it even worse. You KNEW what you were doing is wrong", "Hundreds telling you, that you are in the wrong. Quit trying to justify your actions. You stole the money owed.", "So fucking fix it then.", "Everyone is telling you what you did is wrong. You're all mad because people are (rightfully) calling you a thief. If you're not one and if you're getting the clarification you sought are you going to go pay your tab today or?", "Waiters can often have to pay for discrepancies out of their pay. If your tip didn't cover the rest of the bill, the server who will get the blame might have to cover the cost. \n\nSo, are you calling them to fix the error or going in?", "I don't really see what's morally grey here. Sure, they messed up. Doesn't mean you didn't lie by omission and steal though. Multiple things can be true at the same time. YTA by the way, in case that was unclear. So is your husband actually.", "Listen, when I was younger <i used to work odd jobs. They would make you recount everything for any differences between what is expected to be in the money drawer and what really is there and you could be fired for pennies missing.\n\nwhat do you think will happen to someone with a 100+ $ mistake ?\n\nare you comfortable putting someone’s job in jeopardy ?", "Because they don’t enforce their rights. Nearly every state has some form of employment agencies were you can file grievances and actions at a much quicker rate and cheaper cost than litigation. But instead they’d rather take it and complain on Reddit", ">Both my kids worked in retail, and both had costs deducted from their pay if a mistake got by them.\n\nHow long ago did your kids work in retail?  I don’t know about the restaurant business, but that’s not [legal](https://www.dol.gov/agencies/whd/fact-sheets/6-flsa-retail) anymore.", "I honestly and truly did not know this", "And yet, it still happens, I've seen articles about it a lot recently"]}