{"id": 3840, "submission_id": "zbfgy6", "title": "AITA not letting my parents babysit anymore", "selftext": "My wife and I have two daughters, Julia (5) and Alina (17 months). I've always been close to my family, and my parents are really involved with my daughters. They've regularly babysat Julia since she was around 1, and then Alina too. Currently it's two or three times a week.\n\nI know that sounds like a lot, but it always seemed to be their choice. We were always able to afford normal childcare. Originally, that was the plan when my leave was finished.  However, my parents thought it was a waste since mum could watch them and they could spend time with their grandchild instead. The whole system happened because THEY asked for it. We do thank them, and appreciate it. Our girls are really close with them. \n\nHowever around 3 weeks ago I went over and overheard my parents complaining to my sister about it. Apparently we're being selfish and basically just pawning off our children. Basically abandoning our responsibility. I was pretty upset and we ended up arguing about it. They ended up saying that we're essentially shit parents who refuse to do our job. That we shouldn't just leave our children to them. But we literally only did that because they wanted to be there for the kids. We didn't bring it up or force it, and whenever they couldn't we've found backup options \n\nSince then we haven't left Julia or Alina with my parents. I have no interest in it after finding out how two-faced they were about it all. We've got a temporary alternative and are looking into more permanent options.\n\nLast week mum asked when we were going to have the kids over and I basically told her we weren't. I don't want to 'abandon my duty' and feel uncomfortable having my children around someone who thinks so little of my wife and I. I mean I definitely don't want our girls to start thinking we dont care. My parents are mad and think I'm being entitled and unreasonable, but I think it's a reasonable boundary. My sister has jumped in claiming I'm a horrible son and taking advantage of them, but they CLEARLY didn't think I should give my responsibility away to them, so I'm not. My wife is conflicted and I know Julia was really close to them so a part of me is worried my reaction is unreasonable and asshole-y. AITA here?", "created_utc": 1670071571, "permalink": "/r/AmItheAsshole/comments/zbfgy6/aita_not_letting_my_parents_babysit_anymore/", "score": 5232, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My daughters, especially Julia, are really close to them. And they have helped us so much over the years. I did react poorly, and it's possible I overreacted here and am taking them for granted. So finding alternate babysitting may be too much and asshole move.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your mom was talking crap behind your back to your sister, then blamed you when she got caught, then doubled down and accused you and your wife of bad parenting. If you could walk up and hear it, so can your kids. Stay strong. You are not wrong, she is.", "NTA it’s your choice since they are your kids and if your parents think your abandoning your responsibility as a parent they shouldn’t be mad that you rather stay with your kids then giving them to your parents", "NTA does mom know you heard her talking trash?  Maybe let her know how disappointed you are in her behavior. She needs to gets a clue and apologize for what she said.  She can't claim to want to watch those kids and then also claim to be a martyr for doing exactly that.", "NTA\n\nI think they like the martyr role and that's all. They did thid to themselves. \n\nIf you want, force them to admit, that it was their choice, publicly. After that they can have baby sitting time with the kids. Till them, they can suck on a onion.", "NTA. They made their bed they can sleep in it. If they wanted to keep seeing the kids but just less… they should’ve came to you about it, not bad mouthing you to your sister. That’s just shady.", "NTA. Sounds like they’re creating drama when there wasn’t any.", "NTA\n\nI would stipulate that periodically it is important to check in and make sure everyone is still happy with the arrangements made (just because they were eager to be a primary child care option doesn't mean they always were or didn't change their minds about how frequently they were ok watching the kids).\n\nThat being said they definitely need to understand that it isn't ok to put your children in the care of someone so convinced you are being bad parents by leaving the kids with them.  By her own words she has made it clear kids should not be left with her.\n\nYou can absolutely set boundaries for their involvement with the kids.  If they have any interactions at all they need to be supervised.  The grandparents will need to regain your trust to ensure that you as the kids' parents aren't being disrespected, especially in front of the kids.", "NTA Your parents sound like my mine. \n\nIf I've learned anything it's this:\n\nYou can't win with people like this. If you start letting the kids back, they'll complain you're taking advantage, if you don't you're keeping them from their grandchildren. \n\nIf it were me, I'd find a childcare provider and squash any further discussion of my parents babysitting. Otherwise, the argument will likely repeat itself.", "NTA, the reasonable compromise here is that they can see your kids *with you present* so you know they aren't running their mouths, until such a time that they sincerely apologize for being shitty and promise to actually communicate in the future.", "NTA. People like that are exhausting. You can't please them and they are a drain on you.", "NTA- It seems like somewhere along the past couple months there has been a breakdown in communication between you and your parents. You were always willing to afford Childcare if necessary, they seemed happy to help. Then all of a sudden they are chastising you for using them as regular childcare. I'm curious if they simply neglected to notify you that their patience was waning, or did you perhaps ignore any pleas? Maybe they were expecting some type of financial compensation? From the information we have though it seems like your parents just aren't being reasonable about how often/how long childcare obligations are for a dual-income household.", "NTA... yet\n\nAs long as you don't completely cut them off from your kids then you will remain NTA.\n\nI completely understand getting an alternative childcare option - daycare or babysitter or otherwise. You cannot trust their feelings/opionions on this matter it since they are being two-faced. Who knows wether they truely felt it was a chore or a privilege to watch your kids. \n\nI think the only time they should be around your kids is when you are both also there so they can't claim that you are \"pawning\" your kids off. That way your kids can still have a relationship with their grandparents. \n\nAsk them \"Why should we leave our kids with you if you think its 'selfish' and 'irresponsible'? Why are you aksing us to drop our kids off, when you are just going to complain when we do - and call us 'shit parents'?\" Im curious to see what gaslighting they throw at you.\n\n\ntl;dr NTA. Being two-faced gets you supervised visits 🤷‍♀️", "NTA. \n\nYou did exactly the right thing. Your parents are angry because their bullshit had consequences and now they have to deal with it.", "NTA; if they had issues  they should’ve come to you first instead of complaining to someone else. You are now doing what they said; taking responsibility and not leaving the kids with them.\nGet good childcare, and just let your parents be grandparents. (Don’t hold a grudge or withhold your children from them even though they hurt you)", "NTA.  Your parents have complained in both scenarios, they need to make up their mind.  Taking the kids away from them completely would really hurt the kids so maybe a sit down conversation and boundaries on both sides would be good.  Your sister needs to butt out and mind her own damn business.", "NTA but your kids deserve a relationship with them. So I would say take them, or invite them but don't leave them alone with them at all. Don't let them feed them, if your daughter wants water, you jump, if there's a nappy change, same. Just treat them as you would your kind neighbour. \n\nNo care duty on them whatsoever. Not even if they jump to feed them, put them to bed, or help them pick toys up.", "So they asked to look after the kids, complained about it and insulted you so you stopped asking them to look after the kids, then complained about not being able to look after the kids? MY BRAIN FUCKING HURTS NTA JESUS", "NTA, so they trash talk behind your back about being used as babysitters when it was their idea, so you find actual childcare now they are upset they don't have their grand children over. They can't have it both ways. If they had a problem, they should have come to you instead of talking behind your back.", "I'm conflicted between NTA and ESH. Obviously you're NTA for making other arrangements for babysitting after the absolutely abysmal way your parents handled this situation.\n\nThat said, your kids love their grandparents and if you're completely cutting them off then you'd be TA for that because it hurts your kids too.\n\nTime for a frank, in person conversation with your parents where you tell them how hurt you were to hear them complaining about a situation they asked for and setting reasonable expectations for when they can spend time with their grandkids outside of the hours when your kids are with the paid sitter.\n\nTell your sister to mind her own business.", "NTA, they seem they just want to complain. I would suggest maybe setting up like a grandparent playdate. Like every other Sunday from 11-2 you all go have lunch with grandma and grandpa. That way they see the kids but they aren’t watching them and you don’t have to deal with your parents nonsense.", "Maybe have an open and honest conversation with your mum?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife and I have two daughters, Julia (5) and Alina (17 months). I've always been close to my family, and my parents are really involved with my daughters. They've regularly babysat Julia since she was around 1, and then Alina too. Currently it's two or three times a week.\n\nI know that sounds like a lot, but it always seemed to be their choice. We were always able to afford normal childcare. Originally, that was the plan when my leave was finished.  However, my parents thought it was a waste since mum could watch them and they could spend time with their grandchild instead. The whole system happened because THEY asked for it. We do thank them, and appreciate it. Our girls are really close with them. \n\nHowever around 3 weeks ago I went over and overheard my parents complaining to my sister about it. Apparently we're being selfish and basically just pawning off our children. Basically abandoning our responsibility. I was pretty upset and we ended up arguing about it. They ended up saying that we're essentially shit parents who refuse to do our job. That we shouldn't just leave our children to them. But we literally only did that because they wanted to be there for the kids. We didn't bring it up or force it, and whenever they couldn't we've found backup options \n\nSince then we haven't left Julia or Alina with my parents. I have no interest in it after finding out how two-faced they were about it all. We've got a temporary alternative and are looking into more permanent options.\n\nLast week mum asked when we were going to have the kids over and I basically told her we weren't. I don't want to 'abandon my duty' and feel uncomfortable having my children around someone who thinks so little of my wife and I. I mean I definitely don't want our girls to start thinking we dont care. My parents are mad and think I'm being entitled and unreasonable, but I think it's a reasonable boundary. My sister has jumped in claiming I'm a horrible son and taking advantage of them, but they CLEARLY didn't think I should give my responsibility away to them, so I'm not. My wife is conflicted and I know Julia was really close to them so a part of me is worried my reaction is unreasonable and asshole-y. AITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "I need more information.  In the last paragraph, did you say these things directly to your parents?  Do they know that you know about their conversation to your sibling?", "NTA Your oldest is five, soon she will overhear them badmouthing you and your wife if she hasn't already. And considering how two-faced your parents are I wouldn't trust them with your children.\n\nYour parents did this to themselves, they are the only ones to blame.", "NTA but maybe nobody is. Is it possible that perhaps they want to be part of the upbringing but you may have perhaps abused the arrangement not necessarily on purpose. If that is the case an open conversation would have been better but at the end of the day, is it really worth it to lose family over lack of communication. My two cents.", "NTA for feeling hurt by your parent’s complaining. But your reaction has been too extreme - what about a calm conversation to explain how hurt you feel and that you never wanted them to feel like you were taking advantage of them?", "ESH they should have said something to you about reducing the time they kept your kids but your all or nothing response isn't fair to your kids.\n\nYou and your parents need to have an adult conversation and figure out what yall want.", "Not the asshole. I’d say ask them to apologize for being so two faced. If they did then we can go ahead with them having regular access. If not then I’d suggest only “event” based visits. Christmas, thanksgiving, birthdays etc…", "NTA\n\nThey can't have their cake and bitch about it, too. Yeah, no, if they're saying that crap to your sister over the phone, what have they been saying to your children about this? Sounds like old people who have nothing better to do than create drama for excitement in their lives no matter the consequences. \n\nTell your sister to mind her own business. This doesn't affect nor concern her, nobody asked for opinions from the peanut gallery.\n\nHow childish of them.", "NTA. But I would have your parents spend time with the kids with either you or your wife there ao your faughters can have a relationship with their grandparents. I think that's fair and if they complain they have only themselves to blame. And it's eyebrow raising that they said that you and your wife should just give the children to them...", "INFO.  Do you and your wife both work?   Is that what you primarily need sitting for?   If so, someone needs to look after them during those times.   To accuse you of being bad parents and abandoning your responsibilities simply because you are doing that is way too much.  However if it’s more that you are having them watched even beyond those times too much, like you hardly ever seem to have them when you’re home, MAYbe that’s what she’s hinting at?  I can tell you I’ve known people that never seem to have their kids even when they can/ should.   \n\nAs of right now it does seem like NTA because they asked to do this, and you’re appreciative, and you know you have other options and seem to be willing to do so if needed.", "Wait your mom thinks you are entitled to have your children?! That’s crazy. They definitely should have talked with you if they were having a hard time taking care of the girls.", "NTA. Where was the 5 yr old when you overheard your parents? Did she hear them?", "Maybe it wasn’t a case of them wanting to watch the kids, but more along the lines of them “volunteering as tribute”? I hope this makes sense. I would say NTA though since they did not communicate properly.", "NTA. If your mom didn’t mean what she said, then she shouldn’t have said it. Tell your parents they are more than welcome to come to your house and have a limited visitation schedule set up to where you have plans with the children later and end the visit to go be a parent.", "NTA\n\nGood job you changed things as soon as you did. Your parents will be telling your children these things and it will undermine your relationship with your own children.\n\nDepending on where you live you are at risk of a grandparents’ rights suit considering how regularly you have been giving your parents time with your children and it was well established. Changing your childcare is your right as a parent but your parents may get court ordered visitation if they push for it. Find out your legal position ASAP. It doesn’t mean you need to go back to giving your parents all the access to your children *and* all the ways to be rude to you about it, but you might have to play smart to avoid court - like meeting at a playground every six weeks to prove you haven’t cut them off entirely. The law is different in many different countries.", "So the 17-year-old can't stay home alone? And watch the 3-year-old when she's free and feels like it?", "My parents moved to where my brother is when he and his wife had kids and then tried to charge them for babysitting. They didn’t need the money. GTFO I was horrified.", "YTA - You sulked and took away your parents babysitting privileges instead of having an adult conversation with them: \"Mom, how is the babysitting working out for you and dad? We can afford child care and give you more options as to when you see the kids. We don't ever want you to feel pressured to take them on.\"\n\nBut - no you showed them. Good for you - now your kids will get to know some stranger better and your parents and children will be disappointed - but you proved some point. What it is I don't know.", "I'm so confused at their logic. Have they had a cognitive check up lately? But also you need to protect your kids\n\nNTA", "INFO, are we getting the whole story?  Are you routinely taking advantage of their kindness to leave the kids to go do things outside of work?\n\nI used to watch my sister's child while they worked, but sometimes the \"work\" days would stretch way longer and I felt like no one was in any rush to come home to relieve me...it led to resentment bc it's *their* kid, yet I was experiencing more hardship than the parents\n\nSo, do you like, go out to dinner with your wife after work, and tack on more and more hours for your parents?  Bc if so then (speaking from experience) that is assholish behavior", "Info: do you ever visit your parents with your children to have an actual visit without them having to babysit or do you just drop your kids off to be babysat. \n\nWhile true they should have spoken to you if it was getting to be too much for them but on the other hand, it does sound like from your post that if they have such an issue babysitting the amount they’ve been doing then you’re not going to bother bringing them over at all.", "NTA. You have to work, the kids need childcare, your parents offered.\n\nRe their attitude and seeming hypocrisy, I assume their logic is this: One of you (probably your wife) should stay home with the children, which is why they think you’re selfish parents and pawning off the grandchildren. In their heads you’re being irresponsible and putting your careers or saving for an expensive vacation before your children. It doesn’t mean they don’t want to see the grandchildren or spend time with them, either as babysitters as “regular” grandparents. It means if you’re going to insist on being selfish shitheads that the kids are better off with a family member (ie them) than a stranger.\n\nSource: My parents said and did exactly the same things.", "They can't have it both ways.", "NTA - is it judgement of your wife not being a SAHM?", "Soft ESH. Everybody needs to grow up and communicate. Your parents should have spoken up years ago if they were feeling taken advantage of. They should have clearly communicated how often they were comfortable taking the kids and encouraged you to either spend more time yourselves (if that was even really their opinion) or to find alternatives. They wouldn’t have built up so many feelings about it and said things that hurt your feelings. \n\nAnd when you overheard them, you should have communicated clearly with them. You should have let them know it hurt your feelings and you thought they wanted to spend that much time. You should have asked them what their preferences were and gone from there.  Clearly you’ve come by your lack of communication skills honestly. But it’s not too late for you all to practice speaking your mind instead of building resentment. The very last choice you should make is to abruptly rip loving caregivers out of your childrens’ lives. That is jarring and confusing for them and doesn’t benefit them.", "NTA\n\nThey probably wanted to do it and it wasn't a big deal for a while, but when it got too much for them instead of having a conversation with you and your wife, they shit talked about you. \n\nYou're doing the right thing. They can't have it both ways.", "ESH. your parents for not communicating with you that they were feeling taken advantage of. You for expecting your parents to babysit, 2-3 times a week, and you don't say why you need childcare - it always seemed to be their choice - did they ask to have them over each time prior to you dropping the kids off? Or did you ask each time? Like I said your parents should have communicated with you, but at no point over the last 4 yrs did you stop and think hey, it's almost like my parents have almost 70/30 physical custody of my kids🤔", "Yta because you’re dragging the kids through this with you and they did nothing wrong.", "Luckily the kids were still out with father. So it was just my mother and sister home. I did take the girls as soon as they got back but tried to pretend everything was ok.", "Thank you, that's what I've been thinking. I don't get why they're so mad when they told me it's wrong they're having them.", "They do, I confronted her over it, that was the arguement. They won't apologise because I'm in the wrong and need to take responsibility, etc etc. I just find it so hypocritical", "That's what I old them. But they all think I'm being unreasonable. \n\nWhat level would grandparents be? I definitely don't want to hurt my girls, but I dont know what level your advising here honestly.", "perfect advice.", "Agreed with this! Invite and supervise the visits this way!", "Hmm I guess that makes sense. I don't want to hurt my girls. Ill have to make sure they definitely don't say anything to them though. But thanks for the advice.", "Even if the kids love their grandparents, who knows what lies and crap they’re being fed about OP and his wife. I wouldn’t leave my kids with them either.", ">However, my parents thought it was a waste since mum could watch them and they could spend time with their grandchild instead. The whole system happened because THEY asked for it.\n\nI mean, they pretty clearly DID ask for it, and the OP is clear in the post and comments that they needed childcare to cover her working hours. And that she intended to get paid childcare and her parents discouraged her from doing so. If the grandparents changed their mind about the arrangement, the onus is on them to use their grown up words and communicate with OP instead of talking shit to other people about a situation they created.", "I mean, if you regularly talked about it and they always were bringing up ideas for them hanging out or doing stuff or having a grandparents trips. I don't think it would occur they were bringing up ideas excitement without actually wanting it.", "They didn’t hear this time. But she’s clearly not being careful and her attitude stinks. The kids will hear her eventually if they haven’t already, and they will pick up on your mother’s attitude. \n\nBut here’s the thing: saying or doing anything that drives a wedge between a child and parent is a particularly insidious and damaging form of abuse called parental alienation. Even if your mother is being covert, her comments to your sister reveal that it is happening at least on a small scale. You are 100% correct to remove your children from an abuser.", "They basically want you to spend more time with your kids because they think your not taking your role as a parent serious but they also expect you to give them your kids whenever they want I’m confused I wouldn’t give them your kids", "Yes, they are hypocrites. And now they've not only damaged their relationship with you but with their grandkids. But that's ON THEM.  If they were having a hard time with the kids, they should have said something to you and not talked shit about you behind your back. That's not how adults behave.", "Don’t take them back. If this is what they say about their child and their grandchildren, then imagine what horrible things they are going to instill on your children. No thanks. NTA.", "OP, honestly, your parents and sister don’t like you. It’s not that they actually think youre a bad person, they just need to have something to criticize. \n\nAt least, that’s been my experience.", "> But they all think I'm being unreasonable.\n\nWTF do they want? Do they want you to leave the kids with them or don't they? Are you unreasonable for NOT leaving the kids with them or are you a bad parent who doesn't take responsibility for leaving the kids with them? Your parents sound absolutely exhausting.", "You should probably start with a really frank conversation with your parents about what exactly it is that they want, and then decide if you’re actually comfortable with whatever level of care they’re interested in. I’d probably start with supervised visits, so you or your spouse are there with them and can keep an eye on things. I think your parents would have to build up trust with you again for things to move forward smoothly, and that starts with transparency.", "Regular \"grandparent level\" babysitting is more based around the kids going over specifically to hang out with grandma. Two or three times a week, every week, for four years, seems like the kids are going over when you need a babysitter, not when they need grandma time. That frequency is like a job, not a visit with the grandkids. \n\nYou should have checked in long ago to say \"hey, we love that the kids see you so much, but we just want to make sure 3 days a week indefinitely is not too much of a commitment for you\". It sounds like the babysitting has gotten more and more frequent (what in the world are you and your wife doing that your kids need a sitter 3 nights a week?) and you just assumed your parents would object if they weren't up for it.", "Take your kids over but go with them. That way they your eldest can continue the relationship but you are not giving in after their rudeness.", "Both parties failed to have a conversation about this. Your parents could have said that the work was getting too much for them, and you maybe could have checked in on this too. \n\nI agree that a conversation and a commitment to better communication is the way to go. They are absolutely in the wrong, but it's not something to have a family split over.", "[deleted]", "We spend as much as I can. It's just  have work. We can only survive on one wage for so long. The times they were with my parents would mainly be when we both had to work. That hasn't changed much, beyond it's not through them. Though our babysitter won't have overnights like the girls sometimes did at theie grandparents.", "I would worry that they are also speaking ill of you in front of your children and what kind of emotional upset that could cause them.\n\nTell sister that they asked to have the kids so they did, they asked not to have them so they don't anymore. You are simply doing as they requested.\n\nTo your parents, if you want them to maintain a relationship, you stated that allowing you to keep the kids makes us bad parents. You are welcome to come see the kids when at your house as long as you don't share you views of us as parents with the kids.\n\nTo Julia, your grandparents are getting older and it's too hard for them to be responsible for you on their own. They love you very much but they are not able to have you at their houser anymore.\n\nSorry you are dealing with this. Hope you can find a workable solution but if not you need to control all of your exposure to toxic people and protect your wife, children and yourself from their ugliness.", "Ah I see. I think that makes sense.\n\nWe both work. Typically 2 days will clash where both have to work. So they stay at their grandparents. Depending on what my parents told me it'll just be until one of us finish or for the night.", "That's your personal take. I know plenty of grandparents that love to spend as much time with their grandkids as much as possible, namely due to the hustle culture of their adult years.\n\nNTA", "Two toddlers are A LOT of work. They were probably OK with it when they were smaller but as they grow it gets harder...", "You need your parents to look after them when you guys are both at work? Why can’t someone else look after them like another family member", "Does your sister have kids? Maybe mum was playing it up to sister because she doesn’t want to do the same for her (now or later down the track)?", "Because my parents said they can. They've never voices any issues, hell they seemed want more time if anything. Now we're using a babysitter (soooo expensive, my god it's crazy how.expensige a good one is)", "Why are your parents having issues now?", "I don't know. I wrote what they told me basically.", "Try talking to them again and see what really is their problem I feel like their is a deeper meaning to what they said", "I don’t think there is. Some people just love to have something to complain about.", "My friend ran into a situation similar to this.  It boiled down to this… her parents really really wanted to take care of the kids but had started to get too old to handle them BUT couldn’t admit to themselves that the kids were too much and started complaining that the child was a brat.  My friend started having her parents babysit just a little so they could still be involved as grandparents but didn’t have the responsibility.  \n\nDid your parents handle this poorly?  Yes, but so did my friends parents.  I would recommend a little grace here for everyone.  Forgive your parents.  Have the babysit a couple of hours once every week or two and ignore your sister who is just stirring up trouble.\n\nNTA.", "I used to be in a relationship with a woman whose mother wanted us to visit every weekend and insisted that we spend the night sleeping in her bed while she slept on the couch.  I wasn't comfortable with this but I went along to avoid arguments.  Later I found out that the mother was complaining to all her friends that we were barging into her home and kicking her out of her own bed.  She was very outspoken so I don't think this was a misunderstanding.  Was she deliberately making things up because she enjoyed getting sympathy?  Was she just a little crazy?  Anyway, NTA.", "Let me get this straight.\n\nYou overhear mom and sister shit talking about you guys taking your parents up on THEIR offer to watch the kids in lieu of spending money on daycare.\n\nYou have an argument over it with them on the spot, they to your FACE call you shit parents, again, for you guys taking your parents up on THEIR offer to watch the kids in lieu of spending money on daycare.\n\nAFTER ALL THAT, they still ask when they can have the kids over next like it's no big deal.\n\nNTA, your mom and sister are. Sounds like dad is kinda innocent in all this. I wouldn't be surprised if any time she offers hes around and wants to see them too so your mom is basically hiding her contempt from him.\n\nI'd never take them up on a babysitting offer again. Grandma and Grandpa wanna see the kids? They do it when you are all together as a family. You don't need your kids exposed to family talking shit about their parents.", "ESH.  They were wrong to trash talk you when they never complained or tried to set boundaries with you in the first place.  But never letting them see their grandchildren after all they did for you,  and considering how close they are to the kids is a step too far.  You've punished them it's enough.   Just tell them you don't need their help with childcare and ask them when they would like to see their grandkids.  Try to figure out times that work for both of you.   It's not like two working parents of young kids never need a break!  Don't cut off your nose to spite your face.  A sleepover once a week with grandparents is fun for the kids, a break for you,  and a joy to your parents.", "NTA for removing your mother's excuse to talk smack behind your back.", "They want to have their cake and eat it, too. They want to watch your girls AND complain about it. The unforgivable part is that they said you were lousy parents. They don’t need to be given the opportunity, any time soon, to learn what lovely parents you presumably are. \n\nNext time someone bitches about your decision to not let them babysit, tell them once, word for word, what you heard your parents say. Then block them. \n\nNTA.", "NTA. Did your mom ever say anything to you that it was too much? I hate things like this.", "So, I think mostly NTA... But it might be worth trying to talk to your parents and see if there were some miscommunication, or ask why and when they started to feel this why. It's not your job to convince them you're a good parent and they're wrong, but at the very least you could use some closure in this issue. You might learn something new, or you might confirm everything and eliminate any reasons for feeling like an asshole.", "Nta. You're damned if you do have damned if you don't. They caused this by not being honest with you & by talking behind your backs. They made an issue out of this, you're just being a good parent & proactively protecting your children.", "NTA!", "NTA my parents do this sometimes when they are tired/in bad moods. They do daycare for my niblings, alternating with a nanny. If my sister and BIL go out one too many times or they see them at home but on their phones while their toddler is running to grandma and grandpa for some attention, they’ll gripe to me about how much time their grandchildren spend away from their parents, that my sister should put the kids first since she is a parent now, that they are getting old and can’t be dropping everything forever to do this. But what’s weird is that they love my niblings to death, they would be miserable if they didn’t get to have them over and never ever say no if asked unless they are physically incapacitated.  I think it’s a mix between loving the kids so wanting time, but also feeling like parent-time is what’s best for the kids and occasionally feeling the physical limitations of their age. \n\nI can see why her comments would strike you hard, and really if she had a problem she should have come to you, not gossiped and trashed you to your sister. Especially since you don’t really need their help, I think you are making a good call. It’s not like they’ll never see the kids, it is just less alone time.", "NTA... sounds like it might be a case of your parents getting some sympathy for playing the victim.  I call it shaking the sugar tree. In response their daughter gives them some validation that they are making great sacrifices.  Its cringeworthy and hurtful but it may not be as big a deal as you make it out.  As awkward as it is I think it's time to sit down with your parents Express your hurt and your gratitude and ask what arrangements they feel are reasonable. Then work around these. It not worth punishing and causing a bigger split in the family because of (legitimate) hurt feelings. Use this as a learning moment and give them a pass if  you can.", "NTA\n\nI'm trying to understand your parents' logic. They insist on babysitting your kids, but then accuse you of being bad parents for letting them babysit, and are mad when you stop letting them babysit. Have they always been good contradictory about things?", "NTA. Do your parents often set up situations where you're \"damned if you do not damned if you don't?\"", "NTA. What if they say something like that in front of your children? They'll make them think you are a bad parent and, probably, ruin your relationship with them.", "NTA, they made their bed.", "NTA", "They shouldn’t have asked for it if they couldn’t handle it. NTA", "NTA yeah it sounds like a bad idea to have your kids unattended with people who don't respect you. Cuz that's really what this issue is about, they made demands of you and then talk shit about you to other adults. .\n\nJulia is old enough to start hearing what they are saying about you and ingesting it, that's the point you need to talk about with your wife. Your parents are talking shit about you too and calling you bad parents, and one of your children is old enough to understand at least as far as taking that in and it becoming part of her reality. You should just block your sister, cuz your sister is literally telling you she only believes the story that your parents already told her. She thinks you guys are dead beats because your parents have told her that you are deadbeats", ">My sister has jumped in claiming I'm a horrible son\n\nTell your sister to stay in her lane and mind her business.  This doesn't concern her.\n\nYour parents have shown you that they resent watching your kids.  You've done the only reasonable thing in response.  And now they're complaining?  Absolutely NTA", "NTA. Don’t talk trash about a parent’s parenting ability if you still want access to said parent’s kids. Not letting them watch your kids is just a natural consequence to their actions.", "NTA", "NTA. They played a stupid game, they won a stupid prize.", "NTA. They are very wrong and the wrongest aspect ie that they complainer about it to…. A 5 YRS OLD ffs!!!!", "NTA.  You are a hero! for standing up for your spouse and children. \n\nIf your parents truly enjoyed sitting your children then they would not say those horrible things about you and your partner.  \n\nI also, suspiciously, wonder whether your parents make comments about you and your wife in front of the kids.  Honestly, adults do not seem to understand what damage their casual comments make to small children - not everything is forgotten.  \n\nI am sorry this is happening to you - I hope things get better.", "If this was me I would tell my parents that the ONLY contact they will ever see with my children before those children are adults is supervised by myself or my partner. I would be giving my sister the same information. Wanna chat about me behind my back after begging for access? Now your only access to the children has to be under the watchful eye of at least one parent to ensure the children aren't lied to.", "NTA if they didn't want to babysit anymore they should have just told you.", "Your mother sounds toxic. I'm very sorry about that. Was it that she wanted money from you? What does your dad think?", "INFO: are you leaving your children with your parents while you work, or while you go out socially? There’s a big difference. Going out 2-3 times a week and leaving your children is too much in my opinion, and asking this often is actually quite cheeky… but only if it’s social. Babysitting while people are working is different, however asking for this much can be problematic for older people.\n\nTry looking at your parents as human beings with lives snd feelings of their own. They are older and probably get tired more easily. Why are you leaving your children with them so often?", "NTA. Just be careful your little girls don't interpret this fight between their parents and their grandparents as \"everyone is arguing bc no one wants to take care of us.\" Sometimes kids get the wrong idea.", "People get so bent out of shape when you refuse to put up with two-faced bull crap nowadays. NTA.", "NTA maybe your parents want $$ for their time?", "ESH.\n\nI think your parents are assholes for being two-faced about it. It's shitty to complain about people behind their back regardless, but doubly so when they've pretended it's all fine to your faces.\n\nBut I also think you're being an asshole. It's petty to completely cut your kids off from your parents, who by your account take good care of and genuinely love your kids, even if they resent being \"forced\" to watch them. Your kids have done nothing wrong here, and you're punishing them because you're pissed at someone else.\n\nYour parents absolutely owe you an apology for the accusations of shirking responsibility and abandoning your kids. You owe your parents an apology for taking advantage of them, although I think you'd be justified if you qualified that with \"we genuinely didn't know you felt that way, and we hope in the future you can be more up-front with those feelings.\" Then you both owe each other some honesty about what level of care they're willing to accept in the future. You're all grownups and perfectly capable of resolving this without resorting to petty tactics like using your children to punish your parents.", "NTA, they offered, you accepted, but you’re bad parents for doing so? \nThey won’t apologise, but at the same time it’s unfair on the kids to ‘lose’ their grandparents over their treatment of you.* Time to revert to traditional Grandparent/grandchildren relationship, i.e. visits with mom&dad for a couple of hours on the weekend.\n\nI only say this as I know what it’s like to have a poor relationship with your grandparents.", "NTA they have made it perfectly clear that they see your kids as some kind of burden but want to be two faced anput it. Sounds like they want to be grandparents but don't want any of the work anymore which is fine. It just means they won't be watching your kids considering this was never something YOU asked for.\n\nActions have consequences. And even if it was just a one time rant where they were overwhelmed one day it still shouldn't have been said. They could have talked with OP like adults. They chose not to discuss with you or your wife however.", "NTA, your parents sound really manipulative.", "NTA. They can’t have it both ways. Either they want the kids there or they don’t!  If they do then stop telling your sister that you are taking advantage of them when you aren’t. I would leave them in low contact and no visitation for a while. Once they can tell the TRUTH then maybe start with low contact. They are the AHs and need to stop trashing you and your wife.", "NTA. The issue could be the frequency and the attitude. I say this because of their attitude behind your back and then your mom still wanting to see him.", "Nta your parents are slimy and 2 faced. They don't deserve to see your kids if they just want to spin the story to how great they are and how shitty you both are. \n\nPut the kids in day care going forward. Your parents made their bed.", "So wait... you were \"taking advantage of them\" by having them take care of your kids. But now you are \"taking advantage of them\" by *not* having them take care of your kids? I'm confused. There is no winning there. \n\nI guess the only way to win is to just not play, then.", "NTA sorry but they're just creating drama for the sake of having something to complain about. They want their cake and eat it too, be loving doting grandparents and then play victim because oh my God we have to have the kids. Sounds like a them problem.", "NTA\n\nYour parents are into some really weird mind games.  When they have the kids, they are frustrated and overburdened with the responsibility.  When they don't have the kids, they're upset about it.  OP, was it like this with them growing up?\n\nIf they were unhappy babysitting, they should have just told you.\n\nIt might be unreasonable to cut contact between the grandparents and the kids completely.  Maybe have weekly dinner over and Gma and Gpa's house so that they can get family bonding time but also aren't feeling overburdened.", "ETA for poor communication on both parts. When your rents watch your children that much, it's essential that you check in constantly with their POV and attitudes in doing so. IOW never ever take that type of care for granted. Your parents are the ass for not voicing their complaints to you. I'm confused to why they're upset? the amount of time they watch the children or the WHY behind it?  IOW wife/OP has outside activities and thus the \"drop offs\" center allot around that?  Could that be why they are miffed?", "Nta and I would do the same. I don’t know what they expected when they offered this and then bad mouth you for accepting it. That’s their own fault, sounds like they just don’t want to say sorry and admit they were wrong.", "NTA, I hope you realize that they have definitely said stuff like this in front of your children. I wouldn't necessarily cut them off completely, but I wouldn't let them have unsupervised visits anymore.", "NTA.", "My mom pulled this shit. She BEGGED to have daughter all of the time and I asked several times if she was sure. We could always afford childcare but I thought I was doing her a favor, honestly. But one day she ran into a friend of mine and started talking about he we always just leave daughter with her. My mom had a major martyr complex and needs constant sympathy.\n\nI don't actually think she felt that way and I know she didn't say it to my daughter. She just said what she needed to say to get sympathy in that moment. However, you'd better believe that she didn't babysit my daughter again for a good long while. I made sure she knew that she was no victim. After a while she was so desperate to have that time with my daughter that her attitude completely changed. Now she'll tell anyone who listens how happy she is to be able to spend so much time with her grandkids. \n\nNTA, op. Don't let your parents babysit for a while and definitely get new care for regular care while you work, etc. I guarantee you that they'll miss those sweeties and rethink their behavior. Then you can have a discussion with them about what is acceptable and they can watch the kids again, just not as much.", "NTA - my MIL was a bit like this. Complained bitterly for years about her friends who had their grandchildren dumped on them, and vowed not to be like that. So when we married and had our son, we arranged other childcare. Oh, did we hate her? She was so hurt.  I was so confused!!  I certainly didn’t want to/refused to get my childcare from someone who could so clearly resent it, it possibly hold it over us forever. \n\nSo what to do?  We could cut her off.  But, She did love our little bean and he loved her.   Got some great advice from one of her friends - a very clear eyed woman who understood my MILs irrationality.  We asked MIL if she would like to set up a regular “Judy-time” (she hated being called grandma, too), not because we needed the childcare, but so that she could simply have time she wanted with the little one. She jumped at the chance.  Thursdays afternoons became Judy day. She wasn’t babysitting - her grandson was visiting with her.  \n\nIt was semantics, but it kept the peace, solved the issue, and allowed our son to have the love of his grandma.  Maybe there’s a solution like this that could work in your situation.  You aren’t wrong to do as you are doing.  And at the same time, it would be nice for the kids to have special time with your parents.", "NTA this is insanity, your parents made the choice to watch them, got mad and now they voiced they don’t want to watch them and still got mad??", "Nta, i would tell your parents unfortunately they are a setting a bad example for the girls. For you guys want them to learn to use their words when there is an issue. Instead of talking behind people back.", "NTA - I was essentially brought up by my grandparents (who I love very very very much) because my mum wasn’t well enough to care for me and they definitely instilled some negative views about my mum. It’s a lot better now that they understand mental illness but I could imagine the same thing happening to you if they start talking about you behind your back.", "NTA. Your Mom has martyr syndrome. “Look how we sacrifice because our son won’t parent his kids!” And then, “you’re horrible because you’re keeping our grandkids from us.”  It’s a no win situation for you.", "YTA if you’re changing arrangements with people who have been giving you free child care for AT LEAST 4 years (worth AT MINIMUM $5000) based on eavesdropping and without using your words in an adult conversation.", "NTA.\n\nYour folks need to act their age instead of their shoe size.", "YTA, big time. However it started, your mom felt taken for granted but didn't feel she could say anything. Instead, she vented to other family members, which may not have been the best response, but now you know she doesn't want to be your daycare solution. So your response is to cut off their relationship to their grandkids? Deprive your daughters of their grandparents? Grow up. You owe the apology, you need to find an alternative daycare solution, and you are damned lucky your kids have grandparents who love them.", "So you parents have been outstanding, helpful, loving grandparents and you are going to punish your girls who love their grandparents because you mom was venting to your sister(probably not having a good day). Then you come in acting like an Ah instead of having a rational conversation with your mom.  Then you double down and act like your parents have or will say hurtful things to your girls about their frustration with you and vice versa( which by all account that have never ever done).   You still don’t see where you overreacted???? Really? Have you ever vented to some one? Do you normally eavesdrop on others conversations and overreact?\n YTA", "Why does it have to be all or nothing? Maybe in the beginning or wasn't a burden. As people get older we become tired easier.  Maybe they are realizing they had goals and things they wanted to do that's a full time job of taking care of grandkids isn't allowing for that to happen. Why can't you find a solution that let's your kids still spend time with them but also allowing you parents to have some time to themselves. Have the kids go 2 days a week. Find somewhere else for them the other 3 days. You're going to punish everyone because you don't like what they were saying? 🙄 seems like a knew hell reaction to the most important people in your life.", "ESH. Why can none of you just talk this out? Your parents talked behind your back, you got offended and still won't just talk about it? Stop being petty people and just talk about the situation.", "YTA. Clearly they were feeling over used and there has been a breakdown in communication. They don't want to be regular babysitters. That doesn't mean they don't want to watch or see their grandchildren.... Why take this out on your 5 year old as well? She understands that she's being shut off now too. You and your parents should simply have an adult calm conversation about expectations", "This right here, like people are talking about ways of negotiating spending time with them, but why would you want to go over and supervise a visit with your kids with people who don't respect you? It would be better to put your energy towards getting your kids a babysitter who you trust and spending time with other adults who are good examples, people who respect you and do not resent your childrens' presence", "Holy crap. Someone in this thread actually suggested talking it out instead of going completely LC?\n\nI was thinking the same thing. Yes, it is shitty of the GPs to say that. But to go completely LC because of one thing is ridiculous. Everyone needs to be adults and use grown up words to resolve this.", "He already did that. His mom refused to apologize and doesn’t see anything wrong. She told him he was a crappy parent to his face.", "17 MONTHS. As in less than two.", "17 MONTHS not years", "They didn't hear this time, but it would be a mistake to let your daughters be unattended with them again, because there's no way Julia isn't hearing this", "I guarantee these comments are getting back to your children when you’re not around. You don’t need that kind of help. NTA.", "Also, just because I'm ever the pessimist. If your parents were saying those things behind your back, it's possible they've been saying similar things to your kids, and you don't need your children exposed to that view of your own parenting.", "NTA. My worry is that your parents have been bitching about you around your children. I would check in with them to ensure they know you love and cherish them, it is ok to explain to them in age appropriate ways why you won't take them to your grandparents anymore.\nMy parents did this is and I did not catch it on time. My son, 22 yo, is still convinced I don't love/want him because he would hear my parents complaining about me to others. Bear in mind that I only left him with them because they offered/requested it.", "Sounds like they like shit talking and are surprised to get consequences. They get more attention as poor aggrieved grandparents, saving the kids from their neglectful parents than they do from \"just watching the grandkids\".  Sidebar- is either of them a narcissist? This kind of stuff is a reg part of a narc's playbook but this alone cannot paint a full pic of someone.", "NTA but this is tough because your kids have a pretty strong attachment to your parents.\nIt seems you and your parents need to sit down and figure this out.  You need to really get to the bottom of these feelings they expressed to your sister. Something seems off here if they were the ones insisting.\nWas it too much for them and they didn’t know how to tell you?  It is no excuse for what they said but it sounds like you all had a really good relationship, so for the sake of your whole family I hope you can figure it out.", "I think you're being selfish for not realizing that circumstances change.  Show a little empathy and kindness. We all get older and have less energy. We don't feel as well as we used to. So what was fine in the beginning  isn't not be today. Why can't you compromise? Ask them if they would still like to have your kids 2 days a week. It's too bad that it got to this point. My sister took her kids away from us after a fight with our mom and it was really hard on all of us but especially my nieces.  I hate to see your kids suffer because everyone is drawing lines in the sand.", "And now that you are 'taking responsibility' they are pissed because they now want to watch the kids. Smh \n\nMaybe you can offer supervised visits of a half hour a week with them.\n\nGood luck. This situation sucks.", "The only thing that would be hurting your girls is letting them be around people who are saying they resent their presents, and do not respect you. Your kids having to hear someone talking shit about you constantly is going to worm into their little heads and mess with how they perceive you.\n\nYou should stop talking to your parents about this, because they aren't being grandparents, they are being people who hate you who are trying to drive away between you and your kids. It sounds like you need to lower contact in general because they wouldn't be talking shit about you in the first place if they respected you", "Means no unsupervised visits. You or wife need to be present when they are with your kids. So they don't talk ill about you both to your kids. Secondly they can't blame you for shifting responsibility and being bad parents. Third they get to spend time with their grandchildren so they can't say you are withholding them from meeting them. Don't mention anything to them just start this new way from now on.", "After things have settled down, ask the grandparents (both of them) how often they want to see their grandkids. Make them give specific days/times. Ask if they want to see them while you’re there, or they want to see them without parents around. \n\nHowever if grandma is controlling you might want to ask grandpa separately how he honestly feels about all this.", "Parental alienation only occurs when a child is manipulated by one parent into hating their other parent (and whether it counts as child abuse is controversial). Either way, it doesn't apply here.\n\nI agree the grandmother was out of line, but she's being deceitful and hypocritical, not necessarily abusive.", "[removed]", "[removed]", "I'm so sorry, what is it with controlling g'parents? What are they after?", "Or if his parents were having problems they could have communicated like adults instead of gossiping behind their backs maybe that was an option", "The grandparents were complaining about looking after the kids behind OPs back and criticising their parenting, why on earth should they be entitled to look after their grandkids after that? \nThe grandparents should have showed a little kindess by using their words if things had changed, not badmouthing OP.", "Yeah that's right here, if people are that willing to talk shit about you, it really says they don't like you. It sounds like a good idea to in general give them less space in your life", "Yep! Let them and the girls see each other, but just always do it when you’re around. 1. Refutes their absurd claim of pawning your children off on them, and 2. Makes sure they don’t say anything negative to them without you present. Good luck!", "[deleted]", "u/Pretend_Platy is a bot! They copied from u/estrellita007  \n\n\nOriginal post: https://www.reddit.com/r/AmItheAsshole/comments/zbfgy6/comment/iyr0syx/?utm\\_source=reddit&utm\\_medium=web2x&context=3", "u/Current_Wea is a bot! They copied from u/ApocolypseJoe  \n\n\nOriginal comment: https://www.reddit.com/r/AmItheAsshole/comments/zbfgy6/comment/iyqs1ip/?utm\\_source=reddit&utm\\_medium=web2x&context=3", "maybe to assert dominance over the parents bc they feel like their kids are growing away from them and setting boundaries now that they have families of their own, so to prove their relevance the grandparents use the grandkids as chess pieces like \"aha, see, you NEED us, your parents, bc you can't parent your kids (our grandkids) as well as i can!\"", "Sounds like you over-asked them to take care of the kids", "Ok, but use your fecking words:\" Son, we may need to cut back on babysitting.\" is all that needed to be said.", "Okay so his parents should have talked to him instead of complaining behind his back.", "…..how old do you think a toddler is? Their eldest is literally five years old.", "Didn't you read the post? The grandparents kept asking to have the grandkids.", "Grandparents are usually the ones pushing for overnights.", "Oh it is a control thing, because their children now have some control over them and they don't like it and they definitely don't respect their adult children as parents,", "OP said it was the grandparents asking to watch the kids.", "[deleted]", "Not really https://www.reddit.com/r/AmItheAsshole/comments/zbfgy6/comment/iyqsesu/?utm\\_source=reddit&utm\\_medium=web2x&context=3", "Was one of your parents a stay-at-home parent by any chance?\n\nThey sound like the type of people who think kids should be with their parents rather than with strangers, and that leaving them with a nursery or nanny is cruel somehow.\nIt's very annoying and not in touch with modern times, but it would explain why they would offer to babysit every time you \"threaten\" (in their minds) to leave your girls with a sitter, then go behind your back telling people how you're basically forcing them to babysit all the time and they wish you'd take responsibility.\n\nI wonder if your parents think this way. If they do, they seriously need to wake up 😖", "Bingo that's what I felt. That is probably what it is. It is unfair to OP but from their POV that's what they are thinking I guess.", "NTA and tbh I feel like people are being naive in the comments about what your parents said. They said that you're bad parents, that's not a mild insult. \nIt's a shame for your kids but honestly it would be better for them to have a reduced relationship with their grandparents than risk that resentful attitude being passed on to them. \nIf you really feel they should spend time together then supervise the visits, and reduce the frequency of them. Be responsible for your kids, which is exactly what they asked for.", "I had this EXACT situation happen with my in-laws. I went to their house once night to drop something off, and overheard my MIL talking about how she's \"not a fucking babysitter\" amongst some other extremely offensive and hurtful things about me and my family. My kids were 6 & 3 at the time, and she was constantly asking to have them over. She has never been given the privilege of watching my kids again. I had been made privy to her real feelings, and I listened. Done.", "OP, NTA.  Play stupid games, win stupid prizes.  They want to be martyrs so everyone will know just how amazing they are and how much better they are but you just took away their cross.  Nanny in, Nana out.", "NTA. I would never give them unsupervised visits again. If you heard the conversation, it's likely that your children overheard things as well.", "NTA. If they are saying things about your lack of care/taking advantage of the grandies etc. to family it is only a matter of time before it gets back to your kids. You know what they say, when someone shows you who they are, believe them.", "Im going a bit against the grain here, cause I'm experiencing the same situation, but from your sister's point of view. My parents also takes care of my sister's kids a lot. Mom does want to, but it's also a lot of work for her and it often seems like my parents needs are an afterthought. They do want to spend time with their grandkids and they do want to help out, but they're being overburdened, but that's not really registering with my sister. Its like they signed a contact and now they have to fulfill their duties. You took the road of \"im just insulted\" instead of realizing that you've been putting too much on your parents. It could easily be that your parents wanted less of a workload, but were afraid to tell you, so your mom ended up venting her frustration at your sister, which she obviously shouldn't have done. That being said, I can see why your mother might not feel like she can talk to you, if you go nuclear too easily. ESH. Not sure what you think you'll accomplish with this strategy. Punishment? Haven't they earned better than that with all the work they already have done for you? Or does that mean nothing? \n\nAs a daughter, it's hard to see my parents being coerced into doing more than they can handle in their old age. They don't want to be labeled bad grandparents, so they just agree to whatever my sister wants. Cause they don't want her to threaten to take their grandkids away.. you know, like you're doing now.", "NTA, they can't have it both ways. They are either fine with babysitting or they're not. They need to be adult enough to speak to you and your wife to your face and discuss their concerns rather than talking shit behind your back.", "NTA my mother does this - offers to help and then complains behind your back. It’s a covert narcissist’s tactic. Sounds like sis is an enabler/flying monkey? You can visit your parents with your kids when you’re ready but that’s it, no alone time. Good luck.", "That story took a quick turn. At the first of your post I thought that this was going to be a heartbreaking situation where a misunderstanding resulted in loving grandparents not being able to see their grandchildren anymore. Lo and behold I read on and find out that they were secretly resenting the arrangement the whole time and trash talking behind your back, where the kids probably could have picked up on the vibe at some point if they haven't already. This is so sad, because it sounded like an ideal grandparent relationship at first, but turns out your parents are as s***** as a lot of the other ones on these posts. So sorry! NTA", "NTA, your children may have overheard this kind of talk and since they are so little do not know how to say anything or how to process it. Your mothers behavior is abhorrent, I have 3 grown sons and if it was me saying I will babysit then why would I complain ridiculous. Stick with your decision, this is on her and sister not you!", "I don't think anyone here is an outright AH but I don't think anyone is in the clear.   \n\n1. If your parents suggested wanting to be part of the childcare solution, did you think about paying them the money since they were in fact doing the childcare?\n2. If it got to be a different arrangement than what they envisioned they should have spoken up and talked to you about it instead of letting it fester and grow into resentment.  \n3. Also, it might have been a good idea to check in periodically and make sure they were still good with it instead of just going with it.  It sounds like they had an initial expectation and they weren't quite as prepared at the reality.", "They're just mad they were caught and can't have everything their way anymore. This includes probably lying to your sister about what happened. You are NTA. Stick to your guns and defend your family.", "NTA\n\nWe've been in a similar situation with my in laws. \nI would sit down the 4 of you and hash out what their expectations are though... And what your boundaries are.", "Nta", "NTA. \n\nI felt like I just read my own story. My mom is a massive narcissist. She’d bitch if I wanted daycare for the kids and I should let her watch them. Then she’d bitch that she was watching the kids. \n\nI did the same thing. My mom wasn’t allowed to babysit anymore. She bitched about that too. \n\nI moved and stopped talking to her. \n\nYou don’t say much about your parents but I get huge narcissist vibes from them.", "NTA\n\nonly take the girls when you be there visiting the parents, that way nobody babysitting. Your off C day, okay let’s take the girls to the parents and spend a few hours there, can be once a week.", "NTA. Please check your locations laws on grandparents rights in case this blows up to more.", "You’re NTA.  Sounds like the grandparents are manipulative and gaslighting, big time.", "NTA. Put the boomers in a home and leave them there. So toxic this generation is.", "NTA I would do the same thing", "NTA \n\nIf they're going to complain about watching your kids when they were the ones who asked, then they don't get to watch them ever again. This is how consequences work.", "NTA they served themselves right!! I wouldn’t let them babysit unless I received an apology otherwise your taking advantage again.", "NTA. They made their feelings known, you are simply letting them guide your decision. Continued contact could so very easily damage your relationship with your kids, your parents could do/say things that make them think that you don't love them.", "NTA. They asked for the kids you gave them to them and then you hear them bad mouthing you for this. Nope this the consequences of their actions", "NTA your parents should either pick a lane or let you know what they can actually wrt babysitting. They can’t complain and demand.", "NTA. \n\nI'm currently dealing with the opposite problem where my parents basically make themselves completely unavailable to babysit or even spend time with me or my kids for no apparent reason, but will bend over backwards for my sister whenever she calls (she's a single mom with issues I won't get into right now). I remember growing up and basically living with my grandparents at their cabin all summer so I find it really funny/irritating as hell that my parents never babysit or visit or spend any time with us at all. I haven't asked them for any time in weeks and they haven't noticed at all  🙃. \nI'm so annoyed with them that I totally agree with what you're doing! If that's how they behave behind your back then frig that. Nobody needs that shit in their life.", "NTA - How awful to walk in on a nasty conversation about you when you've given them every chance to NOT babysit. That is on your parents . . . and the results . . .. well!  However, I do hope all the anger burns off sooner or later and you can work out something that works for everyone. Your parents should have been honest with themselves from the beginning and set up the boundaries they needed instead of complaining behind your back to the rest of the family.", "NTA. Your parents sounds like they want to be martyrs.", "NTA. They offered, you took them up on the offer, then they complained about it. Sure, you could have offered them some money or something like that, but if they made it seem like they wanted to take care of their grandchildren, then how would you know they were unhappy if you didn’t overhear them?", ">My sister has jumped in claiming I'm a horrible son and taking advantage of them\n\nYou're literally doing the exact opposite.\n\n\nNTA.", "NTA. Is it possible they your mom didn't really mean what she said but was just complaining to the other party because she likes sympathy? I'm not excusing the behavior or saying you should let her babysit again. But maybe this might be the reason behind it. I once knew a woman who would shoo everyone out of the kitchen, then complain that nobody helped her cook or clean, and she has to do everything on her own. When people pointed out to her that they offered to help, she would get mad and say they were being mean to her.", "NTA I'll never understand why people wanna let family members walk all over em just because they're family, that means nothing if they don't respect you and especially if they talk shit behind your back. Nothing wrong with setting boundaries that you're comfy with, I haven't seen my grandparents since I was like 8 and honestly their attitudes kept me from ever missing them", "I'm going with a very gentle ESH.\n\nI don't blame you for your reaction at all. I'd have done the same thing, frankly. But take a deep breath. My kids are almost exactly the same age as yours. I frankly get tired of them and frustrated with them sometimes. Young kids are hard. \n\nYour parents should have had an honest conversation with you. But also think, do you routinely check in with them to see how your parents are doing? That's a lot for people their age to be in charge of young children for that many hours. Young children are exhausting and around 14-19 months is the absolute worst age. Great mobility and no ability to follow instructions. Your mom might be feeling burned out.\n\nI see this all the time with my in-laws. They want to spend time with their grandchildren and in their head it's a great idea. Reality is totally different. They just don't have the energy anymore to keep up with really young kids. \n\nDon't burn the bridge because of a poorly judged comment you overheard. Be honest. If they're like my parents and have no ability to listen consider writing them a letter.", "I used to spend everyday at my grandparents house while my parents worked, and my other grandmother would take care of me frequently as well. No resentment between my grandparents and my parents. Everyone was happy to be involved in my siblings and my childhood. NTA, if they had an issue with it they should of said something to your face. It takes a village to raise a child.", "NTA based on what your parents said but yes if you have been leaving your kids there repeatedly for years without paying. \n\nSo INFO: have you been paying for them to watch your kids?", "To me it sounds like your parents wanted time with the grandkids but felt like unpaid full time babysitters which is never fun or enjoyable.  Can you plan some fun trips or something for your kids and parents for example the zoo, bounce place, delivered lunch, movies tickets or something for them so they feel appreciated instead of like it is just expected of them?  \n\nMaybe give your parents some gift cards or something that they like to do just the two of them?  I am not a grandparent but could imagine it would be nice to be appreciated as grandparents etc.  Nothing to expensive just little things would be good.  Their ages are high maintenance ages.   Just my thoughts.", "Nta and you're doing the right thing.  If theyre complaining about circumstances they created, and are self deluded to really blame you after you try correct what upsets them, they'll complain in front of your children.  You don't want that being poured into your children.", "NTA. What you heard was most likely the tip of the iceberg. There is no telling what they have been telling other people about your and your wife.  I would not ever trust them again. From now on they only see the kids at large family gatherings or under supervision. Find childcare. If they ask for time tell them \"That doesn't work for us.\"  Tell your sister to butt out.", "INFO: Are you and your wife both working at the times they are babysitting, or is there some other reason? I only ask because it sounds like your mother's complaints were less about her feeling overworked and more that she thought you weren't spending enough time with the kids yourself. In which case, from her perspective, finding alternate childcare doesn't solve the problem at all, it's just punishment for criticizing you.", "NTA, and this would make a good post on the malicious compliance sub too.", "Nta", "This is why I will be paying my mom, MiL and sister to watch my kid. Even if it’s something nominal, it’s not going to be “a favor”", "ESH- 3x a week is excessive if it’s uncompensated.  You and your wife should have better communicated the expectations and how long you would be taking advantage of the free childcare your parents provided. Maybe setup an agreement that everyone could consent to so that there are no misunderstandings on the frequency, time length, and the duration of how long they would be helping you.\n\nYour parents suck because they should have came to and discussed their grievances with you instead of your sister\n\nYou are fully entitled to not let your parents watch your kids again, but it sounds like OP is not allowing them to watch the kids in order to punish parents for talking behind his back.\n\nEveryone put their big kid pants on and talk it it out.", "NTA. Their behavior is pretty confusing tbh. Maybe you could tell them that you're very grateful that they agreed to help out when you needed it but you want to do the right thing and give them a break from having to watch their grandchildren. \n\nMaybe you can just spend some afternoons together with kids & grandparents for the near future until they explain what caused their hurtful comments (maybe they were overwhelmed with taking care of two small children?). That way you can maybe be more assured that they don't badmouth you and your wife in front of the children", "NTA- they insist you let them watch your kids, then complain you leave the kids with them, you stop leaving the kids with them, now they are mad you aren't leaving the kids with them????? Tell them to pick a side! 🤣🤣🤣🤣🤣🤣", "It's all about power. They want you to be beholden to them. You aren't giving them the satisfaction of grovelling, so they get snide and aggressive.\n\nThis reminds me so much of my sister, who I'm now NC with. She would offer to do something, then you had to thank her for doing it every time you saw her for the next ten years. If not, you would be labelled ungrateful and selfish. And, then she would try to sabotage you when you didn't have to depend on her, or if you tried to return the favour. We used to joke about her martyrdom, but it's actually more insidious than that.", "NTA, you are doing the right thing. They FAFO. I like the comments about talking to your kids about what they said behind your back, that is smart. Im sorry you have to go through this! It made me sad for you and the kids to read that. I hope things improve with your family", "NTA, be clear and unequivocal with them, this is only happening because you found out they think you and your wife are being neglectful and you are correcting your mistakes, and that you have no intention of ever abandoning your duty and dumping your kids on them, and not to worry, you are doing the responsible thing and finding good caretakers for them that won't feel weighed down by the responsibility because that will literally be their job.", "Maybe to allow the kids time with their grandparents, you could all visit with them when available, so they’re not there unsupervised. I wouldn’t let them babysit anymore either. And surely to goodness they wouldn’t make any remarks in front of the kids in front of YOU—and if they do? Pick up and leave.", "INFO: what did they think would happen? Like.. you complain because you don’t want to watch the kids but then you’re mad because you don’t get to watch the kids? In what world does that make sense? Good job calling the bluff and finding an alternative so you’re not playing into their petty manipulation", "NTA\n\n**INFO:** Is it normal for your parents to gossip like this about others? Including stretching the truth and flat-out lying to make themselves look better?\n\nIt seems your parents wanted the ability to bad-mouth you and your wife. They apparently haven't communicated anything about it being too much or a burden in any way, to you/wife at least, but it wouldn't surprise me if everyone else has another view.\n\nIf it had in fact been too much for them they should have discussed it with YOU and your wife first and foremost, NOT bad mouth you to your sister and who knows who else. It honestly sounds like they were getting some sort of ego boost from it all. \n\nDon't let them babysit anymore unsupervised, they have clearly lost that privilege. Once they mature enough to have an adult conversation with you and be honest, then they can start to rebuild the trust they tossed away. \n\nYour sister has clearly been fed their lies, so I wouldn't take what she says too seriously. I would also talk with your oldest and see if she heard anything from grandma and grandpa about you and mommy. 5 is old enough to overhear things that can't be unheard.", "GPS need to use their words and set boundaries. “Once a week would be better for us” instead of trashing them behind their backs. And then to defend their own actions?? Nope. No more babysitting.", "Wow does this sound familiar.  My ils begged to have our daughter then complained about how much work it was and how great they were. When she was 5, she started repeating things they said around her. \"Mom, why don't you let me do xyz with grandma? Why do you think xyz, Mom?\" Etc. They immediately lost alone time and had no idea why. \n\nAfter that,  we spent supervised time with them, the comments continued, only with us around to hear it: \"Hey, kid, you know that we're your dad's parents, so we're his boss and he has to do what we say.\" Uh, no. \n\nNo matter how much we tried to point out the boundary issues, they refused to acknowledge any problem. Kids and I are currently NC. My husband is very very very LC.\n\n Hopefully taking to your parents clears things up, but be aware that this might be a sign of a bigger issue. Don't feel bad ignoring all the people saying your kids deserve a relationship with your parents - if the grandparents aren't respectful, then it's better for your kids to stay away.", "NTA - wait for a sincere apology, then limit to very occasional.", "NTA what were they expecting for you to do after hearing what they said were they expecting you to pay them or something? If they did then it would have been better to talk to you about it rather then talking behind your backs. Feels like they were just trying to find a reason to talk smack about you and your wife doom if you do doom if you don't and in this situation best to priorities the children it will definitely affect them mentally had they overheard the grandmother talking especially the younger one that's still growing and unable to understand a lot. Rather then risk their mental health better to just not send them if they ask would be better to just tell them that you don't want to continue troubling the grandparents and that it would be better this way. Maybe sit the 17yo down and have a real talk about what happened since she's older and she'll sense when something is going on.", "NTA. Though, it seems odd to have a babysitter for a 17 yo and maybe your parents just feel under appreciated for looking after your children", "Slight ESH! It was your own mother who said to you, it's a waste to spend money on childcare and she wanted to watch your child! However, this seems to have been said to you when there was only ONE CHILD! Am I correct? You expect your folks to watch a 5 year old and a 17 month old, that's a huge difference in ages and how each child acts and the amount of care needed!\n\nWTBS, if your parents have any issues NOW, they are both grown ass adults with a mouth and should have come to you and addressed them. Talking trash behind your back, I can see why you'd be pissed. I don't see how you're abandoning your own children. To say something like that is totally uncalled for.", "Hahaha NTA. Grandma played a stupid game and won a stupid prize. Maybe when she can pull her head out of her ass and apologize, then MAYBE you could consider letting her see the kids again. She obviously is harboring some resentment toward you (or at LEAST, your wife). Who’s to say she doesn’t resent the grandkids as well? The best thing you can do is what you’ve already done. And if she keeps harassing you and refuses to apologize, cut her off.", "NTA. They can’t have it both ways", "NTA. Your parents are getting their just desserts. People are just mean and really need to learn how to communicate.", "If she’s casually talking bad behind your back like that, then I guarantee they’ve vocalized it around your kids. NTA", "NTA. I agree with your concern about your daughters feeling like you, the parents, don’t care about them. I don’t want to assume they would bad mouth y’all to them, but since they did your sister then what’s stopping them from saying it to your kids? I’d be really curious if they’ve said anything already", "NTA. Your mother is a two faced asshole. Putting distance is the appropriate response", "NTA. I'm sorry but I think you should cut your parents off. They're toxic and if your kids hear their comments, they can be heavily influenced at such a young age. \n\nImagine your kids starting to think you and your wife are bad parents because you both have to work. WTF. This time the girls didn't hear, but you can't know about the future and they might hear your mom and sister talking trash about you. \n\nTotally justified in keeping them away, especially because they refuse to apologised which means they don't think they are wrong and will continue to speak their minds.", "NTA. Maybe their complaint is that you both work (you know, like most adults need to/want to) instead of living in someone's basement where you can watch your children all the time. \n\nIf they wanted more time to themselves, they could have imitated adult behavior by telling you that they need to cut down on the child-care duties rather than being disrespectful and snide. Your sister is, at best, a nitwit.\n\nYou are protecting yourself and your family, so again: NTA.", "TA they have made their feelings and lack of interest is caring for your children apparent. You are just respecting their wishes.", "My Grandparents did me the favour of telling they were done being Grandparents. And I didn’t trust my mom around my kids. You need to set clear boundaries, they have become over involved with your life. Calling you bad parents really is a reflection on them, they raised you. Definitely NTA", "NTA If your parents are insisting to do this and then lying to your sister they might also be manipulating your kids. Considering their age, they are pretty sensitive to belive anything right now. You should definitely not leave them near your parents.", "I see you have a martyr Mum on your hands OP. NTA- this is teaching your parents the consequences of their words. Good luck with having to reinforce this message for the remainder of your life.", "Can’t talk bad about you shirking your responsibilities and then be mad when you “correct” the behavior. \nYou could let them have regular Grandparent visits… but only for a few hours at your house, lest you be thought of a pawning them off…", "NTA. They are getting what they asked for. Your kids will be fine. Your sister can kick rocks.", "First of all you should have been respectful in not even acknowledging you happen to over hear a conversation between two other people even if it was about you. The rest of the conversations later would not have happened. When you overheard the conversation you should have kept it moving and respectfully started looking for alternatives in daycare.  Your next step is the most important, love your parents as if nothing has ever happened breeding contempt is harmful just explain that you rather have peace and no bad feelings and this is the best option for everyone. You are not the AH by any means. If they are begging to continue to watch the kids it out of guilt and that is something they need to live with because of your mother two sidedness a choice she made when she spoke those unkind words to your sister.", "NTA This sounds like fuck around and find out situation. They made their claims and you responded as you should.", "NTA\n\nTalk about mixed signals! Have they always been like this?", "I had a similar (but not similar) situation. Someone begged to do something for my kids. I mean asked for over a year. I finally let them, and it ended up extending to me. They had reasons it benefited them to do it. I found out a year and a half later they were saying I was a mooch who took all of their time for free without paying. It really hurt me because they had begged me, and even talked down to me for not taking them up on it sooner. \n\nMaybe something changed in your relationship that made them resentful. Maybe they thought they would like it but found out how much work it is. Maybe they like being martyrs to get attention on themselves. Either way, you are NTA and I would only ever let them watch the kids if they gave a heart felt apology for what they said (both to your face and behind your back). Your kids can see them with you if you can stand it.", "It seems like they want their grandchildren to visit but not to be their full-time babysitters. I don't know if they miscommunicated, you misunderstood, or they realized later that they couldn't accomplish being full-time babysitters. \n\nInstead of bringing this issue up with you, she chose to bad mouth you and your wife. And once this issue was brought to your attention, you chose to never let the kids over. That is a way over reaction to a situation that I feel can be resolved with a little more communication and sympathy on both ends. I think both of you (starting with her) are assuming the worst out of each other instead of giving the benefit of the doubt.\n\nESH because I don't think that you or grandma are really good at communicating your wants and needs.", "NTA. But wait.. you are taking advantage of them by not leaving your kids with them? You would be entitled if you told them that although they complained, they still had to babysit.", "NTA. they can't have their cake and eat it too. they asked to help you out, then behind your back said hateful things. i wouldn't feel comfortable leaving my kids with people that two-faced either. who knows what they could be saying to your kids behind your back?", "ESH. I'm curious what the actual words that came out of your parents mouth were. But I think cutting off contact altogether just because they don't want to be regular childcare anymore seems extreme. Most redditors will say it's your right, and they are correct. But i think taking kids away from living grandparents because of issues between the adults seems extreme. \n\nAlso, your sister needs to stay out of it.\n\nI would give patches another chance but just with boundaries. If they have an issue, they need to not be passive aggressive.", "NTA. \n\nYour kids should be with people who at the very least do not talk smack about you.  Your parents might’ve just been venting in the moment but it’s a crappy immature way to behave and the girls would’ve picked up on it for sure.  \n\nI’m sure this is stressful for everyone but you have to make choices that are best for your kids, even when that’s super uncomfortable for your folks.", "NTA, but I think your parents may be able to apologize and you can mend this. If your parents are asking for the kids to come back, they must miss them, and maybe the conversation you overheard was BS. It’s still totally uncool for them to unload their supposed grievances against you to your sister behind your back, but they might not REALLY feel the way they claimed to feel, and may have been venting because they were feeling badly and you were an easy target by not being there (or so they thought, lol). \n\nTell them clearly that what they said hurt you, but that you will not allow them to feel taken advantage of and so you can’t let them babysit unless a serious discussion about boundaries and feelings is had. Maybe they’ll come around! It sounds like all of you had a great thing going, and it’d be a shame for it to end over this.", "NTA. But I think it sounds like you guys need to talk. I'm thinking your parents want to be grandparents and not nannies. They want to watch your kids occasionally, but not like it's their job, so maybe come up with a compromise. AND tell them that they are not to talk about you behind your backs or to your kids. If there's an issue, they need to talk to YOU. If they can't respect that, keep your kids away from them.", "Does \"entitled\" even mean anything anymore?  \n\n\nNTA - believe people when they show you who they are.  \n\n\nMy only question is:  Is there a chance that they don't want to spend time with your sisters kids so they were putting it on you?  - I mean, S NTA", "OP can't trust the parents to not talk trash. NO UNSUPERVISED VISITS WITH AHs.", "Yes! Children hear way more than you would think. My 3 year old will repeat things they hear.", "Why do they deserve a relationship with people that shit talk their parents behind their backs? \n\nMy mother is a homophobic religious conservative and I'm queer as fuck. She doesn't deserve a relationship with me or my partner. Just because someone is related by blood doesn't mean you're required to love them and accept their abuse.", "I agree, let them see the consequences by purposely keeping them away for a good 3 months. Also have a candid conversation. I love my grandkids and also watch them several days a week. I would never ever complain about them, and if I can’t watch them I let my daughter know. I’m sure they love them, but they owe you an apology for how they behaved.", "more upvotes!", "They need to learn the lesson. Hard truths need consequences to sink in. I don't think anyone expects this to be 100 percent none forever. But they need to be woken up. The ball is in their court.", "If they're acting like the kids are burden, the kids are going to pick up on that eventually. That could hurt them even more. Also, you have to do what's in your family's best interest, even if your kids don't like it.", "Ah, so you are one of the 70.23 MILLION baby boomers in the U.S. and not an AH. Go figure. Perhaps one of the commenters complaining about this generation will take hope. According to Statista, there are currently 72.19 MILLION Millennials, so there's no call to make a sweeping generalization about them or any other generation (all of which are less numerous than the Millennial generation).", "YEP I said as much in my post buried someplace in here.", "this is it!", "I said as much on my post someplace here. Me thinks there's. WAY MORE to this story.", "I believe there's WAY MORE to this story then what is being shared.", "Because they asked too. And they never once brought the problem to OP's attention before he found out they were bitching about it to OP's sister.", "Oh she obviously felt she could say a lot including accusing OP of being a bad father. He is giving them what they said they wanted.", "they did nothing wrong? they insisted on babysitting and then just complained about it calling op a bad father who doesn't take responsibility instead of having a conversation. like what type of childish games do you play if you think that's okay?", "they probably heard it other times", "Do you parents have \"savior syndrome\"? My parents would pull something like this if I had let them. They offer something and then lord it over your head or tell other people about their sacrifice. Or they make a big show about offering something but they really don't mean it. \n\nWhen my son was a baby, we went to visit them and my parents insisted we don't bring his portable bed/equipment. They borrowed some from a local friend. At the end of the visit, we had to go to this person and basically grovel to them. My dad exclaimed, \"you saved our life!\" \n\nThey always wanted to paint us as irresponsible and needing help. Sounds like your mom.", "NTA. \n\n1) Why was your sister arguing that you're taking advantage of them *now*? The whole reason you're not taking them over to their grandparents anymore is because of that so what even is her argument?\n\n2) Were you paying them to watch the kids? My sib pays his kids grands to watch them, but less than he would a daycare. Was that the whole point of this nonsense?To get you to pay them? No payment, but fewer days?  God, it's so annoying when people don't just say wtf is botherine them so you can deal with it!", "They want the kids.\nThey also want to play the victim to others. \"Oh wow they are such great grandparents! How terrible they have to basically raise their grandkids tho!\"\nYour not playing into their false narrative so now they are upset.", "I understand you’re a little worried because Julia is really close to them, but she can still see them, just when you all go to visit or your parents visit you. But I agree with you on stopping the babysitting/solo visits.", "Just smile and whenever they ask to have kids say \"thank you, but I'd hate to burden you guys with additional duty. I want to be a responsible parent, too. So no more pawing kid to grandparents haha!\" or any other lighthearted version that you come up with. Kill them with kindness.", "They want to have their cake and eat it too.\n\nBe with the grandkids, but also play the victim to others like \"Oh it's so hard when you have such an irresponsible child who pawns of his own child on us, but we manage somehow\"", "OP should still keep the kids away from them (at least for solo visits) because the grandparents cannot be trusted to not be disrespectful and self-aggrandizing shits.\n\nedited to erase a stray letter", "I would guess that sometimes they want the pleasure of being the rescuing parents, so they volunteer to babysit, and sometimes they want the pleasure of being the martyred parents, so they bitch about it.\n\nFrankly your kids don't need that kind of thing in their lives.", "So...you need to 'take responsibility', but now that you're doing exactly what they want you're the asshole?\n\nNah man, just keep doing this. They wanted this, you're just respecting their wishes by not having the kids over.", "They can see the kids on holidays and family times when you are there with them. That seems to be the only grand parenting they want to do.", "Supervised visits - don't let either of your parents be alone with your children.", "I would say allowing the kids to still visit with them for a weekend afternoon here and there is normal and reasonable. They would still know them without you “pawning them off”. Get them both into a good daycare for the week and I would settle it as maybe 1-2 weekend afternoons a month for visits. Thats just my opinion after reading all comments and the post.", "You really should never leave them alone with them. Because they will either verbally or nonverbally undercut you.", "Keeping your daughters away from toxic people (at least not w/o a parent) is not hurting the girls; it's protecting them.", "OP did try to talk to his mother; she insisted he was wrong. Using grown-up words is necessary but not sufficient because the OP's mother needed to use them too. If the OP could stand it w/o barfing, the parents could bring their daughters to visit the Martyr grandparents every single day but not unsupervised. If the grandparents do something to regain trust, then the OP could change the arrangements, but not the way that things stand.", "Agreed! The entire we are so perfect and don't take advantage ever and then this so called random and surprising reaction don't jive", "Ah. NVM.", "This was my thought too. It was a mutually beneficial relationship where op got to save money on childcare and their parents got to bond more with their grandchildren. It served nothing other than their ego to lie about why they were helping out. I doubt they actually think op is irresponsible they just didn't think the gossip would ever come back to them.", "Loansharking favors", "Narcissist was my first thought. I never knew which way to turn with my mom, constant 180's, contradiction, made me feel like I was crazy til I figured it out. \nFeels like she was just gossiping about how put out she was and when you caught her running her mouth,  instead of apologizing she doubled down.", "They did figure it out. The grandparents said by allowing them to babysit, op and wife are deadbeat parents. So, OP made other arrangements. The grandparents made it abundantly clear they did not want to babysit anymore. So now they don’t. Problem solved. They can’t have it all their own way.", "Because they didn't ask for any compromise, they just wanted to bitch about OP.", "If circumstances changed, I would assume that the OP’s parents still have a functioning mouth, considering they were flapping it to the sister while they were complaining. NTA", "Probably jealous. You are out having a nice life probably. Nothing wrong with daycare. Our kids go 5 days a week. And grandma helps evenings and weekends. It takes a village and kids that socialize more will network better in the modern economy.", ">they are pissed because they now want to watch the kids. Smh\n\nThey can't play martyr if they're not being 'put upon'.", "They want to have the kids over exactly when they want and exactly how long they want, and they want it to be a big favor they're doing OP. \n\nAnything that deviate from that, such as babysitting on OP's schedule or OP being perfectly happy to hire a babysitter, is OP being a terrible ungrateful brat who is taking advantage of his poor parents. Simple, right?", "No. Don’t give them the option. They get to see the kids during holidays and family dinners when both parents are present. And that’s it.", "Plus the sister is irritated as well. There's the missing missing happening here.", "Manipulation is a key part of abuse. Grandmother was getting very close to that line. Better to stop the solo visits before it gets that far.", "And that's the part that I don't understand. They were literally watching the kids so that you could go back to work and then they talked shit about you to your sister behind your back. If they were my parents they wouldn't see their grandchildren anymore...fuck them. I can't wait for one of my kids to give me grandchildren and I would gladly baby sit them for free while they were at work anytime they wanted me to.", "[deleted]", "They just want something to moan about and maybe get some sympathy. Alot of grandparents do this, offer/insist on doing too much then moan about it but won't admit they are too old to take it all on.", "power (limited, but they are AHs....)", "To have a second chance after screwing up their own kids. Toxic. OP, NTA.", "or like in my parents' case, they don't care. \n\nI wonder what r/aitachildcare 's mother said when asked why she lied about wanting to watch them?", "This is a life changing event for the whole family, so if they want to be permanently estranged then yeah I guess they figured it out.  Too devastating to think this should be the final outcome.", "Isn't this a time where they can teach their kids to show some empathy? Don't we all get fed up with our jobs once and a while? We all loose our temper. We are all worn down and tired after working long weeks. I don't think it should be a life sentence for the everyone because the grandparents were complaining. We don't know what was going on to make the grandparents all the sudden feel overwhelmed and resentful. I can definitely understand the OPs frustration. By why not try to be the bigger person and say sorry that is become too much for you guys. Give everyone the option of what works for them. It doesn' t need to be all or nothing. Maybe they were feeding dinner to the kids and that was what was overwhelming. So if that's the case offer to work around that.  It's clear that everyone loves the kids and wants what's best for them but not at the expense of the grandparents health and happiness.", "This is it, this is the comment I was looking for - they just wanted to play martyr to OP’s sister.", "I’d also argue that Grandma is one of the primary caregivers since she looked after the girls every week multiple times. She’s not just Grandma, she’s in loco parentis and the girls will see her differently to a regular grandma who they see monthly. Totally NTA. Never leave your kids with people who are making accusations of neglect or abuse or poor parenting when there is none.", "This feels like the grandparents want to be seen/feel like both saviors and martyrs", "Just an add-on your sister sucks, siblings should have each other's back especially when a parent turns on one of their kids for stupid and illegitimate reason. NTA but your parents and sister are big ones", "Soooo many people who just choose to gripe about complaints as their default conversational mode, to the point of pretending to be more put out than they really are so they can gripe longer and in detail", "It isn’t like they are estranged. They just don’t get solo time with the kids. They see the kids when they see OP.", "Or maybe OP's parents are assholes.", "NTA and I've been in a similar situation. My daughter was with my husband's parents two days a week (their request) from the time she was six weeks old until she turned 1.  She was with them 2 days a week and then nursery school 3 days a week. It was never something we expected or needed from them, and they seemed happy to be spending time with her.\nOne day my MIL asked my husband to fix her computer and my husband said he wouldn't be able to until the weekend. They bickered and she snapped at him and said \"I take care of YOUR kid two days a week ... You think you'd be willing to do one thing for me...\" That comment took us by surprise, and not long after that, we switched her to full-time daycare\n\nDon't play that game with family. They are human and they are entitled to be tired, frustrated, and opinionated. They probably were talking out of their emotions, but that doesn't make it right. You don't want your little ones growing up under the impression that you \"pawn\" them off on other people. It sounds like you did the right thing.", "I am so confused. So they were mad that you were “abandoning” your kids and that they had to look after the little ones, but now they’re mad that you’re giving them what they want? What tf is wrong with your parents?", "Some of your post is a bit confusing, especially the last paragraph.  Correct me if I read this wrong, but it sounds like you expressed needing childcare and your parents volunteered, and each and every time you asked, they accepted without complaint.  Fast forward, and you overhear your parents complaining to your sister that you and your wife are terrible parents because you have them watch your children too much.\n\nIf my interpretation is correct, then you are not TA.  At the same time, however, you will be an AH if you cut off or significantly diminish contact between your parents and their grandkids.\n\nIf I had overheard the conversation you describe, I would ***never, ever*** again ask my parents to babysit.  Instead, I would tell them that they are welcome to come visit the grandkids any time that works for everyone, and when you tell them sound sincere, and follow through doing your best to accommodate at least one weekly visit, if that is what they want.  Or, if they prefer visits at their house, then accommodate those visits when they work for \"ALL\" of you to go.  In other words, do NOT ever just drop the kids off at the grandparents house.\n\nThere may come a time when your parents realize that what they did was wrong.  They may apologize and ask to be more involved and babysit.  It sounds like they over-committed and then realized that 2 to 3 days a week is just too much.  Depending on their age, it is possible that they just get too tired out with such little kids.  However, talking behind your back, questioning your parenting, and then getting mad at how that terrible behavior backfired for them is very, very immature.  They should apologize and learn the benefits of respectful, direct conflict resolution as opposed to back-stabbing, passive-aggressive complaining which never solves problems.", "NTA as someone who was “passed around” from one family to another since my parents aren’t together, this kind of mentality does affect the children. little comments here and there like “your parents don’t care enough” or “we spend more time with you than them” make up a very difficult relationship with every member involved from the kids’ perspective. in my humble opinion, i would recommend REALLY explaining that to them and if they don’t understand or come to an agreement you know they shouldn’t be considered to take care of your kids !", "NTA. You’re the parents and get to decide who watches your children. Your parents lied to you and your sister. Nah. Don’t need two faced grandparents.", "NTA. So do they want to have the kids or do they think they think your pawning them off. You can’t have both", "NTA. They lost their right to watch your kids when they complained to someone else about it. \n\nMaybe when they mature and are able to have an adult conversation about how they feel about things, they may be able to watch the kids.", "NTA you heard them complain about having them watch your children, so you found someone else to watch your children. You literally stopped doing what they were complaining about! So what's the problem? Nothing, you found out your parents wanted to have a martyr complex over your children and adjusted it from too much time to no time. Boo for them, but much better for your kids.", "Parents babysit but complain\n\n>being selfish and basically just pawning off our children. Basically abandoning our responsibility.\n\nBabysitting stops\n\n>My parents are mad and think I'm being entitled and unreasonable\n\nThere is nothing entitled about not sending children to grandparents for babysitting\n\n\n>My sister has jumped in claiming I'm a horrible son and taking advantage of them, \n\nBy refusing to let them babysit?🤪🤪🤪🤪🤪🤪🤪🤪🤪🤪 tell your sister that since you have become aware that the babysitting was a problem and taking advantage of your parents,  you have taken steps to stop taking advantage of them,  she should be happy. \n\nHow did you survive growing up in a family of drama llamas?\n\nNTA, obviously. No reasonable person would complain about babysitting grandchildren and then complain about not babysitting grandchildren.\n\nI wonder if parents were always happy,  but golden child sister was complaining,  so they went along with it.  Now there are consequences,  of course they blame you rather than themselves.", "NTA OP. Maybe instead of a three times a week thing, make it a once a week thing. That way your kids still can see their grandparents, but your parents don't feel put upon.", "NTA! You made a good decision for you and your family. I hope they never get to watch your girls again they don't deserve to enjoy your kids anymore", "While it sounds as if watching two children instead of one became overwhelming for your parents, they certainly didn’t handle it in a kind or responsible way.  They needed to use their words and tell you in a calm moment that it feels like too much.  Griping it about it behind your back and then attacking you when they were overheard demonstrates poor judgement.\n\nI don’t blame you for putting the brakes on having them provide childcare, but once it calms down a bit, perhaps you might have them over to dinner to spend time with the kids while you are there to do the actual supervising.\n\nAs for their being upset you pulled the plug, you are not responsible for their feelings.  Let them be mad.  Their behavior created the situation that led to their no longer being the primary babysitters.  I feel you did the right thing.  Resentment would have carried over to the kids or would have been overheard by them at some point if you hadn’t nipped it in the bud.\n\nNTA", "NTA  \n\n\nYour parents wanted their cake and eat it too. They wanted to look like great paragons for taking on the burden of looking after your children, and to turn your sister against you. They seem to have not considered how grossly offensive that would be to you.", "NTA \n\nDamn I’m just as confused as you. They think you’re a bad parent but also want you to drop the kids off with them??", "nta - one of those few situations an ultimatum conversation could be helpful. Either they want to help and aren't going to criticize you when they agree to, or they don't get to take care of the kids ever. It's pretty simple.", "It wasn't ok for the grandparents to talk about OP like that but OP needs to sit down and talk with them rather than blowing the relationship up. \n\n\nI have two kids of similar ages and both my partner and I work full time. Kids that age are a huge amount of work and are completely exhausting. \n\nHow long are the kids with the grandparents for? Like 2 hours or eight? And I'm wondering if the grandparents have had any health issues or slowed down a bit in the last five years. \n\nOP and their spouse should have checked in every six months to see if the arrangement was still ok with the grandparents to avoid this situation", "NTA. Your children, especially the older one, should be with other children. Grandparents obviously can't provide them everything that childcare centre can. \nAlso you shouldn't panish either parents or children refusing them to meet. Visiting grandparents on weekend together can be good idea.", "Your parents didn't expect you to find out about their complaining.  Find a new sitter.  Tell your folks they are welcome at your home anytime you're there to visit and see the kids.  If they offer to babysit, if you take them up on the offer, PAY THEM for it.  I don't think YTA but sometimes people volunteer for things and then realize that it's too much for them.  Maybe your parents fall into this category.", "NTA your parent want to make themselves martyrs. Look at us poor us forced to watch these kids... and I'm sure your sister loves feeding into it.", "NTA but I think it got too comfortable. I'm sure 17 years ago, it was a lot easier for your parents to watch a kid and as they got older it is a little tougher. \n\nThey should have spoken to you about it (if that is the case) rather than trash talk you behind your back. \n\nThis 100% sounds like my family. My parents watched every grandkid starting when the now 20 yo was born to even now with a 3 yo. My mom asked to do it. She still does it, but my mom at 47 and my mom at 67 are very different. There are times she complains about it but she does it because she won't ever abandon her grandkids. But sometimes she needs to blow off some steam. \n\nI'd sit down and talk to them again. See if they need a break and need more time between watching the kids. Because for them, this can feel incredibly unfair that they spent years watching your kids to help you for you only to now not bring the kids around.", "NTA", "NTA", "Are you not taking your kids to visit your parents at all? Because if that's the cause Y T A. Because at the end of the day your girls are used to seeing them for half the week and a sudden complete separation from them could have a really bad impact on them. I wouldn't let them babysit or visit unsupervised though.", "NTA. It appears that your sister is jealous. You didn’t mention if sis had kids herself. All in all, that’s immaterial. You’re damned if you do, and damned if you don’t. More than likely, the truth is, that your folks took on more than they can handle. Kids are exhausting. Keeping them away from electric cords, figuring out how to unlock doors. Fussy eaters, Stripping off their clothes in the back yard, free balling it ( that was mostly my oldest.) Kids are exhausting, especially if they aren’t your own. They’re confronted with different routines, different boundaries, as to behavior, etc. Let the grands watch the kids on occasion, but not as permanent child care. Other times use a regular sitter. Perhaps a daycare, even for half a day.  Grandparents have their own routines, as we all do, but as we age, we aren’t as eager to go, go, go, every minute. We like naps too. As an afterthought, about overhearing sis talking with your folks. They might have said those things about pawning your kids onto them, just to appease your sister, bc she‘s been acting like she’s the unwanted child. Jealousy, pure and simple.", "How often were they left with your parents? Was it while you and your wife were working? Or was it also on your day off? Why would your mom think why you said? \n\nOn one hand I would rather my family watched my children then some stranger. But at the same time how much time are they really left in someone else’s care?", "NTA.  They seem like martyrs.", "Honestly, it upsets me to think your kids will be missing out on a relationship with your parents simply because your parents couldn't communicate like normal people. NTA, and I think it's more than fair to not leave your kids with them at all.", "At least YTA, though possibly ESH depending how much everybody let things escalate in the heat of the moment.\n\nYou're all grownups, and sometimes one word leads to another and so forth. Your parents made the first step by calling you 3 weeks after the incident, you should have seized the opportunity to talk things down at least somewhat calmly. Instead you act like a 6 year old and continue with your temper tantrum.\n\nThen sister calls, and again OP stomps almightily with both feet and draws a very stern face instead of finding out how much kitchenware is still intact.\n\nThere are no winners here, and as usual those who can do the least get hurt the most and hardest - the children.\n\nGrow up and talk to them. They're still your parents, they have done more than enough to warrant a decent amount of OP jumping over his own shadow.", "NTA. I asked once for close family to watch my one son for one afternoon to complete an assignment for university that I was behind on (my son did not sleep and I hadn’t been able to do it). Got a good ten minute lecture about lack of organisation and lack of consideration for plans they had etc. They said no, which in itself is fine, but the lecture was unnecessary, I just asked if they were free and said why I needed him minded. \n\nFrom that moment, I did not ask for help or respond to comments that they’d like to see the baby more or were happy to watch him with anything but a ‘that’s nice’. 18 months later they asked if they could please watch him. Sure, but it’s for you. Not me.", "Nta I would still let them see the kids here and there but I wouldn’t let them babysit for more than maybe once a month for our two get a regular babysitter and let them know sorry but we went with this route and we are no longer changing our minds since you guys obviously can’t handle it we’re sorry we thought you could since you said you could", "My parents (mostly my mom) wanted my kids ALL. THE. TIME. People would comment how I was \"dumping\" them there, but I would piss my mom off by demanding I keep them home cuz I wanted to see the little buggers lol. \n\nYour parents are two faced. There's no way around it. They told you one thing, then decided to flip the script when it got them sympathy. Keep your kids with you or pay for a sitter. It sucks that they don't get to stay overnight with grandparents, but it'll be better for them not to be used as pawns--or to have your sister and parents insinuating you guys don't care about them.", "INFO how did this become so extreme – they want to watch the kids but think you are dumping your responsibility on them. Are you leaving something out? Did your parents expect that the number of hours per week would be less?", "NTA. I’ve been in a similar situation before. We lived with my in-laws and my mil was busy raising my bil’s ex’s kids. Their son was his but she was also raising the ex’s daughter. Anyways anytime I needed helped she’d have them, or she’d flat out forget she’d told me she helped. \n\nWell now we all live in our own homes she eats with us often. Over the summer she started letting our daughter spend the night with her quite frequently. The whole time I’m telling my mil it’s up to her, she doesn’t have to if she doesn’t want to. She continues. Well one day she comes in with my daughter and said I’d she got “any rougher” she was gonna have to charge us. I had to bite my tongue because for one she didn’t have to take her in the first place, for two she’s told my bil the only reason she charged him for his son is because he was bad. \n\nMy sil filled me in that my daughter and mil were at her house and my daughter (5) was opening and closing the pantry door. My sil had told her to stop but like kids sometimes do, she didn’t listen the first time. Sil said our mil just starts going tf off screaming that’s she’s gonna spank her ass I’d she doesn’t quit it. Like that is sooo inappropriate. Should my daughter listened to her aunt? Yes but that doesn’t mean go from 0-100 the next time you say something to her. \n\nThat evening my mil brought her home she was totally filthy as well and she said that shit about charging. Needless to say my daughter didn’t go back with her grandma for a looooong time, and doesn’t very often anymore, which she’s in school now, but even if she wasn’t she wouldn’t go that often. \n\nI might’ve been wrong letting her get my daughter so often I dunno (once or twice a week), but I just thought she was finally enjoying time with her granddaughter. Can’t do right by some ppl whatever you do 🤷🏻‍♀️", "NTA. After a direct conversation with them, I would allow them over every two weeks or once a months or something like that and then they can see your children in your house and there are no conflicts about responsibility and babysitting and the girls get to maintain the relationship.", "NTA. Your parents I have to say are incredibly confusing. \n\nAs other posters have suggested think you and your wife need to have a discussion with your parents. \n\nThey need to state exactly what they feel would be  the correct amount of time for them to babysit. \n\nThey can’t sign up to take them every week for work conflicts then crab to your sister or whomever in how they are being taken advantage of. And agree to the concern expressed by other posters as to what exactly are they telling your kids?  \n\nSo do they want to do the two days a week you indicated there can be work conflicts or do they want to do a couple hours on some weekend day perhaps while you run errands and such?  \n\nI would suggest you keep looking for a more permanent solution and keep the current sitter while you work out a schedule with your parents. \n\nIf they can’t come up with a reasonable schedule or they keep facilitating between want to watch girls and being so abused then tell them to let you know when they figure things out.", "You're right they should just write off his parents! 😁", "Yta and nta. When you overheard them talking you should have taken an apologetic approach. \"I'm sorry mom, tgere seems to be a misinderstanding. I wish you had told me that you were no longer wanting to watch the kids. We're happy to make other arrangements. \"\n\nNta because your mom could obviously speak wors, but chose to share them with someone who was not you. Furthermore, she can't have it both ways. Either having the kids is a burden or she wants to have them. Which is it.", "Seems like a good time to have a sit down conversation and discuss this calmly to express your concerns. Then see how they reply. Getting into a large argument and making snarky comments or backstabbing is not the way to handle this.", "NTA. I'd suggest telling your sister the truth too", "NTA\n\nMIL \"loves\" all her kids and grandkids.  She loves spending every minute with them.\n\nOnce, when she was visiting us, apparently, she was ignoring one of her son's phone calls.  Then she announced to us that her son (SO's brother) has repeatedly called her and finally left a message to ask if she can watch their kids.  She still didn't respond long enough that the brother was concerned and made a phone call to his brother (SO) to see if their mother is okay.\n\nThen when SO relays the message that other son was looking for her, with a scowl, said to us, \"He's only looking for me to babysit, so I'm not answering.\"\n\nShe's a hypocrite and so are your parents.  Is wanting to spend time with the grandkids that horrific?  And if so, why do they sing a different tune when in private?  YOU are not selfish.  \n\nDuring MIL's visit, SO and I left to pick up breakfast for everyone.  On our way back, SO got a frantic call from MIL.  Apparently, she heard \"a car door slam\" and assumed we were back, so she opened the front door and left it wide open, allowing 4 dogs to escape and roam the neighborhood.  Fortunately for us, the dogs and everyone involved, the dogs were secured and back inside the house before we made it back home, with breakfast.  Upon our return, the MIL went straight up to me and said verbatim \"it's because you took too long\" so that no one else can hear what she said.  Uh, I don't remember making a mistake that could have been perceived as an accident, but the blame game is made me view it in a different light than what I normally would.  I said \"Let's not open the front door\" to everyone, not just her.  Later, when SO visited her, she blamed SO.  Months later, she blamed the other houseguest, her brother and declared that she said no such thing to me.  Not once did she apologize for her \"mistake\" and made every effort to ensure that anyone who would listen understood that she is not to be held accountable. \n\nLimit contact as necessary and as you are comfortable.", "NTA\n\nBut I would say it in writing, in a group with mom and sister.\n\n\"I had no idea that watching the kids felt like a burden, I was saddened to hear it because we thought  the kids were WANTED that much or we would have had them in day care. We will be enrolling them immediately, and while this is a reasonable choice and what we always planned to do, it will obviously limit when the kids are available to spend time with other folks. That's the logical tradeoff, it's not intended to be punitive, that time is WHY you asked to have them in the first place. We love you, and I wish you had discussed this with us instead of complaining about a problem we had no idea felt like an issue.\"", "NTA. They did talk about it behind your back and indicated they were resentful about it. What else could you do?  Now, if they want to spend time with the kids they can ask but not to babysit.  What they were doing is typical martyr behavior and it’s extremely toxic. The children would have heard it eventually.", "OP your parents said what they think and must now pay the price. NTA.", "NTA I wouldn’t leave my kids with someone who doesn’t respect me or talk crap about me to make me seem like I don’t care about my kids.", "NTA", "NTA and I think they were blowing shit out their ass to make others feel like they are the better parents. It just doesn't make sense for them to talk behind your back then still talk mad ish when you give them what they want. They sound like they will talk no matter what you do. I would say you should have a family therapy sesh to talk out where this hostility is coming from. You prob don't need to banish them forever, the kids probably won't like that.", "NTA. It would be different if you did push the kids on them, but if they’re saying “why pay for daycare when we can spend time with our grandkids” to you while saying “can you believe how they take advantage of us, what terrible parents” on the other, nope, you’re in the clear going with your original plan of finding childcare", "NTA\n\nIn a similar situation with my 15 mo. The grandparents 'want to see her more', but when we ask when we should bring her over, they 'can't be watching our kid all the time'... So do you want to see them or not?? One afternoon a week seems like a good amount, until they complain about not having a weekend to themselves AND not seeing their granddaughter for a whole week... simultaneously...\n\nAll they want is fun and games, but young kids are NOT all fun and games. Can't have it both ways! \n\nSo now you'll bring the kids over less and be the bad guy for that too lol I'm sorry", "Have you had an open conversation with your parents about what you heard at your sisters?\n\nOr are you gonna be just like them and operate behind the scenes with only passive aggressive and pettiness?\n\nSit down with them and Discuss why they insisted on babysitting even though they clearly resented it? How doyen they would actually like to babysit. And then move forward.\n\n\nCOMMUNICATE WITH YOUR FAMILY", "ESH. Them for not communicating with you or setting boundaries and instead complaining to others. You for retaliating and not letting your kids see their grandparents. \n\nJust sit down and have a real conversation.", "NTA at all and you are not alone. My parents alienated 2/3 of their kids and 7/9 grandkids for doing this very thing and when things went south, they took it a step further by calling CPS over non-issues.", "Info do you only take your kids over for to be babysat or do you ever just visit with your kids?", "NTA", "NTA \n\nSo they want your kids but they also want to complain about watching your kids?\nTell them you are confused and don’t understand the mixed messages so it is easier for you to find stable childcare elsewhere since this seems to be upsetting and confusing for them. I’d tell your sister to mind her own business.", "Tricky. You are berefting your kids of their grandparents, which is going to be hard on them.\n\nYour mother was talking bs behind your back. Is she one to dirty talk often, as a hobby? Is it something to take seriously? Or is she one of those professional mother-judgers. \n\nYou don't spend enough time with your kid. \n\nYou are a SAHM, you are a moocher and too old fashioned. \n\nYou work! Don't you love your kids?\n\nYou cuddle them too much! \n\nYou spoil your kids.\n\nYou are too hard on them.\n\nYou feed them wrong!\n...\n\nINFO: Did you try to discuss some \"new contract \" with them? \n\nINFO: How about your father?", "ESH not everything has to be a nuclear option. They could have asked for a bit less you xould taken on some more.", "I also dont think it's a good idea for parents to bitch to their daughter about their son without first confronting the son. It's one thing to vent about your son overstepping boundaries with babysitting when you've actually voiced those boundaries, it's a whole other thing when you haven't said a word to the son but you're bitching to your daughter.\nThere's a phrase I quite like - if they complain about you behind your back but haven't spoken to you about it, they don't really have a complaint about you, they just like complaining.", "Exactly. Why didn’t the parents have a sit down and talk about it adults all of you are. No let’s talk crap about our son and his wife and they babies the leave behind. I’m sorry op your parents are the assholes here not you.", "I disagree. While technically correct, \"it's your choice\" is just selfish and egotistical ignoring of the fact that OP is far from alone, and that essentially her feelings and hurt pride pale in comparison to what the children deserve and need. And there's a certain couple of parents she owes a ton on top of that.\n\nOP, grow up and get the issued cleared. You owe it to your children and yourself.", "This. And they straight up lied. OP didn’t ask them to watch the children. They offered. Imo mom was playing martyr. “Look how much I dooooo. Look how wonderful we are. It’s so hard to be wonderful meeee” is the subtext. This post created a very strong feeling in me because IVE BEEN THERE. We are LC with my in-laws because of shit exactly like this. They can invite our kids to movies or come over for activites but we never. Ever. Ask them to do anything for us. Because without exception they make it sound like we need their assistance and are irresponsible incompetent parents. People like this don’t deserve relationships with grandkids. My in-laws know that we get even a WHIFF of them speaking badly about us to our kids or even other members of the family- what time they do have with our kids will be no more. \n\nIt’s not wrong to call people out in a fact based way and create\nBoundaries.", "I totally agree with this! They can have visits and just be grandparents at this point. I agree with being honest about how hurtful they were, but finding a way to move on and allow them to be in your life while also not crossing your boundaries (for example they can't expect you'll bring the kids over multiple times a week while you work etc.) So reasonable expectations for you and them can be set .", "ETA:\n\nIt's the parents' job to worry, that's simply how it is. The same should apply to OP, parents take second place WRT their children. That's probably what OP's parents did, after all they still took the children whenever asked even when they thought there should be better solutions.\n\nTake a deep breath, count to ten, and call your parents. Time to clear this stormcloud up with a good calm talk. Whatever happens they're on your side.", "You failed to read where the grandma said just let us watch the kids.", "The \"point\" he is proving is that they don't get to shit-talk their son and DIL and call them terrible parents behind their backs and in front of their children. OP's parents have sadly proven that they cannot be trusted, so they no longer have unsupervised access to the children. Hopefully OP will eventually allow short, supervised visits at some point in the future, but if I were OP there is no way I would ever leave my kids alone with my parents again.", "OP said that the kids are only with his parents 2-3 times a week when his and his wife's work schedules overlap. So it sounds like the parents spend plenty of time with their kids. I suspect that MIL doesn't really like the wife and this is a veiled insult about her working instead of being a SAHM.", "Why pretend everything is ok?\n\nIsn’t that what you’re mad at your mom for doing???", "Because they want to play the victim/hero card for some reason. Why else would they talk about how much they do and then turn around and want to continue to take care of the kids. They want to have their cake and eat it too. They want people to applaud them for how much they're doing and how selfless they are to take care of their grandkids that much.", "They didn't tell you anything.  You overheard their exaggerated gossipy bitching.\n\nIt's hard to say what they really feel, because they are probably the type to bitch to each person about everyone else that's not in the room.  They probably get off on that kind of vibe.\n\nIn these situations though, I find it best to take everything at face value.  So your current course is correct.\n\nIf they want to walk back their words, let them. But do tell them you heard word for word what they said.  Don't let them weasel out of that.", "INFO: out of curiosity was your mom a SAHM? Is this all stemming from you having to return to work and therefore “passing your parental duties” on to someone else, ergo being a “shit parent”, because that’s not what *she* did?\n\nI’m sure a lot of people would love to stay at home with their kids, especially for the first few years. But ya can’t survive off of air alone🤷‍♀️", "My mom does this to my sister and I. She rarely took my kids when they were little and she never babysat them, and I had really bad migraines when they were babies/toddlers. \n\nShe was fine taking my oldest when she wanted her but never did it with my youngest. My youngest has never felt loved by my mom and my dad is complicit in their absence. \n\nMy sister is divorced and my niece has my mom in her life daily and has since she was 3 months old as my sister lived with my parents for about 8 years after her divorced her husband. They now live close to my parents and my mom walks my 10 year old niece to and from school most days. But she complains about it regularly.\n\nMy mom sees herself as a saviour - to my niece whose parents are both super cranky, impatient, and resentful of everyone and everything.  My mom sees herself as the stability, the encourager and the comfort my niece doesn’t get from her mom or dad/step mom. She complains about how much she does for my sister and niece allllllll the time. When she finally does pull away she does it while making mean comments like your mom and sister’s comments. \nShe doesn’t know how to gracefully take a break. I know she’s complained about me and my parenting to people (my kids are now 19 and 17). She takes her resentment for my sister and niece out on my kids now. My mom and my sister have terrible boundaries and awful communication. \n\nWhen my mom gets like this I disengage and give her space but she also gets space from my kids. They don’t need that toxic bullshit and they’re now old enough to be the target of it. \n\nDraw your boundaries. And hold them. If that means you meet them at the park, or for the occasional visit when you’re also there, so be it. I doubt she’s going to change… she wants to be the cool, involved grandparent but roll resent it and complain about it as well. Learn from it. Sorry you’re experiencing that. \nNTA", "This is easy. They like the sympathy it gets them. Looking after your kids so much is such a burden and aren’t they just so selfless and amazing to do that, etc. they can spin a tale about how they had to step up because the parents just won’t! Oh woe! \n\nExcept, You’ve pulled the curtain away now though and they no longer get to gossip and smear your names whilst painting themselves as the childrens saviours. THAT is what they are pissed about.", "I don’t get why they never spoke to you directly about it since they were the ones who talked up them watching the kids in the first place. NTA.", "Certain mentally ill people, such as narcissists, find that shit talking one kid is a great way to bond with the other. They don't get how healthy relationships work and bitching about other people is the only conversational tool they have.", "They were free not to offer so much free child care then.", "But how would you know if it's a fair compromise? The grandparents are liars. It seems likely, based on past events, that they could negotiate something like kid time 2x a month, act all happy about it, then continue bitching behind OPs back. You would never know if they ACTUALLY want to spend time with the kids because they lie.", "How are they defining you raking responsibility? Do they want the kids to have a SAHP and are trying to force that? I'd (try to) make her define precisely how you've supposedly been dodging responsibility. I bet the goalposts will move like the roadrunner.", "Visit the grandparents with the children and invite them over to your house where they can be with the children,  monthly or fortnightly, this is normal grandparent level of contact IMO. \n\nMaybe they could babysit one evening a month for a date night, but given their comments,  perfectly fine if you choose not to. \n\nMaybe a calm discussion with your parents about where is the mushed ground between withholding the children and taking advantage of them.", "Just don’t use them for babysitting at all from now on. Let them know you’ve sorted different childcare but if they want to take the grandchildren out they can but they need to approach you. So on a weekend they might ask to take them to the park, but it’s not you asking them to take them off your hands or baby sit. \nYou’re 100% NTA - they’re being martyrs about this.", "Consider having your parents around to visit the kids at yours. You get to supervise the interaction and control the environment and it's on your terms.", "I think they meant the kids did nothing wrong. Which is true, but I wouldn't want that duplicitousness and resulting drama around my kids, either.", "Ah, that makes sense.", "Try being adopted by one just because your adopted mom has a savior syndrome or covert narcissist is what she ended up being. I'm pretty certain it's the same thing... I'm NC with them for 10 years now after 10 years of my adult life being misery", "2 or 3 times a week is excessive, if both sets of excessive are getting that the kids will be visiting almost every day. \n\nOP made it clear  they don't need grandparents to babysit,  but they asked.", "I would say once a month, meet at the park or something.", "Your parents were being unpleasant and disrespectful. But they clearly do want to see your kids and your kids will miss them. I can see why you are annoyed but cutting them off completely because you are angry is selfish. You need to get together with them and have a proper talk like adults. Maybe your parenting does have some concerning aspects. After that you can decide how much they see of the kids and they can learn that it is a privilege to see them. Reddit is too quick to end relationships.", "A commented above said it, the g parents are wanting to be seen as martyrs and victims, I think they want OP and his wife to be falling down appreciative, practically worshiping them for all the GP do for the whole family. I bet they complained to sister r because they feel it's not enough groveling from the parents, they just said it in a roundabout way to garner more sympathy of sorts. Sister either got fooled or believe that falling down appreciative is the minimum.", "I wish I could tell you.", "I'm guessing they're currently resentful of any \"extra\" babysitting such as the overnights, date nights for you and your wife, or if either of you stay at work for longer than strictly necessary.  If all of you are together and the kids ask your parents for anything, that'd end up in the \"extra\" category.  Your parents offer because they want to be help, but they want you to only say yes if you really \"need\" them.        \n\n\nMy in-laws got very run down watching my toddler niblings.  They'd volunteer anyway because they worried about BIL and SIL.  But sometimes everyone would come over.  BIL would fall asleep, SIL would vanish, and my in-laws would have to monitor suicidal toddlers and the older grandchild while dealing with dinner.  There was definitely some resentment about those visits   \n The resentment didn't exist with the oldest grandkid and went away as the other kids got older.  It was just those years when the kids needed the most attention and BIL and SIL had the least energy to give it that made my in-laws cranky, especially since they were past 70 and slowing down quite a bit.", "But asking them \"hey, what's your specific 'ask' for seeing/watching the girls - cuz we thought we WERE fulfilling your wishes with 3 times a week, or we'd have hired childcare long ago\" can be useful in exposing any catch-22s or other agendas, etc. \n\nThen the answer can be \"well, we thought you WANTED what was happening, but apparently you were unhappy enough to shit-talk our parenting behind our backs but not come directly to us. So we're going to have work on trust and  communication, and in the meantime it's not a good idea for you to supervise the kids, not knowing what kind of conversation they're being exposed to without our knowledge.\"", "I would never trust my kids to someone who a) lied about something so important b) was two-faced about it and c) thinks so little of me and my wife. Kids are much better off elsewhere.", "> Isn't this a time where they can teach their kids to show some empathy? \n\nNo. They should be adults and use their words.", "This is the vibe I was picking up on. The grandparents want to spend time with their grandchildren, but not as much as they want to be worshipped for doing so.\n\nWhat an unfortunate position to be placed in. NTA OP, and I hope you and your family are able to find a situation that works for you, your wife, and your kids.", "My mother did the exact same thing, and my sister completely agreed with her. We don't speak now because she believed whatever b.s. our mother fed her.", "My take on this is the grandparents believe the mother of their grandchildren should not be working outside the home, and this is their way of attempting to enforce that world view on their child and daughter-in-law, and their grandchildren.\n\nNTA", "NTA - \"I'm either selfish and entitled for 'making' you watch the kids, or I am selfish and entitled for not having you watch the kids. It really can't be both.\"", "So, correct me if I'm wrong, but this is how I've understood this story.\n\nYour parents want to watch the kids, so you let them watch the kids. Your parents then suddenly have a problem with watching the kids, so you stop making them watch your kids. Your parents THEN get upset you're not letting them watch your kids. \n\nNTA because I feel like I'm going insane trying to understand their logic, I can't imagine how you feel actually dealing with this.", "NTA. Your parents lied and found out the conicquences. And they weren't just claiming to be upset at having your kids so often, they basically attacked you by claiming you were a bad parent. Your decision to not have them babysit anymore makes perfect sense, and it's their fault if they're missing seeing their grandkids. They chose to run their mouths and now they found out. Your sister is also a piece of work for accusing you of taking advantage of them for having them babysit and now getting angry you aren't having them babysit. They can't have it both ways!", "NTA. The answer is supervised visits. They get to see the kids, but don’t get to “babysit” unless they explicitly ask to keep them.", "NTA. You are giving them exactly what they professed to want. They need to face the consequences of their behavior. It was incredibly crappy.", "NTA. Your parents led you to believe that they wanted the kids. Have a frank discussion about what exactly they want to happen, so they don't feel used. Maybe they would like to be paid. Maybe the toddler is too much for them. Maybe they would be more comfortable with only 1 or 2 days a week. Ask them to speak up and be honest about what they want. And tell sis to mind her own business.", "NTA. They're trying to have it both ways, but they can't. Stick to your guns. You can bring the kids over for normal visits while you're there, but don't leave the girls there.", "NTA, and good job looking out for what they say about you around your kids.", "NTA. Especially since, as you explained in comments, they were watching the kids primarily while you and your wife were both working. It seems like the undercurrent here is they are expecting one of you (probably your wife because let’s be real, this expectation is always put on women, not men) to quit their job and stay home with the kids instead of working. That is not only an AH move to try to impose their child rearing views on you but also fairly misogynistic and old fashioned.", "Info request...explain a couple of things:\n1.  How long ago did your leave end?\n2.  \"They always seemed\" to want to watch the kids...what exactly does that mean?\n3.  At the beginning, was this a long standing agreement or just something that at first was temporary but just became an expectation?\n4.  Did you guys continue communication with your parents thoughout their time babysitting to ensure all parties were still ok with the set up?", "NTA Your parents are playing the “poor me” game. This is the game where they make decisions in their lives but complain for attention. The idea being that your sister thinks better of them for their “sacrifice” and you bend over backwards to appreciate them. By taking away the kids, you have changed the game. Now the “poor me” game is about how they can’t see their grandchildren but they would have provided childcare if you let them. In the new game, they do less but still garner the kind of sympathy that they would receive if they were still providing childcare. Sucks for you but actually they are in a better position now. They are winning the game.", "You and your wife are not the entitled and unreasonable people here. NTA", "Never leave the kids unattended by you or your spouse with your parents again. They might try to trauma bond by going ‘oooh mean mummy and daddy won’t let you come over anymore, we used to have so much fun’ and then you’ll have behavioural issues for sure. You can all meet at the park or something every other week or whenever you feel like it if you want to continue the relationship.", "NTA. And tell them good luck for you to bring the kids over ever again. Hey, at least you see their true color now.\nBuild that boundary then maybe in a few years they know the fucked up and things would change. As for your children you can actually explain what happened to them now or when they are older.\n\nI guarantee you 100% if they have the nerve to talk shit when you are around, they talk shit about you when you are NOT around to the kids.", "NTA. And tell them good luck for you to bring the kids over ever again. Hey, at least you see their true color now.\nBuild that boundary then maybe in a few years they know the fucked up and things would change. As for your children you can actually explain what happened to them now or when they are older.\n\nI guarantee you 100% if they have the nerve to talk shit when you are around, they talk shit about you when you are NOT around to the kids.", "NTA", "Nta. Goodbfor you for standing up to them.", "I’d like the add that what your sister thinks is irrelevant here.  You need to concentrate on your parents in this situation, and your wife and babies, and her opinion is of no consequence whatsoever.  Shut out one source of the noise.", "So you're entitled and unreasonable if you leave the children there and entitled and unreasonable if you don't leave the child there?? Hhhmmmm? Someone here is definitely being entitled and unreasonable and it isn't you OP.\n\nNTA", "NTA.\n\nI would be wary of what else they say when you're not around, and what your children overhear.\n\nI wouldn't leave my kids with them, either.", "NTA\n\nI feel like this is a situation where they chose to have pity over a decent relationship with you. She wanted both, but unlucky for her you overheard and found out\n\nShe’s two faced, she can’t be upset that you are listening to what she said", "NTA and they totally FAFO'd.", "NTA, WTF? My parents have a similar arrangement with my sister and BIL; they watch my nephew 2-3 days a week. You know what they say when my sister isn't around? How excited they are to get to spend so much time with their grandbaby, and how lucky it is that things worked out to make that possible. The most negative thing I've ever heard from either of them was that Nephew was exhausting that day (he's a toddler, that's expected). \n\nI can't see it happening, but if they ever DID express frustration to me, or feeling like they were being taken advantage of, and my sister overheard--they'd apologize profusely, right away. \n\nYour parents made their bed. Now they get to lie in it.", "My boys spent every Friday with their paternal grandparents until they started school. \n\nWe’d jump in the car at the crack of dawn, and I’d drive 30km to Granny and Grandda’s house, then another 40km into the city to go to work. I’d have to make sure I left their house no later than 7am or the traffic was horrendous. Then I’d do the reverse journey at the end of the day. \n\nI loved that my boys got to have this time with them. I took great care to show my appreciation and to let them know that if it wasn’t convenient or they had something else on, to let me know. The same applied to ad hoc babysitting requests - ‘no’ was a valid answer and there’d be no hard feelings. For their part, my PIL were careful to never overstep, and were just loving, generous people. \n\nYour parents are being hypocrites. If they’re complaining to your sister then who knows what they’re saying to your kids?\n\nIf you want your kids to have a relationship with them, you might need to sit down and discuss what that looks like. Your parents should only be caring for your children if they can do it wholeheartedly and without resentment, and it sounds like caring for them while you’re at work is permanently off the table. Depending on how close they live, maybe they could babysit while you and your wife go out occasionally. But I could understand your reluctance to trust them given how they were talking behind your back. \n\nNTA", "NTA\nGot a MIL I won't leave alone with my kids, anymore and they're teens.\nShe showed her true colors, trash talking right in front of them.\nIt went down.", "Your parents and sister are toxic. Make\npermanent alternative arrangements for babysitting and move on with your lives. NTA.", "NTA", "NTA.\n\nMy MIL pulled this crap too. \n\nShe would also tell everyone how she was supporting us financially (she wasn’t), and how she was the main caretaker for my children (also not true). Even went as far as to try and receive benefits for being the primary caretaker.  I put a stop to it and had someone else do watch my kids and then got screamed at and called all sorts of names by her. \n\nIf I were you, I wouldn’t let them watch them again. They did this to themselves.", "NTA. Went through the same thing with my mother, never ever again asked her to watch my now 21 mo old. Even when she wanted to, it was a no for me.", "NTA and they wouldn’t be babysitting my kids anymore. Your sister is an asshole too.", "NTA\n\nMy MIL did this too and on top of it insisted when I was pregnant that she didn't want to watch our kid. No problem, we had planned for me to stay home for a bit. When our kid was a year old she spent months encouraging me to find something part time so she could have time with him. I found a part time job that would allow her to spend two days a week with him.\n\nTurns out she only wanted time with him to play the part of an involved grandmother and she complained constantly to others, enough that it got back to us.", "NTA", "NTA but this isn’t the only time they’ve been backstabbing jerks, is it? \nThis kind of behavior seems like part of a pattern.", "How exactly are you being entitled and taking advantage by not letting them look after your children? The wanted something to moan about and instead of something real they chose to criticise you and your wife for their own amusement. They were thoughtless and got caught. This situation is entirely of their own making. They feel guilty, as does Sis, but are doubling and blaming you so they don't have to take responsibility instead of just apologising like adults. NTA", "NTA\n\nWords have consequences.   Your parents want to have time with your children AND get to be Martyrs to other people.  The fact that they were bad mouthing you and your wife is totally unacceptable.    If they are saying those things to your sister, I am sure they have also made the comments in front of your children and probably to friends and other family as well.. \n\nIn my place, they would never \"babysit\" again until I got a sincere apology. The fact that they are taking no responsibility for bad mouthing you means that they are not at all sorry.  \n\nThey can see the kids at family events when you and your wife are also there, but no solo time.    They lost that privilege by being petty, nasty liars.    \n\nYou absolutely did NOT overreact.   Don't let them manipulate you again.   You don't have to cut all contact with your parents, but I would not let them babysit again.   Will your children be as close to them.  No.   But given the fact that they said that having the children was a burden, and that you were not being good parents is totally unacceptable.     Don't reward their lies and bad behavior.", "NTA. They’re just pissed that there are consequences for being so two faced.\n\nIt’s never going to work out in the future even if your Mother apologises. \nYou would always wonder who she’s bitching behind your back to now.", "This is a huge misunderstanding and your parents should have addressed it with you directly. I think your reaction is extreme, but still NTA. A conversation with them about how often they'd like to take care of the kids is warranted. One should not assume that grandparents WANT the kids all the time. This is not an unforgivable situation.", "NTA. FAFO at it's finest. Good parents don't leave their kids in a viper pit instead of at a babysitters so good for you Dad.", "NTA, the assholes made themselves quite clear and are getting exactly what they deserve.\n\n“Mom and dad begged to be allowed to spend time with their grandchildren, and when I complied, they slandered my name to all and sundry.  The children will not be taught to trust or rely on two faced lying selfish people like my parents.  If and when they can prove to me they’ve learned how to behave like decent human beings we can discuss rebuilding the relationship they nuked from orbit with their gossiping ways.”", "Nta! And this has happened to me before. My in-laws said the same thing about us. That I just leave my kids and don’t take care of them. But I was literally working full time and taking college classes too. They just like to judge me harder cause I’m the mom. I ended up staying home with them and still going to college and my in-laws were still mad. But I’ve learned to not give a duck what anybody says or thinks about us. \n\nPs my youngest child is named Alina too 🥰.", "Sometimes people do nice things just so they can complain about it. Your parents want to feel like self righteous martyrs, and you called them out for using you as much as they are claiming you use them.", "NTA. The grandparents want to be martyrs. Stop allowing unsupervised visits. If they want to see the grandkids, they can visit your family on a weekend. Keep your boundary.", "NTA", "NTA.  I've been through something like this recently. You have to do what you think is right for your children.  If your parents have a problem, who's to say they're not trash talking about you in front of your kids?  What if they go a little crazy and bring CPS into the picture since they think you're neglecting your kids?  If they respect you so little, they may be undermining your rules and parenting choices when you're not there to stop them. \nIt may sound crazy but you have to think this way.  You can't take chances with other people when it comes to your kids.", "NTA. Sorry your parents are jerks bro that sucks.", "NTA, there are people we can't never win... your parents sound like that. Whatever you respond there are going to twisted it around another relatives for pitty. You do you.", "NTA, but if it's possible, it might be worth having a very non-emotional conversation with them. That you truly thought they wanted to watch the children to develop a relationship with them, and that you had no idea they had grown to resent the arrangement. Moving forward, you will be seeking childcare elsewhere, but they can still schedule meet-ups with your kids that you will supervise. \n\nIf that upsets them, they are being entirely unreasonable, as they can't expect to call you a bad parent and then have things return to normal? Have you asked them what arrangement they DO want? It doesn't seem worth destroying your relationship over, and you certainly don't want to hurt your kids. Maybe the arrangement can be more flexible... Like when the grandparents request the kids come over, they can watch them - but it won't be the norm.", "They need to make up their minds. Your sister shouldn’t jump in since it’s not her business and she knows nothing but one sided bs. NTA", "NTA. Your parents can’t have it both ways. Stick to your plan. See them only on holidays when everyone is together.", "Its simple, if your working while they mind your children then fine, your NTA\nIf its because your out partying and doing weekends in Aspen or Cabo, then YTA\n\nThat your sister cannot see the difference  is confusing?\n\nAn idea to \"split the pie\" so to speak, is to have them ONLY come to your home to visit?", "NTA they change their tune so quickly, I'm surprised you don't have whiplash.", "NTA initially, but I do wonder if you're being spiteful now. I'm never okay with the idea of using children as weapons, and unless there's danger, abuse, direct disrespect of the parents' rules, etc, I'm certainly not okay with the idea of keeping grandparents and their grandchildren apart. Your kids are close to them, don't punish your kids for the beef between you and your parents. That would make YTA.", "Yep you can’t please people who want to be the victim", "But are they really taking advantage? From what I read, whenever they don't want or are unable to watch the kids, OP has a backup plan in place. The parents offered, and OP and his wife are able to pay for daycare, so it doesn't seem as if they've been coerced. \n\nWhile I understand your perspective because I witnessed the same happen to my mother with my sister's kids, I didn't get that kind of vibe from this narrative.", "My parents insisted on this arrangement with my sister, who also has to work occasional nights and weekends. Later they complained that she was gone too much, and they seemed to be overwhelmed, but they also don’t seem to want to share the labor. There is definitely some ambivalence there. Childcare for littles is a hard job for seniors, but communication is better than talking behind your back or guilt trips. NTA. \n\nYou have to be clear that consistency is important. Otherwise, your kids may be more stimulated in a preschool and daycare environment, if they are worn out. Maybe they need to only babysit occasionally, when you have an evening out or weekend away.", "If you and your wife are comfortable with it, invite the grandparents over for lunch and to hang out with the kids, but in your presence. This is actually so the kids don't get upset about not seeing their grandparents. You and your wife can decide how often this happens.", "Just let your girls spend time with grandparents when you are there. That is enough for now. I also wouldn’t want to ask them for help in childcare anytime soon and if anyone needs to apologize it’s them - mostly for not being upfront with you if they actually had an issue. \n\nIn reality they probably want to be thanked more and fawned over more and maybe feel taken advantage of and haven’t said something because THEY KNOW they asked for it. Not dealing with building resentment and feeling like you aren’t grateful is probably the biggest issue here.\n\nThat said your mom doubling down…🤦🏻‍♀️ that right there is enough to tell her that supervised visits will be the standard until they are confident that you aren’t shirking your parental duties so she has nothing to talk shit about.", "Yeah it's pretty weird. I live close to my in-laws and they're incredible grandparents. Take the kids and their cousins in for a sleepover one night *a week*. \n\nThey do it because as old people it's fun to be around their grandkids and have a pig-out/cuddletime/hobby night. They even get grumpy if we show up and pick the kids up too early the next day.\n\nThey've been really instrumental in making sure my wife and I could both pursue our careers and get our household income in a place where we can afford nice vacations and extracurriculars and such. \n\nNever complain about it or say a bad word or anything. Thankful to have them around frankly and hope to replicate the example with my own grandkids if possible.", "Verrry true! It's having narcissistic parents that made that part ring an alarm for me. My mum LOVES shit talking my brother to me and vice versa and really hates it when I make it clear my opinions aren't the same as hers. She REALLY hates it when I remind her an issue she's having with him is rooted in her own behaviour or decisions. In this case I'd have been like \"wait didn't you specifically offer your help? And say childcare would be a waste of money? Just talk to him about it I'm sure he'll be happy to sort childcare for when you can't or don't want to do it\" which would probably lead to my mum calling me a bitch.", "They sound like the kind of people who think a woman’s place is in the home and working mothers are evil cold-hearted bitches who care more about money than their kids. Thing is, it’s just not possible for the vast majority of people to support a family on one income these days! The days when an average worker could afford a housewife, two or more kids, and a single family home in a safe neighborhood are long gone and have been for decades. It amazes me how oblivious some people are to the expenses of modern living.", "I'm wondering how much sister had to do with this. Like, was she batching at parents bc they don't watch her kids as much/have as good a relationship. Instead of saying the truth they just through op under the bus?", "I was adopted but I know they treated my brother (their bio son) the same way. I remember when we were young and he was still under their spell, he'd thank them every night before going to bed for something, anything. It was so weird.", "If that's all that she wanted then why is she asking to see them?  I had to go back and reread op story.  It didn't mention that the grandmother has narcissistic tendencies.  It doesn't say anything about her having bad behavior with the kids before this.  Sometimes healthy people have arguments and make mistakes.  LI'd like to give them all the benefit of the doubt and realize that OP got his feelings hurt and Grandma was worn out and exhausted and communications were not as great as it should have been. I have a feeling that there's more to the story.  And that maybe grandma was being taken advantage of a little and OP was busy making a living and didn't notice it. It happens it doesn't make any of it right but yes how you work it out that matters.  If OP isn't ready to spend time with his mom then let the kids get to see her. Kids have a lot to deal with the more people that can be around to live them and help them the better.", "You're a good sister. Sorry your mom sucks. And hearty congratulations for refusing to play the game. It can be pretty scary standing up to these ogres.", "Just for the record do what works for you. My FIL asked early on when our daughter was at daycare if he could take her to dance class once a week which we were like “sure you can pick her up any time. Just let us know when so we don’t worry”\n\nWhat he actually wanted was for us to take her out of daycare early to facilitate a drop off at an agreed location (because he didn’t want to drive and park down town and deal with the daycare security because it was in a federal building - which neither of us worked in) so he could take her at like 2-3pm for the rest of the day. Which would have meant we would have to leave work early to make this happen for not an insignificant amount of time. He also didn’t want to commit to taking her all day 1-2x per week (which would have saved us money and therefore much more willing to do) because he really just wanted her for a few hours.\n\nNeedless to say this did not happen and our kid did not take dance lessons at 2 mid week.", "But that punishes the kids. The grandparents did watch them for years. I would suggest having them over for dinner where they can see the kids but not talk about OP and his wife behind their backs. Other than that, get daily childcare and just let kids visit the grandparents once or twice a month so the grandparents can enjoy their lives.", "That's basically what happened with me. My grandmother (dad's mom) has been doing that up until 2019 when my dad died. She's also been making it extremely difficult to move out 🙃 she would also badmouth my mom in front of me", "That was my thought also. Maybe sis was there to find trouble and stir the pot. In any case, OP should just ask them to be honest to his face. Maybe 1 day a week would be better. Maybe they would like to be paid.", "I can just imagine all the nasty things that the kids can overhear their grandparents and their aunt say about their mother and father. Did you forget that these people were literally talking shit behind their backs?  They offered to babysit, acted like everything was absolutely fine to the parent's face and then talked shit with their daughter about her brother and his wife.  Then when OP said something to them about this they talk shit to him to his face, insulted him and pretty much told him he was a shit parent. They didn't even have the common decency to let him know that they no longer wanted to babysit and it was becoming a burden. Talk about not acting like grown ups.  I don't think I'd want my kids around people like that...grandparents or not.", "That's unfortunate. I siblings and I used to all argue, just childhood drama but we communicate now and if my parents ever say anything they'll just ask me about it they won't accuse me. Not going to lie though sometimes my parents aren't wrong they just don't need to say anything at all lol", "Your parents are showing that you’re damned if you do, and damned if you don’t. The fact they think you’re acting entitled by not letting them babysit just makes no sense to me at all. Absolutely NTA and I’m so sorry you have to deal with that.", "NTA. They created this current situation by misrepresenting your arrangement. And they got what they wanted. They cannot complain now.", "NTA. Your family (parents and sister) sound toxic. I’m so sorry. It also sounds like your parents DO love taking care of the kids, but your mom likes playing the victim and talking shit as well. Now, she’s only left with playing the victim and talking shit. Oh well. She made her choice. You’re smart not to leave your child with someone who resents you and your wife so deeply. Maintain your boundary.", "Wow...you are in a no-win situation. They want to be able to be with your children, but they also want to play the victim as though you are forcing your children on them.\n\n1. I would ask them why they felt it necessary to talk about you behind your back to your sister. If this was such a burden on them, why didn't they bring it up to you and your wife like adults???\n2. If your parents want to visit their grandchildren, have them over when you and your wife are there. That way, they can't complain/claim that they are being used as unpaid babysitters.\n3. Tell your sister to mind her own business. She is only getting one side of the story and has no right to make judgements from outside the situation.\n\n**NTA**", "You're entitled? With *what*? Wtf? Wouldn't acting entitled involve you, ya know, acting like you were owed free childcare from them or something?\n\nSometimes I think all that lead paint our parents huffed is finally catching up and this is what's happening. Just a thought, cuz this sorta bs is just rampant. \n\nNTA", "NTA. Your parents are obviously in the wrong but I don't think you need to continue to punish them perpetually unless they keep making the same mistake.", "NTA. Your damned if you do and damned if you don’t. This is a no-win situation for you.", "Lol NTA.\n\nYour parents want to spend time with your children but also want to be honored as martyrs who are saving the day. You're taking that from them and they don't like it. Tough.", "NTA \n\nSounds like your parents are toxic. They ask you to have your kids over and then complain how tired they are. \nSame my mum would complain that my brother comes to have breakfast to her place and she has to cook so much and she is always so tired. When I talked to my brother, he said he comes because if he doesn’t, she calls and asks what happens and that she is lonely and wants to see him. \nThat’s some serious nagging and toxicity. You don’t want your kids to be around that for too much.", "NTA", "Part of me thinks NTA but then I wonder. I wonder if they love having them, and they did ask initially but have gotten the feeling over time that they you are putting too much on them. They possibly didn't want to create drama and it's what they feel is their duty so didn't say it to you. Maybe they feel that there would be ways for you to spend more time with the kids if you modified how or when you worked. \nMaybe they were getting sisters impressions of the situation because they know that it isn't always easy to be objectif. \n\nI still think that it is unfair to say that you won't let them sit again. The kids will loose out and so will they. They have been really good to you guys. \nTalk to them and clear the air, then move on. That is the mature thing to do. \nSo my final judgement is actually ESH.", "INFO do your parents have a history of putting you in manipulative no-win situations?", "NTA\n\nMy parents did the same to me. They asked to watch my daughter when I work so that they could spend time with her. They then complained that I'm taking advantage of them so I started paying them. They then started to tell everyone that I don't love my daughter because I'm not with her 24/7. \n\nI'm a single mom...", "Nta this is a lose lose for you unfortunately. Damned if you do damned if you don't. Your parents want their cake and to eat it too.", "NTA but maybe a good compromise for the sake of your daughter is to tell them they could spend time with the kids in yours or your wife's company?", "NTA. \n\nShe fucked around and found out. That seems like some “look at sainted me” behavior, shitting on others to elevate themselves.", "NTA, your parents are 2-faced. They literally complained behind your back about watching the girls and are now complaining about not watching them?!", "NTA. \nYou said it- they are two-faced. \nSounds like they don't know what they want. Maybe they want to be involved and to help you but find it all too much. To speak as they did to your sister in unforgivable.", "NTA. You don't explain at all what your parents said in response. You made it known to them that you know what they said... What was their defense? Did they even give one? Either way, no you shouldn't leave your kid with someone that will say that about you. Who knows what they will say in front of your kids. Only leave your kids with people you 100% trust.", "NTA. They’re your kids. You could have said no then and you can say it now. They ruined their chance.", "Your parents are the assholes. They owe you a huge apology and then maybe they can get time with your kids. As it stands now, absolutely not NTA", "NTA.\n\nYour parents offered day care, you accepted.  Your parents apparently had forgotten how much work it is to watch kids, and became resentful.  Instead of asking you to make alternate arrangements the way a mature adult would do, they shit on you behind your back to your sister; this is cowardly passive aggressive behavior.  Your reaction upon learning they resented the arrangement was to end it, once again completely complying with their desires.  If Julia wants to see her grandparents she can, but on visits or outings, not in an all day daycare setting; OP never said he cut off contact, just stopped the daycare arrangement which was the cause of the conflict.\n\nHow exactly is OP \"taking advantage\" of his parents when he is relieving them from the task of daycare, which they TOLD sister they resented?  He's removing a burden, not taking anything from them!\n\nParents and sister are the AHs here.", "Def NTA!  Games, that is what this is.  I would have done the same thing you did.  Remove the game pieces (your kiddos) from the board.  I would let them see the kids, but only when you or your spouse are off work and don’t need them to babysit.  Problem solved", "NTA. They don’t can’t have both ways.", "NTA. You merely granted their wish. They can’t have it both ways if they’re just going to shit talk you.", "NTA\n\nTBH it sounds like no matter what you do, your parents are putting you in a double bind. They just want to tell people you’re horrible no matter what you do. \n\nIf they want to complain about something, let them complain about not seeing your children.", "NTA.  They’re just freaked out over being caught trash talking about you and your wife.  They gotta make themselves the victims.  Your 5y/o will soon be old enough to understand exactly how and what they are saying.", "I don't think any of us are getting the real whole picture of the situation. We don't know if the OP was really taking advantage of the grandmother nor we know if the grandmother was narcissistic. The only thing he's complained about is how it hurt his feelings that she didn't think he was taking care of his kids properly. I'm not sure how his mom watching his kids for years is her stepping on him. Her delivery was horrible. A mom is a mom no matter how old your kids get your always going to encourage them to do better. She did a good enough job raising him to provide for his family and has a good enough conscience to question if he's doing the right thing.  He seems like a good guy.   I do know from 1 St can't experience that taking kids away from their extended family that they have a healthy relationship with in such a drastic way it isn't healthy for their future relationships. It wasn't healthy when my sister did it to her kids and it's effected them into their adult relationships.", "NTA. Your parent(s) want to play the martyr and pretend you're the bad parents? It about \"street creds\". Don't back down.", "NTA. \n\nI don’t get your parents reasoning. Just tell them they don’t get every corner or complain about a lack thereof.", "YTA, there's a middle ground between unpaid on call babysitting and visits. \n\nYour overreaction is revealing, if you didn't find any truth to what they said you wouldn't be punishing them with no contact!", "No...\nThey should just no and not shit talk behind your back...", "NTA\n\nMy suggestion is to schedule once a week to hang out-not leave your kids with them, to help Julia get used to their absence. And find a babysitter.", "YTA. Your actions are extreme because you were offended. Yes, your mom shouldn't have been talking shit and that was unfair. She SHOULD have come to you and had an adult conversation where she let you know she no longer wanted that much responsibility and it was time for daycare. But your kids also have a close relationship with their grandparents after seeing them 3x a week for life and you are depriving them of that because your ego was hurt when you overheard it, not for the benefit of your family.", "NTA but seems to me they've probably got into too much responsibility, then rather than talking with you have vented to your sister. Not ideal, but understandable. It's probably time for an actual adult conversation with your parents\n\n1) establish situation: i heard you complaining that you're unhappy with how often you're looking after our children. You also said we were bad parents because of this. \n2) why this bothers you: this confused me because to my mind you are the ones who set up the current child care plan. I am hurt because you are criticising my parenting, while also having a role in how much care you provide. \n3) appreciate their work, clarify ongoing: not wanting you to feel used, we've looked into alternate care.  We had previously looked into this but it seemed to me that you'd insisted on taking gd for this time. How much are you interested in caring for gd? Once a month? fortnight? Weekly? Twice weekly?", "NTA.\n\nSeems like your parents have a mutual martyr complex of some kind, making the offer (nay, insisting) and then judging you for accepting is ridiculous. Maybe they’re judging for you needing childcare at all and the whole offer was passive aggressive in the first place? Speculating wildly here but I’m just trying to come up with an explanation for their behavior.", "NTA. In the words of Maya Angelou, when someone tells you who they are, believe them the first time. They called you bad parents who pawn your kids off on them. So what did they THINK your reaction was going to be? \n\nYour sister needs to stay in her lane. If she is the same one who your parents were complaining to about their frequent babysitting duties, why on earth is she surprised when you stopped having your parents babysit? \n\nI don't know what your parents' and sister's problem is, but you are doing the right thing to take a step back from that whole circus. You have your family to think about, and your energy is better spent on your wife and kids than on grown-ass adults who talk out of both sides of their moth.", "NTA. Honestly, I wouldn't let them babysit. I'd still take them over with myself or spouse in tow. They ge to see the grands and you aren't shirking your duties as they say.   Sis needs to stay out of it.", "I’m a petty person. I’d tell them the kids will never be stepping foot in their grandparent’s house. If they want to see their grandkids, they must come to your house.", "My sister has, multiple times offered to pay for something for me, either because she broke my property or inconvenienced me in some way, then would go cry to our parents and her friends about how I MADE her pay for it.", "NTA. Op can't win in situation. They're entitled, taking advantage and shirking they're responsibility if they let the grandparents watch the kids. They're entitled and unreasonable if they don't.", "I’m trying so hard to understand how you’re being entitled?? Can someone make it make sense?", "Yeah, my mother did this, ESPECIALLY about the grandkids. As a result I have a shitty relationship with her AND my brother :-/", "It isn't hypocritical. If they are saying you need to take your responsibilities then that doesn't mean just getting a babysitter instead of them. They think you and wife need to arrange your schedules, maybe find jobs that are more flexible or not use them when you just want to ho for drinks after work (not said but got a feeling that if they are reacting like this it is because there is something that you could do) so you spend more time with them. They said that if you need someone to keep them, better them than strangers that you would have to pay. And they can love sitting and yet feel like it is too much and they are being taken advantage of. The two are not mutually exclusive. I mean I love McDonald's but if I had to eat their every other day I would get fed up with it. \nPeople are being very harsh on them and don't even stop to think that maybe they have a point. You heard a snipit of conversation. You don't know the context. \nAnd no matter how you feel it is an AH move to deprive your kids of their grandparents.", "See her cards and raise the bluff. Tell her you don't feel comfortable leaving the kids around her as it is clearly beyond her capacity!", "Bisexual girl checking in, my partner’s mom hates our alternative life. We love our pets and I don’t know why she’s so mad.", "Because these aren't abusive people. They're the same people who took care of them for so long. Yes there was miscommunication (or no communication), yes the job got hard and they vented but that's no reason to break a 5 year old's heart and deny her the grandparents altogether.", "[removed]", "I think OP pretended everything was ok for the kids. They don't need to know about this.", "He heard a part of the conversation. Maybe they were talking to sister to get her impressions and thoughts before going to speak to them. Maybe they were just really tired and needed a moan. Maybe they have left hints but neither op or wife are picking up on them, maybe they didn't want to cause stress but still needed to vent. Maybe it was after sister asked them to keep her kids and they had to refuse because they already have yourse and can't deal with more at one time.\nPeople judge so fast people they know nothing about and only have a few sentences from the person that feels aggrieved to go on. You think op would really admit that him and wife do take advantage of them so they can do other stuff? If they did, then they would realise that they are not being fair to grandparents. In families with good relationships and grandparents that clearly do love their grandkids, this sort of comment doesn't come from nowhere. Maybe we need to trust them and that they know their situation far better than us and op is just not being honnest (possible even with themselves).", "What world do you guys live in? Everyone has a rant about everyone else in the family and friends at some point. It doesn't mean people don't like or love each other. We only know of one time and he hasn't even got the full conversation. They could have said dozens of lovely positive stuff about them before that but op missed it. \nAnd people have got to stop projecting what happened to them onto other peoples stories. It's infuriating. It's not because you had a specific experience that everyone with a slightly similar base situation had the same experience as you.", "It's the entire victim martyr complex. Exhausting.", "Some parents are masters at playing their kids against each other. My mother was!", "NTA \n\nThey knew you had the ability to do child care and offered to watch them instead. \n\nIf they felt 2-3 days a week was starting to be too much they should have just been adults and told you. Then you could have made other arrangements. \n\nInstead your mom bad mouthed you behind your back. Nawh you ain’t the AH here they are. They want to see their kids again your mom can apologize for what she said. Stay strong. You are absolutely not in the wrong here.", "Nta! Toxic parents", "NTA. There were probably warning signs about your parents, but you didn't notice because they're your parents. That's my mom, she'll volunteer for stuff & then complain to someone about it. It's hard to find out your parents aren't what they've been portraying. Stick to your guns.", "NTA If they had concerns or felt it was too many days they should have had a chat with you too your face. You seem very reasonable. They were the ones who were disrespectful talking nonsense behind your back to others. I'm one, if you have a problem, tell me... not the whole neighborhood.", "NTA. \n\nMy SIL does the same shit that you've described your parents doing here. She wants to be the martyr. The one that swoops in and \"saves the day\" because of perceived sacrifices she's made even though no one would have expected her to do anything if she hadn't offered and insisted on it first. \n\nMy parents take my daughter to school and keep her after school for about 30 min to an hour every weekday, and they've kept her and taken care of her for her whole life, the last 9 years. They absolutely love it. They have loved all the time they get to spend with her, they love that she declares that one of their guest rooms is \"her\" room. They don't expect compensation, praise, or anything, other than just understanding when something doesn't work out (e.g. doctor appt interferes with pick up time, want to go out of town to visit other grandkids, etc.). And we check with them every few months to make sure they're still happy with the arrangement. They give \"critiques\" (I can't think of a better word, but basically anything they'd like to change or what hasn't worked out), and we adjust. That's how these arrangements are SUPPOSED to work - it takes a village. \n\nYour parents are talking out of both sides of their mouth here. They can't have it both ways, and since your mom got caught, whether it was her talking it up to your sister or her venting her true feelings, she's got to live with the consequences.\n\nI agree with some other posters here - just no more \"unsupervised\" time, just time from pre-planned visits. \"Regular grandparent duty\"", "NTA  Your parents are playing martyr to the rest of the world behind your back. In your place, I would take the girls to visit, but sorry - no more babysitting or overnights.  You don't need Julia overhearing that kind of talk!  Honestly, it's better for your daughters to go to daycare when necessary - the older one is now at the age where she needs to be with other kids her age & have someone other than mom/dad/grandparents supervising her.  She'll be starting kindergarten in 2 short years!  Hold firm to the boundaries, and who knows, they may come around, altho I doubt it.", "NTA. God only knows what bullshit your kids have heard them say", "My parents went through this. When i was in Kindergarten we moved out of the district to a pretty rough part of the city. My Aunt and Uncle still lived down the street from my school, so they basically offered my parents to use their address and keep is in the better school. We did that until i was in 12th grade. \n\nHowever, my parents only had one car, fine, Aunt and Uncle (who were childless) said have the kids walk here and they can stay until Dad gets off work at 5. So we did. \n\nThey constantly complained about us being there but everytime my parents said they’d just enroll us in the school walking distance from our apartment they said, “no. Keep them here.” \n\nAs i got older i got sick of my Mom crying because my Aunt made her feel like shit. At that point my parents had seperated and we moved closer but money was still tight. I skipped my prom even though my Aunt offered to pay for everything because i refused to give her one more thing to hang over my Mom’s head (i’m 42, i have no regrets). \n\nThe kids may not feel the resentment now, but as they get older they will pick up on it. \n\nNTA. Nip it in the bud now.", "This happened to me to the T now I visit once a month and now they moan about me not caring . My children had a beautiful bond, they still do. But same two faced stuff. To my face no issues. My case was like once a week.  He then she’s going and bxtch to my sibling. It’s like they wanted to spend time bur also be the victims. Sorry you don’t get to be both\n\nNTA", "NTA…but I think everyone is acting childish. Should they have been talking behind your back? No, but people vent, it’s not always malicious. 3 days a week is a lot, for anyone, sure they offered but they probably didn’t remember how much work it would be. She was definitely rude but I think cutting them out completely is a bit of an escalation. Try talking it out. Maybe go down to a day a week or only to use them as babysitter in the evenings when you and your wife go out. I think you can come to a solution that maintains the bond your kids have with them.", "Healthy visits all together, big smile and not arguments. Enjoy your parents once in a while.", "You’re parents are very two faced and have given two completely conflicting messages. Tell your sister they are literally begging to see the kids but then complain to her. She’s only got one side and they need to come into 2022 and get out of 1952. Hardly anyone can afford to be a single income household", "They got what they asked for, really. NTA. I wouldn’t want my kids around those people either.", "NTA\n\nYou are only giving your parents what they and your sister were talking about behind your back. Now that you have they are upset for being called out and not getting their way anymore", "INFO: does your mom have a history of playing the victim? Does she often complain for sympathy? If not, there's probably more going on here and a serious conversation should be had. If so, she has a toxic personality trait that, at grandma age, will be hard to break her of, so it's probably time to go to supervised visits only.", "INFO: What is the best thing for your kids? If it is best for them to stay with Gparents, then that is what you should do. What they think of you or say about you doesn't matter. You arent bad parents or bad people. If it is best for them not to stay with your parents, then dont send them there. You are the parents, its up to you to decide what to do with your kids. There is no perfect solution. Send them to daycare and something bad could happen to them you had no control over. Keep sending them to your parents and parents could teach them some of what they were saying to Sister. If it were me I would have a long heart to heart talk with them and decide how much is too much, how much is not enough, and come up with a plan somewhere in the middle. The only AH move for you would be if you used your kids to get back at your parents for hurting your feelings with what they said. AS long as you are acting in the kid's interest, whatever you do, or don't do, is the right thing. Good luck.", "I’m thinking ESH but I’m curious how long each day the kids are left with their grandparents? Do you go anywhere except straight to their house after work? Is it possible to change your schedule to reduce it to one to two times weekly? Grandparents will get tired fast when it’s just them taking care of young children. It’s been 4 years of this schedule pretty regularly with a part of it being with a baby. They definitely got aches and pains they aren’t telling you about. That being said, talking behind someone’s back is something that will cause major trust issues. They also called you shit parents that haven’t done your job. You guys gotta talk this out or it’ll just get toxic", "NTA. They can’t have it both ways.  Can’t say your shit parents for letting them babysit and then when you don’t say your keeping the kids away.  You are doing the right thing. As long as they keep your children most of the time they feel they can criticize you as parent. In a few months you might let them babysit a couple of times a month but by no means would i let them do it all the time - then they feel like they are being taken advantage of and vocalize it to other family members when it is not the truth.\nI say this because my mother was like this. I finally asked her to babysit after I had called all my other babysitters and they weren’t available. so, I rarely ask her but when I do she is happy to do it.", "My mother is exactly like this. She offers to watch my nephews for my sister to give her a break from time to time and then incessantly complains about it.  They will never change. If you let them watch your kids, just know, they will always talk like this behind your back.", "NTA. I myself do not have children, but my siblings do and this story is *exactly* what they go through with my niece and nephews. I’m so sorry, I know how manipulated you must feel, and using your kids nevertheless. With time and a truly proper apology, maybe she can visit the girls - on your terms and your turf - for the sake of grand-daughter/grand-mother relationship. But you are certainly NTA.", "Your mom is a queen of martyrs. I think you found a great solution to her problem. You don't want your children know that they are not really wanted.", "NTA Unfortunately your parents are playing the victims to get sympathy from your sister. If they didn’t enjoy having the kids they wouldn’t be asking for them now, and they certainly wouldn’t have offered all those times for so long knowing you had other options. \n\nPlay stupid games, win stupid prizes. Time for their actions to meet the consequences.", "Grandparents can be a wonderful gift for children to grow up with. However that requires grandparents who maintain a healthy relationship with their kids. I would tell my parents that I would consider visits once they’d apologized. \n\nMy in laws do this constantly with my husband. They bitch about him but I don’t think they even mean it, it’s like some weird societal norm for some people to complain about their adult children and play martyr.", "This is the best take I think I have read.", "You don’t?  Because it’s pretty easy to see.  \n\nYour parents were/are tired and feeling unappreciated and taken advantage of.  They have raised their kids.  They don’t want to be obligated to take care of your kids as an unpaid full time job.  They want to spend time with the grandkids on a regular basis, but in a way that makes it a gift and joy, not an obligation and burden.  When you no longer have your full time unpaid nanny, you withhold their grandkids as punishment.  Then come on here to wonder why they are angry.  \n\nPeople on AITA, by and large, are too young to understand, but make no mistake, YTA.", "They've had a change of heart, it sounds like.", "That’s the most concise way I’ve ever heard that message delivered. Yep though\nEdit to add: I’ve said “you can’t find logic in stupidity” but yours is so much better", "There's a huge range of what constitutes normal grandparent interaction. Lots of people only see their grandparents on a yearly basis (or less) or at major holidays, even if they're physically close. For tight-knit families, what you described originally is also normal. \n\nI think you need to have a serious, calm conversation with your parents about how hurtful it was for you to hear them trash-talking you like that, especially since they are apparently missing the original arrangement. Ask them to explain to you what they want out of grandparenting, and then decide whether you're willing to give that based on how you're feeling. I would also tell them that you expect an apology for insulting you to third parties without ever bringing up their apparent discontent with you, and make it clear that if you ever get a whiff of them saying something in front of the kids, they will never see their grandkids again.\n\nThey need to learn to communicate like adults if they want to be in your life, and you should make this incredibly clear. If you can afford a few family counseling sessions, I'd suggest trying that too. Assuming you want to work things out, of course.", "Don’t let your parents babysit until they apologize and acknowledge what they said. Also don’t let them have your kids for more than 1-2 hours. But honestly, you are better off just having supervised visits with your parents and kids. Your parents are  bad communicators and manipulative and not honest or trustworthy. And they clearly do not respect you.", "Except if the kids were at daycare or with a nanny while the parents are at work, they'd be spending the same amount of time away from them as they did when the grandparents were keeping them. I think these people are just impossible to please.", "It happened to me and everyone was so confused about why i was such a nervous and anxious kid.", "it’s “understandable” when you look at it through a drama lens. \n\ntaking on a responsibility and then complaining about it is the first indicator - “hey, look at me and all of the unnecessary work i have to do!”. they PUSHED you for this, just to have an imaginary soapbox to stand on. \n\ngood on you for being able to opt out. \n\nNTA", "Very much what my mom does, and to some extent my dad too. I don't know if it's intentional, but my mom never lets you know if there's an issue. She'll just complain to your siblings (or probably any sympathetic ear) and then that person will tell you. Similarly, I used to feel very much responsible for making up for my brothers' inadequate efforts for special occasions for her because she'd be soooo upset.", "My MIL was the same, always offered to babysit never said no if asked but would turn around and bitch about being taken advantage off. Guess who never sees her grandkids anymore.", "I agree. Makes you wonder what they are saying about her behind her back.", "Hey, are you me? LOL Going on 5yrs fully NC with my entire maternal fam.", "Riding on this statement to add, they can always go and visit while you are at home for grandchildren time, so the  children don't get impacted  by your reasonable decision and still get to to see grandparents.", "OP is the son in this instance.", "You keep living your life.  I want to give you and your partner the biggest hug. 🥰🤗🤗", "I’m aware. I was referencing OP’s mom possibly being judgmental due to one of the parents of the grandchildren not staying home with them and rejoining the workforce.", "Ah. I thought it was one of those things where everyone on AITA projects the gender they expect OP to be based on the situation. Apologies.", "When I first moved back home as a single mom with twins, my parents helped me out a lot. But the minute I got a job and got the kids in Montessori, I only had them babysit for the fun things, like weekends or afternoons when they didn't have any reading practice or things to do. That way they got some fun time with the grandkids, but they didn't feel like they had to do the actual \"work\" just the fun stuff (and some spoiling). That worked out great for us, but as far as I know they never complained behind my back. I feel like that would be such a betrayal, I would have a hard time sending them back as well.", ">I can just imagine all the nasty things that the kids can overhear their grandparents and their aunt say about their mother and father\n\n100%. I'm not risking my very small child's mental health on people who are acting bizarrely.\n\nThe grandparents offered to babysit, said they were happy doing it, then said awful shit behind OP's back and doubled down to his face. God only knows what kind of toxicity you'd be exposing those kids to. The grandparents burned this relationship down, not OP. I don't know that they'd ever get inspected visits again, even when the kids are older. It's just not worth the risk to the kids.", "Boomers", "The post SPECIFICALLY says that, when OP went back to work after parental leave ended OP and wife were going to get daycare for the kiddos, but that the grandparents protested and said that they WANTED to do this. It specifies that it was because of both parents working. OP didn't do a thing wrong and he grandparents SHOULD have said something if they weren't up for it. Reading and understanding what the post actually says is very important.", "I try to do this in subtler ways...especially since I told my mother that I wasn't taking sides after she blew up about my brother in laws parenting at Christmas one year...she didn't ask until we were almost back home (I lived with her at the time and had driven us both to my sister's an hour and a half away) thank God...she flipped her lid, I left her in the car when I pulled up to the house, and then, when she came in, she started screaming at me AGAIN and then proceeded to hit herself multiple times...I later found out that hitting herself was what she had started doing after her husband came around and she wanted to make sure that he never knew how often she hit her children over bs stuff...it was...a ridiculous scene that left me angry.", "ESH\n\nGrandparents willingly took on childcare but perhaps it became more taxing than they envisioned. They complained about it to someone else, which wasn't the best way to handle it. Sounds like they love their grandkids though.\n\nI can understand the girls' parents being upset at overhearing this and understand the argument. But after all is said and done, there should have been a conversation like, \"We have appreciated all you've done. I wish you would have told us it was too much. Now that it's out in the open, how much time would you like to spend with them?\"\n\nTaking grandkids away from grandparents is childish. Both parties need to apologize and talk this out like adults.", "I would sit down with your parents after you have calmed down and come to an agreement that suits everyone. Your children obviously benefits from spending time with grandparents, but maybe your parents took on a bit too much and found it hard to say no.", "Who knows how they were talking about you to your children.  :/", "Uh, yes, it’s normal to be annoyed by people you spend a lot of time with. \n\nIt is not, however, normal to call your kid a shit parent and tell them that they are abandoning their children by the people who volunteered to care for them. \n\nIt’s not normal to talk to and about your kid to such a negative, nasty degree, and I’m sorry if you think it is.", "Exactly! My first grandbaby is due in a month and I'll happily watch her anytime just like my parents did for me with my kids...if you can't trust your parents with your kids and if they don't want to watch their grandkids over a stranger watching them that's honestly just sad.", "But also, be aware that going from regular contact with her as carer to no contact can cause attachment and abandonment issues! Speaking as someone who went through a similar situation as a kid (Nan had mental illness and finally blew up and left the family after a breakdown and claiming we were all out to get her).. I’m nearly 30 and I’m still affected by the fact a primary carer (outside of my parents) just disappeared from my life and I struggle with trusting people and building relationships.\nMake sure your girls understand that they are loved and that their grandparents “have gone away for a bit”, rather than just cold turkey on the relationship with no explanation!", "I did ask my MIL and she demanded she'd be paid to do so. Fair enough, but then I'll just take them to a professional. She hasn't ever offered to babysit once 5 years later, but she does complain when our kids have been with my own parents because they actually enjoy spending time and it's not a chore to them.", "NTA, and as a child that was OFTEN left with family members while my mom worked, I guarentee that little ears hear everything. And if your mother was bitching about you to her daughter, nothing ever stopped her from bitching about you to the grand daughter she was close to.\n\nMight be a good idea to try and figure out what your kids heard about you while they were there, since I heard alot about my mom being too busy to care about me and how I was being looked after as a favor, even tho it's not their responsibility.", "Do you remember the whole satanic panic? That was basically all about how daycare was evil and satanic. It coincided with the slasher movie where babysitters were usually a target. Basically your inlaws grew up around that time and haven't realised it was all propaganda.", "If they say this stuff infront of your kids, it might hurt your relationship with them. Be careful with what they say to your kids.", "This is my IL, 100%. We rarely go over because every time we do they tell me how it’s my fault we never see them. (They never contact us first.) The truth is, it’s easier to make you the bad guy than it is to take any responsibility for their words/actions. Good luck.", "Maybe you should ask them what they are comfortable with and ask your older daughter how much time she wants to spend with grandma and grandpa. You are being just as mean if you cut off your parents completely.", "Please reread OP's post. OP very specifically confronted his parents and they said it all (and worse) to OP's face. They don't get to walk back a thing.", "If you weren’t having your kids watched by your parents, they’d be watched by someone else. I was a nanny for 5 years and i watched kids full time, M-F 40-50 hours a week and never once had a thought that the parents didn’t care. They have jobs, they have to put food on the table for their kids. They are doing their duty as parents by providing for their children and the same goes for you guys. They act like you’re dumping your children on them. Crazy", "My dad’s family, after my parents divorced, said enough nasty stuff about my mom (parents split up after my dad hit my mom) that my cousin, whenever we were visiting my grandparents at the same time, would follow me around and punch me, telling me I needed to leave and wasn’t welcome anymore because my mom had left the family, which meant I wasn’t part of the family and that meant she got to be the oldest.", "Offering to watch them when parents are working and then the kids staying overnight to make it easier for OP are two different things. They offered and that means they should have spoken up when they didn’t like what was happening, but a “do you mind if they stay overnight I’m working late tonight” can quickly spiral into the expectation that they’ll have them stay regularly.. and suddenly finding yourself in the middle of unexpected responsibilities is hard. They never should’ve bitched about, but I can understand how what they offered and what they ended up doing could be miles apart and they don’t know how to tell OP this", "That would explain the talking shit behind the back, but NOT the shit said to OP's face.", "They volunteered to keep them instead of a sitter not they said you guys go do whatever you want because we want to take care of your kids for you. They were trying to help and save them money. \nAnd no it isn't normal for a close family to say those things ... unless it is true and the parents are seriously fing up and abuse the grandparents. This is what makes me think that op and wife, consciously or not are not being good parents. That they are taking advantage of the willingness to help from the grandparents and contrary to what op says it isn't just when they are both working. That or they could choose different work hours but deliberately choose to work at the same time because grandparents can take the kids. I don't just believe what ops say. I also don't judge people I have no information about and I don't know their side. \nPeopleneed to be more critical about what an op says.\nThey are going to write what happened to make themselves look good or better. They are likely going to exaggerate or minimise actions/events/words. They will leave out \"details\" that don't go in their direction. They will sometimes not know everything themselves and not know it. \nSometimes even considering all of these things it is a clear cut situation but so often it isn't and many times if people push a lot with the right questions, op reveals that crucial missing point but not always."]}