{"id": 3853, "submission_id": "zbh0zi", "title": "AITA: refusing to help my sister take care of her chronic illness?", "selftext": "\nI have a lot of chronic health conditions, it runs in my family. My sister and mother both share some of the same illnesses as me. Despite this, all my life they made fun of me for being so health conscious. \n\nI was called dramatic for getting anxious about running out of/not taking meds. I was called a hypochondriac for doing exercise to slow side affects. I’ve been belittled and made fun of, called a “dirty hippie” for changing my diet and taking supplements. My whole family treated me like some head case for being worried about my own health \n\n(disclaimer: I’m not that obsessed. I just like not to feel sick all the time so I look after myself)\n\nI’ve moved out a while ago and my health has never been better. My sister on the other hand is saying her illness has gotten loads worse. I offered some tips and was met with a barrage of comments about it being “too late” for all that. My mum says I’m selfish and should have encouraged her to look after herself before it caused problems. \n\nI spent my whole young life encouraging both my mother and sister to do better by their health and was made fun of for it. I don’t personally feel I’m in the wrong as they ignored all my best efforts. \n\nMy mum and sister think I’m selfish and that I’m rubbing my current good health in their faces. My mum thinks it was my responsibility to “teach” my sister as we had the same illness. \n\nAITAH: family ignored my effort to help them with our shared illness. Sister is now 10x worse and says it’s my fault for not warning her of complications", "created_utc": 1670076244, "permalink": "/r/AmItheAsshole/comments/zbh0zi/aita_refusing_to_help_my_sister_take_care_of_her/", "score": 44, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Won’t take responsibility for my sisters health after my family upset me. Possibly I’m an asshole because we share the same I’ll was and I should her love her out\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA and it says a lot about your family dynamic that your own health improved after you got some distance from your mother and sister.\n\nDo not allow them to sabotage you by dragging you back into their dysfunctional orbit.", "NTA \n\nYou can lead a horse to water, but can’t force it to drink. \n\nYou’ve set the example, it is up to them to follow through. It sounds like they are not willing to make any changes though.", "NTA. You tried. They rejected your efforts. It’s not your responsibility and it never was. It’s sad, of course, but as they said… the ship has sailed.", "NTA. I hate families which make fun of people for being weak, sick, etc. You tried your best to better them. They didn't listen. They made fun of you for trying to have good health. This is not a good family. Fuck them. Good job OP", "NTA Maintaining a chronic illness is not a single battle, it is a war. It takes time, effort, and energy to do all the things you need to so you can feel like a functioning human being. I’m just now learning what it sounds like you learned as a child. OP, you are fantastic for learning about your condition and taking steps to improve it. You didn’t keep this a secret, you shared this with your family. Just because they didn’t heed your advice does not make you an AH.", "NTA . Your sister FAFO’d herself. if this is a family thing then she knew growing up that she (or anyone) in the family could have taken action to better themselves. It seems you were the only one who did, and are currently the only one who is benefiting from your own actions.  \n\nYou are not selfish for looking after yourself. You are not a bad person for making your health a priority over others. It is not your responsibility to take care of others.  \n\nYou can guide, suggest as much as you want, but if they won’t change when you’ve tried to help, that is on them, not you.  Mom and sister are the selfish ones. They chose not to better themselves.", "NTA.\n\nWhat they actually want is for you to Freaky Friday your new found health and good feeling to your sister and you take on her feeling bad and sick while she is now happy. That way she doesn't have to put any effort into it & inconvenience herself. Since that's impossible they're always going to harp on you for \"not doing more/enough\" so I would just say back to each of them the same phrases that they say to you \n\n>\"I'm just a dirty hippie, I don't know nothing.\" \n\n>\"It's too late for all that.\" \n\n>\"When I suggested that Sister try doing (X) did it help? No? Oh, well then I don't know what to tell you, I just did the hippie thing where I did (X) and that's what helped me.\" \n\nDon't offer anything more than you already have. Just repeat yourself like a broken record.", "NTA.\n\nGood on you for making that conscious effort to keep yourself healthy. \n\nYou're not to blame for your sister not doing the same.", "NTA.  Good for you and good for you for moving away from away from them.  I am 74 so I know lots of people in chronic pain.  Going gluten free changed my life, but when I suggest it to others they look at me like I'm crazy.\n\nIt's like not only can you not get the horses to drink, you can't even lead them to water.", "NTA. It seems like they thought your methods of improving your health were \"obsessive,\" until they actually figured out that those same methods would benefit them too. It's not fair for them to ignore your advice and then turn around and criticize you for \"not saying anything.\" Good on you for finding what works for you and continuing to stick to those methods despite your family's criticisms.", "So they made fun of you for your preventative actions but now see that they actually helped and want you to come help them do the same thing?\n\nNTA", "So they spent a ton of time raking you across the coals for being proactive about your chronic illness, and now they're raking you across the coals for being healthier than they are. \n\nLooks to me like they just want to use you as a punching bag, and the reason is secondary. \n\nWalk away from these people and don't engage beyond \"I've got a list of resources that helped me, if you're interested.\" You had to help yourself with zero support from them. They have no right to demand your help now, especially when they're still tearing you down all the time.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI have a lot of chronic health conditions, it runs in my family. My sister and mother both share some of the same illnesses as me. Despite this, all my life they made fun of me for being so health conscious. \n\nI was called dramatic for getting anxious about running out of/not taking meds. I was called a hypochondriac for doing exercise to slow side affects. I’ve been belittled and made fun of, called a “dirty hippie” for changing my diet and taking supplements. My whole family treated me like some head case for being worried about my own health \n\n(disclaimer: I’m not that obsessed. I just like not to feel sick all the time so I look after myself)\n\nI’ve moved out a while ago and my health has never been better. My sister on the other hand is saying her illness has gotten loads worse. I offered some tips and was met with a barrage of comments about it being “too late” for all that. My mum says I’m selfish and should have encouraged her to look after herself before it caused problems. \n\nI spent my whole young life encouraging both my mother and sister to do better by their health and was made fun of for it. I don’t personally feel I’m in the wrong as they ignored all my best efforts. \n\nMy mum and sister think I’m selfish and that I’m rubbing my current good health in their faces. My mum thinks it was my responsibility to “teach” my sister as we had the same illness. \n\nAITAH: family ignored my effort to help them with our shared illness. Sister is now 10x worse and says it’s my fault for not warning her of complications\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nIt is not your fault that your sister did not take care of her health. You offered advice and tips, but ultimately, it is up to each individual to make the decision to take care of themselves. You cannot be responsible for your sister's actions or health. It is not selfish for you to prioritize your own health and well-being. You are not rubbing your good health in your sister's face, as you have always been vocal about the importance of taking care of one's health. Your family may be projecting their own guilt and regret onto you, but it is not fair or accurate to blame you for their actions. You are not the asshole in this situation.", "NTA. Don't waste your time. Keep taking care of yourself. Don't let them bring you down. What works for one might work for all, but you tried. Sounds like more than they're doing.", "NTA. It's not your fault for not warning, or anything else, it's your fault because that's your role in the family. Your the one who gets belittled. The family scapegoat. \n\nIt's not like you're able to fix it, right? So what's the point of pointing the finger at you? Because that way they don't need to take responsibility for their own actions. It's ludicrous to suggest you were supposed to force her to comply with your regime involuntarily, yet that's all they have to throw at you. It's actually pretty sad. So you should know that the only way to win with people like that is not to play. As long as you spend time with them, you'll be their nemesis, because that's what they want.", "NTA. Proud of you for taking care of yourself in spite of bullying and snide comments. Keep standing on your solid ground, and don't give in to the whiners. They made their bed. You are a shining example for them to follow whenever they choose to wake up.", "Are you even sure your sister has anything *real*? If your health got immediately better after moving out, but your sisters worsend, I'd get a check on munchausen (by proxy). But maybe I just saw to much House and L&O.", "I second this.", "Malicious compliance. I like that lol"]}