{"id": 3856, "submission_id": "zbl70b", "title": "AITA for explaining what happens when I eat gluten?", "selftext": "I (17M) am gluten free, not a dietary choice I have an allergy. My friend \"Jane\"  (18F) held a sleepover a few days ago for her 18th birthday with some other friends, when planning Jane said she wanted us to try her homemade pizza and homemade cake for desert. I spoke to Jane later and told her I couldn't eat what she'd make due to my allergy  but I can bring my own food as I know any free from food can be quite expensive, at least where I live it is. \n\nJane said it was fine for me to bring alternative food and apologized for forgetting I was gluten free. I ended up  bringing a gluten free pizza (and cookies) with me to the sleepover and Jane put it in the with the rest. One of Jane's other friends that I don't know very well \"Beth\" saw and started going on about how it was rude to bring food when Jane went out of her way to make us a homemade meal. Even after us both explaining why Beth said that it was still rude and I should have just sucked it up as it wouldn't kill me to eat a small amount. She was right, it would have just made me violently ill. \n\nJane made her drop it but once it came time to eat Beth started up again and it got worse when she saw that I had brought cookies as well. Everyone else seemed more understanding as to why but did agree I could have just sucked it up for one night. So I explained in great detail what happens if I had just 'sucked it up' and asked if they would say up with me the rest of the night while I delt with the aftermath of eating it. It seemed to shut everyone up for the night but it was extremely awkward for the rest of the night.\n\nThe next day I started feeling bad for ruining the mood and apologized to Jane for spoiling her sleepover. She said it was the others fault for being so ignorant and she thought I handled the situation better then she would've but I still feel bad so AITA?\n\nEdit: just want to add as I see some people using she/her for me, I am a boy. I was the only boy there due to a few things: 1) me and Jane have been friends since we where kids 2) I am trans FtM 3) I am gay", "created_utc": 1670087716, "permalink": "/r/AmItheAsshole/comments/zbl70b/aita_for_explaining_what_happens_when_i_eat_gluten/", "score": 1878, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) for explaining what happens when I eat gluten \n2) for ruining the mood of the sleepover\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - First, you had the hosts permission, so no one else had any room to say anything in the first place. Second, you explained without going into detail multiple times from the sounds of it. They are the ones that kept pushing the issue until you were left with little choice but to educate them or deal with their BS the rest of the night. I say kudos to you for saving yourself the grief.", "NTA.  If you'd just offered up the info without provocation, then yes that would have been an assholio move.  But considering Beth kept harping on you about it and was starting to get other girls at the sleepover to agree with her, it was time for some education on what 'sucking it up' looks like for you.\n\nAlso, I hate when people get fussy about food allergies and intolerances.  It costs $0 to not be an asshole about other people's dietary needs.", "NTA. I have little patience for people who, after being told that someone has a food sensitivity, seem to not hear that information. You clarified a number of times, and had all the right to go nuclear. Everyone knew Beth was being a jerk; she ruined the mood, if anyone did. I’m sure the rest of them were probably just annoyed at the dynamic Beth created with her food nagging. Food is very personal and people need to STFU about other people’s food choices, allergies or otherwise. \n\nI was waiting to read that she switched the foods just to make you eat gluten and was relieved that did not happen. You handle yourself most appropriately OP, and Jane sounds like a good friend too.", "NTA. Beth should've\n 1. Kept her mouth shut. It was Jane's party, and if Jane and you already sorted things, it's not Beth's business.\n2. Once Jane said she was OK with it, and Beth kept on, she said it wouldn't kill you to suck it up and eat it for one night. You explained it was an ALLERGY. That's when Beth should have stopped as well. The fact that she got others to join in and agree that you should suck it up is peer pressure, and not fair to you or Jane. \n3. You did handle the explanation with gross detail, but sometimes that's what is needed.  In addition, allergic reactions can grow worse over time and repeated exposure. I'm allergic to a bunch of food items and have increasingly bad reactions when I eat them, so it's definitely something you CAN die from. Beth's snarky little comment, \"It won't kill you...\" is something I've already snapped back to with, \"Actually yes, it CAN kill me because eating something  I have an allergy to is like poisoning me!\"\n\nAs for feeling like an asshole because it was Jane's party? Didn't she already tell you she was all good with how things played out?  Give yourself a break, and next time, tell them, \"So, you dislike me enough to wish that I die from an allergy?\"  It's amazing how fast they shut up!", "NTA. My wife is also sensitive to gluten, although it sounds like not as severely as you. She's had a restaurant serve her a meal before that was marked GF but contained gluten. She felt different almost immediately and paid for it for several days after. Sounds like your friend who actually made the food was understanding, and \"Beth\" is just a sh*tty person. Don't spend any more mental or emotional energy on what \"Beth\" thinks about anything.", "NTA. Instead of Beth understanding you have an allergy she decided to throw a fit. Since she decided not to listen to you the first time she got the nasty details.\n\nDon’t feel bad for having an allergy you can’t control. Beth was definitely the AH in this situation.", "NTA and Jane is on your side, who is the only other person who matters in this situation, you handled it perfectly", "NTA. Don't poke the bear.", "NTA. Beth refused to drop the issue, and the others didn’t take it seriously. Maybe now they will.", "NTA, Beth kept poking till she got the whole 9 yards.", "NTA - it's not just a dislike for food but a legitimate allergy. You have every right to keep yourself safe and had made these arrangements WITH the host of the party. The other friends can understand or mind their own business. You handled everything as well as you could handle it given the situation.", "NTA. The only opinion that should matter was Jane’s opinion. It was her party and she said yes to your compromise so you could join the party. Everyone else is irrelevant and all the girls suck for being judgmental and not understanding until you went into details. That’s on them and not on you.", "NTA \n\nPeople's diets are extremely personal and private. It is no one else's business what you put in there.\n\nNo, I don't think it's rude to bring your own food if you have dietary restrictions, I think it would be rude to expect someone to cater to your dietary needs.\n\nWith that being said and with no judgment on your friends part, for me personally, I actually feel it's rude not to at least attempt to cater to a person's diet when they are a guest in your home. I also know from personal experience how expensive and sometimes difficult it is to properly prepare a gluten free meal.\n\nThe idea of courtsey bites is ridiculous to me. I'm convinced it's a concept thought up by narracists to try and emotionally manipulate people in to eating their food.\n\nHer friend was being a huge asshole, ultimately what you did had no effect on anyone, it's insignificant. On the other hand, asshole complaining kinda ruined the vibe of the party.", "NTA.  Jane understood and she's the only that would have needed an apology if she had wanted one.  Everyone else doesn't get an opinion until they graduated from medical school", "Jane is good people. The rest, seemingly not so much.\n\nNTA", "[removed]", "NTA and your friend Jane is a good friend!", "NTA. Jane sounds like a great friend. Anyone who was made more uncomfortable by what you said than Beth’s prodding is not anybody you want to be around anyway.", "NTA. Beth was being rude and ignorant.", "NTA. Sounds like you have a true friend in Jane.", "Nope! NTA. Your friend is right. They took your allergy with a grain of salt and wouldn’t drop the subject. If they want to push the issue, then they can get a dose of reality. You acted perfectly.", "NTA. \n\nI don’t get violently ill. \n\nWhat I do get, if I’m lucky, is a rash on the back of my neck, and if I’m not so lucky I get a fibromyalgia flare-up. \n\nI’m glad your friend is so understanding.", "NTA\n\nNothing more to be said really.", "NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (17M) am gluten free, not a dietary choice I have an allergy. My friend \"Jane\"  (18F) held a sleepover a few days ago for her 18th birthday with some other friends, when planning Jane said she wanted us to try her homemade pizza and homemade cake for desert. I spoke to Jane later and told her I couldn't eat what she'd make due to my allergy  but I can bring my own food as I know any free from food can be quite expensive, at least where I live it is. \n\nJane said it was fine for me to bring alternative food and apologized for forgetting I was gluten free. I ended up  bringing a gluten free pizza (and cookies) with me to the sleepover and Jane put it in the with the rest. One of Jane's other friends that I don't know very well \"Beth\" saw and started going on about how it was rude to bring food when Jane went out of her way to make us a homemade meal. Even after us both explaining why Beth said that it was still rude and I should have just sucked it up as it wouldn't kill me to eat a small amount. She was right, it would have just made me violently ill. \n\nJane made her drop it but once it came time to eat Beth started up again and it got worse when she saw that I had brought cookies as well. Everyone else seemed more understanding as to why but did agree I could have just sucked it up for one night. So I explained in great detail what happens if I had just 'sucked it up' and asked if they would say up with me the rest of the night while I delt with the aftermath of eating it. It seemed to shut everyone up for the night but it was extremely awkward for the rest of the night.\n\nThe next day I started feeling bad for ruining the mood and apologized to Jane for spoiling her sleepover. She said it was the others fault for being so ignorant and she thought I handled the situation better then she would've but I still feel bad so AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nAnd I am happy for you that you have a friend like Jane", "NTA. I'm also gluten free and have used this tactic multiple times especially when dealing with assholes like Beth. If you want me to suck it up, you are going to hear the nitty gritty details of what sucking it up will do to me. It usually gets the message across very clearly. Sometimes assholes like Beth need to be put in their place.", "NTA what does being gay have to do with anything?", "NTA, but just understand that advocating for yourself is going to bring out lots of cultural conflict and learn to pick your battles. Dietary restrictions are a huge trigger for many people because it signals cultural difference and people are often offended when someone detours from the broader culture.", "<<So I explained in great detail what happens>>\n\nYou admit your host Jane already told her to drop the topic, and the rest of the friends were understanding.  You chose to go into (probably gross) detail at a birthday party, just to get back at the one rude person; that's childish and unpleasant for the others who did nothing to offend you.\n\nESH, Everybody Sucks Here (just you and Beth).", " They took your allergy with a grain of salt and wouldn’t drop the subject.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Jane's parents trust me more then her other male friends because I'm gay", "This may be the worst take away possible from this post. Please reconsider everything you just wrote.", "I mean, that’s a them problem, not something for OP to solve.", "Jane was great & told Beth to drop her insulting, inappropriate attacks about a health issue the OP cannot control, but Beth brought it up again and continued to go after the OP.  Had Beth dropped it when Jane tried to stop her, it would have been wrong for the OP to share the details, but that isn't what happened.  And for the others, listening to Beth attack a person with a health problem might well have been more gross than hearing about what happens when a gluten-free person \"suck\\[s\\] it up.\" OP NTA, Beth is.", "If you want to argue with every person that disagrees with what you have to eat then be my guest. People tend to be unable to appreciate how challenging it is to have dietary restrictions and I don't think one should have to engage in defending why they eat what they eat to everyone. Some people are just going to be mad at you and that is their problem. She shouldn't just \"suck it up\" and eat something that will make her ill. She also shouldn't have to keep justifying making her own accomodations.  Being outside the cultural norm on food is rough as hell.", "I agree", "Look I get that you’re coming from a good place, but the onus is not on the one with the dietary restrictions to “understand that advocating for [themselves]” will have consequences because they really shouldn’t have to. This is not a matter of culture, this is a matter of health. As soon as someone mentions their allergies the discussion ends there, period. Anyone who doesn’t understand what ingesting allergens can entail deserves to find out, and they deserve to be as icked out as is maximally possible so that they never question it again.\nI honestly cannot believe that there are people who have no idea what gluten intolerance is.", "Celiac here. They are TA, not you!!! You literally would be making yourself sick. Some people are so ignorant.", "NTA", "NTA but Beth is.", "NTA and Jane is a good friend.", "NTA.  Beth definitely was.  She didn't let up after your initial PG explanation, and so she forced you to describe the gory x-rated version of your condition.  If the mood was ruined *(and I don't think it was)* then Beth is to blame for it.", "NTA at all. I like Jane! Listen to her!! And good for you for standing up for yourself!!!!", "NTA.  Anyone who bullies someone over what they choose not to eat, is the ah, regardless of whether you have a \"good enough\" reason or not.  So yes,  good for you, informing them of what would have happened.", "NTA! I have celiac, diagnosed 14 years ago. Some people will NOT leave me alone about eating gluten until I do exactly what you did - go into uncomfortable detail about what happens. Beth deserved to hear all about it, many people dont realize how serious this autoimmune disease is and need to be confronted with the ugly truth. \n\nI'm glad Jane had your back!", "NTA, clearly. They're not wrong for thinking it's weird you brought your own food when the host was proud of making some for everybody, but the minute you said \"I'm allergic to gluten and I can't eat her food\" they should have shut the heck up.", "NTA Since the hostess was clearly fine with you bringing your own food, no one else had even the tiniest reason to complain. And repeatedly asking you to suck it up and just deal with hours of painful consequences was unspeakably  rude. She clearly needed the detailed explanation before she would leave you alone.", "If you still feel bad then do something nice for Jane because she sounds like a good friend. You did nothing wrong though, and I'm happy you stuck up for yourself. NTA", "NTA.  Jane sounds awesome.  \n\nBeth pushed you to that point, that wasn't your fault.  And explaining it in detail was really the only option you had left, as clearly Beth and the others did not understand the true repercussions until you told them.  It was probably awkward afterward because everyone was ashamed, and rightfully so.  Yes, it's a shame it changed the mood of the sleepover (as you put it) but you didn't start that change in mood.  Beth did.  You just finished it and stopped it from escalating even further.", "NTA.\n\nI'm glad Jane had your back.", "NTA. My sister had similar problems growing up. You might get a kick out of this, one time my uncle was trying to get a gluten free dessert for her, and was asking an employee about their selection. The woman could not comprehend that my uncle was not asking for a free dessert. Round and round until my uncle gave up.", "NTA. Beth was absolutely out of line here! You were just responding.", "NTA\n\n&#x200B;\n\nWouldn't kill me is a stupidly low bar. Especially for something is at most rude. Expecting someone to suffer just so you randomly don't think they are rude is pretty insane.", "NTA.  \"beth\"  is just arrogant and was the one that ruined the mood.  You have nothing to feel bad about.", "NTA fellow GF person, getting glutened sucks big time and there is no such thing as sucking it up, if your anything like me after the initial reaction the whole of my household is paying the price for at least a week and that's if I have some due to cross contamination, personally eating pizza and cake would likely land me in hospital.  I don't get how people thing you can just suck it up like its a little indigestion", "Eating gluten when celiac of even just intoleran can lead to cancerous cells forming.", "NTA they wouldn't get off your case", "Agreed.", "> I have little patience for people who, after being told that someone has a food sensitivity\n\nTo be fair, most food \"sensitivity\" or \"intolerance\" is bullshit. Actual allergy (coeliac in this case?) is a completely different matter.", "I have been in this situation so many times with celiac and it sucks. Most people are so understanding but there’s the ones that think that just a ‘little bit’ won’t hurt you. I already hate having to draw attention to myself and be the odd one out. Plus if it’s pizza you might as well eat the cardboard it was served in for gluten free ( I know there are some good ones but they are few and far between). \n\nWhat people don’t understand is that sometimes we don’t become violently ill. But all those little bits of gluten add up and are destroying things over time. So what might not be happening on the outside sure is going on inside. And that damage adds up. \n\nAnd with an allergy you can have even different side affects than celiac. Those could be life threatening if severe enough. And those also grow over time. \n\nSo end of the day Beth needs to zip it. It only shows how ignorant you are the louder you are.", " If the mood was ruined (and I don't think it was) then Beth is to blame for it.", "\"To be fair, most food \"sensitivity\" or \"intolerance\" is bullshit.\"\n\nUh, what?? Are you actually claiming that food sensitivities and intolerances don't exist? I just want to make sure I understand your claim, before I comment further.", "To be fair, people use \"sensitivity\" or \"intolerance\" because it's more likely to get people to stop forcing food choices on them. More people are willing to accept a medical need more than a personal dislike. Not to mention, that many people DO actually have sensitivities and intolerance and maybe it'd be better to just trust others about what they can or are willing to eat.", "Celiac is not an allergy, it’s an intolerance. The person can consume gluten but they will have serious digestive issues if they continue to eat it. That you don’t believe someone can have an allergy to gluten is on you. There is plenty of medical information to prove the side effects of celiac disease.", "You’re attracted to girls oh I see you are a big who is attracted to boys. I misunderstood", "It's bizarre how many people think this. I'm lactose intolerant, and a lot of folks don't take it seriously unless they have the misfortune of being around when I accidentally get lactosed and suffer the explosive consequences.", "No, I'm trans FtM I'm a boy who's attracted to boys", "Right? I had an issue recently while staying at a B&B. It's a longer story than I care to type right now, but I'll just say that the B&B owner/ breakfast cook didn't believe in intolerances, she only believed in allergies. And I suffered the consequences. I felt bad for the guests in the room next to ours, because I was in the bathroom until after midnight 2 nights in a row, and it was a shared wall. 😬", "I figured it out it just took me a minute , sorry", "It's ok!", "NTA", "Jane is a real one. Stick with her. Those other girls need to learn some manners.", "NTA\n\nAnd the birthday girl agreed.\nYou aren't the one who ruined the mood, and I hope the rest of you had fun regardless.\n\n(I'd hazard a guess the troublemaker won't be invited next time.)", "Nta. It was rude of the friend. You ruined nothing. The other friend over stepped her bounds. Whatever arrangement you had with the host was no concern of anyone else's. It's not up to anyone when and if you suck it up for one night, even if that was an option.", "NTA in the slightest. Human beings have a right to control what they put into their bodies. Even if not an allergy, saying \"No, I don't wish to eat that\" should be more than enough. I have a peanut allergy which can kill me and I'm a vegetarian. For me, they're quite similar, because I would no sooner eat a piece of meat than I would a PB&J sandwich. Yet, people always take issue with my food choices. Go figure. \n\nThe fact Beth and those other girls *knew* it was an allergy though, and still proceeded to pressure you into having allergic reaction is insane to me. Absolutely nothing wrong with you explaining in detail since that's what they so badly wanted to see, apparently. Like bro what were you supposed to do? Just go along with it and have some bites since they wouldn't stop bullying you? Would it have been better for them to spend the rest of night watching you get sick? All you did was explain the thing *they* were literally telling you to do. Hopefully they actually take this a lesson and keep their mouths shut over other people's dietary choices in the future.\n\nAnd shout out to Jane for actually being a good friend and having your back. She's cool with how you handled it, so you got nothing to feel guilty about.", "NTA. Your condition was being trivialized, so you explained why it's important for you to eat gluten-free food.", "NTA - how ridiculous of Beth to get her panties in a bunch about something that doesn’t even affect her. She needed to be put into place.", "I’d like to see a crossover episode featuring Jane and the host who provided pizza for the picky girl at Thanksgiving. The two of them could corner the market on “how to gracefully deal with rude guests”. \n\nOP you’re definitely NTA, Beth is the human embodiment of what happens when you eat gluten.", "NTA\n\nI have pretty extreme FODMAP intolerance, which is a huge complication. I have to also eat gluten-free, for example, but it can't have almond, coconut, or amaranth flour, and I can't eat a number of vegetables or most legumes/nuts/pulses, dairy, or fruits.\n\nI had to pull the same pet trick on a vegan \"friend\" who is an AH every time I eat meat. So I gave him a very graphic description of the outcome of eating most vegan products.\n\nI was actually taken to the hospital Tuesday night this week because food I was promised was safe had wheat and onion, and I was so sick for several days I needed IV fluids to counteract dangerous levels of dehydration-- so if anyone understands your dilemma, I do!\n\nSometimes it requires horrifying rude folks into disgusted silence so they understand \"a little bit\" is days of agonizing pain and sickness.", "Definitely NTA \n\nI don't get why people make such a big deal over food and diets and allergies. You discussed it with the host, she was fine with it so no one elses business. \n\nYou found an effective way to shut them up after many other ways failed. Definitely not the ah!", "NTA.\n\nYou and Jane knew what you two were doing and why. \n\nBeth is the only AH here.", "NTA, your friend Jane is a good friend. Keep her close!", "As a 33 year old who is also allergic to gluten, I will straight up tell assholes who question me that I will/have shit my pants. That I will end up in the bathroom blowing out both ends. This girl was rude, and you shut her up. It's her fault she wouldn't take your 1st and 2nd attempts to tell her you can't have gluten. Some people have strong feelings about others being gf so I'm sorry to say there will be more Beth's in your life. \n\nNTA", "NTA. You were pushed into the explanation and Beth needed to hear it. Beth's empathy is wildly outmatched by her ignorance. Your gluten intolerance is a real medical issue and she needs to understand that. \n\nAnd at the very least, she needs to learn to shut her darned mouth and not be such a nosy pot-stirrer.", "NTA.\n\nIf someone can’t get past “I will get violently ill” or “I will be in the bathroom all night” then it won’t matter what you tell them, they’re not listening. (And everyone else in the room will get it, and silently be wishing that the annoying person will just shut up all ready.)", "NTA- don't worry dude, everyone knows Beth is TA and they probably won't have anymore sleepovers with her invited.", "NTA. Gluten can not only makes gluten intolerant people violently ill, but it also makes their intestines bleed. Continuing to consume gluten while gluten intolerant will most definitely lead to an autoimmune disease in a few years (assuming you don't have celiac disease yet).", "Ignorant people unwilling to learn are all the same. They’re not worth your breath because they’re never wrong. I just honestly am mind boggled that in this day and age with so much information at our fingertips people are still so stupid when it comes to allergies, anaphylaxis, intolerances, etc and act as though they are more knowledgeable about your body. Let them keep talking, they’re just showing their ignorance and stupidity.", "NTA\n\nYou didn't make the birthday girl angry and she agreed with you. And it was their fault for not understanding there is a reason why you need to stay away from gluten and could have looked it up but decided you were just being dramatic.", "NTA\n\nIf Jane wasn't upset, then don't worry about it.     Now that the entire group is more educated about your allergy, hopefully it won't have to happen again.    \n\nBTW, the only AH there was Beth.   It was none of her business interjecting her opinion on something that had nothing to do with her.", "NTA.  Jane is awesome, you handled it the best you reasonably can be expected. the others are dumb teeangers who", "NTA, the host said it was fine, so it's fine.", "NTA. If Beth didn't want an explanation she could've stopped pestering you about it.", "NTA", "NTA and Jane is a GOOD friend!", "As someone who’s gluten free and dairy free because I will be in the hospital, Jane is a keeper and an amazing friend! You should never be shamed for something you literally can’t eat. I won’t lie, I defo would’ve eaten it just to ruin it for others, so you’re better than me too. Nta", "NTA", "NTA at ALL. I'm also gluten free due to an allergy. I will never understand people who just say \"suck it up.\" Sure, let me just be in severe pain and discomfort for 48 hours. That sounds like it will be fun for EVERYONE. \n\nSometimes the only thing that makes people understand is to be blunt about what it does to you.", "NTA at all. These people did 2 things I cannot stand and you handled it so much better than I would have. First, a guest spoke up saying you were wrong and rude (multiple times) after the host said it was ok by her due to thr circumstances. Second, people downplaying allergy/dietary restriction issues. This wasn't a case of you just being like \"I don't like it so I won't eat it\" you have a legit reason, you cleared it with host, you took care of yourself. You did everything one is supposed to do on this situation. Honestly, even Jane handled it better than I would have. I would have gone off on Beth about, not her house, not her party, I have clearly said it was ok and to gtfo if she can't stfu and min her own business.", "NTA and as someone who was diagnosed with Celiac back in 2005, you couldn't just \"suck it up\". I applaud you for going into detail.  All too often people do not think it is a big deal.  It is a big deal and can make you violently ill.  I am glad your friend supported you.", "NTA.  Because so many people have gone off gluten for weight loss reasons a lot of people don't realise that some people are genuinely allergic or Coeliac and don't know what that means in real terms.  \n\nYou did nothing wrong by telling them and their transferring their shame over their shitty behaviour to you and trying to make it your fault they were uncomfortable not theirs.", "Jane's a keeper! She's a great, supportive friend!", "It also sounds like the host was ok with the explanation and puts the blame on the people being jerks.  Sounds like she's a good friend.", "I was waiting to read that she switched the foods just to make you eat gluten and was relieved that did not happen.", "I can't even comprehend what is goikg through some people 's mind. Like you learn that someone has allergies so he can't eat something. Why would you start to go \"But if they eat it anyway..\"", "While I applaud your desire to cater to a person's diet, Gluten is incredibly succepable to cross contamination to the point that you don't want to use a wooden spoon that's been washed if it has been in contact with something that has gluten.\n\nMy point being, be very careful preparing gluten free food for your guests if you don't have experience with the prep work needed to prevent cross contamination.\n\nTHis has been your unsolicited advice for today.", "Came here to say this!   Also, OP Jane is 100% correct, you didn't ruin the night that any ruining of the night was caused by the others there.  You are NTA", "Yep. We are all team Jane here.", "Also came here to say. And you are NTA!", "[removed]", "Ah. I think I see where I could have created a misunderstanding. I use “sensitivity” for the food allergy that doesn’t kill me or put me in hospital. I have a seafood allergy/sensitivity (scallops specifically - can make me have terrific abdominal discomfort where I’m in the bathroom for hours with distress in multiple directions.) Is an allergy. Will not kill me. I can eat them in small amounts with no ill result. If I use the word “allergy” people assume I will go into anaphylactic shock and die. So I sometimes have to get a little more specific with my symptoms for those who won’t drop the subject. Food sensitivities can be real, and are no ones business unless we make other people cook/buy food for us.", "OP is NTA, but you certainly are a giant asshole.", "Right?!? I have a serious allergy to alcohol.  Like, I carry and epipen and have gone into anaphylatic shock before and been rushed to an emergency room.  I /still/ get people who tell me they don't think there's any such thing as an alcohol allergy and try to sneak it into my drinks and food hoping for a gotcha moment.", "Absolutely. My dad died because his heart and kidney both just gave up. It turned out to be the impact of life long undiagnosed coeliac disease (he was 70).", "Fellow Celiac here... Have you tried the new GF Cauliflower Crusts? They've semi saved pizza for me!\n\nAnyone who doesn't need to travel constantly with Imodium in case of cross contamination gets zero input on my dietary choices. OP kept it together FAR better than I would have at His age!", "Celiac is an autoimmune disease, not an intolerance.", "Tbf I've never heard of that either, BUT if someone says that they have an allergy to something, then why would I not believe that? Why would anyone assume that people are lying about their allergy? Especially when you don't even know that person.\n\n>and try to sneak it into my drinks and food hoping for a gotcha moment.\n\nThat's also something I'll never understand. There are 2 possible outcomes here: 1) You're right and get your small \"gotcha\" moment. Amazing. 2) The person didn't lie and you've now caused a life-threatening situation for them.\n\nLike.. even if I actually believed that someone was lying, why would I take that risk just to prove them wrong? Even if there's a 95% chance that they're lying, _the stakes are way too high_. You're risking a potential fatal outcome for.. what? 5 minutes of being smug about exposing someone? Wow.", "Geez I am so sorry.  It takes forever for some people to get diagnosed with celiac. It’s just not on a lot of doctors radars because symptoms vary and mimic so many other diseases.", "It’s both. All allergies, intolerances, and sensitivities are the result of the body’s immune system attacking itself in response to a stimulus.", "There is also no 'pill' to take so no big drug companies are down for medical education on it.  \n\nOP is very charitable and polite in her treatment of Beth.  I, personally, would have wolfed down the pizza and then, when the nausea and \\*projectile vomiting occurred, I would have made sure to hit her with it. \n\n(\\*my own symptoms with just a little bit of gluten.)", "Based off the limited description it sounds like op has food intolerances and not an allergy or celiacs disease.\n\nAllergies would be an autoimmune response like hives or anaphylaxis \n\nCeliacs disease is a complicated gi disease where the small intestines cells become damaged affecting bioavailability and nutrition absorption.\n\nFood Intolerances cause GI distress and will lead to vomiting, pain, and diarrhea.\n\nThe Gluten intolerance can be quite severe. From first hand experience, I’ve projectile vomited and have soiled my pants before. It’s quite embarrassing and people’s reactions aren’t kind.", "I hope you left a review about it online.", "NTA. And Jane is a solid friend for at least trying to back you up. It is always polite to take care of your health.", "NTA.\n\nThey didn't let it go.\n\nGlad you and Jane are tight and have each other's backs.", "NTA. Everyone learned two important lessons that night...to shut up when they don't know what they're talking about or prepare to learn something new. They learned something new about not being AHs and something about gluten allergies.", "NTA. Jane gets it. Keep her around.", "NTA. You dont just suck it up for any reasons when it comes to medical issues. Period.", "So like...if you were diabetic and brought a sugar free snack, you would have been expected to tell your pancreas not to be rude and just deal with sugar for a night? lmao\n\nNTA", "NTA - way too many people don't realize how serious celiacs disease can be. There are people who if they get even a little bit, it can cause serious or even permanent damage to their digestion system. Now, I don't know if you have celiacs disease, but it doesn't matter. Whenever someone says they're allergic to something, take it seriously.", "NTA. You were far kinder than I, a grown up non-celiac GF, would be.", "NTA", "NTA. I hate when people say “suck it up” when it comes to serious food allergies. They clearly don’t understand the consequences and they certainly never want to help deal with them once they get their detailed explanations.", "NTA.  At all.  Food allergies are no joke.  Beth needs to take a class.", "NTA, and your friend is awesome.", "NTA.\n\nIf Beth had kept her mouth shut, literally none of this would have happened. You didn't ruin the mood of the party, she did. She should've gotten the hint after Jane told her to drop it.\n\nSpeaking of Jane, she sounds like a great hostess and a great friend! If you really want to make it up to her (even if none of this was your fault) you should invite her to do something fun sometime, your treat.", "NTA\n\nHow else are you supposed to get someone as insistent as Beth to leave you alone? Play stupid games? Win stupid prizes.", "[removed]", "NTA. Most people with allergies bring their own food, it's not uncommon. The one who ruined the night was Beth for not minding her own business. Jane seems understanding and like a good friend.", "NTA \n\nWell done. That was classy of you to apologize to Jane. I’m glad she was on your side.", "NTA. I hope you went into excruciating detail so it's imprinted on her brain.", "As a celiac… you gotta do what you gotta do, and sometimes the only way to educate people is to get graphic with the usual reaction to ‘a little bit’. \nThe host isn’t mad at you, don’t sweat about it. They should have taken a hint and left it alone. NTA", "NTA. My ENTIRE family has IBS, and certain things are just a no-deal. Really greasy, fried food will have me marooned in the bathroom in pain equivalent to natural childbirth. So I completely get it. Your friend is awesome, her other friends definitely NOT awesome.", "NTA! What really pisses me off is the “it wouldn’t kill to eat a small amount” because while it won’t kill you today it may lead to your premature death in the future. If you have coeliac disease, every time you eat gluten you increase the risk of getting a slew of nasty consequences, among others bowel cancer that could absolutely end up killing you. So Beth is an uninformed AH who needs to sit down and be quiet", "Nta the sad thing is gluten-free because a fad diet and not everyone has an issue with gluten so now the handful of people that have actual gluten allergies are seen as people with a medical issue", "As a coeliac Beth's opinions on your dietary needs makes me see red. The stomach cramps, violent vomiting, 3 week long cystic acne, and week long constipation from a mouthful of bread is not worth caving to her peer pressure. Jane is the AH too for not laying in to her when the kerfuffle resumed  I hope Beth is never around you again.", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "So you're cool to have ice cream sundaes with me and then stick around for the painful, swampgas results of my lactose intolerance, hold my hand and help me though it despite the stench because it's lactose intolerance not an allergy, right?\n\nSmh", "I use to think it was ridiculous until I went to the doctor and found out I was allergic to egg white, egg yolk, wheat, gluten, soy, rye, and barley.  Let me tell you it was life changing and I really appreciate all the menus and products there are.  Also celiac disease is an autoimmune disease, not an allergy.", "My oldest son has a nut allergy. Had it since he was a toddler. Even the smell of peanut butter affects him. On PB& J days at school, he would have to eat in the teacher’s lounge. Always had an Epi pen in the nurses office. He made more than one trip to the hospital for eating something, unaware there were nuts in it. In particular, I remember a thanksgiving where we went out to eat. There were chopped nuts in the dressing. Most restaurants are more diligent these days, fortunately. Allergies aren’t something to screw around with. They can be deadly.", "comment stolen from u/sumrtopmer", "Holy shit. Along with the whole legal and ethical shitstorm that can come from intentionally exposing somebody to an allergen...alcohol is technically classified as a drug. People are attempting to DRUG you in order to \"expose\" you???", "Ugh. Vodka, for some reason, makes my heart race. Luckily I don't care for the taste of alcohol in general, but that would piss me right off.", "It's he, not she", "I really don't know.  I've ended friendships over it.  I have a reaction just putting something with alcohol in my mouth, my tongue and lips start to tingle and even swell immediately so I know when someone's tampered with my food and drink and that I need to spit it out pronto and find my epipen.  Trust is absolutely broken after that.", "That's assuming that people are capable of approximating an expectation of a variable with two values...", "Right? Any why do I care if someone is lying about an allergy? Like if someone HATED  particular food but kept getting pushed to eat it, and their only recourse was to lie and say they are allergic, what is it to me? Am I a gluten farmer? Are my sales suffering because of this one person? \n\nNTA", "That's horrible.", "Celia. Can cause diarrhea and pain and vomiting. Those systems aren’t restricted to gluten intolerance.", "I’m celiac. It took them a while to diagnose me- i spent so much time in the bathroom with a bucket between my knees whilst on the toilet that my hair actually fell out. My stomach lining was so destroyed I developed leaky gut syndrome and would get allergic reactions to any thing i ate and i had to carry an epi pen because the doc was worried one of those reactions would turn anaphylactic.. even just a bite of bread will have me in the bathroom within 15 minutes all night long. I have another issue with my blood pressure, and the doc was so worried about my blood pressure while having a reaction that I ate extremely little of anything for two years while my gut lining tried to heal. It was absolutely terrifying and miserable. I don’t wish it on anyone.", "Not yet because it was recent, but I'm definitely planning to!", "Specifically mucosal inflammation of the proximal small intestine, with villous atrophy and crypt hyperplasia.\n\nYes, you’re right there would be Gi distress, but it wouldn’t be a defining feature.. lactose intolerance also cause GI distress and so does IBS/Sibo\n\nSerological evaluations followed by endoscopy would be the definitive dx, but it is entirely unreasonable to jump to celiacs disease given its low prevalence rate.\n\nA tissue transglutaminase (tTG)-IgA antibody would be the first step.\n\nSo unless the pt presents with family history, pulmonary hemosiderosis, type 1 diabetes, Down’s syndrome, Turner syndrome, or autoimmune thyroiditis you would consider probably consider wheat sensitivity.", "I have celiac. The GI distress may not be a “defining feature” of the medical diagnosis. But it certainly is for my experience of it. \n\nI can’t “feel” my intestine lining being irritated, and the malnutrition/weight loss takes months to hit “noticeable”. But within a few hours of eating gluten, I’m cramping, shitting and vomiting like there no tomorrow.", "NTA", "NTA. you have an *allergy.* and even if you didn't, it's not beth's business what you do or don't eat. whether you have a physical reaction (like you would've done) or just don't want to eat something, either way it doesn't concern her\n\nalso jane is an absolute g", "Nta", "NTA. If Jane was okay with it then that’s that. Three are many reasons why people can eat certain things, (I can’t stand cheese because of sensory issues.) but it’s no one’s business. They should be happy you told them at all, and should of dropped it when Jane said it was okay.", "OMG! NTA AT ALL. I hate hate HATE when people are so insensitive about other’s food restrictions. You got the host’s permission and it is NONE of Beth’s business. On top of that, you apologized to Jane for something that wasn’t even your fault and even Jane said you were totally fine and handled it really well. NTA at all and I hope this makes Jane realize what kind of “friend” Beth can be.", "NTA.  \n\nJane's guests were TA, for passing judgment on a subject about which they knew little.  They know more now that you have educated them.  Good for you!!", "NTA. And Jane is a real one.\n\nEdit; I realized the slang might not be understandable to everyone. I mean Jane is a really good friend and is very supportive.", "NTA. \n\nBeth spoiled the mood. Sheesh. You didn’t!\n\nBeth needs to learn she asked a question and the host answered. The host allowed you to bring food! Sorted\n\nBeth can just hush!\n\nBeth sounds like a know it all who annoys everyone. \n\nDon’t be like Beth", "NTA", "NTA. I have a friend who cannot have gluten as it makes her incredibly ill as well. Your friend made a big oversight knowing how bad gluten is for you and you both came up with a fitting solution because she cares about you and doesn't want you to be ill.  I'm sure she felt bad forgetting and was happy to have a solution that made sure you were included. The other girl's opinion as far as I'm concerned, is unimportant.", "OP=NTA\n\nYou had permission to bring your own food(tho if someone ever refuses you permission--they aren't friends)\n\nYou explained your condition/allergy(really not their business).\n\nThey KEPT getting in your face and telling you to \"Suck\" it up--total A-Hs all of them  Let them understand what you will experience, maybe next time they won't be jerks about it.  AND MAYBE JUST MAYBE they won't sneak in allergens into foods for other people they think should SUCK IT UP.  So you were merely providing a PSA for them.\n\nGotta say, Jane sounds like a keeper(as a friend).", "NTA. I’m glad she stuck up for you initially but that you felt you could handle it and you shut Beth down eventually, so that’s what matters. I can’t believe her “it wouldn’t kill you to eat a little bit of something you’re allergic to” yikes. I’m not sure of the severity of your illness but I know some of my Celiac friends have been hospitalized due to accidentally consuming gluten (one was even an exposure as small as cross contamination in the dining hall at our university) and you’re all young so maybe Beth didn’t know this, but if someone says they’re allergic to something, they shouldn’t be pushed to eat even a little bit.", "I bet Beth will never ask unnecessary questions again. NTA", "NTA. My niece has celiac disease and I remember the nightmare her life was until she got diagnosed. It’s not just something you can “suck up and deal with “.", "No definitely NTA!", "NTA\n\nAnd good on Jane for supporting you. \n\nI have a non-Celiac gluten intolerance, and hubby has no problem telling servers and anyone else that he would rather not have to hold my hair back while I puke when they question it. Beth is an AH, and sometimes you need to get graphic when dealing with people like her.", "NTA. Beth was TA and a big one. Who goes to another's party and spends the time attacking another guest for bringing their own food and demanding that they suck it up and make themselves sick for politeness's sake. I hope Jane and others leave Beth off the guest list in the future.", "I love it when people push and push and push for someone with chronic illness and health issues to do something that is incredibly painful and/or harmful and then get all upset when they merely have to listen to the consequences of actually doing said thing. If they are such a fan of sucking it up, maybe they should give it a try and suck it up when they see people taking care of their own health.", "NTA. You had the hostess's permission. At no point do you have to put yourself in harms way because of others willful ignorance and bias. I memorized a phrase similar to that when I was your age. I have a lot of severe allergies, and people just don't want to understand that if I give in to their bullying due to their willful ignorance, it will literally put me in the hospital and may do irreparable damage. Good on you for sticking up for yourself, and good on Jane for standing up with you.", "NTA. My wife has Celiac, I think “violently ill” is still putting it lightly and there for sure is no sucking it up. Very glad Jane is a supportive friend to you!", "Well said, and exactly what I would say to OP.  NTA, and major kudos to Jane, she is an amazing friend with a shiny spine!  I really don't like the AH attitude of Beth & the other girls tho, I have to wonder if Beth is transphobic & the ones who agreed with her are \"following\" along to stay in her favor.  There's a hint of Mean Girls about this Beth person!", "100% and also Jane sounds pretty cool and it was her party so ignore the others, OP! NTA", "Is Assholio any relation to Cornholio???", "Boohoo, if someone says “when I eat this, I feel bad” fucking believe them. It isn’t pleasant or fun to restrict anything out of your diet and you win nothing by being a jerk and thinking they’re a liar.", "Celiac is different from a gluten allergy.", "Personally, I have no problem explaining to people the bloody (as in literal blood) consequences if my hubby gets exposed to gluten.\n\nBut our doctor explained the effects and results are similar to eating tiny shards of glass. It is that severe for him. For weeks after a small exposure. Explaining it like that may help in the future, but probably wouldn't have in this situation. \n\nThey deserved to understand exactly what they were asking of you. Just because it isn't instantly fatal doesn't mean that you aren't doing permanent damage each time, and that damage can make life much, much harder down the road. And they don't care.\n\nHonestly, they were looking for drama and created it. But when faced with an explanation of serious (and likely gross) consequences for their ignorance, they still blame you. Because that was their intent all along. If it wasn't gluten and an explanation of what happens after exposure, it would have been something else. \n\nSome people will always be this way, some change, and some go back and forth all their lives. \n\nNTA.", "Oh yes I keep Imodium and Emetrol in business. I take Imodium first thing in the morning every day. Got tired of my stomach going rogue on me at the worst moments possible. But Imodium or not, if I eat something like Long John Silvers (yes I know that's a heart attack in a bag) I will be in the bathroom hoping not to pass out from the pain later. Ugh.", "This is the correct answer. I have Celiac and while eating gluten is not instantly fatal, it will give me cancer and a 33% chance of another autoimmune disease, in addition to the other 200 plus symptoms that Celiac has. Basically you can't absorb any food if you're eating gluten and have celiac disease, leading to things like osteoporosis, infertility, brain fog, and so on.\n\nPS NTA. Beth is ignorant.", "I'm allergic to some alcohol (mainly wine /champagne) I literally break out in a rash all over & get red & flushed.  I'm a great party trick but it isn't fun.  Never understand people who don't have allergies saying 'its not that bad' . Speak for yourself", "It's happened twice.  First time someone \"forgot\" to warn me their beef stew had a can of beer added.  I knew something wasn't right when my tongue tingled but swallowed it anyway.  Ended up in the emergency room not long after that.   She apologized, swore up and down she just \"forgot\" my very well known allergy she'd been saying she thought was all in my head for awhile and I cut ties with her.  \n\nSecond time was a guy I was semi interested in dating.  He was bummed I couldn't go out drinking with him.  I could, but like, all I could have was coke and non alcoholic drinks and he kinda whined a little bit that it was a bummer and not the same as social drinking with other folks consuming alcohol.  That time someone else at the party warned me he was putting something in my drink and I dumped it and him.\n\n People who people tell me they don't believe there is any such thing as an alcohol allergy I just distance myself from anymore.  Can't trust anyone who disbelieves me anymore.  Most of my friends now are also allergic or intolerant to alcohol or have known me forever and never doubted me."]}