{"id": 3863, "submission_id": "zbhr8l", "title": "AITA for refusing to cook if my bf doesn't help with the dishes?", "selftext": "I(26f) have told my boyfriend(26m), countless times that I would appreciate it if he got better at doing the dishes. Usually he will maybe do them once, and then go back to old habits of not doing them at all. It drives me INSANE, because while I understand that he has a busy schedule(work and school), I too have a busy schedule and still manage to do the dishes anytime there are dishes in the sink/when it's my turn to do them.\n\nIt's gotten so bad that when I say \"hey can you do the dishes?\" he will say yes, and then the dishes stay in there for 5 days until I get pissed off and clean them. I decided yesterday that I would rather buy food somewhere/eat all my meals out/eat meals that require ONE dish, than make dinner for us and use several dishes, knowing they won't ever get clean. I told him I will not be cooking any meals until he can figure out how to do the dishes. \n\nAITA?", "created_utc": 1670078348, "permalink": "/r/AmItheAsshole/comments/zbhr8l/aita_for_refusing_to_cook_if_my_bf_doesnt_help/", "score": 49, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because there may be less hostile ways to handle this situation.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA just cook for yourself, but in the long term, consider that he wants a free servant, not a partner", "NTA. Logically think this through. He's disrespecting you over this little thing and isn't open to fixing it. Imagine what the future will hold. This is plenty of reason to move on, even though it sounds minor on the surface.", "NTA. I don't understand people in relationships who treat their partner like the live in maid. If you want a maid, pay for one. If you want to be parented, move back home. If you want a partner, understand you *both* live in the home and are equally responsible for all bills and chores. It isn't 1 person's job to do it all. Fuck.", "NTA. But you're getting a preview of what life will always be like with this guy. He will always be \"too busy\" to pull his weight, and you will always be the one doing everything, no matter how busy YOU are. I would put an end date on this relationship and make plans to move out.", "NTA I don't blame you one bit. Why should you cook enough to do the dishes and he benefits from when you cook. He's a grown man not a child. So start cooking for yourself. Clean the dishes when you cook. If you ask where his food is say he's a grown man and he could cook for himself. Or just order out. However you want to do it stop doing it he'll learn. And if not it saves you have to do any dishes.", "No one is too busy to do dishes. What's it like 10 minutes max if you do then daily? But you can't fix some else's laziness, so it's up to you if you want to be his mom getting him to do chores or not.", "NTA.\n\nI'm far better at cooking compared to my boyfriend so when I cook us a meal I instantly know that I do not need to lift a finger as he will clean the table and clean the kitchen/wash the dishes. \n\nIf you put your time into making a meal for the both of you then he should dedicate his time to help with cleaning up. Chores in relationships should be divided. It is the 21st century, you're not a housewife.\n\nIt all comes down to respect.", "NTA\r  \n\r  \nHe is a grown man and being \"busy\" has nothing to do with this, it's called being lazy. He knows that if he won't do the dishes you eventually will. \r  \n\r  \nAs this sounds like a minor issue, imagine the rest of your life with this. Already I see resentment in you over this, and I bet it's not just the dishes he gets lazy about. You can't change someone, when they show you who they are, believe them.", "NTA\n\nHowever, is he cleaning up after he makes food for himself or do those dishes just sit in the sink too?", "NTA\n\nI clean as I cook though so all that’s left when dinner is over are our plates, utensils, and a serving dish. Takes a couple of minutes. We definitely do the “you cook I clean” thing.", "NTA!\n\nMe and my husband have a rule that if one cooks, the other does dishes which works really well. It's just down to mutual respect! Your partner needs to realise, you aren't his mother, you're his PARTNER. You should work as a team. If he doesn't want to pull his weight, I agree with what you said about just making food for you, getting you own food and he will have to sort him self out. Be true to yourself 💌", "NTA. You don’t have a boyfriend - you have a teenager. He needs to grow up and learn not only responsibility, but to respect you. Either that or he needs to live by himself.", "Nta. Good strategy. Cook and eat for yourself since he’s insistent on being selfish.", "NTA\ndoes he ever cook?", "NTA.\n\nThis is basically the rest of your lives together...", "NTA- if I cook, you clean and visa Vera’s", "I think your missing your boyfriends ingenious idea though.\n\nAfter you wash dishes, inevitably you end up using them again and then having to wash them again, and again its an endless cycle.  However one can break that cycle by just never washing them, I mean they are just going to get dirty again anyways so what's the point?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(26f) have told my boyfriend(26m), countless times that I would appreciate it if he got better at doing the dishes. Usually he will maybe do them once, and then go back to old habits of not doing them at all. It drives me INSANE, because while I understand that he has a busy schedule(work and school), I too have a busy schedule and still manage to do the dishes anytime there are dishes in the sink/when it's my turn to do them.\n\nIt's gotten so bad that when I say \"hey can you do the dishes?\" he will say yes, and then the dishes stay in there for 5 days until I get pissed off and clean them. I decided yesterday that I would rather buy food somewhere/eat all my meals out/eat meals that require ONE dish, than make dinner for us and use several dishes, knowing they won't ever get clean. I told him I will not be cooking any meals until he can figure out how to do the dishes. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. This sounds suspiciously like the beginning of the end OP.", "NTA. He needs to grow up and do his fair share. He’s 26. He has no excuse to not be helping do the dishes.", "NTA. You have things at hand too and yet make time for one little chore.", "NTA. I had roommates like this and eventually had to cook everything in the microwave on paper plates. I also had one clean fork I would wash separately. That way I never had to touch a single dirty dish that others left behind.", "[removed]", "NTA - at all!  As BF and GF you're supposed to be  team.  It is NOT supposed to be you caring and cleaning for him at all time.\n\nI was once married to someone with whom I split the household chores (thank God, no kids).  The list was posted on the fridge with room for checkmarks.  I prefer to do some chores everyday, and ex-husband wanted to do all of his on Saturday.\n\nI remember him coming into the living room and saying \"Hey, let's go clean!\" My reply was always, I have done my chores.  Check the chart on the fridge.  YUP we were divorced 7 years later.\n\nOnce I went on a 3 week business trip.  I came home to find an empty house with every dish and glass dirty, all littered all over the house.  I gathered them up, put them on his side of the bed, covered them with bedcover/quilt.  Then I went to sleep in the guest room.\n\nHe came home hours later, he had to be drunk bc he laid right down on top of the cover and all the dirty dishes.  He pitched a fit.  I told him to clean his CRXP up!  I don't know where he slept that night.\n\nI suppose I am saying what he's doing now, he will prolly do forever.  Decided what you will tolerate, and what you will not.  I wish you the best.", "People respond to stimuli. As long as his needs are being met, what incentive does he have to change? No dishes = no food will be a powerful incentive for behavioral change. NTA", "If you are but premade mess make sure it is just for you otherwise he has no consequences", "NTA good for you", "NTA. You’re both busy. If you’re cooking and he’s not helping with clean up, stop cooking for both of you and make other plans. \n\nOur local grocery stores have ready meals for one that are inexpensive and easy. Just a thought.", "NTA  but you should just start cooking for yourself and separating the dishes. Petty, yet effective.", "NTA, but he knows you'll just end up doing them", "NTA!!!!! Girl you cook AND have work and school. if you cook for you both, then clearly he should at LEAST do the dishes. it’s the least he can do since you cook the meals. It’s all in fairness and that’s not being fair to you. just don’t cook for him. cook for yourself and clean after YOURSELF. your not his maid. he is a big boy and should clean up after himself.", "NTA but I will share my married viewpoint. The best thing I ever did for myself as a partner was look at issues like these as “Is this really a him problem or a me problem?” If it bothers me so much… it’s probably a me problem. I adapted to our team needs, and no longer do things like dishes or unfolded laundry bother me - my boundary is I have to have a dishwasher and a nice washer/dryer. I need the tools to make the job easier for me, I have a little schedule I keep up with, and it doesn’t even bother me anymore. For all the dishes and laundry he doesn’t do, he is sure up in the morning with the kids if I need rest, mowing that lawn every weekend, or grilling which is not my forte. We each bring something to the relationship and figuring out how to best support each other is really best practice.", "I understand people like this perfectly. They definitely still want to get parented, but they can't go back home for that because there's one thing they can't get from their parents...a romantic relationship. People who do this are definitely trying to stay the young child they were at home when they didn't have to do as many chores, but still want the adult benefit of sexy times. People like op's bf need to shape up with this type of behavior or get booted out from an adult relationship.", "Don’t move back home, give your mom a break!", "I've been in such a relationship and I would do everything in the house plus work very heavy shifts until the middle of the night. I once asked him to wash and hang the clothes because I really needed my uniforms to be dry until next morning. Which would be easy if he had gotten em out at 8pm when he finished his home office work. I get home at 3 am and my clothes are still in the washing machine. He's playing WoW TBC. And I'm the one overreacting. When I say once, I've never asked him to do anything for 3 years. And I explained several times why it was really important.", "And go a step farther if he cooks for himself.   Hide most everything.   Keep out two sets of silverware, cups, plates, bowls, and a single mixing bowl, pot and pan.    At least then if you do need to wash sometimes, it is not a huge amount, and he will need to wash if he wants to cook.", "It's vice versa actually :) \nBut 100% agree with this, NTA!", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", ">“Is this really a him problem or a me problem?\n\nThey are bf and gf not mother and toddler. Now is the time he is showing the kind of husband/father he will be. This stage FIRST before your stage. \n \nThis is a him problem.", "There's something so creepy about an adult that acts like a kid but still expects to get laid. Nope. You'll find out about the birds and the bees when you're a big boy 👍😂", "This is one of the MANY reasons why I left my ex. These guys don't know how to be partners: they want bangmaids.  \n\n\nOP? You're NTA, and that's a perfect stance to take. Actions have consequences.", "Autocorrect", "Ha, exactly. If you don't know how to wash your own underwear, you shouldn't be expecting to look at anyone else's."]}