{"id": 3866, "submission_id": "zbqapd", "title": "AITA Monthly Open Forum December 2022", "selftext": "Welcome to the monthly open forum! This is the place to share all your meta thoughts about the sub, and to have a dialogue with the mod team.\n\n\n#Keep things civil. Rules still apply.\n\nDecember is already underway, with year-end holidays fast-approaching! We thought we'd do a quick recap of our monthly deep dives this past year.\n\n[January - Rule 3 reporting change](https://www.reddit.com/r/AmItheAsshole/comments/rtvtft/aita_monthly_open_forum_january_2022/)\n\n[February - Rule 7](https://www.reddit.com/r/AmItheAsshole/comments/si07tp/aita_monthly_open_forum_february_2022/)\n\n[March - Rule 3](https://www.reddit.com/r/AmItheAsshole/comments/t4eh7s/aita_monthly_open_forum_march_2022/)\n\n[April - Rule 5](https://www.reddit.com/r/AmItheAsshole/comments/tunibp/aita_monthly_open_forum_april_2022/)\n\n[May - Moderating the sub](https://www.reddit.com/r/AmItheAsshole/comments/uh5wgn/aita_monthly_open_forum_may_2022/)\n\n[June - Rule 6](https://www.reddit.com/r/AmItheAsshole/comments/v2irhy/aita_monthly_open_forum_june_2022/)\n\n[July - Judgment Bot](https://www.reddit.com/r/AmItheAsshole/comments/vozn9i/aita_monthly_open_forum_july_2022/)\n\n[August - General FAQs](https://www.reddit.com/r/AmItheAsshole/comments/wdhrop/aita_monthly_open_forum_august_2022/)\n\n[September - Rule 14](https://www.reddit.com/r/AmItheAsshole/comments/x399by/aita_monthly_open_forum_september_2022/)\n\n[October - Rule 12](https://www.reddit.com/r/AmItheAsshole/comments/xt1ksm/aita_monthly_open_forum_spooktober_2022/)\n\n[November - Rule 1](https://www.reddit.com/r/AmItheAsshole/comments/yj9wlq/aita_monthly_open_forum_november_2022_civility/)\n\nI'm sure there will be questions, since it's almost that time - we will have something about the yearly Best-Of in next month's Open Forum. \n\n\n#As always, do not directly link to posts/comments or post uncensored screenshots here. Any comments with links will be removed.\n\n---\n\n#[We're currently accepting new mod applications](https://forms.gle/M7i7hSF9iUUkHkqm9)\n\nWe always need mods for the US overnight hours. Currently, we could also definitely benefit from mods active during peak \"bored at work\" hours, i.e. US morning to mid-afternoon.\n\n* You need to be able to mostly mod from a PC. Mobile mood tools are improving and trickling in, but not quite there yet.\n\n* You need to be at least 18.\n\n* You have to be an active AITA participant with multiple comments in the past few months.\n\n---\n\nWe'd also like to highlight the regional spinoffs we have linked on the sidebar! If you have any suggestions or additions to this please let us know in the comments.", "created_utc": 1670100606, "permalink": "/r/AmItheAsshole/comments/zbqapd/aita_monthly_open_forum_december_2022/", "score": 7, "replies": ["I'd love to assist with the moderation, but I already have my hands full on the one subreddit I'm taking care of haha.  \n\n\nBut I've really been enjoying my time back in the subreddit and I do thank the mods for giving me a second chance to prove myself here :)", "Is this a paid job or are the mods just volunteers?", "I have a question about rule 5 \"No Violence\". \n\nI've reported a few posts for this (checking that it violates AITA rules and specifying \"no violence\"), but I generally get back a message saying that mods found that it didn't \"Threaten Violence\" so took no action but I'm welcome to individually block the person if I wish. But I wasn't doing it because I felt threatened or thought OP was threatening anyone, I was doing it because the level of violence expressed could easily have made community members very uncomfortable. As a service to keep the sub safer.  \n\nSo: What is the deal? Is rule 5 a real rule on this sub? If someone talks about an event that has extreme violence in it, but they are not threatening violence to anyone, is this against the rules or not? \n\nI've already stopped reporting these kinds of posts, as it seems violence isn't taken seriously. (Or y'all are totally overworked and something goes wrong in the reporting/mod process.)\n\nI'm just still confused about why my reports got shunted off to a general reddit rule about \"threatening violence\".", "It's a volunteer gig.", "I used to be confused by those replies when I reported content too. But please continue to report! Those replies you're getting are from Reddit Admins, as they also get the Rule 5 reports. As mods, we don't respond to the reports, but we review every single piece of reported content. And yes, we absolutely will remove violent content.", "Just to help folks out:\n\nJanuary - Rule 3 reporting change (Accept Your Judgement)\n\nFebruary - Rule 7 (Post Interpersonal Conflicts)\n\nMarch - Rule 3 (Accept Your Judgment)\n\nApril - Rule 5 (No Violence)\n\nMay - Moderating the sub\n\nJune - Rule 6 (How To Post)\n\nJuly - Judgment Bot\n\nAugust - General FAQs\n\nSeptember - Rule 14 (No Medical Conflicts)\n\nOctober - Rule 12 (This Is Not A Debate Sub)\n\nNovember - Rule 1 (Be Civil)", "What's up with the \"this user is currently shadow-banned or suspended by Reddit admins\" thing that sometimes gets pinned as the reason a post was removed?\n\n\n\nI don't see it on other subs and am curious about it.  How do you know that poster is shadow banned? Why does it result in an automatic post removal?", "Judgment Bot scans the su for posts by those evading a ban and will pin that as the reason. \n\nWe have it do this because users generally hate when a post is removed with no reason given."]}