{"id": 390, "submission_id": "yidr8b", "title": "AITA for taking a job from another person who still works for the company?", "selftext": "I don’t think I’m TA but I feel bad and wanted to see what others thought. I recently got a job at the company I had been applying to for over a year. It wasn’t my dream job, but it was close to where I wanted to live and was a decent job. I lost out on the position I really wanted 8 months ago and two months ago another position was posted as available (though not as good as the one I really wanted) and I applied for that one. \n\nI received a notice that the job was filled but I received a call the next day that the original position I wanted (the better one) was available again and they would like to interview me. I ended up getting and accepting the job within a week and after a two-week notice at my now former job, i started the position that I wanted. \n\nWhat I did not know when I accepted the position is that the person who got the job over me 8 months ago was actually demoted to the lower paying/easier job which was essentially the assistant to the old job (the one I have now) \n\nI have learned that the other person was “incompetent” (not my words but my boss’s and coworkers). And all I and my coworkers have been doing since I started was fixing major issues in the other person’s work. \n\nI also learned that they would have not been demoted if I had not accepted the job. So AITA for accepting a job and getting my new coworker demoted?", "created_utc": 1667226608, "permalink": "/r/AmItheAsshole/comments/yidr8b/aita_for_taking_a_job_from_another_person_who/", "score": 8, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I accepted a position that directly demoted a coworker\n2. The coworker is now essentially my assistant and would not have been demoted if I did not accept the position.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA... Company made the employment decision that it say as its own best interest (hiring you and demoting co-worker), and you took the decision in your best interest (taking the better job).\n\nChances are that if you'd declined, they would have just found somebody else new for the job you wanted, and co-worker would still be demoted. You'd be losing out, company would be the same, and co-worker would be no better off.", "NTA. Being TA implies that there was malicious intention. There was none, a job opened, you interviewed and received an offer based upon your merits. It would be wild to consider you TA. What we’re you supposed to do? Ask in the interview if anyones feelings would be hurt by you taking the job? No!", "NTA this all happened before you joined the company, you did not know the individual and don't owe them anything. Just work hard and do a good job.", "NTA  \n\n\nThey got what they earned. If you hadn't showed up, someone else would've. They wanted to demote them before they talked to you.", "NTA, they were not competent in the role, if you hadn’t got it someone else would have been given the position thats just life.", "NTA  \n\n\nsounds like they would have eventually been fired for not doing the job", "NTA. You didn’t find out that the other person had been demoted until after accepting the position and besides, you were offered the job because they felt you would be better suited for this position. While yes, I’m sure she is hurt, that has to do with her and her capabilities for the position - you did nothing wrong accepting it.", "NTA.  You didn't get them demoted.  They did it to themselves.  If you hadn't accepted the job, the demotion would only have been delayed until they found someone else.", "NTA \n\nIf you didn't take the job then someone else would've. That person wouldn't have stayed in that position.", "NTA. You didn’t set out to get them demoted, and if they really were incompetent eventually they would have been fired or demoted anyway. I’m sure your other coworkers are glad to have someone else in the job too.", "NTA. They'll most likely be fired after assisting in fixing many of the problems they caused.", "NTA, you didn't know when accepting the position, and even if you would have known you still would not be TA.\n\n(the only way you would be TA would be if you've been bad-mouthing and destroying the work of the person you replaced for the previous 8 months, and I can't see you've been doing this)", "NTA. The company should have hired you in the first place, and regardless of who was hired, you or someone else, that person who had your job before  you was going to get demoted anyway.", "NTA. The company made a business decision and so did you. Even if the other employee had been doing well, you did nothing wrong.\n\nIn addition, I strongly suspect the other employee would have been demoted or fired soon. If you hadn’t taken the job some else would have in the near future.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI don’t think I’m TA but I feel bad and wanted to see what others thought. I recently got a job at the company I had been applying to for over a year. It wasn’t my dream job, but it was close to where I wanted to live and was a decent job. I lost out on the position I really wanted 8 months ago and two months ago another position was posted as available (though not as good as the one I really wanted) and I applied for that one. \n\nI received a notice that the job was filled but I received a call the next day that the original position I wanted (the better one) was available again and they would like to interview me. I ended up getting and accepting the job within a week and after a two-week notice at my now former job, i started the position that I wanted. \n\nWhat I did not know when I accepted the position is that the person who got the job over me 8 months ago was actually demoted to the lower paying/easier job which was essentially the assistant to the old job (the one I have now) \n\nI have learned that the other person was “incompetent” (not my words but my boss’s and coworkers). And all I and my coworkers have been doing since I started was fixing major issues in the other person’s work. \n\nI also learned that they would have not been demoted if I had not accepted the job. So AITA for accepting a job and getting my new coworker demoted?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, if someone doesn't do their job well then a company is looking for a replacement, now it's you but it could just as well have been someone else.", "Umm NTA.  The company made a decision which you didn't even know about initially.  Even if you had known all of the background ahead of time, there was still no reason for you to not accept a job that they offered.  It sounds like the other person should be thankful they were only demoted and not fired if they were that bad at the job.", "NTA\n\nYou knew none of this when you were applying and interviewing for the position, so it's not on you at all. There's a reason they got demoted but that's not your problem, it's theirs. Just do your job well and be happy that you landed the job you've wanted for so long.", "Why is this even a question", "NTA", "NTA:  you applied for a posting.  they made a bad hiring decision.  that is not your fault.  as far as this:\n\n>I also learned that they would have not been demoted if I had not accepted the job.\n\nno.  they offered you the position.  if it wasn't listed, it was going to be.  your new co-worker was going to be demoted or fired regardless of your actions.  if it wasn't you, it would have been someone else.  don't feel guilty."]}