{"id": 3973, "submission_id": "zcquy1", "title": "AITA for embarrassing my boyfriend at the movies?", "selftext": "I, (21f) and my boyfriend (25m) went to the movies. We got the usual popcorn, drinks, nachos. After the movie was over he said “let’s go,” so I stood up and started to gather my trash. Then, I realized he was walking away from me and was leaving his trash behind. So I quietly called him over and motioned to pick up after himself. The whole walk to the car he was saying how stupid and embarrassing I made him look. I said it is basic manners to take your trash with you. His argument was “those are the worker’s jobs.” I told him that it doesn’t matter and it makes their job easier and less stressful. But he said I embarrassed him by the way I approached him and made him look. My thought is, if he hadn’t left his trash behind I wouldn’t of had to mention it to him. Also, this wasn’t trash on the floor, just leftover popcorn, nachos, etc.", "created_utc": 1670199535, "permalink": "/r/AmItheAsshole/comments/zcquy1/aita_for_embarrassing_my_boyfriend_at_the_movies/", "score": 65, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I’m ta because I approached him to take his trash. Perhaps the way I mentioned to it wasn’t as nice, or I could’ve just taken his trash with mine and not made a big deal.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, cleaning up after yourself in any space is being respectful of your environment and others around you. \n\n>His argument was “those are the worker’s jobs.” \n\nI can't believe he actually said the fucking thing.", "NTA, and for me personally, plenty of reason not to continue dating him. He left a mess for someone else to clean up and then blamed you for \"embarrassing\" him. Imagine being married to someone who treats people like that.", "NTA. \n\nI don’t see how you embarrassed him?\n\nPeople need to pick up after themselves. \n\nIf you’re in the US most businesses still have staffing problems.", "You did the right thing. It is never too late to teach people basic good manners.\n\nNTA", "Nta,  That was a total dick move on his part. That is absolutely not the employee's job to pick up after him. He embarrassed himself.", "NTA- Why does he think that theatres have trashcans at the exit if not to put your trash in? And even if he just happened to forget to pick up an empty container (which I've certainly done before)  it's not like you yelled at him or called him names or something, you merely pointed it out to him. I don’t see how that's embarrassing. \n\nPersonally, I've found that if someone is rude to service workers or has a disrespectful attitude toward them like your BF then, that should be a huge red flag. That usually turns out to be the tip of the direspect/condescension iceberg in the long run. I don’t have patience for people who don't treat people especially (usually low wage) service workers as they would want to be treated. And I'm sure your BF wouldn't appreciate people leaving their trash instead of putting it the trash can conveniently located at the exit if the roles were reversed.", "You can tell a lot about a person’s character based on how they treats service employees. He’s treating them like garbage and pretty soon he’ll do the same to you. NTA.", "NTA\n\nYour bf is the AH. He embarrassed himself by not cleaning after himself.  Basic manners to clean up after yourself.", "NTA, seems you discreetly brought his attention to the trash. It seems he was more embarrassed for himself for being called out in general. Had nothing to do with the people around you. He felt embarrassed because he realized he did something wrong and instead of admitting it, he got defensive.", "NTA. How does he treat waiters when your out? If this is how he treats people in the service industry it's showing you his morals and be prepared to have a filthy house if you guys live together because he seems like the type to say it's YOUR job to clean.", "NTA, you’re BF is though.", "Yeah, you forgot to put the biggest piece of trash in the bin - your boyfriend. It's bad enough being a slob, but then giving your partner a hard time about picking up after yourself, that's a red flag.", "NTA. Your boyfriend is a huge asshole. Is he leaving tips for the people cleaning up? They’re not his fucking maids. He sucks. The turn around from movie to movie is insane and the fact that anything is clean is a miracle even when people do clean up their own trash.", "The smaller problem is the failure to clean up,after himself. The larger problem is his response to you reminding him. He could have said, “oh my bad, yeah let me get that”, but he didn’t, he blamed you for mentioning his bad behavior.  \n\nHe felt comfortable blaming you. That’s a problem.", "NTA. But the movie leftovers are not the trash you need to be throwing out.", "NTA and your boyfriend was apparently absent in Kindergarten when they taught them to pick up their trash, as I teach my kindergartners to do every day.", "NTA and DTMFA.", "NTA, at 25 yrs old you should not have to be reminded to pick up after yourself.", "NTA at all.\n\nMe and my family do the samething. We take our empty popcorn bags and large carton to throw away (or to take and ask for a refill on our way out because the popcorn is just too good sometimes) in the trash outside the theatre. It just feels so wrong to leave trash behind when you are more than capable to do it yourself, so, thats what we do. \n\nUnless its like, bits of popcorn, candy or chips on the sticky floor, we usually throw away what we can. \n\nYour BF quite literally overreacted and no one would have cared if he left his trash or not, so I don't see the problem. Unless he was embarassed by the fact he ACTIVELY CHOSE to leave trash behind, knowing he was more than capable to do it himself but was probably lazy, that's on him.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI, (21f) and my boyfriend (25m) went to the movies. We got the usual popcorn, drinks, nachos. After the movie was over he said “let’s go,” so I stood up and started to gather my trash. Then, I realized he was walking away from me and was leaving his trash behind. So I quietly called him over and motioned to pick up after himself. The whole walk to the car he was saying how stupid and embarrassing I made him look. I said it is basic manners to take your trash with you. His argument was “those are the worker’s jobs.” I told him that it doesn’t matter and it makes their job easier and less stressful. But he said I embarrassed him by the way I approached him and made him look. My thought is, if he hadn’t left his trash behind I wouldn’t of had to mention it to him. Also, this wasn’t trash on the floor, just leftover popcorn, nachos, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. \n\n&#x200B;\n\nAlso, you need a new boyfriend. His ego is way too big that he can't even acknowledge his own mistakes. That will cause conflicts in a long run.", "NTA he is an AH", "NTA. You believe in common courtesy (respect to you, by the way), and he sees simple consideration for others as beneath him.", "NTA. You didn't embarrass him he did that to himself. Don't let him turn this around on you he is the ah in this situation and had zero right to be angry with you and carry on about it in the car. Trash the boyfriend you can do better.", "Nta. He embarrassed himself.", "NTA. Your bf just showed you who he really is. Believe him.", "NTA. Great job on your part, I know the workers are grateful for people like you. It doesn’t take much to clean up after yourself. \n\nShould have yelled it out in the theater for everyone to hear lol, now that would be embarrassing on him", "In before marinara flags.\nBut seriously, NTA. He's T A.  When someone shows you who they are, believe them.", "NTA. But your BF . . .", "NTA, but your bf sure is.", "Tell him to throw his trash away. That’s how civilized humans act.", "NTA and that is not the workers jobs. It is implicit that you clean up after yourselves in a theatre.", "NTA, but boyfriend is. Yes, while it is the employees jobs to clean the cinema - he doesn’t need to go out of his way to make things worse. You are right, it’s good manners and etiquette to remove your own trash if you can.", "Someone on another subreddit just a couple days ago posted a picture of trash left behind in a movie theater. I think it was the Mildly Infuriating", "YTA\n\n&#x200B;\n\nYour behavior was as bad as his. HE is not your child, you had no justification to call him out like that. YOu had the option to take your trash and leave his, or to take his trash, too.\n\n&#x200B;\n\nBut HE is an Adult, and makes his own decissions. If you keep this AH behavior up, you will be single soon.", "I can’t believe you are still with someone who is so disrespectful of service workers. NTA", "Might as well piss on the floor in the men’s room, that’s why there’s janitors, right?", "Exactly. And if this is his acting good- stage, it will be so much worse.", "Exactly! Imagine moving in together and dividing household responsibilities. I can easily see him leaving complete messes for OP to clean \"because it's your job\". Thay would get old, VERY fast for me. Giant red flag here.", "Op needs to start having general public decency lessons with the bf before going in public with him. This is bound to happen again, and maybe even under worse circumstances", "She does have every right to call out bad behavior when she sees it. His decision was to leave his trash. The consequence of that was her asking him to dispose of it. \n\nI hope she is single soon because this guy's sounds like trash. Pun intended."]}