{"id": 4004, "submission_id": "zd3hew", "title": "AITA for telling my parents a person from the internet is doing a better job at parenting than them?", "selftext": "Quick Info: The climax of this story happened at the beginning of last year when I was 15, but I can’t get it out of my head for some reason so I decided to ask here.\n\nMy mom is a very “faithful” Jehovah’s Witness. I used to follow her until I was 14 when I decided that I would be going my own way because I started seeing a few red flags. She tried to tell me to come back because everyone would miss me but I rejected.\n\nA few months after, the macorona hit and I spent much more time on the internet. That’s when I found out about LGBTQ+ and started questioning my sexuality. I thought long and hard, did a bit of research and came to the conclusion that I’m bisexual. When my mom found out about it, she came into my room to talk with me. She essentially told me that I should focus on getting my school done and get a well-paid job first and brought up the topic of religion again, how she doesn’t want to see me die in armageddon. I broke down infront of her and she left. There were a few attempts to get me back after that but none worked.\n\nFast forward to September 2020, my mom married my stepdad. Suddenly my parents would constantly complain about the smallest things I did wrong, even if I didn’t. They’d constantly make remarks like I’m the reason everyone in the family has to suffer. This went on for months and I started isolating myself much more, only ever coming out to eat or go to the bathroom.\n\nAround that time I met a nice guy on the internet. We started talking, became friends and over a few months I started to see him as my father figure. He treated me like I was his own, spending time with me when I was lonely and comforting me whenever I was feeling down.\n\nAfter a while, my stepdad decided to introduce a new rule: Either be at breakfast before 7am or not have internet for the rest of the day (9am-9pm). I tried to follow the rule as much as I could, but of course had a few slip-ups. My parents were extremely strict with me and enforced the rule even after coming just two or three minutes late. My brother however was a completely different story. He could sleep in for hours multiple days in a row and I parents wouldn’t even budge. This infuriated me since this kind of special treatment had been going on for months.\nI told mom that I find it unfair how he breaks the rules and gets whatever he wants whilst I’m constantly displayed as an outcast. My stepdad overheard and decided to lower only my time from 9am-9pm to 3 hours over the entire day. I was furious. In frustration, I wrote a letter complaining about everything they did to me, how they’re treating me unfairly, how I felt neglected and how a friend from the internet is doing a better job at taking care of me than them. I put the letter on my mom’s bedside table and waited in my room. When she found it, I heard loud crying and everyone in the house was pissed at me. AITA?", "created_utc": 1670236746, "permalink": "/r/AmItheAsshole/comments/zd3hew/aita_for_telling_my_parents_a_person_from_the/", "score": 27, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like the letter to my parents was too harsh and my entire family told me that it was bad of me to say those things and I shouldn’t have acted the way I did\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your family sounds like a nightmare. They needed a wake up call though I doubt the letter worked.", "Nta but you are also probably being groomed given that your \"friend\" is 20+. Please talk to a trusted adult if you can.", "I think your parents were strict at you for what you are, you said you told your mom you are bisexual and that's when it all began. Also you refuse to follow the religion. It sounds like everything will be fixed if you change these two things. But why would you? It's your right. They can't and should not try to force you. Your parents are bad and I hope they realize it soon before it's too late for them.\nNTA.", "NTA\n\nI can't judge how much of an asshole your parents are but they definitely are for treating you and your brother differently.\n\nWhat is the major issue though, is your fatherly internet friend. Honestly that is such a huge, huge, huge red flag. That guy is grooming you. You'll now think, how would I know that. I know because I am likely the age that friend is and no person of older age, absolutely no one without ill intent, will become friends with a 15 year old on the internet. Really, you sound emotionally intelligent and smart and mature for your age but you lack the experience of being in your 20's and 30's. So please, please, please end this now. It won't end well.\n\nBeing friends with a 15yo and stepping into some sort of fatherly relationship is very much overstepping boundaries that any older person is aware of. He's doing this on purpose. \n\nThe guy will simply be nice for a while, then slowly overstep any healthy boundaries. He'll tell you how pretty you are, how much he wished he was your age etc. He'll draw you in until you yourself will feel like you are in love with him and that anything inappropriate is your idea.", "NTA. I honestly would check out r/raisedbynarcissists because that’s almost what it sounds like.", "NTA. If the shoe fits...", ">My mom is a very “faithful” Jehovah’s Witness.\n\nNTA. Don't need to read any further than this.", "NTA but unfortunately this seems like one of the many life scenarios where being right doesn’t necessarily mean you’re going to “win”.\n\nJW is largely considered to be a cult; your mom and stepdad suck; your brother is the golden child. Your best bet here is probably to find a way to get out of the house and to get therapy ASAP. Any school resources, friends, or non-JW relatives who could help? Good luck", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nQuick Info: The climax of this story happened at the beginning of last year when I was 15, but I can’t get it out of my head for some reason so I decided to ask here.\n\nMy mom is a very “faithful” Jehovah’s Witness. I used to follow her until I was 14 when I decided that I would be going my own way because I started seeing a few red flags. She tried to tell me to come back because everyone would miss me but I rejected.\n\nA few months after, the macorona hit and I spent much more time on the internet. That’s when I found out about LGBTQ+ and started questioning my sexuality. I thought long and hard, did a bit of research and came to the conclusion that I’m bisexual. When my mom found out about it, she came into my room to talk with me. She essentially told me that I should focus on getting my school done and get a well-paid job first and brought up the topic of religion again, how she doesn’t want to see me die in armageddon. I broke down infront of her and she left. There were a few attempts to get me back after that but none worked.\n\nFast forward to September 2020, my mom married my stepdad. Suddenly my parents would constantly complain about the smallest things I did wrong, even if I didn’t. They’d constantly make remarks like I’m the reason everyone in the family has to suffer. This went on for months and I started isolating myself much more, only ever coming out to eat or go to the bathroom.\n\nAround that time I met a nice guy on the internet. We started talking, became friends and over a few months I started to see him as my father figure. He treated me like I was his own, spending time with me when I was lonely and comforting me whenever I was feeling down.\n\nAfter a while, my stepdad decided to introduce a new rule: Either be at breakfast before 7am or not have internet for the rest of the day (9am-9pm). I tried to follow the rule as much as I could, but of course had a few slip-ups. My parents were extremely strict with me and enforced the rule even after coming just two or three minutes late. My brother however was a completely different story. He could sleep in for hours multiple days in a row and I parents wouldn’t even budge. This infuriated me since this kind of special treatment had been going on for months.\nI told mom that I find it unfair how he breaks the rules and gets whatever he wants whilst I’m constantly displayed as an outcast. My stepdad overheard and decided to lower only my time from 9am-9pm to 3 hours over the entire day. I was furious. In frustration, I wrote a letter complaining about everything they did to me, how they’re treating me unfairly, how I felt neglected and how a friend from the internet is doing a better job at taking care of me than them. I put the letter on my mom’s bedside table and waited in my room. When she found it, I heard loud crying and everyone in the house was pissed at me. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "When you said you made your mother cry I smiled just a little, as someone who grew up in this cult everything they do they think is justified, no matter how punitive, evil, or hateful there’s always a biblical justification. Growing up there was a book about parenting that literally had a teenager in a cage as one of the illustrations. You demonstrated deep down there’s a person in there who cares that you like her, no matter how deep they spiral into punishment. It’s a rare moment of self awareness in a cult that’s so brutal towards family relationships \n\nI think you need to be careful and wary, a core principle of JW parenting is the prodigal son, as in you throw the child out, refuse to talk or support them until they come back humbled. The possibility that you’re on the street the day you turn 18 exists. \n\nThe other is “spare the rod, spoil the child”. Their religious culture gives them permission to beat, to punish, to deny basic dignity as a control measure. Keeping your head down, biding your time, getting things you need like a job, money, license, important documents , just basics for life is important. You might win small victories but they don’t see you as sincerely trying to express yourself they see you as a person compromise by Satan, they care about exerting control until you break. I’ve seen it all too frequently if the children don’t comply their entire support system disappears the second they turn 18. Might be important to express yourself but then again it might also be important just to be like water be whatever shape you have to be until you can leave safely. Think about your long-term future your freedom your independence and your stability it is unfortunate how often rainbow kids wind up on the street. So no I don’t think you’re an asshole I just think you have to be strategic about how you go about your life. Stay safe stay careful OK.", "Mom: *does everything in her power to make your life miserable*\n\nAlso Mom: \"damn, why doesn't she love me ??\"\n\nNTA", "You’re right the letter probably didn’t work, i’ve seen it time and time again in that religion if the kids walk away it’s like the parents just turn off their hearts, i’ve never seen a religion where turning off your love like it’s a tap when your children step out of line is so normalized, I am sure there’s others by JW‘s amongst the most hardline. It’s shocking to me that the mother actually felt enough to cry. I have no doubt that the controlling stepfather will come up with an even more emotionally brutal punishment because that is the psychology that’s encouraged and ingrained. It’s a rare moment of realness from the mother.", "While that’s very common, it’s not universal.  When I was in high school, I strongly implied but never stated that I was in college (and thus about 4 years older than I really was).  I made friends with people I gamed with, mostly text-based RPGs.  I eventually chose to out myself as my real age, a few years later.  It’s been over 20 years and I’m still friends with one of those guys; others, I was in touch with until AIM ceased to exist in 2017.  They were all very scrupulous about not overstepping boundaries and treated me like a niece or much younger cousin, until I was solidly an adult (in my early 20s), and then they treated me like a peer.", "My friend is in his mid 20s and we’ve known each other for two years now. He’s never asked me for anything weird or sexual and is actively against it because he knows I’m a minor and really just wants to make sure I’m doing well.\nI highly appreciate the concern tho", "Um, no. That's not at all true.\n\nThere are a lot of people out there who will absolutely become close to younger people with absolutely no ill intent. \n\nI mean, have you not heard of Big Brothers and Big Sisters of America? Youth mentoring is absolutely a thing, and not everybody who does it is part of a structured group.\n\nThat said, it's still best to avoid engaging in risky behavior as much as possible.", "NTA,   \nI'm not sure if it's because you've rebelled against the religion or challanged their ideology by identifiying as Bi, but there deffinately seems to be a lot of unfair treatment steered towards you. Like some of the others I'm concerned about this 'fatherly friend'. Maybe it's because I'm a court reporter and I hear and write about this so often but a lot of groomers are really good at what they do. Please be careful. I will say beyond that it does get better. I'm sure right now you feel pretty powerless, but things do improve.", "Yep. This is how cults work. They try to wear you down socially and emotionally. NTA.\n\nI have to add obligatory caution with this internet guy. Sometimes predators lure young people in by comforting, validating etc. Just be careful.", "Well, I’ve been in a residential group since around April this year, but not because I requested it but because my parents shoved me into it against my will due to “media addiction” and shoving the responsibilities to someone else", "I understand that, I also had internet friends that were older than me but the fatherly figure bit worries me so much.\n\nI have met far too many victims to see the good in people in such cases.", "Honestly, that makes my concerns even worse. Please, be careful, please, I'm begging you.", "The kind of behavior I’d describe as older cousin or uncle type behavior could easily have been described as fatherly.  My dad and I had a lot of conflict in my teens, so these were the people I talked to about my relationships, and got advice from, and when I started exploring religion, it was internet friends I turned to because my parents were on the border between atheist and agnostic and I didn’t think they’d get it.  One of them sent me my first books on paganism, because that was his faith and something I was interested in (this was when I’d gone off to college at 16).", "I am, don’t worry. Thanks for the advice", "You seem like a cool person, I hope you can shut out your parents as much as possible until you are on your own feet."]}