{"id": 4004, "submission_id": "zd3hew", "title": "AITA for telling my parents a person from the internet is doing a better job at parenting than them?", "selftext": "Quick Info: The climax of this story happened at the beginning of last year when I was 15, but I can’t get it out of my head for some reason so I decided to ask here.\n\nMy mom is a very “faithful” Jehovah’s Witness. I used to follow her until I was 14 when I decided that I would be going my own way because I started seeing a few red flags. She tried to tell me to come back because everyone would miss me but I rejected.\n\nA few months after, the macorona hit and I spent much more time on the internet. That’s when I found out about LGBTQ+ and started questioning my sexuality. I thought long and hard, did a bit of research and came to the conclusion that I’m bisexual. When my mom found out about it, she came into my room to talk with me. She essentially told me that I should focus on getting my school done and get a well-paid job first and brought up the topic of religion again, how she doesn’t want to see me die in armageddon. I broke down infront of her and she left. There were a few attempts to get me back after that but none worked.\n\nFast forward to September 2020, my mom married my stepdad. Suddenly my parents would constantly complain about the smallest things I did wrong, even if I didn’t. They’d constantly make remarks like I’m the reason everyone in the family has to suffer. This went on for months and I started isolating myself much more, only ever coming out to eat or go to the bathroom.\n\nAround that time I met a nice guy on the internet. We started talking, became friends and over a few months I started to see him as my father figure. He treated me like I was his own, spending time with me when I was lonely and comforting me whenever I was feeling down.\n\nAfter a while, my stepdad decided to introduce a new rule: Either be at breakfast before 7am or not have internet for the rest of the day (9am-9pm). I tried to follow the rule as much as I could, but of course had a few slip-ups. My parents were extremely strict with me and enforced the rule even after coming just two or three minutes late. My brother however was a completely different story. He could sleep in for hours multiple days in a row and I parents wouldn’t even budge. This infuriated me since this kind of special treatment had been going on for months.\nI told mom that I find it unfair how he breaks the rules and gets whatever he wants whilst I’m constantly displayed as an outcast. My stepdad overheard and decided to lower only my time from 9am-9pm to 3 hours over the entire day. I was furious. In frustration, I wrote a letter complaining about everything they did to me, how they’re treating me unfairly, how I felt neglected and how a friend from the internet is doing a better job at taking care of me than them. I put the letter on my mom’s bedside table and waited in my room. When she found it, I heard loud crying and everyone in the house was pissed at me. AITA?", "created_utc": 1670236746, "permalink": "/r/AmItheAsshole/comments/zd3hew/aita_for_telling_my_parents_a_person_from_the/", "score": 211, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like the letter to my parents was too harsh and my entire family told me that it was bad of me to say those things and I shouldn’t have acted the way I did\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your family sounds like a nightmare. They needed a wake up call though I doubt the letter worked.", "Nta but you are also probably being groomed given that your \"friend\" is 20+. Please talk to a trusted adult if you can.", "I think your parents were strict at you for what you are, you said you told your mom you are bisexual and that's when it all began. Also you refuse to follow the religion. It sounds like everything will be fixed if you change these two things. But why would you? It's your right. They can't and should not try to force you. Your parents are bad and I hope they realize it soon before it's too late for them.\nNTA.", "NTA\n\nI can't judge how much of an asshole your parents are but they definitely are for treating you and your brother differently.\n\nWhat is the major issue though, is your fatherly internet friend. Honestly that is such a huge, huge, huge red flag. That guy is grooming you. You'll now think, how would I know that. I know because I am likely the age that friend is and no person of older age, absolutely no one without ill intent, will become friends with a 15 year old on the internet. Really, you sound emotionally intelligent and smart and mature for your age but you lack the experience of being in your 20's and 30's. So please, please, please end this now. It won't end well.\n\nBeing friends with a 15yo and stepping into some sort of fatherly relationship is very much overstepping boundaries that any older person is aware of. He's doing this on purpose. \n\nThe guy will simply be nice for a while, then slowly overstep any healthy boundaries. He'll tell you how pretty you are, how much he wished he was your age etc. He'll draw you in until you yourself will feel like you are in love with him and that anything inappropriate is your idea.", "NTA. I honestly would check out r/raisedbynarcissists because that’s almost what it sounds like.", "NTA. If the shoe fits...", ">My mom is a very “faithful” Jehovah’s Witness.\n\nNTA. Don't need to read any further than this.", "NTA but unfortunately this seems like one of the many life scenarios where being right doesn’t necessarily mean you’re going to “win”.\n\nJW is largely considered to be a cult; your mom and stepdad suck; your brother is the golden child. Your best bet here is probably to find a way to get out of the house and to get therapy ASAP. Any school resources, friends, or non-JW relatives who could help? Good luck", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nQuick Info: The climax of this story happened at the beginning of last year when I was 15, but I can’t get it out of my head for some reason so I decided to ask here.\n\nMy mom is a very “faithful” Jehovah’s Witness. I used to follow her until I was 14 when I decided that I would be going my own way because I started seeing a few red flags. She tried to tell me to come back because everyone would miss me but I rejected.\n\nA few months after, the macorona hit and I spent much more time on the internet. That’s when I found out about LGBTQ+ and started questioning my sexuality. I thought long and hard, did a bit of research and came to the conclusion that I’m bisexual. When my mom found out about it, she came into my room to talk with me. She essentially told me that I should focus on getting my school done and get a well-paid job first and brought up the topic of religion again, how she doesn’t want to see me die in armageddon. I broke down infront of her and she left. There were a few attempts to get me back after that but none worked.\n\nFast forward to September 2020, my mom married my stepdad. Suddenly my parents would constantly complain about the smallest things I did wrong, even if I didn’t. They’d constantly make remarks like I’m the reason everyone in the family has to suffer. This went on for months and I started isolating myself much more, only ever coming out to eat or go to the bathroom.\n\nAround that time I met a nice guy on the internet. We started talking, became friends and over a few months I started to see him as my father figure. He treated me like I was his own, spending time with me when I was lonely and comforting me whenever I was feeling down.\n\nAfter a while, my stepdad decided to introduce a new rule: Either be at breakfast before 7am or not have internet for the rest of the day (9am-9pm). I tried to follow the rule as much as I could, but of course had a few slip-ups. My parents were extremely strict with me and enforced the rule even after coming just two or three minutes late. My brother however was a completely different story. He could sleep in for hours multiple days in a row and I parents wouldn’t even budge. This infuriated me since this kind of special treatment had been going on for months.\nI told mom that I find it unfair how he breaks the rules and gets whatever he wants whilst I’m constantly displayed as an outcast. My stepdad overheard and decided to lower only my time from 9am-9pm to 3 hours over the entire day. I was furious. In frustration, I wrote a letter complaining about everything they did to me, how they’re treating me unfairly, how I felt neglected and how a friend from the internet is doing a better job at taking care of me than them. I put the letter on my mom’s bedside table and waited in my room. When she found it, I heard loud crying and everyone in the house was pissed at me. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "When you said you made your mother cry I smiled just a little, as someone who grew up in this cult everything they do they think is justified, no matter how punitive, evil, or hateful there’s always a biblical justification. Growing up there was a book about parenting that literally had a teenager in a cage as one of the illustrations. You demonstrated deep down there’s a person in there who cares that you like her, no matter how deep they spiral into punishment. It’s a rare moment of self awareness in a cult that’s so brutal towards family relationships \n\nI think you need to be careful and wary, a core principle of JW parenting is the prodigal son, as in you throw the child out, refuse to talk or support them until they come back humbled. The possibility that you’re on the street the day you turn 18 exists. \n\nThe other is “spare the rod, spoil the child”. Their religious culture gives them permission to beat, to punish, to deny basic dignity as a control measure. Keeping your head down, biding your time, getting things you need like a job, money, license, important documents , just basics for life is important. You might win small victories but they don’t see you as sincerely trying to express yourself they see you as a person compromise by Satan, they care about exerting control until you break. I’ve seen it all too frequently if the children don’t comply their entire support system disappears the second they turn 18. Might be important to express yourself but then again it might also be important just to be like water be whatever shape you have to be until you can leave safely. Think about your long-term future your freedom your independence and your stability it is unfortunate how often rainbow kids wind up on the street. So no I don’t think you’re an asshole I just think you have to be strategic about how you go about your life. Stay safe stay careful OK.", "Mom: *does everything in her power to make your life miserable*\n\nAlso Mom: \"damn, why doesn't she love me ??\"\n\nNTA", "You’re right the letter probably didn’t work, i’ve seen it time and time again in that religion if the kids walk away it’s like the parents just turn off their hearts, i’ve never seen a religion where turning off your love like it’s a tap when your children step out of line is so normalized, I am sure there’s others by JW‘s amongst the most hardline. It’s shocking to me that the mother actually felt enough to cry. I have no doubt that the controlling stepfather will come up with an even more emotionally brutal punishment because that is the psychology that’s encouraged and ingrained. It’s a rare moment of realness from the mother.", "While that’s very common, it’s not universal.  When I was in high school, I strongly implied but never stated that I was in college (and thus about 4 years older than I really was).  I made friends with people I gamed with, mostly text-based RPGs.  I eventually chose to out myself as my real age, a few years later.  It’s been over 20 years and I’m still friends with one of those guys; others, I was in touch with until AIM ceased to exist in 2017.  They were all very scrupulous about not overstepping boundaries and treated me like a niece or much younger cousin, until I was solidly an adult (in my early 20s), and then they treated me like a peer.", "My friend is in his mid 20s and we’ve known each other for two years now. He’s never asked me for anything weird or sexual and is actively against it because he knows I’m a minor and really just wants to make sure I’m doing well.\nI highly appreciate the concern tho", "Um, no. That's not at all true.\n\nThere are a lot of people out there who will absolutely become close to younger people with absolutely no ill intent. \n\nI mean, have you not heard of Big Brothers and Big Sisters of America? Youth mentoring is absolutely a thing, and not everybody who does it is part of a structured group.\n\nThat said, it's still best to avoid engaging in risky behavior as much as possible.", "NTA,   \nI'm not sure if it's because you've rebelled against the religion or challanged their ideology by identifiying as Bi, but there deffinately seems to be a lot of unfair treatment steered towards you. Like some of the others I'm concerned about this 'fatherly friend'. Maybe it's because I'm a court reporter and I hear and write about this so often but a lot of groomers are really good at what they do. Please be careful. I will say beyond that it does get better. I'm sure right now you feel pretty powerless, but things do improve.", "Yep. This is how cults work. They try to wear you down socially and emotionally. NTA.\n\nI have to add obligatory caution with this internet guy. Sometimes predators lure young people in by comforting, validating etc. Just be careful.", "Well, I’ve been in a residential group since around April this year, but not because I requested it but because my parents shoved me into it against my will due to “media addiction” and shoving the responsibilities to someone else", "I understand that, I also had internet friends that were older than me but the fatherly figure bit worries me so much.\n\nI have met far too many victims to see the good in people in such cases.", "Honestly, that makes my concerns even worse. Please, be careful, please, I'm begging you.", "The kind of behavior I’d describe as older cousin or uncle type behavior could easily have been described as fatherly.  My dad and I had a lot of conflict in my teens, so these were the people I talked to about my relationships, and got advice from, and when I started exploring religion, it was internet friends I turned to because my parents were on the border between atheist and agnostic and I didn’t think they’d get it.  One of them sent me my first books on paganism, because that was his faith and something I was interested in (this was when I’d gone off to college at 16).", "I am, don’t worry. Thanks for the advice", "You seem like a cool person, I hope you can shut out your parents as much as possible until you are on your own feet.", "NTA but please be careful with this internet friend. I saw that you said he doesn't ask for anything sexual or inappropriate, but a lot of creeps out there can be extremely patient. Don't disclose any personal information, don't meet him in person or ONLY in a very public place. Be careful.", "NTA.  You have three more years living under their roof. I know you will feel like it’s not being true to yourself, but to get them off your back you should tell them that after deep reflection you’ve realized that your you’re not bisexual and that you were just confused.  Play their game so you can make life living with them tolerable, and when you move out in a couple years you can go LC or NC and live your life the way you want.", "NTA. As a person on the internet please be careful with your online friend. Chances are he is not doing anything wrong but it can be very hard to tell. Please be careful. Does your school have a therapist? If so see if you can get in to see them to talk.", "What's with your bio dad?", "NTA they are punishing you for not following their religion with the hope that you  break down and go back to it. I know people from Jehovah's witness that got out and their parents did the same thing to them, just attack them and abuse them emotionally and mentally to try and make them be \"faitful\" again", "My parents divorced when I was 9, I barely have contact with him", "How long till you can get out of that house?", "May I ask  you do actually have a media addiction?  If not this is insane...", "I had an older internet friend when I was a teen girl, I talked to him almost every day. His name was Michael and he was gay, we used to joke about how Xander from buffy the vampire slayer was hot. I later found out he killed himself, his sister emailed everyone in his contacts. He probably did it partly because his parents kept trying to set him up with women despite knowing about his sexuality and I know it hurt him. They thought he was going to hell. \n\nI still have his number on my cell because I don't ever want to forget him even if I can't call him and it's been 20 years now.", "Nope, I’m old now. That was my experience though. My mother was a single parent who was treated like a second-class citizen by the religion but they really crossed her when a brother (man in the congregation) was creeping out all of the women in the congregation and she was the only person to bring it up in any serious context and the way they treated her was like she was like she was fundamentally lacking in faith, reasoning abilities, and they attacked her character. She stepped back significantly at that point and we were allowed to step back too. In hindsight she was right, given how much is now known about the cover-up practices of sexual assault and harassment within the religion\n\nAnd even as I say all that talking to my mother and a bunch of other elders, but they were all attracted to authoritarian parenting styles that’s just how it is, they are authoritarian because their religion is inherently irrational and oppressive\n\nAnyway that’s a whole another story but as a person who consistently saw how children strayed away from religion were treated, I doubt that has changed it’s really one of the core practices of the religion culturally.", "I wouldn’t consider myself to have a media addiction. I just spent more time than average on my pc and stuff due to not wanting to spend a lot of time with my parents for obvious reasons", "Oh I am so sorry. Hang there buddy. I hope things get better. I hope you are being better treated where you are than you were at home.", "NTA. Jehovah Witnesses go to the extreme. \n\nMy moms side is JW, and my aunt had multiple exorcisms growing up, some probably performed by her own father (my grandpa) who was considered an elder. When they finally started taking her to a doctor as a 50-60 year old woman (something they only like to do in like, life-or-death situations) they diagnosed her with schizophrenia. It’s completely unmanaged and she has daily issues in life, to the point of where she fell and almost lost her leg due to the damage she caused herself, and often ends in in random neighboring states because she just drives off and nobody checks on her. Her daughter is not mentally equipped to handle her and often makes things worse.  \n\nMy grandfather was really sick, never went to the doctor until he was dying. He had terminal Leukemia and died within a few days of being admitted. \n\nShe was only allowed to interact with other JW. Almost all of the JW were homeschooled, which is why you never really meet any in school. JW work for JW businesses, mostly revolving around the church or the trades like construction or electricians. This is why they’re people you hear about but never really see unless they’re on your doorstep. They have somehow created these artificial bubbles within society that only a certain few are able to pop in and out of at will. \n\nThey even deal with “criminal” matters internally. There’s elders that will punish or separate offenders and victims. Marriage matters included, I will say they don’t have tolerance for adultery or domestic violence, because it gives them a bad name. But child abuse and molestation is fair game, so idk how many points that gives them. \n\nThe only reason my mother was not “shunned” was because she didn’t get baptized. We have lots of family members that the JW side is not technically allowed to talk to at all, because they chose to be baptized as children and left the cult as an adult. I know a few that break that rule, but if the congregation found out, they would also be shunned. \n\nIt’s a disgusting religion and I’m sure OP has seen some of the same. My mother has some severe PTSD because she was the “black sheep” like OP, got pregnant at 17 because she didn’t know what sex did. She was treated like garbage by basically everyone but my grandpa, who had a soft spot for his baby girl. OP doesn’t even have that. I really hope he gets out of the house, but also not into the waiting arms of some PEDO. \n\nIf OP reads this, I highly suggest you not trust your “father figure”. You were raised in a very controlled environment whether you want to think so or not, you have not been exposed to the depravity humanity can harbor. \n\nStatistics of people who end up in abusive relationships after leaving cult-like religions are INSANE. Lots end up in drug addiction or rehab. My mother included. The FIRST thing you need to do, is get a therapist that specializes in religious trauma. NUMERO UNO. That will help set you up for success in your adult life when you escape the bubble you’ve been raised in.\n\nEdit: typos", "NTA, but I’m going to be straight up with you. There are people that pretend to care about you and your feelings. They believe that because they took the time to listen to you rant and formulate responses, that they’re entitled to sex. In fact, he targeted you because you’re a young vulnerable teen. \n\n\nYou’re using him as a free therapist. He’s using you as a source of entertainment at best. At worst, he wants to commit a statutory rape offense. If he knows what you look like and has your pics saved, assume he’s using them for the worst purposes (to pretend to be you and catfish other teens, etc).  \n\n\nA person in their mid 20s has no interest in high schoolers. \n\n\nYou will not replace your father or mother. You may seek beneficial and satisfactory relationships in the future, but they will never ever be your parents. The only exception is if you get taken away and get adopted by a gracious family. Or one of your parents remarries. Those would be the only times it’s appropriate. Any man/woman wanting to be a “father figure” has bad intentions. Stop seeking a mom or dad on the internet.", "Please for the love of god end your relationship with your internet friend. He is grooming you into a textbook D/s relationship. This is terrifying. I understand your parents are not doing a good job but I promise you that your internet friend is far far more dangerous.", "OP, please please please reach out to a teacher or your doctor.  Your mother and stepfather are the assholes, but you're naive, young, questioning and in a bad way, and your friend is almost definitely targeting and grooming you.     \n\n\nYou're a textbook target for a predator, and a normal, healthy adult does not strike up an online friendship with a child to whom he has no connection or relationship.    Normal adults will be VERY cautious in this kind of scenario, and normal adults would refer you to a local supportive organization, not push for deeper friendship.    \n\n\nThis man is almost definitely a predator.", "How old are you and when can you move out? Also NTA.", "NTA. You live with religious fanatics, so...good luck with that. At least you're setting boundaries.", "NTA but like others I'm concerned about this 'fatherly figure' (and also concerned that your parents haven't really picked up that point yet) since its ripe for abuse. Is there someone in your life you could reach out to like a teacher or guidance counsellor?", "Ahh of course, the grooming of LGBTQ websites, funny how it took doing all that to start questioning yourself", "I think a lot will depend on how they met and if he was aware of OP's age before initiating the friendship.\n\nWhen I was in my mid-20s, I became friends with a 16 year old who was questioning her sexuality and gender and all that.  We had met on a message board for a Japanese band. When I found out her age, I became fiercely protective of her.  I made sure to point her towards good, reliable resources for LGBTQ youth and told her if she ever needed something, to call me.  She nicknamed me \"mom\" at the time lol.  We're still friends to this day and it's been well over 10 years now.\n\nI hope this applies to OP's friendship as well, but please, please be on your guard just in case.", "Yeah, look. I'm not going to say kids shouldn't be alert for red flags and that they shouldn't guard their privacy. Kids do need to be educated on staying safe online, and a lot of kids don't get that education. But kids are allowed to have adult friends. Adults are allowed to be friends with kids. An adult interacting with a kid online is not automatically a predator. Driving kids away from trusted adults is not going to keep them safe.\n\nAlso OP, NTA. You're right to be frustrated with your situation. It is entirely wrong that you've been made into a scapegoat for your family.  But the most important thing is to keep yourself safe, okay? Look after yourself. I hope your folks see sense and start giving you the benefit of the doubt, but if not, you can find freedom and safety once you reach adulthood.", "Been there. OP Please listen to this internet stranger. Your parents are abusive but this person isn't your friend either.", "Literally. I try to help the people younger than me on the internet but I would never befriend them. Red flags all around.", "This last paragraph is so important - building yourself a support network outside of the religion and making sure you have everything lined up makes all the difference in your ability to successfully move on in your life. I spent a lot of time pretending I still believed while I prepared to move out (mom is a jw, dad isn't) because I knew that if I wasn't prepared for it when she tried to guilt me about leaving, I wouldn't have been able to even with my dad's support. Save up, make sure you have all your paperwork in order, and make friends outside of \"the truth\" who will be there for you when the time comes.", "Can confirm. I'm 26 and, nothing against you, but the thought of talking to a 15 or 16 y.o. sounds unpleasant to most of us. Either because it gives off creepy energy, it's inappropriate af, or because you're a teenager and teenagers are... intense lol. Normal people in their mid twenties don't do that.", "Just to clear this up, he didn’t ask me if I wanted to be friends or if I needed a father figure or anything. I met him by coincidence cus I colored a sketch he drew, he saw it and mentioned it was actually his and I reached out and started a conversation", "OH SHIT I FINALLY REALIZED MY MISTAKE\n\nOkay so my friend didn’t know my story until long after we met and he also advised me to talk to someone about it and look for therapy, I did apply for a therapy spot but I’ve been on the waiting list for months (i cancelled it recently because i never heard anything back from the therapist) and he’s been trying to keep me mentally stable during that time while i was waiting for the spot which really helped me", "i’m 17 now but in a response to someone else i said that i already technically moved out because they forcibly shoved me into a residential group", "what?", "I used to be on forums (mainly lotr) all the time as a teenager but my age was clear and it was a huge mix. And it was geeking out really, not getting into messy vulnerable situations like this - as you say there were boundaries which it feels like there's not here.\n\nBasically agreeing but adding on :)", "Your experience is extremely different than OPs and it’s naive at best to compare the two. \n\nPlaying a game and becoming friendly with other players over time as a group is still risky, but much less so.  \n\nCompare that to a troubled kid, confiding in a stranger who is assuming an authoritarian role in their life.  OPs situation is exactly what predators look for.", "\"Actively against it\" sounds like you two have discussed it, which makes this feel more disconcerting.\n\nIf he's a father figure, the fact that you're a minor shouldn't be even a small consideration, because that implies that the boundaries change when you turn 18.\n\nYour parents sound like shit bags. There is a predatory population that will use that info to gain your trust and confidence.", "Adults who want to engage in youth mentoring with no illicit motives join legitimate programs like Big Brother Big Sister, or they go into education, or youth services, etc.    Yes, those fields attract predators as well, but the percentage is far more in favor of good people.    \n\n\nAdults who actively pursue relationships with young, unrelated teens via the internet, outside of the regulation of a safeguarding organization, are more likely preying than not.       \n\n\nOP sounds sweet but very naive and in a bad way with their family.     That's exactly the kind of target a predator pursues.    \n\n\n  \nOP, you are NTA, but you are almost definitely being groomed.", "Yeah. It could go either way. Maybe it's worrying grooming behavior, but it could also just be an older person looking out for/trying to be a mentor to a younger person they're concerned about. That's not unusual, especially amongst LGBTQ+ people who understand that many members of the community don't get support at home.", "The sad thing about all of this is that probably it isn't even about power and control. OP's mother literally believes being strict is the only way to save her child from burning forever after Armageddon, which by the way is due uuuuuh soon-ish according to JHW.\n\nDoesn't justify anything and OP was absolutely in their right to give their mother and stepfather the middle finger... Fuck this cult to be honest, only marginally better than Scientology", "This person is just an ignorant bigot, ignore them.", "I think my mind tripped a bit when I said this, we didn’t discuss the topic outright. I don’t know why I said that he’s actively against it, but I know he means zero harm", "oh okay", "You don't know for sure though. People can be whatever they want online. Who they are in person is different. Do not tell him where you live or where you go to school. You are very young; you sound lonely and vulnerable. He's taking advantage of that and you could end up in danger."]}