{"id": 4047, "submission_id": "zdni8g", "title": "AITA for refusing to give some girl a ride home after she called me a misogynist?", "selftext": "So to set the situation. It was my best friend and I (both 28) going to celebrate the engagement of our mutual friend from back home. The celebration was at a bar 30 minutes from where we live, so I offered to drive us. He asked if he could bring his GF and I said sure. She then asked about bringing her friend Laura (27F) and I said no problem. Car ride there was fine. So we get there. I congratulate my friend and his fiancé. We had a few drinks and it was all good vibes. Eventually it was just us four at a table. My buddy came by and said “didn’t think I’d ever see you celebrating a wedding OP”. Me, my buddy and best friend all died laughing. It’s an inside joke to us but we’ve talked about marriage a lot the three of us. We’ve had these deep talks and they both know I’m anti marriage. I won’t go too far into my reasonings as I don’t think they are important here. But I just think men gain very little and the laws are antiquated and are not set in todays society.\n\nSo I cracked back and said “don’t worry I’ll be here for the next one too”. Once again. Inside jokes with us all. We laughed. Took a pic and buddy kept entertaining. Then Laura goes “that was incredibly rude. You shouldn’t say that stuff at a party.” I said “it’s an inside joke. It’s not what you think.” Then my buddy explained that I’m anti marriage to her and his Gf. \n\nMy buddies girlfriend didn’t say anything but this girl we were with lost it. Demanding I explain why. I gave her some simple stats and other quips why. But I said simply the lesbian divorce rate is double compared to that of two men’s divorce rate. Which proved to me, that men usually settle whereas women bounce. I respect my money and peace too much. That was the exact statement that set her off. \n\nLaura then starts talking to me. Saying that I’m a weirdo and misogynistic. Me and my buddy left and went outside to defuse the situation. 20 minutes later I came back in. Sat down and we continued the night. About an hour later I went to buy a round. Laura wouldn’t respond whenever I asked if she wanted one. My buddies Gf had to answer for her. And she say she didn’t want anything from a sexist. I said perfect then it was time to leave. \n\nAs we got up I said Laura would need to find another way home. As she didn’t need anything from me a man. She for sure didn’t need a ride home. Laura said it was 30 minutes away. I said Uber was running and left. My friends GF stayed behind with her and me and him left. He said he doesn’t blame me but thinks I should apologize for the sake of his relationship. I said if she’s demanding his friends apologize when they aren’t wrong you are better off ending that type of relationship anyway. AITA?", "created_utc": 1670281962, "permalink": "/r/AmItheAsshole/comments/zdni8g/aita_for_refusing_to_give_some_girl_a_ride_home/", "score": 701, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I can see how leaving my buddies GF was the asshole move. That part I can see but I didn’t force her to stay there\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. Just say women don't like you and move on. \n\nOh also, lesbian relationships have a 14% divorce rate, gay marriages 7%. A marriage between a man and woman is 40-50% likely to end in divorce. With women usually initiating the divorce, which by your own logic means men are the issue. A happy wife doesn't just suddenly decide to want a divorce. \n\nLast thing, don't use LGBTQ as your pathetic example. We fought for our right to get married, a privilege you've had since birth. We don't want to be used in your shitty argument nor do most LGBTQ couples get divorced.", "« Which proved to me that men settle and women bounce »\n\nStudies made on spousal abandonment rates would prove this statement wrong. Women with debilitating illnesses are a lot more likely to be left by their husbands than when the genders are reversed. You’re cherry picking facts to reinforce your already biased views. \n\nAre you surprised that she would push back when you’re making sweeping and disrespectful statements about women as whole? \n\nShe shouldn’t have expected a ride and shouldn’t have wanted one from you after what you said.\n\nWhen all your inside jokes are things assholes joke about, you might be an asshole. As a person and not just in this instance. \n\nESH. But it’s mostly you.\n\nEdit: i used the example above to show that OP’s statement about women « bouncing » is incorrect. I’m not trying to imply that men are more likely to « bounce » than women by bringing that up.", ">Which proved to me, that men usually settle whereas women bounce. \n\nGreat job proving your point by immediately bouncing when things didn't go your way. YTA.", "YTA\n\n> they both know I’m anti marriage\n\n> It’s an inside joke to us \n\n> men gain very little\n\n> “don’t worry I’ll be here for the next one too”\n\n> Inside jokes with us all\n\nYou **keep saying** \"it's an *inside joke!*\" but **all I hear** is \"my friends are *used to me being an AH*.\"", "YTA\n\n\"I'll be here for the next one\" - don't say that at an engagement party, it's a dick move. It's not even an \"inside joke.\" It's a joke everyone understands - it's just not funny. \n\n\"men settle and women bounce\" - Yeah, it is a sexist comment because it's made without any context as to why women are \"more likely to bounce.\" Because it's a lot more common for the husband to end up being abusive or a cheater than it is for a woman to end up being one. And no woman should have to put up with that.", "Your understanding of statistics causes me immense physical pain. Please, for the love of all that is holy, enroll in a community college and take some statistics classes.  \n\n(Source: Am a mechanical engineer. If I would design cars with your understanding of statistics, you couldn't take them home from the dealer because their shafts would already be broken.)\n\nAlso, ESH. She shouldn't expect a ride from you since she doesn't really know you and went hard after you. You told distatefull and rude jokes that make you an AH.", "YTA and definitely a misogynist. You being anti-marriage is like me being anti-drafted by the NBA. It was never going to happen for either of us.\n\nMen are not victims in society. The people who think so are not suffering because of their gender but because of their personalities. \n\nYou did her a favor by not subjecting her further to your inane uninformed drivel.", "YTA ‘it’s not what you think’ - proceeds to explain that it’s exactly what she thought \n\nIt’s a party celebrating marriage, and you were there looking down your nose and ridiculing it, she’s right you were being rude and obnoxious", "Are you anti-marriage for these reasons or is it just to cover up the fact that you hate women? YTA.", "ESH and you more than her. She shouldn't have still counted on a ride after saying she didn't need anything from you, sure. And you? You *are* a weird, creepy misogynist.", "Inside jokes are fine and all, but are you truly not realizing how you sounded? You insinuated that your friend’s marriage won’t last and that you’ll be there for his next engagement.\n\nEven worse, you felt the need to throw out gay marriage statistics as if that even proves that men don’t walk out just as much. Your reasoning is preposterous, and you are well-within your right to be anti-marriage, but your reasons are skewed, and to top it all off, you even suggested that because your friend wanted you to apologize for your behavior because *you* were in the wrong, he should end his relationship.\n\nYTA.", "YTA\n\n\"I don’t think they are important here. But I just think men gain very little and the laws are antiquated and are not set in todays society.\"\n\nthey are important when your reasoning is misogynistic. \n\nWomen are more likely to be killed by their husband than any other person; more than half of all women killed are killed by their husbands/boyfriends. But yes, men really get the short end of the stick when it comes to marrige.", "YTA\n\nThe joke was inappropriate, you know it. An engagement celebration is not the time or place to go on a weird anti-marriage rant, even if someone opens the topic. Also, the stats you cite are inaccurate misleading. And you do sound like a misogynist.\n\nDenying her a ride home just clinches a whole evening of you being an AH.", "YTA the inside joke is that you desperately need therapy, lmfaooo good luck with that my guy.", "YTA. You're constantly saying misogynistic things here even when you're trying to censor yourself. Stop reading MGTOW and incel subs. You need help. You're toxic, and so much so that you can't even celebrate someone's wedding without acting insecure and obnoxious.", "I have to say, you clearly know nothing of the reasons gay men stay together longer, and lesbians have a high divorce rate. Well done for using LGBT relationships as a mirror for straight people. You're so wrong it's embarrassing. And yes, YTA.", "INFO:\n\n\\>  she say she didn’t want anything from a sexist. \n\nbut\n\n\\> As she didn’t need anything from me a man. \n\nwhy did you say she didn't need anything from a man when she said she didn't want anything from a sexist?", "ESH. OP — there is not a doubt in my mind that you’re a raging misogynist. You sound like an Andrew Tate fan and you’re not someone I would ever be friends with. You could be the last man on earth and I’d avoid you like the plague for the contents of this post alone. \n\nHowever, this girl started conflict with you. I can understand her not wanting to be your friend or interact with you much but I think raging on you and expecting a peaceful ride home was shortsighted. I’m also not sure why she cared so much about your opinion. I would’ve dismissed you and moved on. \n\nUltimately, this girl was fine taking an Uber with her friend. I think everything worked out the way it should. You probably deserved to get told off and she didn’t have to spend any more time w you than was necessary. Now you can both go your separate ways and never interact again. It’s a win win.", "Yta. She was right. You are a misogynist. All the stats you're pouting are biased to justify/prove your own view point but you don't look at women's view or stats. The fact you think men have it harder in any way as a man myself is baffling. you are what is wrong w society. I'm more surprised your friends fiance isn't giving your friend shit for putting it up w u. I feel sad for you.", "Not for nothing, you do sound a bit sexiest and ill-informed.\n\nShe didn’t have to react so strongly, but I suspect you’re a bit more assholey in person vs how you recalled here. \n\nAlso, inside jokes are for the people inside. Not in mixed company where there are those who don’t get it. That’s AH behavior on its own. Unless you explain it, and not just by saying ‘it’s an inside joke’. \n\nESH", "YTA and definitely a misogynist. The fact you think anything in society is stacked against men is fucking laughable.", "Look. You drove them, you probably should drive them back. I don’t really care about your opinions on marriage. If you weren’t gonna drive her back. You should’ve told her immediately so she could have figured out how to get home. YTA, but this could have been avoided very easily.", "Dude why are you insulted by someone calling you a misogynist when you are you literally think that women are more likely to leave their partner that’s not true and is gender stereotyping a clear sign of misogyny\nYTA", "ESH - You sound like an AH and a hundo percent misogynist. Still, I agree that she should have committed to her word of “not wanting anything from a sexist” and then still expecting a ride home.", "ESH, obviously. \nBut op gets extra ah points for driving after drinking.", "YTA but I doubt you are paying attention to anyone who disagrees with you so…", "So the 'inside joke' is exactly what everyone thought, that you're sexist. Laura pressed you on that, causing the people around you to be uncomfortable and knowing that you were her lift home. Have I summed that up right? ESH. Actually, the one I really feel sorry for is your buddy's girlfriend who just realized what kind of company she's been keeping.", "I genuinely can’t tell if these people are making up situations like this as a joke. Of course YTA. Jesus.", "YTA, you proved her right. Your opinion is actually statistically wrong and proves that you are in fact misogynistic. Don’t be mad at being told the truth, stand on what you believe in even if its BS.", "YTA what a way to put your mate in a shitty situation. Epic showing off fail too, never heard anything more cringe. ThOsE wAs InSiDe JoKeS!", "yes YTA and you sound extremely sexist too", "YTA, you know those are controversial statements that can get a rise out of a lot of people, rational or not, and more importantly put your friend in a really bad spot. I’m surprised he even went with you.\n\nEdit: why is this making so many people so angry.", "YTA.  Just because your friends are used to you being a misogynistic jerk doesn’t mean everyone has too accept it.  You are also a jerk for leaving two people  behind because you didn’t like the fact that she wasn’t ok with your “inside jokes”.", "YTA, you remind me of the awful British ex-wife on Succession who goes around at her daughter’s wedding asking all the guests “how long do you give it?” and acts innocent when the daughter says to cut it out. It’s not cheeky, it’s rude.", "yta she was a jerk, but you drove her there, and was her ride home.  abandoning her because she hurt your feelings is not ok.", "you're absolutely an incel, and YTA for not giving a ride to a woman who disagreed with you.", "YTA for calling her “some girl”. I think she’s very intuitive and reads people well.", "YTA - because you spewed some anti-marriage rhetoric without anything better than some sexist data - then tried to brush it all off as an inside joke? Basically everyone has grown up but you - when it came time to leave however you (holding the Trump card as  the way home) chose to hold it over her head because she called you out on your behavior.\n\nOk so you are anti-marriage (for now); and one day that may change. You may find that nobody wants to settle down with someone who is so.. off putting.", "YTA \n\nYou sound insufferable.", "ESH\n\nIt is your inside joke and she tried to find out. It is your viewpoint. I like how people are quick to criticise the opposite view but not educate and enlighten about why their point is correct. I don't understand how people think it is okay to insult someone and expect a free ride back home. So when it comes to monetary benefits, moral standing just vanishes.  \n\n **But, yeah I wouldn't get in the passenger seat with you because you are driving under influence. So maybe you just saved the girl.Who knows?**", "YTA just for making a joke about your best friend and his gf breaking up. Not cool whatsoever, especially when they’re about to get married. Also, no matter how you put it, if you only blame women for being the reason marriage sucks, you are a misogynist.", "ESH. Yeah, she is not entitled to a ride, but what you said IS misogynistic.", "When I bring someone to an event, I give them a ride home. YTA", "YTA \nwtf do lesbian divorce rates got to do with you if you’re a man? You sound dumb", "YTA especially as you had committed to giving everyone involved a ride both ways. You attended a bar, and presumably were out late at night. Women are particularly vulnerable with safety especially at bars and on the streets, and Ubers aren't guaranteed to arrive on time. You risked both your friend's girlfriend and this other woman's safety because the other woman didn't like the jokes you made- if something is an \"inside joke\", of course others won't get it and this should only be discussed by those involved in the \"inside joke\". I hope these two women got home safely and that you learn from this- never put people's lives at risk over a few crossed words.", "I would probably think YTA but there's probably a good argument for E S H", "ESH, her for being over sensitive regarding a person she doesn't know, you for being an AH, extrapolating on the topic at your friend's engagement party, of all places, and your friend for leaving his gf behind to find her own way home with her friend, after drinking all evening.   \nNone of you are winning people of the year award, except maybe the bf's gf, who stayed to look after her friend.", "YTA. also studies show straight men gain way more benefit from marriage than straight women.", "ESH. It was stupid of her to start a fight with her ride, and you’re a creepy incel.", "[deleted]", "ESH, she shouldn't have been rude, but the inside joke is that it's exactly what it sounds like??? She shouldn't have been rude but she wasn't wrong, and forcing someone who doesn't have another way home is an AH move. Not illegal, it's your car so you can choose who rides in it, but you're not some secret hero and advocate for men's rights, and if your buddy's girlfriend is smart she'll \"bounce\" while she can.", "NTA for your question in the title.\n\nHowever, you need to keep your “frank & honest” opinions to yourself- about your friend’s relationship with his gf (or) your opinions about gay & lesbian divorces or whatever!", "YTA\n\nLaura is absolutely right, you are very sexist, good thing is that your beliefs about marriage will keep you away from women which that's a win for us, keep your money and peace all to yourself and far away please.\n\nIt is however foolish to insult someone, no matter how rightly, and then expect a favor from them.", "YTA for being a misogynist. However she shouldn’t have been so rude to her ride, I would have dropped the subject then told my friend her boyfriend is friends with AH’s and to be weary because if a guy is friends with AH’s, he’s likely an AH", "Lol, your friend didn't even stick around to wait with his gf, not sure why he's giving you grief.", "\"Oh no, you misunderstand! I wasn't making a casually sexist remark,, I was referencing my deep seated misogyny! Totes different!\". YTA.", "NTA lol", "I wish people would actually focus on what we are supposed to be judging here. NTA for not giving her a ride home.", "Nta you cannot be condescending and rude to your driver and expect not to be affected by the consequences of your actions. It was easy to foresee. He is owed an apology before she is, imho.", "NTA.", "YTA, and she’s right.", "YTA. I feel like you’re the type of person to use ‘facts don’t care about your feelings’ as your life motto, then complain about women not liking you and/or complain about why people are so hostile to you.", "ESH\n\nLaura was out of line, but ultimately, you suck for abandoning them. I have a rule that if I am someone's ride, that I always make sure they get home. Yes, there have been times there has been arguments and I was pissed off, but I personally think it's super shitty to leave someone without a ride.", "Nta, you don't owe anyone a ride.\n\nPeople gain very little in marriage, not men. Its just a piece of paper really, and it's difficult to get out of. \n\nPersonally I lost a $35k truck and dog in my divorce, I'm a woman. The lesbian and gay divorce rates have zero to do with \"settling\" and \"bouncing\". People are people, sometimes it works and sometimes it doesn't.", "YTAx2 \n\nAt the end of day, you don’t leave someone stranded because you don’t like what they said. Your friend is a bigger A for ditching his gf and wanting you to apologize for it to make his dumb decision better for him", "Nta for the situation but also not a good person sooo", "NTA. In truth, you sound pretentious but in this situation, this girl had no right to put you in your place. If your buddy had a problem with what you were saying, I highly doubt he would have been the one to start the joking. It’s his party and if he’s not offended then that’s all that matters. She’s welcome to walk away if she’s uncomfortable. The world is full of people with differing opinions and it’s important to know when you should get on your soapbox. This is not one of those times, especially considering she was expecting you to drive her home after insulting you. What she did was plain obnoxious and I’m surprised at all the people claiming you’re the AH here.", "ESH- Are you a bonehead? Sure. Was she a bonehead to the guy driving? Sure.", "While your views might come off as assholish you're NTA for not giving her a ride. If someone openly insults me whether he is objectively right or not I am not gonna do him any favours", "NTA. This judgement is about the title after all. You can be anti-marriage for whatever reasons you want, no skin off my back. I am unsure why she demanded you to explain, especially if she is the overly sensitive type. Your friends clearly already know you're anti-marriage and why, but since they still invite you to these kinds of parties clearly they think it is a non-issue so her point about how you shouldn't say it during the engagement party, especially when you only did so because SHE asked, is plain lunacy to me. And of course, as mentioned by others, if she doesn't \"need anything from a sexist\" she must not have needed a ride either. Don't say things you don't mean, right?", "NTA in any sense honestly. I do find it hilarious that those who say you are the asshole aren’t even answering the question you’re asking if you’re an asshole about.\n\nThe question was is he the asshole for refusing to give a girl a ride home after she called him a name, not am I the asshole for an inside joke and my personal beliefs about marriage 🙄", "Yta. You undertook to be her ride. You don't bail on that. If she wants to bail, she can. \n\nShe sounds insufferable, but it isn't about her. A man keeps his word.", "NTA \nYour views are yours alone, not gonna try to debate them like others and really this all falls are her, once she heard it was an inside joke she should've left it at that, instead she kept digging, didn't like the answer, and huffed all night when you were trying to make amends, the fact that she expected a ride after calling you names is astounding", "NTA for the specific question being asked.\n\nThis Laura person; it sounds like she really had a gripe about your anti-marraige ideas. She could have dropped it at any time. Okay sure, she might not have liked what you said, but part of being an adult is knowing when to fight your battles. This whole thing could have been avoided with a simple \"well, look I don't agree with you, but you do you\". \n\nInstead she chose to call you names, and I guess try to invalidate you by acting a bit like a child that didn't get their own way.\n\nIn general, OP sounds a bit AH to be dumping his ideas and beliefs on some random person they've just met. Equally you could have just said \"marriage isn't something for me\" and left it at that. However props must be given for leaving and letting things de-escalate, and then coming back and trying to get a good mood going again by offering to buy her a drink.\n\nIf I was in a similar situation where some person who I barely knew called me names, and acted like a pouty child when they didn't like my opinion, I'd also tell them to get a cab. \n\nSo TLDR not AH for not giving her a lift home, but a little AH for dumping your opinions on her, when you don't even know her, likewise she is AH for calling you names, and acting like a child.", "NTA. With that statement she should have looked for another ride.", "100%% YTA and hope you end up alone", "I mean... You're a mysogynist so... YTA", "NTA. The \"friend\" butted into your conversation without context, and was later rude and insulting.\n\nShe didn't want anything else from you. So why does she need a car ride back wirh you?\n\nHer own consequences", "EHS. She shouldn’t have asked if she was going to get offended. It sounds like you said something triggering. However if you take them, you should take them home. I don’t blame you as she clearly was holding on to her anger about whatever you said that trigger her.", "NTA - while what you did say was sexist and offensive; she kept asking until she got an answer which she found very offensive, but that did not give her an excuse to act like an AH, so she shouldn't expect to get a ride from you.\n\nBut apologizing for the situation that you did not mean to offend her friend but also explaining that you found the behavior of her friend incredibly offensive as well and so that is why you wouldn't take her wouldn't hurt.", "NTA, if someone told me i was sexist and misogynistic and didnt need anyrhing from me, id treat her as such, its not like she was paying you gas money lol", "NTA she didn’t want anything from you! Last time I checked a ride home would be included in anything! Also leaving a charged environment is not bouncing! Why did she get so riled up about your position it did nor affect her, would not change her life in anyway and clearly upset her more than changing you! What a waste of energy.", "NTA. She first asked you to explain. You did. She threw a toddler tantrum. You tried to de-escalate, even offered her a drink and she gave you the silent treatment. Toddler tantrum. Women like that give the rest of us a bad name.", "ESH", "NTA for the situation, it wasn't very nice but you're not obligated to give anyone a ride. But heads up, saying things like \"Men gain very little\" when talking about marriage is misogynistic. Not the AH here but definitely an AH in real life.", "NTA\n\nNumber one rule when you are riding with someone....DON'T OFFEND/ATTACK THEM.  Kind of basic there.\n\nNo matter what a person's beliefs are, if they are misogynist, a feminist, etc., fine.  \n\nA person has the right to disagree, and call a person out for being offensive to their beliefs.\n\nA person CANNOT expect a person that they attack for their beliefs to do them a favor.", "NTA. You don't owe her ride if she keeps insulting you and won't drop it after you've attempted to move on and buy her a peace offering. Expressing an opinion on the subject of marriage after it is demanded of you is very different than deliberately insulting someone directly and then continuing to do so as the night progresses.", "NTA, you're entitled to your opinion on marriage and you didn't attack women in general or express any beliefs that you're superior as a male. \n\nHell, even though you're against marriage yourself, you're still there in support of your friend and wouldn't have even brought your stance up because it's not relevant to your friend.\n\nYou clearly dislike marriage, not women themselves.\n\nNot sure what planet she's living on, attacking you and expecting a lift.", "If someone insulted me the whole night, I wouldn’t give them a ride either. NTA", "Don't understand the everyone sucks. You're absolutely NTA for not giving her a ride after she offended you. People disagree with each other and get along. She took it personal and for that she's an asshole. You didn't even bring your views up before she started getting offended. She called you out based on a strawman she constructed and then kept pressing the issue. You had nothing to do with that. I don't see how you could have de used the situation in any way. Lots of people here getting triggered by your views as well which is ridiculous when it wasn't you who started sharing these views.\n\nAnd to the people talking about her safety or whatever. Well that's her problem. Maybe she should not be rude to the person driving her back? Also I can't believe you were still offering to buy her rounds after she was rude to you. For that you're an asshole to yourself.", "NTA.\n\nAs a woman I do not agree with your stance on marriage, but I am not here to judge that opinion. I am here to judge if what you did was AH, and if you did it in response to her disagreement with you, then yes you would have been an AH. But you did it in response of her treatment to you after she disagreed with you. \n\nAdults are allowed to disagree and have different opinion. Her straight up ignoring you, set the basis of your the reaction you would have. So NTA.", "NTA. You are entitled to how you feel about marriage. While I don’t agree your joke was in good taste, it seems extremely silly for her to take it so personally. And if she doesn’t want anything from you, it should certainly include the ride home. She can figure it out, she’s an adult.", "YTA, but not for leaving her. She deserved that... YTA for drinking and driving.", "YTA. \n\n>don’t worry I’ll be here for the next one too\n\nDude, you're at an engagement party, that is so inappropriate. Your \"reasons\" for not wanting to get married are misogynistic. And your comment about gay and lesbian relationships was very anti-LGBTQ and just wrong. \n\nYou're also a major AH bc you waited until the end of the night, when you were leaving to tell the girl she didn't have a ride. If you agree to be the driver, that means both ways. Your friends girlfriend stayed too, and your friend wants you to apologize. He chose you over her. So you were an AH and just drove a wedge in their relationship. \n\nIt sounds like your friends put up with you and your antics. But no girl will. Your friends may tire of it eventually, especially as they get married.", "NTA---you dont get to pressure somebody into answering something, get angry at the answer and insult the person...then want something for them. Also without knowing the statistics you gave and how true or not true they are i cant comment on those", "NTA - So sick of people getting offended for something you have decided on as a lifestyle choice.\n\nYour life, your decision. Regardless of whether or not I agree with you, it really doesn't matter. You weren't trying to change anyone's minds about the matter. You were asked why, and provided an answer as instructed.\n\nYou were out celebrating something you don't believe in, so you clearly don't slight anyone that doesn't agree with you.\n\nFriend's GF's friend can literally go pound sand in this case.", "NTA IDC what either of you two believe but your friends made a joke and she got mad and wanted you to elaborate then didn’t like the answer. She was being petty by the whole silent treatment and saying she doesn’t need anything from a sexist. So if you don’t need anything then you don’t need a ride from me either 🤷🏻‍♀️ \n\nComing from me a woman", "NTA", "NTA whatever your reasons for not wanting be married people should respect it! But her being rude ,insulting you then expecting you will be her ride back home make her the idiot of the night!", "NTA", "NTA - it should’ve been left at “it’s an inside joke” and she really shouldn’t have so childish.\n\nYeah, your reasoning is wild and I doubt it takes into account nuance but whatever, if someone is giving you the silent treatment you don’t owe them a ride home imo (unless of course it’s unsafe to leave them there)", "We are supposed to judge OP on what happened not what what his beliefs are. NTA based off of what you've told us you don't owe anyone a ride", "ESH \n\nI feel your reasons are valid.. but I also feel you’ve been hurt or have seen too many others get hurt.. \n\nHaving said that, I feel the whole conversation was inappropriate for a engagement party, but the girlfriend wouldn’t let it go, she was offended and STAYED offended at you no matter how many times you and her boyfriend tried to explain. There’s no winning here. \n\nThe fact you left her there, even though she ignored you is not cool. You could have been the better person here even though she upset you. You both should apologize .. if for nothing else.. for being inappropriate and not focusing on why you were both there.. to celebrate an engagement and it got sidetracked by a bunch of accusations and a conversation that should have taken place at another time… her boyfriend should have asked both of you to drop it. \n\nWhatever your reasons are for not wanting to marry besides the ones you stated, I wish you well. Edited", "NTA. She horned in on something that seems to be a fairly regular subject of conversation amongst you and your friends, in which you share many inside jokes. And then you you told her about said jokes. She's the one that insisted on making it personal, and getting the case of the red ass. You're absolutely right in both what you said, and what you did. Never apologize for being right. As for your buddy, maybe you can lend him some of your spine. Because of he continues that relationship, he's going to need it.", "ESH…. That sounds like an expensive Uber. Not knowing anyones situation, offering to drive comes with an understanding of driving back too. Unless it was particularly out of your way, I think you still owed her the courtesy", "NTA she said she didn't need anything so", "regardless of your views, the issue boils down to you being entitled to drive anyone you want in your car. NTA", "NTA. Your life, your choice about marriage.", ">I respect my money and peace too much. That was the exact statement that set her off.\n\nWell, I think your stats are cherry-picked and success and failure don't necessarily equate with divorce rates (plenty of people who settle do so in misery!) but your point stands. Marriage isn't for everyone. And it is true that not everyone benefits equally from marriage. But most don't seem to realize that any relationship is created by the individuals in it, for better and for worse. So your comments speak volumes about -- you -- and your lack of faith in your ability to choose healthy partners, and the lack of agency you feel in relationships. Even so, there's a lot of richness  to unpack in your ideology! You sound fascinating!\n\n Anyway, it was an inside joke and you and your buddies have hammered this out over time and will likely continue doing so. It's silly to get offended at the thoughts that go through others brains especially after they're solicited. Laura could have let the joke slide, but she asked for more info, as though she's never heard of a person eschewing marriage before. Plenty of women do as well, with logic opposite yours. In this instance, have to say that Laura dug her own grave. Don't make statements like \"I don't want anything from a sexist\" when that person is your ride. Things got blown way out of proportion. You all could benefit from not taking yourselves so seriously. NTA", "YTA - The inside joke is that women aren’t property anymore so what’s the point in marriage. You are sexist and an AH.", "The argument is irrelevant.\n\nShe specifically said she *doesn’t need anything from you*.  She cancelled the ride home herself.\n\nIf she hadn’t said specifically those words, and had just been insulting then you would have been TA.\n\nNTA", "NTA, you made a joke your friends got it, you stopped them she kept insisting you told her, it’s not misogynistic or sexist to be anti marriage.", "NTA at all, you reap what you sow.", "Nta, people really do need to consider their words more carefully when they are angry. Whether or not she agrees with your views or not, insulting your ride while you still need a lift somewhere is a downright act of stupidity. You attempted to diffuse the situation and move past it and she didn't.  I'd have done the same thing and certainly wouldn't be apologizing.", "NTA!", "I'm a dude.  Been through a six figure (legal bill) divorce.\n\nYTA.\n\nHas nothing to do with your beliefs, facts, stats or anything else.  You were making off-color remarks at an engagement party.  Doesn't matter they were \"inside jokes.\"  Doesn't even matter if you \"were right.\"  It's totally possible to be \"right\" and still be an asshole.  **You need to learn any joke you have to explain sucks, isn't funny, and makes you an asshole.**\n\nBut finally, there's the implied (honorable) obligation you took on in driving people 30 min to an event.  You're obligated as a decent person to be the driver of those people back.\n\nI get that you've \"got the facts on your side\" and \"just want to be honest\" but those positions don't insulate you from being an asshole at that particular event.", "NTA, people are judging on the fact they don't like you're anti marriage not the question your asking. She said she didn't need anything from you until she needed something from you. You took her at her word", "ESH, everyone else laughed at the jokes. The only one that seemed to take offense was Laura. That being said, it does seem a bit aggressive to be her ride there and leave her stranded over her being overly sensitive. I would have prob poked one more time with a \"ya sure you want a ride from a sexist??\" Before getting in the car to give her the opportunity to bow herself out tho 😂", "Not the a****** op and I'm definitely with you about that anti marriage stance as it does not favor men. People can disagree with each other that is totally fine and normal, but when she lost her mind started to insult you and call you names, that's where the grind was overstepped. You were well within your right to tell her to get her own ride home.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo to set the situation. It was my best friend and I (both 28) going to celebrate the engagement of our mutual friend from back home. The celebration was at a bar 30 minutes from where we live, so I offered to drive us. He asked if he could bring his GF and I said sure. She then asked about bringing her friend Laura (27F) and I said no problem. Car ride there was fine. So we get there. I congratulate my friend and his fiancé. We had a few drinks and it was all good vibes. Eventually it was just us four at a table. My buddy came by and said “didn’t think I’d ever see you celebrating a wedding OP”. Me, my buddy and best friend all died laughing. It’s an inside joke to us but we’ve talked about marriage a lot the three of us. We’ve had these deep talks and they both know I’m anti marriage. I won’t go too far into my reasonings as I don’t think they are important here. But I just think men gain very little and the laws are antiquated and are not set in todays society.\n\nSo I cracked back and said “don’t worry I’ll be here for the next one too”. Once again. Inside jokes with us all. We laughed. Took a pic and buddy kept entertaining. Then Laura goes “that was incredibly rude. You shouldn’t say that stuff at a party.” I said “it’s an inside joke. It’s not what you think.” Then my buddy explained that I’m anti marriage to her and his Gf. \n\nMy buddies girlfriend didn’t say anything but this girl we were with lost it. Demanding I explain why. I gave her some simple stats and other quips why. But I said simply the lesbian divorce rate is double compared to that of two men’s divorce rate. Which proved to me, that men usually settle whereas women bounce. I respect my money and peace too much. That was the exact statement that set her off. \n\nLaura then starts talking to me. Saying that I’m a weirdo and misogynistic. Me and my buddy left and went outside to defuse the situation. 20 minutes later I came back in. Sat down and we continued the night. About an hour later I went to buy a round. Laura wouldn’t respond whenever I asked if she wanted one. My buddies Gf had to answer for her. And she say she didn’t want anything from a sexist. I said perfect then it was time to leave. \n\nAs we got up I said Laura would need to find another way home. As she didn’t need anything from me a man. She for sure didn’t need a ride home. Laura said it was 30 minutes away. I said Uber was running and left. My friends GF stayed behind with her and me and him left. He said he doesn’t blame me but thinks I should apologize for the sake of his relationship. I said if she’s demanding his friends apologize when they aren’t wrong you are better off ending that type of relationship anyway. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA for making that comment but you weren’t TA for not driving her home. It’s just rude to whoever invited you to make that comment.", "ESH. You all sound like a joy to hang out with. Your buddy gets extra credit for ditching his GF for you and then asking you to smooth things over for him.", "YTA", "You sound like an asshole in general but in this case I would say NTA and I’m a woman. That being, said to prove you aren’t an ass in general, you knew you were going to do this when she said she didn’t need a drink…you could have said then and there then you don’t need a ride home.", "He know's about the Tom Leykis radio show !", "OP I you’re fucking your homies bc women deserve better than you. Also your friend’s an asshole too for leaving his girlfriend at the bar", "Honestly YTA for waiting until it is time to go to tell her you will not take her back. Also you ARE a misogynistic weirdo sorry. Glad you will not get married though, that's definitely a good thing.", "YTA. You must be fun at parties…\n\nYou might be an AH and hold bigoted views based on invalid statistics, but then it’s your life, you can do that. Your buddy is a massive AH though for leaving his GF behind. The GF stayed with her friend, so clearly things weren’t quite as clear cut as you’re making out. Then your buddy has the audacity to skip out with you and then ask you to smooth it over with his GF. \n\nI hope she hightails it out of there- she deserves much better!", "This post does make you sound misogynistic you realize that right", "YTA", "NTA. I don’t know how these people are coming up with the psychoanalysis of you and jokes your friends have had for years…but don’t be rude as fuck and name call to the people who drove you somewhere. That’s just like a baseline.", "YTA- you went to an engagement party and made a joke about how the relationship wont last. *Then* rather than a quiet apology or acknowledgment it was in bad taste, you doubled down and were a jerk. \n\nYou absolutely were in the wrong. Idc if its an inside joke. Truely. I could give you the benefit of the doubt that that joke was genuinely in good fun and harmless to all parties involved... you dont say inside jokes around people *not in on the joke* if it can easily be interpreted to be as shitty as yours was.", "YTA. And also a misogynist. An AH misogynist, which is sadly not at all unusual.\n\nWhen your friend shared with the table that you were anti-marriage, all you had to say was “it’s not for me”, end of story. \n\nInstead you shared sweeping generalizations about genders and behaviors to a stranger, all of which were critical and judgement only about women.    So yeah.  That’s an AH and misogynist move.  Clearly.\n\nThen you stranded a person 30 minutes from home on zero notice, at a bar apparently late at night, after drinking.   Were they safe?  Did they have the means to get home, or if not, to get somewhere safe for the night?   You had no idea and did not care.   Regardless of that person’s gender THAT IS A MAJOR AH MOVE.   \n\nYou have serious issues.   Seek therapy.  \n\nGross.", "NTA. She pushed for you to explain, she didn’t like the answer. It’s not misogynistic to be anti-marriage because you feel like your taken advantage of. It just not. She was super rude.", "I don't understand it when human beings decide to exact 'revenge' on others, real or perceived.\n\nYou disagree on marriage. That's totally okay.\nYou think men gain very little from it. Subjective but still okay.\n\nSo, because you didn't agree on that, you couldn't put up with her for a 30 minute ride? Are you a child?\n\nWere you scared you would marry her before you got home?\n\nYes. Major League AH, you and your 'marriage statistics.\n\nBy the way, you don't have friends.\n\nYou have enablers.", "lesbian divorce rates are higher because we don't stay in unhappy relationships nearly as much as heterosexual couples. if you're really that scared of a woman stealing your money just get a damn prenup don't start being a sexist and talk down to everyone who gets married. not everyone getting married will be as bitter as you.\n\nYTA incredibly so", "YTA, but I'm sure the other members of your Incels Anonymous chapter were most impressed...", "NTA\n\nSounds to me that you were just justifying why you don't agree with marriage, not that you were trying to stop anyone else from getting married. \n\nAlso sounds like she is the kind of woman to scream \"Sexism\" when men simply don't agree with her. Considering that women put a great deal of weight on being married it isn't surprising that the topic would upset her, but that doesn't mean that you were sexist.\n\nI would not have given her a ride home either. But not from a desire to be petty, rather from a desire that I would be concerned she would find some way to cause me trouble.", "Meh. I think you’re a jerk, but NTA for opting not to drive her home. I’d have left her there too for Uber to deal with.", "So I’m just going to say opinions are like AH’s everyone has one. ESH. The OP for not just letting it drop and the friend for getting mad when she kept pushing the issue. Honestly who cares unless you were thinking of trying to get to know the OP better. You don’t have to agree or disagree with their views. But the girl shouldn’t have expected a ride after that lol", "YTA.\nYou ARE a misogynist. Don’t complain when people call you out.", "NTA - you may be an AH but in this situation you had no obligation to get someone who was being rude to you a lift home.", "I just think Laura must be thankful you don't know her address. Ehh what a weird situation, because you are clearly an AH in general, but for the specific question you are asking, I would say NTA. You did her a favour. Yes, the uber was expensive but at least she didn't have to keep interacting with you. Money well spent if you ask me. \n\nAlso, you should consider therapy, for the sake of everyone that has to interact with you. Narcissism is not a cute look, son.", "ESH. You agreed to give her a ride and bailed in the finalllll hour making her scramble. Your friend is an idiot for leaving with you when his girlfriend stayed. You’re not the reason his girlfriend is mad at him, I can almost guarantee that. And, you’re the type of person I would only have a “discussion” with on Reddit or something similar for a very short time. You have illogical and biased and beliefs, but they aren’t hurting anyone but you and weren’t hurting the friend. Since she got a ride with you and no amount of reason is going to change your stance, she should have accepted the free drinks, gotten home safely and then texted her girlfriend about what a sexist jumbo jerk her boyfriend’s friend was. So, she’s the asshole for not picking her battles. I’m assuming the liquor had a great deal to do with everyone’s decisions that night. \n\nYes you’re a sexist, but honestly, who cares, your opinion is completely irrelevant to the grand scheme of life. Think what you want and thank you for your service in refusing marriage. May I interest you in swearing off women completely?", "NTA she pushed to hear your explanation then she gave you the silent treatment. Anyway, it’s your car and you have a right to invite people you’re comfortable with in it. She’s not entitled to a car ride from someone she’s giving the silent treatment to. Plus you mentioned there’s Uber.", "Ugh. I mean, I can understand not wanting to get married, but your reasons for being anti-marriage are actually pretty misogynistic. And joking about being at “the next one” at an engagement party is just tacky. So is leaving someone behind at the bar when you were her ride there. Maybe Laura shouldn’t have been so antagonist, but it wasn’t about either of you. You both caused a scene at your friend’s party. \n\nI’m going with ESH.", "ESH but bordering very closely on YTA.\n\nYou sound bitter, biased, and miserable, but that’s your problem. At least it keeps you out of the serious dating pool.\n\nThe issue of giving this girl a ride aside, joking at a wedding that the new couple will divorce is beyond rude, crass, and incredibly tasteless regardless of how you personally feel about marriage. Shocking though you might find it, not everything is about you, and not every forum is appropriate for your ignorance and hate speech.\n\nIt’s clear that you don’t care how your actions effected the women you offended and then left behind. You‘d think, however, that you would have more respect for your buddy than to screw with his relationship the way you did. One of two things is going to happen: you’re buddy is about to lose his girlfriend because he associates with people like you, or you’re about to lose a friend.\n\nI hope your misogyny and self-righteous pettiness keep you warm at night.", "ESH. Did she overcommit and this become AH? For sure. Did you need to trash a gender? Nope. You can say I just don't agree with marriage and leave it at that. Quoting stats is almost always leading to some AH behavior.", "YTA\n\nYou are a misogynist. \n\nYou came to Reddit to get a judgement on your actions. I hope you can try to hear what people have to say about you. Self reflection can fuckin suck", "ESH but I'm putting it mainly on your friend. You are clearly that one arsehole who, thankfully, knows their opinions suck. But your friend forced you to out your opinions then left his GF behind to hang with you.\n\nSounds like one of the quiet pricks who prod people knowing it will end up in drama just to get the popcorn out. Fuck I hate them more than arseholes who, normally, keep quiet in mixed company like OP.", "My eyes rolled so badly I saw 1954. \n“I won’t go too far into my reasonings” \n*proceeds to go into his inaccurate reasonings*\n\nIn this verrrrry specific instance, where she aggressively pushed you into revealing your non-evidence based narrative, and she was shocked and reacted as such - I’d say ESH because your way of handling things was pretty damn immature. \n\nHowever as a person I’d like to nominate you as TA of the highest order and encourage you to explore beyond your Echo Chamber of Assholery", "ESH.  I can't believe you need to be told that your red pill nonsense was completely out of place at an *engagement party*, but here we are.\n\nShe sucks for not just.. rolling her eyes and walking away from you, and we then for expecting a ride home.", "Nta, it's okay to have a difference of opinion, it makes life interesting sometimes so long as it's in good humour like your friends. \n\nYTA - for leaving her there. That was rude because if you'd discussed you driving them home, you had an obligation to take her as well.\n\nNTA for trying to be civil and her refusing to speak with you over a drink. If I don't like someone or their opinion I'll still be polite.", "YTA\n\nIt is the higher earner who gets screwed in divorce, not men. Being a woman didn’t protect Kelly Clarkson’s assets, even with a prenup. Oprah, with her net worth, is right to never marry. \n\nI’m also anti-legal marriage (spiritual marriage + cohabitation agreement all the way) because I believe the household is better off with aligned incentives, not each person thinking they don’t have to bear the consequences of their actions, but your reasons suck and are indeed misogynistic.", "YTA yea I guess men stopped getting benefits from marriage since women are widely no longer considered property. And how dare a woman have the audacity to question your opinions and cherry picking, right? Laura’s comment was a bitter pill of truth you had a hard time swallowing. You wanted her to put up with your nonsense like your friend’s partner (who is either just as uncomfortable but you wouldn’t care or has a severe case of “I’m not like other girls lol”) I wouldn’t be surprised if your “inside jokes” or “deep talks” don’t stop with misogyny. Your buddy doesn’t sound like a winner of a partner so I can see why your friendship has lasted this long.", "ESH you do sound like a misogynist. You’re butt hurt because someone pointed out what you are? She should not expect a ride when she made it clear she doesn’t want anything from a sexist.", "NTA. Jokes are jokes. She’s too sensitive and clearing had an issue with accepting differing opinions. \n\nI wouldn’t of given her a lift back either, you can’t insult someone and then expect them to still help you.\n\nYou didn’t insult her, and were not rude to her.", "You don’t have to drive anyone you don’t want to, but she wasn’t wrong you’re definitely a misogynist.", "Coming from someone who has studied relationships and marriage. There is actually significantly more bonuses for a man to be married than a woman. Like significantly so that it can increase a man’s lifetime happiness by a lot, and decrease a woman’s. For the sake of women everywhere, I hope you stay anti-marriage", "YTA\nLaura was quite right about you. \n\nHere's a piece of advice, buddy: the more time and energy you spend on munching imaginary red pills, the sooner you'll desperately need the real blue pills.", "You’re 🗑️. Idk who would want to enter a marriage with you anyway, buddy.", "YTA\n\nShe was right. She called you what your behavior implied you were. The things you said are offensive to women. Thats it. \n\nVery weird that your friend left Laura *and* his gf there? Did I read that right?", "ESH, while you don't owe her a ride, you came over kind of like an asshole.", "YTA and you ARE a misogynist", "NTA\n\nI disagree with your views and your behaviour on this post is appalling. You do generally seem like a shitty frequently wrong human but in this instance you are NTA.\n\nShe had no right to ask personal questions and you had no right to give back such ridiculous responses but you are allowed to have your own opinion.\n\nBut you both were rude but the question at hand says NTA", "“I respect my money and peace too much”?! YTA. Way to characterize literally 50% of the population as money-hungry drama queens. Christ you’re a jackass. And she’s right, a misogynist too. Have a fulfilling life with the rest of the disillusioned, lonely red pillers.", "Hey OP, I’m antimarriage, too. That being said you are acting/speaking like a misogynist and an AH. You are using one stat to give credence to your misogynistic worldview. YTA. Next just say you don’t want marriage, and it’s not for you. You don’t need to be an AH.", "Ok NTA. Because this wasn’t the place for the friend to start a heated discussion about that particular subject. It was a fun get together amongst friends who had an inside joke amongst themselves. Sorry. Time and place🤷🏻‍♀️", "NTA\n\nYou made an inside joke, the people who understand the joke laughed(probably shouldn't make divorce jokes at wedding related events). \n\nShe was offended(I kinda think you were on a double date and didn't know it) and said she doesn't need anything from a sexist man, you obliged and didn't give her a ride.\n\nI think your friend is the A H here, he left HIS girlfriend at a bar without knowing how she would get home.", "YTA", "So you left a woman stranded to prove you’re not a misogynist? YTA.", "Nta at all", "Are you a misogynist? yes, yes you are. And your \"jokes\" were kinda tasteless. \n\nBut to answer the actual question, NAH. I also wouldn't be giving rides to someone who butted into my conversation just to insult me. Though she had a legit concern about you.", "YTA.  An immature, juvenile, incel one at that", "YTA...you say misogynistic shit all night and get mad when you're called one. Idk who raised you, but you left 2 women to find rides 30 minutes away from home, because you got your little feelings hurt. I bet you love Andrew Tate huh?", "I guarantee OP is obscuring details to make himself not look as bad but he still managed to let his misogyny slip through. YTA", "I’m going to go against the grain here and say NTA. While I do think you’re cherry picking stats, you’re still entitled that opinion and certainly not obligated to get married. Your friends brought up the topic. It’s not like you showed up preaching about what a mistake the engaged couple was making. Laura engaged in the conversation by asking questions, and didn’t like your answers. That’s her opinion, and she’s entitled to it as well. But to then expect you to give her a ride after deciding she no longer wanted to speak or affiliate with you is absurd. Not because she’s a woman, but because that goes hand in hand with not being affiliated with you.", "Info: are you in a Frat? And are these your old frat bro’s?", "I can’t believe the other dude left his girlfriend there! ESH.", "NTA. You choose who you want to give a ride too.  She made it known why she had an issue with you. Then she proceeded to continue to drag the conversation after it ended by saying she didn't need anything.  Yet, she didn't want to catch an Uber.  No ma'am. Catch your Uber and haveva good day.", "NTA. I'm not getting into your opinions on marriage or any of that, because it's not really the point here. \nShe accused you of being sexist and said that she didn't need anything from you. Cool. She got exactly what she asked for, but not in the way she wanted. As for your friend,  he left his girlfriend there, then somehow thinks an apology from you is gonna smooth things over?", "I was going to vote E S H because she shouldn’t expect favors from misogynists. Yta because you are indeed a misogynist and being a rude AH to women in the comments. Don’t call people pumpkin.", "YTA. On a side note, I pity you for being too cowardly to face her after she called you out on your infantile behavior. I hope your hurt feelings heal in time.", "YTA and a….. I…..n…..c……e…….l 😱", "Hilarious YTA.\n\nYou absolutely are misogynistic. \n\nHopefully this acts as a mirror and you use it to gain self awareness so that you are able to actively work on your mindset.", "ESH (almost)\nYou do sound like a misogynist. Seemingly blaming women for the divorce rate. Even if true, you don’t know the cause of the divorce. To your point of “men stay together” then it seems more likely straight men are also the issue. \n\nShe sucks because honestly who cares about your reasons, why does she need to know. She could have left it. \n\nYour friends suck because they think it’s funny and ok you have such views of women. Especially the friend who came with you as he left his gf behind. I get she stayed because she didn’t want to leave her friend with no ride, most likely for safety reasons. For the sake of his relationship he should apologize as well.\n\nSo, the only one at this point who isn’t is the gf.", "Just gonna leave this here.  https://www.irwinirwin.com/why-do-women-initiate-divorce-more-than-men/#:~:text=A%202015%20study%20by%20the,higher%20rate%20of%2090%20percent.", "Are you gay or dating same-sex? If not, YTA for using lesbian & gay statistics as reasoning for being anti-marriage, when these numbers have nothing to do with man-woman marriage. I'm fairly certain any queer person can explain why this discrepancy exists because it's obvious to us. Many lesbians are what are (in)famously called \"uhaul lesbians\" where they settle down too fast and too hard, moving in and tying the knot ASAP, whereas men tend to look for flings (think Grindr) and do not look for lifelong partners in the same way, as often. This is an obvious reason why they get divorced twice as often: **lesbians are also twice as likely to marry.** Check your prejudices.", "NTA. She insulted you. I wouldn't have given her a ride home either.", "ESH her for demanding an answer. You misogynistic response. All you would have had tonsay is I'm happy being single then leave it at that", "Based. NTA", "If you’re asking if yta for your questionable stats to prop up your sexist views on marriage (i.e. you think \"men gain very little” - do you want a dowry or something??) then I can understand people going with yes on that front for their response and would tend to agree with them. However, you are NTA for not giving her a ride (although if you were leaving her stranded and alone I would more than likely feel differently) and I don’t think you owe anyone an apology for that.", "ESH.  Read the situation dude", "I think you were the asshole with the \"As she didn’t need anything from me a man\" remark.  You should have just said, \"I'm not comfortable being alone in the car with you.\"\n\nYTA.", "being anti marriage is fine, but your reasoning and the way you talk is misogynistic as hell.", "YTA, and you proved her point. Well done.", "NTA.  It was a joke between you guys and she took it personally.  If she wants to be mean about your opionions, and refuse everything else other than something that convinces her. Then she can figure out her own way. A lot of people here obviously do not share your humor.", "YTA, it seems like you find yourself very clever for thinking marriage is useless for men, but your reasoning is sexist and you were being rude.\n\nYou also sound obnoxious, ”we all died laughing” At what? Celebrating someone else’s marriage when you are anti-marriage? Wow, comedy gold!", "ESH- you definitely don’t have to give a ride to anyone you don’t want to give a ride to, but your views on marriage are objectively wrong. I also don’t believe in marriage in the traditional sense, and I (unlike you) actually won’t go into my reasonings here, but your views are based in misogyny and don’t accurately reflect reality. She shouldn’t have blown up on you, you shouldn’t have said what you said. Just take the L and apologize.", "NTA. If she didn't want to hear an opinion she shouldn't ask. Then to be rude the rest of the night instead of dropping it when he didn't even insult her. Crazy maybe don't talk about sensitive things if you don't want to hear it.", "YTA for the comment at the wedding alone. Every other action you took just kept digging you deeper. \n\nOh look at that you’ve deleted the comment where you’re being cooked alive by facts and kept the one where you think you’ve made people look stupid for a simple mistake. How lovely. /s", "Lol I'm just here for the comments! This is epic...", "Yep, and there are some pretty horrible statistics around organ donation as well. When a husband needs a kidney and the wife is a match, she donates it in the majority of cases. When the roles are reversed only about 10% of men donated.", "To add- friend is a bit out of line by accepting the ride home and leaving his gf, then asking OP to “apologize for the sake of his relationship”. His friend could have gone home with his gf and her friend and probably had less relationship issues.", "ESH cause OP sounds annoying and definitely misogynistic and her because I would also not get into the car of a man I just flamed.\n\nAlso for context of divorce, a lot of times women initiate divorce is because a lot of household duties, chores, maintenance, and child rearing falls solely on them. Women also do a lot of the emotional work in relationships. All while still juggling a career. This is not even accounting for domestic abuse statistics. (Just in case someone jumps in to say men get domestically abused too. Yes they absolutely do and they should get a divorce too.) \n\nJust google why do women initiate divorce and actually read past the headline to get to the deeper reason of WHY this is happening. \n\nMen in marriages are seen to live longer and make more money but the same is not seen in women.", "I agree, OP confirmation bias runs very strong here.\n\nI also agree with your statement re chronic medical conditions. I used to be a nurse in oncology. The number of women served divorce papers, while still in the hospital even, after their spouse and them heard they had stage 4 cancer was.....well jaw dropping.", "She shouldn’t have expected a ride but she was also right about the misogyny ESH", "Definitely an asshole, defensive and punishing for her pointing out the obvious.  Lucky these women got far away from the OP.  He is an arrogant misogynist and very defensive about it.  No woman would want to marry a man who thinks this way, it’s all about him and his money.  He definitely does not seem like a man any women would want in their life and so petty and disrespectful.  \n\nHe is best alone and likely will stay that way for the betterment of all women.  He seems to think he is a catch and women want him,  that is what is so delusional about this man.  \n\nHe also seems to have a jerk as a friend who left his gf and her friend behind after his friend behaved so badly but he is the one laughing at such disrespectful jokes at an engagement.  All the boys seem incredibly immature and entitled.  Poor women who are involved with them. They really need to not be involved with any of these men who behave like young boys.", "And he couldn’t have told her she’d be finding an Uber any earlier?  To tell her this right before leaving is rude and cowardly.", "Weirdly enough this is something Im thankful for being chronically ill - all my partners knew from the get-go that my health would come with many downs and that, as my partner, I have an expectation that I can rely on them during said downs. Although, I also date women and queer men which helps steer me away from a large majority of these sad statistics.", "Personally, I disagree with you. Not on the statistics (which you also cherry picked a single data point there chief), but on the ESH. \n\nThe friend didnt respect his opinion, started a fight for no reason, got answers she didn't like that have no bearing on her personal life whatsoever, and then decided to personally insult OP, who, mind you, had just made an effort to deescelate the situation by leaving and then offering a peace maker (drinks) upon his return. \n\nShe said she didn't need anything from him, and so he simply allowed her to stick to her morals instead of suddenly changing her stance when its inconvenient to her, which is precisely what she tried to do.", "Nearly 70% of divorces are initiated by women.", "Thank you", "Here’s some stats for OP:\n\n- Men are 50% more likely to cheat in marriages than women are. Probably a strong reason why women initiate divorce proceedings.    \n-Not to mention other reasons for divorce - domestic abuse, of which 95% of the perpetrators are male.   \n- gay marriage is a relatively recent phenomenon. It was only legal in a few states prior to 2015. Most gay people prior have never openly come out or been comfortable doing so. Even today only 3.5% people claim to be LGB. That alone shows that the small sample size could be the issue for results being skewed towards higher lesbian divorces.   \n- even if lesbians get divorced more than gay men, it doesn’t inherently mean anything. Women in general have higher standards when it comes to cleanliness etc. we’ve seen that in female versus male roommates. That’s not a red flag in itself.    \n- also, joke or not, it’s disrespectful to go to someone’s marriage party and joke about being there at the next one.   \n\nWomen have always gotten the short end of the stick in hetero marriages, so THAT should be your reason to be anti-marriage. They only get the man’s money because women give up their careers and their earning potential to stay home and raise children.  \n\nYTA for that. Laura was pushy and she shouldn’t have forced the issue, sure, but she’s right about you.   \n\nBtw, I’m iffy on marriage too, but not because I have preconceived notions about gender-related stereotypes.", "My guess is the friends are as bad as he is.", "There's a reason you're a Sultan of Sphincter. Well put.", " Textbook ESH his friends brought up the joke they laughed she asked didn't like what she heard insulted him then asked for a ride stupid all around. Your vote doesn't even count tbh", "I’d say ESH. They made the jokes and laughed. Girl asked why. He said he’s anti marriage and she’s the one who wanted the reasoning. His reasoning are sucky so he should’ve just dropped it but he HAD to be honest about why. So ESH", "So.. he should've still given her a ride home after she kept calling him sexist?", "It's not clear from this, so I'm not trying to flame you, but do you object to his being anti marriage, or just his reasons for it? I'm not averse to marriage to the degree that I object to my friends getting married and I have actually officiated two weddings, but I'm also pretty firmly anti marriage.", "OP is anti-marriage yet celebrating a friend getting engaged. What on earth about that makes OP an AH?!?!", "Right, and if men were the one's who *didn't* benefit from marriage, wouldn't *they* be the ones initiating the divorces? The fact that women \"bounce,\" as OP puts it, is because women overwhelmingly get the shit end of the stick when it comes to marriage.", ">women are \"more likely to bounce.\" Because it's a lot more common for the husband to end up being abusive or a cheater than it is for a woman to end up being one. \n\nI agree with the majority of your post but this. OP made an example abt same sex marriages. And against some prejudices gay marriages seem to be significant more stable than lesbian marriages (not sure abt the comparision to hetero marriages). So, while this does not necessary is a proof of OP's mysoginic views, your argument about \"husband being abusive\" has no relevance here.\n\nPS: The post seems to be a fake story / debate post anyway.", "Oh FFS - The day of my marriage, my soon-to-be-father-in-law handed me the keys to his car and told me to take off while I could because his daughter was nuts.\n\nWhat? People can't joke anymore? C'mon...", ">You being anti-marriage is like me being anti-drafted by the NBA. It was never going to happen for either of us.\n\nThe sheer brilliance of this. I'm going to use it all the time now, thank you for this gem!😂", "> You being anti-marriage is like me being anti-drafted by the NBA. It was never going to happen for either of us.\n\nr/murderedbywords", "Something about the way he describes marriage from a guy's perspective is gross, too. He has nothing to gain? Are romantic relationships just business transactions to him?", ">You being anti-marriage is like me being anti-drafted by the NBA. It was never going to happen for either of us.\n\nThis line genuinely made me laugh, thank you for this simile. Anyways, YTA, you sound incredibly draining to be around.", ">Men are not victims in society. The people who think so are not suffering because of their gender but because of their personalities. \n\nYour first sentence hit me so hard I didn't even get around to this. This is also great and I genuinely hope you're a writer in some capacity.", "\n\nMen are not victims in society. YTA for that right there", "I mean minority men tend to victims of society. Because of both my race and gender I’m more likely to be in prison for simply having some weed on me. In general, I’m just more likely to be fuck by the justice system.", "All true except, if you literally can't acknowledge my \"white flag\" question... I can fathom still holding out the \"olive branch\" of a ride home. He's entitled to his opinions too.  Sometimes you gotta agree to disagree, grow the fuck up, and move on.", "> Men are not victims in society\n\nThat’s a sexist statement. There are many ways that men are victims.", "Boom!", "OP was there celebrating and buying drinks for people!!", "\"I respect my money and peace too much\"\n\nHe's really not covering it up at all.", "This is the correct answer. ESH, but you sound exhausting.", "Wonder what op would have said if the woman drove and left him....", "What's more, he revealed that his reasoning behind the joke is that his friend *settled* for his fiancé and she'll probably \"bounce\" (i.e., cheat) on their marriage anyway. \n\nNevermind the cherry-picked statistics. As soon as he said, \"Men don't get anything out of marriage\" as opposed to, \"I don't believe that *anybody* gets anything advantageous out of marriage\", he proved himself to be a misogynist. \n\nHeterosexual women statistically initiate divorce proceedings more than heterosexual men because statistically cishet women are *significantly* more likely to be cheated on and/or abused by their cishet male spouses. They're also statistically more likely to have to deal with their spouses weaponizing incompetence and refusing to share the mental load of a shared household/family. \n\nFurthermore, statistics on LGTBQ+ marriage are being taken from an *extremely* small sample size, as legal LGTBQ+ marriage is a modern concept and many LGTBQ+ folks still never marry. Statistics on cishet marriage, meanwhile, are built off of a sample size of hundreds of millions of people, and centuries of recorded analysis and studies.", "Plus, married men have a longer life expectancy than single men. Single women have a longer life expectancy than married women.", "Even aside from murder stats, men live longer and happier lives when married to women, while women married to men see both their life spans and happiness drop. It’s a lot easier to be happy in your marriage when your partner is carrying the weight of the household and child rearing", "> An engagement celebration is not the time or place to go on a weird anti-marriage rant, even if someone opens the topic.\n\nOP thinks he's the main character.", "He was asked about that. He's allowed his opinion. He wasn't preaching or sulking in a corner making a scene. He was just continuing the joke that his friend, the groom, started and then answered the questions he was asked.", "Its always a blast for everyone when cishet people run around interpreting studies without any context or knowledge of the intersectional challenges of LGBTQ.", "Right? I know it's a stereotype but every single one of my lesbian friends is still on good terms with (almost) every single one of her girlfriends. There may be the odd exception for a particularly bad break up. Can't say the same for my gay friends, who also seem to see nothing wrong with sleeping around. Hmm, what does that say about loyalty?  Not to mention, countless studies that show that straight married men are healthier, wealthier, and live longer than straight single men. OP, I really wouldn't worry about getting married, I don't think any woman would want you.", "What are those reasons?", "OP exposed himself lmao", "You vote doesn't count because it doesn't judge the contents of the story it only judges his beliefs.", "Stats are biased? Lol whats next? Math is misogynistic?", "He openly insulted women generally, why should she not react?", "The people who were having the original discussion *were* all in on the inside joke. One person who knew the inside joke said something directly to another person who was in on the inside joke. The woman who got angry was not a part of the conversation. Parties are social events, you’re not always going to have the exact same people at every party who are in on every joke. People move around, it’s inevitable that there will be a conversation between a few people that have a long standing close relationship that others in the vicinity won’t “get”. It’s perfectly fine to share a joke amongst yourselves, especially when it’s not flat out picking on someone. Especially when you’re not addressing the entire group. \n\n\n\nI’m not sure where you’re from, but where I live…if you’re at a party and someone approaches a person at the table, the rest of the table continues on with conversation. More than 1 conversation can happen. You don’t just  listen in to a conversation you aren’t a part of and then question the conversation. That’s just rude. \n\n\n\nI’m not saying that their joke isn’t misogynistic. It was. But you can’t just gloss over the fact that the whole thing could have been avoided if normal party conversation etiquette had been followed.", "[removed]", "He told her as soon as she expected a ride. If someone told me they didn't need anything from me, I would take them at thier word. Espically someone who had been rude to me.\n\nHe's allowed his opinions and it wasn't like he was going around making a huge deal about how much he hates marriage. He showed up and buddy joked with him. He didn't start the joke either. He did nothing but answer questions and joke back with people. You can disagree with his opinions but that doesn't make him the AH.", "YTA for judging his beliefs and not the story", "I agree ESH. She didn’t need to engage with someone she didn’t know and would likely never see again , and he shouldn’t have stranded her. Also he is definitely a misogynist.", "Yea, buddy's girlfriend got her eyes opened real wide in this situation.", "Omg absolutely. I hope the gf reconsiders her relationship. A friend like this is a huge red flag.", "Right! I put money that she starts asking her bf to stop hanging out with OP. She’d be in the right too!", "The friend getting married told the joke........", "No, OP was put in a spot by being called out for something they believed in. Had the spotlight shined directly on them, and then called out for being anti-marriage.\n\nFriend's GF's Friend is totally in the wrong. If she knew she'd get all fired up over one of the potential responses, she should have kept her questions to herself.\n\nIt isn't OP's responsibility to provide a drive home after crap like that.", "[removed]", "I disagree she didn't need anything from a sexist so he only was honoring her wishes. NTA. Albeit I will say his personality does leave something to be desired", "I’ll ask this… if I called her ugly while there. Should I expect a ride home? Yes or no?", "Idk the “I hear a joke I don’t like and turn it into a shouting match about my beliefs” person sounds worse.", "He's not the one that started it, he clearly wasn't going to mention it at all until he was specifically prodded. \n\nIt's not as if he went around the party saying \"marriage sucks\"", "If they attack me and call me things, they can fuck off and find their own way home.", ">never put people's lives at risk over a few crossed words.\n\nnever look a gift-horse in the mouth either.\n\nif someone is offering you a free-ride, you don't trash-talk them and sulk all evening because you didn't like what they were saying, then still expect the free ride they were offering.", "He could've just said \"marriage isn't for me right now\" with no further justification. But he had to go \"BuT AKshULly\" and spout off some dubious stats to \"prove\" himself right. Decorum is a thing.", "I think it’s YTA and I totally agree with the if you’re their ride your responsible for getting them home", "I wish I could say I’m surprised, but reddit will usually bend over backwards to defend women being hypocrites.\n\nI agree with this whole post and especially the point about knowing when to get on your soapbox.  I think there are a lot of people out there who need to learn that lesson. \n\nNTA, OP.", "Oh no hon, it's you who is missing the point.\n\nOP courted controversy and deliberately upset women with his sexist, inflammatory views, then he denied to provide an agreed ride home because they dared to react. He's an AH on multiple levels here.", "youre an asshole when your inside joke and personal belief about marriage is sexist and when you're called out for it you play the victim and act like you were insulted by being called exactly what you are", "If he was making racist comments in front of a POC, would you give them this same, facile advice to just shrug it off and say \"you do you\"?\n\nOf course bloody not. Yet you expect women to just sit there are not react to being insulted and dehumanised. \n\nThis is how misogyny is maintained.", "I mean... The context was misogyny 😐", "Misogyny is not a valid belief and needs to be called out. The fact that you would list it right next to feminism is fucking disgusting.", "Agree with this wholeheartedly. NTA.", "His ACTIONS led to her response.   They are relevant.", "If he’s making fun of her entire gender, that IS personal. If your jokes rely on women as the punchline, maybe don’t make them around women you don’t know.", "Yep, Laura should have just kept her silly mouth shut and ignored the fact that OP is a raging misogynist. Oh wait, she tried to stay quiet, but the misogynist kept prodding. Really sad that you think women should stay quiet in the face of sexists lest they upset them.", "He didn’t attempt to diffuse though, he brought up something he know was extremely controversial that angers a lot of people, and got surprised when it angered her. \n\nAlso, why would he choose the selfish route of not apologizing, when all that happened is a random girl disagreed with him on something controversial, while his friend has his relationship at stake, and OP just has his ego at stake?", "Exactly what I told my friend. We took time apart. I tried buying her a beer in a sign of good faith. If she wants to pout let her.", "You are wrong. How about some research? Marriage favours men significantly.", "Edit to add then boot if she would have continued insisting on your prive matters", "I gave my dad one. And afterwards he told me he never wanted me. Good times. Keep your kidneys ladies!", "Dear lord", "The fuck???", "That’s not even adding in the whole, women are more likely to be killed or abused. Especially if they get pregnant. \n\nAnd in cases of divorce, men don’t seem to get custody because as it turns out, the men often don’t fight for much custody so the women still end up the primary caretaker and with the primary financial responsibility.", "That’s kind of depressing", "Oye", "10%?!? Damn, I wasn’t expecting much, but I was expecting better than *10 effing percent*. Men. Do better. And if you take personal offense to that, I’m going to repeat *90 fucking percent of men didn’t donate an organ to their partners when they were a match*. \n\nHoly crap, I was expecting to be disappointed, but goddamn.\n\nEdited because I thought I was doing a bold but instead I did a ~~strikethrough~~ 😫", "[removed]", "My guess is the friends are as bad as he is!!", "Yeah in some cases the man says he wants a divorce but the woman is the one who winds up filing the paperwork because that sort of chore typically falls to women", "Yup. My dad would parade my mom around in front of all his church friends to say how he was such a great guy for staying when most men would divorce a woman with stage 4 cancer.", "OP says there aren't many benefits of marriage for men. I'm wondering what he sees as the benefits for women. Especially after reading some of the stats in the comments. Yikes.", "And in Canada, over 79% of reported domestic violence victims are women. Women generally also carry a bigger emotional responsibility in relation to their families than husbands do. They’re more likely to be cheated on by their husbands. So….it makes sense that more women would be initiating divorce proceedings. \n\nObviously not all women who get divorced are abused but there are some clear reasons why more women would seek to leave a marriage that are related to larger societal factors and not women just « bouncing ».\n\nAre you really « bouncing » as the OP said when you’re divorcing your husband because he hits you?", "This statistic does not necessarily mean the women are the ones who ended the marriage. It just means women are more likely to file paperwork to make it official.", "That doesn't mean the woman is responsible for the failure of the marriage.", "But that statistic proves that men gain more from marriage than women, right? If more women initiate divorce than men that means women are less happy in marriages so OP is wrong about his statement about marriages.", "Nice made up stats. \n\nMillenials get divorced the least. Toxic men get left behind and deserve it.", "This is speculation (from a lesbian perspective) that many lesbians get divorced because we have such strong connections when we do fall in love that many incompatibilities can be ignored and subsequently end in the end of relationships and marriages. If you've ever heard of U-Haul lesbians, you'll know what I'm talking about haha", "Single women live longer than married women.\nMarried men live longer than single men.\nThat’s the only stat I’ve ever needed to know exactly who “gains” in a hetero marriage.\nYou guys literally and metaphorically kill us.\n\nBut if OP values his money over everything there is to be gained from marriage he is 100% in his right to never marry! But I can guarantee with this attitude he will only ever date women that verify exactly what he thinks of them right now which sounds lonely to me. \n\nESH", "He needs to read that post where the girl made a PowerPoint explaining how it would cost nearly $200k a year to maintain the lifestyle that most men with a wife live. He’d have to hire a personal chef, personal assistant, nanny, tutor, maid, etc! But yeah… apparently men get nothing from marriage and women are just financial leeches without value of their own…", "This comment needs to be higher!", "This is really interesting. I hope they do some studies on GBLTQ marriage & divorce. It would be cool to dive deeper.", "Well, his friend left with him, leaving his GF behind with her friend. So I agree with you.", "> I'm also pretty firmly anti marriage.\n\nAnd do you make a point to tell people all about that **AT ENGAGEMENT PARTIES?!?**", "> What on earth about that makes OP an AH?\n\nOnly the words coming out of his mouth, is all.", "Lol, it does still have relevance though. It's literal fact that the majoirty of DV cases, rapes, murders, assaults, sexual assaults are caused by men onto women. They are far more likely to be abusive. Why do you think DV shelters are overcrowded with women? Don't use some anecdotal evidence about gay couples - it's literal fact that men are far more likely to do the shit that leads to divorce.", "it's like jokes about blond women or about ethnicities. Yes, people used to make them. Yes, people used to laugh at them. But like, jokes about \"ball and chain\", \"adios freedom\", etc. when it comes to people getting married are just old, tired and cliché (see /r/boomershumor), on top of being sexist. \n\nGood for you, people made those jokes towards you and you found that funny, but it's still sexist and disrespectful. \n\nLike if someone told your bride \"Oh, flee before he starts treating you like his bangmaid, like husbands do\", it would have not been considered funny.", "Anyone clever and kind can make a joke without hurting the people about whom they are supposed to care. Also, your FIL is a dick. It would break my heart to hear my dad say something like that.", "That's a revolting thing to say about his daughter. On her freaking wedding day, no less.", "It’s not a joke though, he’s pretty clearly against their engagement.", "Are you OP?", "Also, if someone calls you a misogynist and you try to justify it, you’re not a rational hero who knows women well, you’re just a misogynist?", "He is 100%, no doubt about it, a gigantic asshole.", "It's a lesbian wedding.", "He has clearly never known any queer people.", "Gay men very much take their time before choosing who they'll settle with. Nothing wrong with auditioning a lot of guys first, no slut shaming here. It's one reason why their marriages last. That, and the gratitude that legal marriage is possible. \n\nLesbian relationships can get serious faster than straight relationships, because women trust one another more than they trust men. Straight women don't have the benefit of feeling safe with male partners they don't know well.\n\nYou're right that married straight men live longer, too. This kid has a lot of growing up to do.", "But his beliefs were part of the story?", "Without his AH beliefs she would have gotten a ride home. She responded appropriately to a sexist.", "And some beliefs are just wrong. Even if it wasn't, it was an ah move. Would I have done the same? Maybe. It still makes it an ah move. Just justified.  What kind of logic are you even using ?", "It actually does. If he thinks he Was a misogyne he was obviously TA.", "What? Of course stats can be biased.", "Lol you support his beliefs. Make it obvious.", "I want to believe you are being sarcastic because I can’t believe that someone would post something that’s clearly so wrong.", "Tell me you don’t know statistics math without telling me you don’t know statistics math", "He’s got a right to be an asshole. I personally wouldn’t have gotten so worked up by him…I would have just distanced myself from the table. \n\nI think she was an ah for saying she didn’t want anything (drink) from a sexist, but then still expected a ride home. That’s bullshit. Either commit to not wanting anything, or don’t be so hostile and get the ride home.", "How does not wanting to get married equate to insulting women?", "The literature is pretty consistent that men very much benefit from marriage. Men have better health outcomes when married, married men (especially with children) are viewed more favorably at work, etc. It’s actually women who don’t tend to fait well in marriage. In regards to family court, few men seek custody and those that do tend to be award the requested custody. Many of the statistics are skewed bc they don’t account for what the fathers actually asked for, which usually isn’t much if any. It’s your right to not want to get married, but your rationale doesn’t reflect science.", "But it’s a well known fact that men who seek custody and visitation in family court are granted it. The courts aren’t stacked against men.", "The men who don't get what they want from family court are usually for 2 reasons\n\n1 they did little or no hands on work during the relationship with the kids or the home.  Working is not the flex you think it is \n\n2 there is a very real danger to the family.  \n\nMen do not get a rough outcome.  They get what they deserve.", "The only ones who do are the ones who deserve it. You are not the victim here.", "uhhhh this one's tough, NTA for not giving a ride as I think people shouldn't bite the hand that feeds them\n\n\nbut, you're giving annoying enlightened centrist vibes using cherry picked facts and rationalizations that ignore historical context. fyi you are indeed a mysoginist and no where near as intellectual as you think you are. \n\nYTA for that", "lmao", "If he drove her there it's obvious he would have driven her back and that was expected. If he decided to NOT do this he should have told her immediately, waiting for the time to go to do it was clearly done with the intent of being an asshole at the very least.", "Explain in greater detail what you mean when the issue he was asking about was tied to his beliefs", "I sincerely hope so. Nobody needs that kind of boyfriend in their lives.", "That's the update I'd wanna see.", "Fingers crossed! I'd be pretty upset if my boyfriend chose to stick with a guy like this", ".......there is nothing wrong with what his mate said. It was a normal statement to say to someone who clearly hates weddings. If anything they were hinting they were happy that he put his hang ups aside for them.", "OP was deliberately vague about it so he could go on about it and obviously offend someone.\nincels get a rise out of it.", "OP is put in a spot of being called out for being anti engagement, while being at an engagement party. You really think he should’ve stood by his beliefs there?\n\nWhy can’t he just say he doesn’t want to settle down or something? Why would he go to an engagement party, tell a woman how engagements only work for women, and act like the good guy after she gets mad at his misogynistic views?\n\nOP definitely should have realized that after saying a bunch of rude things at an engagement party, and starting an argument that he could’ve easily avoided, to not simply push her buttons one more time while ditching her.", "Sorry man, YTA. Saying OP stuck by his beliefs is ludicrous. \n\nOP went to an engagement party, disrespected the recently engaged couple, expressed his anti engagement views at another person’s engagement party, while then explaining to a woman how engagements only benefit a woman, followed by him saying one last rude comment before ditching her. \n\nAnd you sound like a terrible friend. She’s not some stranger, she’s his best friend’s girlfriend’s close friend. If he cares for his friend, he should care for her as well.", "He didn't have to answer. Instead he chose violence. He had it coming.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "So you admit you are a sexist.", "Your logic here suggests you’re really just not nearly as bright as you think you are.", "i'm gonna be honest. yes. \n\nat least the way i was raised i would NEVER leave someone i drove alone at night. you chose to be responsible for that person, you never have to talk to her again but you did need to make sure she got home.", "If my brother had wheels would he be a bike?", "No you shouldn’t, but that’s a terrible way to look at this. Could’ve just been the bigger person for the sake of your friend, he clearly had an awkward choice to make between you and his gf. YTA for putting your ego over his relationship, and not just giving someone a ride home out of decency.", "The double standards on Reddit will make your head spin dude. NTA. I for one as a woman who is married could give two shits about you not wanted to get married. She poked the bear.", "If OP was called about by another guy he would have still given him a ride home.", "OP said in post he and friend tried to explain it was an inside joke and say he was just anti-marriage but that the friend demanded an explanation from OP.", "You really expect to insult someone and think they're obligated to give you a ride home?", "I mean you can’t have your cake and eat it too", "Having a controversial view doesn't inherently make that view wrong though nor does he specify that he holds these views to deliberately upset anyone, so he really didn't go out of his way to upset her or anyone else. However, she did go out of her way to upset him through name calling and being objectively stand offish. Plus, nowhere in this story does it specify that the ride home was agreed upon, taking somebody to a location has never and will never mean that you are agreeing to take them back to where you picked them up from unless it was specified. This is a case of ESH at best. And if you're actually going for the answer to the question at hand then probably NTA.", "I think you may need to read the post again.  He didn’t “court controversy” in any way.  3 friends shared a short inside joke.  She ruffled up her feathers and he tried to diffuse the situation with “It’s not what you think.”  His FRIEND says he’s anti marriage.  \n\nRuffled Up DEMANDED he explain why.  Ruffled Up did not like the explanation.  Ruffled Up did not take advantage of the time out and cool off.  Ruffled Up did not take the olive branch extended, instead throwing insults.  Ruffled Up was hoisted on her on petard.  Ruffled Up needs to take an Uber.  OP is NTA", "That's not the point of the sub though. So yes it is you still missing the point", "What exactly did he say to her? Do you have the exact quotes?", "I'll take all the downvotes proudly on this one.", "His actions? From my understanding his friend said the inside joke they laughed she asked what they laughed at and he told her she didn't like what she heard and insulted him then asked for a ride home classic ESH", "Agreed.\n\nOP must try to school everyone with his “statistics” when they challenge his inappropriate behavior.", "According to his post, his friends brought up as their inside joke. He then explained when she pressed about it. He also went outside to allow both sides to cool off and offered to buy a drink after coming back to show no hard feelings. She then insults his offer... The person who is supposed to be her ride home. Anyone with common sense knows you don't act like an ass to your ride home when you're out away from your home.\n\nHe shouldn't apologize for having his beliefs. No one has to agree with his beliefs, but no one has the right to demand an apology for him having them. If his friends' relationship is 'at stake' from something that had nothing to do with his friend or his girlfriend... It's not a good relationship. I had an ex that expected me to make friends conform to what they wanted or would tell me to stop hanging out with them... They were an asshole for doing it and somis OP's friend's girlfriend for it.", "Look at that.  Buying a girl a drink hoping to pacify her. What a d-bag", "Oh, and a lot of the time when a woman faces a serious illness or cancer, the husband bounces", "[removed]", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "My parents stayed separated and not divorced for 10 years because my mum refused to do the paperwork and pay the processing fee (and because he was the one who left while she wanted to try therapy and reconciliation).", "That's exactky how my divorce went down. He  moved in with his new woman, and I did the courthouse crap.", "I’d honestly divorce my husband then and there if he said some crap like that. Gross. Your wife with cancer is not some freaking charity, she’s your wife! You shouldn’t want a pat on the back for doing the bare minimum of staying with her through her health issues!", "“You see, I’m not a COMPLETE asshole!”", "I am sorry your mom had to endure that.", "Especially if they married him, starting off with an asshole for a husband.  Could only go horribly wrong. He keeps commenting on the comments and proving over and over again what an asshole to women and people period.  Only defensive and mocking others.  It’s truly pathetic as a man.", "Men in heterosexual marriages live longer, and are happier, than unmarried men.\n\nWomen in heterosexual marriages live shorter, and are unhappier, than unmarried women. \n\nOP is basically smoking crack, and also an asshole.", "Actually a better number is 1/3 women have been abused by their spouse and 1/4 men.  Men rarely report it because of the stigma associated.  Abusers are trash BTW, all of them.", "What stats do you find?  I’m just using the American sociological association as my source.  If I’m wrong please elaborate.", "Wasn’t your comment “nice made up stats”?  If you weren’t talking to me then that’s cool.", "The National center for health statistics puts its at about 80% I picked a lower number.", "And probably the emotional intelligence to let go when that’s the better option for both parties even if it’s hard", "Exactly. Lesbians are more likely to get divorced because lesbians are more likely to get married in the first place.", "Yeah, I think the same. Things are a Little too rushy so often.", "Nice to get your perspective. Either way, gay/lesbian marriages are a drop in the bucket compared to hetero marriages in terms of volume. You cannot compare the two for at least 25 more years till we have decent sample sizes.", "Exactly. I read about this as well. And for a man to say men are the ones that get the tough deal in marriage when they actually live longer than if they stay single is just baffling. Unfortunately OP is definitely a misogynist, hopefully he’ll grow out of it and read up on more statistics on marriage instead of just the ones that make women look bad which are obviously the only ones he’s looking for", "I wonder what the same study would find if it only considered women who didn't have children.\n\nPregnancy generally lowers your life expectancy, either directly or indirectly, because of how rough it is on the body, and married women are a lot more likely to choose to get pregnant than single women, so I would be surprised if that didn't have a big impact.", "This statistic made me sad. They’re literally draining the life out of us\n\n“I’m tired of the argument not all men. If it’s not you, who is it then? All the good life in my life fit on one hand.”", "Sounds like the gf licked out finding out her big was an ah too", "ESH—the girl was playing a stupid game.  Unless it was some type of setup for you & the girl and you didn’t know, it is stupid for her to give you the silent treatment as what does she care about your opinion.  \nWhile I’m okay with her asking about the inside joke and I’m okay with her asking you for your reasoning.  I see no reason for her not to say something like, “wow, you’ve put a lot of thought into it!”  Or she could add, “Hopefully the love of your life will be okay with that.”  Or, “ I hope you disclose this viewpoint relatively early in a relationship so no one gets broken-hearted.”  \nI’m not sure I fully follow your logic on marriage, I do want to say that fewer women need to get married these days.  40+ years ago, it was common for banks or credit card companies to not let a married woman open an account w/o her permission.  I’m not sure what they required of unmarried women…\nAnyhow, I find it interesting that your friend thinks you need to apologize for the sake of his relationship.  He’s the one that opted not to Uber with the girls.  It’s possible that his girlfriend saw him as taking your side and not being chivalrous since he didn’t make sure they got home safely.  Yes, 2 girls should be safe in an Uber but it is a scary world.\nI actually wouldn’t be surprised if your friend’s girlfriend didn’t think her friend was being OTT with her antics.", "He didn't make a point to tell people, she made a point to ask him why. They were all sharing a joke, clearly they all know his stance. She asked him why he didn't just randomly decide to bring it up.\n\nThat doesn't make his reasoning any better but it's not like he decided out of the blue to talk about it", "Learn to read the post.  OP didn’t make a point to tell people anything.  \n\n1) Someone else made a joke, they laughed.  \n\n2) OTHER FRIEND told everyone he was anti-marriage and OP tried to leave it alone.  \n\n3) The other people demanded OP explain everything, at the engagement party.", "Never. Like I said, I've literally officiated two marriages. But I'm extremely outspoken about it, and most of my friends are aware of my feelings and a lot of them know why I am. But I was literally just asking if you have a problem with people being anti marriage. I was absolutely NOT defending this jackass!", "Celebrating an engagement at a bar and you expect everyone to just sit politely with their hands folded on their laps? No jokes, no having fun. Definitely don't say anything that could hurt someone's feelings or be considered remotely controversial.\n\nHave you ever been to a bar before?", "It is in no way, shape or form even remotely similar to blonde jokes, or jokes about ethnicities. This is so far removed from that, and it is because everyone has gone so damned far to one side that nothing is ok anymore.\n\nOP is making light of a friend getting fucking married. That friend has a choice in the matter. Jokes about ethnicities target people that have no choice in the matter. So don't.\n\nDon't be one of those people that lump it all into one basket. Laura, or whatever the hell her name is, is the odd one out here. She doesn't know OP, who is surrounded by his peers and is used to a certain tolerance level. He's in his comfort zone.\n\nIf his friends had a problem with him, it would have been mentioned long before this.\n\nThis newcomer enters his circle of peers and calls him out and calls him down while he is in what he believes to be a place where he can let his guard down.\n\nSo fucking don't.\n\nDownvote me to oblivion for all I care, but don't make this more than what it is. Don't compare it to race. Race was never even brought up.", "It's sad how often women whose fathers are misogynistic pricks end up also marrying a misogynistic prick, because they've been raised to think that bullshit is normal and don't know any better.", "Get. Over. Yourself. I'll be sure to tell my wife how offended you are on her behalf.\n\nHow dare someone have fun?!?!\n\nMy wife and I joke all the time about making sure we both have our life insurance policies jacked up nice and high.\n\nNot everyone has transparent skin. I'll make sure to let my father-in-law know he's officially cancelled too.", "He's against his OWN effing engagement. Seriously folks...", "\"I'm not racist, it's just a fact that white people are superior\"", "No slut shaming meant. I know plenty of gay men are in monogamous relationships, but I also know more non-monogamous gay men in committed relationships than non-monogamous lesbians or straight couples. As long as both parties are fine with it that's cool, it's their business, people can do what they want with their own bodies. But - coming at this as a straight woman - commitment to me also incorporates fidelity. From the outside looking in - and sure, you can tell me I've got it completely wrong - it seems easier to commit if you know commitment also means you can have random sex with other people. Again, as long as everyone is a consulting adult and as long as boundaries are respected, it'a all cool, none of my business. It's just not for me", "He didn't say anything about them until she ASKED him what the inside joke they were laughing about was then she got offended and insulted him classic ESH", "She would have gotten a ride home if she remembered people can agree to disagree it's ESH anyways", "This is textbook ESH you only put YTA because you personally don't like what he said which is what you shouldn't do that's the logic I'm using", "Well i support that those studies exist yea. Divorces are almost always started by women 80 - 90% and number 1 reason for divorce is lack of commitment, 75%. He said something about lesbian vs gay marriages and hes right there too, lesbian relationships have the higest level of domestic violence and lowest reported happiness while gay couples have the highest reported happiness. You dont have to like it, but to call stats biased or misogynistic is ignorant", "But this isn't DIHTRTBAA? It's AITA. It has nothing to do with if someone has the right to do something. The simple question is, was he?", "\"I value my money and peace\" \n\n=\n\n\"Women are out to take my money and wreck my life\"", "It's a wonder this myth still goes around. \n\nUntil recently, the law field was heavily male-dominated. Lawmakers were mostly men. Lawyers were mostly men. Judges were mostly men. You seriously think they would write laws or make decisions that would go \"In case both parents are on equal footing, let's give custody and support to the mother, fuck the dad!\"?\n\nhttps://www.custodyxchange.com/topics/custody/family-members/father-full-custody.php\n\n> #What Are the Chances of a Father Getting Full Custody?\n\n> For so long, custody for fathers meant a weekends-only schedule or other limited parenting time. But changing family dynamics have led to a sea change in the outcome of custody cases.\n> \n> The chances of a father getting full custody are climbing. According to the U.S. Census Bureau, fathers made up 20 percent of custodial parents in 2018, up from 16 percent in 1994.\n> \n> Still, full custody for fathers is far less common than full custody for mothers. Whether this is due to bias against fathers is a hotly debated topic. **Overall, many courts prefer awarding joint custody to both parents.**\n> \n> Custody cases don't change much when two dads are at odds. The vast majority of the tips below still apply in this situation.\n> \n> In general, fathers seeking full custody should expect a custody battle. They'll have to build a case that shows their child would benefit from living primarily in their care.\n\n> #Mothers' rights versus fathers' rights\n> Parents essentially have the same rights to custody — so long as the court recognizes them as the child's legal parents.\n> \n> A mother is automatically the legal parent of any child she gives birth to, regardless of marital status. Unmarried fathers must establish paternity. You should get proof that you're the child's biological father (or legal father) before you pursue full custody. Many states won't even allow you to start a custody case if the child's paternity is unknown.\n> \n> **Courts cannot discriminate against a parent based on gender. Yet the best interest of the child standard is more likely to favor mothers since they are often the primary caregivers for children. For a father in a custody battle, proving parental fitness is key.**\n\nhttps://www.dadsdivorcelaw.com/blog/fathers-and-mothers-child-custody-myths\n\n> #Myth: Fathers Almost Never Get Custody\n> It depends on the applicable definition of “never,” but generally, this is untrue. The most recent available Census statistics show that fathers represent around one in five custodial parents—an improvement over the 16 percent of custodial parents reported in 1994. However, studies indicate that dads simply do not ask for custody as often as mothers do, and courts generally do not award what is not asked for in that regard.\n> \n> **A Massachusetts study examined 2,100 fathers who asked for custody and pushed aggressively to win it. Of those 2,100, 92 percent either received full or joint custody, with mothers receiving full custody only 7 percent of the time.** Another study where 8 percent of fathers asked for custody showed that of that 8 percent, 79 percent received either sole or joint custody (in other words, approximately 6.3 percent of all fathers in the study). \n> \n> Of course, this leads to the obvious question: Why do so few men attempt to gain custody? While there are multiple factors at play, one to note is that since many men still believe that the court system is inherently prejudiced in favor of the mother, they do not try to seek sole or joint custody, believing it to be a waste of time and money. This contributes to any lingering biases or claims that men care less about their children, which is, in fact, mostly untrue.\n\nI want to see source that says that ***most*** (as in 50+%) FIT fathers actively seek joint custody or primary custody and don't get it.\n\nSo far, I don't believe that the courts are stacked against the fathers. It is the duty of the courts to observe the best interest of the child. They won't punish a dad with no child custody just for the fun of it.", "https://youtu.be/B6JS__PsI0w", "Sadly it is an issue. A  teacher used a male student while he was fourteen. Waits for him to become an adult and then expects child support and wins\n\nhttps://www.psychologytoday.com/us/blog/talking-about-trauma/201902/when-male-rape-victims-are-accountable-child-support\n\nAnd\n\nhttps://www.usatoday.com/story/news/nation/2014/09/02/statutory-rape-victim-child-support/14953965/\n\nNote: to mods I did look for a url with non problematic word choice but did not see one. If it is problem please remove thanks.", "She could just also not get her buttons pushed of some random guy she doesn't like the opinion of. He was bantering to his friends and she got triggered and had to get to him. You don't need to like engagements to be happy for your friend and enjoy a party. As I am not married i don't see the benefit of marrying and engagements either and can understand why people rather not get married. But her getting aggressive over someone's belief of marriage is not ok. There it doesn't matter why he is against it", "Sounds like he kept his opinion to himself until somebody inserted themselves into a conversation that had nothing to do with them", "He made a joke among friends and they laughed, the guy he made the joke to appreciated it, your feelings dont matter. Best friends gfs friend is basically a stranger mooching a free ride. If she paid him gas money or something id understand but she was getting a free ride and drinks.", "And she couldve chose to not insult him and accept free drinks and a free ride, instead she got what she asled for, no favors from him", "It's not about wanting to be married, it's about cherry picking sexist data to further a misogynistic fallacy. It's red pill bs.\n\n In order to be actually not racist, you need to be actively anti-racist. Similarly, in order to be actually not sexist you have to be actively anti-sexist.\n\nNot to pile on too much, you are sounding a bit like a, \"not like other girls.\" That's a whole misogynistic nesting doll unto itself.", "you really expect to say sexist things and use the fact the woman wont have a ride home without you to hold over her head so shell stay silent and wont call you out for it?", "\"I respect my money and peace too much\" is what he provided, and that's already bad enough.", "That his in-depth explanation of his own misogyny was given with the intent to antagonize  her is quite obvious.\n\nIt was an engagement party.    As others have said, that behavior was inappropriate in several ways.\n\nBasically, what he did is analogous to:   AITA for throwing my cat out after it bit me, after I repeatedly poked it with a stick?\n\nSo, yeah.  His actions maatter.", "Dude went full Red Piller on an engagement party. That’s not just his funny opinion.", "The \"inside joke\" being \"women are so awful, amirite?\"\n\nThere's an old adage that when the joke falls flat, the problem is the joke, not the audience.", "Can’t make rude jokes and just cite them as inside jokes. They’re obviously demeaning and reinforce negative views against women, and they’re especially rude to the two people celebrating their engagement. \n\nLetting things cool off and coming back inside to buy a round is a good way to deal with the situation if you’re not in the wrong, but it doesn’t count if you push someone’s buttons, lead them to think you’re misogynistic, only for an argument to occur. \n\nAnd that’s a massive projection on OP’s girlfriend. She was hardly even mentioned in this post aside from staying with her friend. But OP’s friend clearly had an awkward choice to make between OP and his girlfriend, and it’ll obviously have a destructive effect. He is causing a ripple in his friend’s relationship. \n\nAnd truthfully, if his beliefs are misogynistic, and he goes out of his way to show that to everyone, he should apologize for having his beliefs. Most beliefs are subjective, but if yours is misogynistic, you know they’re controversial, and you ensure it’s the topic of conversation, you’re in the wrong. \n\nWhy couldn’t he have just said he was anti marriage because he didn’t want to settle down or something?", "The next step was to ask her to smile", "Or has a stroke. I know a sweet old lady who had a stroke after the death of her only child & then husband left her.", "Thanks. I hate it.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I didn’t get those stats…. You are making things up. 18% of men experience intimate partner violence, the thing is that majority 12% of that is men in same sex relationships…….", "…. Are you legit just making up #s 🤣🤣🤣 tf", "Where did you get this statistic? The studies I see on this are usually based on self reports by the abusers. Is this based on a study of victims reporting abuse? Emergency room records? All forms of gathering information have there pros and cons, but I feel like looking over all of them helps paint a broader picture atleast. \n\nAlso how can the statement \"Men rarely report it because of the stigma associated\" be proven? How are they gathering data on men who were abused and then did not report it. How do they then gather data on women are abused but not reporting to compare? I feel like we can never no the truth because we usually just rely on some form of self report.\n\nI also saw studies that went into types of 'domestic violence' performed by men and women. Verbal abuse, psychological, manipulative, physical, murder, etc. From what I remember the males usually were worse in forms of violence like stalking and obsessive weird stuff and a lot more likely to be sexually motivated.", "Ohh good point--I do wonder what emotional intelligence levels look like in hetero couples. Like do they generally have lower EQ levels? I would love to eventually see a study on divorced queer couples vs. hetero couples", "100%\n\nI'm currently in a long term relationship and one of the things I was looking for in someone is that we both have the patience and wisdom to move forward in a meaningful and intentional way. Had to turn down a few people because they immediately jumped into serious commitment within a few days", "Exactly, I'm very excited for when we can do studies of all the queer people vs cishet people of the world. There will be a lot to learn!", "Well, we can't know what the girls got up to once these misogynists left! I hope you're right and they had fun, though.", "Have you been to an engagement party before? It's really not a great forum for making jokes about how the marriage is doomed.", "> Don't compare it to race. Race was never even brought up.\n\nI thought you were one of those people for whom comparisons and parallels are completely wasted, so I gave another example of \"marriage joke\" that would not be considered sexist and not really funny (\"Oh, flee before he starts treating you like his bangmaid, like husbands do\").\n\nMy point was \"Just people make these jokes and some people laugh, it does not mean it's funny and not sexist\", but you decided to pay attention only to my finger and not to the moon.", "No, only gender was brought up. I guess mean-spirited misogyny is fine with you, but racism crosses the line. \n\nI’m sure you’ll respond with some kind of angry and spiteful crap about wokeness and how you are so put-upon because you can’t voice your biases as freely as boomers could back in the day.", "I once attended a wedding where, when the couple knelt to receive a blessing, it was revealed the groom had written \"HELP ME\" on the soles of his shoes. I felt so awful for the bride in that moment. She's literally not even married yet and the groom is making jokes about how he's trapped with the old ball and chain. He literally couldn't even wait until after the wedding ceremony to make this belittling joke at her expense. And the bride just took it. I'd have walked the fuck out.", "For someone lecturing others to have a sense of humour and not be so sensitive, you sure get defensive quickly 🤣", "You can dish out out but not take it, right, Chad?", "His views aren’t why engagement are bad for him, his views are about how engagement only works out for women, not men. That’s pretty strong evidence to be against marriage in general. \n\nIf you’re right though, why would he mention “I’ll be here for the next one”? And why would he then cite off reasons why marriage is bad? Should’ve kept those thoughts to himself.", "Exactly! Same mindset!", "Getting the vibe op has this mindset tbh", "Which is fair enough OP is an arsehole. But shouldn't the friend not rely on said arsehole for a lift back? If I'm at a social function and someone has an opinion I fundamentally disagree with an uber is a small price to pay to not rely on them further.", "Not every queer person is in a open relationship. Some people are, it's true, but I'm not sure that gay men are more likely to be. I personally know more lesbians in poly or open relationships.", "Nah. No quarter for bigots.", "I agree w the esh part.", "Isn’t women initiating divorce evidence that women are more unhappy in marriage than men? Thus women are fairing worse while men are at least content enough to stay married. \n\nI don’t see what lesbians and gay men have to do with any of it.", "Can you provide some sources for those stats?\n\nAlso, lack of commitment is extremely vague. Are you saying that women start divorces because they lack commitment? Because their partners lack commitment? If one partner cheats and the other files for divorce because of that cheating, who gets the blame in your statistics?", "And you think that 75% is solely on the women who cheat or don't want to remain faithful? If women were cheating more, wouldn't men be initiating divorce more?", "Your comment actually had me laughing, but I can’t figure out the beginning of your acronym. (Edit: got it now! I was trying ‘does he have…’)\n\nOk, so let me think…is he an ah for not giving her a ride home (the actual question he asked?) yes and no. She *did* say she wanted nothing from him, but he shouldn’t have left her stranded.\n\nIs he an asshole for his sexist views? Yes. But they make me pity him more than being offended by him. He sounds totally like a hurt and scared little boy.", "He could say the same thing about getting married to a man.\n\nAny intimate relationship is going include some conflict. Any financial partnership involves trusting someone else with your money. A marriage is both, regardless of the genders involved. Some people don't think the risks are worth the rewards.", "I can definitely understand not getting married. I don’t want to get married, and some of my friends know that. \n\nHowever, my friends learned that from random Saturday night conversations. I didn’t wait until an engagement party to tell them. And I certainly would still support my friends getting married. \n\nI still really don’t understand why OP had to start rifling off facts that obviously start an argument. Could’ve just said he doesn’t want to settle down, or he could’ve been honest and said no woman would want to marry him.", "He didn’t keep his opinion to himself, they were at a table together, she’s clearly apart of the conversation lol. Pretending like one friend doesn’t exist for a minute during a conversation doesn’t mean they’re inserting themselves if they talk there. \n\nAlso, “I’ll be there for the next one” isn’t even implying anything, it’s outright saying terrible things.", "if it was only among friends then other people shouldnt have been able to hear it", "It isn't an insult when it is true.", "I wasn't there so I can't say it was to antagonize her as for the engagement party etiquette his friend (who was getting married brought up the joke so I think it's fine) imo it's ESH", "Cuz she’s more pretty if she smiles right?", "Yup, there’s that too.", "Yeah, me too", "I would say my male husband has a much higher emotional iq than me. In the test he scored super high. I struggle reading social ques/ others emotions. So I'm not sure it's 100% sure it's an emotional iq thing perse but more the ability/ skill of communication being more taught to women from an early age. Idk", "I have problems finding something for the same reason, I like to take my time. But several partners are like \"We have a first date, so now we have to live together\". \nI just.... Can't. Really can't move so fast, so I have to decline and after a couple times it's taken as a overall reject. So yeah, I kinda can guess why lesbians are divorcing more often.", "My friends and family made jokes at MY engagement party about divorce rates. My sister in law told me she always figured her sister to be a black widow and I'll probably mysteriously die in my sleep!\n\nLife is too short to take things so seriously.\n\nEveryone needs to just chill out globally.\n\nThere's far too many fragile minds and egos out there.", "If it makes you feel any better—it was probably one of the groomsmen, not the groom himself. My dad pulled this “prank” at one of his friend’s weddings like 30 years ago and still thinks it’s hilarious, even when my mom and I insist it was mean.", "Seems like they'd be REAL fun at parties....", "\"Men gain very little\" is what he claims to have said. So it seems like OP is a bit transactional in his thinking, and feels like the scales are a bit tipped.\n\nDoesn't seem to be shy about saying it, probably even cautioned his friend about getting engaged in the first place.\n\nWhat the hell is wrong in this world if we can't have debate without fear of being condemned for our views? It's healthy to challenge views and be challenged by views and opinions.\n\nWill everyone be able to convey them perfectly and cite specific, picture perfect studies and statistics? No.\n\nBut the fact remains, OP was challenged, offered points for consideration (albeit in a relaxed and very laid back setting) and was demeaned, berated and condemned for it.", "Thank you. It could very well just be the people I know and you are right, I shouldn't draw conclusions based on that.", "Women are more unhappy in marriages statistically, actually if i remember correctly women tend to be more unhappy in general than men. Men are more willing to settle, at least thats how the numbers bear out. But when i say they benefit from divorce, i meant financially; as well as children typically go to the woman.\n\nThe lesbian vs gay numbers are just used to show the 2 genders happiness is in long term relationships.", "https://www.google.com/amp/s/www.insider.com/why-people-get-divorced-2019-1%3famp", "I never said its only women who chest or arent faithful, but no ive seen men stay to keep their kids and not lose half their house even after the wife cheats, but ive never seen the opposite. I recognize thats anecdotal though", "Did he go around spreading his beliefs? Or was he just there supporting his friend\n\nEven then there was a inside joke between friends (so she wasn’t included in that conversation) and demanded he explain himself this is 100% on her and she should mind her business", "Insults are insults, also she can certainly voice her opinion if she wants to, but she isnt entitled to a free drive home either", "I don't actually disagree with you on the ESH.  As far as I'm concerned he's the real AH, but why on earth would she want to get back in the car with him? \n\nAnd she ignored the common sense rule;  don't point out someone's lack of decency and then expect them to show decency.", "That's a woman making a joke about her sister. Not a guy seriously explaining why marriage is a trap after \"joking\" they'll get divorced.", "OK, have fun with all that toxicity!", "Actually that kind of does make me feel better 😆", "Time and place, Chad.\n\nHe and his buddies an debate this as much as they want, but doing so at someone’s wedding is rude, tasteless, and obnoxious.", "Yeah you seem fun at parties. \n\nHis friend is celebrating his engagement. It’s not the time to have an open debate on if engagement is going to support a matriarchy too much. \n\nThere are times for debate. And there are times where you tell a friend congratulations and best of luck. An engagement party is not the time to challenge your friend’s views on engagement.", "I only know one gay man who has had open relationships. But that could just be the lads I know. And also what they're prepared to admit. The women I know are definitely more likely to just tell people what they're up to. \nThere is a lot of pressure for gay marriages to be 'perfect' though. A lot. It's something cishet people like OP, have absolutely no idea about.", "That's your evidence?\n\n52 people who went to counseling and the reasons it ended up failing?", "I still think the terms of that survey were vague, but ok. I’d like to point out that people responding to the survey were asked to pick as many reasons for divorce as they wanted to, so that 75% includes many people who selected lack of commitment AND infidelity as the reasons.", "Yes, it is anecdotal, which is why I didn't give stories of it happening in reverse. People tend to focus and remember stuff that could happen to you. So women remember stories of husband's who don't help in the house or with children at and all and men remember stories of men who do everything and get cheated on. What remains important is the facts. Yes, women initiate divorce more, but the one who is losing in a relationship is more likely to file for divorce than the reverse. Why would someone file for divorce if they are getting everything paid, or they don't have to do anything around the house? That points to divorce initiators before the hurt party more than the reverse, because for it to be true in the reverse, you would have to believe that women are initiating divorce at a higher rate out of greed which is laughable. Women are more likely to refuse to put up with bad behavior, as well as feeling stifled in a marriage from the extra burden they have to take. There is a reason married women have a lower lifespan, outside of the facts that married women are more likely to be murdered by their partner than the reverse. \n\nYou seem to be looking at the surface statistics, but not the other statistics that point to the reason, not the correlation.", "He was not there supporting his friend. He was there saying his friends engagement would not work out for him. That’s not support.\n\nIt’s pretty rude to tell people at your table to mind their own business lol. It’s also not an inside joke, he spoke about how marriages are bad for the guy (which was still the point of the inside joke), and then supported his anti engagement views at an engagement party, by explaining to a woman how engagements benefit women more. \n\nSome thoughts are just best kept to yourself.", "He was definitely out of pocket for sure, I would've explained the inside joke and that's it not go on a tangent. That's just me tho", "Been having a blast, happily married since 2014. Go be a Debbie Downer and poop on some more parties.", "I feel like this is a serious case of reading your audience. If we take OP at their word, which is what this subreddit is kind of about... We're kinda working with one side of a story in these examples, then what I imagine is a very lighthearted gathering where everyone is having a good time except OP's Friend's Girlfriend is easily offended by views counter to her own, and takes the liberty of getting offended on other people's behalf like so many people do now...", "And if he wasn't specifically prodded on it, he wouldn't have even mentioned it. \n\nHe clearly supports his friend even though it's not the choice he'd personally make.", "I mean that was just one of the first links when i googled it, do you have another source? Ill read it", "This guy's kids definitely look like the milkman.", "“I’ll be here for the next one too”. \n\nIn what way is that clearly showing support?\n\nHe wasn’t specifically prodded on it either, he mentioned something very rude, got called out by someone at the table who is more than allowed to participate (assuming she wasn’t just invited and told to be quiet), and chose the worst course of action for it.", "Jeez that would be quite the plot twist!! Would explain a lot too..."]}