{"id": 4126, "submission_id": "zee1el", "title": "AITA for moving to Sweden without telling my Mum?", "selftext": "For some context, last June my Dad passed away after a long battle with COVID.  This loss affected the family greatly.\n\nI was devastated. I *really* needed support and love at this time. Of course\nMy Mum did too. I thought we’d share our grief. However, my Mum just wasn’t there for me at all. I struggled when we talked, because she never asked how I was doing with the death of my father. She did talk about how *she* felt, and I wanted her to talk to me about that. But there didn’t seem to be any time for me to receive any kind emotional support whatsoever from her. I was always the one to talk or start a conversation she never initiated it. Even when I called her and she’s was busy and said she’d call me back, she didn’t.\n\nI found myself calling her less frequently and then feeling bad about it, but at the same time, becoming silently resentful because of her seeming to have zero common sense and practically ignoring the fact that I’d lost a parent and that we needed to help each other grieve. To make matters worse just over a month after my Dad died she’s got into a new relationship with my uncle! My Dad’s brother! I was so fucking angry and felt as if they had both just betrayed him. They were so close already that I suspect that they were having an affair before he died. That was the final straw. One of the things that my Dad had done for me before he died was give me money to buy a few properties so that I could rent them out and have a steady source of income every month and live in one of them. After my friends helped me with my grief instead one of them who lives in Sweden suggested that I move there and see it as a “new start”. I did the math and realised I could afford to rent a one bed flat/apartment in Sweden with all the utilities paid for from using the money I got from renting out my other properties. So I just did it. I moved and told no one. Of course after a while she noticed I wasn’t living in my flat full time (I still have it and stay there when I visit the UK as I split my time between the two countries). She asked where I was and I explained everything. She obviously said I was an asshole, but then I got a call from my grandparents saying the same. So am I?", "created_utc": 1670351268, "permalink": "/r/AmItheAsshole/comments/zee1el/aita_for_moving_to_sweden_without_telling_my_mum/", "score": 157, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Because I moved to another country without telling my mother and wouldn’t have told her had she not already found out.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Feel free to ignore her or say \"Mom, if you had made an effort to actually ask about my life, I would have been happy to tell you. You expressed no interest in me at all since Dad's death so I assumed you didn't care. That's on you, not me.\"\n\nBTW, I totally know how this feels. When my MIL passed (she was my surrogate mother because mine was abusive), my FIL made our grief all about him, even going so far as to tell us that he was the only person entitled to grieve and our feelings of loss were irrelevant. This ended up destroying the relationship between him and me and my spouse. He refused to get grief counseling and remains an AH to this day. We are LC and it sucks to lose both parents at once. So I'm sorry for both of your losses.", "NTA. Judging by the fact that you were able to move countries, you're an adult. You can live where you want.\n\nJudging by your mother's behavior too, it seems like she really took advantage of your willingness to be there for her. It's okay for her to be upset and lean on her loved ones- in fact, that's healthy- but the fact that she did it without so much as thinking to offer you support is completely scummy.\n\nEven as adults, children do not exist to be emotional support systems for their parents. You deserve the time and space to work through things on your own pace.\n\nHave you considered seeking a therapist that specializes in grief counseling? Having someone just to talk and help you get through it could be a massive help if it's within your means.", "I'm curious how long it took her to notice you were gone. \n\nEveryone has to grieve in their own way, on their own timetable. You did what was best for you. I understand your family's hurt that they didn't know about your move, but you didn't cut all ties. NTA", "NTA, I’m so sorry for your loss. What you did was brave to give yourself a new start. It’s your life and you needed time to process. You probably didn’t say anything to anyone bc you didn’t want anyone to talk you out of it or be negative.", "NTA. I think your way of healing is better than your mother’s, but that’s just my take.", "NTA your life choice you made life decisions for you well being", "NTA\n\nYour life your choice. I also fully understand why you did move.  But did you really think they wouldn’t be disappointed? It’s your family after all. Although it’s just a partial move since you split time between countries. It’s not like you went on the other side of the world with no chance to see you again.", "Grief changes people and makes them stupid pretty often, but that's no excuse for neglecting a daughter who is also grieving.   \n\n\nNTA \n\n&#x200B;\n\nI hope you find every opportunity for success and growth moving forward in Sweden. Know that grief, while it doesn't ever go away, is something you learn to carry better as time goes by, and it sounds like you're in a good place.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor some context, last June my Dad passed away after a long battle with COVID.  This loss affected the family greatly.\n\nI was devastated. I *really* needed support and love at this time. Of course\nMy Mum did too. I thought we’d share our grief. However, my Mum just wasn’t there for me at all. I struggled when we talked, because she never asked how I was doing with the death of my father. She did talk about how *she* felt, and I wanted her to talk to me about that. But there didn’t seem to be any time for me to receive any kind emotional support whatsoever from her. I was always the one to talk or start a conversation she never initiated it. Even when I called her and she’s was busy and said she’d call me back, she didn’t.\n\nI found myself calling her less frequently and then feeling bad about it, but at the same time, becoming silently resentful because of her seeming to have zero common sense and practically ignoring the fact that I’d lost a parent and that we needed to help each other grieve. To make matters worse just over a month after my Dad died she’s got into a new relationship with my uncle! My Dad’s brother! I was so fucking angry and felt as if they had both just betrayed him. They were so close already that I suspect that they were having an affair before he died. That was the final straw. One of the things that my Dad had done for me before he died was give me money to buy a few properties so that I could rent them out and have a steady source of income every month and live in one of them. After my friends helped me with my grief instead one of them who lives in Sweden suggested that I move there and see it as a “new start”. I did the math and realised I could afford to rent a one bed flat/apartment in Sweden with all the utilities paid for from using the money I got from renting out my other properties. So I just did it. I moved and told no one. Of course after a while she noticed I wasn’t living in my flat full time (I still have it and stay there when I visit the UK as I split my time between the two countries). She asked where I was and I explained everything. She obviously said I was an asshole, but then I got a call from my grandparents saying the same. So am I?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, though did you tell any of your family you were going?  Excluding your mom and uncle, I get why other relatives would justifiably be somewhat upset at this.\n\nIts your life, but if your close with any of your other relatives I think communicating what is going on, and why you left.  Could be beneficial.  They are most likely in the dark on some things.", "The first part of the situation would make you TA. Everyone processes grief differently. Just as your mom spoke about her grief, you could’ve spoken about yours. \n\nI changed my judgment after you disclosed the fact that she and your uncle started up a relationship that may have even begun while she was still married to your dad. So, what I want you to take away is this: allow people to process grief in their own way as long as it is not destructive.\n\nFinally, my condolences for your loss.", "NTA.", "NTA. But this is beyond reddits pay grade. You both need grief counseling, because it doesn't need to be this way", "NTA for not telling your mom since you don’t want her to have contact with you. But your other family members should have known if you are close to them. That part makes you an asshole for up and leaving and not telling anyone. That’s not very responsible of you.", "NTA, and welcome to sweden! You'll love it here, we're kind and open, and we have Fika!", "NTA. No one, including family get to tell you how/where or with whom to live your life. I'm sorry your mom wasn't there for you. Stay warm in Sweden 🧥", "NAH.  I’m sorry, but I cannot really fault your mom for not having emotional resources for you after losing her husband.  It would have been ok if you had told her that you couldn’t support her and that she needed to get professional help or whatever.  But his death clearly left her in a terrible spot and I can’t fault her for not having emotional energy to support your grief. \n\nI also can’t blame you for moving and trying to restart; that is totally your choice and you should do what is right for you.  I think you are perhaps being hasty in cutting people off as much as you have but, again, your choice.\n\nLest you think I have no idea what I’m talking about, I was a Daddy’s girl and my mom was utterly broken by his death. Just devastated. I was a huge amount of her support and, no, I didn’t get much from her.   But I didn’t expect it.  She lost someone she had been married to for almost 40 years; I’ve been married for 11 now and the thought of losing my spouse is devastating.\n\nYou both are grieving, and chances are that neither of you were exactly what the other person needed.  Now you can choose where you want to go from here.", "NTA for the question at hand, but it'd be great if you could stop judging how your mom is grieving.", "ESH.", "I’m sorry for your loss too. That sounds awful.", "It took her about a month and a half to realise I was gone.", "To be completely honest with you after my Dad died it seemed like the glue that had kept our family together had dissolved with his death. My mum’s utter lack of care and support after he died made me feel as if she didn’t really care about me at all. She hardly ever called me or visited me. Even if she’d just called to check in on me would’ve been *something*. It was almost like I didn’t even exist anymore. I know people deal with grief in different ways, I understand it was probably 10X harder on her than it was for me, but my fucking dad had died and she didn’t offer me support or comfort or anything, not even once! To then basically have zero contact with me in the months after, I assumed she didn’t care about me and wouldn’t care where I went or what I did.", "I didn’t really tell anyone except for close friends and my cousins who I’m close with. On reflection I can see why my grandparents would feel hurt by the fact I didn’t tell them but they mainly berated me over not telling my mum and how I wasn’t “being fair” and being “too judgmental” about her and my uncles new relationship.", "You mean by carrying on with her bil? I guess that’s one way to do it. Doesn’t mean OP has to like, much less accept it.", "My experience is that grief does really weird things to normal people. It absolutely sucks.", "Yeah, definitely, NTA", "Well acceptance doesn't mean you're ok with something. You're just acknowledging that it's happening. OP's mom can do whatever she wants. Just like OP can. \n\nAs a side note, turtles fucking suck.", "I guess that’s what happened here. I was always closer to my Dad, I was definitely a daddy’s girl, he was my hero. But I never thought my mum and I weren’t close or anything. I want to believe that grief changed her and made her blind my pain.", "That’s true, and appears to be what’s happening. I don’t think OP is TA for not telling her he was moving though. An engaged, but not estranged parent would know these things. Ngl, love your last sentence, they do! Take my upvote and stick around.", "Yeah, that would be my bet. Grief can sometimes really change people and make them hyperfocus on the dead and lose sight of the living. I'm sorry.", "NTA wtf u don’t need to ask permission to go anywhere", "my aunt is presently talking about how she is the one most greatly affected by my grandma's death (two weeks ago). bear in mind that grandad is still alive, she has two siblings (my dad and another aunt), who both have multiple kids of their own. and not only that, she hasn't visited or spoken to grandma since she went into a home like a decade ago!\n\nfucking ludicrous I tell you", "[deleted]", "NTA. You lost a parent, which is irreplaceable. She lost a partner, which in this case with her seems replaceable... \n\nGrief can do strange things to people but she had no right to monopolise grief and invalidate yours. In a parental relationship... she is the \"adult\" and you are the \"child\". You should've been her priority here. You didn't just lose one parent... you lost both of them, except one is through their own selfish behaviour. You had every right to move on in your life, just as she seems to have done so, and her being distant is the price she has to pay for not knowing this information.\n\nI am so very sorry for your loss and hope that your life in Sweden is more joyful and less dramatic.", "NTA. You are an adult, and if you want to move to the moon that is your right. The whole Mom/Uncle thing is icky, so I don't blame you for nit wanting to be around that. So sorry for your loss, I know your Dad is watching you and smiling because you are enjoying the legacy he left for you. Love, healing, and lots of happy adventures to you.💗", "NTA \n\nIt took her a month and a half to realize you weren’t in the same country as her… I can’t believe her calling you TA. \n\nTell her: “Maybe if you had returned my calls, you would have known.”", "you're so right, how selfish of OP, it's not like her dad died or anything", "Well she did get over her husband's death then started a relationship with her brother in law a month after the death and ignored the daughter", "What about the mother starting a relationship with her deceased husband's brother a month after", "Nta. Its really creepy that she got with your dads brother. Especially so sokn after his death. And she wasnt emotionally there for you. That being said it wouldnt have hurt to text her and be like hey i moved to sweden", "She did and hopped on his brother.", "> I want to believe that grief changed her\n\nWhat grief? Didn't she start dating your uncle a month after her husband died?\n\nHer actions are not those of a grieving widow. The disconnect between the two of you may be because she doesn't know how to relate to your grief. She's moved on, and is happy to be with your uncle -- while you are 'stuck in the past'."]}