{"id": 4209, "submission_id": "zfhw33", "title": "AITA for telling at my younger sister to stay the fuck away from my boyfriend after she tried to get him to spend the week with her instead of with me?", "selftext": "EDIT: I just wanna make it clear that these ARENT the real names of these people. Someone in the comments thought they had found my boyfriend based on the name I used for him. I don’t want people being involved in this just because I happened to use their name\n\nLong time reddit lurker here, I felt like I needed to post this for some outside perspective, hence the throwaway account and fake names. Here's a little bit of backstory.\n\nI (18F) have been dating my boyfriend Caeden (18M) for over a year. We met when he moved to my city to play hockey. Because Caeden isn't living with his family during the hockey season, he spends a lot of time hanging out at my house and family. My sister Kylie (15F)  comes with me to most of Caeden's hockey games and she wears his jersey. Last year, during high school Caeden and I would skip class to take Kylie to her therapy appointments then we'd all go out for lunch after. Since then Kylie always wants to tag along with Caeden and I when we hangout too.\n\nAt first I though it was cute, but I've noticed recently that she's getting a little too persistent.The other night she wanted to hang out with Caeden and I in my room while we watched a movie. She brings him up in conversation a lot more with me and apparently she's also been researching and keeping up with his hockey stats. \n\nCaeden gave me his hockey cards with cute little messages written on them, and I keep them on my bookshelf in my room. I noticed a few weeks ago that one of them was missing (The one that had 'couldn't do all this without you babe' written on it), and Kylie had it in the back of her phone case. We got into a fight about it where Kylie told me she didn't think it was a big deal because he was her 'favourite player'. \n\nI finally snapped last night when she started asking me if she could come with us on our trip to Montreal. (My best friend is turning 18 in a few weeks and my friends and Caden's friends are going on a road trip to Montreal so we can take her to bar and party all weekend) I tried to tell Kylie she couldn't come because she wouldn't be old enough to go out to the bars and clubs with us. That's when she texted Caeden and told him that I was being 'rude and antagonizing' her. Kylie asked Caeden not to go on the trip and stay home with her instead. After Caeden told me, I confronted Kylie and told her to stay the fuck away from my boyfriend. \n\nCaeden thinks that I'm completely in the right, whereas some of my family believes that Kylie is just a harmless girl with a little crush and that I took it too far.\n\nAITA for telling my sister to stay the fuck away from my boyfriend?", "created_utc": 1670455843, "permalink": "/r/AmItheAsshole/comments/zfhw33/aita_for_telling_at_my_younger_sister_to_stay_the/", "score": 1774, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Telling Kylie to stay the fuck away from my boyfriend \n2. I may be the asshole because I blew up at her and my family thinks it's just a harmless crush and she'd never act on it or mean harm by it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nI think you should start saying no to all of the hangouts. It sounds like she is getting a bit obsessive with him.", "NTA, and you need to set boundaries with her. That isn't a little girl crush. She's a teenager who is obviously in the feelings zone for your boyfriend. If he's on your side, then you both need to sit down and talk with her about the new boundaries, and if she can't respect them, well no more third wheel permanently.", "Three sentences in and I'm like, oh the Canadians have arrived lol  \n\n\nNTA- your boyfriend is uncomfortable, and your sister is cast adrift in the sea of her own hormones. You're well within your rights to tell her to get a grip and I think your parents should be reeling her in to, if they're around.", "She may have an “innocent” crush, but you do need to tell her to cool it. And you need to tell your boyfriend to support you in shutting down the crush. Don’t bring boyfriend around the house for a few months, go out or go to his place.", "NTA. I have been reading Reddit for so long that I know there would be terrible consequence of this action to just let it be. One would be the sister became so obsessed to the point of stalking, I mean, I'm not even surprised she try to manipulated your BF by telling you're \"rude and antagonizing\" for a good reason that she would not allowed in the bar. Have you watched Stalking Laura, this really show how bad stalking could be. Two would be your sister be successful in getting your BF and then your family would be shook but accept it anyways because they think is cute, I think, which is disgusting if that happens because it looks like she's a golden child.\n\n&#x200B;\n\nSo, its best if you drew the line as early as now because as young as she is, if people don't think what she did is dangerous, she would become a danger to others too. Or I dunno maybe she is trying to get brotherly love from your BF? Do you have an older brother?", "NTA.\n\nIt stopped being a \"little crush\" when she stole from you. She has entered into obsession territory. I would def keep her far away from your bf.", "NTA \n\nI would stop bringing Cardin around her.", "\"Harmless girl with crush\" is an oxymoron. Look what she's already doing, trying to weasel in between you two.", "NTA, your sister is kind of a creep. And by kind of, I mean a total creep, I don't have a sibling so I could be wrong but this seems to be very odd and abnormal. Im sorry your family is taking this very lightly and leaving you and your bf in uncomfortable situations.", "Dating myself hardcore but check out 1993 classic (Alicia silverstone) “the crush”…..\n\n\nNTA but maybe you should be spending more time with your sis (sans boyfriend). She’s only 15. Healthy connections/relationships (especially with siblings) go a long way towards self esteem/not boyfriend stealing. I am not suggesting parentification. my big sis would have eaten the kidneys of anyone who messed with me in hs. it made a big difference as to how I view both loyalty and relationships.", "NTA.\n\nI think there is room to take slightly higher ground and talk to her about boundaries and all. But that’s a big ask of you as a sibling. I wasn’t that calm at that age.\n\nRegardless, NTA", "NTA. \n\nToo many stories about sisters on Reddit.", "NTA. She's taking your things he gave you, and sounds like she's infatuated. Glad Caeden is on your side on this.", "NTA.  She's annoying af at the least.", "Nta", "NTA and I would prefer to NOT see the updated post about if you are TA by going no contact with your family because a harmless girl with a little crush ended up ruining your relationship...", "NTA. Not sure what laws are in your area, but she's a minor and he is an adult. All she needs to do is get mad and say he came on to her, touched her, whatever and then (even though its not true) his future will be down the drain. I would not, under any circumstances, allow her to go anywhere with you, be in your bedroom with the two of you watching TV, or be in any position where they are alone together, not even 5 minutes. Your parents need to take it seriously as well.", "NTA.  Your boyfriend needs to start being mean to her. Gray rock her, single word answers, Not smiling at her not talking to her blocking her on everything.  He needs to be the one to stand up and say to back off.\n\n If you do it it's just going to be oh She's just the jealous girlfriend.\n\nHe needs to smash herself confidence.  Take back his clothes, block her on everything take back anything else,  completely ignore her or single word answers or be flat out rude to her. \n\n I get he wants to be a nice guy but it has gone too far.\n\n She is full on fantasizing that she is the girlfriend. \n\nSo he needs to put his foot down and act like hes disgusted with her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLong time reddit lurker here, I felt like I needed to post this for some outside perspective, hence the throwaway account and fake names. Here's a little bit of backstory.\n\nI (18F) have been dating my boyfriend Caeden (18M) for over a year. We met when he moved to my city to play hockey. Because Caeden isn't living with his family during the hockey season, he spends a lot of time hanging out at my house and family. My sister Kylie (15F)  comes with me to most of Caeden's hockey games and she wears his jersey. Last year, during high school Caeden and I would skip class to take Kylie to her therapy appointments then we'd all go out for lunch after. Since then Kylie always wants to tag along with Caeden and I when we hangout too.\n\nAt first I though it was cute, but I've noticed recently that she's getting a little too persistent.The other night she wanted to hang out with Caeden and I in my room while we watched a movie. She brings him up in conversation a lot more with me and apparently she's also been researching and keeping up with his hockey stats. \n\nCaeden gave me his hockey cards with cute little messages written on them, and I keep them on my bookshelf in my room. I noticed a few weeks ago that one of them was missing (The one that had 'couldn't do all this without you babe' written on it), and Kylie had it in the back of her phone case. We got into a fight about it where Kylie told me she didn't think it was a big deal because he was her 'favourite player'. \n\nI finally snapped last night when she started asking me if she could come with us on our trip to Montreal. (My best friend is turning 18 in a few weeks and my friends and Caden's friends are going on a road trip to Montreal so we can take her to bar and party all weekend) I tried to tell Kylie she couldn't come because she wouldn't be old enough to go out to the bars and clubs with us. That's when she texted Caeden and told him that I was being 'rude and antagonizing' her. Kylie asked Caeden not to go on the trip and stay home with her instead. After Caeden told me, I confronted Kylie and told her to stay the fuck away from my boyfriend. \n\nCaeden thinks that I'm completely in the right, whereas some of my family believes that Kylie is just a harmless girl with a little crush and that I took it too far.\n\nAITA for telling my sister to stay the fuck away from my boyfriend?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, she’s young and maybe she doesn’t realize fully what the consequences of this are, but she’s homewrecking. Also telling Caeden you were mean to her is like asking dad to buy her a toy when mom says no. She needs to be told what she’s doing is wrong and weird, I’m sorry you’re probably gonna have to be the one who tells her. Firm boundaries would be helpful right now", "NTA. Be firm about your boundaries and make sure Caeden is on the same page. Your sister is overstepping and it's time to nip this in the bud.", "NTA", "NTA. She's definitely got a big crush,  and I'm going to guess not as harmless as she's trying to make it out to be.", "NTA. If you haven't already ask your parents for help. Gonna guess he plays in the Q which means unless he goes pro he's got another 2 years before he ages out. That's a long time to avoid your sister without addressing the issue.", "NTA. It may seem harmless to them but she's old enough to know that's wrong.", "NTA shes 15 for crying out loud, also she's definitely going to be make the bf uncomfortable.", "NTA\n\nYour sister needs to learn boundaries.", "NTA. This isn't a little crush, it's her full on trying to steal your boyfriend. Even stealing your things. I'd react like you as well, she needs to respect your boundaries. Maybe have your boyfriend tell her that he is uncomfortable with her attention, and maybe ask him if he could block her number maybe?", "She has a crush and she’s crossing over into inappropriate behaviour. NTA but maybe Your boyfriend should tell her to stop now she’s calling or texting him", "NTA, she's creepy crushing on him. She needs to know the rules.", "YTA. She is 15. A horrible age. Maybe your boyfriend needs to have a conversation with her.", "NTA- Keep her away. She can easily lie and say he tried something with her and people will automatically believe her.  Boyfriend needs to go NC with her now", "Yeah the only time she’ll be seeing Caeden in the near future is at my little brothers’ hockey games or from the stands at his hockey games", "I think I'm gonna talk to her with my mom, I don't want my poor boyfriend to have to deal with that. I think I can get my message across with having him there", "didn't realize that mentioning hockey would be a dead giveaway that I'm Canadian haha\n\nI've got my mom on my side thankfully and my dad just doesn't want to get involved at all", "I spending my three week Christmas break in Montreal and with Caeden's family, who live 8 hours away from us. Then after break he'll be playing hockey around the province for almost a month. hopefully that's enough time former to cool down", "yeah I lurk reddit a lot which is why I'm actually posting this. I want some advice before it escalates. I love my bf and I love my sister and I hope this can stop before it ruins any relationship I have with either of them", "To make it worse, she picked the only card off my bookshelf that had ‘babe’ written on it. If she really wanted his hockey card because he was her ‘favourite’ she could’ve taken the ones that said things like ‘from your fav player’ ‘you’re my motivation’ and ‘I play for you’", "It stopped being harmless when she stole in acting on it.", "Maybe I’m looking past it because she’s had major crushes on my guy friends in the past, but none of them have been too old for her. she’s crossing a line this time because it’s my boyfriend", "Yeah he’s such a saint. I feel bad because I know he always treated her like the little sister he never had", "Miss the days when she’d try to steal my clothes instead of my bf", "My sisters a survivor of sexual assault when she was a child and even helped me clear the name of one of my friends when he was falsely accused. I don’t see her ever doing anything like that, but after what happened I can definitely see her trying to make a move on Caeden. We’re gonna try our best keep distance from her for now", "Yeah we’re definitely on the same page, although he’s way more freaked out and sad about it than I may be", "Yeah my mom is helping us out with this. I love my sister and I want to stop this before it ruins our relationship or my relationship with Caeden. I’m only on a two year college program and we’ll probably be moving away in the next few years", "At 15 she knows right from wrong. Trying to steal your sister's boyfriend even if the odds are against her, is wrong and she knows it.", "My sister is a survivor of sexual assault, and she has helped me in the past clear a friends name after he was falsely accused. It’s not something I’m worried about. I think limiting contact is a good idea but complete no contact for the foreseeable future would only harm my relationship with both of them", "Not even from the stands. She does not need to attend Caeden's hockey games until she can learn how to behave. You can't stop your sis from going to your little brother's games, but Caeden's games should be off limits.", "It is not a harmless crush. You family are a bunch of idiots if they think it is harmless.\n\nShe is borderline obsessive. Be careful and be sure you boyfriend remains safe. Stop having him over and never let him be alone in a room with her - she personality seems like one that would scream rape or assault if he rejects her.\n\nTell her therapist.", "If he's involved at all, it should be in the role of the guy who tells a little sister that her advances are unwanted. It may come to that if she persists.", "Classic dad move.   \n\n\nI hope you have fun on your trip! Good luck setting some boundaries with your sister. That's a difficult relationship obstacle to get past.", "Just because your dad doesn’t want to get involved, dont believe for a minute that he isn’t. No doubt he’s seen/heard what’s been going on and that you’re moms already bent his ear about it. Most likely that whatever ‘side’ or stance your mom’s taking is his opinion as well. He’s just hoping that it can be sorted without him having to get involved and upset one of his little girls.\n\nNTA by the way.", "Show her some other Reddit posts where a sister has cheated with her sister’s partner. Just about every time it leads to life long estrangement, awkward holidays, etc. Surely she doesn’t want that dynamic for the two of you, if she were to really consider the consequences?", "Your being a good sister by teaching her the importance of boundaries. Stand your ground. Keeping some distance between the two of them is definitely a good idea", "Yeah. That was intentional. I can only imagine the fantasies in her head.", "I agree!! its about perspective, and now you are seeing her in a brighter light.", "I can see that.  Don't have sisters so can't really compare on that; but I have a friend who stalked guys when she was a teenager (she's over it now as an adult) and this reminds me of that.", "I wish it were that easy. Caeden plays for a CHL team. If she’s out with her friends she can go to the games and buy tickets. It’d be hard for me to catch her in an arena that size too. The best I can do is get Caeden to ask her not to go", "Seconded here. Definitely inform her therapist about this, as it's unhealthy and a HUGE boundary overstep.\n\nNTA. And your family members are being ridiculous if they don't acknowledge how inappropriate she's being.", "He is involved, and he needs to be in that conversation cause I know teens and they don't take to siblings telling them to back off for any reason. He also needs to voice it so she doesn't create her own narrative and go running to him, which she obviously has in the past.", "Thank you. I’m looking forward to a week long bender after all this shit", "I would not be surprised is my mom told him not to get involved. He’s got a track record of escalating thing when he thinks he’s being helpful. I’m kind of thankful he doesn’t want to deal with this", "she's so young I don't even think she's planned anything. I think she's just obsessed with Caeden and that's it. Or at least I hope. and I hope keeping him away from her will stop it", "Oh god. I’ve been trying not to think about that", "She’s been through a lot, especially when it comes to guys and sex and relationships in general. That’s why I’m not even considering cutting contact with her or moving out or getting Caeden to be rude to her. Conversations need to be had, boundaries need to be set and rules need to be made. I don’t wanna jeopardize a relationship with Kylie or Caeden", "Kylie could easily have almost any guy she wanted. But she wouldn’t be able to get Caeden and I hope that doesn’t trigger her to go full stalker or something. It’s bad enough that she can literally google him (which I’m pretty sure she has been doing) and get a bunch of results.", "Oh that is a tough situation!! I don't know that getting Caeden to ask her not to go would be a good idea, because she'd blame you and tell your parents and they'd yell at you too.", "I think we have the same dad.  Hello sis?\n\nedit: just realized someone might take this as me being the sister in the post.  Im kidding.", "Infatuated would be an apt word.", "NTA.  I don't think you should feel threatened by your 15 yo sister but you do want to put a stop to it.  At a minimum she's making g herself look foolish.\n\nWith all the puck bunnies at the rink, you need to feel more secure in your relationship.\n\nP.s.  I think you should use an alias for him, btw.", "The worst she can do from the stands is stare at him. If Caeden doesn’t want her there I’ll back him up. But I’m not too concerned about her just watching", "I’m confused about the alias part. I what sense should I be using a different name for him?", "I hope it gets figured out soon. I'm sorry that your parents don't have your back on this one. As another commenter said, your sister is teetering on the edge of obsession.", "Because it was trivially easy to find an up and coming 18 year old Canadian hockey player with that first name by Googling those few details, so if that's his real name, sharing this personal story about that guy might not be awesome.\n\nEdit: sorry about the situation with your sister though, you're NTA in all that.", "Caeden isn’t his real name. I used a weird spelling of a normal name because I know people on Reddit can be great detectives.", "It is the epitome of a [junior hockey name](https://www.si.com/.amp/extra-mustard/2019/05/03/friday-hot-clicks-whl-draft-names-kaden-cayden-kayden). They've got every kind of Caydens/Kadens/Kaydens etc. on tap.", "NTA stand your ground.\n\nPlease tell me you got the card back? \nAnd if not, do so regardless of how upset she gets. It was a gift to YOU that she STOLE.", "NTA.", "NTA your sister acting inappropriately with your boyfriend. She stole from you and text your boyfriend to stay with her. He needs to block her number and you guys shouldn't let her hang out with you anymore. Never leave the 2 of them alone. You sister could start a nasty rumour getting him in big ass trouble. Good luck I think you have a tough roads ahead", "NTA It sounds like there are some boundaries needed here.", "NTA this sounds like the plot to “Swimfan 2 - the hockey horror”\n\nShe is 15 not 5. She knows what she is doing. She has a crush on your BF and is trying to get together with him", "NTA. 15 is old enough to know better. Limit het interaction with your bf in future.", "NTA. But… Honestly, it’s your boyfriend’s responsibility to set limits. Beyond that, would it be so cute if you were, say, 25 and she was 22? It’s inappropriate. But Caeden is a living breathing human being, right? So it isn’t your job to set limits for him. He shouldn’t be only telling you. He should be telling *her* and it doesn’t sound like he’s doing too great of a job of that.", "NTA. \n\nYou have your life to live and you’ve found a boyfriend to enjoy your life with. While it’s great of you two to let her tag along, it sounds like she’s getting obsessive about Caeden. To the point she thinks it’s ok to ask her older sister’s boyfriend to stay home with her. So very inappropriate and clearly she does not understand boundaries. \n\nBut she’s 15 — so some of this is likely just hormones. And also in therapy…which you don’t need to disclose why. So it sounds like there may be some other things going on, not just an innocent crush thing. \n\nWho is this “some of my family” who think Kylie’s actions are reasonable? Don’t listen to them. Even if they’re your parents. Your relationship with your boyfriend and your boundaries need to be respected. If your parents are not aware of Kylie’s behavior, I would tell them now before this gets even more out of hand.", "NTA. Can you let her therapist know about her creepy behavior?", "NTA.   Your family need to realize she’s 15 not 10 years old with a crush.  Stop letting her go everywhere with you.", "NTA\n\nShe is not a little girl. She is 15yo, and is pinning on your BF.\n\nTime to set boundaries with your sister before it's too late.", "NTA\n\nYou are completely right. She clearly has a crush on your bf and her age doesn't excuse her behavior. She is being extremely inappropriate. Your parents chocking it up to a harmless crush are being willfully blind. She actively texted your bf to ditch you for her, after wanting you to take her out drinking and clubbing and you saying no. \n\nShe needs to learn now that in the real world, the way she is acting could be met with more than a few cuss words.", "No, NTA. It’s time to stop letting her hang out with you guys at all. Ensure Caden blocks her from his phone and all social media. She had an unhealthy fixation on your bf and this will not end well if he doesn’t put a stop to this immediately", "Yeah no! NTA\n\nWe all have “inappropriate” feelings, at whatever age and for whatever reason towards someone or something, that alone does not make you an ahole.\n\nWhat makes a person an ahole is how we act on those feelings, and your sister at 15 knows right from wrong. What she did was wrong and she knows it. Your sister was an ahole in her behaviour.", "Hockey + moved for hockey = Canada.", "Given everything that is happening with Hockey Canada, I would be worried too. It’s a « good time » to pull something like this.", "Would you say a woman has to tell a little brother his advanced are unwanted? Stop victim blaming", "Not always Canada, but always a solid guess that it’s Canada.", "This sounds like the beginning of a psycho thriller “hand that rocks the cradle” style", "Yep, 100%. Mom, Big Sis and BF need to sit her down and say \"This is enough, it makes BF really uncomfortable when you act towards him the way you do and it's coming to an end.\"\n\nNo more time as the third, no more hangouts, he blocks her phone number from his cell, they don't spend any time at the house. And her therapist should absolutely be looped in on this, because it's time for lil sis to learn how to handle rejection with a healthy mind, and to not become obsessive over people - period.", "My question is why does she have your boyfriends phone number?? I would have him block her on everything to be honest.", "NTA\n\nMake sure your BF isn't in a situation where he's alone with her. She could falsely accuse him of something if she doesn't get her way, and whether or not any/all of your family fall for it, it will taint the relationships you have with him and her.", "NHA your sister is being inappropriate, but also she's a kid, so I wouldn't hold it too hard against her. That being said, it's totally within your right to draw boundaries with her when she is making both you and your boyfriend uncomfortable. My biggest concern would just make sure that none of this escalates too far, because from the sounds of it currently no permanent damage has to come to anybody's relationships once she matures a little.", "No, and I think that you need to stop allowing her to hang out with you and your boyfriend.", "NTA. You should’ve put the kibosh on her behavior way before this tbh.", "NTA\n\nNow is the time for Kylie to learn her behavior is deeply inappropriate.", "NTA", "NTA. But it has to come from Caeden. Not you. He needs to tell her that it's not gonna happe. Period.", "Harmless crushes aren’t harmless when they make you lie, steal, and cheat (even if it hasn’t happened yet, I’m going to go out on a limb and say she wouldn’t mind compromising your relationship). NTA, and your family shouldn’t be enabling her.", "NTA. Your boyfriend has to talk to your sister and tell her, \"hey, I appreciate you but I'm not interested, you're just my girlfriend's sister\" or something like that, the thing is he has to break her heart (AND.. everything has to be on record, so that she can't make anything up). Your sister has no boundaries, and you're not going to stop her, but he might.", "NTA\n\nI would tell your parents she is trying to push for a relationship with an adult who you are dating and tried to cause an argument between you and him by lying. They won't be 'its just a crush' if she tries to kiss him when alone with him. Situations like this and where the one with the crush has their heart broken by the one they're crushing on can end badly when the first person is a minor and doesn't understand some words have consequences (I.e. If she says in the heat of a moment a certain lie that can ruin his life. Happened to a family member when he turned his sister's friend down and said friend waited until he was out to say she lied)", "Do you think you and your bf might want to tell her off (so you speak) together? If you are the only one saying anything it probably just looks like you are jealous of your little sister. It might have more impact if the bf says he's not interested and her behavior makes him uncomfortable.", "NTA, sounds like your sis got a crush that has gone too far. I agree with others that she does indeed need to keep her distance from him, it appears her feelings and actions became inappropriate. Best of luck to you!", "I'm so sorry. \n\nYou're NTA, but your sister is fucking your boyfriend", "NTA.  It’s time to have your parents tell her that no intelligent reasonable 18 year old man wants to be with a 15 year old girl.  It doesn’t matter if it hurts her feelings.  She needs to hear the hard truth.", "She’s 15! Of course she’s obsessive. Caeden needs to be straight with her and explain he’s not interested. You being the one to tell her off will just fit in with her star crossed lovers fantasy. She will grow out of it. I’m not sure Caeden isn’t loving the attention.  Screaming and drama is not the fuel you bring to a 15 year old’s fire ( which by the way is not a harmless crush)", "Kind of an AH. She's literally still a child, and clearly has some issues because she needs some type of therapy. She probably just needs a sit down, and a stern conversation on why what she is doing is inappropriate. And to not exit the conversation with her until she offers proper feedback on if she understands the situation or not. A clear, \"You need to understand why this is not appropriate and here is why, and it's not your fault thay you feel this way but you can not act out on all of your emotions because all humans must exercise a moderate amount of control and I expect not to see anymore of this behavior or we will have this conversation again do you understand?\" The younger sister just needs to process her emotions and family members to help her with that. Without clear communication and support, who knows what kind of complexes she'll develope as an adult.", "Also, a lock on your door if you don’t already have one. She needs clear boundaries established.", "I think it’s very important that your bf is speaking up to your sister. She needs to hear it from him, not only you.\n\nNTA\n\nBy the way: your story sound like that your sister has an obsession with your bf and needs to be stopped asap.", "Why would your parents even agree to send their teen on a drinking rampage in Montreal anyway? (I hope you have a nice trip! But don’t let your boyfriend do anything stupid, it’s a tough year for drafts) \n \nYour sister is being ridiculous.", "Nah, granted I’m not too far south of you, my state is known for hockey 🥰🏒 \n\nMake sure Caden is never ever alone with her. Ever. For his own safety, and he really should let his coach or another trusted staff member of the team what’s going on just in case your sister pulls any stunts that could get him in trouble.", "Strong feelings change people for better or worst. It’s a good idea to be cautious and warn your BF against ever being alone with her. For his safety.", "I was thinking the same thing.    \nShe’ll either try something then claim he assaulted her when he rejects her or get pregnant to someone else and claim it’s his", "I'm not the person you were responding to, but I'd say yes and it's not victim blaming. No one is blaming Caeden for this behavior.\n\nBut when a child is crushing on an adult, I think it's prudent for the adult to have a solid voice in explaining that this is inappropriate and unwelcome. That way the child can't pretend the adult is really interested and it's just these jealous a-holes standing in the way. Of course I absolutely don't think that conversation should be had with only the sister and Caeden. But I think it would be helpful for Caeden 's voice to be heard", "Your boyfriend is wise to create distance, even more if he can. It's important they are never alone together because even the potential appearance of something untoward could ruin his life.\n\nNot for a minute. She doesn't have to do a thing to make rumors fly and the age difference DOES matter significantly.", "NTA", "My toxic flying monkey sister started the same way. I've been married 3 times (I'm old) and she tried to come between all three three and myself. I had to cut her out of my life - haven't seen or spoken to her in more than 10 years. It will be another ten before I do. Watch your back.", "NTA. One day she will make a move on him and if he rejects her can can cry wolf and say he did something. Keep her away from him.", "NTA at 15 she is just beginning to explore her sexual power.\n\nIt’s critical that people around her hold her to high standards of morals if they don’t want her to start breaking up families or behaving in other destructive ways.", "NTA. You,bf and mom need to sit down and establish some boundaries. She is not a \"little girl\" and is clearly trying to do something. Bf is uncomfortable about it, you are too. Make sure bf is involved in the chat. That way she doesn't go off into La La land and make her own crappy story in her head and still keep pursuing him.", "This is not a healthy obsession. NTA", "NTA and I think it is time to have a sit down with little sister to discuss boundaries and how messed up it is for her to essentially be willing to betray her family over a crush. I’m sorry but your sister is a Reddit post subject in the making (i.e.— sibling cheated with partner). I feel it’s important to get ahead of this type of behavior instead of blowing it off like it’s ‘just a little crush’. If no one teaches her how wrong it is to go after someone who’s involved with someone else, how will she know? Honestly, these are the types of interpersonal morals that parents often overlook teaching and then they’re all surprised when the crap hit the fan. In addition, it’s not as if she’s some 10 year old kid with a crush and has some older sister envy. This girl went so far as to basically proposition her sister’s boyfriend when there is only a three year age difference. If she can do this, then she’s old enough to know better. 15 is plenty old enough to know right from wrong and be taught not to become a  ‘home wrecker’.", "NTA\n\nWhen a someone (even a teenage girl) takes a crush too far, they're not longer harmless.\n\nShe might be a teenager and a minor but she's trying to instigate an affair, to break up your relationship, and stealing from you to fuel her imaginary alternate reality.", "Nta Your sister is on total b.s...", "NTA. After reading your comments I also want to applaud you on how mature you’re being about this as well.", "NTA. Your sister needs to learn consent and how to move on.", "OP, I don't know the nicest way to tell you, but she wants to fuck your boyfriend. Like, badly. You're NTA, for telling her to fuck off/back the fuck off for openly trying to steal your boyfriend.", "lol. ESH? \n\nstay the fuck away from your boyfriend seems unnecessary. \n\nbut i have no idea why she thinks just because hes her favourite player that she gets to go on trips with him. thats not how things work lol", "WTF is wrong with you?", "He has to be there. If not, she will easily think that her behavior is not a problem for him and it's just you and your mom that don't want her happiness", "I would not include him initially", "Based on the card she picked and the fact that she felt confident enough to not only tattle on you to him, but outright ask him to ditch your trip for alone time with her (like he would actually say yes?), has me a bit nervous that this is going past obsession and into delusion. Like she thinks he is in a relationship with her and you are the one \"tagging along\". I hope I'm wrong.", "I grew up in the Northeast and didn't peg you for Canadian until you explicitly stated your bf plays for the CHL. Just hockey things 😂", "The simple solution here is to have him absolutely crush her spirit by text.\n\nI'm not interested in you and never will be, I actually find you quite annoying and creepy pls stop texting me. I've only entertained our conversations because im being polite because my gf is your sister but I won't be doing that anymore. I'm going to block your number now so dont even bother replying.\n\nSomething like that should work.", "Too much time on this sub?", "yes!!! at 15y she May twist such \"fairy tales\" that could End very badly", "I feel the same way. The 15 y old is treating her sister as the third wheel. That is so not ok.", "You are sweet. She texted your boyfriend badmouthing you when you told her no about the trip. She invited him to stay with her and to ditch you because she was hurt, like you were the third wheel. I understand that she's your sister and she's young. But she's already 15 and she knows what she is doing, she just doesn't realize the consequences of her actions in the long term.", "If she has trauma related to sex and is behaving inappropriately you MUST tell her therapist.", "Have you seen Swim Fan?", "Totally agree. He souldn't even answer to her texts", "NTA id be extremely uncomfortable if, as an 18yearold man, a 15 yearold was texting me. Bf needs to block her", "NTA this is how it all starts, I’d stop letting her hang out with you at all, she’s getting obsessive", "You don't necessarily need to be angry about this, but you do need to be very clear and direct. She's just a kid, a teenager and probably isn't a bad person. I know the relationship between sisters is complicated, especially at this age.\n\n&#x200B;\n\nSit her down out of the blue, don't schedule it. Tell her in simple words, no yelling, that she has a crush on your BF and it's not appropriate and she needs to get over it. Simple as that.\n\n&#x200B;\n\n'I think you have a crush on Caedan, and it's making both he and I and everyone else uncomfortable. What can we do about this?'\n\n&#x200B;\n\nShe'll start making excuses and stories, but stick to the point and be clear and simple and calm.", "Caeden and you need to find a time to talk to Kylie together.  Caeden needs to tell Kylie he is interested in you, not her.\nHe needs to clearly express that suggesting he stay home with Kylie is creepy and it embarrasses him to think he's done something that encourages her in this sad fantasy.  \nOrdering her to stay away is a challenge. \nHelping her come to the conclusion that she is out of line is kinder and gives her agency to stop her obsessive behavior.", "Nta nothing wrong with setting boundaries and she's not that little . I would have caden say something to her  something gentle but something to crush any hopes she may have of being with him", "The boyfriend needs to block her on everything. If she has an obsession with him he is at risk of being put in a very shitty situation where his career can be in jeopardy. \n\nSadly it’s normal for girls to have crushes on “older men” they just usually don’t have access to them to do stupid shit. She needs therapy though.", "NTA, Bf needs to tell sis that it ain't happening between them.", "NTA\n\n\nBoundaries…..", "NTA", "Your boyfriend needs to block her number", "NTA.\n\nThis is SO last century but I just started thinking about Jennifer Jason Leigh in Single White Female. The plot is different, but dang, once the mind starts obsessing, it is hard to make it stop.\n\nOP, hoping your younger sister is not really disturbed. Be smart and careful just in case.", "NTA. She needs to get a grip.", "NAH leaning towards YTA bc you acted out of annoyance and most likely jealousy and not with the intention to protect your sister from being hurt. \n\nYour bf has an obsessed admirer, that she is your sister doesn't matter so much. He is the one who should turn her down. You turning her down for him will not solve the issue, she will only become obsessed about the idea that he is in fact secretly in love with her and you are the reason he can not be with her.", "NTA\n\nYour sister may be a harmless girl, but this is more than a little crush. This is almost obsessive. I’m disappointed your parents haven’t shut this down. Thankfully it sounds like your boyfriend is trustworthy. For your BF’s sake, he must **NEVER** be alone with your sister. Even for a moment. Even if it’s just you went to the bathroom while he is in your house.\n\n\nUntil your sister gets her head on straight, it would be pointless to take the risk that she might try something she could twist if it failed. You don’t want him blamed for something in a he-said-she-said.\n\nIt would be better if you and he hung out somewhere other than your house from now on.", ">my family believes that Kylie is just a harmless girl with a little crush and that I took it too far.\n\nAre you kidding me? NTA. She's not eight.", "NTA This isn’t your bf’s fault or responsibility but he needs to avoid doing anything that she can use to convince herself he’s encouraging her.  No more texting, erc.  If she got his jersey from you maybe take it back.  Sister needs to find her own bf.", "By \"taking it to far\", did they mean that you abondened her in the middle of Death Valley in Nevada? Because telling your sister with some slurs and in harsh words, that she should stay away from your bf, is not \"taking it to far\", but normal behaviour between siblings. I would also seriously recommend to ghost her a few days or being nasty for a few weeks.\n\nNTA. She is behaving bad, teach her consequences as good siblings should do ;)", "NTA. Block her number on his phone before she tries to pulls any more stunts. Set firm boundaries. No more third wheeling either.", "NTA, Caedon needs to worry.  There have been a lot harmless little girls with a crush who don’t get their way, or get turned down and retaliate by making false accusations.", "This isn’t a little crush, she believes the relationship can exist and is trying to make it happen even though he’s an adult and she’s a minor three years his junior who is dating her sister. She’s at the stage she’s likely doodling ”Mrs Caeden “ in her notebooks. Any milestones in the relationship between him and OP, Kylie is going to react badly because it’s a milestone she wants to have with him.", "Enjoy your trip, but I thought you were in like Buffalo or Albany or something cause that’s why *we* went to Montréal at 18\n\nI hope he’s billeting with someone else and I do think you’re handling it the best way", "And how exactly is OP supposed to stop her from going to public events in a legal manner without getting a restraining order? This isn't even remotely doable...", "Quite possible. In some cases one parent my try to appear “neutral” so the errant child doesn’t have to feel like “everybody is against me.”\n\nOr as OP says, if his solutions tend to be over extreme…", "I grew up in Northern Kentucky and thought either Canada or one of the more northern US states. Then again, I also grew up with a couple hockey players.", "Use the term infatuation. She’s in love with the idea of being with him, not the reality of a relationship.", "It would probably be better to just ignore that rather than have your boyfriend specifically tell her not to come to games. The games are open to the public and she can attend if she buys tickets just like anybody else - it could help her realise she isn’t any more special than any other person in the crowd and crowds make you anonymous. Singling her out for Caeden to tell her not to come will have the opposite effect, she’ll feel special and noticed and might well do more and more things to keep being noticed. If Caeden politely ignores her existence and doesn’t react to any of her attempts to get his attention, she’ll move on.\n\nKeep saying no to her joining you on hang outs, keep her out of your room, if she has Caeden’s number he should block her.\n\nThere is obviously a reason your fifteen year old sister is attending therapy so regularly. This is not likely to be malicious.", "Trying to find someone off reddit based off a post assuming theres no alias is..a bit creepy im ngl", "“Harmless girl with a little crush” nah, your sister is 15, not 5. She knows right from wrong & even though you can’t really control crushes or how you feel you CAN absolutely control how you behave and act while having those feelings. She’s being obsessive & crossing major boundaries. NTA !", "nta i wouldnt let that slide if i was u", "Your boyfriend is an adult. Anything your sister wants from him is illegal, and any scandal she creates could destroy his life and career. Hang out somewhere other than your home.", "NTA\n\nBoundaries need to be set, don't allow her to hangout with him anymore at all. Until she falls out of the little crush, cuz a little crush could definitely become a bigger not so harmless crush... or obsession.", "NTA. She's obsessed with your bf.", "Nta. I was your sister at that age. I'm not proud of it but I was. She's not a harmless little girl, she know exactly what she doing.", "Nta stop hanging with your sister and don't take her to her therapy anymore. She sounds like she's becoming obsessed with him. \n\nHave you talk to your parents? \nThey need to tell her therapist about her behavior. Also does your family also know she's calling your boyfriend or texting him.  Stilling his picture where he called you baby.  This it's normal healthy behavior.  Your boyfriend needs to block her number and be careful.", "NTA. Enough is enough. Her behaviour is unacceptable and boundaries need to be set up. She should realize she's your sister first and your boyfriend is not a shared commodity.", "Obviously shes jealous and has an obsession with him. I know you said that you and your mum will speak to her about it but maybe have your BF say something too, like “i like you as a friend but I need you to give me and my GF space, I don’t like you that way “ etc. it will probably break her heart and be mortifying but its what she needs lol", "NTA. If your boyfriend is on your side then she’s probably making him uncomfortable. You need to look out for him.", "NTA\n\nEven your family members telling you to back off are admitting you sister has a crush on your bf, so yeah she needed a reality check. Good thing is, your bf doesn't seem to be entertaining her, since he is telling you what's happening, so I guess your relationship is safe on this point.", "NTA- I think it’s high time to create some boundaries and distance and stop including your 15 y.o sister in your time with your boyfriend. She is misinterpreting kindness and friendship with romantic interest- and you never know how far a 15 y.o is willing to go. \nBe smart- it sounds like even Cardenas is a bit uncomfortable with the amount of attachment your little sister is directing toward him.", "NTA\n\nI saw in an earlier comment you said she wouldn’t be around him other than watching games but I think it should be said that they definitely should NEVER be alone together. She’s obsessed and just an accusation of SA will ruin his life.", "Caeden may also have to be blunt with her as well. He needs to tell her that while he cares for her as a sister, he is not interested in her romantically at all. And then, he needs to avoid her. Right now it sounds like you're just being possessive. She needs to realize that he feels the same way you do. NTA", "NTA - your sister is obsessed and it's not cute. Do not let this turn into a horror movie. Please keep your boyfriend away from her.", "NTA \n\nYour sister needs to learn boundaries and realize that Caeden may like her ok as your little sister, but he certainly doesn't see her as equal to you. He may want to consider telling her that he is dating YOU, and her behavior is inappropriate, so he will be blocking her.", "NTA. I agree with the other posters here that Caeden needs to block Kylie on phone & social media, and not to have any contact with her. Definitely let Kylie's therapist know about this situation!\n\nI suspect Kylie's motivation is that she's spinning a tale about having a hockey player boyfriend to impress her friends and gain social status at school. That's probably why she stole OP's hockey card & had it in her phone case--so she could show off at school. I'd be curious to hear what her classmates have been told about this \"relationship\".", "Stop letting your sister hang out with you and your boyfriend.  She is infatuated with him.", "Anyone else wondering if something hasn't already transpired between the boyfriend and little sister to cause her to suddenly go from zero to full on fatal attraction? I realize kids and hormones and logical thinking tend to run unchecked, but it IS possible she's not crazy here and it's possible there have been moments of either intentional or unintentional leading her on. I don't think it's right that because she's in therapy (we don't know what for and don't need to know) she automatically takes the heat on all things off putting here. Way to maximize the stigmatizing. truth is if she regularly sees a therapist she probably has a much better grasp on what's going on here than anyone.", "NTA, you family won’t think it’s cute when she starts getting more aggressive", "NTA but you're going wrong about it. It's him, who should clear it with her. I'm sorry, I'm your sister's boyfriend, I like you as a friend and nothing else. Because she clearly won't listen to ger sister, thinking he definitely would rather spend time with her than OP or some teenage made up shit. She needs a straight forward talking, if not with both of them.", "NTA, your sister is a weird egg. \n\n(also this gives me Letterkenny vibes)", "NTA. It's not a harmless crush. Tell your family that a harmless crush is when someone has a crush but never acts on it or interferes with that person's relationship. She's stolen his gifts to you, has bad-mouthed you to him in an attempt to turn him against you, and is now trying to separate you physically. She is *actively trying to sabotage your relationship*. Ask them how that qualifies as harmless.", "It sounds like little sis has a crush. Definitely time for Vayden to gently let her know that the attention is making him uncomfortable, and for both of you to distance yourselves from her.  You've said your piece to her - close the subject and refuse to engage with her.", "Nta\n\n\"Harmless crush\" is how it starts before it becomes \"harmful crush\".\n\nConsidering she's already tried to interfere in your relationship, she's probably already there.", "NTA. With all the sexual crimes that have been happening under the radar with Hockey Canada, you should tell Caeden to inform his coach and his organization. As it is, your sister could attempt to spread information that could harm Caeden's life and career. \n\nNo more alone time and I would advise Caeden to block her on everything and document everything that has been going on. Too many stories of slighted girls going for SH/SA claims going around right now, and later finding out that it was all lies because girly was mad because of the rejection. Better be safe than sorry. \n\nHockey Canada is in great turmoil right now considering the scandals of the last few months so they might react in an expedite manner if there is even the whisper of any wrong doing on Caeden's part, even if untrue. They cannot allow indecision now, not when they are under such scrutiny. Being a hockey fan since I was a child, I almost boycotted hockey when I heard about the rape culture within. \n\nHave a great time in Montéal! I am from there and am a bit older so I do not know what bars are in and safe anymore and have never been one for the bar scene. I wish you all the best, be safe. \n\nIf you wanna catch a hockey game at a sports bar, try to book at la Cage aux Sports downtown. They have online booking so no need to call and speak French, however in Montreal, English is not too muvh of an issue. The ambiance is great when the Habs are playing. Any Cage is great for hockey games, but the one Downtown is close to the Bell Center🤗", "This is not a crush this is a obsession and she wants your bf. So nta", "Obsessed much, how is it a harmless crush when she’s asking the guy to ditch his gf friends and family and spend the time with her? Doesn’t sound harmless more or so likes she’s going to throw herself at him and try and trap him", "LOL, this right here. Sis has the maple fever.", "Agree, NTA. Check into the age of consent where you are. I think your sister is behind boy crazy, and a rejection by you and/or Caedon could lead to some bad situations. She could accuse him of almost anything.", "She's beyond obsessed, but that's 15 for you.", "You should probably stay away from schools", "Yeahhh my little sisters “cute crush” on my high school sweetheart turned into her trying to sleep with him and then lying and saying that they did sleep together even though I was in the house and my hubs (now) told her in front of me to “get the fuck away from him and stop trying to ruin the one good thing in his life.” Weve been married for five years with a little one and nc from my sister for four years. Oh! And we were raising her as her guardians at the time.", "The hickey reference and your boyfriend living away from home. I immediately guessed CHL, then the Montreal.reference sealed it (and had me rule out a Western province 😂)\n\nNTA. The problem is your sister has a fantasy level crush (big hockey star) on your boyfriend and it makes it complicated and weird but she should absolutely be backing off and you did nothing wrong", "Is your boyfriend playing for a QMJHL team?", "It’s the billet that scrams Canada", "Definitely. Proper communication, setting boundaries and shutting down with limited contact if nothing works is good idea.\n\nPeople are too quick to suggest breaking off relationships or going NC. Even if other person is being TA, it doesn't always have to result in just shutting down the relationship, specially if you care for them.", "Or Detroit. Or any USHL or NAHL city.", "We have his in Wisconsin/MN also. Very much a thing.", "I'm in Ontario and we went to Montreal.vecsuse the drinking age is 18 as opposed to 19 here.", "I’m thinking OHL because of the trip to Montreal to be old enough to drink.", "I think it'd be best if he didn't talk to her", "He should block her on his phone and SM- No professional hockey player needs a underage girl to send him messages", "This is a bit petty, but think she'd stop going if she had to buy tickets because she'd eventually run out of money? Him telling her no and no one helping her may give this a natural end", "in the back of the phone case? defo telling friends they have a thing", "I’m in Detroit and we would cross the border to Ontario to drink at 19 until we turned 21 to drink in the States", "Ahhh - the tunnel Saturday traffic jam with all of the under 21 headed South to Canada and the over 21 funneling into the US for the cheaper bars!", "They don’t seem like the best parents since they expected their kid to skip school to take the other one to therapy. That should be the parents job. Or schedule appointments after school??", "For real!! I feel bad for OP and her boyfriend. Parents seem to expect OP to put up with her sister moving in on Caeden \"because she's faaaaamily!!!!!\"."]}