{"id": 4219, "submission_id": "zfeil5", "title": "AITA for not taking my youngest son on holiday with me.", "selftext": "My (m43) ex wife (f38) have two children together the eldest is a 12 year old boy and the youngest is a 9 year old boy.\n\nWe split up when our youngest was less than a year old, she left to be with another man and took our children, falsely accusing me of abuse to make seeing the children difficult for me.\n\nWhile I was able to start regularly start seeing my eldest son again shortly after she left, the abuse allegations were quickly shown to be false, she still did everything she could to stop me spending any time with our youngest son.\n\nHe has special needs, he's autistic with developmental delay and will never be able to lead an independent life. She used as a reason to allege that I wouldn't be capable of looking after him. We spent two years going up court, after which I was awarded every other weekend visitation, however, but that point I'd barely seen him in two years and I hadn't been able to develop the same relationship that I have with my eldest son.\n\nShe still behaves in a very difficult way with our youngest, deliberately arranging activities with him when during weekends he's scheduled to be with me, especially if he's due to spend any time with the rest of my extended family and refusing to let him visit my mother in hospital so she could see him before she died.\n\nMy eldest son lives with me because of how badly his relationship with his mother deteriorated when he was living with her. I'm taking him to Orlando after Christmas but not his brother. I do feel guilty about this but I have what I consider to be good reasons.\n\n1) I don't think my youngest son would be able to endure a long haul flight, it would cause him a lot of stress and anxiety.\n\n2)I don't have the same level of help and support that my ex has when doing activities with my youngest son.  She has her mother helping her a lot of the time and has a lot of state support. While I just have me.\n\n3) my eldest son wouldn't be able enjoy going to Orlando and going to the theme parks if my youngest son came because I wouldn't be able to go on any of the theme park rides with him because they're not suitable for my youngest.\n\nMy ex wife has kicked up a big fuss saying I'm a bad father for not taking him and said that I should have gone somewhere that was suitable for both of them.\n\nWhile I take her point about choosing somewhere for both of them, the reason I didn't was because I couldn't fully trust she wouldn't pull some bullshit to stop him from coming last minute.\n\nI also feel like she's just saying it because of how bad her relationship is with our eldest son, he doesn't want to spend any time with her. When I tell her she needs to do more to try to mend the relationship with him she lashes out and says I'm a bad father to our youngest. However, I feel like her relationship with our eldest is a result of her own behaviour, while my relationship with our youngest was deliberately sabotaged by her.\n\nAITA ?", "created_utc": 1670448586, "permalink": "/r/AmItheAsshole/comments/zfeil5/aita_for_not_taking_my_youngest_son_on_holiday/", "score": 84, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am taking my eldest son on holiday but not my youngest, it might make me the asshole because this is excluding my youngest son from an enjoyable activity\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your older son deserves some activities that are not compromised by his sibling's special needs. From your description, I don't think it would be a positive experience for your youngest anyway. The parks can be very overwhelming, and you would need two adults to provide adequate care for both kids.", "NTA. You’re not obligated to take both boys on every trip together. But it would certainly be nice if you could do something with your younger son at another time.\n\nKeep your contact with your ex to a minimum; and stop trying to control her behavior. I know you mean well, but there’s literally nothing you can say that will make her become a better mom to your eldest.\n\nDocument every time she sabotages plans with your youngest on your assigned days. And then take her to court to revise the custody arrangements.\n\nFinally, you might qualify for assistance with your youngest, given his disability.", "NTA. She caused the situation to be what it is, the oldest not wanting anything to do with her and the youngest not being able to spend time with you. She sabotaged the family. The situation sucks all around, but if she is not willing to cooperate, then there's only so little you can do.", "NTA. however, consider making a special day with you and your youngest, since you are getting one on one time with your oldest. There are a lot of sensory sensitive places now for children with special needs that I'm sure he would enjoy. If Orlando isn't appropriate for your younger son, there is no reason for him to go, but I would still plan on doing something special with him too.", "NTA. It sounds like your ex wife weaponizes your children against you, which is horrible parenting. She puts you in a situation where you know she won’t let him go, but gets angry when you don’t invite him.", "NTA.  I understand your reasoning in the decision making process and if everything you have said of the history is accurate I have very little doubt that had you included your youngest that \"something\" would have come up from her to block him from going on the trip anyway.  I do however think that you need to make a separate short fun trip centered around your 9yo even if it ends up getting blocked.  At least both kids will see that an effort is being made and you are not purposefully excluding one.", "NTA\n\nWhile not ideal this is fair. Maybe suggest a separate trip with just your youngest son? That way you can try and bond and your ex can’t accuse you of neglecting him.", "NTA. Your eldest son lives with you. Your younger son doesn't. It's natural that there will be some things that you just do with the kid that lives with you.", "NTA. Why is she getting mad you aren't taking him? You are right she would come up with some bullshit about him not being able to go and then what? Enjoy Orlando. If universal is on the list make sure to go to the Marvel section the Hulk coaster is wicked.", "NTA. All of your reasons are valid reasons. Maybe you can suggest a separate trip you do with your youngest son.", "NTA I feel for you OP. I think you should still take your eldest son to Orlando and plan a different vacation for both your sons to enjoy together", "As a mum of a needs child, unless you know how to be there for him in a setting which is likely to result in him melting down, NTA. \n\nYou don’t have the ability to give both children the exciting memories your older child will be creating, if you have to consider the needs of the younger only. And by taking on both, alone, that is exactly what you would have to do. So older brother would ultimately lose of course. \n\nYou do however need to step up your game with being a dad to the youngest, despite the crap your ex pulls. Your son is the one losing in that battle, so you need to put your animosity and difficulty with your ex aside, and make sure in the future you make some special time for your young son, alone and with his brother. Regardless of how she reacts, he is your son, and he has a brother that would probably like to have a sibling relationship too. Because you may very well be the only parent that speaks to both of them as they grow up, and they will need at least one of you to be a parent they can turn to when they need advice and guidance.", "NTA - I suspect that this trip is going to be something very special for your older son, struggling with the issue of a mother with insanely high toxicity issues and a younger brother whose special needs may well be leaving the older boy by the side of the road, figuratively speaking.  Enjoy every minute of it!  All you can do is what you can do with your younger son--a special trip of his own more suited to his situation would be good.  You and your older boy probably could both use some counseling to help you build a toolset for dealing with Mommy Dearest going forward.", "I think you should be looking into getting those support systems. Its not his fault your ex kept him from you, you should be working just as hard or harder to include him in your life. \n\nIf you take this trip with your eldest, what solo trip will you be taking with your youngest?", "Are you sure the youngest is yours?", "YTA.   You don’t have to go to Orlando.  You can go somewhere with both of your children.  You can complain about your ex’s behavior but when you are unwilling to use this holiday to build your relationship.   Easy to parent the neurotypical child but it’s WORK to do so with the ASD child.  Maybe your unwillingness to change travel plans to accommodate the disability is why your ex schedules other things on your days to have custody.   If you indicated you fight for those visits I would think you are right about blaming your ex.   \n\nIt just looks like you want a good holiday with your neurotypical kind and can’t be bothered with the other one.", "ESH- \n\nYou could be investing in a separate vacation with just your youngest... You actively choose not to do that. \n\nInstead you just want a vacation with your oldest. And picking something he likes isn't bad. Having a vacation with him isn't bad... Absolutely forgoing investing the same time and energy in your youngest is the problem. \n\nIt absolutely is hard to raise kids with additional needs, doesn't make that kid less your kid and doesn't give you an excuse to use that disability to say you're 'not as connected' and 'can't spend time with him'. \n\nYou're the adult. You're the one who has to fight for time with your kid. And any resources you need to care for him. \n\nShe has deliberately tried to sabotage your relationship with your kids. Enough said.", "ESH \n\nExcept the kids.", "ESH\n\nAll of your reasons would be completely valid if you had made arrangements to go on a separate vacation with your younger son, Just the two of you. Why haven't you done that? Surely you could manage him if it were just the two of you, no? And that wouldn't upset your older son, or ruin his vacation, right? \n\nIt sounds like you're very happy to have a reason not to spend time with your younger son, and I'm sorry if he's difficult to manage, but he's your son. That's your job. And you don't get a pass from being a parent just because your ex is difficult.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (m43) ex wife (f38) have two children together the eldest is a 12 year old boy and the youngest is a 9 year old boy.\n\nWe split up when our youngest was less than a year old, she left to be with another man and took our children, falsely accusing me of abuse to make seeing the children difficult for me.\n\nWhile I was able to start regularly start seeing my eldest son again shortly after she left, the abuse allegations were quickly shown to be false, she still did everything she could to stop me spending any time with our youngest son.\n\nHe has special needs, he's autistic with developmental delay and will never be able to lead an independent life. She used as a reason to allege that I wouldn't be capable of looking after him. We spent two years going up court, after which I was awarded every other weekend visitation, however, but that point I'd barely seen him in two years and I hadn't been able to develop the same relationship that I have with my eldest son.\n\nShe still behaves in a very difficult way with our youngest, deliberately arranging activities with him when during weekends he's scheduled to be with me, especially if he's due to spend any time with the rest of my extended family and refusing to let him visit my mother in hospital so she could see him before she died.\n\nMy eldest son lives with me because of how badly his relationship with his mother deteriorated when he was living with her. I'm taking him to Orlando after Christmas but not his brother. I do feel guilty about this but I have what I consider to be good reasons.\n\n1) I don't think my youngest son would be able to endure a long haul flight, it would cause him a lot of stress and anxiety.\n\n2)I don't have the same level of help and support that my ex has when doing activities with my youngest son.  She has her mother helping her a lot of the time and has a lot of state support. While I just have me.\n\n3) my eldest son wouldn't be able enjoy going to Orlando and going to the theme parks if my youngest son came because I wouldn't be able to go on any of the theme park rides with him because they're not suitable for my youngest.\n\nMy ex wife has kicked up a big fuss saying I'm a bad father for not taking him and said that I should have gone somewhere that was suitable for both of them.\n\nWhile I take her point about choosing somewhere for both of them, the reason I didn't was because I couldn't fully trust she wouldn't pull some bullshit to stop him from coming last minute.\n\nI also feel like she's just saying it because of how bad her relationship is with our eldest son, he doesn't want to spend any time with her. When I tell her she needs to do more to try to mend the relationship with him she lashes out and says I'm a bad father to our youngest. However, I feel like her relationship with our eldest is a result of her own behaviour, while my relationship with our youngest was deliberately sabotaged by her.\n\nAITA ?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta", "**NTA**  \n\nAs you note, there are reasons that they trip to Orlando would not be manageable for your younger son.   You may want to make plans for a more doable weekend with him, something like a lake or cabin trip.  \n\n>deliberately arranging activities with him when during weekends he's scheduled to be with me, \n\nYou need to talk with your lawyer about enforcement for the visitation arrangement you have.", "NTA\n\nThis is unfortunately a difficult situation where not everyone can win. \n\nBut maybe trying doing something with your younger son to try to make it up to him", "NTA- and let me tell you, I was every kind of way looking to find you TA, but I can't. This is a really sucky situation. Sorry that you and both your boys have had that woman to deal with.", "NTA - one on one time is important. Let your eldest enjoy his time and arrange something else for the little one. Keep evidence of your Ex’s behaviour and then go back to court.", "NTA \n\nSiblings need respite too.", "NTA", "My ex has two nieces, the older of whom is special needs. The younger spent her entire childhood not getting to do things because her big sister couldn't. NTA, but as others have suggested, maybe plan something special to do with your younger son.", "NTA - but it feels like you favor the older one. Maybe you should take some time to get to know the younger one so you can find some activities that you will enjoy together.", "NTA\n\nBut you should plan an outing or trip for our younger son that he can enjoy. This way they each get 1 on 1 time with you and a chance to get those special memories.", "Based on the title I was prepared to say Y - T - A but ... context.\n\nWhat would be the point of going on this trip if your older son can't enjoy it? Taking your younger son would have a negative impact on your older son.\n\nRegardless of your relationship with your ex, I do think it would be wise to schedule some one on one time with your youngest son doing something that he would enjoy. I also think there are activities the three of you could enjoy together. Maybe you already do this. \n\nYou have two different kids with different needs. It is ok to interact with them in alignment with what is best for them. NTA", "Exactly this! Besides I think his ex would have kicked off either way. She probably would have threw a fit if he wanted to take him. It seems like she likes being difficult.", "I agree but I also think you should do something special with just your younger kid as well so he doesn’t feel left out.", "Thanks, I really hope so, he really struggles to get excited about anything but I hope once he's there he'll have a good time and make some happy memories.\n\nMy youngest son, despite his disabilities, is always happy, laughing and enjoying himself. I don't think missing out on a holiday will have any impact on him at all\n\nBut my eldest has been pretty badly affected by how his relationship with his mother has turned, she constantly lies and gaslights him so he has major trust issues and the school closures during covid had an impact as well.\n\nI think he needs a vacation more.", "Probably nothing solo, he would be happier being with his brother, he misses him a lot now they don't live together.\n\nMost likely a short haul, all inclusive destination where he can paddy and play on the beach or by the pool.", "I have considered this because the way she has tried to stop me seeing him and having a relationship with him has been truly unhinged.\n\nAll the while having no issue with me seeing my eldest son.\n\n(It was kind of ironic that she spent so long fighting to get custody of him, that when she did she couldn't send him away fast enough. But I was more than happy to have him come live with me and he's much happier and well behaved as a result.)\n\nThe reason I discounted the idea that he wasn't mine is because if he wasn't she would almost certainly see that as a way to stop me seeing him. She has no financial motive to lie, I don't pay her child support anymore, we both just pay for the child that lives with us.\n\nIf she could say you can't see him anymore because you're not the father and it could be proven with a DNA test she absolutely would do that.", "I think it's a bit unfair that you say I can't be bothered with my youngest son when I've spent tens of thousands of pounds fighting in court to see him, not to mention the energy and stress involved with that.\n\nI do accept the point that I could have chosen somewhere they both could have gone to.", "He literally said in the post that he tried to take his younger son to visit OPs extended family and his mother before she passed and the ex sabotaged those attempts. She falsely accused him of being abusive and kept him from seeing his younger son on a regular basis for years. What part of that sounds like unwilling to accomandate his sons disability? He fought in court for 2 years to have the right to see his son. If anyone is the asshole here it’s the ex wife that has tried incessantly to alienate OP from his son.", "But the NT kid deserves to have a fun trip that he would enjoy and if younger son wouldn’t be able to do that what is dad supposed to do? Just never take his older son?", "I think you said that a little nicer than I did.", "I think this is the comment right here... younger son needs some 1:1 activity that's fun and appropriate too. Orlando for older son is perfectly fine though."]}