{"id": 4245, "submission_id": "zg01um", "title": "AITA for asking my half-sister if she actually baked her wedding cake or if it was ordered?", "selftext": "Throwaway,\n\nI (28) love baking. I don't do it professionally but I'm quite good, and I make cakes, cookies etc all the time for my friends and family events. Usually I just charge for the ingredients, unless it's particularly extravagant. I made my cousin's wedding cake last year and a friend's earlier this year.\n\nMy half-sister (20) got married a few weeks ago. We're not super close so I didn't ask at the beginning, but she mentioned she was having trouble finding a place to make the cake she wanted, for a reasonable price. She showed me a sketch she did and I said if she simplified it a little, I'd be happy to make it for a low price. She said she'd think about it, and a few days later informed me I don't need to make it. I assumed she found a bakery and let it be.\n\nThe cake she ended up with was beautiful and pretty much exactly like the sketch she had. At the reception, and she said she decided to just make it herself. Now the thing is, I don't remember the last time I saw her bake anything, let alone a cake like this. I thought she had it ordered from somewhere and was trying to look good in front of everyone (and it worked because everyone was fawning over it). I let her have her moment in the spotlight and didn't say anything.\n\nTowards the end of the night, I asked her privately if she really made the cake, and I understand why she would say she did. My sister got really mad and said she did make it, and she \"doesn't have to answer to me\". It was a relatively small reception and someone overheard. A couple of the bridesmaids went off at me saying I have no right to \"harass\" her, and they'd apparently seen her making it (she sent work in progress photos while she was baking to their group chat).\n\nI did apologize and I thought that was the end of that, but we had Thanksgiving recently and my sister was still kind of giving me the cold shoulder. My mom said I went overboard. I didn't think what I said was really that bad, so AITA?", "created_utc": 1670508722, "permalink": "/r/AmItheAsshole/comments/zg01um/aita_for_asking_my_halfsister_if_she_actually/", "score": 62, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I asked my half-sister if she ordered her wedding cake or actually made it herself. I might've been rude and acted like an AH.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. How rude.", "YTA. That was just plain rude, especially at her wedding reception. Were you jealous?", "YTA, who are you the baking police?", "YTA. Even if she didn’t make it, so f-ing what?\n\nYou said you’re not close, and haven’t seen her bake at any point. Excuse me for saying, but: it sounds like you don’t see her do much of anything. So how would you know?\n\nAnd! You called her out on her wedding to try and embarrass her. No wonder she’s still bitter about it.", "YTA, you wanted to charge your half sister for a wedding cake and then questioned her afterward like it’s any of your business? You’re gross, please grow up.", "OP: “She couldn’t possibly have made the cake, because baking is MY thing” /s\n\nYTA and you’re weird for gatekeeping an activity anyone can do with a recipe, ingredients and a little practice", "Now I've seen it all on reddit. Gate keeping cakes... BTW yta", "YTA - \"I let her have her moment in the spotlight\".\n\nWell aren't you just so gracious.\n\nIt's her wedding, whether or not she made the cake shouldn't matter to you, whether she lied or not shouldn't matter to you either. You said it yourself, your guys aren't close, so why would you know if she bakes or not, it's not a thing people just tell everyone.", "YTA. \nYou're, by your own admission, not close so why would you ever see her baking? \nMind your business. There was no need for you to question her.", "YTA.  Thats pretty rude", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway,\n\nI (28) love baking. I don't do it professionally but I'm quite good, and I make cakes, cookies etc all the time for my friends and family events. Usually I just charge for the ingredients, unless it's particularly extravagant. I made my cousin's wedding cake last year and a friend's earlier this year.\n\nMy half-sister (20) got married a few weeks ago. We're not super close so I didn't ask at the beginning, but she mentioned she was having trouble finding a place to make the cake she wanted, for a reasonable price. She showed me a sketch she did and I said if she simplified it a little, I'd be happy to make it for a low price. She said she'd think about it, and a few days later informed me I don't need to make it. I assumed she found a bakery and let it be.\n\nThe cake she ended up with was beautiful and pretty much exactly like the sketch she had. At the reception, and she said she decided to just make it herself. Now the thing is, I don't remember the last time I saw her bake anything, let alone a cake like this. I thought she had it ordered from somewhere and was trying to look good in front of everyone (and it worked because everyone was fawning over it). I let her have her moment in the spotlight and didn't say anything.\n\nTowards the end of the night, I asked her privately if she really made the cake, and I understand why she would say she did. My sister got really mad and said she did make it, and she \"doesn't have to answer to me\". It was a relatively small reception and someone overheard. A couple of the bridesmaids went off at me saying I have no right to \"harass\" her, and they'd apparently seen her making it (she sent work in progress photos while she was baking to their group chat).\n\nI did apologize and I thought that was the end of that, but we had Thanksgiving recently and my sister was still kind of giving me the cold shoulder. My mom said I went overboard. I didn't think what I said was really that bad, so AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I bet you are absolutely correct but, yeah unfortunately YTA.", "YTA\n\nJust let her have her cake and eat it too. Learn tact, this is her wedding.", "YTA. You were super rude. There was no point in you bringing it up except up to point out you didn’t believe she made it. \n\nWhich by the way, what was the point in that?  Do you need to be the best baker in the family?", "YTA. Rather than finding ways to improve, you accused a family member of lying about something trivial at her wedding reception. Who cares if she lied to a few people at her small reception? It's not like she's an influencer taking business away from a baker by taking credit for work that isn't hers.\n\nIf I were one of your family members who ordered from you in the past, I would start going to your half-sister. And it's not because she's more skilled, it's because she has shown that she can roll with the punches and handle things that don't go her way with some grace, unlike you.", "Maybe it's a cultural thing, but I ALWAYS notice when people refer to their half sibling as a half sibling. There's always some animosity or jealousy there.\n\n...and lo and behold, there is in this situation!\n\nBaking is *your* thing and you couldn't stand your sister being praised for something that you were supposed to excel in. Who cares if she pulled the ole \"fake n' bake?\" What is it to you?\n\nYTA, and I'm sure green doesn't look good on you.", "YTA. Why did you need to know? Why is it your business? You said you ‘let her have her moment in the spotlight’. Honey, it’s her wedding. You didn’t ‘let’ her have anything.", "YTA. \"We're not super close\" \"I can't remember the last time I saw her bake\". Say those two things slowly to yourself over and over until you work out how one might be the reason for the other.\n\nYou called a bride a liar on her wedding day in front of friends and family because you resented the fact she may have made it and that it looked so good. There's absolutely zero valid reasons for doing what you did other than envy.", "YTA. Why do you care if she baked the cake or not?", "Yta mind your own business ffs", "😂 \"let her have her moment\".  How kind of you.  YTA", "YTA. You were at the wedding to enjoy the festivities not interrogate the bride about her cake or who made it.", "Whether or not she made it in the end, what does it actually matter? Obviously it means something to you, either you trying to catch her in a lie or have a moment where you feel superior on your baking abilities. \n\nNevertheless, not necessary. Just let it go. \n\nYTA.", "It's always the \"I love to do this, but I don't do it professionally, my sister did it and I think she's lying cause only I can do that.\"", "YTA,\n\nYou put your ego over your sister's wedding and you wonder why people didn't take it well?", "YTA\n \nYou basically said….I don’t believe you made this cake, come on tell me the truth….", "YTA\n\nWhat is it with people who classify themselves as someone who “loves baking” (as opposed to people who call themselves bakers or people who just say they can bake) that makes them seem to believe that they’re the only ones in the circles who are capable of making a cake?\n\nYou know it’s not brain surgery, right? It’s literally basic science, with well established easy to follow rules!\n\nYTA", "YTA.  \n\nEven if you still felt like accusing her of lying did you really have to do it during her wedding?  You couldn’t let her have fun and enjoy the night before asking at a different time?", "YTA, what’s it to do with you?", "ESH\n\nYou bringing this up at the wedding, you could've asked later. I get you were surprised, but that wasn't the time or place and it doesn't really affect you.\n\nYour sister for holding grudges. It's been weeks and she's still not over it...? (this makes me think she didn't make it and is upset she got caught. Or is sort of throwing it in OP's face, like 'look, I'm the baker of the family now! she's not as good as me!' )", "You clearly weren’t asking discreetly if a bunch of people overheard you, for starters. YTA", "YTA. How entitled you are. Or are you a bit jealous of your sister's baking/decorating skills? Trying to embarrass her on her wedding day is a bit much. WTF made you feel like you needed to do that?\n\n(btw, I don't understand the point of saying half-sister - I have one and I have never introduced her as 'oh this is my half-sister... No always, this is my sister)", "YTA. Her: I made the cake. you: but did you really? You called her a liar", "YTA.  You were upset that she had the cake she wanted rather than the simplified version you told her that you could make. So you accused her of lying...during her wedding reception.  And you wonder why she is still upset?  Asking her that served absolutely no purpose other than to try to embarass her and make you feel superior. Oh, and you thinking you \"let her have her moment,\" at her own wedding, says all I need to know about you.", "YTA. Her bridesmaid acted more like a sister to your own flesh and blood and had her back. This was petty and jealous, and very inappropriate. You didn't let her have her moment (its not like she needed your permission), you couldn't wait to shat on what was supposed to be the best day of her life.", "Genuine question, why was it so important for you to know if she made the cake? Do you guys bake together? Do you guys have a good relationship?\n\n**This seems like you’re leaving out information as to why she have such a reaction to you asking this seemingly innocuous question.**\n\nYTA - because it genuinely didn’t matter. This is a question you could’ve asked her once the wedding was over, or even at Thanksgiving itself. And you saying you **“let her have her moment”** (duh and obviously! It’s her wedding, the entire night is her and her partner’s moment) tells me that you like to make things about you and thus the reason she’s *actually* mad.", "YTA\nThe cake has nothing to do with you. It’s someone else’s wedding, someone else’s cake, someone else chose to bake it or order it. You should ask yourself “why am I bothered by this?”", "YTA - You basically accused her of lying about the cake. On her wedding day. In front of her friends/bridesmaids. For what?\n\n\"I don't remember the last time I saw her bake.\" So what? Who cares?", "YTA.\n\nYou accused the bride of lying AT HER WEDDING. Over a damn cake - something that doesn't even matter. It makes zero difference who made her cake - this was all about your ego and having to prove that your half-sister isn't as good as/better than baking cakes than you are.", "YTA - \"Did you lie\" is an odd question to ask a bride at her reception. \"How did you ever assemble it yourself, did you need much help.\" (you'd know better than I which step in the process needs many hands) might have been a more tactful way of asking your question.", "YTA really? You accused the bride of lying at her wedding.", "Your behaviour was unkind and absolutely uncalled for. You basically accused her of lying to everyone. YTA.", "Sooo how long have you been jealous of your sister?\n\n\nYou harassed her at her wedding over a cake, a cake that you couldn't believe she could make.\n\n\nYTA", "YTA. Your superiority complex is showing", "Why is she getting married at 20? Isn't this too young?", "YTA on the given details because say she didnt actually make it, why bring it up? Why try to make her ‘admit it’ if you “understand why she would say she did”? It’s pretty insulting to say ‘I know you couldn’t have done this’,’ especially when she is so proud of it.", "(Only putting NAH for the bot) I wouldn’t necessarily say you’re an asshole for that but I can also see how she would get upset about it. Maybe just try talking to her further about it and say you didn’t mean to offend or insult her cause it really doesn’t seem like you were and also tell her it was more cause you were surprised as you’ve never actually seen her bake but the cake ended up amazing", "YTA.. just bc you don’t remember the last time she baked anything doesn’t mean she doesn’t bake. It’s not like you are with her 24/7.", "YTA\n\n1) why would you ask her AT the wedding\n\n2) you can't remember seeing her bake recently, but you also state youre \"not close\". How would you know if she got into baking or not??\n\n3) you \"let her have the spotlight\" at her own wedding? 🙄🤣\n\n4) you sound super jealous that people were \"fawning\" over her cake. Your word choice tells me a lot.\n\nIts pretty clear you feel jealous and threatened that your sister is also good at something you stake your identity and pride in. Thats a you problem. I dont blame your sister for still being mad. You called her a liar in front of others on her special day and implied she doesn't have the skill to do what she claimed. YTMA (Youre the Major Asshole)", "YTA. Giant YTA. YTGA (You're the Giant A******). Just wow. What were you possibly hoping to get from asking that besides feeling superiority over a bride on her wedding day?", "YTA. She probably worked super hard on it and felt really good about it and you basically said to her face that you think she sucks too much to have done it and must be lying.\n\nYou insulted her to her face, of course she's cold to you.", "YTA...so what if she did order it. It made her happy and whether she made it or ordered affected your life how (other than get your jealousy tweaked)?", "a little someone sounds jelly, YTA and very rude. who asks that question ? let alone at the wedding smh", "YTA.  Sounds like you didn’t get the attention you so desperately were seeking on her wedding day.  No wonder she didn’t ask you to make the cake.", "YTA- If it's figured out that she lied about making it herself, let her deal with the consequences of the lie. This doesn't affect your life or will significantly alter anything in it.", "YTA. I hope you work a green dress to the wedding because you sound super jealous.", "YTA! You were jealous that someone you considered beneath you did better than you. You're a horrible sister. How is letting your ego overshadow what your half-sister accomplished working for you?", "YTA Whether she made it or bought it, you didn't need to ask at the WEDDING. If you wanted to know that badly, you could have asked some other time. Asking her during the wedding was rude and inappropriate.", "YTA. It honestly sounds like you were jealous of the attention she was getting over the cake. You say you “let her” have the spotlight.. you mean at her own wedding? How kind of you. \n\nWhether or not she made it or bought it, why does it matter to you so much? Who cares? And why do you need to bring it up literally at the wedding?", "YTA. Why did it matter?", "\nwhy on earth do you even care unless it’s come insecure competitive thing. \nAnd then to harass her about it at the reception.\nYou made yourself sound petty and jealous\nYTA", "YTA...your words and phrases you used show you have some serious jealousy issues with your younger half sister. \"I let her have her moment\"??? Seriously? As if I you were in charge of the wedding atmosphere and its events...\"fawning\" over her cake. Another interesting word, sounds like you were a bit steamed that she made a cake that was as beautiful as your abilities. I also wonder if OP is married yet...??", "YTA who cares if she made it or not? Just because you personally don’t see her bake doesn’t mean that she never does. Why do that at her wedding or ever for that matter even if she was lying who cares? It’s cake. Is it you couldn’t believe that she baked it or that she could make it herself without “simplifying” it. \nTo me you sound jealous that she didn’t go to you and that she was able to do the design she wanted without making it more simple.", "YTA. It bothered you that much that you chose to question her on her wedding day? It’s literally none of your concern whether she baked it or not.\n\nAlso to say you “let her have her moment in the spotlight”… what? It’s HER and her husbands wedding day. Of course they’re gonna have the spotlight.", "YTA.  Not sure why you felt compelled to do that, but it was a bad thing to do and that's why people are pissed off with you.\n\nRule of thumb: if the action I'm about to take offers no benefit and solves no problems, but could easily make somebody angry, it's probably an action I shouldn't take.", "Yikes. How many times have you tried directly accusing someone of lying and it’s gone well? \n\nYTA.", "You dint even leave it at just 'you really made it', you had to add the 'i would understand why she would say that'. You weren't curious to find out about her baking skills, you had already decided she was lying.\n\nYta.", "Info: what made you think it was a good idea to ask a bride ON HER WEDDING why she was lying (even though she wasn't actually)\nThis was a non essential conversation and should have stayed unsaid.", "Yta. What did you hope to gain by questioning her? I love the part about letting her have her moment in the spotlight too, very gracious of you at her wedding", "YTA.  You didn’t think it was rude to question her at her own wedding and within earshot of others?  Would it be that insane that someone else in the family can bake too or are you the only one allowed to have the “gift”?", "NTA.\nIt's ok to be curious if someone did something you didn't think they could do. The fact that you didn't ask her in front of everyone was good.\nHer overly defensive response makes me think she didn't bake the cake and she got scared that you might have noticed that she lied about it.", "YTA. And obviously jealous becuase you would’ve had to simplify the cake and she didn’t have to.", "YTA You're not close to your half-sister so how would you know whether she bakes or not? Then you basically and erroneously called her a liar over something trivial that was utterly none of your business. You 'let' her have her moment in the spot light? You mean the bride, whose day it was - you think it's your role to assign the spot light? No wonder she is keeping her distance, you sound kind of awful.", "YTA, letting her have her moment means keeping your thoughts to yourself and never saying anything.", "YTA- Does it really matter if she baked it or not? It feels like you’re trying to gatekeep baking. Be for real right now.", "I still hear this phrase in Stephane's voice (Full house)!", "She sounds jealous that her sister could bake a cake and decorate better since she said in post if the cake was more simple she could have done it.", "OP is mad because she’s been doing this a while and couldn’t pull that cake off, and here half sister not only did the cake, but did it better than OP could have. And OP has “doubts” because she’s never seen step sis bake? \n\nThey are adults. They don’t live together. So what if she never baked before she was 18.", "The sister is not an AH and far from it, OP harassed her at her own wedding over a cake, no wonder the sister is still \"holding a grudge.\"", "No? People get married at 20 all the time. Or 18", "There are people still getting married at 17 and 16 with their parents permission (not saying that’s right) but it happens.", "Honestly OP sounds like a narcissist tbh", "Because it was better than any cake OP could bake. Remember… she needed it simplified before she would even attempt it (for money no less) but her Sis actually accomplished it, while prepping for her wedding. No question OP was jealous. (OP YTA).", "100% this is all about her being jealous. Shes the super duper awesome baker of the family.  It doesn't look good that she needed the design simplified for her to do it, but sister made it no problem", "I 100% agree with this thread. It’s not important for anyone to know whether she really baked it or not. Maybe she did, maybe she didn’t. Why should that change how anyone sleeps at night? \n\nOP, you’re definitely the AH. \n\nI think you are not only jealous of your sister’s *potential* baking talents, but also jealous of the entire wedding. Letting someone “have their moment” sounds incredibly entitled. Why else would you think it okay to rain so epically on someone else’s parade?\n\nEdited for clarity and grammar", "On, but to OP, they are the resident family baker and cannot imagine that anyone else, in the family, could make/decorate a cake better than they can. And you see, the cake the sister wanted was too complicated for OP so there is no way the younger sister could possibly have the skills to do it herself. Therefore, she must be lying about making it herself.", "Well said.", "Exactly.  Even if she did buy it and admitted it to OP, all it would have done would make the bride feel ashamed at her own wedding.", "That's doesn't make it a good thing.", "Only fundie Christians and Muslims and people like that. And that doesn't make it right? Don't think a 20 year old can ever be ready to make that committment", "Yep, exactly!", "It doesnt make it a bad thing either.  Some people get married that young and stay married their whole lives.  some people wait until their 30s and stay married less than a year.  It just depends on the people involved", "This is extremely rude and discriminatory. There are people from every religion and no religion that get married at 20."]}