{"id": 4284, "submission_id": "zgdmnq", "title": "AITA for saying my \"step dad\" will be grandpa to my baby and not step grandpa", "selftext": "For some context my (23f) mum had me with one man and 2 of my other siblings with another. I didn't know my bio dad and up until i was 5 i thought my siblings dad was my dad. He was a massive piece of shit and left when I was 6. As you can imagin knowing 2 fathers abandoned you really fucks up a young girl. \n\nWhen I was 7 my mother started seeing a man, my now step dad. He was amazing but I couldn't see that and just thought \"oh great, another man to let me, mum and my siblings down. Over the years me and him would fight a lot untill i was a teen and realised he was the one putting up with all my bullshit and still loved me and wanted the best for me, a true father. Now i see him as my real dad. I still dont call him dad and just by his name but we both understand thats just a habit and that he is and always will be my real dad.\n\nRecently I have found out im pregnant. My dad is over the moon and trying to decide what variation of grandpa he wants to be called. We decided on pa since that's what we call our grandfathers in my family. I was talking about this with a cousin on my bio dads side and she asked why wouldnt my kid just call him by his name like I do since his only step grandpa. I said because he is my child's grandfather not step grandfather. She got all offended and asked \"then what does that make your real dad\". I told her \"a fucking stranger, even i haven't met the bastard\". \n\nNow i have my bio fathers family contacting me on facebook to tell me off. I dont even know most of these people but its starting to get to me. Since my bio dad did pass from cancer a few years back so they are probably really sensitive about anything to do with him no matter how shit of a person he was. AITA.", "created_utc": 1670537752, "permalink": "/r/AmItheAsshole/comments/zgdmnq/aita_for_saying_my_step_dad_will_be_grandpa_to_my/", "score": 243, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Told my cousin my \"step dad\" will be my babys real grandfather and that my bio dad will just be a stranger. Its getting to me since its probably a sore spot i for that family as he died from cancer a few years back.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\nAnyone can be a father, but it takes someone special to be a dad. \n\nHe's special. \n\nThe family contacting you, over FB no less, to tell you off - they're just proving that the entire side of the family might be worth writing off.", "NTA. Your bio dad is dead, so it’s not going to bother him. Your dad put in the legwork so even if you don’t feel comfy calling him ‘dad’ I’m sure he’s beyond honoured to be ‘Pa’. Ignore your bio dad’s family.", "NTA \n\nYou literally never met your sperm donor. \n\nI’m sure your stepdad will be an amazing Pa and if your dads family don’t like it? Thennnn maybe they should have convinced him to actually parent his child. Just a thought…", "NTA and you are a very mature, thoughtful human being.\n\nBlock the BIO family, stat.", "NTA. Anyone with the right reproductive organs can donate sperm. Doing so doesn’t make you a father. Reserving a title for a person who will never and can never be present in your child’s life is an asinine request. The man who raised you and showed you what a good dad is like is your family even if you’re not biologically related, and will likely play an important role in this new child’s life. Call him what he wants to be called.", "NTA \n\nI will never, ever, ever, ever, ever fucking understand what it is with some people and the immediate kneejerk reaction of “not my blood=not my family/permanent second class of family.”", "NTA oh hell no, the man isn’t even alive so the point is moot. Just remind them kids have more than one grandparent and your stepdad is a grandpa, the end, and refuse to further engage.", "Father/Dad is not just a title that you inherit when you have a child. It is a role that is filled by caring for that child, comforting that child and raising that child. It is putting time, effort and love in. This man did thus when two others gave up. I'm glad you have someone like this and are willing to think of him as such and present them to your child (congratulations  on that) as such.\n\nNTA\n\nIf your bio dads family has a problem with this just ask them where they and your bio dad were when you were growing up and could have used one", "NTA.  You should tell your dad that even though you call him by name, that you think of him as your dad.  It would mean a lot. \n\nBio family can bugger right off.", "NTA- It’s kind of a stupid hill to die on if they didn’t care about you when you were a child.", "NTA in any way, and you're a kind and thoughtful mom. Don't let your biodad's troupe of flying monkeys shame you out of doing the right thing.", "NTA.  You are giving your child a great relationship with a man who helped raise and love you.  Grandpa is an appropriate title for that relationship.  That's your prerogative.  Your dad's family may have feelings about that, but that's not your responsibility to deal with or accommodate.  Block people who harrass you.", "NTA. Family are the people who love you and stand by you day to day, not people who you happen to share genetics with (and not people who tell you off on Facebook). Your cousin, and other extended family members, have absolutely no say in who you consider your child’s grandparents.", "You are definitely NTA. I can’t believe that people who *you do not know* are giving you grief about your view of a man who *you never met*! I imagine that you’re right about his death making this a sore subject. But *of course* your dad is your children’s grandpa. Congratulations on the pregnancy!", "NTA. Your bio dad's family's feelings are not your responsibility, nor is it any of their business what your child calls your step dad.", "Nta. Bio dad's family have nothing to do with this. They can get bent.", "NTA. Your biological father never had any interest in you. There's nothing more to say here.", "NTA. Don't listen to the people who are trying to tell you off. Good luck with your new baby and I'm sure they will have the best grandfather in the world. Biological means nothing, we can choose our family", "NTA, your bio donor was just that: a donor.  Your dad is the man that was there for the skinned knees, broken curfews, and Christmas mornings.  You can just block those people.", "NTA - Your statement was factual based on your experience. No one is you so their opinions do not matter. Love on yourself, that little baby and create a life you'll be proud of. I love that you honored the man who loves you BS and all. In just a few years you'll hear 'Pa' spoke by your baby.  Best to you all.", "NTA, new babies always bring people out of the woodwork to try to stake a claim. It's your family and you get to decide who's in it.", "NTA\n\nIt sounds as if your mother and stepfather did a really good job of letting you have your feelings and respected your feelings, and this allowed your relationship with your stepfather to grow, organically, into a quality relationship that let you establish a great connection with him on terms that work for you!\n\nWe see far to many stories, here, of how a child's feelings are ignored, denied or manipulated by a parent and stepparent trying to force the child into an emotional relationship they don't feel.  Your story is refreshing and happy!\n\nLetting your mother's husband, who means so much to you, be \"grandpa\" to your children is fine.\n\nBut do be aware that the complexity of your relationships with various father-figures in your life (bio-dad, first stepfather,  current stepfather) will, eventually, be learned by your children. \n\nYou want them to learn this story on your terms, not through the family rumor mill!\n\nSo do let them know how wonderful it was when you established a relationship with your stepfather!\n\nHow you had a bio-dad, and then an different stepfather. And how when you met your stepfather he was so nice!  And how it took you a long time to learn to love and trust him.  But you are so happy you were able to come to love him, and know he loved you!  And how you are happy that he can now be their grandfather, because he's so nice! \n\nBeing both honest and positive about a good truth in your life will serve your children better than just calling him \"grandpa\" and leaving them to be confused when more details of the story eventually reach them. \n\nThe emotions of your bio-dad's family are legitimate, even if they aren't *your* truth.  They no doubt *wish* they could have seen him be a true father to you, and that they had a relationship with you growing up.  So don't call them liars.  Be clear to them that you respect that they *wish* your bio-dad had been in a situation to let you enjoy a positive relationship, you don't blame them, and you agree that it is a nice idea of a \"might have been\" even if that isn't how things worked out.\n\nThere are probably truths about both your bio-dad and your mother, and their relationship, that you don't know. \n\nJust let your kids know that you had a bio-dad, who died. And that, sadly, you never got to know him as \"dad.\"  But what matters is that you had your mother, and your current step-dad, who will love and care for them, as they have loved and cared for you.\n\nNow, these truths are not ones you can teach a child immediately.  But don't start down the path of telling them things that don't fit this basic structure, so you never have to back up and admit you hid truths from them.", "Nta.   My husband is not my eldest sons bio father, but is his dad in every way that counts.  When my granddaughter was born, it wasn't even questioned that he would be granddad to her because he absolutely is! \n\nMy sons bio father has never met our granddaughter (and, according to my son, he never will) so he doesn't deserve any title", "HUGE NTA here. My bio dad is literally garbage. Abusive alcoholic. Best thing my mom did was leave him. She met my step-dad and he was never really a replacement but he was there for me. Walked me down the aisle at my wedding and when I had my daughter there was no doubt in my mind he was her grandfather even though I do not call him dad. My children and my niece don't even know of our bio dads existence and probably won't for a long time.\n\nFamily is not only blood and any blood family that abandons or abuses you does not deserve any family titles.", "NTA. The person who does the job gets the title and gets all the benefits/perks when they do the job well.\n\nEither block the family entirely or send them a polite-ish but firm message that you are sorry that they lost someone they loved, but that you never knew him. He never provided for you in any way. Your step-father stepped up and helped you through the pain of having a father that abandoned you and gave you love and support you needed to grow into a decent adult. It is offensive to all of the sacrifices made and love given by your step-father to NOT think of him as your dad.  If your father had wanted a daughter, he could have, but he didn't want one. You are going to honor the man that did.", "NTA - family is often so much more than biological connections.", "NTA, when that cousin asked you what you should call your real dad, you could've just said \"a glorified sperm doner and nothing else.\" Because - its accurate.", "NTA. Congratulations on your baby and finally finding a father figure who is worth your love. If need be block all the people on your bio dad side because you do not deserve any of the hate you're receiving and they are so wrong for that. Good luck with your baby.", "NTA\n\n>since his only step grandpa\n\nOnly step? F that garbage. He was the one and only father you had. The others were just placeholders. \n\nIt is regrettable that your biofather is deceased and can’t try to become a better person but I agree that side of the family doesn’t get to claim anything that they didn’t bother earning.", "NTA \n\nI grew up with six grandparents because my mom grew up with a blended family. So two grandparents on my dad's side plus my mom's mom + stepdad & mom's dad + stepmom. \n\nThey were (alas all 3 grandpas are no longer with us) ALL my \"real\" grandparents. None of them ever treated me or my sibling or cousins differently based on blood relation. Nicknames evolved organically but the love was always there from the beginning and I feel like I had a lucky childhood in that respect.\n\n\nCheers to you and congratulations. 💜\n\n\n_edited because I forgot verdict_", "NTA at all. It’s absurd to expect a child to call a deadbeat (pun intended, I am so sorry y’all) “grandpa” ??? Family in general is not exclusive to blood relation. I can literally think of like 5 examples in my life of non-blood related family members off the top of my head. It’s very normal.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor some context my (23f) mum had me with one man and 2 of my other siblings with another. I didn't know my bio dad and up until i was 5 i thought my siblings dad was my dad. He was a massive piece of shit and left when I was 6. As you can imagin knowing 2 fathers abandoned you really fucks up a young girl. \n\nWhen I was 7 my mother started seeing a man, my now step dad. He was amazing but I couldn't see that and just thought \"oh great, another man to let me, mum and my siblings down. Over the years me and him would fight a lot untill i was a teen and realised he was the one putting up with all my bullshit and still loved me and wanted the best for me, a true father. Now i see him as my real dad. I still dont call him dad and just by his name but we both understand thats just a habit and that he is and always will be my real dad.\n\nRecently I have found out im pregnant. My dad is over the moon and trying to decide what variation of grandpa he wants to be called. We decided on pa since that's what we call our grandfathers in my family. I was talking about this with a cousin on my bio dads side and she asked why wouldnt my kid just call him by his name like I do since his only step grandpa. I said because he is my child's grandfather not step grandfather. She got all offended and asked \"then what does that make your real dad\". I told her \"a fucking stranger, even i haven't met the bastard\". \n\nNow i have my bio fathers family contacting me on facebook to tell me off. I dont even know most of these people but its starting to get to me. Since my bio dad did pass from cancer a few years back so they are probably really sensitive about anything to do with him no matter how shit of a person he was. AITA.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You call him what you want and if you want him as grandpa to you children then he is grandpa. Blood doesn’t make you family and it doesn’t give anybody the right to claim a title just because. \nCongrats by the way!!!!", "NTA\n\nI'm uniquely qualified to answer this. \n\nMy Dad's Dad passed before I was born. My Dad and his siblings were much older. They all had a great relationship with their Dad and their stepdad... but stepdad was never their Dad. How could he be? They were all teenagers or older when their bio Dad died.\n\nAs to me and my cousins? Step Dad was Grandpa. When I asked my Grandma about my Grandpa not being my Dad's Dad she said simply \"Oh, my husband died, I was getting ready to be a Grandma and you all were going to need a Grandpa. So I went out and got one.\" And that was that. It was that simple. All of us were his grand kids, I didn't love him any more or less than the Grandpa on the other side.... I met him on the same day when I was born after all. They were always same/same to me. And it also doesn't make my Dad's Dad less important, even though I never met him. I hope that if I ever went my wife could find someone as special as Grandpa Joe to be my grandkid's Grandpa. \n\nSo I'll just say it's totally not weird that your kid will have a title for this man when you don't. That said... this is not about a title. This is about the fact that you are showing no reverence for a man that wasn't there for you. I'm sorry they feel differently toward your sperm donor than you do, but you're entitled to your feelings and they need to get over it. \n\nYour Step Dad can absolutely be \"Name\" to you and \"Grandpa\" to your kid. And congrats!", "NTA", "NTA    and you were kinder than I would have been.\n\nWhen you said he passed at the end, my mind just would have responded to \"than what does that make your real dad?\"  With \"dead\".\n\nI also have a bio father, who I have never met, and never wanted too, and a dad who is amazing.", "NTA. - block those people", "NTA\n\nI know your dad (step dad) has gotta be feeling like a proud grandpa!", "NTA. My daughters have both their biological grandmas actively in their lives and they also have a special grandma name for my step mom!", "NTA. All that people are strangers to you, only relates by blod dont make the people family. Your stepdad its more family that them, you can Tell them that. They know you?? No, they Take care of you, go to your birthays or funcions or graduation? No. They are nobodys to you, please block them all. They are no place to Tell you How do you have to fell about a spermdonor Who you don't know because he abandon you and your mother. And less how you and your future baby can call someone that LOVE you and Who you LOVE as well. \nCongratulations for the baby, and dont listen all this people Who dont have live.", "NTA. Those people aren't your family and have no say in how you live your life. Block and delete them, then enjoy your life with the real pa that raised you and loves you.", "NTA. Your (step) dad seems like a great guy and I’m happy you were able to form a strong bond with him and that your child will have a “Pa”. Don’t let anyone make you feel bad for that.", "NTA, you do what you feel right. Family is not always blood but those that are there for you", "NTA. This man is your Dad and also your child's Grandpa. Period. Bio donors family, who you don't really know or care about, have no say in this at all. \n\nBlock them all and move on with your life. You owe them nothing and do not need to tolerate them or their comments.", "Your bio dad may have been your father, but he was never your daddy. You're NTA. Block anyone giving you grief; you don't deserve it.", "NTA\n\nYou can have your kid call the homeless man across the street grandpa if you want. None of their business", "NTA my oldest daughter calls her mom's stepdad grandpa w/o issue and my youngest will refer to my wife's stepmom as grandma same as she will her bio grandma. I find it interesting your bio dad' s family so quick to scold you but where the hell were they when your bio dad split?", "Why would they contact you on FB about this? Are you trying to antagonize them about your stepdad being not s step in grandpa? If you did that just to be passive aggressive, then YTA for doing so.", "I bearly know that side of that family regardless. Only a few people that mum stayed in contact with.", "Yeah he understands that dad is a hard word for me but he understands hes my one and only father and that he will always be my real dad. I will refer to him as my dad in convos though, it gets real confused when i introduce my dad then call him by his name lol.", "Oh ive definitely gone on a blocking spree but i didnt realise how big that family is so there is a lot of people to block. They breed like fucking rabbits.", "I absolutely hate when people treat blood like its some sacred thing. Fuck no. Im glad i had a real dad who understood that too. Unfortunately he had to learn that to through his shitty dad.", "Oh he absolutely knows. As a teen i would tell him all the time because i was worried about it.", "Cousin is lucky we even interact with her. My mum kept contact with my bio fathers sister since she was able to get away from that family and recognised her family was shit, Im glad i had my aunt was in my life but her children are kinda shit for interacting with that family knowing the pain they causes my aunt.", "I have no intentions of not telling my kids about my history with dads. I think it would be a great first lesson that blood isn't everything.", "My bio dad was an abusive alcoholic too. My mum had me when she was 16, my dad was.... 22. You can imagine that i dont have any respect for a man who took advantage of a homeless teen and abused her to the point she has ptsd and is half deaf from him beating her in the head with the back of an axe. Its crazy that i can hold so much rage for a man i dont even know.", "Lol, my mind definitely went there but i didnt want the drama. I got it anyway unfortunately.", "I think you might be best off in life just blocking them. It doesn’t sound like they’ve positively contributed to your life at any point. 100% NTA", "OP, my grandma remarried and he is my grandpa, not a step grandpa. He made us pancakes on Saturday and he just fixed my car and he spoils HIS granddaughters. My bio grandpa was never in the picture. That's your dad and that's their grandpa.", "hell having the kid might change what you call him... my Mom had to call her parents Grandma and Grandpa to get me to call them that :P", "cool.  I waited till I was 27.", "That's great!\n\nIt is delightful that you have such a good relationship with your stepfather.  \n\nI suspect that your problems will arise when and if your kids have contact with bio-dad's family.\n\nAnd even if you choose to go \"no contact\" with them now, eventually they will be able to track down your kids once they're old enough to be on social media (if it even is a thing a decade from now as your child ages into it - things might  be very different then!)  \n\nIt is going to take luck and skill to navigate this situation with your children.  It may be worth you consulting with a child psychologist who might be able to warn you of specific pitfalls to avoid, and to advise you on navigating your child learning difficult and possibly painful-to-you truths in a way that is positive for your child.\n\nAdvice before your child's birth is going to be far more helpful than looking for help after things don't work out as the Platonic Ideal of how you envision you're child's future with their grandparents on your side.", "Mine was emotionally and mentally abusive. He tried to hit my mom once and she broke his nose. Mom left when I was 10 but he did try to stay in our lives to control us. Unfortunately found another woman to take care of him and have 5 more kids with her. Essentially our replacements. Haven't see or heard from him in 10 years and it's wonderful.", "😂😉", "NTA. You call your stepdad your baby's grandpa. Much better, give him a better nickname like grand dad or grand-d or something. It really doesn't matter as long as you don't emphasize that he's not blood relative.\n\nHere are some suggestions:\nAbuelo (Spanish)\n\nAvô (Portuguese)\n\nBabu (Swahili)\n\nDaada/Nana (Hindi)\n\nDedushka (Russian)\n\nDziadek (Polish)\n\nGrand-père/Pépère (French)\n\nHalabeoji (Korean)\n\nYou can use any language if you are not comfortable with grandpa.", "NTA. I was in my 20s and. I longer lived at home when my step-dad came into my life. He is not my dad, nor has he ever tried to be. But, he is my children's Grandpa and has been from day one. He has made grilled cheese sandwiches, driven them to lessons, bandaged knees, etc.  He loves them and they love him. \n\nI am so glad you have your step-dad in your life and I bet he will be an amazing Pa.", "NTA fuk them. You decide what to call anybody on life.", "My kid has never referred to my step-father as anything but Grandpa. He and my mother weren’t even married until my senior year of high school. But he’s the grandpa she knows. Bio-dad is just dad’s dad, she’s only even met him once and is barely aware of his existence. It’s not about genetics, it’s about who does all the things a grandpa does. Don’t let anyone tell you who the real grandpa is. NTA", "Tell them it’s not their business, have a nice holiday and block them .", "NTA.", "NTA.  Block all of these people giving you grief.  You don’t need them in your life.", "NTA\n\nBoth of my grandmothers divorced their first husbands because of abusive behavior. My parent's stepfathers were my grandpas. I never even knew my biological grandfathers (not that I would have wanted to, they sounded like complete jerks) \n\n&#x200B;\n\nBlock your bio family from contacting you and let your dad have his grandpa moment.", "Nta. I called my step grandpa by his name but my kids called him grandpa. They only met my real grandpa a couple of times, he didn’t earn the title the way my step grandpa did.", "NTA. You can just respond with a variation on what you said, “I don’t know why you’re contacting me. I’ve never met the man you are talking about. Are you sure you have the right person?”", "NTA He's not a step dad he's the dad that stepped up. ♥️ and he'll step up as grandpa for your baby. You had heartbreak but you're also so blessed!", "He put in the effort . Was patient and let things develop naturally. You see what he is and he deserves whatever title you give him for your upcoming child . Personally you and your family are lucky to have him in your lives\nEdit: NTA", "Absolutely NTA \n\n🙋🏽‍♀️ Person with a complicated, blended family here. \n\nMy kids had/have 4 grandpas. Yes. 4. My bio and stepdad, their fathers bio and stepdad. They are all called grandpa. \n\nMy maternal grandpa was also technically a \"step\" (never met the real one). \n\nYou can never have too many people who love your kids. What they call your parents is up to you, your parents and your children. Nobody else. \n\nFuck what anyone else says. Not their place.", "NTA", "Family is defined by the people who treat you with consideration,  support and understanding, it doesn't matter what you call each other. There are already a hundred different names for a grandfather, you both chose the one you felt was most appropriate. It's your child, your choice, a bunch of strangers don't matter. NTA.", "My paternal bio grandfather *was* in the picture but was very disinterested in his female progeny. Step-grandfather was there with unconditional love, for all of us, regardless of gender. I'm so grateful he was in my life, and he was 100% my grandpa. I miss him so much.   \nHe wasn't even a father figure to my dad--he and my grandmother married about 2 years before I was born, so solidly in my father's adulthood.", "Same. My bio grandfather died long before I was born, my dad was 12 at the time. My step grandfather... I have issues with many of his beliefs to this day, 10yrs after his death.... However! He was the only Papa I ever knew. I loved him and still do. He will always be my Papa\n\nI would have loved to know my bio grandfather, from stories it sounds like he was a cool dude, but he is literally a complete stranger to me.", "My parents did this and called each other mum and dad but reverted back to calling their parents mums and dad when I was an adult so in a conversation with my dad “mum” could be his or my mum. It gets confusing."]}