{"id": 4316, "submission_id": "zgu5vk", "title": "AITA for telling my fiancé I won’t be asking my parents for money for our wedding?", "selftext": "UPDATE: We had a long conversation this morning about everything. Fiancé agreed that he was the AH and apologized for everything. He’s offered to scale back the wedding entirely. His family has been putting a lot of pressure on him to have the splashiest wedding and it sounds like they’re not going to contribute as much as they did with his sister’s. They’re the ones who pushed that this venue is a “must”. My fiancé told me that he spent last night realizing that he wants this wedding for US and not just do what his family demands, and he feels horribly guilty for getting mad about my parents’ money. He only wishes I told him, not because he thought he deserved to make the decision, but because he felt as if I’ve been keeping it a secret from him. He said that we can elope if I want to, but I know he still wants a big wedding for his family so we’re looking at options in the middle that’ll make us both happy!\n\n-\n\nI’m not a wedding person. So I think it’s a little hard to wrap my head around why my fiancé is so upset, so I am looking for an impartial opinion.\n\nMy fiancé has ideas for some big grand wedding. It means a lot to him, and while I would prefer to just elope, I am doing my best to research everything and plan an amazing wedding.\n\nI’m not poor, and neither is my fiancé. We can afford quite a substantial wedding as is, just not the big fancy venue he was hoping for. He asked what my parents were going to contribute.\n\nHere’s the thing - my parents do have a bit of a wedding fund saved up, but they’ve been under a huge amount of financial strain lately. Last year, my dad had a heart attack, and this year my mom had surgery. Now their house is having issues that comes with a hefty bill. When I told my parents about the engagement, they mentioned the wedding fund, and I told them that I would love it if they spent it on the house, and their comfort would mean a lot more than a wedding upgrade.\n\nWhen I told my fiancé this, he got very upset with me, saying that it’s his decision too, and just because I’m the bride doesn’t mean I’m entitled to make all the decisions for the wedding. I don’t disagree with him, but I didn’t want to drag my parents finances into it. He wants me to go back and ask for the money, but I refused. I think we can have an amazing wedding without it.\n\nAITA?\n\nEDIT: Nothing’s been booked, no other decisions have been made. The only decision I made was that I told my parents to use the money for something else and told my fiancé I would not be asking for it.", "created_utc": 1670583506, "permalink": "/r/AmItheAsshole/comments/zgu5vk/aita_for_telling_my_fiancé_i_wont_be_asking_my/", "score": 984, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I decided that it wouldn’t be fair to ask my parents for wedding money and instead asked for them to spend it on their sinkhole problem. (2) My fiancé believes he should’ve had a choice in this specific matter.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your husband sounds **horribly selfish**. He fully well knows what your parents are going through, yet feels like he is entitled to their money? So he wants your parents to live within a home with multiple issues just to have a fancier venue? That's disgusting, why would you want to marry a man like that?\n\nIf you can both afford to pay for a nice wedding with your own funds, do so. If he is so desperate for a better venue, save up more.", "NTA. Your fiancé doesn’t get to decide what your parents do with their money. You can both already afford the wedding on your own, and sure it would be nice if they could help but your parents have extenuating circumstances. Their needs come before your fiancé’s wants.", "NTA. He cares more about about a wedding than your parents' issues. That would be a big problem for me.", "NTA!!! You sound like a lovely, caring, practical and realistic person. You don’t want to blow someone else’s money that they could actually use for, say, living just to upgrade an already nice wedding. You really sound great. I’m hoping this is an anomaly for hubs-to-be and that he’s having a groomzilla moment.", "NTA this isn't a man you want to marry", "NTA\n\nWhoever wants a fancy wedding pays for it. You want to elope, and you are already compromising. Maybe your partner should learn some of that too?", "NTA He gets to decide whether you ask your own parents for money, but you don't get to decide the format for your own wedding? Am I reading it right that he wants a big wedding but you are still the one planning it?", "NTA! He has no say in how your parents spend that money, and you’re a good kind person to ask them to use the money for their own needs. Health and wellbeing come way before fun and parties. Your future husband can also put up more money if it’s so important to him, and it sounds like you’d also support him from your own funds - but your parents are and should remain separate!", "NTA But the fact he's disregarding the wellbeing of his future MIL and FIL and would rather have a flashy wedding instead makes me think you should reconsider your relationship.", "NTA\nThat was money for your wedding, put away for you and honestly the groom wasn’t known, you were the intended recipient. The groom being him is just happenstance. you had every right to ask your parents to use it in a way to make them more comfortable during a hard time. I may be leaning towards your side because I agree big weddings are honestly just a rip off and a waste of money, the memories are what matters. Not the size of the bill.\n\nAlso, seems kinda dick to be mad at you for using your money to help your parents instead of buying flowers that will wilt and a fancy venue.", "NTA.  Do not marry this man unless he *immediately* recognizes that acting entitled to other people’s money for *his* wedding is Groomzilla behavior of the highest order and quits pushing this.", "NTA, you're not making a wedding decision, it's a family one. You'll want to talk to your parents and make sure he doesn't try to go behind your back to them.", "NTA. \n\nAnd if your intended cares more about the big splashy wedding party than about actually *marrying* *you*, then that's a big red flag. They are not listening/caring about your feelings at all. \n\nThe compromise would be that you have a small pretty nice wedding that you both pay for yourselves. If they refuse to consider that (or your feelings) then please think hard about slowing waaaaaay down on this relationship.", "NTA\n\n\nEverything about this is a problem.\n\n\n- that the compromise is that you do everything you can that he gets what he wants\n\n\n- that you do this and he still says bs like everything is like you want it and not seeing you already gave up what you wanted\n\n\n- that he has no empathy for the situation of your parents\n\n\n- what do his parents contribute?", "NTA. You're not making all the decisions about your wedding. You've advised your parents, who are struggling financially, to use their own money to pay for their home and medical bills. He is not entitled to a single penny of your parents' money. In all honesty, neither are you (not that it's an issue for you). Their security and well-being will always take precedence over a party.\n\nKeep your finances separate when/if you marry. A joint account for bills is fine, but don't allow him unfettered access to your money. This entitled behaviour isn't something that will disappear with wedding vows.", "NTA\n\nWow, it's your parents' money saved up for YOU (irrspective of who you marry). So you absolutely have a say in how to use it. Your fiance does not.\n\nYes all other wedding decisions should be made together. But not this.", "NTA.   \nI think it's unreasonable for your fiance to dip into your parents' fund and drag your parents' financials further, despite them have dedicated for it before. You're doing good here by protecting your parents financial health & their comfort.   \n\n\nAnd as you said before, your wedding can be already amazing without their contribution, so why the upgrade? Most people will remember about the experience of celebrating with you both, not about the venue itself. In fact, you can even downscale your wedding so that you can have an extended and amazing honeymoon/vacation/spend on your comfort afterwards if you like.  \n\n\nThat being said, did you (or himself) also asked his parents to contribute I wonder? That might contribute to the 'feeling imbalance' part.", "NTA \n\nTell groomzilla that he’s not entitled to your parents money. You didn’t need to consult with him about your parents finances.", "NTA, and you wouldn't be one even if you actually wouldn't get an amazing wedding without that money. You probably want to fix the expectations situation with groomzilla", "NTA. I love and respect the choices you're making. \n\nAny idea why he's so attached to putting on a big show for just one day - are there cultural expectations?", "NTA. His decision? Yet not his money! This entitlement. Are you ready to marry a man who think he’s entitled to your parents money?\n\nAlso why are people in general planning weddings they don’t have funds for? I have people like that in my family too… live within your means at all time", "NTA\n\nYou need to sit down and have a long hard talk with him that ends with serious reconsideration of the relationship. When two people don't share the same vision of the size and scope of their wedding, it's a good test for the hundreds of compromises and negotiations that are ahead of you. He needs to scale back, and you need to know that he can not only compromise graciously but without holding resentment. Ultimately, very little in a happy marriage is about who gets their way. It's about how you treat each other along the way. After 12 years of very happy marriage, I can tell you a lot about this topic. I've rarely seen couples who hold resentment over the wedding end up well.\n\nUnder no circumstances ask your parents for that money. You did the right thing.", "NTA, that is still your parents money and for you to reject. It’s more common for people to use their own money for wedding these days and not rely on parents’ money.\n\nThe fact he feels he gets final say and lacks empathy is a big red flag for the success of this marriage.", "NTA. He's being selfish and shallow.", "NTA\n\nAnd I think before going any further you should sit down and discuss priorities \n\nYour priority is that your parents comfort and wellbeing matters more than your wedding day (and personally I 100% think that is the right way round)\n\nHis stance seems to be that the wedding is a priority and that your parents ought to contribute if they intended to regardless of current circumstances \n\nINFO: are his parents contributing? Because while it may be traditionally paid for by the bride’s family it seems unreasonable for him to want money from your parents in this situation if his aren’t also contributing - but even if they wish to chip in that still doesn’t mean your parents have to \n\nUltimately before you go further you should make sure you’re both on the same page about this and other important matters - like what happens if either set of parents get sick and cannot afford to live independently?", "Absolutely NTA\n\n\nHe's prioritising a party over your parents' welfare.\n\n\nDo you really want to marry a man like that?!", "NTA. I’m not a fan of big weddings but planning one is great for couples because it can reveal a lot about their relationship & the people involved. In your case, it revealed that your fiancé wants what he wants, and if it takes other people’s money to get him what he wants, then he wants other people to pay for it, no matter the burden it places on them. I would rethink marrying someone like that. It’s selfish & it shows a lack of character.", "Hmm... the guy is the bridezilla. That's a switch. NTA. Your parents have more important things to do with money than giving your fiancé his dream wedding.", "NTA its absolutely nothing to do with him what your parents do with their money. It was set aside for you not him. And you are absolutely spot on telling them to use it on themselves.\n\nYou are both adults, if he wants a fancy venue then he can start saving up and get married later. Its a privilege to get gifted money for a wedding, not a right. If your parents lose their home or health will he be inviting them to live rent free for life and paying their bills in return for the wedding fund? No.\n\nDont ask them, life is hard and its getting harder day by day. Your father sholuldnt be dealing with money stress post heart attack. Protect them from your fiance.\n\nHonestly please take some time and step back and re-assess the man you are marrying. This is worrying what he thinks he is entitled to.", "When you told your parents to keep the money, did they insist on giving it for the wedding or did they thank you for letting them keep it? Depending on how they responded, I think should help influence your decision. \nAlso, I think you and your fiance could benefit from working out a budget/financial plan. Discuss how much both of you are willing to spend on the wedding, itemize each expense, and calculate what the expected bills would look like and see if both of you are comfortable with the amount. \nIf you approach this issue in a reasonable manner and your fiance refuses/throws a fit, that is definitely something to think about. \nWhen my husband and I were engaged. We wanted to do just a courthouse wedding and a BBQ afterward. Then he got talked into having a formal ceremony by his best friend. Of course I was annoyed (I didn't want to spend the money) but I knew my husband now wanted it. That didn't mean rolling over and letting him blow all our money. Just lots of conversations and coming together to help each other make the wedding what we both wanted. \nHope this helps. ❤", "NTA. It’s your parents’ money. It has nothing to do with your fiancé. Either he needs to downgrade his expectations, or you both need to save more to have the wedding of his dreams", "NTA. Your fiancé has no right to expect anything from your parents. If his focus is on the wedding, not the marriage, and if money is already affecting the way he treats you, that's a huge red flag.", "NTA...But before you get married you and your fiance should sit down with a financial advisor and figure out where you two stand.   Because he sounds really entitled to money that has nothing to do with him. Especially when your parents need it to live.  It's not like they are spending on frivolous things.", "NTA, just tell him you will gladly ask HIS parents to contribute. \n\nYour big mistake was to tell him about the wedding fund when you didn't take it anyway and the money was never yours so far. On the other hand this gave your fiance the possibility to reveal some very huge red flags (feeling entitled to your parents money, caring more about a big wedding than about his bride and her family, trying to manipulate you with telling you you need to ask first before deciding to turn down your parents money when you aren't even married yet) and you would be kinda naive to ignore them. At least  insist on seperate finances after marriage and a prenup if you have assets to protect. I myself wouldn't marry this guy tbh.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m not a wedding person. So I think it’s a little hard to wrap my head around why my fiancé is so upset, so I am looking for an impartial opinion.\n\nMy fiancé has ideas for some big grand wedding. It means a lot to him, and while I would prefer to just elope, I am doing my best to research everything and plan an amazing wedding.\n\nI’m not poor, and neither is my fiancé. We can afford quite a substantial wedding as is, just not the big fancy venue he was hoping for. He asked what my parents were going to contribute.\n\nHere’s the thing - my parents do have a bit of a wedding fund saved up, but they’ve been under a huge amount of financial strain lately. Last year, my dad had a heart attack, and this year my mom had surgery. Now their house is having issues that comes with a hefty bill. When I told my parents about the engagement, they mentioned the wedding fund, and I told them that I would love it if they spent it on the house, and their comfort would mean a lot more than a wedding upgrade.\n\nWhen I told my fiancé this, he got very upset with me, saying that it’s his decision too, and just because I’m the bride doesn’t mean I’m entitled to make all the decisions for the wedding. I don’t disagree with him, but I didn’t want to drag my parents finances into it. He wants me to go back and ask for the money, but I refused. I think we can have an amazing wedding without it.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Massive NTA- yeah sure it’s his decision but if he wants it so bad he should use his parents money", "NTA. But I would add also take this opportunity to have a serious discussion with your fiancé about how you view your finances as a married couple. I also recommend pre-marital counseling.", "NTA\n\nThere are a lot of bad stories on Reddit about in-laws. Some of them could be true. One piece of advise you see a lot is \"your monkeys, your circus\". All that means is that it is up to each spouse to manage the relationship with their family. Sure, the other spouse can have an opinion, but in the end it's a decision for OP about her family. Just accept whatever consequences the fiancé imposes here. It sounds like he is a more traditional guy and expected the parents of the bride to pay a lot towards a big wedding.", "NTA, its not his decision what your parents do with their money especially after a damn heart attack.\n\nIf he wants a certain type of wedding he can fund it.", "NTA, your parents can enjoy this bit of comfort the rest of their lives, up against him having the day of his Dreams, that he cannot actually afford himself. \n\nI am definitely with you, I would not want my parents to struggles just so I can have a nicer venue at my wedding, especially since you are not even the one waiting that nice venue. \n\nI would really sit down and talk about this with him, because I would worry about this attitude. Does he even like your family, and want them to be well? Then how can he expert them to do this.", "NTA. Only your parents are entitled to that money, even though they put it aside for you. \nYour fiancé kinda needs to calm down. You don’t need to spend a fortune on one day, I’m sure you’ll be able to make it a beautiful and memorable day anyway.", "NTA\n\nOP what you did was amazing. You don’t want a big fancy wedding, you can already afford something great. He needs to realise this wedding is about what you both want and what will make you both happy. \n\nYour parents health is far more important than a big party.", "NTA.  If your partner wants a fancier wedding tell them to get a second job and make the money to pay for it.  Your parents health is more important than a wedding.", "NTA\n\n*\"When I told my fiancé this, he got very upset with me, saying that it’s his decision too, and just because I’m the bride doesn’t mean I’m entitled to make all the decisions for the wedding.\"*\n\nSorry, but your fiance is deluded if he thinks he gets any say in your parents' finances and how they use their money. Your parents can have ten wedding funds saved, and still use it for their own lives if finances become tight for them. \n\nThis IS a huge red flag, that your fiance puts a grand wedding ahead of your parents' comfort and well being.", "NTA and I would be reconsidering marrying someone who would prefer to see my family suffer.. just for a wedding", "NTA but your fiance definitely is. What a selfish bro-zilla.", "My wife wanted a big wedding ... but i hate weddings .(always fights/drunk ppl and other reasons )\n\nWe compromised and made a small weding with people we actualy care and speak ofthen.  \n\nWas just amazing and were both happy ....we paid for it , to avoid drama and others .\n\nWhy can you guys compromise?", "NTA, but if you two can't compromise on your wedding, how are you going to get through a marriage together?", "NTA for reasons everyone else is stating but I just wanted to point out: why are you the one doing the heavy lifting for researching and planning when *he’s* the one that wants a big wedding?", "NTA\n\nHe wants you to ask because he wants the money for the wedding he wants, not the wedding you want.  If he wants the over-the-top expensive wedding he needs to find the money for it on his own.  He can't force you to ask your parents for it.  \n\nYou need to get the point across to him that it's his desire to have the more lavish wedding so he should be responsible for the extra costs involved.  If he can't fund it himself, he should compromise instead of trying to force your parents to pay.", "You sound like a wonderful daughter. In this instance your husband to be is the AH. A perfect wedding is not about spending a lot of money. It’s about declaring your love to each other surrounded by friends and family. The venue my now decowife and I got married in kept telling us it was the nicest wedding they had ever held. It was also probably the cheapest and most down to earth, but everyone was comfortable and having fun.", "NTA! He thinks it’s HIS right to decide what YOUR PARENTS do with their money? Sounds like an absolute AH with no shame to me, I really hope that you know him well enough to be sure this is someone you want to marry.", "It's not his decision to stand by your decision an have your parents use the fund on themselves, or maybe take a small portion towards your dress so they know they have helped you, but they are not in anyway left short", "NTA. Your fiancé sounds selfish and small-minded. Who puts a wedding ahead of their in-laws financial well-being? Are you sure you want to marry this guy?", "NTA\n\nAt its core, it's your parents' money, so they can use it as they see fit. They wanted to put it on YOUR wedding, whoever the husband would be, so at this point it becomes YOUR choice to accept it or not. I understand it goes against your fiance wishes, but I think this decision is yours to make since it basically involve you and your parents.\n\nNow, on a moral side, I agree with your decision: a house is worth way more than any venue for a wedding.", "NTA. Your fiancé is heartless. He’d rather have one big night of fun rather than have your parents live comfortably. I think It shows he won’t help/care for them in the future. Look within, is this truly the man you want to marry?", "Nah- he’s not an asshole for assuming his future in-laws were going to behave in the customary fashion.  He absolutely should ask if he feels strongly.  You should be prepared for at least the possibility that your father will be embarrassed by your actions when your fiancé brings it up.  He may view it as you telling your future husband that your father can’t provide his final act for his daughter - not everyone looks at like that but enough do.\n\nPersonally I wish the custom were 30k in a down payment and an $1800 reception at the local moose lodge", "His thought process is that they already had the money set aside. I just don’t think it’s its fair to take that money and then watch them suffer financially. Maybe if it was before the pandemic, when they were living comfortably. But a lot of shit hit the fan since then. I know they would be fully happy to give it, they’ve been dreaming of me getting married and pretty sure they started saving up to convince me not to elope. :’)\n\nI guess it’s hard to see the good in a relationship from just a small instance of one fight. I’m hearing loud and clear that people think he’s selfish, but I don’t think so. I disagree with him strongly on this subject, but he’s an amazing man and I am very excited to marry him. He’s just very focused on having the perfect wedding and I think he’s a little sad that I’m not on the same page. But he’s given up a lot for me too and been my biggest supporter, that I want to make sure he gets as close to a dream wedding as possible. I just have this one boundary. I hope he realizes and sees that it wouldn’t be fair on my parents.", "We are planning it together, I’m just not really in the know of wedding things. We made a plan to decide everything together, he knows I’m already not getting to elope so he does want it to be something I’d enjoy too. I think that’s why he’s so upset, because he didn’t have a part of the decision of my parents’ money, I just don’t think that’s his choice to make.", "This is my train of thought. :’) I feel like a wedding is just an overly expensive party that lasts a few hours. But my friend explained it a bit better, saying that the memories last forever and that’s what really matters to my fiancé.", "I believe his parents are planning on contributing, I think that might also explain why he’s upset. I’m not sure how much. His sister is also getting married soon, in a few months, so I think they’re waiting for that to settle to see what the contribution will be. We’re pretty early in the planning - I’ve just been setting aside budgets and savings goals based on our own funds so far, I’d rather not rely on anyone else.", "I totally disagree, he should NOT ask. \n\nOPs parents offered it to her for the wedding fund, she turned it down because her parents well-being and comfort is more important to her than a large wedding. \n\nAt no point in this situation should the fiancé be butting in asking for money for a ceremony only he wants. If he wants all the extra bells and whistles, him and his parents can pay for them. There is absolutely no good reason why OPs parents should be funding his dream wedding with money that could improve their quality of life when their daughter doesn’t want that. \n\nAnd to lightly touch on this sexist little line “telling your future husband that your father can’t provide his final act for his daughter” She is not a piece of property being transferred between the men, she is her own autonomous being and she has already made it clear how she feels on the subject. She does not want the money and fiancé needs to accept no for an answer.", "I understand that this one argument can't speak for the whole relationship but this is a big red flag. Why is it so hard for him to understand that the pandemic has caused so much financial stress for everyone. Why must he have such an expensive venue to the point your parents will have to go without house repairs for it? I would be mortified to take money off my soon to be in laws who are financially struggling in order to satisfy my venue dreams.", "He thinks a party that only he wants is more important than your parents health and home. \n\nHow is that not horribly selfish?\n\nHe thinks that he deserves a party more than your parents deserve to spend their own money for their own needs. \n\nHow is that not horribly entitled?", "Open your eyes OP. The fact that he would choose one day of happiness for HIM, bc you’ve made it clear he’s the only one who wants this extravagant wedding, in exchange for a lifetime of suffering for your parents should scream volumes to you. Your fiancé lacks empathy and that’s going to manifest in a lot of ways in the future. Do not ignore this red flag. Nta.", "Are his parents contributing anything?", "Gottcha. When I read the post I felt like he was being really selfish overall, but it sounds like I was misunderstanding. I still say NTA. To me, asking your parents for money isn't a decision about the wedding. It's a decision about your family.", "Why isn’t he asking his own parents for money? You’re NTA btw and I think he’s acting entitled and selfish.", "So he acts like a baby because he wasn’t involved in your parents financial decision?", "He can have his memories and not spend all your extra money on it. There are tons and tons of ways to mitigate wedding costs, we rented out a cheap and private camp ground with beautiful scenery. It was unknown and a great find. The fancy venue is just silly, it’s a status symbol. It’s his wedding so he can want what he wants but it seems like he is dismissing your input as well. And then gets angry because you helped your parents who clearly NEEDED the help, you don’t NEED to go to the fancy venue. Idk I don’t mean that to sound harsh. It just seems he should take a breath and compromise.", "Okay... but Ir sounds like your fiance is doing the classic \"but it's MY day!!\" Thing (groomzilla).\n\nHim wanting an elaborate wedding doesn't mean he's more concerned about the ememories than someone who has a backyard wedding. This seems like a status or ego thing. If you love someone, you also don't want to see their loved ones struggle unnecessarily. The couples where 1 pushed for an overly expensive or elaborate wedding when the other didn't want anything near that usually don't go on to have the happiest and most supportive marriages. It's a lot of money and your fiancee is saying g he doesn't care about your concern for your parents or what you want at all. Will more occasions be steamroller by him? Does he only compromise or let you get \"your way\" on little things?  \n\nYou wanted to elope and he wants a wedding more extravagant than you can afford. The compromise shouldn't be just everything he wants... that's not a compromise. \n\nYou say he's kind and done a lot for you in some other comments... does he mention everything he's done for you ona regular basis? Do you have trauma in your past that you think you owe someone infinitely if they're sorta nice to you (not meant as a dig, I've been there)?\n\nReally look at your relationship to see if He's really as considerate as you've tried to say in some comments. I definitively  think you 2 need couples counselling asap if you're going to go through with this marriage.", "You don't remember the expensive decorations or food. You remember the look on your partners face or how they never dance but learned one especially for you.\n\nYou remember the moments in the wedding that remind you of love and family.\n\nUnless you are getting married for the wedding and not the life long commitment. Then you remember the people who wore the wrong thing and ruined your pictures.", "But you don't need to spend xxx thousand $ to create great memories. It is a celebration of you and him, not a show-off. To think what you could do with the money that some spend in a few hours just hurts my head. You could invest it in a house, car, or the future of your children. Some reals things for the future and not memories.", "Handling this yourself also means you can have a day you want - when other people contribute there can be an expectation that they will get a say", "I get what you’re saying but OP is concerned about everyone’s feelings so I’m giving my advice based on that.  It’s not bizarre for someone - like the fiancé - to have an expectation based on their own culture’s norms.  I don’t think arranged marriages are a good idea but I don’t think everyone who participates is awful, I recognize that it’s part of their culture and everyone’s culture grows at different places.  In OP’s situation there is at least SOME cultural expectation of father of the bride obligations - that’s why OP is posting.  I’m addressing those feelings as real and valid.\n\nMe saying her father may be embarrassed is something that is likely to happen and that OP is likely to care about.  I don’t support the underlying sexism, I support OP keeping it calm in her wedding prep as she has asked.  \n\nHe may bring it up to the father, I don’t advocate this (and didn’t above either), as they are family now.  I fully expect that convo to go poorly for him if he does, which probably would be better for everyone in the long run lol.", "Or the pained look on your parents’ faces as they try to figure out if they can get away with sneaking extra food in their bags so they can keep their grocery bill down for the rest of the month.", "Right. Sorry to be the bearer of bad news but you do support the underlying sexism otherwise you wouldn’t be making up baseless claims about OPs ‘cultural differences’ to support your stance.\n\nNowhere in the post or in OPs comments does she say this is a *father* of the bride tradition, in fact she very clearly says ‘my parents’ when referring to them. \n\n“He asked what **my parents** were going to contribute”\n\n“**my parents** do have a big of a wedding fund saved up”\n\n“**they** mentioned the wedding fund, and I told **them** that would love it if **they** spent it on a house, and **their** comfort…”\n\n“I didn’t want to drag **my parents** finances into it”\n\n“I told **my parents** to use the money for something else”\n\nAnd yet you still managed to come to the conclusion that this must be a patriarchal tradition involving the father of the bride paying for the wedding as his ‘final act’ before giving her over to future husband. Sexist.\n\nETA - and is it possible that her mother might feel embarrassed about the financial situation as well or that only for the father of the bride too?", "NTA but this may be a cultural thing. What does your wedding have to do with your parents? Were they supposed to front the cost? These are genuine questions because I would like to learn something today.", "NTA, but OP, do not get married. \n\nI'm not saying he isn't a good mam otherwise or that you shouldn't get married down the line, but he's currently throwing up some serious red flags in behavior. I'd put it off or cancel altogether until you two are on the same page.", "He can have the biggest and best wedding that the two of you can afford. His desire for a wedding isn’t the issue. The issue is that he thinks he’s entitled to your parents money (and the suffering it would bring them if they gave it) to facilitate that wedding. That attitude is incredibly entitled and selfish.", "NTA. Thinks he has a right to your parents' money. Remind him its not's your money. You're doing what's best for your parents by telling them to use it. Why isn't he asking his family for the money? Has a beer wallet with champagne taste.", "NTA. You guys are not compatible. Finance is one of the key reasons why relationships fail, along with poor communication. Reassess.", "NTA, but take a look at how he reacts to things like this before going down the aisle. Does he frequently act this entitled when things don't go his way? Or is he just excited about going all-out for his wedding and lost the plot?\n\nI also have older parents with a wedding fund. They are not in the financial strain your parents are (right now, at least) but with both of them retiring soon I am hesitant to use said fund. My SO agrees with me, he sees my parents as part of our family, so therefore wants them to keep their resources safe. (And doesn't want them to *have* to live with us in their later years- we love them of course, but we like our privacy and so do they.)", "NTA in any way. what youare doing is great.", "Red Flag alert!!!!", "Nta. It’s your wedding, you two should be paying for it.", "NTA. Op you are being realistic. Have the wedding you can afford. This is a bill or a relationship to die on.", "Your husband is a groomzilla NTA", "The wedding is his decision too, but taking money from your parents is absolutely not his decision whatsoever .  At all.  Not a bit.\n\nIs he a big “this is for show” or Instagram type person?  Does he care more about the wedding or the marriage?\n\nNTA", "NTA.  Op, ditch the groomzilla.", "NTA - I personally would rather run then marry this person.", "NTA\n\nThis does not bode well for a happy marriage at all. You two seem to be on opposite sides with very little compromise.", "NTA - He has no say whatsoever with the money your parents set aside for YOU. That is between you and your parents. Sounds like you are a very thoughtful person and are willing to compromise a lot regarding what you want for a wedding. Make sure he is willing to compromise to.", "NTA. Have the wedding you can afford. If parents want to give money, tell them to save it for a wedding gift with an amount they feel comfortable giving.", "Ewwwww….. just ewwwww. I would not be able to look that man in the eyes. His only response should’ve been…..” That is just another thing I love about you. You are willing to have a smaller wedding just to make sure others are taken care of.”  The fact that he only sees how this will affect his big party tells you more than enough. If you refuse to see this massive red flag for exactly what it is, then I truly wish you good luck, sounds like you will need it. As far as it being all about the memories, are all of your good childhood memories only from large expensive parties? Or do you think maybe, just maybe, this is another excuse. I’m sure if you think real hard OP, you can see that the price tag is not what makes a memory important. Money isn’t what memories are made of.  NTA", "NTA\n\n&#x200B;\n\n\" saying that it’s his decision too, and just because I’m the bride doesn’t mean I’m entitled to make all the decisions for the wedding\" .. Not taking money< from your parents IS YOUR decission. THey really can not afford it.\n\n&#x200B;\n\nBut now you know your fiance better ... do you really still want to marry him? He has NO care for others. He would rather see your parents destitute than forego the nice champagne at his wedding.", "Absolutely NTA and honestly your fiancé’s selfishness in this particular situation is concerning. I’d be appalled to take money from my in-laws that would be that much of a strain on things. If he wants the expensive venue so bad maybe he should go get a second job for a while and save up some extra.", "I think you need to rethink your engagement. Your values are in the right place and his are skewed. People do not need an Instagram wedding for it to be real and meaningful. NTA", "“he got very upset with me, saying that it’s his decision too, and just because I’m the bride doesn’t mean I’m entitled to make all the decisions for the wedding” - but you’re not. You are actively researching and helping in his dream of a big wedding when you yourself would rather elope. NTA", "NTA but he might go behind your back and pressure them to give the money.", "NTA. You can have the wedding you would like by paying for it yourselves and you parents can use their savings to sort out their house. Why is this nit logical to him? I’m not a fan of silly amounts of money being spent on weddings anyway, there’s so many better ways to use that money imo.", "Agreed. OP's parents' health and security take priority over having a big lavish wedding party. I think so many couples lose sight of the marriage/relationship and even their future financial security + interpersonal relationships because they are so laser focused on the show and dance of a one day social event. What is the point of having a luxe venue, pretty pictures,  extravagant decor and a lavish food spread if you create long term problems within your union...", "Agreed. A big party for ONE day is not worth putting your parents through financial issues.\n\nNTA, OP is reasonable and sweet. Fiance screams of entitlement and selfish", "You want to elope, and you are already compromising. Maybe your partner should learn some of that too?", "I think you just need to make it clear that the perfect wedding FOR YOU is one where you don't feel guilty about spending family money, and that that priority overrides the importance of any decoration or detail TO YOU.\n\nThis should help make it clear what his priority is: to find a wedding that makes you both happy, or to cater to his grandiose wedding vision.", "It doesn’t matter if it’s “already set aside”. It’s for YOU. Not YOU and HIM.  If you left him today can he wouldn’t get half, it would be saved for your next engagement. \n\nSo YOU get to say what it’s used for. Not him.", "As someone who worked in weddings, there is no \"perfect\" wedding. You can have a happy + fun wedding - but it will never be perfect. Something will always go wrong, and the more someone obsessss over the idea of \"perfection\" the more minor hiccups will negatively impact their perception of the day.\n \nHopefully your fiance starts focusing on you and your future together instead of the idea of a big, expensive party that you two cannot afford without causing long term financial hardship to your parents. These will be his inlaws. Does he really want to see them struggle so he can have fun for one day...", ">I guess it’s hard to see the good in a relationship from just a small instance of one fight.\n\nIf you're trying to tell us that he's \"not normally like this\" etc, let me tell you that a lot of people on this sub have developed enormous pattern recognition skills, so you're being told there's warning signs. Let me explain.\n\nUsing the patterns we've identified over other, similar, posts from people who have a partner's personality change dramatically for the worse after a major life commitment, we can confidently say when you're with a partner who flips a switch because they think you're committed past the point of leaving, your relationship will go down hill. It always goes down hill, badly down hill. \n\nSo think about why you are the one doing ALL THE WORK to plan this big extravagant wedding when you don't want a big extravagant wedding. The only thing he wants to do is to make a decision to put your parents into a position of financial hardship! He's showing you that he's entitled to your time, effort, skill, work, while giving nothing of his own, and on top of that wants to cause harm to people who are lovingly important to you. This is not a small instance of one fight, so don't review it in that context. Sunk cost fallacy is a terrible tool to measure your decisions.", "OP!!! An amazing man would not be upset about your parents keeping their own money.", ">He’s just very focused on having the perfect wedding \n\nHe should focus more on the perfect long-term marriage, not the perfect one-day wedding.", "NTA.\n\nBut it sounds like his parents haven’t contribute anything either, so do you not realize the double standard of your fiancé?", "Life throws things at us where it becomes needful to re-allocate saved money for necessities - like maintaining a dwelling rather than for luxuries like fancy weddings.", ">I think that’s why he’s so upset, because he didn’t have a part of the decision of my parents’ money, I just don’t think that’s his choice to make.\n\nHoney, the fact that he would think for even a second that he gets a say in what your parents (or anyone for that matter)  do with their money should be a gigantic red flag. That is incredibly entitled.", "Actually your friend is wrong. The wedding is one day out of your entire life together as partners. There will be other memories as you celebrate the milestones together such as your fifth year wedding anniversary, the birth of your children etc. . It should not be literally at the expense of your parents' well being and health.", "You can make amazing wonderful memories on any wedding - big or small. Expensive doesn’t necessarily mean perfect. More important than anything to make it a fondly remembered event is that everybody taking part is happy and content. \n\nYour parents saved up the money for your wedding in a time they were financially well off. Times changed, things happened and now they struggle a little. They really could use the money now and yes, it was meant for your wedding, but for the wedding YOU want you don’t need it. You would only take it because your fiancé has this inflated image of “the perfect wedding” stuck in his mind and isn’t willing to tone it down a notch or two.\n\nIf it was me and I gave in to his wishes and spend that money I would probably end up feeling unhappy on my own wedding, knowing that I waste money for something I didn’t really needed in the first place that my parents could have used for something more important. Resentment would creep in and ruin the memory for me forever.", "After working in the underbelly of weddings, you see that the modern wedding standard is a lot of clever marketing, social media expectations, premium pricing, and upselling.\n\nThe happiest couples who appeared to have the happiest weddings were the ones who let go of the idea of \"the perfect wedding\" and just wanted to have a good time on their terms. I had one couple who had a short notice wedding for various reasons. They said to me that they didn't give a solitary F about impressing anyone and would just tell their family to \"come through\". They just wanted to eat, drink and dance. Long story short, it ended up being a bonfire on the beach, a one tier cake decorated with flowers, a music shuffle mix, grilled food and her dress was off the rack. I took a couple pics for them myself since there was no cameraman. That was the best wedding I have ever worked (or been to).", "But if he presses the point and forces you and your parents into this, what memories would he be creating. He’d have his dream wedding venue, and you’d have have memories of your parents struggling and the guilt that brought - and resentment over the fact that this party was more important than your parents. His idea of a perfect wedding can’t exist any more, because to get it would mean undermine your relationship.", "This makes sense. Plan the wedding that you can comfortably afford instead of one that someone else will have to uncomfortably fund...", "That would be a big problem for me.", "It wouldn't even matter to me if they were - a wedding isn't as important as somebody's health, and if op's parents can use this money on necessities, that will deal with some of their stress. I wouldn't trust somebody who doesn't see this - if I was the partner, I would be seeing if we could help them out financially above and beyond giving up this fund. A big fancy wedding would leave me feeling guilty while family were struggling.", "You’re right she says parents not father.  I assumed father because every single culture I’ve ever heard of that has a dowry system the payment obligation is on the Dad of the bride.  In. fact Father of the Bride is an American custom that is so ingrained here it has a movie franchise named after it - I may be making an American patriarchal assumption, I’m unaware of any matriarchal systems that exist in this setting and are likely to be applicable to OP - are you?  Regardless, I think the advice I gave could swap “parents embarrassment for providing for their child” and be just as valid.  \n\nSide note: someone addressing the situation as it is presented isn’t them accepting it as moral.  If someone from India wanted advice on how to navigate an arranged marriage I would give advice on how to do that, not criticize the practice just to let a bunch of strangers know where I stand.  If your goal is to convince people over to your side you need to be less strident.  If your goal is to scold people, mission accomplished", "NTA.  Making joint decisions about the wedding does not mean making joint decisions about a gift from your parents.  And I would guess that because your parents didn't insist on you taking the money, they are actually relieved you declined.", "NTA\n\nAre you sure your values and your fiancé’s are compatible?", "NTA but that boyfriend is a piece of work. No one owes anyone a pile of money to blow on a giant party. I'd be rethinking whether I wanted to marry this guy.", "Hey look at that!!  You just got a totally unfiltered look at the jerk you're about to marry!  This is the best wedding present you could ever ask for.  Do you really want to spend your life with such a selfish and entitled person? Jump ship now, while you still can.  NTA", "Why are you ok with taking his parents money? Surely if you wont use your parents money you wont use theirs either.", "NTA \n\nHe is being a Groomzilla. I will say that you need to be clear about your parents' finances with him, though. If you plan to marry him, then there is no reason to hide it. Tell him that he should know you well enough to realize you wouldn't be able to enjoy a big wedding knowing the money your parents saved would have made a massive difference in their quality of life.", "invest in your future married life. Don't splurge on a wedding.\n\nNTA", "NTA \n\n>just because I’m the bride doesn’t mean I’m entitled to make all the decisions for the wedding\n\nYes, the decision on what/where/when/how much to spend/etc on the wedding is on you both.\n\n>saying that it’s his decision too\n\nNot his money, not his decision. It's not even yours, because you might reject the money from your parents but doesn’t mean that they'll use it. \n\nThis is a very entitled and selfish behaviour from your fiancé.", "NTA but you husband sure the hell is. You sound amazing for wanting your parents to use the money for themselves, your husband sounds entitled and selfish.", "NTA. \n\nYes, you two do need to make decisions about the wedding when it comes to YOUR money and the actual wedding. \n\nThat money was saved by your parents for you, they didn't know who you would end up marrying, so that is a gift to you, and it is reasonable for you to want it to go back to them for really essential things. That's not a decision your fiance gets to make. \n\nI am sure you otherwise have a great relationship, so I would sit down and talk to him. \n\n1. You could not enjoy a wedding where this money was used, because your parents need it, and their NEEDS are more important to you than a bigger party. Be clear that there is just no way on earth you could imagine using this money on a party when your parents have bills that need to be paid. \n2. You didn't even consider asking him because this was a gift saved for you, and it was so clear to you where this money was needed. You will not put your parents in a financial bind when it isn't necessary, and if he thinks that is appropriate and wants to continue being upset about it, then you two need to assess how you move forward when you have very different values. \n3. You two need to agree on a wedding budget, based on what you can actually afford.  There is no going backwards about this money, so he can now decide how he wants to move forward and he has to let this go if he wants to move forward- aka, no passive aggressive comments, certainly he never mentions it to your parents. \n4. If he wants a more expensive wedding than you do, he needs to pay for it. Sure, you can meet him in the middle, but if he wants to spend $50k and you want to spend $10k, then maybe you go up to $15 and he needs to come down, or make up the difference himself. I have friends who got married and were on a budget. One wanted to spend more to have the day of his life, the other was clear that some of what he wanted was simply out of his budget- not an option- and that other things were a stretch to afford but possible. They agreed that the one partner would pay for more, because he wanted it, and the other did stretch a little to meet the other stuff, and all was well.", "NTA but your fiancé did one good thing, he showed you who he is before you actually married him...I hope you really think about what type of person you would be marrying and possibly have children with, please OP think long and hard about marrying that person", "as your fiancé he should care more about your parents health and stability than his big fancy wedding. no, how much money your parents contribute to his party plans is not something he has any say in, thats up to them. hes being really concerningly self centered. red flags", "NTA you better think about marrying this person.", "NTA\n\nYou're being extremely pragmatic in your decision whereas your husband appears to be selfish.\n\nMy take is that my decisions impact my lifestyle. I depend on no one to pimp out my life. If my parents want to provide me with a gift, then I'm open to receiving it. Our wedding was an intimate event because that is what our budget allowed. Not once did I have the expectations that my parents would financially support the day - is it just me or is that an old school, antiquated school of thought?\n\nGood luck with planning.", "NTA my mouth physically dropped open while reading this. I think it's a HUGE red flag that your partner is more concerned with a wedding event for appearances, than your financially struggling parents, or just your wishes for your parents in general. It is NOT his right to have access to your parents money for a social event. I think this is the tip of the iceberg for some fundamental issues you will be running into with him throughout your marriage.", "NTA.  Perfect wedding and dream wedding are not always the same thing. I had a perfect fabulous wedding with everybody I wanted to be there, and fed them dinner, for $10,000. People remember it as fondly and had as much if not more fun than another family wedding that was easily over $100,000.\n\n Planning a wedding is a test of many relationship skills. Pay attention here. It's way cheaper to get out of a relationship before you are married then after.", "NTA. I really don’t see why people expect someone else to pay for their wedding. You’re doing right by your parents, and I’m sure you can find a way to have an amazing wedding without their help.", "INFO: otherwise, how sensible is he with money? Does he save up for major purchases, does he buy on credit then how does he manage debt, or does he make his parents pay? \n\nHe wants you to disregard your parents’ health and security, to spend show-off levels of money he doesn’t have, for a party you don’t especially want, and is shaming you for disagreeing with his demands. Is it going to be like this every major birthday? \n\nUltimately, to have a healthy partnership, you need to have compatible spend/save values AND you have to be sustainable. Two spendthrifts can be happy together until the money runs out.", "NTA. Is your fiance like this with everything or just this elaborate party that's called a wedding?  He seems incredibly entitled.  You may need to rethink this wedding.  He has no problem putting your parents in a financial bind just for a damn party.", "I've been reading OP's comments, you sound like a wonderful person, and also an enabling person that does alot of explaining and excuses for your partner. Please for the love of God, don't waste your life on an asshole. Give yourself more time being engaged, because I do not think the man of your dreams would lack this much empathy. He may be great and nice every other day of the week, but if his weakness is caring about the people you care about, or putting material things or his wants/needs over everything, then we will be a nightmare on every big real life issue during your marriage.", "Who is he really trying to impress with this expensive venue?", "NTA\n\nAre you sure you want to marry this guy?  It's the 21st century; no parent should be expected to kick in for a wedding.  He wants a big wedding?  He needs to figure out how to pay for it.  \n\nGiven how different your wishes are for a wedding, are you at all concerned as to how that will play out in the future?  With any children?", "Oh hell NO...  your parent money is NONE of his concern nor does him get a say in it....  He want's the big wedding, then he pays for it.....  It's selfish and greedy to expect your parent to pay for YOUR wedding...\n\nI find it concerning that he shows no empathy for your parents struggles and is ask for them to donate to your wedding.  That is a HUGE problem...", "NTA  we are in hard economic times.  Your parents need to take care of priorities, not throw you & him a fancy party.  It's amazing how people get so sucked in by this \"dream wedding\" BS.  In this instance your fiance is being a TA.  I hope you can bring him out of his wedding haze & back to reality.", "Imagine what divorcing this guy will be like. Run now!", "NTA\n\nYou aren’t the one asking for an extravagant wedding, so I’m not sure why you should find the money, especially by taking it from your struggling parents. Your fiancé sounds super selfish", "Ooh, I don’t like the sound of your fiancée 😳.\n\nNTA you and your parents sound kind, reasonable and considerate.", "You may not be able to make all decisions,but you can certainly make this one. NTA.", "NTA I can’t wrap my head around the fact that some peoples parents pay for their children’s wedding. Like a person is getting married, huge major life changing decision, and you need your mommy or daddy to pay for it? Weird. Weddings don’t need to be extravagant", "NTA. You did right. Your fiancé on the other hand....you sure this wedding is a good idea? These red flags tend to grow into giant flaming bonfires after several years. You sure you want to sign up for that life??", "This is NOT his decision, too. This is one of the last financial decisions you'll make without him, but it is purely your decision whether or not to take this money from your parents. Tell him what you can contribute, and start working on your budget for the wedding. NTA and good luck!", "NTA…the wedding may be his decision as well, but who pays for it is not.  No one gets to tell anyone else what to do with their money.  Your parents put money aside when they could.  They are now in a situation where they need that money for their future and you can provide for yourself in your own.  Be wary of marrying someone who has no empathy and only seems to think of what he wants and needs.", "NTA - Your family; your call. I respect what you're doing here so much. Have the wedding you can afford. Extras aren't worth the price to your parents. You see this clearly, and you are absolutely right to not want to take your parents money.", "NTA, but the thing is, OP, it’s NOT his decision, too.  That money is your parents money, that they earmarked for YOU.  The decision of whether to use it or not rests solely with you and them, fiancé has no say about that.  And you are doing the right thing by your parents.  They need that money more than you do.  He needs to back off.", "NTA... it is your decision.  Your parents have a need. You declined a gift, the money wasnt technically yours it was an idea that was generous but not practical. \nYou also are not in need. No one will suffer from not accepting a gift. \nHope you find a compromise with your wedding.", "> just because I’m the bride doesn’t mean I’m entitled to make all the decisions\n\nUmmm does he not see the irony in how entitled HE is being wanting money from your parents??? NTA.", "NTA. Here’s a decision: cancel getting married.", "NTA. If he really is your biggest supporter he would understand that you don’t want your parents to suffer financially.   And he should not either. Parents are important. They helped you become the person you are and to be self- supporting. You and your fiancé are young; you can work and make money. Not so for your aging parents.", "NAH, but if your boyfriend keeps pushing then he is an asshole. He is under the impression that you and he are entitled to that money. He is not, you would be. It is entirely your choice as to whether or not you would use it. \n\nHe's coming from a misplaced sense of fairness. He's contributing, his parents are probably throwing in some, why aren't yours? It doesn't seem fair to him. He's going to have to get over it.", "I think FIL would be more embarrassed about having to ask the newly weds for financial support after they’ve drained their bank accounts paying for the wedding. People who think their aging parents should blow money on a party, instead of planning for retirement in a country where it is very expensive to get old are selfish aholes and should learn to spend within their own means. If I was OP and my future spouse had the same view point as you, I’d dump him.", "I think it’s up to my fiancé if he takes it or not, if they contribute anything. I’ve been budgeting on our money and our money alone!", "“He’s an amazing man…”\n\nBut he’s willing to see the parents of the woman he claims to love suffer just so he can throw a party to impress everyone except the woman he claims to love, who would actually prefer the exact opposite.\n\nYou have already completely given up on everything that you wanted your wedding to be, yet he’s calling you entitled and says you’re trying to make all the decisions? \n\nYour standards for “amazing” are a little low, hun! Being kind and supportive is literally the bare basics of being a partner. Making compromises is the default of how a relationship should work. How bad are the singles in your area if just actually being a decent human being is enough to class someone as “amazing”?\n\nYou’re NTA, and you’re very much in the right to make this a hard boundary.", "Funny how many come here saying \"but he is amazing\" whilst also telling us he wants to put your parents in a shit place for a jumped up party. Fuck all amazing about that. \n\nAnd the entire \"Decision\" bullshit is another flag raised. \nSure this is a single incident in an entire relationship but he's still happy to throw amazing away because you won't let your parents suffer...fuck me.", "> When I told my fiancé this, he got very upset with me, saying that it’s his decision too, and just because I’m the bride doesn’t mean I’m entitled to make all the decisions for the wedding. \n\nUm. NO. It was set aside for YOU and whomever you married. You do get to turn it down.", "He's so fixated on a wedding that he isn't thinking of your family. He isn't thinking about your parents or you, he is focused on one day. Your parents should struggle financially long-term for one day.\n\nYou can have a perfect day that doesn't involve blowing a ton of money. Your wedding is supposed to be about your love and the family and life you are building together, not about a venue or the food. \n\nHe is selfish. He believes your parents should go without things they need for the sake of his wants. They think that you should demand money from your parents and potentially harm your relationship with them for his wants. Because he wants it, wants it, wants it. He's behaving like a selfish brat and do you really want to set the precedent of being willing to sacrifice the needs of others for things he wants?\n\nYou going to sacrifice any college fund you've built up so he can buy a new car? Are you going to demand money from your parents because he wants a nicer house? Seriously, he knows your parents are struggling and he wants to snatch money off them and you think this is okay?", "Girl he is really selfish he is literally asking for your parents money how do you not realize this is a red flag :(", "It think many people have a vision of their wedding from when they were little. And as that vision is confronted with the reality of their partner's preferences and the costs and choices that have to be made, it can turn people into frustrated children. \n\nMy suggestion is rather than name call or ask who is TA, ask what is a reasonable path forward?\n\nIt seems to me that you have already started looking at venues and making choices BEFORE having established your budget and where it comes from. Neither of you should be counting your parents' money. But maybe you should both have a conversation with them about what they are comfortable supporting. Perhaps you can ask for the money, perhaps a smaller amount, perhaps none. Perhaps it is alternatively them hosting a rehearsal dinner or something and they can choose the budget. \n\nBut as a couple - he shouldn't ask you to \"go back and ask for the money\". You both together need a shared plan as any money would likely be a gift to both of you.", "He sound positively delightfully full of red flags. NTA", ">He’s just very focused on having the perfect wedding and I think he’s a little sad that I’m not on the same page.\n\nThe perfect wedding consists of you and him declaring your love and devotion to one another. If that isn't enough and it really also needs $$$$$, and your parents in a poor financial position - I would strongly reconsider.", "As long as he accepts your boundary, then maybe everything will work out, but don't give in.", "Are his parents contributing?", "Tell him the wedding  is 1 day he needs  to concentrate  on the matrimony  that comes after for the rest of your  lives.  Nta  your fiance  is .", "Dont worry...redit will tell you to dump a man or divorce him no matter what you post typically....probably find sone post telling you about all the red flags for abuse too if you read far enough! NTA..ypu said you can afford a nice wedding...its very kind of you to decline the money for a more extavagant wedding to help your parents out. Remind your fiance that a wedding celebration is a few hours...its not worth dumping near as much money as people tend  to spend on them in the long run.", "So will memories of your parents ending up broke.", "I used to work weddings. The only thing people really remember is the food, bar (open, limited options, not enough beer, etc), and the photos. Everything else is just general, vague impressions: “the tables were pretty,” “flowers were nice,” “it was so hot,” etc.", "Memorys should not cause you or your parents  to go into debt for one day..your friend is ridiculous & wrong..memorys are made by the people you surround yourself with, not the money you spend", "The memory that lasts is how you feel, and you have to ask if you are going to resent the ostentatiousness that could have been a house repair?\n\nHe’s pushing you to go against your values (modesty, people are more important than stuff, self-sufficiency) to give him money your family has greater need for. That says it’s time for premarital counseling.", "I got married 7 years ago. A friend of mine got married the same year. She had this \"the memories last forever\" mindset too. I had more of a \"my future is more important than one day\" mindset. We had a wedding we could afford and they went all out. They were divorced before the debt was paid off. Those expensive pictures are worthless now.  We still have our pictures up in our house and we are still making more memories. Be careful making too many justifications at this time. It's important to have the hard conversations and make the right choices right now.", "I don’t think it’s quite that dire", "My partner wants to help my mother with her mortgage because he wants to lessen her burden.\n\nEven though he is not making a lot. And even though my mother is not exactly the easiest person to be with.\n\nI... have no idea what to say about the OP's fiance...", "yesterday we read the same scenario where it was the BRIDE wanting a big fat Greek Wedding and the DH wanted a smaller venue because they both lost their jobs. It's the union of the couple that's important NOT the splashy wedding. Hold firm OP!!", "But it s not even  happiness  , maybe pride and ego", "Former caterer here.  This.", "This is an excellent point and an excellent clarification. OP needs to do a hard story and reevaluate. 🏆👍👏👏👏 NTA", "Damn, that paragraph is an amazing summing-up!", "Another survivor of the wedding industrial complex here. The best weddings I've catered or attended were- Botanical garden, remodeled barn at the coast and TWO that were glorious DIY Bohemian extravaganzas at the bride and grooms' homes. They were all beautiful, fun, relaxed, and heart warming. \n      You don't need a huge, expensive venue to have a \"perfect\" wedding. In my experience, the more expensive the venue the more stressed the wedding party was.", "You have a partner with empathy who cares about you and wants to ease your worries. \n\nOP's fiance is something. Usually people are at their best during this time in their relationship. I don't think this is going to turn out to be out of character for him.", "Either way, he is an AH for putting that above his future spouse’s family’s health and wellness. Borderline evil imo , especially considering OP said neither she nor her fiancé are poor in the first place.", "Exactly. Truth be told, the wealthier couples often had the more low key fun parties since they weren't trying to one-up anyone or prove anything. And, for those couples who care more about the photos than the guest experience.... I wonder if they know that a good photographer can make the most modest affair look magical..... \n\nIf the couple really cares about having a good time and needs to maximize their budget, I'd say, spend your money on good food, good drinks, and good entertainment opposed to all of the other extras. Let the scenery do the heavy lifting instead of paying $$$$ on lavish decor. Forgot the expensive favours - guests don't care about them. Send out digital invites or only get a few hard copy for those old school guests. Get a smaller cake for cutting instead of a $$$$ one that will go to waste. Ditch the super well known designers and get a good quality gown vs a brand name gown. Etc....", "Without a doubt.  But at least if it would have brought him happiness  it would have  lessened a bit the ah-lishness\n\nThis is somehow worse", "Your fiance sounds like he has an entitlement mentality.  NTA", "NTA\n\"It's his decision too\"?! On how your parents will spend their savings ? I think not. \n\nI personnaly would think twice before marrying someone who insists on spending other people's money for status, futile expenses like a fancy wedding. \n\nThis does not speak well for his financial abilities.", "Your fiancee rightfully knows it is his wedding too. However, neither his parents or yours are on the hook to pay for it.  \n\nThat leaves the wedding you plan up to the two of you alone.  How you share the mix of preferences and concessions will determine after marriage decision making. \n\nSo you don’t need this elaborate wedding but will go along with it for his sake.\n\nHe says he will elope if you want that but has let you know how much he doesn’t want to do it. \n\nSo far, the compromise you made is to go along with the wedding he wants that you can both afford though it is way more than you would choose.\n\nWhat compromise has he made to meet the one you made?  He has asserted that this is his wedding too and that you cannot expect to make all the decisions.\n\nHe wants your parents money. He is angry you let them off the hook without consulting him.  Would consulting him have been about his exercising veto power i er your decision?  Is that his idea if sharing decision making.he decides; you just say, “Yes dear.”\nWhere in all of this has he given anything up as a concession to your equal standing?\n\nConsider this a pivotal moment in which you are presumed to always defer to his and his parents’ wants and needs.  Is that ok with you?\n\nSuggest to him that is your parents give the wedding fund to his need for an elaborate wedding, they will be buying decision making for the wedding; just as his parents are purchasing decision making rights. Is he prepared to have them disagree with his wedding decisions. \n\nHow about you two pay for the wedding you can afford and neither take parental money. That way only you and he will be deciding.  \n\nIf he wants more then he should pay for it because you don’t need that.", "NTA - Have a wedding that you will both enjoy without breaking the bank. It's great that you have your priorities straight and told your parents to spend the money they had put aside for your wedding day. They might still gift it to you, but putting their health and safety first shows how caring you are. For your wedding, you can have a decent event without spending much.", "sounds like your future husband still under his family's thumb, be wary about that\n\nNTA, he didn't have to know about your family's money nor he has a say about the wedding fund, that's on you only because it's your **family's money**, if he's so desperate to throw a huge wedding for his family then he or his family should pay for it", "NTA. Your parents have a fund for YOU to marry whatever human you decide. It is your money and your decision.", "I am so pleased with your update. Sounds like he got swept up in his family madness and if his parents paid for his sisters wedding they probably would expect yours to do the same. I hope you find a solution that works for you both and have an amazing marriage. NTA", "NTA.  But your husband is a grand AH.  Please carefully think over your relationship and is this who you really want to be attached to for the rest of your life?", "OP i am so glad you and your Fiancee talked.  There is a difference in planning a wedding verses planning a marriage.  You and fiancee plan a marriage.  Think about going to premarital counseling.  I have a feeling this will not be the last time his family pressures him with other decisions.  He has to hear your voice above his family's.", "If his family is the one pushing for the big, expensive wedding, then I think it’s fine to expect them to pony up to make it happen.", "Don't sweat it too much. The more you're on this sub the more you realize people have a very black and white view of posts. One event where the person isn't being that great? They must be the devil incarnate. Anyone telling you it's a red flag don't know your fiance as well as you do, so just ignore it.", "An amazing man would not insist that your parents live on ramen noodles for a year so he can have a fancier venue for a day. This is not \\_his\\_ money, it is yours. They saved it for YOU. They are not his parents, they probably didn't know him when they started saving.", "No. Even the most marvelous memories don't matter when you're in financial stress.\nFurthermore, what makes wonderful memories are the emotions you lived at that time, not the money spent. If he keeps forcing your hand over this, thé wedding memories will be embittered by the thought you took money from your parents that they had need of. \nBut maybe his will be embellished by the thought he got you to do what he wanted.", "I have a lot of good memories of my wedding day and it cost less than $500 total. I would be careful of this idea that more expensive = better always.", "> people who have a partner's personality change dramatically for the worse after a major life commitment, we can confidently say when you're with a partner who flips a switch because they think you're committed past the point of leaving, your relationship will go down hill.\n\nThis resonated with me.  I thought my dad's ex-girlfriend was a wonderful person when they first got together.  Things changed when they bought a house together (paid for it 50/50).  It started out with small nasty comments, but it didn't take long for it to escalate.  Thankfully, my father got out of the relationship, but it took far too long for that to happen.  \n\nI'm sure OP's fiance is wonderful when things are easy.  But when things get tough, and apparently wedding planning is tough, that's when people's true colors are revealed.  Or in my father's case, when they think they've got you trapped and you won't leave.", "NTA home and heath trump's a party on one single day. \nThe actual marriage doesn't cost much, so it really is the party that's costly. It's ridiculous to put that above healthcare and home stuff.", "NTA\n\nYour fiancé has no say in what your parents do with their money. Does he really think that he is entitled to your wedding fund?\n\nYou phrased it beautifully to your parents. What a loving daughter. ❤️", "I o", "It was never his decision. Its your parents' money and your fiancé will never get a vote on that. (Its not like you refused a gift on his behalf. They mentioned they'd saved some money to use on your wedding. But, their needs have presented and its still their money.\"\n\nNTA. Glad it worked out for you. No one puts their hand in my parents' pocket.", "NTA, 99% of people look back and wish they spent less money on their wedding.", "NTA. Your parents $. Not fiancé’s. Fiancé is very entitled. Lots of red flags here with him.. think about it.", "NTA and good on your husband for admitting he was wrong and letting you know he's more or less kinda being pressured by his family. You definitely should have told him about your parents financial struggles though, I don't think that's information you should really be keeping from your partner who seems like a great person. He's apart of you and your parent's family as well.. maybe the reason he was most hurt by you not telling them what they're going through is because he wishes that he could be there to help them out too? He seems very trustworthy and it feels like he just wants to work as a team with you instead of keeping things secret. You telling your parents to use the wedding fund they had saved to help themselves is inevitably your decision though. Even if he WAS against it, it's money that your parents saved for YOU and YOUR/THEIR contribution to the wedding and was probably made by them before you even met him or got engaged to him. If anyone is TAH it's his family for trying to put pressure on him to have \"grand\" wedding. They should just care about his and your happiness, but seeing as they also (probably) pressured his sister into a big wedding (or she was spoiled enough to just want it to begin with, just like them) that seems to be the least of their concerns. Do your parents in law think that the wedding is for them or something?", " NTA - I am so happy about your edit, and that the two of you talked it through.  The bride's family traditionally pays more than the groom's family when it comes to the wedding, so it makes sense I guess that his family would contribute more to his sister's wedding than to his.\n\nYou guys should totally elope and have a huge party/reception when you get back.  Do a slide show with pictures from the wedding and it'll be perfect. \n\nBest wishes to you both!! 💗🥂", "you are nta.\n\nwhy are you marrying a man who thinks that displaying wealth (that's not even HIS to display) is more important than your parents' health and home? he literally thinks it's more important to show off than to respect and take care of your family. \n\ndon't marry this \"man.\"", "You’re NTA\n\nWhy can’t you elope and then have a big reception? So have your nearest and dearest for your wedding ceremony somewhere that’s important to you and your fiancé as a couple then do the big bugger off reception to appease his family? \nSeems a happy compromise:", "NTA. You are an amazing person and your fiancé is acting quite unreasonable.", "NTA. \n\nI read the update and you could elope and then do a big reception. I’m glad he came around and understood why he was a jerk.", "NTA - and he still is even after the update. WTH, your parents saved money for you, and he thinks he's entitled to make a decision on how its spent? It doesn't matter if he apologized for everything else, he's still stuck on his sense of entitlement to SOMEONE ELSE'S MONEY, which void the apology IMO", "he's not an amazing man, though. he thinks it's more important to show off with an opulent wedding than to take care of family. it's beyond selfish. it's ridiculous. this is what your life will be like going forward.", "You can have wonderful memories of a much less costly party too. Does the price of the champagne influence the toasts people make? If so, you need different people in your life.", "SO WELL SAID!!! we see this over and over, and unfortunately, a lot of us have first-hand experience with this type of person.", "NTA. You were already compromising on not eloping and wanted to make it special for him as well. The fact that he's trying to dig into their funds and ignoring what is going on their lives is extremely cold. Youre not asking to help supply money to your parents, you're asking them to use their own money on themselves in their times of turmoil. Big weddings are there for 1 day, the stress that takes a toll on your parents lives and sacrifices they possibly have to make will have more impactful effects that he's willfully ignoring.", "Great update! Glad you all had a talk! Good luck with your wedding!", "NTA - you sound like a very reasonable person. Your fiancé, though … not so much. I’d be very wary of marrying someone who feels so entitled to someone else’s money.", "In terms of compromising now that he has realized what the wedding is really about - as the youngest of 4 who had to be in all of my older sibling's huge weddings, I wanted to elope. As the oldest of all the cousins and the first to get married, my husband wanted a more traditional wedding. We compromised by having a destination wedding in another state. We gave everyone almost 2 years notice and weren't upset when people couldn't make it. I got the smaller and more unique experience and he got the more traditional wedding set up he wanted and both sides of our family STILL talk about our wedding 10 years later (good things haha).", "The nicest wedding is the one you can easily afford. It doesn’t matter if you have a Las Vegas wedding, get married in a park, or get married in your own home. Why not invite immediate family members only and book a table for 12 at a nice destination resort? You could chose something close to where you live or go to an island. If I were in your situation, I would wait two more years and let everyone calm down enough to keep their nose out of your wedding day. Perhaps this is a warning sign.", "NTA and be sure your future in laws don't take it upon themselves to contact your parents about money.", "NTA, I'm coming in from the update. I really think you should tell your fiance that you were going to pause the wedding plans and go to counseling together to determine whether or not you should be getting married. Because the fact that he came at you entirely to please his parents is a problem which says that at this time his priority relationship is to his parents, not to you.\n\nIf he is not ready to be your life partner you shouldn't be getting married", "NTA- but the update sounds like fiance is just back tracking and making excuses. Given the change he’s going to do this again sometime…I don’t believe it’s any of his business what you and your parents decided to do with the money they saved for you. He’s being manipulative and is only backing down now so you don’t realize…. He was willing to let your parents suffer for his ego. You need to be careful. This doesn’t sit well with me 😬.", "Exactly, and even with the reframing where he says he's just trying to please his parents, doesn't make it any smaller of an issue. If he has no concern for how your parents are doing, and is prioritizing his parents over everyone else, he's not ready to get married and he is a questionable partner", "And now the new compromise is that they still Rush toward getting married. Like either way he's still trying to tie you to him desperately but not address the core issues here. Don't marry this guy, go to counseling to see whether or not it's even a relationship worth working on", "You are incredibly naive. Marrying this man will destroy you. But you're just gonna do what you're gonna do. One day you'll look back on this moment and you'll wish you had been wiser.", "This is an awful comment."]}