{"id": 4321, "submission_id": "zgxyri", "title": "AITA for not letting MIL see sick daughter after she started bullying her", "selftext": "I (m36) have a daughter (12) 2 Week ago she got diagnosed with leukemia (ALL). I'm a single dad, my wife passed away when our daughter was 2. \n\nmy MIL (60) lives 3 hours away but comes to visit pretty often. My MIL always wanted a “girly” daughter. My wife was not into traditionally girly things. Neither is my daughter. That doesn't stop MIL from buying her dresses and other things she will never use. \n\nAbout 5 days ago daughter asked if she could maybe dye her hair since it'll fall out soon anyway. I figured why not I talked to a friend who works at a salon... now my daughter has super cool blue hair. She had the biggest smile on her face when she saw her new cool hair. \n\nMIL came to visit yesterday... She freaked out once she saw her daughter’s hair she was saying daughter had such beautiful blonde hair and now it's ugly. Daughter instantly got teary eyed chemo has already been emotionally exhausting for her she didn't need her grandma making comments like that. \n\nI made MIL go in the hallway (we were at the hospital) I told her that was so wrong to call daughter ugly. She started saying well it is ugly. I cut her off and said just leave then if you aren't going to say anything nice... Well, she left and I hugged my daughter and told her she was beautiful. \n\nI later got texts from my BIL me asking why I made MIL leave. I explained the situation, BIL said it was still AH move  to not let MIL see daughter when she is sick and that I probably shouldn't let my 12-year-old have dyed hair anyway. So AITA?", "created_utc": 1670594122, "permalink": "/r/AmItheAsshole/comments/zgxyri/aita_for_not_letting_mil_see_sick_daughter_after/", "score": 68, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I'm the asshole for not letting my MIL see sick daughter even though she was rude to her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ABSOLUTELY NTA. Your kid comes first before anyone else's feelings. It made your daughter feel better about herself when she was not feeling well at all. If your in-laws want to keep agreeing with mil, then they can go sky diving without a parachute. \n\nHope your daughter feels better.", "NTA\n\nI'm guessing your daughter doesn't want to see her grandma right now either. If and when she wants to see her again you should have a firm talk with grandma about what is appropriate to say to someone else. Seeing people is not a given right, and commenting on other people's looks is a safe way to get cut off.\n\nBet your daughter is rocking that blue though!", "Fuck them! You did the right thing and it was her choice to leave since she couldn't say anything kind or supportive. Your daughter is lucky to have you as a dad.", "NTA. The behavior you described has me a little agro, and all I did was read about it on Reddit. You handled that with more grace than she deserved. \n\nI hope your daughter gets better.", "NTA. They can go fuck themselves", "NTA. Your MIL sounds like a piece of work and your BIL either doesn’t have the actual full story or he’s also a jerk", "NTA you don’t call kids ugly period. Especially a kid with cancer and then consider this if her reaction to blue hair is “you had beautiful blond hair now you look ugly” what will be her reaction when your daughter loses all her hair? Will she say she is ugly without her beautiful girly blond hair?", "Wtf.  You are a great dad.  Keep loving and supporting your daughter and fuck everyone else.\n\nAnyone who thinks it was fine to tell a 12 year old girl with cancer she looks ugly doesn't deserve to see her.  Full stop.  They owe your daughter a heartfelt apology or they can wave at her from the parking lot.", "NTA, top tier dad here.", "NTA Bravo for letting your daughter dye her hair. While I am sorry MIL lost her child, YOU also have a sick child. MIL is not only causing your daughter stress and sadness, but YOU as well. Bad enough having to deal with leukemia let alone this baggage of MIL and her wanting “girly” girls. Too bad", "NTA. My God. NTA.\nWhat you and your daughter are going through is unimaginably painful. If your in-laws are going to try to sap away any tiny amount of joy that child can still feel, then they better stay far, far away from her. I don't want them breathing in her direction. They have a choice here. Be nice, or fuck all the way off.", "Bro NTA at all. Fuck them, I love what you did for your daughter and i wish her a pleasant recovery.", "NTA.\n\nYou‘re the kind of parent every child needs and deserves. Continue like that!", "NTA - Thank you for protecting your daughter from a bully! I love that you allowed her to have some creative fun and choose her hair color. I hope her chemo is successful with as little side effects as possible! Praying for a quick recovery!", "NTA what the Fish. Go NC if necessary OP your daughter well being and happiness should be your first priority.", "NTA and please don't even let yourself consider you might be.\nIt's sickening enough to call your grandchild ugly to her face. BUT it enrage me that she was like equating her beauty to her \"beautiful long her\" knowing full well that this hair is going to start falling.\n\nYour BIL is another AH who should understand that visiting a child who's sick is not for the benefit of the visitor but of the visitee. Why would she want to see her to make her cry? How another adult can actually defend this? Blows my mind.", "Nta!\n\nNot at all, you keep doing you Dad. Im thankful your child has you to stand up for them.\n\nAlso blue hair??? The coolest.", "NTA You’re an amazing parent and your daughter is lucky to have such an fierce advocate.", "NTA\n\nMiL BiL are are the AH here. Your MiL will never change so dont ever expect her to be nice. She will only see what she wants. Tell her if she cant control herself not to visit. Let them jnow how your daughter is doing but thats it. If you have a FiL let him and the reat know what happened. \n\nCemo is terrible support your little girl and hell with the rest", "NTA-im so sorry for the struggle you and your daughter are going thru right now. Also Im sorry family thinks they can say whatever they want just cuz they are family. Your daughter is lucky to have you.", "NTA. You’re a great dad. \n\nBlue is a fantastic hair color!", "NTA your daughter needs to be raised up not torn down. If your MIL cant put her granddaughters needs above her own likes for appearance she should stay away. Chemo is ugly and it ruins a person in every way possible if she cant hold her tongue over blue hair whats she going to say when her hair falls out? Or when shes so rugged and tired from chemo and she looks it. I would lay down some law for MIL because its not about her and what she likes or wants. Its about that girl going through the worst part of her life needing to be surrounded by people who care enough about her to raise her up and hold her up.", "NTA. It doesn't matter why she dyed her hair, MIL was a major AH for saying such a thing to your daughter. You're a good dad. The world would be a better place with more dads like you.", "Your in laws ata. MIL is out of order making those comments and your BIL has no place to tell you what to do. You did the right thing by sticking up for your daughter. I hope that her treatments go well and she recovers quickly", "Nta\n\nFuck em. You sound like a good dad. Keep up the good work. Good luck!", "When i read the title I was ready to say yta, but fuck that. After reading your post, you were 100% in the right to tell your mil to fuck all the way off.\n\nAs a parent, your job (and I know you're aware) is to protect your children. That is exactly what you did. I hope she loves her blue hair and I wish the absolute best for you and your daughter! \n\nNTA", "NTA - I'd tell both the MIL and BIL to GFT.", "NTA -  You protect that little girl's individuality and autonomy at all costs! Good job standing up for her!", "Absolutely NTA. What an awful person your MIL is. You should keep up with fun colored wigs and stuff, both because it would be fun for your daughter, and to drive the MIL crazy.", "NTA. You're a good dad keeping an eye out for your daughter.", "NTA - You were protecting your daughter and allowing her to live her life. Her happiness is more important than you MILs feelings.\n\nStay strong. Sending healing vibes your way.", "NTA\n\nIt baffles me that someone would travel 3 hours to visit their granddaughter with leukaemia and decide they have an issue with their hair colour, especially if they’ve already lost a child themselves. Respectfully, fuck your MIL, you’re doing the right thing and putting your daughter first", "NTA \n\nKeep your MIL away from your daughter she already going through enough she doesn’t need that crap from granny. Ignore anyone who says otherwise your number one priority is your daughter. Hope your daughter recovers from her illness.", "You're a good Dad NTA", "NTA. You are a great dad. And I’m so sorry that you and your daughter are going through this.", "NTA there's this OLD saying that I've remixed just for your MIL -\n\n*If you don't have anything nice to say, keep your fking mouth shut.*", "NTA\n\nShe left because her unsolicited opinion was more important than being there for her granddaughter in a crisis. \n\nI applaud you for giving your daughter control over her body during a time where she feels like she has none. It's something that seems small and inconsequential,  but it's a great thing that you did. \n\nKeep championing for your daughter. Tell all the in laws to f-off if they can't be supportive, and I hope your daughter kicks cancer's ass.\n\nEdit: spelling", "Nta, keep being a good dad to your daughter and don't listen to them at all!! Also ignore any guilt trips they use like 'would wife let you do this she'd want us to be there' fo what you think us best for your daughter and I hope everything goes well", "NTA it’s her hair, kudos for letting her do what she wants with it. Kudos for kicking out MIL. Your daughter doesn’t need that negativity right now.", "Totally NTA.\n\nYour MIL sounds similar to my grandmother,  awful.", "NTA. You did everything you were supposed to and awesome choice with the blue hair!", "NTA NTA NTA You're the kind of parent that every child needs!", "Every day this sub reminds me of the sheer amount of people who think children don't own their own bodies. NTA. Best wishes", "Nta, you stoop up for your kid and helped them do something that makes them happy.", "NTA. You didn't tell her to leave, you gave her a completely understandable and valid ultimatum - be nice to her sick granddaughter or leave. She chose leaving over being nice. That is 100% on her, not you.", "Nta!!! Keep supporting your daughter in whatever ways make her feel strong and beautiful.", "NTA.  You did something that made your daughter happy during a very emotional time for her and I think that is wonderful.  Coloring her hair isn't permanent and isn't life altering like having leukemia.  I would send out a group text stating that while undergoing treatment you will require all visits to be positive and uplifting or they will not be happening.  Your daughter does not need negativity in her life.", "NTA you didn’t really make MIL leave, you told her to leave if she couldn’t say anything nice and she chose to leave.", "NTA. Not at all. If your daughter wants it, she should get it.\n\nIf you can, tip for vibrant hair colors: dry shampoo. Don't wash with water for a week If that's possible. Shower or bath of course, but skip the hair more often than not.", "NTA  By MIL's way of thinking, your daughter will be ugly when her hair falls out. Your daughter has a terrific dad who supports her. I'd keep MIL away. Far away.", "NTA, you need to stick up for your daughter", "You went from zero to kick out pretty quick. You skipped right over \"then you can keep your mouth shut about it {the ugly hair)\" and jumped straight to \"then you can leave\". (or rather side swiped \"shut up about it\" as part of the kicking out.)\n\nIt's bizarre that your in-laws see her hair color as an important thing right now.\n\nNTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (m36) have a daughter (12) 2 Week ago she got diagnosed with leukemia (ALL). I'm a single dad, my wife passed away when our daughter was 2. \n\nmy MIL (60) lives 3 hours away but comes to visit pretty often. My MIL always wanted a “girly” daughter. My wife was not into traditionally girly things. Neither is my daughter. That doesn't stop MIL from buying her dresses and other things she will never use. \n\nAbout 5 days ago daughter asked if she could maybe dye her hair since it'll fall out soon anyway. I figured why not I talked to a friend who works at a salon... now my daughter has super cool blue hair. She had the biggest smile on her face when she saw her new cool hair. \n\nMIL came to visit yesterday... She freaked out once she saw her daughter’s hair she was saying daughter had such beautiful blonde hair and now it's ugly. Daughter instantly got teary eyed chemo has already been emotionally exhausting for her she didn't need her grandma making comments like that. \n\nI made MIL go in the hallway (we were at the hospital) I told her that was so wrong to call daughter ugly. She started saying well it is ugly. I cut her off and said just leave then if you aren't going to say anything nice... Well, she left and I hugged my daughter and told her she was beautiful. \n\nI later got texts from my BIL me asking why I made MIL leave. I explained the situation, BIL said it was still AH move  to not let MIL see daughter when she is sick and that I probably shouldn't let my 12-year-old have dyed hair anyway. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA. Tell BIL to kick rocks. His mother is a fully grown adult for fuck sake. And a grandma to boot. She  of all people should know by now to think before speaking. Especially NOT when her granddaughter is about to go through a fight for her life, losing her hair in the process.The last thing your daughter needs is someone tearing her down. Tell MIL and BIL: Opinions are like assholes,  everyone's got one...but if you wanted to hear from an asshole, you'd fart.\n\nPrayers to you and your daughter,  OP. May she make a swift recovery.", "NTA and your in laws are cruel people.", "NTA. Grandma needs her grandma card revoked. I hope your daughter knows grandma’s opinion doesn’t count and that she and her blue hair are gorgeous!\nBest wishes to you both❤️!", "NTA, you stood up for your daughter. Whether or not it was harsh, your MIL is an adult and she knew her behavior was disrespectful. \n\nTo allow her to visit her sick granddaughter would just mean you're showing your daughter - who, unlike MIL, is of an age where she is still learning about boundaries and communication - she has to accept disrespect from family; I'm glad you're not raising her like that.", "NTA! Your mother in law is an insensitive AH for making those comments given the circumstances. Even if your daughter was in perfect health she’d STILL be an AH for referring to your daughters appearance as ugly in front of her. It’s not her place to have an opinion. She needs to stay in her lane OR stay home.", "NTA. Neither of them should be allowed contact with your daughter", "How could anyone be anything but kind to a 12yo with fkn cancer tf", "NTA. Your daughter is your priority, not your MIL feelings. She is going through a lot already and doesn't need to deal with a hag. If you MIL can't behave like a decent human being, then she doesn't deserve to see her or talk to her. Tell your daughter than a French woman who lives in England says that blue hair are super cool!", "NTA!", "She doesn't... Like I said chemo has already been so emotionally hard as well as physically so that comment really hurt her \n\nShe totally rocks the blue hair... I honestly love it also", "Thank you, It took a lot in me to stay calm especially once I seen the tears in my daughter's eyes", "Oh man, I wish I had an award to give you. This comment was so succinctly put.", "Definitely, I know my daughter is dreading the day she loses her hair and she doesn't need her grandma saying something rude then", "Nobody should ever tell a 12 year old girl that they're ugly.  Telling a 12 year old cancer patient that...next level mean.  NTA", "Definitely!  she was so happy when she saw her new cool hair it's not a forever thing so I don't know why they're upset", "BIL has always been a mama’s boy and defends his mother SO much 🤦", "I plan on telling her she can't visit if she is going to say anything rude.", "PS blue hair is cool as fuck", "Normally I wouldn't let her dye her hair something kinda crazy like blue yet because she's still young but considering the circumstances of course I'm going to let her enjoy having blue hair if it makes her happy", "Because I know my mil and she'll keep saying something because she's very passive aggressive", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You’re a good man. I guess hurt people hurt people, but your MIL’s generational trauma and toxic femininity shouldn’t fall on your daughter. \n\nIt was mighty big of you to set a boundary without taking the pound of flesh you were entitled here, and having the presence of mind to step out for the conversation. That’s a cool-hand. Your username checks out.", "Thanks 😉", "Exactly.   And the fact that op had to explain that to a grandmother? Wtf is wrong with her.\n\nI'm proud of op.", "Well, he can very well fuck off then."]}