{"id": 4330, "submission_id": "zgzfnz", "title": "AITA for grounding my daughter in christmas?", "selftext": "My husband and I have been married for 10 years. We have a 9 years old daughter together(Maya). I also have a 14 years old daughter from a previous relationship (Nova) and he has a 15 years old son from a previous relationship (Oliver)\n\nThis is about Oliver and Nova. About a month ago Nova broke Oliver's ipad. She claimed it was an accident but Oliver believes she did it out of jealousy. The ipad can't be fixed so we have to buy him a new one. I told Nova she has to buy one for him and since she doesn't have any money this is what we are gonna do. She is going to ask for half of the ipad's money from her dad for christmas. I'll also give her the other half. Then she can buy an ipad for Oliver. She wasn't happy about it and threw a tantrum about not getting any christmas gifts for herself this year.\n\nI told her actions have consequences. This is her consequence.\n\nYesterday I found out not only her dad doesn't have any intention of giving her money for Oliver's ipad, he is buying a new ipad for christmas FOR NOVA. Apparently it was her idea because she wants to have an ipad. I asked her what about Oliver and she just shrugged. I told her in this case you are grounded for christmas. This year she is supposed to be with me for christmas and it's court ordered so her dad can't do anything about it. I told her she won't celebrate with us. She'll get her ipad but she'll stay in her room\n\nHer dad is calling me an asshole and says I'm cruel for doing this punishment. I think she needs this lesson", "created_utc": 1670597853, "permalink": "/r/AmItheAsshole/comments/zgzfnz/aita_for_grounding_my_daughter_in_christmas/", "score": 41, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My daughter broke her brother's ipad and is refusing to pay for it and instead wants to buy an opad for herself. I might be an asshole for grounding her from christmas because it seems like everyone thinks the punishment is too much\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. Damn, you're ruthless. This is cruel. There is no lesson to be learned here - this will only teach her to resent you. She's never going to forget this. Good luck with your relationship with her in the future.", "YTA. You and her dad need to get on the same page before making these decisions - you told her she had to ask her dad for Oliver's ipad money as her Christmas gift and are surprised he didn't acquiesce to your demands? And then you're surprised that while *you* tried to unilaterally decide what he's going to get her for Christmas, that instead he used his money to buy his daughter an ipad, which she wanted?\n\nIt's fine that actions have consequences and that she has to do something to \"make up\" the money for the ipad. Being generally grounded and doing some household chores should be sufficient.\n\n&#x200B;\n\nAlso, if you're on Oliver's side here, which it sounds like you are, and there's a possibility Nova broke his ipad out of jealousy, why do you think forcing her to spend the holiday alone is going to change her behavior? You need to address that jealousy issue.", "YTA. This is bad parenting and some wild illogical actions from you. First of all, why do you just take your stepson's word for this being intentional? It could've been an accident for all we know, since you don't give any other reason other than your stepson thinking she did it on purpose.\n\nSecond of all, you have zero right to expect Nova's father to contribute half the money for Oliver's iPad. I was scratching my head at that one. Demanding Nova to ask her father for half the money was absolutely ridiculous. If you want her to cover half the cost, then tell her she needs to get a job, or do chores to earn the money or something.\n\nYou cannot control what Nova's father gets her for Christmas nor how his money is spent. Get that through because it's really wild that you think you have a say over that.\n\nAnd grounding her for Christmas is just cruel. You could've established she has to share her new iPad with Oliver while she's at your house, until she can help buy him a new one. Or that she cannot use it while at yours, if anything. Making her spend the holiday in her room is Dursley-esque crap.\n\n(Edit: I don't know why I had originally typed E S H but I had meant YTA).", "INFO: why is Oliver the only one that had an iPad?", "YTA\n\nI think you have good intentions, but I think your punishment was too harsh to begin with. I also have so many questions. Do you know for sure it wasn't an accident? If you don't, how come you're taking your son's words over your daughter's? Why did he have an ipad and she didn't when they're only a year apart, or why wasn't it shared?\n\nI think a simple apology would've been enough, especially since it's a he said she said scenario from what I gathered. Not only that, you punished HER for HER FATHER not giving her the money to buy your son a new ipad. Christmas or not, I think that's a little cruel.", "Yta\n\nThere are a thousand other ways she can make her repay her damage... And you can keep her iPad from her at your home until she earns enough to replace his IPad.\n\nIt kind of sounds like you don't like your daughter very much. Why does your step son's word that it was jealousy mean more than your daughter's word of accident?\n\nHolidays are family time... By banning her from family celebrations you are tellingnyour daughter than she can not ever mess up or you're kicking her out of the family(time). Kids do dumb shit and things get broken. They are kids.\n\nDon't compound the issue by making her feel unloved or unable to make mistakes.", "YTA. Christmas day and the whole gifting thing should be immune from punishment. Forcing daughter to beg dad for money for Christmas so she can turn around and give it to Oliver is wrong because it leaves her without gifts. This should be a time to set aside issues and grievances and just show family they are loved. \n\nHer actions should be punished but not with Christmas and / or gifts and/or visiting family or whatever the Christmas Eve / Christmas Day activities are.", "YTA \n\nMostly for how you approached this. \n\nAccident or not, your daughter broke the iPad. So she should be expected to help replace it. \n\nNot your EX. Your ex didn't take the iPad. And yes, having your ex give your daughter the money to pay for the iPad means he is paying for the iPad. \n\nInstead, you should have had her do extra chores to work it off. Or diminished her allowance or something. You gave her an adult punishment then penalized her because she couldn't pay the fee. Now you're mad that she's mad that you made her pay for something and then punished her when she couldn't pay it. \n\nWelcome to the American penal system. Where the low-earning get one speeding ticket, can't pay it, then get pulled up in court with more fines because they miss the deadline to pay it, then have a warrant out for their arrest, get put in jail, miss work, lose their job, and still can't pay the ticket. \n\nIt doesn't work for adults. How do you expect for this to work for children?", "Yta \nSo because Oliver said it wasn’t an accident you believe him ? 🤔 uh oh okay \nThen you want her to give up her gifts because YOU made a choice to believe a child ( you didn’t see what happen you don’t know it’s alway 3 sides to every story hers,his, the truth)  . \nThree now you’re going to punish her on Xmas when that should be the time to spend with your family . \n\nYou’ll end up with your own lesson when she end up living with dad and going N.C with you your husband and the other two kids", "YTA.  Find a way for her to earn the money, perhaps by doing chores, to buy a new iPad for Oliver.  It sounds like it was accidental.  You can't control her Dad or what he does for her for Christmas.  You can make the iPad stay at her dad's, but prepare to see less of her.  Don't ground her over Christmas. That's ridiculous.", "YTA: she gets grounded to her room while you enjoy Christmas with the rest of the family?", "Info: You didn't discuss the punishment with your  ex husband that you \\*included\\* him in?????", "YTA, nice creating a memory of you hating her during Christmas, you know she probably will never forget this and will always hold it against you.", "YTA. First, you can’t control what her father gets her for Christmas so demanding he give her money to replace the iPad was never going to work. Second, if she did indeed break it on purpose, there are other ways to have her pay for a new one that have nothing to do with ruining her Christmas. \n\nWhich brings me to; she claims it was an accident but her step brother “believes” it was due to jealousy. So you don’t really have proof it was intentional and have just decided the step brother was correct. Maybe he is, but did you sit down and talk with both of them to see if you could find out exactly how it happened? \n\nChristmas gifts should not be used as punishment. If you are hell bent she must pay for a new iPad, have her do chores around the home to “earn” the funds.", ">She claimed it was an accident but Oliver believes she did it out of jealousy\n\nWell, which was it? You are the parent... You don't get to just abdicate responsibility for figuring out if you are dealing with your daughter maliciously destroying her stepbrother's things (in which case, just requiring her to replace it monetarily is incredibly insufficient as a punishment *and* you probably need to get her/the whole family into counseling immediately) or whether you are dealing with a legitimate mistake (in which case, you should be talking to her about responsibility and helping her find a way to to earn the money herself, not gratuitously punishing her for being a teenager who doesn't have much money).\n\nBut regardless of which situation it is, YTA for using Christmas as a punishment *and* for attempting to make your ex contribute to an item that was broken when your daughter was *your* responsibility, not his.", "YTA Christmas is about spending time with family. Yes she deserves punishment but banning xmas isn't the way.  Ban her from.using electronics while at your house and make her leave her iPad at her dads.", "YTA YTA YTA\n\nunless you can prove without a doubt that Nova broke Oliver’s iPad on purpose (which you obviously can’t because you said he believes she did it out of jealousy, not that you know) why are you so set on believing him over her? \n\nTo tell her she has to ask her dad for the money to replace it is ridiculous. You have absolutely no say on how her father spends his money or on the Christmas presents he gives her. \n\nAnd to say she will be at your house for Christmas but you won’t allow her to celebrate with you all?? That’s so beyond fucked up I don’t even have the words to describe it", "YTA\n\nYes, she's being childish but....... SHE'S A CHILD, what would your excuse be? \n\nGrow up ffs", "YTA. Teen years are tough because kids overreact about every little thing, and I DO believe they deserve to have consequences. That being said, you are only a kid for so long during Christmastime and to completely ruin an entire Christmas for her while she is still a child is beyond messed up.  You also stated you don't even know for sure if it was an accident or not. If you believe she deserves \"consequences\" maybe find a different way, but seclusion and no gifts is really awful.", "YTA you do not know she purposefully broke the IPad, but because her brother said so its fact? \nImo itwould have been counterintuitive for her to break it since she was allowed to use it in the first place. \nForcing her father to basically pay for it instead getting his daughter something for Christmas was way over the top. \nWas the IPad a gift to your stepson? If it was, why would your daughter only get enough fir Christmas to pay for half of it? \nI have lots of questions about the dynamics in this household.", "YTA- Why not just have her share the iPad with Oliver? Grounding her for Christmas is a bit overdramatic, to say the least. She should be able to spend it with you as a family.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I have been married for 10 years. We have a 9 years old daughter together(Maya). I also have a 14 years old daughter from a previous relationship (Nova) and he has a 15 years old son from a previous relationship (Oliver)\n\nThis is about Oliver and Nova. About a month ago Nova broke Oliver's ipad. She claimed it was an accident but Oliver believes she did it out of jealousy. The ipad can't be fixed so we have to buy him a new one. I told Nova she has to buy one for him and since she doesn't have any money this is what we are gonna do. She is going to ask for half of the ipad's money from her dad for christmas. I'll also give her the other half. Then she can buy an ipad for Oliver. She wasn't happy about it and threw a tantrum about not getting any christmas gifts for herself this year.\n\nI told her actions have consequences. This is her consequence.\n\nYesterday I found out not only her dad doesn't have any intention of giving her money for Oliver's ipad, he is buying a new ipad for christmas FOR NOVA. Apparently it was her idea because she wants to have an ipad. I asked her what about Oliver and she just shrugged. I told her in this case you are grounded for christmas. This year she is supposed to be with me for christmas and it's court ordered so her dad can't do anything about it. I told her she won't celebrate with us. She'll get her ipad but she'll stay in her room\n\nHer dad is calling me an asshole and says I'm cruel for doing this punishment. I think she needs this lesson\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA I know you don’t want her to grow up entitled, but the severity of the punishment (and you don’t know the motive was jealousy) and your preachy emphasis on actions having consequences mean that she’s likelier to grow up resenting you. And I think you deserve it.", "She said he said you are using that analogy to punish your daughter. You should have solid proof. Also this happened in your home and not in EXs home, I would not pay half either unless there was rock hard evidence that my kid broke it on purpose. Taking away Christmas could force her to live with her dad fulltime as she is that age. \n  Did she have an IPad before Oliver's was broken? On the dad's move to buy her one was an AH move. ESH", "Yta. \n\nYou don’t know what happened to the iPad. Your daughter tells one story, the step son a different story.  I understand wanting to make sure your daughter learns a lesson in this but you’re going too far. \n\nMake her do extra chores around the house to “pay” for the iPad. Her biological father shouldn’t have to pay for anything for your step son. \n\nAnd making your daughter miss out on a family holiday is cruel. It’s only going to teach her that in order to be part of the family, she has to behave and if she doesn’t do things correctly, you’ll abandoned her. \n\n\nThe punishment doesn’t fit whatever happened here.", "Knowing your type of parent OP I wouldn't be surprised at all if you tried to take your daughter's iPad to give it to your stepson.\n\n\nWhy do you believe your stepson over your daughter? \n\n\n\nYTA", "YTA. She clearly doesn't understand why it's her responsibility to reimburse you for that. Forcing her to reimburse you for the iPad is not going to make her any more clear to her why should she, so she's not going to do it by herself next time. If jealousy was the problem, her dad already messed the lesson up by buying her one.\n\nTbh I don't know how would I deal with this situation. Try and talk to her open-mindedly and see how she feels. If she really believes it was an accident and isn't lying about that, perhaps she believes it's unfair to be so severely punished for something she didn't have any intention of doing? Maybe ask her how would she feel if you accidentally broke her new iPad that she is getting and would she want you to get her a new one if that happened. Would she think it was very different whether it was an accident or not, or would she just want you to fix the damage you caused regardless?\n\nIf it wasn't an accident and she knows it, that's a bit more difficult. I guess it depends on why she's jealous. It's a much deeper problem.\n\nBut either way, I don't think punishment is going to solve her wrong mindset here. If anything, it might make her even more jealous and resentful for you to spend Christmas with Oliver and without her. If she felt jealous in the first place because she feels neglected, you're going to severely exacerbate the issue.\n\nI agree that realistic consequences are appropriate, but I think forcing them by using your power over her isn't likely to be productive. You have to get her on board somehow.", "ESH.  Making Nova replace Oliver’s iPad?  Fine.  Demanding her dad pay for half of it?  Not really sure why you’re surprised the lesson she took from that is that she should just go to him to fix her problems.  Forcing her to stay in her room for Christmas?  Even Scrooge would call that cold.  \n\nTake several steps back and refocus this on the actual problem, which is replacing Oliver’s iPad in the short term, and in the longer term fixing this hostility between the kids.  None of which is going to be helped by how this has shaken out so far.", "ESH\n\nObviously your daughter screwed up ... but the punishment doesn’t fit the crime. What exactly do you think her sitting in her room, without any gifts will accomplish? Certainly, won’t fix Oliver’s iPad problem. I think a better punishment may be that the iPad stays at Dad’s house until Oliver gets his replaced. She can keep it, just not at your house.\n\nYour ex is an AH for allowing her to get away with this behavior. You both clearly have a problem communicating regarding parenting your daughter\n\neta — regardless of whether or not this was an accident... if you use someone else’s stuff & it breaks... you replace it. Period. It is not appropriate nor kind to get yourself a new one & while the other person’s item is still broken!", "YTA", "Almost ESH. To be fair, there is no easy way to deal with a situation such as this without needing to be a bit of an asshole. I think you had the right intentions for Oliver and I think it’s great that you advocate for your stepson — but I think there were some things that could have been done differently. Either way, respect for aiming to be fair.\n\nHer father is definitely an asshole for not caring how Nova’s actions effect other people — she did something pretty bad and the fact that he’s rewarding her for that sucks, so I do feel you on that, OP. \n\nBut you are a slight AH for assuming her dad would cough up money for a situation he wasn’t apart of — did you try talking to him about it prior to telling your daughter he’d be putting $$$ towards getting Oliver his new iPad? In a way, you’re punishing Nova because her dad is choosing to celebrate Christmas with her (albeit in a crappy way). \n\nHonestly, at 14 I had friends selling snacks, crocheted items, chocolate, even duck taped wallets — when there’s a will there’s a way, and making her earn the money is going to be the best learning lesson. Cancelling Christmas for her might be too extreme, and I can see that backfiring because she’d most likely be mad at you without learning anything, and she’d be giving her father the upper hand as he gets her what she wants. However, Nova has demonstrated that she still gets whatever she wants through her dad, so this wouldn’t be a terrible loss for her. \n\nShe should earn the money back. If she doesn’t care to, maybe have her do some Christmas caroling or community service. Say, “actually, you deserve to celebrate Christmas with us,” and get her into the Christmas spirit by giving back. Sounds stupid, I know, but that way she can celebrate Christmas and learn a lesson — even if she isn’t earning the money physically, putting the time towards something good might be a good way to teach her that her actions have consequences without being too harsh. When I was younger my mother would have us Christmas carol or have us spend time with the people from the retirement homes. I know it doesn’t sound ideal for everyone else who didn’t break an iPad, but you can talk about “starting the celebration early” and do it before Christmas. If she would rather not pay her share for the iPad or at least demonstrate that she is the slightest bit sorry, then OP, I fear your daughter is a huge AH. At 9, I knew the consequences that came with breaking something of my sister’s, expensive or not. At 14, there is no excuse for that type of apathy.\n\nUnfortunately, Nova is a bit of an AH, not just for breaking the iPad (accidents happen) but for getting a brand new iPad while Oliver’s is broken. This is a pretty crappy thing to do. If you have the money for it, I’d make sure Oliver has a special Christmas. It sounds like he was a good sport about the whole thing, and deserves something extra to commemorate that (you can do this in private so Nova doesn’t feel bad).\n\nBest of luck, OP, I wish you all a relaxing Christmas!", "grounded without wifi\n\nNTA\n\ntell dad she will suffer the consequences of her actions\n\nTeens play divorced parents dad's an idiot falling for it.\n\nShe would also being doing useless physical labor to earn the money. Attic, basement, garage, grandma's attics, basement, garage....her time with me would be miserable. Every complaint would be answered, \"just call your dad for bail\". Half the price of the ipad.\n\nCharacter is the most important quality parents teach. Nova displays poor character. You are not overreacting. Your balancing out her idiot father.", "NTA\n\nThis is unacceptable behaviour and a total lack of responsibility from your daughter. If there is no one who will give her an example that you can't just meander your way out when you fuck up... she will have a hard time finding her place, living as an independent adult.", "NTA.  She's at an age where anger is expected, but getting destructive on others stuff is not acceptable and you are showing her that.  Your solution for her father to pay half was acceptable, as she is the daughter of you both and she damaged another child's property.  You've been spot on from what I can see.  Her father is enabling her to needle you, not much can be done about that disappointment.  She'll find a way to bring the ipad out of her room to flaunt it, you can bet on that.  Once she does, take it away.  I suppose you could also confiscate it as soon as she enters your home with it and tell her she can have it when Oliver has his.", "Yta,\nShe should have consequences if you had proof she broke it on purpose.  But basically you are treating her like Cinderella.   She is going to hate you.", "Ehhhhh, gonna say YTA here.\n\nThe daughter ABSOLUTELY needs to replace the broken iPad as that's not acceptable to break your son's belongings.\n\nBut you also don't get to force your Ex to pay for half. That didn't happen under his roof, and frankly, would be impossible to actually enforce it.\n\nThis needs to be where it's taken out of her allowance (if any) or else she can \"pay\" it back by doing extra chores or things at YOUR home where it can be supervised.\n\nShe needs to be responsible, but you cannot fairly punish her because what your Ex chose and frankly isn't actually required to do.", "YTA! You are going a little too far ngl. Like, it's Christmas. You're basically telling your daughter that she is not a part of the family.\n\nBesides, you should have had insurance (like AppleCare) on the iPad anyway.", "YTA. It kinda sounds like you hate your daughter. This is not going to teach her anything.", "I agree that a lesson needs to be learned. I see this as her being rewarded by someone else for being negligent with someone else's property (assuming she didn't break it on purpose) when you're trying to teach her how consequences work, and she seems kind of nonchalant about how Oliver might feel because she's getting what she wants.\n\nOne of my friends went through a similar thing. Her 14 year old son plays baseball, and his stepdad let him use his old baseball gear from when he was in high school. One day, the son accidentally left his bag of gear outside, and it rained, ruining all of the equipment. My friend wanted him to work off the cost for her to replace it  through various chores, but then her sister decided (with good intentions) to buy her son all new equipment. She was livid because she was trying to teach the lesson that if you break someone else's things, you pay for it, and if you can't take care of someone else's things, you get your own. Instead he was rewarded with new gear and probably learned nothing.\n\nI WILL say that there's probably a better way to teach that lesson than grounding her for Christmas. You could tell her you're using the money you would spend on gifts for her to replace the iPad and getting her one or two smaller things (but still get her something, she's just a kid) since she got her \"big gift\" from her dad. \"Grounding\" is more about control than teaching. Also telling her to ask her dad for money to replace it I think is too much, he's not part of this at all and you aren't entitled to ask that of your daughter.\n\nSo, NTA for wanting to make this a teachable moment, but YTA for how you're going about it.", "YTA for oh so many reasons, but let’s start with - you are basing all of this on “Oliver THINKS she broke it on purpose”? Why? Is there any evidence or proof? Why are you believing Oliver over your daughter?", "YTA. Spend Christmas alone in her room? I hope your ex keeps her for Xmas and takes this back to court. She's old enough to say where she wants to live.", "YTA for taking your stepsons word over your daughter.  You probably won't have the chance to ground her much longer,  she'll probably go live with dad full time", "Huge yta.  Sounds like you are the one breeding the conflict.", "YTA. You hate women don’t you? See them as competition, including your own daughter? You get validation from other men, including your own stepson and his dad, right? You believed your stepson over her without any proof. \n\nYou hate your daughter, admit it because this is just too cruel punishment. Give her dad full custody or you just keeping her around for child support payments?\n\nThere are other ways to punish her IF she did it on purpose. And her dad no longer has to agree to your punishment style, especially when it comes to his own money.\n\nShe could have earned the money through extra chores until she made it all up. You could have asked her to sell some of her non-important things to make up some of the money. But cancelling Christmas over what may have been a genuine accident? And what does your husband think of this?\n\nAnd why did Oliver get his own iPad but not your daughter?\n\nShe’ll never be able to trust you or come to you in the future if she ever makes another mistake.", "First, it does not matter if it was an accident or not. She broke Oliver's iPad. She owes him a replacement.\n\nSecond, what.exactly does grounding Nova for Christmas achieve? What is your goal here? \n\nIf you are trying to teach her to hate you and Oliver, you're probably doing good. If you are trying to teach her responsibility for her actions, you should do something else.\n\nHow about you temporarily replace Oliver's iPad and she works to earn money for it? Maybe he should use her ipad until she works enough to replace it. What can she do around the house to earn money? If it was.an.accident, you might give her a break like pay for half. \n\nDiscuss this with your husband and maybe as a family.\n\nYTA", "YTA also if you end up back in court about custody the fact that her Christmas with you is being spent alone in her room doesn't make you look good.", "\"Yesterday I found out not only her dad doesn't have any intention of giving her money for Oliver's ipad, he is buying a new ipad for christmas FOR NOVA\" .. funny thing: This is YOUR fault. YOu did not contact him. Her dad does not have to join your decissions: Why would he? YOu did NOTHING to convince him, and you are AH to believe you can control his relationship with his daughter. \n\n&#x200B;\n\n\"I told her she won't celebrate with us. She'll get her ipad but she'll stay in her room\" .. Probably more fun than spending time with you anyway. ANd your abuse it will give her dad a lot of ammunition to go for full custody.\n\n&#x200B;\n\nClear YTA", "You kinda sound like a mom I worked with. Her adult children hate her. You may keep her from celebrating Christmas with the family but you'll get yours when you spend Christmas alone as an older adult.", "YTA for asking your ex to subsidize your stepson's IPad even if your daughter intentionally broke it. I agree your daughter should pay for the damage done but having her ask her father for money in lieu of a gift for Grinchmas is deplorable. How about having her do extra chores around the house to earn the $$ it would cost for a new IPad?", "Your daughter is going to hate you and I'll be all your fault. \n\nThat's not parenting and teaching her about consequences. What you're doing is telling her \"having family is conditional and one mistake means you're not a part of mine\". \n\nAnd I bet you're going to wonder why your relationship with your daughter is so awful. I'm telling you now - it's because of you. You, your cruelty and skewed view of responsibility.\n\nYTA", "YTA. you don’t have proof if it was intentional or not and you just took your stepsons word for it. On the off chance it was, there are other ways for her to pay it off without ruining her Christmas. You frankly sound like you don’t like your own daughter here so don’t be surprised when she goes no contact with you as an adult.", "YTA and I hope your ex husband sees the post the fact you are going to ground her for Christmas and then rubbing it in that she can't go to his place for Christmas because of the court order. Your daughter is 14, I hope that she chooses not to see you since she is old enough to make that choice with this crappy parenting.\n\nThat being said she has multiple ways to make money without getting a job from a business or company. She can babysit, dog walk, wash cars,shoveling, leaf pick up ect. There are plenty of other things but you picked the worst choice. Also you chose your stepson word over hers, and you don't even have solid proof. Doing something purposefully  and accidentally have different consequences.  Regardless she should work to pay it off even if it was an accident. But telling her she can't celebrate Christmas? You are psychology telling your child if things are accidents she is going to get treated unfairly and punished harshly. This could be extremely troublesome late down in her life for even small things like breaking a glass.\n\nI don't want to even get into your ex but he's wrong for getting the iPad for her though it sounds like she did it intentionally because of how you treated her to be vindictive. But he has no reason to pay for your step sons shit and especially not take away her Christmas gift for him.", "YTA\n\nYour \"solutions\" are terrible. What about doing chores and earning some money? What about treating her with respect and consideration? Watch her go to her dad's and never come back because you are being needlessly cruel and ridiculous", "YTA.\n\nIf you hadn't discussed it with her dad and gained his agreement, the punishment shouldn't have involved his cooperation. \n\nYou could have assigned her extra chores to pay off the I-pad.  You could have kept track of how much she owed, and how much each extra chore was worth.  You also could ask your friends if they need any little odd jobs done that your daughter could get paid for since she owes Oliver an I-pad for breaking his.  Someone might be willing to pay her a few bucks to walk their dog or wash their dishes or something. \n\nThen she has her consequences, she learns about the value of hard work and making money, and about the value of the things you could accidentally break.  \n\nTaking away christmas from her is just cruel and not in the spirit of what christmas is about.", "No judgment here, but why didn't you just take the iPad her dad gave her and make her gift it to her brother?  Done and done.", "He could have bought it, he could have been gifted it. \n\nWhy does it matter?", "I can't keep it her dad threatened to sue me if I take the ipad away\n\nShe is too young to have a job it will take a very long time for her to be able to buy one for Oliver which is why I suggested using her christmas gift", "She is welcome to enjoy christmas with everyone else when she learns to make up for her mistakes", "She is his child too. When she breaks someone else's property he is responsible for half of the price", "How do we know the daughter actually broke the iPad on purpose though? All we have is stepson's word, but for all we know it COULD'VE been an accident.\n\nAnd making your kid stay in their room for Christmas for such a crime is insanely messed up.", "You may be right, but what if the daughter is right and it was an accident?  Their is no proof it was on purpose.  If it was an accident she should help replace it but the OP would be overreacting.   \n\nAlso at 15 in some states the daughter can say where she wants to live.  My guess is she will choose her dad if her mom doesn't believe her if it was an accident.", "I had to add - it's not \"aita for grounding my daughter\" it's I am an ass... for excluding my daughter\" ;)\n\nEdit because I hit \"post\" too quickly.", "It can give insight into possible favoritism.", "She’s 14. She can babysit, mow lawns, shovel driveways, walk dogs, cat sit   If your in the US there are fast food places that will hire 14yo. \n\nYou can also hire her for lists of housework that needs to be done for you and family.  She needs to earn that $$ back", "You can't make your Ex pay for something that didn't happen under his roof and frankly is for your son.\n\nThe daughter broke it, it's her responsibility. Extra chores and other things to work to actually pay it back is way it needs to go to show her the consequences.\n\nAnd yeah, keeping HER iPad from her Dad would be theft, and he'd have the right to go after you.", "You can't keep the iPad because it is her father's property. You can ban her from using it at your house.", "You know, I kinda gave you the benefit of the doubt but reading the post again, then some of your replies, it all sounded like a red flag to me so I take it back. The fact that he has an Ipad and she didn't alone was odd, when it could've been shared.\n\nDoes it really matter that much? Do you even know if it was really done out of jealously or not? All this makes it sounds like you don't like your daughter.", "I didn't say keep it. I said take it away while it is at your house... I. E. She has to leave it at her dad's house.\n\nI was NOT trying to give you feuther advice in how to f over your kid.\n\nAnd this comment makes me believe you super suck.", "YTA - 1. She could be babysitting at 14\n2. You could have her work off the cost of the iPad by assigning dollar amounts to chores and she gets \"paid\" for each one she accomplishes \n3. This isn't going to fix any issues between her and her step-brother. By focusing on the iPad you are ignoring the underlying problem that, if you take your step-son at his word, caused her to intentionally break it or, if you don't take him at his word, why he would say she did.\n\nYou are choosing the laziest and most cruel way to parent. You are guaranteeing you will have minimal contact with your daughter once she turns 18. If she doesn't go live with her dad before that.", "The fact that you thought her dad should pay half alone made YTA. You can call it her Christmas gift or whatever else you want, but the fact is you don’t get make her dad pay for any part of it. There are literally infinite options here and you chose the one you literally have zero power over.", "Kids make mistakes... all the time. As parents it’s our job to help our kids learn good lessons to help them become responsible adults. It’s not a good lesson to reward negative behavior. Nova should not be getting an iPad however taking Christmas away teaches nothing... it’s just stupid & mean.", "So you believe Oliver but not your own daughter?\n\nDon’t be surprised when she goes NC or asks the court not to live with you as soon as she is able to.\n\nLet’s be real, accidents happen. You could have had chores to make up for it - but she is 14 years old and it’s a accident. You chose not believe her. You didn’t even care to hear her side.\n\nYTA.", "Is there some other reasons you dislike your child so much", "Christmas should not be withheld from any child. Ever.\n\nAnd what if this was an accident??", "WhY dId HeR fAtHeR gEt FuLl CuStOdY???", "You do not even know who was telling the truth", "But do you know for sure that she broke the iPad on purpose? Do you have anything other than Oliver's word for this? Any physical proof? Because if you don't, this is extreme. Maybe Oliver is telling the truth, but maybe he isn't.  You cannot dole out such a severe punishment if it was a genuine accident, that isn't fair. Accountability is important but unless you know for sure what happened, the punishment doesn't fit the crime.", "You didn't think to TALK TO HIM, to be on the SAME PAGE ???", "It doesn't matter if it was on purpose or not. If it was an accident, you still try to make it right, and there are still consequences. If I accidentally hit someone with my car, I may not have as big of a sentence as if I'd done it on purpose, but I'd still have to go to jail, and I'd certainly be responsible for their medical fees.\n\nThat said, I think that OP could be going about this in a much better way, and I do agree that the punishment doesn't fit.", "Most people don’t fix accidents by creating more problems. I broke your TV so I bought myself a new one. And how exactly should Oliver feel about Nova getting a new iPad while his is still broken? \n\nTaking away Christmas teaches nothing ... but rewarding negative behavior (she broke his property who cares how or why) is teaching a very bad lesson.", "I never even implied that she broke it on purpose. Why would that matter? She broke it, she fixed or replaces it. She is not a toddler...\n\nHow would you handle a situation like this:\n\nYou go to your friends house for a visit. You accidently bump into a table, which makes his ipad fall to the ground and shatter. are you really going to say \"well, that is a pity... but i can assure you this was not intentional. So i will not replace this. Sucks to be you.\"?! i hope not...\n\nWhy wouldn't you hold up your teenage children to the same standart? If they don't learn this at 14 - they won't do it at 24...", "So if it was an accident the way to fix that would be for the daughter to get a new iPad? Of course, she will live with her Dad. They both seem to agree that the best way to fix mistakes is by causing more problems.", "If her dad is buying her her own IPad for Christmas, it seems more like she just didn’t ask for one until now.", "It could have been a gift from his grandparents or his other parent. How is it odd? Not everything needs to be shared among siblings.", "Mixed families dont share everything. Growing up with half and step siblings, my mom bought me things my dad couldnt afford. That doesnt mean they magicall6 become communal.\n\nAlso, fwiw, depending on the situation, taking away a method of communication with dad can be a huge issue. \n\nOP still sounds like they are the asshole. But the \"he has but she doesnt\" isnt the answer you think it is", "He is responsible for his child as well. If it was one of her friend's ipad was I expected to pay the whole price?", "To be fair, even if it was an accident, as an adult you fix your accident's consequences. If you spill something at the office or someone's house, you offer to clean it. If you break someone's phone by accident, you offer to pay fix it. If you unknowingly say something insensitive, you still apologize. Accidents are not an excuse when you cause harm to somebody.\n\nBut I agree this should've been handled better either way. She doesn't have an income stream and is too young to work, so making it up to her step-brother is not that easy and it might feel severe to have to give up Christmas gifts if it rly was an accident.\n\nAnd it's also possible that it wasn't, we don't know.", "I think everyone is missing the fact that regardless of whether or not it was an accident, Nova was using it & broke it. If you take someone else’s toy & you break it. You replace it. What you DON’T do is get someone to buy YOU a new toy without any regard that the other person’s toy is still broken. The punishment still doesn’t fit the crime though.", "I don't think it was. The damage was so bad unless she accidently threw it to the wall with her full strength then it wasn't an accident", "Grounding your daughter on Christmas for something you don’t even know for sure was done on purpose is pretty awful.", "I'm not saying the dad is perfect, but if I believed my daughter why wouldn't I get her an iPad as a gift , it is perfect for a teenager.   Second she should work to repay it but the mother telling the father how he was going to spend his Christmas gift for the daughter is wrong.", "That. Or maybe not. Hence the question.", "Agree! I have 4 kids... I would be broke if I had to buy all of them the same stuff at the same time! My twins both received an iPod shuffle (they’re 25 now) my daughter lost hers & we didn’t replace it. She had to buy her own if she wanted one. So she no longer had one but her twin brother did.", "The thing is, you don’t get to tell him that’s her Christmas gift and expect him to just go with it. \n\nShe deserves consequences, she should 100% should have to pay for it, but you don’t get to tell her father that he must pay for as her Christmas gift.", "IDK I think there's a difference between a $20 toy to replace and a $200+ (MINIMUM) dollar ipad. If this were a random person that owned the iPad, I would expect the mom to pay for it and then ground the kid (*maybe*)+ extra chores for a while... but not for the full price of the iPad - it's honestly not fair to me. Sucks to be the parent in that situation who has to pay for their kid's mistakes - but it is what it is.\n\nAnd in no way would Christmas presents/money be withheld because of a mistake. Even if it was on purpose - the punishment should be given outside of Christmas. Orrrrrrrrr at the very most - let her partake in the festivities, give her one or two smaller gifts and the rest of the money you would have spent on her goes towards the iPad.\n\nTotally taking away Christmas from her is just gross. I mean what would the mom do if this was a regular day in June?? She should answer that question and go with that punishment.", "You'd be surprised at how badly they can be damaged if they hit a sweet spot if you drop them on the floor. But my comment still stands, no child should be grounded for Christmas.\n\nHow mentally scarring do you think this will be on her? You can't say \"well if she would just fess up\" - because it doesn't matter. It really doesn't. You get no turkey/ham/whatever, no gift exchange, no giving, no compassion, no LOVE. And saying \"well there's nothing you can do about it because I get custody of you on Christmas muahahahha.\" is beyond fucked up and disgusting behavior.", "Did it have a case? iPads are fragile and if they’re dropped at the perfect angle, they will shatter completely. Honestly, even if they’re IN a case, they can shatter if they hit just right.", "Again. You do not know that. Apple products are fragile. Electronics are fragile. If there is so much tension between your two children that this is a possibility, your son could have broken it himself. This was on you to address a long time ago", "okay so you do want it this way:\n\nher daughter was directly told how this Situation will be handled. the daughter got behind her back, ignoring the decision and doing exactly the opposite.\n\nand then at christmas she will sit in silence while her daughter unpacks her new ipad, waving it in her brothers face?\n\nthis will make a great christmas for everybody and set a superb example.\n\nand again:\nas i already explained: it doesn't matter if this was on purpose. she is not a toddler. if she is smart enough to outplay her parents to avoid consequences - she is smart enough she has to replace her own damages.", "She’s not being punish for breaking the iPad “on accident” the reason is because she decided to no ask for half the money that’s needed to pay the iPad she broke, she decided to ask for an iPad for herself. Now you tell me if that wasn’t sneaky, and makes her look like she did all that on purpose.", "And what lesson would that be teaching? Mom is mean for holding her accountable but Dad lets her do & get whatever she wants? Not a great lesson.\n\nWho cares if it was an accident or not. She used someone else stuff & broke it. It needs to be replaced. Period. Put yourself in Oliver’s shoes & tell me how you think that kid will feel about Nova’s “solution” to this problem.", "Not all siblings have to have the same stuff.", "My kids have broken their siblings stuff, some cheap, some expensive. They have had consequences of replacing the item. \n\nI truly believe the biggest issue is Nova’s response. It is very unkind to get herself a new iPad without any regard to the fact that she broke (doesn’t matter how or why) Oliver’s. That’s very disappointing behavior. OP’s ex is an AH for allowing that to happen. That iPad would not be allowed in my house unless it was shared or Oliver’s had been replaced. \n\nChristmas has been used since the beginning of time to keep kids from misbehaving, or risk getting coal! But I have never heard of anyone not allowing a kid to participate as a punishment", "It had a case and I still don't think it was an accident. She wasn't even supposed to use the ipad and she is not clumsy at all", "I think he will be upset his iPad was broken as he should be. And she should have to do work to pay for it.  She's 14 make her do stuff to pay for it.  Taking her Christmas away seems like something out of a Dickens book. \n\nAlso as pointed out why did he have one and not her? And second I can totally see dad having been planning to get her one for a long time.", "Anyone can drop an iPad, clumsy or not. It happens. \n\nSo, it comes down to a total he said she said situation with no actual proof that she broke it, and you decide to ground her from celebrating Christmas with her family. That’s… really bad parenting.\n\nI’m sorry, but YTA. You could have made her do chores to earn the money, made her start babysitting for a friend, anything else, but no. You decided that she would use the money her dad would give her, but because he said no to buying YOUR son an iPad… she’s grounded. Not even grounded for MAYBE breaking the iPad, but because her dad isn’t giving her the money to fix it (which is not his responsibility).\n\nAll you’ve done is made her feel like your son is the favorite and created an environment for resentment to flourish. All you’ve done is push her away from you and closer to her dad - who she fully sees as a hero for not making her give up her Christmas presents for what she claims was an accident.\n\nIf she wasn’t supposed to be using iPad, okay. Cool. Ground her for a week or two. But everything else is just AH territory."]}