{"id": 4331, "submission_id": "zh2g3s", "title": "AITA for responding to my father’s request for a relationship with a detailed PowerPoint on why he will never be forgiven?", "selftext": "If I’m the AH here, I’ll own it.  I’m not sorry, but like it would be good to know because the rest of my family thinks this went too far.\n\nMy (24F) mom died when I was 7 from leukemia. I have very few memories of her from before she was sick and I didn’t get to spend a lot of time with her in her last year but she was an artist and until she couldn’t anymore she would make me little collages when she was in the hospital with drawings and photos and messages for me. My grandmother put them all in a book for me after she died.  I wanted to be like my mom and my counselor thought it would help, so I started a journal where I would do kind of a similar thing and I’ve done at least one page a week all these years ever since my mom died, more when I miss her or have something hard going on. So, I have kind of a unique record of my mental state over the last 16 years.\n\nMy father remarried when I was 9.  My step-mother really leaned hard into the “I’m your mom now” and my father didn’t stop her.  It improved when they had my half-brother because she basically forgot about me then. Unfortunately he got cancer when he was 3. And I pretty much ceased to exist for my father, he was either working or gone with my brother and I spent all my teen years mostly at home alone or with my grandparents. The mantra was that my brother needed to be the focus because he might die so I needed to not be selfish since I was healthy. I stopped trying to talk to him when I was 16 and it was a dark time.  I moved out when I was 18 and cut them off completely.\n\nMy grandparents let me know that my brother died a couple of years ago but respected my desire to remain NC with my father. He recently reached out to them because he wants to see me and talk.  I went through my old journals and made him a PowerPoint with images of the entries where I had talked about being frustrated and feeling abandoned and unwanted, some with literal quotes of things my dad had said to me during arguments. Even the really dark stuff from when I was seriously depressed. Then I ended it with a photo of one of my mom’s collages where she had written “Remember that your dad and I are always here for you” and I wrote “You failed. Go away.” underneath. I felt like him being able to see it from my literal perspective would communicate why I don’t want him back better than I could.\n\nEvidently it worked, but a little too well because I’ve been bombarded by family telling me that it’s understandable that I don’t want to see him, but what I sent gutted him and he’s completely fallen apart after reading through it and it was unnecessarily cruel.\n\nMaybe it was, I know my bar for that is kind of weird sometimes, so AITA?", "created_utc": 1670605246, "permalink": "/r/AmItheAsshole/comments/zh2g3s/aita_for_responding_to_my_fathers_request_for_a/", "score": 826, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m sure it was extremely hard to read, especially after losing another kid.  Not going to lie, there was some really dark feelings in there and I’m sure knowing he was a part of causing that could be traumatic so maybe I just traumatized him back.  Maybe deserved maybe not, I don’t know.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, i have a saying \"If the truth about your conduct paints you in a bad light, the problem isn't with the truth. Its with your conduct.\"  If the truth hurts your dad its his own to deal with and not on you.", "NTA \n\nthis was a brilliant and direct approach your father is finally feeling what you felt all your life and he's simply to weak to handle it ...even his reaction is a selfish self centered one screaming me me me me.....", "That was painfully harsh to read, but I still think NTA. Your father *did* fail you repeatedly, even before your brother got sick. He should never have married a woman who tried to push out the memory of your mom. And he should never have tolerated you being \"forgotten about\" as soon as your half-brother was born. Your brother's illness and passing were a tragedy and your dad and stepmom could perhaps be forgiven for a \"doing their best but fell short\" type of parenting. But they clearly didn't even reach that level.\n\nPeople will convince themselves of all kinds of delusions about why a close relationship went bad. You destroyed any such delusions your father had and spoke your truth. If he wants to have any hope of repairing his relationship with you, that can't happen until he honestly faces what he did to you. (I am not saying that to push you into repairing your relationship with him -- that's your call to make. Just that *IF* it were to happen, that would be an important element.) He could start by calling off the family members who are hassling you.", "NTA in the slightest. You told your dad how you felt and it made him have to confront his failures as a parent. It is not your fault he neglected you. He is upset because he knows what you put in the PowerPoint is the reality of how he treated you when you were just a child. Now that the truth is out and you have reestablished NC, I hope you are able to let go of some of the anger you have at him and know that you did nothing to cause how he treated you. I’m no contact with my dad and have been able to find a lot of peace in the life I have built without him. I hope for the same for you.", "NTA at all. That was a reality check what he had done to you. And he didn’t like it. And your enabling family neither. The presentation forced them to look in the mirror. And what they saw is ugly.", "NTA he failed. He's gutted because he's had to look at the actual consequences of his actions- the paain he caused his child. Yea that probably sucks, buy maybe he should have been a better dad.", "NTA. Own it. Don't be sorry. He fell apart because was bombarded with all the feelings that he would've noticed had he paid you any attention, he brought it upon himself.", "NTA- and I would say.  It was honest. It was meant to be honest. If it was cruel, it was only because he now knows what he has done. The point was not to hurt him, but to help him understand. Now he does.", "Holy shit. NTA but that was brutal. I pictured the \"You Failed\" popping up at the end like when you die in Dark Souls.", "NTA. He doesn’t get to wash everything away because some time has passed and he wants a relationship now. Especially if he had made no effort to fix or atone for said behavior.", "NTA\n\nIf he didn't want to hear the answer, he shouldn't have asked. You responded unequivocally and with receipts, no further discussion needed.\n\nTell your family that if he's struggling with the consequences of his own actions, they should pay for his therapy. It is 100% not your problem.\n\nWell done, you.", ">Evidently it worked, but a little too well because I’ve been bombarded by family telling me that it’s understandable that I don’t want to see him, but what I sent gutted him and he’s completely fallen apart after reading through it and it was unnecessarily cruel.\n\nIt was unnecessarily cruel of him to completely abandon/ignore you when your half-brother got sick. You already lost your mom, you would lose your brother, too, but he didn't think you needed any support or help? \n\n**NTA.**", "NTA, you just lifted the fog of the fantasy he was telling himself, truth can be harsh but  he shouldn't live in a fantasy where he is the victim.", "NTA.  Was it harsh?  Yeah.  Was it a lot of effort when simply have telling him “go away” would have accomplished the basic goal?  Probably.  But this was your lived reality, and he wasn’t interested in hearing or helping you when it would actually have made a difference.  If it’s only now dawning on him how lonely and rejected you must have felt, he’s just going to have to live with that.  (Also, one does have to question whether he’d be this gutted or even reaching out at all if your brother were still here.)", "NTA. You found an effective way to communicate just how badly your father effed up. He is lucky it was only a PP presentation and not years of misery.", "NTA\n\nI don’t think he meant any harm when you grew up, possibly he was so worried about his son because he lost his previous wife to cancer as well. But he still left you, you felt like you were abandoned and went NC now he wants to try and repair your relationship but it is too late for that, and if you don’t want to you have every right to ignore him. Was the PowerPoint a little harsh, yes, but he had it coming. You don’t own him a relationship and you don’t owe him kindness. He should recognize how his behavior hurt you and not hold your resentment against you. Tell your family that you don’t owe him an apology. I hope things will go well for you OP.", "NTA. You simply held a mirror to his face. It’s not your fault he didn’t like what he saw. He SHOULD be gutted.", "NTA at all.  How dare your “family” expect you to sugar coat your feelings for your awful awful father.  How. Dare. They.\n\nREAL family would apologize to you for letting you suffer in silence and not being there to help you, a child yourself, with the things you needed to grow up emotionally healthy.  REAL family would ask how they can help you now.  Real family wouldn’t minimize the problems because they are inconvenient for their narrative.  These people want to play happy family and pretend everything is not as bad as it is.  This situation is exactly karma for your dad’s absolute failure as a father.  He brought this on himself. \n\nI am soooo angry for you.  They don’t get to decide what is necessary and unnecessary for you.  Don’t you dare let them talk you out of what you feel because they don’t like how it makes them feel or look.  Your power point didn’t “work too well”, it worked.  Period.  I’m proud of you for finally getting to say things in a way that got your point across. Now go be awesome on your own. You don’t owe them a lift up after they let you down.  And please don’t listen when they tell you to “be the bigger person”.  It just means eat their abuse.\n\nI think you need to face the reality that you have better coping mechanisms and understanding of what it means to be a functional adult than your father and family.  They may be older, but they are not wiser.\n\nYou are adult and you get to decide what that means.  You get to decide what works for you.  I’m so sorry this was your childhood reality.  I hope you continue to do your art therapy, and make up for your neglect with a great life.  NTA. At all.", "NTA. What you did is savage, for sure, but you're not *the* asshole because your father is.\n\nSure, it would have been more tactful to say \"No I don't want to talk to him,\" but the whole point, *as you showed through evidence*, is his treatment of you during your formative years means he is not deserving of your tact.", "NTA\n\nYour dad asked for a relationship with you. This is the relationship he built with you. This is the reality of how that looks. He's asking you to ignore all previous evidence that he'll disappoint you and put yourself in the vulnerable position of depending on him emotionally again. You can't do that to yourself again. Any relationship you have going forward has to be based on the reality of the past and for your part, that means protecting yourself from being abandoned again. \n\n  \nI (51F) have contact with my mom, but because I never tell her how I really feel about how she has always treated me and how she treated dad when he was dying, we don't have a relationship, not really, and because she's always been incapable of being wrong, we never will. I only refrain from NC for the sake of seeing my brothers every year at xmas. I don't expect her to stop being a selfish jerk and therefore I'm never disappointed. \n\n If you acquiesced to his demand that you be his loving daughter without saying how you really feel, you wouldn't be giving him a relationship anyway.", "Not the asshole.\n\nI had a horrendous relationship with my father. Really horrendous. Many years later, when it was too late I was given a different perspective from the kids of his long time girlfriend. There was a lot of behind the scenes shit I wasn't aware of and after his funeral the reality of his life was laid before me.\n\nI was the asshole and I didn't get to go back. Not all relationships can or should be saved. But the loss of a wife and a person who knows how to abuse that hole can fuck people who you wouldn't expect someone to be able to manipulate. \n\nIt's worth hearing him out, but it's critical your feelings and experiences are made clear to him.", "NTA.  You're allowed to feel and think the way that you do. \n\nWas your presentation harsh? Yes. Was it over the top? A little. Did it get your point across? Definitely.\n\nMaybe your father has massive regrets since you are now his only remaining biological child and perhaps he's feeling the weight of that. Maybe he's now realizing that not all actions are forgivable.  That's on him though.\n\nYou do what works for you.", "NTA. You're the GOAT!!!\n\nHis and stepmother's behavior was extreme! Having 1 sick child doesn't cause other children to cease to exist. Demanding that you shrink yourself and neglect/belittle your wants/needs/experiences because you were healthy is beyond cruel and toxic.\n\nYou gave him 10 minutes to learn how you felt about his neglect and cruelty. He's had, what, a week or two of feeling the hopelessness and supposedly suffering. You've had at least 12-15 years of suffering??? \n\nThat's what I would text back to every person who has criticized you: you suffered depression, neglect, and cruelty for 10-12 years. You're father hasn't suffered those things, he inflicted them. He's is experiencing the consequences of his actions, and it's only been 2 weeks. The fact is you did not make that PowerPoint to cause pain, you made it to explain why you feel the way you do, and that you don't want anything to do with him, ever. Then ask those people if they ever held him to account for him abdication of parental responsibility and insist he straighten up. \n\nUnless they confronted him during that time period he abandoned you, they don't have a duck in the hunt and need to bury their heads in the sand just as they did back then.\n\nYour mom sounds like she was amazing. Your weekly collection of collages sounds awesome and I'd definitely buy a big glossy book from a person who showed them off and told the stories of that period of time. So, that means you're awesome. Which is why you're the GOAT.\n\nKeep being rad.\n\nBtw, I finally went no contact with my narcissistic mother when I was 40.", "NTA.\nHe failed you and he failed your mom because of the way he treated you. Where was the families sympathy when you were suffering ? You gave him excerpts of how you felt for YEARS.\nI hope you managed to heal and focus on your happiness for the last few years.", "NTA - reality hit him in the face. He’s lost a spouse, a son, and now a daughter. He had complete control over losing 1 of them and refused to help in the moment.", "NTA. Who are all these family members who feel like they have a say in any of this? Were they there to tell dad he was wrong when he was neglecting his own child? Why do they feel the need to give their opinion now?", "NTA if he wanted a relationship he should have been better, he’s just now realizing how much of an A H he has been and is trying to make up for it, for his benefit of not feeling bad. Keep it NC and block him on everything and tell your family that you don’t want a relationship with him just because he doesn’t want to live with regrets. He made his bed he can lie in it.", "NTA. The truth can often be quite brutal. If he never heard it, how could he possibly understand the damage he had done? How could he improve so as not to ever repeat the same mistakes with others? You were a child and he failed you. That truth is not open to debate. Now he bears the consequences to his choices.\n\nI'm so sorry for everyone involved here. Your dad was in an unbelievably heartwrenching position. He traumatized and neglected you as a result. I'm sorry that you were ignored and left to mourn your mom with no support. I'm sorry that your mental health was undervalued. But that was wrong of him. You have every right to be unable to forgive those years of trauma. Honestly communicating those sentiments is part of your healing process. NTA", "NTA. First you weren't a priority because there was a baby. Then you weren't a priority because your brother was sick. Then you weren't a priority because your father was mourning your brother. You became accustomed to not having him as a father a long time ago. Your whole relationship has been about him as a parent and not about you as a child. You expressed your feelings in the way that worked best for you, and that was your right. You didn't yell or scream. Note that the family is basically saying he's hurt, not angry. He's hurt because you spoke to him in a way that he couldn't deny or disregard and he knows it's all true. Maybe he wants to make amends. In this instance, maybe the best way for him to make amends is to leave the person he's harmed alone.", "NTA", "NTA the truth hurts", "NTA , it was harsh but also specific, so way better than just “go away”.", "NTA\n\nThat's was brilliant and really helped him see from your perspective how badly he failed you. No one wants to be confronted with their mistakes and consequences but it was something that had to be done.", "NTA. Telling the truth about what he did and how shitty it made you feel isn't what's \"unnecessarily cruel\".", "I am always for bringing in supporting evidence for a decision I’ve made. I love that you stated your sentiments in an organized fashion! Save the PowerPoint….you never know when you’ll need it again\n\nBrilliant! NTA", "NTA! It was honest and real.  If you had shared those feelings and words with him verbally and in person, he probably wouldn’t have grasped the full impact of what you went through as a child.  \n\nHonestly, these family members who are telling you that it was cruel and unnecessary, need to stay out of it.  I bet they are the type of “family” that didn’t show you the same type of concern when you were a child and were being neglected.  \n\nYou were a victim. You don’t need to be the bigger person and forgive your father or show him mercy. You don’t owe him anything.", "NTA \n\nHe gets to fail as a father and a decent human being for years, but you make one powerpoint and suddenly you're out of line? nuh-uh. He deserved to see exactly the pain he put you through", "NTA\n\nJust block those family members and move on with your life\n\nYour dad dug this hole, now he has to live in it", "NTA, bet he wouldn't be reaching out now if his son was still around", "NTA the bridge was already nuked. You just showed him the pictures of the aftermath.", "Nta please get therapy n live ur best life bc ur mom would want so", "NTA", "NTA, I love this.", "NTA. It gutted him because he finally saw things from your perspective. Too bad it's too late.", "NTA.\n\nHe emotionally abused you for years and now he's reaping what he sowed.", "NTA - I wouldn’t say you went too far, but it was a brutally honest reminder of why you went NC and I’m not shocked he’s having a hard time with it. That’s not your fault nor your problem though.", "NTA. He NEEDED to see that and you needed to show him what he did to you. I would have been worse", "NTA. I'm guessing you sent it to him and didn't stand in front of him and do a full presentation, meaning he didn't even have to suffer the shame of looking you in the eyes. He got off easy.", "NTA but it seems he not only shoved you aside, he stole any chance you had to have a relationship with your brother.  You don't need that in your life.", "NTA", "NTA and a very intelligent decision maker. Communicating with words alone would have given him an avenues to argue, justify, and try to explain himself. Utilising your artistry to communicate succeeded in both clearly articulating your own feelings & perspective, and closing down those avenues for him. \n\nYour family are wrong, your actions were not cruel; they were extremely effective as your father is now being forced to reckon with the long term consequences of his choices. Insulating him further by not being honest about your feelings would have done both of you a disservice as there's no guarantee he'd back off after a simple 'I do not wish for a relationship with you, please leave me alone\", and you clearly already derive nothing positive or constructive from communicating with him. \n\nI respect your strength of character and wish you the best OP, and I hope your family members take some time for introspection here. You functionally lost both of your parents while you were still a child, whereas your father seems to be only beginning to comprehend that he lost both of his children years ago.", "Harsh? Maybe. Necessary? Absolutely! \n\nNTA", "As a parent, if I ever make my child feel unwanted, I'll deserve to burn, no matter my excuses at the time. What you did was much less cruel than what he did to you while you were a child. NTA", "NTA", "NTA", "NTA. Time to forward that power point presentation to the family group chat.", "You literally provided the receipts. Not your fault he couldn't handle the truth. \n\nNTA\n\nI would also block those people messaging you were I you.", "NTA\n\nPutting his own quotes in a PowerPoint is not cruel. He said those things to his own minor child who had lost her mother and was now being ignored by her father. If he finds those quotes heartbreaking to read, he shouldn’t have said them.", "NTA goddamn, I wish a PP would get through to my parent. I'm sorry you went through all of that OP and even though you don't need to worry about this at all, that was probably the best thing you could do for him. It sounds like it helped you get really complicated thoughts down in an understandable way as well and that is great for you.", "NTA, I’m so sorry for your loss. First, the loss of your mom and secondly, the loss of your father (by his actions). You deserved so much better. I’m sending you so much internet love right now. Your grandparents sounds amazing, I’m so happy you had them in your corner.", "NTA.  You aren't a toy that he can pick back up now that his other child is gone.  You may not have been dealing with cancer, but that didn't mean you didn't need your father and he let you down over YEARS.  He gutted YOU for years and how many of those family members bombarded him with attacks on his behavior.\nYour PowerPoint was probably pretty harsh, but so were his actions and words so I'm willing to believe it was just getting your point across that he needs to leave you alone and avoid retraumatizing you.", "NTA\n\nYou went a little too far, sure, but you know who else went too far? Your dad for abandoning you. What he did was unnecessarily cruel and he deserved the wake-up call. Wait and see if he ever reaches out again with a thorough, detailed apology - if he's willing to accept that you won't forgive him (which you shouldn't), you can perhaps at least be low contact instead of NC. Don't give him the honor of any more than that.", "NTA,\n\nI can understand your dad trying to be there for your brother. \n\nBut. He did fail you. It was HIS job to protect you, not your job to protect him. If you had of sugarcoated it, he may not have got the full message. Your family thinks your an asshole, likely because they think you must have blown stuff out of proportion, instead of understanding that that is how you see the world, that is how you grew up. So yeah, your dad is an asshole, and your family should view this as a wake up call to how hard your life has been.\n\nI hope your doing well Op.", "More cruel than abandoning your motherless child? NTA.", "NTA \n\nYou painted literally pictures of your pain. You lost your mum, then had another woman thrown at you, then she pretty much ignored you when your half bro was born, to be completely pushed aside when he was ill.\n\nHe had your entire childhood and teens to talk to you. Just because you was physically healthy, doesn't mean you was healthy and your mental health is just as important. He didn't acknowledge that and apologising now isn't going to give you what you needed then or even now. I understand he was trying to do the best for his son, but you needed him to.", "He’s gutted & spiraling because he hurt you & he knows it. You already lost one parent but with the way he treated you it felt like both. NTA", "NTA sometimes people need to have it spelled out so you did just that. Just in case he didn’t understand the words you were using you included a pictograph for him.", "Tell your family, if showing your dad your feelings from all those years, hurt his.  Imagine how you felt while he and they did nothing.", "I think it's really important that you consider what your father went through. You absolutely have the right to be angry, he did fail you.\n\nBut he lost his wife to cancer. Then his son got cancer and it sounds like he lost focus and went tunnel vision. It's possible the overwhelming level of grief and fear misguided him into focusing on losing another loved one, causing him to neglect you because he didn't have to worry about you. \n\nYou're NTA. But before cutting your father off forever, talk to a grief counselor and make sure this is the right choice. Your father is human, and we all make mistakes especially when overwhelmed with grief.", "Well done 👏", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIf I’m the AH here, I’ll own it.  I’m not sorry, but like it would be good to know because the rest of my family thinks this went too far.\n\nMy (24F) mom died when I was 7 from leukemia. I have very few memories of her from before she was sick and I didn’t get to spend a lot of time with her in her last year but she was an artist and until she couldn’t anymore she would make me little collages when she was in the hospital with drawings and photos and messages for me. My grandmother put them all in a book for me after she died.  I wanted to be like my mom and my counselor thought it would help, so I started a journal where I would do kind of a similar thing and I’ve done at least one page a week all these years ever since my mom died, more when I miss her or have something hard going on. So, I have kind of a unique record of my mental state over the last 16 years.\n\nMy father remarried when I was 9.  My step-mother really leaned hard into the “I’m your mom now” and my father didn’t stop her.  It improved when they had my half-brother because she basically forgot about me then. Unfortunately he got cancer when he was 3. And I pretty much ceased to exist for my father, he was either working or gone with my brother and I spent all my teen years mostly at home alone or with my grandparents. The mantra was that my brother needed to be the focus because he might die so I needed to not be selfish since I was healthy. I stopped trying to talk to him when I was 16 and it was a dark time.  I moved out when I was 18 and cut them off completely.\n\nMy grandparents let me know that my brother died a couple of years ago but respected my desire to remain NC with my father. He recently reached out to them because he wants to see me and talk.  I went through my old journals and made him a PowerPoint with images of the entries where I had talked about being frustrated and feeling abandoned and unwanted, some with literal quotes of things my dad had said to me during arguments. Even the really dark stuff from when I was seriously depressed. Then I ended it with a photo of one of my mom’s collages where she had written “Remember that your dad and I are always here for you” and I wrote “You failed. Go away.” underneath. I felt like him being able to see it from my literal perspective would communicate why I don’t want him back better than I could.\n\nEvidently it worked, but a little too well because I’ve been bombarded by family telling me that it’s understandable that I don’t want to see him, but what I sent gutted him and he’s completely fallen apart after reading through it and it was unnecessarily cruel.\n\nMaybe it was, I know my bar for that is kind of weird sometimes, so AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Fuck him. He made his bed.", "NTA. Truth hurts, and it’s his burden to carry.", "NTA! What did he expect? Good for you for speaking your mind after all these years. It may have hurt him, but who cares after the ways he hurt you for so long.", "I'm in the NTA camp. That is a hard discussion to have with someone face to face. You found a way that works for you. That said, try to be open to MAYBE trying to bridge the gap in some way. He might have been doing the best he could. He has lost a wife, a son, and you.", "NTA", "No, it was necessary to inform him how his actions caused you pain.\n\nIt was cruel for him to neglect and ignore his child.\n\nNTA", "Utterly harsh, but deserved. Maybe over time  you might come around IF he leaves you alone now that you’ve inflicted some well deserved pain on him, but that’ll be down to you to instigate.\n\nNTA", "Nta", "NTA", "Nta and good for you to show him why you won’t forget ever what happened…So your brother was sick but now he lost two sons", "NTA and i hope you heal and live the absolute best life your mom would be proud of ❤️ your dad sucks, you simply showed him your life while he was supposed to be your parent. how he feels about it is on him.", "NTA, for those telling you it was too harsh, tell them \"He only had to see pictures of it. I had to LIVE through it!\"", "NTA. If you had just said how you feel, you would have gotten a lot of \"You need to understand\" or \"it wasn't that bad\" etc. The fact is he didnt give you a thought for years and your journal entries were the result. He *should* know what he did to you and why your relationship is dead, and deal with it.", "NTA. He deserves to have his failure as a father rubbed in his face.", "Oh no it’s the consequences of his actions. He probably gutted you every time he chose someone or something else over you. Talk about taste of his own medicine, he’s only upset because it’s true. NTA OP, hope you are doing better now", "Nta. I admire your creativity.", "NTA. You had to get your message across somehow and you were completely honest about everything. The reason your dad feels \"gutted\" is because he's being called out on his bullshit and doesn't want to own up to any of his mistakes.", "NTA you just put a mirror up for him to see his own actions. That’s not cruelty that’s just reality.", "So his awful parenting that cause you significant depression and (likely) abandonment issues is okay, but you sharing how you felt at the time as the victim of your father's inability to parent more than 1 child at a time is cruel? You didn't cut deep enough when you went NC with part of your family. Time to add more people to that list. I hope sending your father that power point was cathartic for you. NTA", "NTA, but your family is for prioritizing his feelings over yours. It also implies that he complained about how the PPT is affecting him, once again centering himself. Neglect is a form of abuse and I can tell you the pain he’s feeling now is nothing compared to the years of suffering you endured. Congrats for valuing yourself enough to express the pain he caused you.", " What your father did was horrible and you have every right to not want him in your life. I'm not going to comment about the way you handled his reaching out as it's your life and your lived experience. As someone who came from selfish dysfunctional family, no where near as cruel as you endured, just not good, I'll offer this. As I've gotten older I see my family for what they are and while I don't totally forgive them, I've made my peace with it. I now live a better life after letting the anger and frustration go. It took me many years to figure it out and I hope it's a gift you can give yourself someday. NTA", "Oh, like it was surprise to him that he's failed, up until this very point.\n\nI'm assuming he's not been super specially traumatised by PowerPoint running over his dog or something in the past, so none of this should be unusually horrifying to him.\n\nI guess he just wasn't expecting an impenetrable level of organisation and logic? Or, more like the reality of his screw up had been shrouded in self-justification until this point, which is no match for reality - that's his own delusion to deal with.\n\nNTA", "I get where you are coming from and he failed big time.  But as a parent I try and treat my kids the same, but if I had one who was dying I don't know how I would treat everyone.  I am sure I would make so many mistakes.  \n\nYou do not need a relationship with him.  And it is good to have gone NC but I do have some sympathy for him.", "ESH. Sure, he could've been a better dad. You're an adult now and have every right to choose NC. Walk away if you must, but there's no need to drag out a laundry list of every transgression in your life to someone who you know has also experienced trauma.", "Sometimes being hard is whats best as he literally abandoned you while still being around tou which is so hard and he needs to understand what he did and those consequences", "NTA", "Definitely NTA!", "You are awesome!!!  I'm proud of you for your self respect!", "Nta he made his bed now he can lie in it.", "NTA. I hope it brought you some peace or closure to get to show him how his behavior impacted you. You were forced to deal with it, I don’t see why it is now unfair for him to have to reckon with his past", "NTA. Extremely effective PowerPoint.", "Personally, I think it's great.\n\nNTA", "Dear old Dad can't use the 'missing reasons' excuse after that! Well done OP.", "NTA, everyone feels bad for a grown man having his feelings hurt. What about the child who lived it?", "Eh, possibly over the top, but it seems like you already cutting them out once wasn't enough.\n\nNTA\n\nAlso, I was worried some family member was going to ruin the collages your mother made you. So glad you have those mementos.", "NTA. If people want to be treated better for the things they've done, they should do better things.", "NTA.\n\nHe deserved it. He did fail you as a father. I hope you are doing well now OP.", "Hard truths are still exactly that: truths. \n\nNTA", "NTA. I was terrified that this post was going to end with your father destroying your journals -- thank God it wasn't that. And I feel for your father, I really do. To lose a wife and a child to cancer is terrible. But he treated you very badly, and all you did was show him how it made you feel. I'm so sorry.", "NTA he got what was coming for him", "NTA. Oh he’s gutted? Good. He deserves it. First for not stopping his wife’s bs and then later with your half brother. \nHaving one sick child does not mean you stop being a parent to the other(s). \n\nYes I’ve had those situations in the family and worked with kids who’s siblings were the ‘sick’ ones. Having seen what this complete neglect and abandonment does to kids and teens… I will Never forgive any so called parent for doing it.", "NTA. I love this for you. Getting to express the pain and suffering your father caused you should help immensely, and all the hypocrites that didn’t help take care of you when you were suffering those same feelings can go straight to hell.", "NTA.\n\nI went NC with my father for something very similar to you. The only redeemable part here for your father seems that he's remorseful. The fact that he couldn't figure out why on his own is ridiculous, especially after years of NC. \n\nPeople sometimes need perspective.", "NTA sometimes people need to be gutted to get the point across", "Nta", "NTA \nI don't think he would have stopped badgering you if you just said leave me alone. You made him confront the harsh reality of what he did. He not only failed you. He failed your mother, his first wife. I bet he made promises of how he would raise you, and this just brought home that he is an awful father and husband. Was it cruel? Truth can be. But truth is what he needed to hear.", "NTA, and the fact that he's sending his flying monkeys at you proves you were right. He's trying to guilt trip you through them. That's egregious in its own right.", "NTA - Sometimes a person needs a hard reality check to understand the gravity of what they have done.  According to your family members he has received it.  I am sure he is gotten and it is hard not to feel a little sympathy for the person who has not lost 1 but 2 children now but he lost the 2nd child due to his choices.  He has now realized he failed his former wife and child and has basically nobody left.\n\nIt is a sad tale and it is one that is unfortunately all too common.  Your father will probably try to make it up the rest of his life with little to no success.\n\nYou are allowed to pity someone even if it was their actions that caused their situation.", "NTA.\nHe did fail and you had more consideration than he deserved by letting him know your thoughts and feelings about this matter. It's not your fault if he couldn't handle the truth and consequences of his actions.", "NTA unless A is for.Artist.  Gutting someone with your work makes it a masterpiece.  Good luck.", "NTA The truth hurts and so do facts. His actions have consequences and long lasting\nHe made a choice when you weren't even 12 years old to where he chose not have a relationship with you.\n6 years latter you made it clear to him that he his with came true. He doesn't have a relationship with you.\n\nHe wouldn't be reaching out to you if your brother was alive. Tell your family that. Now that he lost his son he wants to try and establish a relationship with the daughter he abandoned 17 years ago.", "NTA! PowerPoint is a very effective communication tool. It appears to have worked. The truth hurts sometimes.", "NTA what you suffered and went through is heartbreaking especially having to go through it without the support of your father. Hopefully, this opens his eyes so he can see how much he hurt you. The family members who are coming at you now shouldn't be getting involved. This is between you and your Dad.", "NTA.\n\n>Evidently it worked, but a little too well because I’ve been bombarded by family telling me that it’s understandable that I don’t want to see him, but what I sent gutted him and he’s completely fallen apart after reading through it and it was unnecessarily cruel.\n\nYeah, well that's what happens when you basically abandon a child. It's not pretty. You were only showing him what you felt all those years. I get that he had to handle the situation with his dying child, but that's no excuse to forget he had an entire other child. You felt so much pain for literal YEARS. He can deal with this gutting moment.", "NTA \n\nYou made it very clear why you will never have a relationship with him to prevent him from trying again. I don't see a problem with this at all as he needed to know exactly what he did to you.", "NTA. He failed as a father. Why would you want him in the life? Your PowerPoint made him face the harsh realities of his failure. Why should you feel bad especially after all he did to you?", "I venture a guess that pulling together that PowerPoint must have been incredibly difficult for you.\n\nI am sorry for your loss and your pain, and I hope you have been able to take steps to heal. \n\nYou’re NTA here. \n\nFrom my perspective, you did him a kindness. You opened up your past and were vulnerable to help him see you for who you were then and have become. \n\nI hope one day he can be proud of you for it, from a distance of course. \n\nI would be if you were my child.", "NTA. I’m a petty AH so I’d send them the PowerPoint you used on him and say that if they want to support him for doing this to you, then they’re just as bad.", "NTA\n\nthis is a direct product of his own actions. He has no one to blame here but himself. Every time I read stories like this, I always feel like the OP is just the backup option that the estranged family member is only seeking now that they have no one left. \n\nSure, maybe he really has recognized his neglect of your needs and feelings, but 12 years is a LONG time not to have figured it out already", "This would be the family who didn't slap some sense into this man 16 years ago and didnt help you out? \n\nNTA", "Well it seems the cap fits and now your father is wearing it. But he's an adult and you were just a child. If you are the asshole then I still have no sympathy for him. But for me NTA. He can deal with the emotions just as you had to.", "NTA it’s amazing that he thought that it was reasonable to do that to you after you already lost your mother. Sorry you had to grow up feeling that. The power point slide was a nice touch IMO", "Bonus points for the Power Point. Way to go. \n\nAny questions?", "NTA. He failed as a parent and this is his consequence. I think it was a brilliant idea.", "NTA, forget all the deadbeat dads and sloppy mums who came here to say otherwise", "NTA. That was what Happened to you. His choice, his actions, his burden to deal with. I’m sure it was cathartic to send that to him", "I hate PowerPoint as much as the next man, unless that man happens to be your dad. \n\nAbsolutely NTA, he reached out and you reached back.\n\nHes hurt and upset not because what you said was a lie, he's upset because he knows it's true.  All those family member attacking you are doing so because they either didn't notice what was going on or chose to ignore it. Either way, they're arse holes too. \n\nI wish you all the luck in the world.", "NTA. Hard but true.", "Abandonment has repercussions. NTA", "NTA - and actually kind of brilliant. When a lot of people go NC with their folks they don't really get a detailed explanation. I think your explanation was more than thorough. There should be no doubt in his mind why you are NC right now.\n\nAnd I'm sorry. You've had a lot of loss and all of this just really sucks.", "NTA. He deserved it. You are his child too and he abandoned you when you needed him. I am sure you were upset about your brother being sick.", "NTA. Wish I had some old collages to send to my parents.", "NTA. Good for you, OP. I hope this brings YOU some closure. You don't owe your father anything. Nada. Zip. Zero. Your family who wants to champion him? You don't owe them that either. Honestly, I'd send them the same powerpoint so they could see exactly what you went through.", "I mean.. he should be falling apart.\n\nPersonally... I know how hard it is to have a kid that is dying, and has at this point passed on. But at NO point during everything did I shrug off or ignore my other kids. I held them closer and tighter. \n\nMy bio dad did something similar to yours OP. He ignored me and shrugged me off for years after his step son died. Then when my daughter was dying he took the opportunity to tell me how disappointed in me he was. He is now blocked, everywhere, and I've had to threaten to call the cops because he just shows up sometimes.\n\nNTA. The way you went about it showed him the hurt and pain he caused without being rude and purposefully hurtful.  I hope you continue to heal OP.", "NTA\nIf someone didn’t want to be written about like that, shouldn’t have acted like that.\n\nInteraction with him would be purely for his desires, not yours. It wouldn’t make sense to open communication that you don’t want to have nor feel a need for.", "NTA, he needed to understand and being gutted is the appropriate response to knowing what he did to you. Cherry on top would be if you added a song though, I had a friend who as a teen made a PowerPoint to break up with her then bf and the back grounds were all different pictures of her with a sad expression with bullet points for why it was over and playing in the background was ushers let it burn.", "NTA. Anyone that disagrees with you should have to go through the same power point your father did.", "NTA\n\nThe truth hurts. He failed you, you learned to live without him, and now you don't want to be his second choice now that his son is gone.", "NTA - frankly I think it's brilliant. What did he think you were going to say? \n\nTell your family that if they have an issue with any of this, they should have counseled him not to neglect is daughter and they can be added to the no contact list if they'd like.", "NTA, if he can't handle how you feel he shouldn't have treat you that way. I'm not as eloquent as some of the other users here, but no matter how brutal he brought this on himself.", "What did you hope to achieve by the PowerPoint?  Did you achieve it?\n\nIf yes - then move on.\n\nBut reading your account and that you have a \"16-year record of your mental state\" - I don't think you accomplished anything.\n\nSo what was the PowerPoint about?  Punishment?  How does that help you?  Because it seem you need help with this.  Professional counseling should be in your future.", "NTA.  You have been through a lot.  Your father has to deal with the choices he made.", "NTA when an adult child tells a parent how bad things got when they were a kid, they brush it off. They say, 'it was never that bad, you are misremembering, you shouldn't bare a grudge, it was a long time ago, you should let it go.' Instead of facing the truth, they dismiss it, try to make a clean sweep of it. (It has happened to me.) What you did was present absolute proof of events and you feelings from those exact moments from those times. He couldn't dismiss it and say it never happened. He has to face what he did. It is a very powerful thing you did and a deep validation. Your family are just angry that he cannot wiggle his way out of it. You did something that has relieved you of a great deal of burden and will serve you well mentally in the future.", "NTA. I am glad you got your chance to express in your way how you feel/felt. If he hurt you so badly, i think its good that he know how and why. Well done!", "NTA but damn you are dark, like I felt bad reading it but I understand that’s how you may have felt so NTA", "NTA\n\nHe made his choices. He should see the consequences of his actions.", "NTA he was at fault", "The internet is sorry to hear the shit you have been through. I say NTA whilst your dad also suffered those losses he should of made you more of a priority. Now you are an adult you have the choice of who you have in your life \nGood luck op stay strong", "NTA. I haven't been able to bring myself to do the same with my mother but without the truth coming out, the relationship could never really be fixed anyways. \n\nIt was hard for him to know but he did need to know. He genuinely abandoned you.", "NTA. It's brutal, but it is what it is.", "NTA. You took a creative way that showed him just how poorly he treated you over the years. If he wasn't able to deal with it (especially seeing the quotes from your mother) that's on him. Perhaps seeing it in writing got the point across where your words hadn't been able to reach him. You don't have to allow him back into your life, no matter what the extended family say.", "NTA\n\nYou showed him the truth there's nothing wrong with that.\n\nYour dad wants to see you know because you're the only child he has and the only chance of getting grandbabies. If your half-bro survived then he wouldn't care about you.  You're just a replacement.", "NTA. A power point is impressive tbh.", "NTA\n\nI SO love your response.  I hope it gave you some catharsis in the process making it.  Super Hero!\n\nHe deserves to be \"gutted\".\n\nHe abandoned his child and it takes literally years to notice and make an attempt to get that child back in his life.\n\nCruel, possibly, but not more cruel than what he did to you, as stated in your PowerPoint.  \n\nGood for you.  \n\nHis family, too bad, so sad.  He has to live with the consequences of his actions.  Oh well!", "NTA - you don't want a relationship and it seems your Dad didn't want a relationship until recently. I'd be wondering why now. If you had just said no, I suspect that there would have been repeated attempts and he'd be using the family to pressurise you into changing your mind. This has made it very clear where you stand and exactly why you feel that way. \n\nOn the other hand, I am glad he has family support because he probably is in a black place having lost effectively two children. But then again so were you with less suport.", "NTA. So it’s ok he put you through all that but it’s not ok to point it out?  He should feel gutted. Just because one child has issues does not mean you ignore the other one.", "I mean hes just feeling the pain he caused you youre whole life. Unfortunately for him he got what he deserved", "Tell the family that you are gutted by your childhood. NTA", "Fxck yeah. The biggest NTA Ive ever read. Id give you a hug if i could.", "NTA! He was a shitty father, he deserves it!\nHe absolutely forgot about you, no he doesn’t have son and remembered that he has a daughter?", "NTA. You have only provided your father with what he gave you. How he takes it is on him. But do feel free to ask those family members where they were when you were tossed aside.", "NTA. And I’m so sorry for what you have been through.", "NTA.  With enough humility and empathy, maybe your dad can look at what you presented him and truly understand and maybe do the work to rebuild a relationship with you. But a real one, knowing the reality of his behavior and the impact on you.\n\nIn some ways, giving him insight into your mind and experience is a gift.  Let’s see if he uses it.", "NTA. He only had to see the consequences, you had to live through the suffering.", "NTA, thing about being a parent is balancing and taking care of all your children. He failed and I am most definitely positive that he is gutted and feels bad is because he recognized that he did fail and the presentation of all of your point of view just fuels that.\n\nNow, I am all for petty things as I am a petty person. Yet I do know that some people try to make efforts at trying to repair relationships even if they can never be where they want to end up. You are in your right to remain NC. But if there is a point where you do give a chance for him to repent and change, make sure boundaries are firmly and set in place. Granted seeing your situation I doubt it will happen and that again is fine.", "NTA You showed him exactly why you are NC and now he gets it.", "Nta.....he deserved exactly what he got. He didnt think of or spare yoir feelings when you were a child so why should you spare his as an adult. You shined a light on his actions that he wanted to keep in the dark so he didn't have to accept that the blame was his. Keep nc and keep healing. Your family will have to get over it. Him \"falling apart\" is karma coming back to bite him in the ass", "NTA.  The sperm donor only reached out to OP after his son died.", "NTA. It was a badass move on your part and I truly hope it helped you heal some more.", "This is glorious and you are NTA- at all. I love when someone can see their consequences in black and white. I'm glad you survived your childhood and I'm sure your mom is beyond proud of you.", "As cruel as abandoning a child who lost her mother level cruel? I don't think do\n\nNTA\n\nEdit because I hit post too fast", "He has to understand the consequences of his own actions, you did it in most brutal way but sometimes it has to be done.\n\nIt’s no one business to tell you how to feel or react when you were treated as you were. If he wants contact, it about how you feel and want. Unfortunately, he caused a lot of hurt and pain and he has realise that because he created the situation.\n\nIf your father was that upset, tough, he created the situation and he has to live the consequences, just you have to live with how you were treated.\n\nYou are definitely NTA, hope this helps with your feelings and emotions about the situation and able to let go of the anger, while not forgiving him.", "I don’t think you are an asshole. But I want you to think about something. You just shared something deeply personal and intimate with your father, while telling him you don’t want a relationship. Can you see how that is emotionally contradictory? \n\nYou wanted your father to understand your pain. You wanted to hurt him for hurting you. It’s natural and understandable. But now you need to give serious thought to what you want going forward. If you really want him out of your life, if you really want him to be nobody to you, should you not also be nobody to him as well?", "This is called karma my friend. You know when you play a story line game and make a bunch of dumb decisions and feel in the deepest part of your guts that you'll regret them later but ignore them anyway only for them to come back and tear you shreds? Yeah thats what happened with your dad here. He chose to make a copious amount of dumb decisions and neglected you for YEARS. It all came crashing down on him and tore him to shreds. There is no one to blame but himself. NTA op, stay strong through this and hold your ground.", "NTA. I don’t care how good you are at PowerPoint—no slide show about how much he hurt you will ever compare to the pain you felt constantly for your entire childhood, and continue to feel to this day.", "NTA. He should be gutted. He deserves to be gutted. He’s been gutting you for many years.", "If you're an asshole for this, I'm an asshole for telling my father he doesn't have much of a relationship with me because he decided to be a manager and not a father, and failed to really do anything meaningful with me when I was in my adolescent years.\n\nI learned how to set up my own campsite, start a fire, apply first aid, do various crafts, and even do my taxes with the help of other adults in my life, often in boy scouts. I gave up in school because I was tired of hearing how I'm wasting my potential, and figured out if I just didn't apply myself the bar would lower on its own. I disregarded his advice against girls I've dated because he never seemed to approve of anyone I wanted to hang out with anyhow. He destroyed my trust in him and comfortability for personalizing my own things with the number of times and things he's confiscated, forced me to surrender, or destroyed of mine. He treated my ADHD as if I was just being lazy, and was never available for me to ask him to help with homework.\n\nYou were seriously hurt as a child. I can relate to that more deeply than I would ever want. You aren't the asshole for saying \"you threw our relationship away, and I'm not going dumpster diving.\"", "Nope NTA, love how people drop others and expect them to not harbor resentment when they decide to contact you again.", "q", "NTA.  A bit harsh but people need a reality check sometimes. Your father failed the one thing that hes supposed to do which is be your father.", "NTA\n\nIf you’d simply said you didn’t want a relationship, he would have merrily gone on pretending he did his best in a hard situation. \n\nHe did not do his best. \n\nYou illustrated that he failed as your parent. He didn’t try to balance the needs of his children. That’s what he has to understand. \n\nIt’s likely far more comfortable for him to pretend you’re just maladjusted because you’re jealous of the “attention” your half brother received. \n\nBut this all started before he got sick. You needed support and you did not receive it.", "NTA, sorry he couldn't handle the *literal emotions you have dealt with your whole life*. It's not like you made them up. Staying NC sounds lie it was the right choice", "NTA but what you did was cruel, would it concern you if you made your father feel the same way he made you feel? If not then fair enough the indifferent nature of life has made you indifferent too. If it did concern you to know you caused someone else to feel the way you did, you might consider having a talk with him. I don’t think you can be blamed for any of it though.", "NTA.\n\nI went NC with my dad too. And I ignored his death-bed call(s). He's likely long dead now, I dunno. Don't care. I have thoughts about how I'd want to handle it, and while powerpoint was never on my mind, it will be going forward.", "YTA it's not healthy to hold onto every wrong an slight from the past. People (all people) fuck up and make mistakes. You aren't even giving him a chance to apologize and trying to move forward.   \nTrust me anyone can be made to feel/look bad if someone literally cataloged everything they did wrong over a couple of decades and collected them up and laid out a one-sided presentation to suggest a person is only all of their collective mistakes and not a complex and flawed individual. It seems like you need help dealing with your grief.", "Repost", "[removed]", "I’m going to go with YTA. I understand where you’re coming from, but you could have done it a nicer way.", "[removed]", "I purely love this saying and I'm gonna keep it an use it! Tyvm!\n\nFor op, NTA.", "I like to say \"If the truth hurts, you deserve it\"", "Similar to my favorite “tell your stories- if people wanted you to write warmly about them, they should have behaved better”", "Fuck yeah op. FUCK. YEAH. That's a good quote.", "NTA, How arrogant of OP's \"family\" to expect op to cover up OP's feelings for your terrible father.", "That and he realizes he has another child to replace the one that passed", "NTA,My father and I had a horrible relationship. Absolutely horrible.", "OPs dad sounds maidenless as fuck", "That was my response after reading that. Like great job 💯wish I could have done that to some people but HOLY SHIT!!  I would honestly compare it to the Fatality in Mortal Kombat.  That is what you would call a finishing move", "Maybe that’s the problem; Dad thinks he has infinite do-overs.", "That’s exactly how my brain saw it popping up too!!! OP, NTA at all. A little brutal, sure, but ignoring your kids existence after she’s lost her mom, & you’ve replaced her with a new kid/step mom is pretty damn brutal too 🤷🏻‍♀️", "GTA “Wasted” 😂", "He probably wouldn’t have tried to reach out at all if her brother hadn’t died. I think he’s just reached the point where he realizes that more children probably aren’t coming and the only hope he has for grandchildren rests with OP.", "NTA, It is okay for you op to feel and think the way you do.", "Sometimes a simple go away isn't enough to stop a person from continuing to push their wants. Sometimes if you want them to truly go away permanently you need to use the nuclear option so there is no doubt", "Probably also felt cathartic to OP. NTA, harsh but real.", "right!! i would send the powerpoint to each flying monkey that tries to guilt trip you @ OP. \n\nor you can say “i dont see how that is any of your business.” or “what an interesting opinion. what do you think of the new Wednesday Addams series on Netflix?”\n\nNTA ofc, you’re an icon.", "I agree, NTA. Yes, it was on the brutal side, but it also is not your responsibility to sugarcoat the truth. If you had, he would likely have tried to downplay the emotional damage. Now he has proof and has to face to reality. Your dad was in a tough spot too, but it was his responsibility to manage. You were still a kid that lost their mother and you still needed his support. He did indeed fail you! It was probably very hard for him to hear, but if he was pushing you for a relationship, he probably needed to hear it.", "Yeah, the shitty thing is I actually loved my brother a lot, he was always a sweet kid even when he was sick. Even if my step-mom sucked I kind of liked being his big sister and missing out on time with him is the only thing I really regret about leaving.  I always kind of hoped he would get better and we could reconnect when he was older.", "Also it’s important to make a victim impact statement in order to process your grief.", "I’m with you.  Jesus, his wife died, his toddler is dying. He’s doing everything he can to stay employed and keep them feed and a roof over their head AND keep the marriage going.  I’m thinking maybe we cut the guy some slack.", "Agreed. All you had to say was no. Maybe if he wouldn't accept no as an answer, then go nuclear. You went hard from the get go.", "why should she give him a chance to apologize? what her dad did isn’t a “mistake.” he made the decision to push her aside for her brother. he had YEARS to fix it. her dad should feel bad and he deserves it.", "So choosing to treat her badly doesn’t make him an asshole, but her showing him how he chose to treat her makes her an asshole? Please explain.", "Why?  Why should he be shielded from the consequences of his actions?", "It’s honest. Honestly, she did it in the kindest way possible.", "You should say Esh at least", "[removed]", "NTA The reality hurts", "In my experience with Narcissist's that doesn't resinate the same way. Which is why i started saying it the other way, doesn't stop them from trying to gaslight the situation \"It didn't happen that way, etc\" so when you show proof and tell them their conduct is the problem not the truth it helps take the wind out of their sails. Its not a sure fire thing with Narcs but it really helps deflate them.", "Exactly! Considering that the family thought that the father getting confronted with what he did is what's cruel, not what he actually did; I have a feeling that a simple \"no\" or \"go away\" wouldn't have been enough for them anyways. They clearly don't side with the OP.", "Amen. People won’t take no for an answer. I’ve gone NC with my father as well and I wish I had the guts to take a similar approach rather than spend months receiving messages saying how what he did “wasn’t that bad” and he “doesn’t understand” and he’s “said sorry a million times” and he “doesn’t know where he went wrong,” etc. After blocking him, he even went through loop holes, adding me to group chats in messenger to get around the blocking, mailed me things and so on. After all this time, it’s still about how everything makes *him* feel. Similarly, even now, OP is receiving the brunt of her father’s failures by being told to feel bad for “making” him feel bad for his own actions. Love a bunch of these comments here. And I’m very proud of OP.", "Because all people are imperfect, all people are flawed, all people make mistakes. Without forgiveness, there is no moving forward. He is not WORTHY of forgiveness, no one is, and yet we should seek reconciliation always.   \nRead up on the reconciliation in Rwanda following the 1994 genocide. It's amazing grudges some people will hold onto while others find a way to move on even after a fucking genocide.  \nhttps://www.cbc.ca/radio/ideas/why-rwanda-is-held-up-as-a-model-for-reconciliation-26-years-after-genocide-1.5842139", "[removed]", "[removed]", "Yeah. My narcissistic sister would always say i was mean when i pointed out her horrible behaviour, because i only remembered the bad things.\nCan't reason with those people.", "Yeah I see how you are trying to close off arguments with the wording.  Like you I don't really expect a narc to concede that their behavior is bad, so I just keep it simple for anyone else who may be listening/reading and ignore any further complaints from the narc.  Since their woe is me act is usually intended to gain sympathy from an audience and turn the victim into a villain I find that the simpler argument is best.", "Excellent point.  OP should ask how telling him about how he treated a child for years is worse than telling an adult about it in a few minutes?  What did they tell HIM while he was doing this?\n\nOP was far less cruel than he was.", "i know people are flawed and people make mistakes. i also know people aren’t worthy of forgiveness. the thing is he didn’t make a mistake, he willingly made the decision to do what he did. he had plenty of time to apologize and try to make things right but he didn’t until the brother died. he’s now paying the price for that. \nyes holding a grudge isn’t healthy and some grudges maybe be stupid to you or me but it’s very valid to others.", "A single PowerPoint is worse than years of child neglect? Are you sure?", "How?  He's seeing the effects of his behavior as it happened.  That can't possibly be any worse than the trauma he inflicted.  \n\nThis is justice.", "How?", "So , nearly a decade of ignoring and basically shoving her to the side is outweighed by a single PowerPoint showing that he failed as a parent?\n\nJust cause one child is sick, doesn't mean you forget you have another child.", "u/LaetilHelianthus you are spot on!! The father inflicted neglect, dehumanization, and pain on OP for 10-15 years. The father was confronted with consequences of his behavior and is supposedly suffering, for all of what? Two weeks max?\n\nDear maligned dad went to ALL the family and showed them how badly OP hurt him. She didn't hurt him. She made a PowerPoint explaining why she doesn't want a relationship with her father. He inflicted that harm on OP for 10-15 years, daily. Dear dad has inflicted the pain on himself by (out of the blue) caring for a relationship with OP.   \n\nSounds like dad should have changed his behavior in the past, then he wouldn't have hurt OP nor himself. \n\nBtw, to the person who labelled OP an ahole: 2 weeks of suffering from self-inflicted harm is damn near non-existent compared to a decade/decade-and-a-half of that harm.\n\nDear dad FAFO. He's responsible for his actions. He did this to himself. OP is blameless."]}