{"id": 4332, "submission_id": "zh1rj3", "title": "AITA for not wanting my daughter to wear heels to a wedding because she will look taller than me?", "selftext": "My (44M) daughter (16F) has always been a nice girl that is a little shy and never causes any trouble. She is great at school and very talented in many activities. She has a group of like-minded trustworthy friends but has never been involved with boys or go to parties late at night. My wife's niece is getting married and she asked my daughter to be one of her bridesmaids. I thought she was maybe a little too young for that but ultimately didn't protest. They issue is that as part of her attire for the wedding she is expected to were high heel shoes.\n\nI'm only 5'6\" tall and I have a deep trauma related to my height because of all the bullying that I suffered for years in the hands of my brothers with the approval of my now deceased father. I only started to get better after finishing college. It took me years of therapy and going no contact with almost all my family to be able to mostly leave all that behind. They fully made me belive that no woman would ever like a man as short as me to the point I never had a romantic relationship until I met my wife at 25. But I am not still fully in control of my emotions related to this issue, in particular I have never been able to stop the phobia I have towards women that are taller than me. My wife is 5'4\" tall and my daughter is currently 2-inches taller than her mother. That makes her almost exactly the same height as me. I never expected her to be so tall but I have been able to remain mostly calm about it. I think knowing her since she was a baby and watching her grow myself helped my brain to humanize her and not seeing her now as I see other tall girls.\n\nSince she stopped growing a couple of years ago, I have been silently preventing my daughter to wear heels or any kind of shoes that make her appear taller than me. There has been no real problem with this because she has never had any serious interest in wearing those things until this wedding situation. I know that even just seeing her in front of me with heels, being taller than me, would be triggering to point of making me cry if not worse.\n\nAll this will be specially terrible in a big family event like the wedding. Everyone will think that she is taller than me and I rationally know most people won't care buy I think I might really have a panic attack from the embarrassment that will be happening in my mind. I tried to convince her to not wear the heels but this time she really wants too and it is not interest in what I said. My wife thinks that if it is such a problem for me I should just not go to the wedding but I think that is unfair. I don't like feeling excluded and this would  be practically as if they excluded me because of height, which would feel specially pinful for me. I have been talking to both of them about these but it has been proven useless. And now they have even start to act tired and angry any time I bring up the subject. My daughter in particular says I am making her feel bad and not allowing her to enjoy being a bridesmaid.\n\nAm I the Asshole?", "created_utc": 1670603552, "permalink": "/r/AmItheAsshole/comments/zh1rj3/aita_for_not_wanting_my_daughter_to_wear_heels_to/", "score": 710, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) Insisting for her to not wear heels at the wedding because of my issues. (2) She really wants to wear the heels and says I am making her feel bad about all this.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Speaking as a fellow short guy, yes, absolutely YTA.\n\nWhile you're entitled to your feelings, your behavior and attitude is projecting and punishing your daughter for your own insecurities.\n\nIt's not like she has any control over her genetics or height. You are being controlling and frankly unreasonable making this about YOU.\n\nIf it is going to be that traumatic, then don't go. Don't allow your phobia and personal hangups to be abusive towards your daughter who is doing NOTHING WRONG.\n\nAlso, you definitely need some therapy to address this.", "YTA. Your past trauma about your height should not be heaped upon your daughter. It's not her responsibility to protect your ego.", "YTA\n\nYou can't bring yourself to respect women who are taller than you.  That's no different than a tall woman disrespecting you for being short.\n\nYou're putting your trauma on your kid and would rather hurt her than deal with your own discomfort.\n\nAlso, you're blaming other people for the idea that *you* might need to make a choice about what's best for *you* regarding *your* attendance and *your* mental health.  That is NOT the same as anyone excluding you or uninviting you or acting against you.  That would be *you* recognizing that *you* haven't made enough progress with *your* issues to be *happy* while attending and *you* aren't in a place where you can behave in a socially acceptable way or be present without hurting others or starting drama.\n\nQuit playing the victim.  Quit trying to control what kind of shoes your kid wears.  Quit shaming her for being as tall as you. Start going to therapy.", ">helped my brain to humanize her and not seeing her now as I see other tall girls.\n\nYTA go to therapy man. And I'm writing this as I'm sitting outside my therapist office waiting for my appointment to start. Your insecurities should not affect your daughter's confidence or ability to do anything.\n\nAnd as a 5 ft 11 woman I really don't like that you have to \"humanize\" women just because they are tall... That's really fucking weird...", "YTA.. I’m taller than my dad and even tho it looks a little off since he is the dad and I’m the daughter, if I want to wear my high heels, he would never stop me. \n\nGet some more therapy to work on this issue and don’t project it on your daughter.", "YTA, you clearly need more therapy if you are secretly dictating your 16 year old daughters footwear.", "YTA. Not only did you not want your daughter to be a bridesmaid, you also don't want her to wear heels. What *do* you want or allow her to do?\n\nYou don't want to be \"excluded\" but you're perfectly fine with having your daughter be excluded from the wedding party because of SHOES. Imagine being so insecure that high heels cause you to break down and cry. Perhaps you should talk to a therapist instead of tearing your daughter down for shoes and being the height she is.\n\nAlso, when people see women in heels, they don't think \"Wow she has tall genes!\" Everyone knows that your daughter isn't that tall without heels.", "YTA.\n\nPlease don‘t take your own insecurities out on your daughter. She‘s your child!!!\n\nWork on your issues and surround yourself with people who aren’t superficial/judgemental.", ">Since she stopped growing a couple of years ago, I have been silently preventing my daughter to wear heels or any kind of shoes that make her appear taller than me.\n\nsorry, YTA. Your trauma should not change her life choices. I am sorry, but you need to process it and get over it, not restrain her from doing things she feels like doing. Your feelings are within your head, and they should have to change her right (it is a right) to wear high heels in a family wedding.", "YTA \n\nInstead of limiting and controlling your daughter, work on your insecurities.", "This is utter nonsense. Don't take your weird insecurities out on your poor daughter. Go to therapy. YTA.", "YTA. Great idea, complain about having issues from getting bullied about your height, then proceed to bully your own daughter about her height. You’re a winner OP. Stop being so insecure about your height, I’m sure you are the only one that gives a shit", "Of course YTA. You need to seek more treatment for your phobia and stop projecting it onto your own kid. Your daughter isn't responsible for your panic attacks and mental health, you are. When your mental health issues require you to control what the people around you are wearing, that is when they are so out of control that you need to seek more help.\n\nYour wife is absolutely right. If this is such a problem for you, the correct response is to opt out of the event, not to control, bully and dehumanize your daughter.", "YTA.  You're the father.  Put your child first.  If you can't be at the wedding because it's too triggering for you, don't go.", "YTA.\n\nYou're seeding the same values that led to you getting bullied when you let your insecurities win. My dad's about 5'7\" and *deeply* insecure about it. It just makes him look pathetic and whiny. \n\nHelp be the change you needed.", "You don't like feeling excluded yet this is exactly what you're doing to your daughter. YTA.", "Yta. What about all the other people that are taller than you? Even without high heels? -.-", "Bruh, I'm 5'6. Stop projecting ur insecurities on ur daughter, let her enjoy life and her high heels. If u hate it so much that u barely see her as human than seek therapy or start wearing a pair of heels urself 👠👠☺️", "YTA. Your daughter is 16. This won’t be the last times she wants to wear heels. You need to find a way to come to terms with it. You can’t tell her what kind of shoes she is allowed to weddings, partys, her graduation - you get it. For the situation on hand your wife is absolutely right. You need to stay home. You can’t make a scene at the wedding. And you will no matter what. Your daughter can’t be the only bridesmaid in sneakers. This will raise questions.", "Yta\n\nYou are doing unto your daughter what was done unto you.\n\nStop making your daughter feel like crap about her height. Make no mistake....that is what you are doing. Controlling her footwear to make you feel better will make HER feel crappy and wrong about her own height.\n\nStop it.\n\nThis is you. This is on you. Your daughter is not responsible for making you feel better. Especially since you are doing it at the expense of her own well being.\n\nDo better. Get more therapy. Your daughter is 16, she  should be able to make these decisions herself. This is her expression you want to control.\n\nSpoken by a 5 foot 11 woman who dated a 5 foot 5 man for 7 years.....and wore heels. And he loved it. And to this day, I still love his confidence.", "YTA- It’s not fair to push your triggers onto other people as they aren’t responsible for your triggers or trauma. You don’t get one huge trigger warning for life, that’s just the way it is. \n\nYour wife is right, if you can’t shape up and really can’t stand the many women who are going to be taller than you then maybe you shouldn’t go. It’s not that they’re excluding you but all the women who go will not likely be wearing heels and won’t wear otherwise, your daughter included. You can’t control what everyone else does so maybe removing yourself from that situation would be the best outcome.", "So your daughter should also feel bad for her height? Nope. YTA\n\nETA: also, you really said \"humanizing\" your daughter. Eughhh.", ">\tSince she stopped growing a couple of years ago, I have been silently preventing my daughter to wear heels or any kind of shoes that make her appear taller than me.\n\nYou mean you’ve been quietly manipulating your daughter to salve your own insecurities.\n\nBack to therapy YTA.", "Yeah YTA calm down you're not in.highschool and she's your daughter, youre not competing with her. Take your head out of your ass.", "YTA\r  \n\r  \nYou're using your past trauma to control your daughter. By now you're old enough that you need to get over yourself and stop, before you transfer some body issues onto her, if you haven't already.", "YTA. You're taking your insecurities out on your minor daughter because she can't control how tall nature made her. How weak so you have to be as a father for you to feel justified in keeping your daughter small (literally and figuratively) so you can feel better about yourself? \n\nThis has to be fake. This cannot be real.", "YTA. Putting your own BS on your daughter is gross. I hope you get over your insecurities.", "YTA. As a tall woman even in my teen years (5'9\"), I already had enough self awareness about how tall I was compared to men and other women. She's going to get enough flak from shorter men in her life as it is. She doesn't need it from you. You know your trauma and what you struggle with. Do you want her to feel the same way but about being taller than men?\n\nWork on your trauma and let her wear the heels. Teach her that it's okay to wear heels, feel confident, and be taller than men.", "Sorry but you really need more therapy to deal with your issues. Leave your daughter alone and be proud of her not demanding and judgemental. Sorry but YTA get help!", "YTA I didn’t even need to read to the end to know this. Your issue are yours. Stop projecting onto your daughter. And the fact that watching her grow from a baby helped you to humanize her, jesus with your bs. You clearly need more therapy.", "YTA. Why are you body shaming her. Sadly I learned pretty early on exactly how to judge how a job interview went based on whether I was shorter or taller than the men interviewing me. Always got the job if they were taller, never got the job if they were shorter.", "YTA news flash- your daughter won't be the only woman there who is taller than you! If your phobia is really that bad, how do you leave the house?", "Your not just an asshole, you are an emotionally abusive asshole.", "YTA. I understand how this is going to be tough for you, but a child shouldn't be punished or forced to behave differently from normal people her age due to her father's untreated insecurities. \n\nWork on this with your therapist, not your daughter.", "YTA - You went through a bunch of trauma revolving around your height, and I’m sorry for that. But what you may not realize is that by preventing your daughter from wearing heels, you are also treating her differently because of her height. If you don’t think it’s fair to be excluded or treated differently because of the height that you are, then you also shouldn’t treat her differently because of the height that she is and how tall she’ll look in heels.  It wasn’t fair for you to be treated the way that you were, and it’s not fair for you to treat her that way either. Simply put, don’t punish your daughter for being the height that she is. She can’t help it anymore than you ever could.", "YTA.  Heels are perfectly acceptable attire for a 16 year old *young woman*.  I understand your trauma is real to you, but you shouldn't hand over ownership of it to your daughter to didn't contribute to it.", "YTA - Return to counseling. These sessions are called 'tune ups' to navigate when past trauma is interfering in your decisions and emotions. \n\nYou, at 44 yrs old, are prohibiting your daughter to wear a reasonable accessory while she is in a wedding party. This is a problem. The goal is the know the root of your trauma and gain skills so it does not interfere with family and work relations, self care, employment, etc. Best to you.", "Jesus effing OP grow up.\n\n\nYTA", "YTA, what are you gonna do once you see lots of women taller than you at the wedding?", "Sorry to say it, but YTA.I am 5'10 (F) and my husband of 16 years is 5'6. My ex-husband was 5'7.My ex-husband asked me to stand in a hole for our wedding photos. It was a metaphor for our entire marriage, which lasted less than a year.You may not realize this, but women can also have a complex about their height making them undesirable. You are going to end up giving your daughter the same kind of insecurity that you have. I used to wear flats because I was embarrassed to be so tall, and I'd hunch over, and bend my legs in group photos. I always felt like a sasquatch.I'm past all that now. I stand up straight and am proud of who I am. I want that for you and your daughter.I'm over 6' tall in heels and my husband loves it. I'm taller than him even without heels and if anyone comments on it, we both can have a laugh about how hung up people are about me being tall and him being short, as if that has been an impediment to what has been a wonderful marriage.  \nEDIT: and it occurs to me that you are training her to not want to date shorter men by showing her there is something wrong with the woman being taller. You are helping to create the situation that has caused your own body issues.", "She shouldn't have to conform to your childish insecurities. YTA, for sure.", "I suggest additional counseling if you are this concerned about your daughter wearing heals.  She is expected to wear the same shoes as the other bridesmaids.  Allow her to enjoy this experience and others that will come to her where she will want to wear heels.  One of the worst things you can do as a parent is make your child responsible for your issues.  Don't ever make her feel like she has to make her personal fashion or appearance choices  based on a man's insecurities.  You are setting her up to not be able to stand up to future partners who don't like her hairstyle or clothes.  Don't bring this up again, let her wear the heals, and tell her how beautiful she is.  Otherwise, yes YTA.", "YTA, I didn't even read your post - can't imagine the justification here.", "YTA, you are putting the burden of your trauma on your daughter. I’m sorry for what you went through but she had nothing to do with it and deserves better from you.", "YTA. \n\nYou better find a way to get over it, because in 2 years, you lose all control over what she wears, assuming you are buying all of her clothes right now.  You may  have less time now that she is old enough to get a job and start buying her own.\n\nYou have two choices for the wedding - suck it up, or skip it.  You have no right to dictate what the bride has chosen for her attendants to wear.  Sorry if you have to miss the wedding - but I'm sure you can find something to do.", "What's unfair is you projecting your insecurities on your daughter and manipulating things just so you're okay. YOU need therapy to get over it and stop affecting your daughter.\n\nYta", "YTA. I’m sorry you brothers and father made fun of you for your height, but that has absolutely nothing to do with your daughter and making her feel bad (because that’s what you’re doing) for wearing heels and being almost as tall as you is doing the same thing as your brother did to you. You are literally putting her down for her height and restricting what she can wear because of your insecurities.", "YTA. I understand trauma but expecting the world to cater to your needs is delusional. Plus, I’m willing to bet that your daughter won’t be the only woman taller than you at this event, so if this is about you controlling your reaction to that, you’ll likely be in trouble anyways. In the kindest way possible, it’s time for more therapy because that’s no way to live for you AND (maybe especially, since you’re putting your own feelings above theirs) your family.", "YTA. This is YOUR trauma NOT HERS. She’s not going to be 16 forever. Will you be traumatized and humiliated if she elects to wear them at her own wedding one day? The quicker you get over this the better because she’s not getting any shorter and banning her from heels is ridiculous. Also 16 is not too young to stand in a wedding. Please rethink this and don’t project your trauma onto the nieces wedding. No one likes a napoleon complex..\n\n\nEdited to say: Remember how being short made you feel different? What about if her being the only one not in heels makes her feel that way? Does that even matter how she feels?", "YTA\n\nWith trauma this deep-seated, you need more counseling, not to go overboard worrying about your daughter's shoes.", "YTA. None of us have a choice in how tall we are. Your aversion to tall women is a YOU problem, so YOU deal with it…instead of being emotionally manipulative and controlling if your daughter. Also, she sounds too amazing to be related to you. You sound pathetic and insecure.", "Wow. Thank god she didn't grow 1 inch taller cause it sounds like you would've disowned her. YTA. I'm sorry you were bullied but this is something YOU need to work on for yourself and shouldn't impede how your daughter wants to live her life.", "Hard YTA. You desperately need to go to therapy, and if you have already been to therapy then you need more therapy. This reaction to a woman being taller than you is way too extreme and unreasonable. The issue that you have with your own height is nobodies problem but your own and nobody else should be avoiding heels or platform shoes or anything of the sort that would make them taller than you as it is not their job to handle your insecurities. Get some help.", "“I never expected her to be so tall but I have been able to remain mostly calm about it. …watching her grow helped my brain to humanize her.”\n\nRead all of that again and tell us you’ve “mostly left it behind”. I’m not trying to downplay your trauma, but you haven’t gotten over any of it if you are preventing your daughter from doing normal things like wearing heels. Get into therapy and stop taking your issues out on your kid.\n\nYTA", "YTA. Regardless of your past which you need some help to reconcile, this isn’t your wedding. If she is expected to wear heels then that’s that. Bride has spoken.\n\nYou can’t change your height so you can accept it and make it a positive thing, or continue to let it be a massive hinderance in your life.\n\nGood luck! Hope it helps!", "YTA \n\n\"But I am not still fully in control of my emotions related to this issue\"\n\nThen by all means, let them control you! \n\nSarcasm aside, good luck, remember that the height of other people has nothing to do with you or your worth as a person, and maybe apologize to your daughter for trying to make her fit into the mold of a non-threatening woman ie one who isn't visibly taller than you.", "You’re likely to traumatize your child with your trauma do you really want to do that?", "Yes, YTA.\n\nYou clearly need more therapy about this. Because honestly if you're going to have a chip on your shoulder and get triggered about women taller than you (I am, at 5'7\", and my 12 year old daughter is catching up fast) then I'm not sure how you function in society.", "YTA. No explanation needed.", "YTA, you can't expect everyone to cater to your insecurities. You are putting your daughter in a tough situation if the bride wants her to wear one thing and you want her to wear something else, she will be disappointing somebody no matter what. But it's not your wedding so it's not your place to control what people wear.", "YTA and you need to go back to therapy.", "YTA\n\nYour problems with your height have nothing to do with your daughter and she is not responsible for making you feel better.\n\nTrying to control a woman and what she wears to make yourself feel better is creepy and weird. Personally, I think it's even worse that you are doing this to your daughter rather than a romantic partner.", "YTA you can’t punish other people for your unresolved trauma. You need to work on resolving it already", "YTA.   Get over it.  See a counselor if you need to", "YTA your trauma is not your daughters burden to bear.", "YTA. If it’s not your daughter it’ll be a hundred other women in heels and taller than you. Don’t put your shit on your daughter, it’s not healthy for either of you. Seek better therapy.", "YTA I feel like if women being taller than you seriously bothers you this bad you need to continue therapy. Don’t traumatize your child with your baggage.", "YTA \nThis may be hard to hear but your insecurities are about you and only you. It is not fair in anyway for you to project your trauma onto your daughter and go so far as to control her appearance. By doing this, you are just continuing a cycle of appearance-based abuse. \n\nYou absolutely have to figure out a way (read: have a long talk with your therapist) to become okay with attending this event with your daughter wearing heals, otherwise you are just building undeserved resentment. \n\nIt's also worth mentioning that if your concern is about women nor liking you because of your height, your child should not factor into this because she is not a woman of interest and you already have a wife. \n\nIt is natural for your wife and daughter to be irritated when you keep bringing this up because you truly are being unreasonable. I think if you took a step back from the situation, you would see that. \n\nPlease, please, please continue the therapy more intensely because your daughter will be wearing heals on the special day and in the future and it will only tear your relationship apart if you let something as silly as shoes start to manipulate your vision of her.", "YTA. Grow the hell up. You’re 44. This would be like me telling my six year old that she can’t play sports because the jocks in high school were mean to me. Stop punishing your kids for events that happened decades ago. Get therapy and be a better Dad.", "Bonkers, completely bonkers YTA", "YTA but most of all you need therapy.", "Yes, YTA. I'm not going to go nuclear because I understand that childhood trauma can last a lifetime, but now you are causing a rift with your daughter because of your issues. Do you want to pass on your insecurities like some sort of inheritance?", "You seriously need to work harder on this issue. You’re 44 years old and now inflicting a complex on your child. You can’t change your height anymore than your daughter can, Stop preventing your daughter from looking taller than you to make yourself feel better it’s incredibly selfish. And it’s funny how you are only concerned with tall women. What about men taller than you what are you stipulations then? YTA", "YTA. You are going to give your daughter a complex about her height as well. If you aren't currently in therapy, please go back and seek some help working through this. As parents we're supposed to do better by our children, but you're allowing your issue to negatively impact how she sees herself. This is a critical time in her youth where you should be helping her to see how beautiful she is inside and out, not making her feel bad about herself.", "Yta\n\nWay to pass your trauma into your kid by making her feel like something is wrong with her for her height. No one is excluding you at all. You’re causing all of this drama yourself. \n\nDo yourself a favor, go get some therapy. It doesn’t sound like you’ve done the work to try and get past your issues.  And they are just that. Your issues. No one else needs to change for you.", "Dude... dude...\n\nI'm a guy.  I'm also 5'0\" tall.  I was bullied unmercifully for it as well.  \n\nLongterm:  You need to get back into therapy or otherwise fix yourself.   Dehumanizing women who are taller than you is wrong on more levels than I can count.  \n\nWhat would you do if your daughter became romantically involved with a 5'11\" woman? \n\nShort-term: Why don't you get heel-lifts for your shoes to make you an inch taller? \n\nObligatory judgment:  YTA.", "YTA. Get therapy and stop taking your trauma out in an innocent child - your OWN innocent child.", "YTA you have not resolved your trauma have you!", "YTA. What are you going to do when your daughter wants to go to Prom, or hell wear heels at her own wedding? Will you demand that she wears flats so that your ego isn't damaged? And not to point out the obvious, but 16 year old girls can still grow, I am 5'8 and did not get this tall until a growth spurt right after I turned 17. What are you going to do if she grows another inch or two? Refuse to ever be seen in the same room as her? Look, I get that childhood bullying can leave permanent scars, but it's your job as  parent to work on your trauma and make sure it doesn't negatively impact your children. You are likely making your daughter self conscious about her height now, which is the same thing your brother did to you. Work on it in therapy, talk with your therapist about how best you can get through the day. And if it's not possible at this time, stay home so your daughter can enjoy herself and feel beautiful.", "YTA. And you need more therapy.", "YTA. She shouldn't have to dress for your insecurities.", "YTA. Are you trying to cause trauma for your daughter like was done to you? Get some therapy before you can’t see your daughter as a human anymore.", "YTA.  Choosing to make your daughter do this rather than dealing with your own issues through therapy is something else.", "YTA. Instead of attending the wedding, you should book an appointment with your therapist. \n\nYou do realize that you are inflicting trauma on your daughter by obsessing over her height, right? Also, how do you leave your home and go out in public where there are many women who are taller than you?", "YTA - controlling another human being instead of treating your issue makes you an asshole.\n\nYou can ask someone to make an accomodation while you have brething space to get help, but this is not the case here.\n\nYou've had decades to deal with this. I understand that you might never be fully over it, but you need to be functional enough to spend time with your daughter if she wears shoes.", "YTA- if a pair of shoes is causing you this much distress, maybe you shouldn't go to the wedding.", "YTA firstly 16 is not too young to be a bridesmaid, secondly please don't blame trauma for your misogyny (you needed help to humanise your own daughter FFS).  \n\nThis is your problem to solve.", "YTA! I don’t even need to finish the post. You seriously need to consider more therapy because clearly you have not dealt with whatever trauma you experienced from that bullying. It’s not everyone around you’s responsibility to ensure you aren’t triggered, that’s on you. It’s not fair to your daughter to force her to make compromises for your comfort. \n\nOP, I mean this kindly- don’t go to the wedding if you’re that insecure. Spoiler alert: there will 100% be at least one female guest who is taller than you, with or without heels. Are you going to ask all of them to take their shoes off too? To kneel so you don’t feel inferior? You will be triggered at this wedding. Work on yourself instead of putting that responsibility on everyone else.\n\nEdit: added ‘more’ to consideration of therapy", "YTA. You never learned to deal with your trauma in a healthy way, so now you are punishing your daughter. I'm sorry but reading this post has made me shake in anger. Go to fckin therapy and deal with it, your 44 years old and still cant stand to be yourself, so instead of working on that, you punish your daughter for the genes you gave her.", "Usually,  these self loathing due to height posts are from a teenager's point of view and about demanding their sister doesn't wear high heels around them.\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/upl9g9/aita_for_pretending_not_to_know_my_sister_in/\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/u0aw8h/-/i44ogpc\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/wi76bm/comment/ij9vzym/", "YTA. For a lot of reasons. The fact that you talk about needing to humanise your own daughter to get past her height is… alarming to say the least. \n\nPutting it simply, you probably shouldn’t be going to any weddings, *period*, if simply seeing a woman wearing heels or who is taller than you can bring you into panic attack territory. You know who is at weddings? *Women in heels*. I’m not entirely sure how you navigate work, other social events, or being out in public at all without interacting to women taller than 5’6”, but put those same methods into play here instead of controlling what your daughter wears on her feet.", "I am sorry as it is an issue for you, yet you cannot prevent her from wearing heals forever, this is the best place for it to happen first, where you are surrounded by family.  Plus, if she is in the wedding, she will be busy and a limited amount of time where you will be standing right next to her.  Enjoy the day, bask in how pretty she looks, how much fun she is having and how you've raised a good kid.  Don't put your stuff on her.  Let her wear the heals.  YTA if you guilt her into not wearing them.", "YTA your trauma is not her problem. How dare you do the same thing to her that was done to you!!! Guess who’s making who feel insecure about their height now! Generational trauma is a thing and i wish parents like you didn’t bring their insecurities on to their kids.", "YTA.  Go back to therapy dude, you can't restrict what your daughter wears because of your trauma and insecurities.  When you try to that makes you a controlling AH.", "YTA\n\nThe comment about being able to humanize her only because you saw her grow yourself is concerning. It's very unfortunate that you were bullied for your height. Why would you do the same to your daughter?\n\nBesides, the day isn't about you anyway and as others have said, there will be other women there that are taller than you. You have to grow up.", "YTA You're allowing your maladaptive coping mechanisms to cause your daughter upset. \n\nShe's not responsible for your height, the bullying, or the social expectations of weddings.\n\nGo, dont go, but stop policing her appearance and her family contact. \n\nYou ban your wife from heels too, dont you?\n\nWhere does it end? Will you freeze out her romantic relationships if they are taller than you? What about any future grandkids? Will they only be seen in public with you if they are shorter? What if they pick up your expectation? Will you just keep going with the 'shorter than me' rule until your bloodline is 2ft tall?", "YTA. You can't prevent your daughter from living her life because of your personal insecurities. Go to therapy because it sounds like you need it.", "YTA why don't YOU just wear heels? Matter fact, there's these things called stilts... \n\nBut seriously don't do do this to your daughter. Most women will be wearing heels. You can't single her out and she's a bridesmaid and that is the attire. Get over it. Get better therapy. I've met many short men whose personality outshines their size. You sound like you make your size your whole personality.", "YTA. Please let your almost-adult daughter wear freaking heels and please try to get help for your issue. I'm not trying to be mean here, but it sounds like you have a real problem and it's not fair that she should suffer because of it.\n\nEdited to add, my husband is about your height. He has told me about how he was made fun of because of how short he was, many times. I get it. However, he would never even think about telling our daughter not to wear heels around him.", "YTA.\n\nHow do you deal with being out in the world with all of these tall women? I am 5'7\" tall without shoes, I am sure I would send you running and hiding under your bed.\n\nPlease let your daughter participate in the wedding wearing what the bride wants her to wear. It's her day, not yours.", "If you really feel that insecure, start having her wear heels now around you. Get the shock and biggest reaction out of your system.  You can’t stop her from wearing them; prom, hs graduation, her wedding, life….. don’t make her feel awkward.", "YTA. \"I have been able to remain mostly calm about it\" Wow. Yikes. Get back into therapy. Go 5 days a week if you have to b/c this is not acceptable nor it is healthy.\n\nYou are not being left out b/c of your height, you are being left out b/c you are angry at your daughter b/c of her genetics. Genitics that you likely contributed to, since you have tall people in your family. How is this better than you dad and brothers bullying you for your genetics? Genetics your dad contributed to? You think your daughter can't feel that \"you have been able to remain mostly calm\"? She may not know why you have underlying hostility tword her, but she can feel it, I promise you.\n\nIf you can't handle your daughter in heels then you need to skip the event instead of ruining it for everyone else.", "Yta", "YTA.  OP is only going to pass along their height issues by trying to talk daughter out of wearing because of how it will look.  Daughter and wife are absolutely correct here.  I don't want to invalidate OP's legitimate feelings, but if this wedding is a place they can't go without having serious anxiety issues they should send their apologies and skip the event.  No details need be provided, but messy stuff like stomach issues or food poisoning tend discourage questions.", "YTA OP, please continue to work on your own issues. \n\nAs you age, your spine will compress and your daughter will, in fact, become taller than you with or without heels. I advise you to tackle this issue head on again with therapy, instead of trying to avoid it by trying to stop your daughter from wearing heels. \n\nPlease get help, OP.", "OMFG. You could not be a bigger asshole. I never comment on these but this is the most ridiculous thing I’ve ever read on here. YTA. Please get more therapy.", "YTA. You are not going to grow, but your daughter might still. Are you going to ask her to slouch if she does? You are asking your daughter to be less than because you are self conscious. It sounds like you would benefit from more therapy so you can get comfortable in your own body and learn to accept yourself.", "You apparently have really deep seated trauma. You can't take that out on your daughter, and she doesn't even have much say if the bride set the dress code for the bridesmaids. Also, at 5'6\" there's DEFINITELY going to be at least one woman taller than you at the wedding. It sounds like you need more therapy, but in the meantime, try to find some room in your short heart for you completely normally-sized daughter. Being tall isn't an attack on you. \n\nYTA", "YTA. Your insecurities are yours; stop projecting them onto your daughter.", "YTA massively. You’re taking your own issues out on your daughter and preventing her from doing things because your ego gets sore.\n\nGet therapy and apologise to your daughter", "Im curious as to why you, someone who suffered under bullies, is okay with being a bully.\n\nNo, it’s not to the extent you experienced, but it is still bullying, and that is never okay.\n\nAlso, you’re not short. Shorter than average, yes, but not short. And your daughter is not tall. You’re perspective is badly skewed.\n\nYou have a choice here.\nBully your daughter.\nFace your fears head on.\nStay home so as not to face the stress.", "Obviously you need a lot more therapy is your daughter wearing heels is doing this to you. You need to be more in control of your feelings because if you are letting them control other people, you’re wrong. \nYTA.", "YTA. Your insecurities are not your daughter's problem. You need serious therapy.", "YTA. Go back to therapy. You need it.", "YTA, get some therapy for your daughters sake", "Gentle YTA. Clearly you're traumatized, but you need to find a better way to handle it than taking it out on your daughter. What are your unresolved issues doing to *her* self-esteem right now? Does it even occur to you that you should care about the effect you're having on her, or is it perfectly fine in your mind for you to traumatize her because someone else did it to you?", "YTA and you need therapy. Yo realize this is not going to get any easier. Your daughter will probably wear heels for going out with friends or dates, celebrations, graduation, etc. Are you going to refuse to walk her down the aisle if she wears heels?\n\nStart working on yourself - by the way, I grew another inch when I was 17", "YTA You're a controlling abusive parent who needs to modify their behavior right now. I'm not surprised they are tired of your bullshit. I'm tired of it and I've only been exposed to it for the time it took me to read this.", "YTA, It’s NOT your daughter’s problem and fault that you didn’t grow tall! Our GENETICS only decide! You do get angry at someone for having no control of their bodies. You need to learn to move on from your trauma! Just because your bullies bullied you does not mean you can bully your daughter; She wasn’t there when you were being bullied, two wrongs don’t make things right and you’re making yourself look just as bad as your bullies. That is the most pathetic way to express jealousy and anger especially to those who weren’t even involved in your situation", "YTA. And you need to go to therapy. You are going to end up giving her a complex about being tall.", "YTA\n\nNobody cares about your height except you.", "YTA if you're unhappy don't let anybody else pay the price. After all, witches have never been popular.", "I’m sorry that your childhood and family were so abusive to you about your height. That couldn’t have been easy, and it’s good that you’ve taken some steps to work through it. Having said that, YTA here. \n\nYou’re emotions are not you’re daughters responsibility. As someone wise once said “just because something happened to you years ago, doesn’t mean something has to happen to [your daughter] today.” It’s on you to figure out how to deal and cope with your trauma, that means not putting it on her to never be taller than you. Her life goal isn’t to never upset dad, and while you’re not specifically asking her to never upset you, that’s what you are doing by manipulating her into never wearing a shoe with a heel. \n\n“I think knowing her since she was a baby and watching her grow myself, helped my brain to humanize her and not seeing her now as I see other tall girls.” - This thou? This is removed any doubt that YTA. You can feel uncomfortable/triggered around other people, but dehumanizing them is 100% NOT Ok. It isn’t any woman’s fault that you’re shorter, and tall women already get treated shitty by men. Stop taking your problems out on them, even mentally. \n\nI hope you have the resources to be able to seek more help in working through your trauma. Your family was wrong for what they did, and you are valid in cutting them off. Don’t make your daughter do the same. If it’s going to be that upsetting to see her in heels, now out of attendance for your own sake and the sake of everyone else. Your daughter was asked to be in the wedding, your emotional reaction was not.", "YTA-  get some therapy and be proud of your daughter height, weight, eye color, hair color and anything else.  You are doing the same thing to her that people did to you.  Stop it and do better.", "YTA. Please find a therapist, no sarcasm or cruelty. You really need to find a way passed this.", "YTA, this is how generational trauma is created.  You refuse to deal with your issues in a healthy way, so because you were bullied you in turn bully your daughter.  It a lot of ways, you are just as bad as your own father.\n\nDon't go the wedding.  Do get therapy.", "Coming from someone whose parents made me deal with their trauma, YTA. It's no one else's responsibility to manage your trauma, least of all your daughter. Children become traumatized from their parents taking their trauma out on them. This is incredibly unreasonable and the sooner you see that, the sooner you can get some real help. Stop demonizing tall women and blaming the people around you. Focus on healing yourself rather than trying to bend the world to make you comfortable.", "Full YTA.\n\nYou’re a 44yo man who is aware of his shortfalls (pun not intended) and instead of seeking help to resolve something that’s obviously affecting the way you live your life, you’re making it everyone else’s problem.\n\nEveryone’s got trauma, stop using yours as an excuse. Feeling sorry for you doesn’t absolve your responsibility in taking care of it. Take some accountability and stop making other people live their life around your insecurity.", "So let me get this straight... because jerks bullied you for \"being short\" you're bullying your daughter for \"being tall\" as revenge? Wut? YTA.", "Yta. Please grow a set. They are heels Napoleon", "YTA\n\nYou're 44, it's about time you grow up, and be the bigger person.", "You sound absolutely pathetic. You have to grow up and be a real dad, not a bundle of neuroses that could rub off on your daughter", "YTA. You clearly need more therapy. Don’t take your insecurities out on your daughter. If you keep this up, you’re going to fuck her up just like your family did you.", "YTA. You chose to have a child, which means you owe it to her not to put your trauma on her. Get more therapy, don’t go to the wedding, or grin and bear it, but don’t keep your daughter from wearing heels any longer if that’s what she wants. She’s sixteen and more than old enough to choose her footwear. And honestly, you telling her she can’t be taller is not very different from your family telling you you’re too short. You might be nicer about it and feel like it stems from a different place, but it does sound like you’re risking instilling her own trauma over being tall. I’m assuming you love your daughter and don’t want that, so please rethink how you’ve handled this issue.", "YTA. Let her wear heels.  You’ll look like a confident and proud father being shorter than your daughter", "YTA. You are an insecure man that want control waht his daughter wear to fell better about himself.\nShe its gonna be taller than you, AND WHAT. \nLet her use heels and control yourself.", "YTA. 1) It's up to you to manage your emotions, if you can't, you should stay home. 2) No one is excluding you because of your height, you're excluding yourself because you're an AH. 3) How do you function everyday around women taller than you? Do that with your daughter instead of treating her differently because of her height. 4) I bet she doesn't like it any more than you do.", "Right so you are effectively body shaming your daughter because people body shamed you? YTA and need more therapy as you are clearly far from being over this issue", "YTA. Do not transfer your trauma onto your daughter by making this an issue. Do not continue the misery by making your problem, her problem. That is pure bad parenting. You need to dig deep and do better. If you need to excuse yourself from a situation, do so. If you need to go to therapy, do rehearsals, anything that might help, go right ahead. But do not make your burden her burden as well.", "YTA. Stop projecting your trauma and insecurities on your daughter. You are worried about your feelings of exclusion but what about hers? She wants to feel included in the bridal party and match with the other bridesmaids. And what happens if she keeps growing and becomes taller than you? You need to go to therapy and start working through these issues or you will damage your relationship with your child.", "Oh man you needed to do so much more counseling before it got to this point", "Don’t project your trauma on your daughter, who has nothing to do with your height. YTA\n\nFurther, how do manage with other women who are taller than you? I mean, come on. People suck, but this is going too far. You can’t demand others bend their physical attributes or otherwise to accommodate you.", "Yes YTA she's 16 not 6, she should be able to wear heels if she wants. Your issues are yours and not her fault. You would probably benefit from therapy though.", "Seems to me like you're doing the same things your father and brother did to you but reverse because she's taller than you this is a you problem not a her problem deal with it or don't go to the wedding why are you ruining her fun time to be part of something great just cuz you have an issue", "YTA. You have my sympathy for your trauma, but what you're actively doing is trying to train your daughter to feel ashamed of her own body and throw out her needs and wants to accommodate YOUR feelings. She should never, EVER feel bad about wanting to dress up in a perfectly normal and acceptable way for a special occasion. In this case either you get help dealing with your own issues regarding your body, or eventually you both do with added strain on your relationship.", "Hmm this part is worrying \"watching her grow myself helped my brain to humanize her and not seeing her now as I see other tall girls.\" How DO you see other tall girls? Also YTA you are her parent and it's your responsibility to deal with your insecurities and trauma.", "So you're causing your daughter to worry about her height now. Do you want her to also have emotional issues about her height?\n\nGet some intensive therapy right now and let her wear the same shoes as the other bridesmaids. YTA", "YTA\n\nAs a tall girl, I never wore heels because I was embarrassed about being \"too tall\". Especially if someone made comments like you have.\n\n\nI get you have trauma about your height, but that's your issues you need go deal with, not your daughter. Don't make her feel insecure about her height because you feel thar way about yours.", "Do you always cry when you see people taller than you?", "YTA.   I’m sorry but you are \n\nOne of the challenges we face as parents is to not visit our traumas onto our children.   \n\nPreventing her from wearing high heels is putting your trauma on your child.    She is s innocent in this\n\nYou’ve travelled away from some of your trauma.   You need to get help to finish your journey. I sincerely hope you do.   \n\nI wish you all the best.", "Yta at the end of the day who cares you will just have to put your grown up pants on enjoy the day or your going to alienate your daughter", "YTA grow up", "YTA. While it will feel like everyone will be noticing that you look shorter - it’s not your wedding. No one will be looking at you because the focus is on the bride and groom. It’s not even the family that bullied you that will be attending. \n\nDon’t put your issues on your daughter. Society puts more than enough body image issues on women so she doesn’t need you to add more on. It’s time for therapy, dude.", "You need to go back to therapy for starters", "YTA stop projecting your insecurities on your daughter", "YTA. U need more therapy.", "YTA - kids are generally taller than their parents. Sorry, Dad, we don't stay little girls forever.", "YTA your poor daughter.  You need serious therapy.", "YTA and I'm shocked by the way you said seeing your daughter humanized her in your eyes unlike other tall women.... HUMANIZED?! You think other tall women are some monsters just because their bodies are bigger than yours?! What a bizarre way of thinking.\nAnd I totally agree at the other comments about generational trauma. If its not fair for you to skip a wedding, how is it fair for your daughter to carry the burden of your insecurities?", "YTA", "YTA. Don’t pass your trauma on to your daughter.", "YTA.  Stop taking out your trauma by trying to control your daughter.  You're gonna give her the same kind of complex you have about her own height.", "Yta. This is really ridiculous. So what if you child is taller than you. This is not the end of the world. Let het enjoy it and let her feel pretty. If you don’t like just dont go. NOBODY CARES ABOUT YOUR DAMN HEIGHT.", "YTA. Bruhh your 44 it's time to get over this shit.", "YTA You are essentially shaming your own daughter for her height without even realizing it. You are becoming your own bullies.\n\n As a woman that's 5'10, I've been shamed for being the tall girl and people would avoid dating me because I was considered too tall. But that is a them problem not a me problem. My current boyfriend is 5'7 and the sexiest thing is how comfortable and secure he is within himself, he embraces me fully height and all. Doesn't care if I wear heels making me over 6 ft. \n\nYou need to look at things from another perspective and stop shaming your daughter.", "YTA - PLEASE go back to therapy. Your daughter deserves so much better and my heart really goes out to her.", "Walk a mile in her shoes, and then make the right decision.\n\nYTA", "YTA\n Bullying your daughter lmaooo", "YTA, might I suggest therapy to deal with your issues so you don't take them out on your daughter.", "YTA-Your daughter doesn’t deserve to be controlled because of your insecurity and immaturity.", "YTA. These are your issues, not hers.\n\nI guess I can't even imagine the mindset though. My dad is not even 5'8 and my mom is 6'0. they had a 6'2 son and a 5'10 daughter (me!). My dad has joked on occasion that people must think \"the kids are from a taller man\" but other than that he's never given a shit. I think he's happy his kids got the tall gene tbh, his whole family is short!", "Sir. If I, 5'4 female have to go places with my 6'2 son, my 5'6 daughter and my two 5'6 girls (not my kids but may as well be) you can let your ego go and just be proud of the tall, beautiful, kind young person you created and raised. \n\nYTA.", "“Couldn’t wear my high heel shoes, cause I couldn’t be taller than you”. \n\nI guess it is not just romantic partners who have problems with women being taller than them.\n\nYTA\n\nAnd you need therapy ASAP. \n\nThat being said, if someone else picks on your daughter looking taller than you, THEY would be the assholes. And bigger assholes than you. \nBut nobody has done it so far. Hence YTA.", "YTA, you are taking you insecurity out on your own daughter. She wasn't there when you were bullied by your own family. You need to stop fantasizing that. You already know your daughter isn't gonna fun of you. So why are you gulit tripping her? Because of your past. She isn't in your past is in the present and future. You need stop thinking that way. \n\nI was bullied alot when I grew up and when I see my bullies now have children of their own. It doesn't make me hate their children. They were not there when I and their parents don't get along. Because they are innocence from what their parents did to me. So they didn't play any part in it.", "YTA  The world doesn't care how tall you are in comparison with any woman.  Especially your daughter.  What you are saying is you want to give your daughter trauma over her height, because why not, it's made you such a happy joyful person/ s No one is excluding you from the wedding! Which, btw, isn't about you or your issues.  Get more therapy!", ">That makes her almost exactly the same height as me. I never expected her to be so tall but I have been able to remain mostly calm about it. \n\nYou didn't think your children, who share half your genes, might end up as tall as you?\n\nYTA for this alone.\n\nIf you couldn't cope with your kids being as tall as you, then you shouldn't have had kids.", "You've been preventing her from wearing something because you have trauma? you clearly have a long way to go in your recovery. YTA.", "YTA, your daughter is not your romantic partner. Stop being weird or dont go. If anything ask her to ware them around the house so you can desensitize yourself and go through the motions on your own in private. But you cant make this everyone else's problem, this is not the time. And go apologize to your daughter for trying to install a new insecurity, especially when shes only average height.", "YTA get over your trauma, don’t push it off on your daughter", "YTA\n\nI’m a 6’ tall female and would often wear heels when I was younger. I once went on a date with a shorter bloke. Walking to and from the restaurant, he walked on the higher path whilst I worked on the slightly lower road.  There was no 2nd date.\n\nYou are controlling your daughter and making her conscious of her height. (Which is average hight btw).\n\nGrow up.", "YTA - Bro... you're two inches shorter than Connor McGregor... one inch shorter than fucking Maverick... it's time to acknowledge that your height isn't actually the root cause of all your issues.", "YTA,work on your trauma and stop projecting it on your daughter", "YTA you can’t push your trauma and insecurities onto your daughter and other women, like there shoes dude, also what if she likes wearing heels and when she’s older she wears them, then what wig out at her? Get therapy dude and get over yourself. Also your wife and daughter are rightfully angry.", "And they're back", "YTA-You're bullying your kid for looking taller than you.", "YTA\n\nI'm sorry you had a bad childhood and your family was horrible to you.\n\nIt sounds like you understand your issues aren't rational but you still need to work on them. I would recommend going to therapy.\n\nIf you're a confident short guy now-a-days, who lets go of his height insecurity and lets his daughter wear heels, you'll be called a Short King 👑", "YTA You say you don’t like feeling excluded because of your height, but that is essentially what you are doing to your daughter. You are telling her that she is too tall to wear heels and be a bridesmaid. This is an honor for her. No one will be looking at you! \n\nPlease get over your insecurity. When you are with her, tell yourself you’re standing next to a supermodel. Kids are often taller than their parents (my brother and I are taller than ours). No. One. Cares. \n\nBesides, your 5’4” wife is your date.", "YTA seek therapy as this is a you problem. \n\nMy daughter will be taller than me and that's fantastic. I literally only want the best for her. She's my everything. I can't imagine how someone could hate on their own child because they are absolutely perfectly normal.", "YTA. Your trauma and insecurities are not the responsibility of anyone else, especially your daughter. You forcing that onto her is inappropriate and incredibly unhealthy. You are going to give her insecurities around her own height because you refuse to take control of your issues. \n\nYou clearly need more help, and for the sake of all involved, it would probably be best for you to be excluded from the wedding, as you are creating drama by making it all about you.", "YTA. Go to therapy.", "YTA Get TF over yourself dude. You are projecting your \"trauma\" onto your child. You are also making assumptions about women who appear taller than you. I bet you have the short man syndrome like Johnny Carson had.", "Do you think as her father you should grapple with your own issues so you don’t inflict the same trauma upon your child that was inflicted upon you by your father? You’re shaming her about her height — the exact same thing that was done to you. YTA.", "Dont sell your self short and try to be the bigger person.  There is no reason to blow up over such a small issue", "YTA, get over yourself, small man energy is gross", "YTA. Please find a therapist who can really help you with your trauma. If you don't then you're just dumping trauma on your kids. Be better.", "YTA\n\ngo to therapy. It’s your responsibility to work through and process your trauma, not project it onto others.", "YTA. Your therapy apparently isnt done. I know lots of men way shorter than you and they do JUST fine. This is all in your head and its not fair to project your own insecurities onto your daughter. You are letting those bullies win to this day.", "YTA short man syndrome for real. Egotistical and narcissistic behavior. (Fyi there are so many short kings who don’t behave like this. OP look up to them) But absolutely AH for policing his daughter like this. What on her wedding day she can’t wear heels either?? What is wrong with people?!", "I’m not even going to read this post because based upon the title I have absolutely no doubt YTA.", "YTA\n\nHow hasn't anybody in your life already made you realize that?\n\nGrow up, Napoleon.\n\nAlso, try lifts. They're what little people use to appear taller.", "Wedding troll", "Soft YTA because of the childhood bullying and related trauma.\n\nHave you thought about elevator shoes for men if it bothers you this much? Lots of actors and rock stars wear them.\n\nAlso please realize that you could be inadvertently causing your daughter trauma about her height. \n\nTalking to a counselor also may help you resolve this if it still is causing such pain and insecurity.", "YTA, and pathetic to boot. Also, the average height for men in the North America is something like 5’7, so you aren’t even that short! Jesus christ grow up you whiny baby. You need more therapy and to leave your daughter alone— also just skip the wedding. They are not excluding you because of your height, YOU ARE, you illogical asshole. God, people like you are just so annoying.", "> I have been silently preventing my daughter to wear heels or ant kind of shoes that make her appear taller than me\n\nare you always going to try control this? what about when shes an adult? what about walking her down the aisle one day? would you prevent her wearing heels on her own day? would you turn her down because of your own insecurities?\n\n> this would be practically as if they excluded me because of my height\n\nit really isnt. you said you wouldnt be comfortable, your wife offered a solution that would make you comfortable. take it or leave it.\n\n> now they have even start to act tired and angry any time i bring up the subject.\n\nbecause they probably are! your daughter has given her answer, accept it. shes 16 and wants to wear heels for the first time out, if you think its gonna be such a huge issue for you then think of an alternative.\n\nplease consider therapy. making your family change because of your own insecurities isnt the way to go about it. stop avoiding it and face it head on.", "You need to talk to someone short king because you clearly arent over anything\n\nThis is some sick shit", "Holy good god woman. You should see a therapist about your trauma, not… whatever the fuck you’re doing right now to make yourself feel better. You’re literally putting the responsibility of your trauma on your daughter and that’s super not cool and will definitely not affect her in a positive way. \nYou need a professional to help you navigate your deep emotional wounding… not a 16 year old. \n\nYTA. Get some help.", "YTA. \n\nIf you really can’t get over it, there are height increase insoles that you can use to match your daughter’s heels.", "YTA. \nYour insecurities don’t get to hold someone back from wearing whatever shoes they want. Your wife was right, if it’s such a big deal you’ll have a panic attack don’t go. Then you’ll be guilting your daughter (that’s bad btw if you didn’t know). \n\nAlso it seems the bride wants her to wear heels since she’s a bridesmaid, don’t mess with what a bride wants. Your daughter is a teen, she’s at an age she’ll get to go to many events she can wear heels to. You’ll have to overcome your phobia somehow or just never go around her for formal events. Maybe seek therapy since you were traumatized. \n\nAre you also afraid of tall men or is it just women who you get to control their appearance?\nAs a 5’10” 22F, I love wearing platforms that make me 6’2”+ and can’t imagine someone asking me to try and appear shorter bc they’re insecure or see me as scary", "YTA, get over yourself", "Yes, YTA. Don’t make your issues become her burden. Sometimes as parents we have to do things that are hard. For you, this is one of those times. You’re setting yourself up to fail here, hyper focused on you. Reframe it, being the focus back to her. There’s no magic bullet that will make your issues go away. You just have to address them, constantly, until they slowly get easier and easier to address. \n\nAt the end of the day, If it upsets you that much, wear some dress shoes that have a bit of a heel in them yourself.", "Lol you’re a grown man and you’re passing along your trauma to your child. Great parenting, I suggest keeping your mouth shut and getting over yourself.", "YTA…you need more therapy.", "I don’t want to call you an asshole when you so clearly just need therapy, but yeah YTA here. Your trauma isn’t your fault, but it is your responsibility. Get help before you make it your daughter’s instead.", "Didn't need to read past title. YTA. Get a grip, dude.", "Your mental health issues aren’t your fault, but they are your responsibility to manage. Yours. Not your sixteen year old. Not your wife. Not her family. This is an unreasonable ask. Stop projecting your issues onto your child. YTA", "My dad is 5'2\" so most people tower over him. He has never given a single shit about what kinds of shoes people wear around him. YTA, get the hell over yourself", "YTA.\nGet therapy. I get that you've been traumatized, but I can tell you all people are traumatized by something. You're trying to control and penalize your child for your insecurities. I'm a cis female over 6 feet tall, I can't help when others are intimidated by me and I'm sure not going to dictate the shoes I wear on what others think or have issues with.\nThis is your issue to overcome. Good luck", "YTA. The reasons are made obvious by your post.", "YTA. Do you think that there won't be any other woman in this wedding that will be taller than you? Will that be a problem for you? Yes? Then you shouldn't go. No? Then it's not a phobia, it's you projecting your insecurities onto your daughter and not being any better than your family when you were young.", "YTA, I understand trauma and how hard it’s to control it, but you really need to go to therapy if that’s a real problem as much as you say it, it’s unhealthy and you’re just bullying your daughter", "Please update this after you, a 44 year old man, cry and have a panic attack from seeing a woman in heels. Please.", "YTA - you need to go back to therapy.", "YTA. You need therapy dude", "Your trauma is your trauma. Your triggers and low self esteem surrounding height do not get to rule your daughter’s life. If you haven’t already, OP, it may be good to engage in therapy to work through this. Same with confronting your siblings - not combative, just getting some peace. \n\nAnd also you are really controlling, given you’ve prevented her from heels just not vocally? How does that work? And what impact do you think your insecurity is causing your daughter? Kids are not dumb - and it’s within reason that she would feel / notice that you’re trying to control her for your benefit. \n\nJudgment - YTA", "Yes, YTA. Your trauma isn't hers to bear. I get you feel self conscious about it, but putting that on her isn't fair to her. That's a problem you need to sort for yourself, and I'm sorry you're struggling with it.", "Did your daughter laugh in your face when you asked her not to wear heels bc I laughed my ass off at this entire post", "You can buy stacked heel shoes for men - it’s a genuine fashion thing \nYou should maybe look into it \n\nIf your daughter is that tall maybe she could be a model? \n\nThen you could have stacked heeled men shoes in every colour and material imaginable \n\nYou need to deal with your issues and stop making them your daughters \n\nYTA", "YTA. Go back to therapy. Do you have panic attacks whenever you see anyone taller than you in the street? If so, then you DEFINITELY need therapy, because that’s is no way to live.", "Don’t hesitate to seek therapy for your insecurities, dude. And leave your daughter alone. She’s only 16 and will probably grow taller, cause people tend to continue growing into their early twenties. Don’t make life harder for her because of your issues.\n\nFrankly, this is the most bizarre post I’ve ever read. YTA", "YTA, please return to therapy. If not for yourself, but for the sake of everyone around you.", "you’re so insecure that you’d prevent your own daughter from looking and feeling her best? grow the hell up and seek therapy. yes obviously YTA your views on taller women and controlling your emotions are NOT appropriate for someone at your big age. your poor daughter", "YTA, as a taller woman I feel like you likely going to (if you havnt already) cause her to become insecure about being tall. Most girls are constantly told they need to be smaller and to have your own dad repeatedly endorse that as well can be pretty mentally damaging. If you are not careful you could continue the cycle and just make her feel the same way you do.", "INFO: Isn’t there a decent chance that women who are guests there will be taller than you because heels are very common attire for wedding guests? How would you be able to handle that even if your daughter wore flats? \nYTA definitely, I’m just curious how you get through everyday life because there will always be women taller than you around.", "YTA - Don’t 👏 offload 👏 past 👏 trauma 👏 on 👏 your 👏 children.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (44M) daughter (16F) has always been a nice girl that is a little shy and never causes any trouble. She is great at school and very talented in many activities. She has a group of like-minded trustworthy friends but has never been involved with boys or go to parties late at night. My wife's niece is getting married and she asked my daughter to be one of her bridesmaids. I thought she was maybe a little too young for that but ultimately didn't protest. They issue is that as part of her attire for the wedding she is expected to were high heel shoes.\n\nI'm only 5'6\" tall and I have a deep trauma related to my height because of all the bullying that I suffered for years in the hands of my brothers with the approval of my now deceased father. I only started to get better after finishing college. It took me years of therapy and going no contact with almost all my family to be able to mostly leave all that behind. They fully made me belive that no woman would ever like a man as short as me to the point I never had a romantic relationship until I met my wife at 25. But I am not still fully in control of my emotions related to this issue, in particular I have never been able to stop the phobia I have towards women that are taller than me. My wife is 5'4\" tall and my daughter is currently 2-inches taller than her mother. That makes her almost exactly the same height as me. I never expected her to be so tall but I have been able to remain mostly calm about it. I think knowing her since she was a baby and watching her grow myself helped my brain to humanize her and not seeing her now as I see other tall girls.\n\nSince she stopped growing a couple of years ago, I have been silently preventing my daughter to wear heels or any kind of shoes that make her appear taller than me. There has been no real problem with this because she has never had any serious interest in wearing those things until this wedding situation. I know that even just seeing her in front of me with heels, being taller than me, would be triggering to point of making me cry if not worse.\n\nAll this will be specially terrible in a big family event like the wedding. Everyone will think that she is taller than me and I rationally know most people won't care buy I think I might really have a panic attack from the embarrassment that will be happening in my mind. I tried to convince her to not wear the heels but this time she really wants too and it is not interest in what I said. My wife thinks that if it is such a problem for me I should just not go to the wedding but I think that is unfair. I don't like feeling excluded and this would  be practically as if they excluded me because of height, which would feel specially pinful for me. I have been talking to both of them about these but it has been proven useless. And now they have even start to act tired and angry any time I bring up the subject. My daughter in particular says I am making her feel bad and not allowing her to enjoy being a bridesmaid.\n\nAm I the Asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You need serious therapy", "The best way to deal with this is to not give a fuck. People laugh? Throw them out of the wedding. It's not on you to impress people with your height.", "Your daughter hasn't stopped growing.  She will likely shoot up a couple more inches.  She's 14.", "YTA. Her being taller than you is not her problem. You sound insecure and you’re creating a negative relationship with your daughter. Work on yourself and leave her alone.", "YTA. It’s not your daughter’s responsibility to live her life based on your phobias. This is not her burden to bear. Have you considered how self conscious of her height this kind of behaviour will make your daughter? Also the idea that you needed to “humanize” your daughter by watching her grow up is horrible. Does this mean you are unable to humanize women you meet who are taller than you??? It’s no one’s responsibility to cater to your insecurities except you. Get therapy.", "You are making *your trauma* into your *daughter’s* issue. I’m sorry you were bullied for your height, but you have a responsibility to be a good father and preventing your daughter from wearing heels because you’re scared of being too short does not make you a good father. \n\nYou cannot prioritize your fears over everyone else’s life. Seek therapy, and do not go to this wedding.", "YTA. OP it’s not your daughter’s fault she’s not shorter. It’s ridiculous that you would impose this on her and the wedding party. You need serious therapy to address this issue. I am 5’10” a full four inches taller than you. You’re taking your issues out on a segment of the population that did nothing to you. That will always make you an AH. Fix the blame for where it belongs, your immature bullying family members.", "YTA. I knew from the title alone.\nYou’re seriously threatened by a 16 YEAR OLD?!\nGet help. You’re acting like a child, not the parent that you supposedly are. If you keep going down this road your daughter will resent the hell out of you.", "This is obviously written by a child not a 44year old man come on", "What is the connection between your daughter's height and her being shy/ athletic/ good student/ single?", "YTA and clearly still need mountains of therapy to deal with your own issues. Also, you would t be excluded from the wedding for your height. If you can’t handle the concept of your daughter wearing heels and appearing a little taller then you to the point you need to stay home….you are excluding yourself for being a huge insecure baby", "YTA don’t make your insecurities your child’s problem.\n\nAlso. Your main concern about tall women is that they won’t be attracted to you? And this is about your DAUGHTER? Do you maybe see where I’m having a problem here?", "Stop making your trauma other people's problem. \n\nI say that as kindly as possible, as someone who was bullied severely, and has cptsd.  \n\nIf you cannot handle being around your daughter in high heels without it triggering you, please see a therapist.  You need help so that you stop allowing your trauma to affect the relationships you have in your life.  \n\nYour trauma and experiences are valid, but your reaction is not.  For this, I have to vote YTA.\n\nEdited for clarity", "I have never seen an AITA so unanimous. YTA. \n\nIf you don't get back to therapy, your going to end up like[this guy](https://youtu.be/EzBRFPUYtqQ).", "Get therapy for your trauma, don't make it multigenerational by making your daughter feel bad.", "You need more therapy, especially kinda lumping your child in with women who you considered of sexual interest that you deemed wouldn't want you cause of your height. Don't go to the wedding, I promise there will be women taller than you there and they don't want to be around your little man syndrome either.", "YTA - your dad was wrong to bully you for being short, but it's perfectly okay for you to bully your daughter for being tall?\n\nYou do not get to control others as a way to avoid facing your own triggers. As your wife suggested, if you can't handle it, you should not go to the wedding. This is your problem to deal with, not your daughters.\n\n>I think knowing her since she was a baby and watching her grow myself helped my brain to humanize her and not seeing her now as I see other tall girls.\n\nThis statement right here is pretty repulsive. So, you don't view women taller than you as actual human beings? Trauma does not give you an excuse to see people as less-than. Get over yourself. You are short. 99% of people don't notice and/or don't care. Please get some more therapy because it must be impossible to function in a world where you can't be around women over 5'6 without being brought to tears.\n\nI am a woman and I am 5'11. Don't be scared. We don't care about you or how tall you are.", "YTA you have serious issues but none of those problems are your daughters. You shouldn't let your insecurities stop your daughter from living a normal life.\n\nAlso, this comment really solidified you as TA:\n\n>I think knowing her since she was a baby and watching her grow myself helped my brain to humanize her and not seeing her now as I see other tall girls.\n\nAs a 5'8 woman I don't need \"humanizing\" because I'm already a fucking human. It sucks that you're so insecure that you project those insecurities onto all tall women. That is a pathetic mindset to have that you pity yourself for a physical trait that you cannot control and yet feel afraid/hatred towards women for having a physical trait that they cannot control", "YTA. Get over yourself.\n\n> I think knowing her since she was a baby and watching her grow myself   \nhelped my brain to humanize her and not seeing her now as I see other   \ntall girls.\n\nHow do you see other tall girls? They need to be humanized? That's messed up.\n\nLots of people get bullied. We don't get to put that on other people. You basically admitted to resenting tall women. That's on you. It's your problem to deal with. You're a middle-aged man. Grow TF up.", "YTA. You need to “humanize” women who may be your same heights?  Dear Lord. I get being bullied by people for a physical issue (I used to weight 400 lbs) but never have I had to humanize someone over my trauma.  Never once have I looked at thin people as non human. You really really need to seek help. Like. A lot of it.", "I N F O: what would have happened if she’d grown another inch or two or five?\n\nYTA. You didn’t choose your height and you are traumatized by people treating you differently because of it. Tall women also didn’t choose their height, so why would you think it’s reasonable to treat them differently because if it? You’re doing the same exact thing that was done to you.", " \"I think knowing her since she was a baby and watching her grow myself helped my brain to humanize her and not seeing her now as I see other tall girls.\"\n\nThis section is extremely worrying. Do you not see taller girls as \"humans\"? Also, your daughter is 16 and she is your height now and will most likely continue to grow. You, on the other hand, will shrink as you age. This  means she will inevitably be taller than you. The people who caused your trauma are your brothers and your father not taller women and your daughter. It's not their fault! You need more therapy or you might carry the abuse you suffered on to your daughter as soon as she gets taller than your. Controlling what she can wear, having a panic attack for something so harmless, dehumanising taller women etc. are already forms of psychological abuse that you already cause.", ">I know that even just seeing her in front of me with heels, being taller than me, would be triggering to point of making me cry if not worse.\n\nOP, you need further therapy. I don't say this in a mean way, I'm saying this as a daughter with a father. She has the right to wear what she wants, and it is not her job to accommodate your trauma. It is *your* job to do that.\n\nWhat will you do if it's her wedding? Assuming she has a traditional wedding, she'll likely be in heels. Are you going to refuse to walk her down the aisle or dance with her because it may trigger your PTSD? Do you want to miss important events in the future?\n\n**It's valid for YOU to skip events to avoid your triggers. It is not valid for you to make OTHERS alter their events or outfits to avoid your triggers.** Especially for something as common as heeled shoes.\n\nUntil then...either stay home or look into [shoes with lifts](https://www.tallmenshoes.com/). Robert Downey Jr had some great ones that he'd wear to events while he was playing Iron Man. Get a set of dress pants tailored to help hide the boosted soles.\n\nYTA, sorry.", "You serious Clark?  Jesus Christ, in what world do you think its ok to transfer your height issues to your daughter.  Did you ever consider that you could be giving her the exact same issues you have except about being too tall?  WTF.  Get help, learn to cope, its not your kids job to protect you from emotional reactions.", "WOW YTA, get a grip I am sorry your brothers bullied you but you need to stop being so controlling", "YTA. Men can have bullying trauma from being too short while women can experience bullying trauma from being too tall. Don't pass height insecurities on to your child. If you cannot model to her that height doesn't matter, then you should pass on the events and let her be herself - don't require her to change herself and make herself smaller for your or any other man's comfort.", "Soft YTA - I'm not going to try to understand why you have this hang up but it sounds like your working through it which is good. if you have a legitimate issue it's not unreasonable to ask but you are for being petty when she said no. Maybe try wearing shoes that make you taller? That way comparatively it's fine. She gets to wear heels you're still tall to prevent probably crying fit. \n\nIf you have an issue like this attempt to change your behavior before asking others to accommodate you. I can also almost guarantee based on your height (around 5'6\" 5'8\" from the post) there will be at least one woman taller than you at the wedding since heels are common at formal events and some are incredibly tall so specifically asking your daughter not to wear heels won't fix it anyway.", "YTA", "YTA", "Find yourself a good shoe guy to add some lifts to your shoes, then you and she are the same height again. There are ways around this, YTA if you don't at least try to compromise. Someone can be 6'8\" and have a 2 foot tall attitude, keep your chin up and stand proud, sir.", "YTA First Iam sorry for what you had to go though in all honesty now why your the asshole is 1 you silently encourage her to avoid certain things so you didn't have to face the problem head on it should be reversed you should want to find a way to work past your trauma because you love your daughter so much and don't want to see her upset instead of bringing her down you should raise for her, 2 you wouldn't be excluded because of your height you would be excluded because of your behavior there's difference", "YTA", "YTA", "YTA", "YTA", "Soft YTA. I get the trauma but it's not something you some impose on your daughter. It's something you need to work on yourself.", "Gentle YTA here.  You've really internalized all of the bullying and insecurity of thinking you're too short, and despite going NC with your brothers, you're still giving them a lot of power over how you feel about yourself as an adult.  \n\nThis would be unfortunate if this were only negatively impacting you, but it's even worse because you're allowing it to impact your daughter's self image. Fourteen is a delicate age for a girl, and she needs all the encouragement she can get to feel confident as she dresses up in a formal dress and heels for the first time, in front of a lot of people.  \n\nBuy a new outfit for yourself (or just a new shirt and tie), get your hair cut, and step out to that event with your beautiful wife and daughter, and be proud of the family you've created for yourself. Smile big in all of your pictures, and tell your wife and daughter how lovely they look.  And have some fun!\n\nIf the bullying is still bothering you to this extent, I also encourage you to seek therapy.  Just talking it out with a professional can work wonders.", "the projection is soooo real with you dude.", "This can’t possibly be real.", "Yta and definitely have more work to do with a therapist.", "YTA…Don’t give her a complex about her height. You having a height trauma yourself and being her mother, you should know better!", "YTA.\n\nYour insecurity about your height is a you problem.  Your daughter can no more help her height than you can help your's.  It is not her fault that you were bullied, nor is it her responsibility to cater to your insecurities now.  \n\nWould you have the same problem with a son who was taller than you?  Or is it because she's a girl and you feel your masculinity is threatened by her being taller than you?\n\nIf you didn't go to the wedding it wouldn't be because of your height, it would be because you decided to exclude yourself because your insecurities are more important to you than the wedding and supporting your daughter in her role as bridesmaid.", "YTA. I’m the same height as you and a little older with a daughter.\nYou are a selfish dick. Go get some therapy so you can man the fuck up.", "Ytam. Troll.", "YTA, please stop imposing your trauma on your daughter. She does not deserve it at all.  You obviously have not totally dealt with your trauma, get a therapist and deal with it before you completely ruin things with your daughter.", "YTA, I'm with your wife on that one. It is your problem, if you can't manage you don't go. You need to face the fact that it will happen more and more. I think you should make a plan with your therapist to do everything to solve this issue ASAP or you are going to miss many of your daughter's milestones.", "YTA...this is wedding is not about your comfort level. I'm sorry you are shorter than what you feel is ideal, but the fact you are ready to make this wedding about you tells me you need more therapy. When is it going to stop. What if she brings home a 6'2\" guy home and marries him? What if your grandkids are taller than you?", "YTA based on title alone. how fragile is your masculinity that your daughter being tall is a trigger for you? seek help.", "YTA op. You are the definition and the reason why people have the “bany rooster” jokes and assume all short guys have a complex - because you just created a whole conflict , crisis and made it all about you in a situation that has nothing , nothing , nothing to do with you or your height. Just what? And how is banishing all things taller the 5’6” a way to help yourself get over your trauma? You are just spreading trauma to your own child over your own fear. \n\nIt’s not your wedding, your not at the alter, or in the bridal party. There’s no “bridesmaid and her father” dance. She won’t be sitting near you for most of event.", "YTA  Dude get some professional help, you are being unfair to everyone around you", "Your daughter can wear heels if she wants. I would do to therapy if I were you to deal with your issues regarding your height", "YTA. You need more therapy my dude. You are concerned over SHOES because a 16 year old girl will stand taller than you. \n\nThe anxiety you’re feeling is real. The fear and all the emotions hammered into you by your family was terrible. None of it is anyone’s fault but theirs. Don’t make your daughter suffer for your family’s misdeeds. Talk to a therapist. Work more on accepting yourself. \n\nBeing a kind, strong man will have your daughter looking up to you for much longer than anything else. A man of strong character stands tall regardless of stature.", "Me, me, me, me, meeeeeeeeeeee! Reality check, the world does not revolve around you and your feelings. Get some damn therapy and stop this nonsense now.\n\n\nI don't know who has been pandering to your outrageous self involvement, but they should also take a hard look at themselves. \n\nWhat if your daughter has another growth spurt; entirely possible, even likely she might gain another inch or two before she turns 20. Are you going to make her crouch, or stay seated around you? Will you try to insist she wears flats on her wedding day as you walk her down the aisle? You won't have a daughter to be insecure at if you don't seek help. YTA.", "YTA.  The answer is to get therapy to handle your issues and inappropriate trauma responses.  It is not to force others to tiptoe so as not to trigger them.\n\nThis is a you problem, not a them problem.  You need to be the one to adjust.", "You know how you have trauma off your family for being short? You are going to make your daughter end up that way for being taller than you. You have always tried to persuade her from wearing heels in her life for you, but what about what she wants or feels? She is going to get a complex because of you and your issues. So damn what if she is taller than you. Alot of people everyday in life and around you are going to be taller. You go to order coffee and your barista is taller than you and she is wearing heels are you going to have a melt down over that? Your daughter could have prom, her own wedding anything and wants to wear heels on her special days are you going to stop it then? No you will probably be uninvited. NOT BECAUSE OF YOUR HEIGHT but because of how you are going on and trying to force other people to be smaller around you. YTA. You need help and to back off.", "YTA. Your daughter is only 16.  She may still got a growth spurt. How are you going to be around her if she is taller than you?  When she gets married does she have to wear flats so you don't feel bad about being short?  You're short.  Get over it. Go to therapy again.  You really need it.  FYI I'm barely 5 ft tall.", "YTA. Your insecurities, your problem. Do NOT push that onto your daughter. Allow her the same freedom to explore and enjoy her experiences the same way you’ve had freedom to work on your insecurity. If this affects you that much you need to go back to therapy. And be grateful your wife and daughter didn’t laugh in your face, because I definitely would have.", "YTA. Go to therapy and stop passing your issues on to the next generation. Work on yourself.", "YTA. You have insecurity and shame about your height. Don’t pass that along to her.\n\nIf you choose not to go to the wedding, that’s on you. They are not ‘excluding’ you. You would be excluding yourself", "YTA.\n\nGet some counseling and stop taking your trauma out on your daughter.", "JFC dude YTA, get therapy. If the wedding is soon take a Xanax and get over yourself.", "YTA. Have you considered that at 16 your daughter hasn't fully finished growing yet? She may still gain at least another inch and end up taller than you in her bare feet. \n\nWhat will you do then...decree that she can only ever be seated in your presence? Or cause her to feel so self conscious that she develops a permanent hunched back just to appease your fragile ego. \n\nShe isn't the cause of your trauma and it's horrible of you to take it out on her, which is exactly what you are doing by trying to prohibit her from wearing heeled shoes.  \n\nPlease seek better therapy for your phobia.", "YTA. You need more or better therapy, because this is clearly an unresolved issue for you and you’re making your daughter suffer because of it. She’s not responsible for keeping your emotions in check just because you’re so easily triggered about your height. \n\n>helped my brain to humanize her and not see her now as I see other tall girls\n\nWhat the hell is this? And what if your daughter had *gasp* grown just one more inch? What weird things would you be making her do to appease your insecurities? Walk stooped over? The Cotton Hill Special? \n\nIf you’re so bothered, get some lifts for your shoes or something, but stop putting the onus on your daughter to soothe your ego.", "Yta. The shit apple never falls far from the shit tree. Your more lkke your own father than you think.", "YTA, what you are doing is creating insecurity for your daughter because you are insecure.  You need to go back to therapy and get it under control  to are controlling thats where all your height is at.", "Yta- You are also now creating more generation trauma by not dealing with yours.  You were made to feel like crap because of your height so you are now creating the same trauma but in a different form. Get therapy.", "YTA \n\nI hope your daughter will on day marry a 6' tall man and that their children inherit their father's genes.", "Dude, you need help. “I think knowing her since she was a baby and watching her grow myself helped my brain to humanize her and not seeing her now as I see other tall girls.”\n\nWTF??!! \n\nHow do you see “other tall girls?” Do you hate them? Do you feel rage? Are any of your daughter’s friends taller than you? \n\nDon’t go to the wedding. Take yourself out of the scenario and allow your daughter to shine. Get a therapist. If you currently have one, go more often. \n\nYTA", "YTA. You clearly need more therapy - don’t take your anxiety out on your child. Allow her to be who she wants to be and wear what she wants to wear because I can assure you, you will cause problems for her and your relationship in the future.", "YTA- stop projecting your issues and insecurities onto your daughter. She did not bully you, she did not torment you. You are doing the same thing to her that was done to you. You’re holding her height against her & it’s not even something she can control.", "YTA. You have a lot more work to do on yourself.", "YTA. Get therapy before you completely fuck up your daughter’s mental health because of your own issues.", "Holy projection of trauma Batman. YTA.", "YTA\n\nI have got news for you - everyone knows you are short and everyone realizes that your daughter is the same height as you even if she is barefoot.\n\nAnd NO ONE CARES.\n\nYour daughter is at the age when she is going to wear heels for some occasions because most women do. They wouldn't necessarily be spike stiletto six inch heels but most women wear some kind of elevated shoe or boot.", "I don't care about any of the content of your post. And I'm not going to read it. \n\nBy title alone, YTA.", "Floored by the line about humanizing your daughter and helping you see her as a person rather than just a tall girl. YTA", "YTA - as a parent you should make sure to not pass on your insecurities to your children.", "Don't go, and hang out with your therapist more instead.  Your daughter is not the cause of your traum.  Neither is literally any woman taller than you inthe world. Yta", "Oh for fuck sake, grow up. YTA.", "YTA Stop making your insecurities your child’s problem. Your family sucks for bullying you over something you can’t control but you can control your own reactions.", "If you're afraid of people that are taller than you, your children included maybe don't have children.. Also stop controlling those around you for this.. \n\nYTA", "Time to start immersion therapy. Let her wear.the heels and start telling brothers to f off. I am 4 inches taller than my husband. He doesn't care if I wear heels. \n\nImmerse yourself in heels. Have your wife wear them. Get a picture surrounded by bridesmaids in heels while your wife and daughter give cheek kisses.  It will be an awesome picture. It will be the start of celebrate you! Dont let the past define you!\n\nYTA", "One of the few aita that do not require reading beyond the title.\n\nGrow up", "YTA. Have you ever heard of breaking the cycle of trauma? This is your trauma, and it's probably very much legitimate and you are allowed to feel it. However, it is **your** trauma, do not make her being taller a trauma for her. That's so unfair and cruel to do to her. You're telling her that her taller height is something to be embarrassed by, like you were told your shorter one was.", "Yta... This post is completely about your insecurities. You're an adult. At 5'6\", most people are taller than you, including a decent portion of women. Get yourself some help, and stop making your insecurities someone else's problem.", "Yes, you are the asshole. It’s not your day— it’s your wife’s nieces day and has asked your daughter to be part of the wedding party. You have absolutely no say in this matter— sorry if it’s not what you want to hear. I’m a very understanding person— but this is just ridiculous. Absolutely ridiculous. If you’re so bothered, why don’t you buy yourself a pair of platform boots and be the tallest one at the party, then? Holy.", "You need more therapy..  Don't do to your daughter, what your brothers did to you", "I’m 5’8”\nMy hubs is 5’5”\n\nIt’s not the hight that makes a good man. \nAnd it’s not hers that makes her your baby girl. \n\nLet her wear heels … bring bandaids and comfy pretty ballet flats for her because her feet will HURT. You will be the hero dad. Plus She can wear them when you dance with her and do ALL the embarrassing dad dancing with ALL the 90’s moves.", "YTA. Don’t pass on your trauma to your kid. Go get therapy so you can be better family to her than your family was to you.", "Buddy, platform shoes exist for a reason. Give 'em a try and see if it helps...\n\nPlease do not pass on the trauma to your kid by *bullying her for her height*. YTA for this alone.", "YTA. You are actively trying to make your daughter small, literally and figuratively. I’ve (f) been taller than my dad (5’8) since I was 14. I can’t imagine the kind of negative impact it would have had on me if he made me feel bad about being tall, and encouraged me to do everything possible to appear shorter. Can you imagine the negative self image and insecurities? OP - it is your job to make your daughter feel good about herself. Go back to therapy.", "Yta and you should probably figure all this out before it's HER wedding day and you're making a spectacle.", "YTA and now you are in the process of creating generational trauma. Stop this before your daughter goes through what you have.", "YTA\n\nYou're an adult and a parent, and you need to seek help for your past trauma from a trained professional, for your sake as well as your daughter's.", "YTA.  So you want to shove your insecurities off on your daughter?  Hell no.  Do not make your daughter pay for your trauma.", "YTA You sound wildly self-obsessed. Let your daughter have fun being a bridesmaid.", "YTA… I swear I didn’t even read your description. Just of the title", "So you suffered a great of trauma from bullies who made you feel ashamed of your height and you think it's appropriate to bully your daughter by making her feel ashamed of her height?\n\nA good parent does not body shame their own child for any reason. \n\nYWBTA for doing it for the upcoming wedding and YTA for doing it in the past.", "YTA.\n\nGet therapy.", "Op, please get help. Gentle YTA - you can't expect other people to limit their experiences for a trauma you have that they didn't cause.", "YTA\n\nYou are long due to therapy sessions. If something like this makes you silently try to control your own daughter, you should start yesterday.", "YTA. You have trauma from being bullied about your height, I get it that sucks. But you might be doing the same thing to your daughter. There’s so much stigma with shorter men and it sucks, but it’s ok that she’s a taller lady. Teach her that no matter how small or tall, everyone is beautiful", "YTA. The wedding is about your niece, not you. Your height is not the focus. You are not the focus. Please get new therapy and realize that your preoccupation with your height is not everyone else’s. No one else should suffer because you’re inflicting your issues on them.", "You don’t own your daughter. Making her adjust herself because you have self image problems is problematic at best and abuse at worse. YTA", "YTA\n\nHow about celebrate your daughter and make her feel confident and beautiful. Stop passing on your body issues to your daughter. This isn't your family excluding you, this is you excluding you for not being proud and celebrating your daughter. Be a bigger man. \n\nThis from someone who is also 5'6\"", "YTA\nGet a grip on yourself and go back therapy because it clearly didn’t work the first time.\n\nYou’re ridiculous", "YTA, WOW! I don't even know how to unpack this....\n\nYou will be \"traumatized\" by your daughter wearing HIGH HEELS?\n\nYeah this is ridiculous. YTA.", "YTA. Your past traumas are YOURS to work through. They are not for you to project onto or burden others, and is is not everyone else’s job to change their lives to keep you and your ego comfortable.\n\nLet your daughter wear heels. Go to therapy and do real work on your insecurities and unresolved trauma instead of expecting everyone else to carry the burden for you.", "YTA.  Now you are traumatizing your daughter about her height.  What's next, she can't marry anyone taller than you?", "YTA. I understand that this must be hard for you and that your dealing with trauma which is complicated but what you’re doing right now, is the exact same thing your brothers/father did to you. You are making your daughter feel bad about her height and making her feel like she’s doing something wrong. Your insecurities are for no one to deal with but your own, being resentful of tall women is incredibly toxic and you are hurting your daughter. You need to go back to therapy and deal with your own emotions and insecurities and not push them on your daughter. You have options to choose from and none of those options involve controlling other people. You can choose to go and try to work through it, you can choose to not go and avoid the situation or you can get lifts or special shoes for you to help with your insecurities. The bullying done to you wasn’t right but all you’re doing is bullying and hating other people for perceived reasons and in turn shaming others for their genetics just as it was done to you.", "YTA. Sorry, yes, you have a reason why it is triggering to you but that can’t be an excuse to take your insecurities out on your daughter. You’re continuing the cycle of height insecurity.", "I want to tell you to grow up but you might get upset. YTA.", "YTA. You're 44 years old talking about your 16-year-old daughter. Be the adult and the parent in this situation. It's time to set aside whatever dysmorphia trauma you have, get therapy for it, and be supportive and present for  your daughter.", "My dad and my sister are also both 5’6”. My dad does not have a problem with it because he’s not an asshole or an insecure little troll.  \nYTA.", "All of this. \n\nAnd if not going isn’t an option since he doesn’t want to be left out, maybe he needs to wear a men’s shoe with a bit of a heel. Or get lifts to go in a shoe. \n\nOP, your problem is not anyone else’s problem. You need to find solutions for yourself instead of hindering others. Do you think your daughter will be the only person there taller then you?", "Yupppp. Also if YOU CANNOT ATTEND because it would be too traumatic for YOU, then that’s YOUR CHOICE to exclude yourself. You don’t get to blame other people for this. This is YOUR problem and therefore YOUR responsibility to fix. YTA", "This! To paraphrase a podcaster that I enjoy \"your mental health (or in this case, trauma) is not your fault, but it is your responsibility.\"", "This is the best answer yet. IT IS NOT HER JOB TO PROTECT YOUR EGO.", "YUP. Dad, I agree. Please get therapy and get over this. Or you should just stay at home. You can't let your insecurities affect the lives of our daughter and wife.  And I'm sure you know there are plenty of tall women out there these days with shorter guys. No one cares as much about this stuff much anymore.", "Can you imagine what he’ll do on his daughter’s wedding day if she wants to wear heels?", "Agreed! OP, I’m so sorry you experienced trauma at the hands of your family over something you have no control of. However I hope you can see how this is *your* issue you need to work through, otherwise you are passing your height-related trauma onto your daughter. You have experienced a lifetime of pain based on your fathers height-based treatment of you. You are making decisions about your daughter based on *her* height. If you continue to do this and do not get therapy to work through your trauma, in the end you are no better than your own father. Do better for your daughter and for yourself. YTA", "The “I learned to humanize her and not treat her as other tall women because I watched her grow” part was… something.", "I cant imagine being so fragilé that you rage about your teenaged daughter’s heels because they make her a little taller than you and that makes you feel emasculated. OP, work on your insecurities and stop taking them out on your daughter.\n\nYTA", "Yes. OP I understand that a lot of short men have trauma because society tells them to be the big manly man, but please remember that society also tells women to be small and weak. You are not only choosing your ego over a your daughters harmless request, but you are also reinforcing those stereotypes. You are telling her that men should be tall and powerful and women should be small and weak. It’s all just height and shoes. Let her wear the pretty shoes to the wedding!", "No seriously the line of \"-helped my brain humanize her and not seeing her now as I see other tall girls,\" gave me the shivers! This guy just sees tall girls as objects and girls shorter than him as humans. Major red flags", "Really disturbing that he can only see his 5'6\" daughter as human because he raised her 🚩🚩🚩🚩🚩", "this is the one", "Exactly. \nAnd I'll also add that the short height and the insecurity about a short height are different things. \nI've dated guys shorter than me. Most had no problem. One felt really insecure about his height, would get grumpy if I wore even small heels, said some misogynistic things about women (especially tall women) who rejected him. When we broke up, I'm sure he was convinced it was because of his height. But the problem was his attitude towards his height. \n\nOp, if you don't go, or get to go, to the wedding, it wouldn't be about your height. It wouldn't be about your daughter's height. It wouldn't be about your daughter's high heels. It would be because of your own insecurities and issues. You are not being discriminated against here.\nAnd honestly, not going would probably be the healthiest thing to do, but don't take that as a defeat. You'd be doing what you need to protect yourself, and your daughter as well.", "She's going to need some therapy soon. I saw this as someone who's mother had some major body image issues. I'm sure she would say that they were her issues and she did not project them onto me... But let's be real. This kind of thing inherently filters down to your kid. Teens are not idiots, they see how you perceive others and yourself, and as their nurturing figure, it's hard to get out of the way of that. So hope you're still in therapy, dude.", "Let's pretend he gets his way and she doesn't wear heels. What happens when OTHER people at the wedding have heels on? Like the other bridesmaids, bride, and guests? He is gonna freak out no matter what, he must struggle to be in public if things are this bad...", "Totally YTA. All you are teaching her is that short guys are controlling and you shouldn't date them if you don't want to be babysitting their insecurities forever.", "Thank you for saying this! I'm 5Ft10 and I HATE when men, taller or shorter than me have a negative reaction to my height... like I control it. My hubs LOVES when I wear heels, even my really high ones that make me taller than him, and it makes me feel amazing. \n\nInstead of demoralizing your daughter, you should try supporting her and helping her learn to be confident in HER body and with HER height and use it as an opportunity to give your daughter the love and support you were missing in your own childhood. Do better than your siblings and dad.", "This stuck out to me as well. And why just women? Why not dehumanise tall men? Gross.", "Very much agreed! And I was wondering, why does he blame tall women (who, as far as I know, don't actually have any control over their height) for the actions of his brothers (who, presumably did when they bullied him)? \n\nOP YTA and desperately in need of therapy.\n\n(Not a tall woman but mom to a tall daughter)", "Is anyone else concerned that in the unlikely event that this lunatic is in a position of authority at work or elsewhere, he’s going to be actively discriminating against or even harassing “tall” women (last time I checked 5’6 is bang on average in most western countries)?", "5’11” (f) here 🙋‍♀️. Last time I checked I was reasonably human. Ppl have often pointed out I’m tall which has left me self-conscious about it. I get insecurities about height. I **don’t** get transferring those insecurities to your daughter.\n\nYTA if this post is real. Keep working on your issues please.", "He would hate my family. I am 5'10\", my mom was 5'9\" and I have two aunt's who are taller than me. \n\nMy boyfriend of three years is 5'6\" .", "Honestly, I'm 5'3 and wigged the fuck out by that statement. My best friend is a tall woman, as is my grandmother-in-law, both about 5'10. My great aunt is 6'0 and her mother (who took care of me after school until she passed when I was about 6) was either 6'0 or 5'11. All four women are and were absolutely stunning and amazing. The fact that these  women  and others like them aren't \"human\" to men like this- apparently extending even to their own *children* - just because they're tall?  It's just so creepy and gross. I don't have proper words.\n\nOP needs *intensive* therapy and to stop sitting in his own discomfort and letting it fester while he takes it out on everyone else.", "He needs massive amounts of therapy. You can’t control if your daughter wears heels or not. I’m extremely tall and still wear heels to formal events because they make me look and feel good. Your internal issues should not be projected on your loved ones. YTA", "I am so glad my dad never put this crap on me.  I'm at least three inches taller than him and wore 5 inch heels with my wedding dress.  My dad still spun me and dipped and even threw in a lift for our daddy-daughter dance.  He never made me embarrassed of my height and never seemed to care about his.\n\nAfter all, dynamite comes in small boxes.", "YTA. There is so much for OP to unpack in therapy but did you guys see how he said he was 5’6” but his wife was 5’4” and his daughter was two inches taller than his wife which made her ALMOST the same height as him? \n\nMy brother in Christ two inches over 5’4” is just 5’6”. Y’all are the same height. It’s as if the only women in his life can only be shorter than me. Would he love his daughter less if she was 5’8”?", "She’s a little shy already - seems like OP’s approach risks making her self-conscious about her height in the same way his family bullied him around that age.  The wedding sounds too close for OP to actually deal with his issues - maybe lifts for the day?  Maybe just don’t stand next to daughter?\n\nWhat you absolutely don’t do is anything that draws attention to an already shy 16yo for being different than the group - and one bridesmaid wearing flats when the rest are in heels will draw attention.", "OP needs to stop bodyshaming his daughter and giving HER a trauma. Get some therapy, YTA.", "OP is essentially doing to his daughter the same as was done to him.  He's judging her (and controlling her) based on his issue with her height.  It might not be \"bullying\" exactly, but it will absolutely have the same effect on her, in that it will make her ashamed of her height.  (Which is actually fairly average.)", "I was officially taller than my dad when I was 10. It probably bummed him out a bit that all of his kids are taller than he is, but he never said a word.", "Why is no one talking about other women wearing heels in the party?? Will OP have a fit or cry too?? If his trauma is so severe, he shouldn't be going, like his wife said. If he can handle seeing other tall people, he can handle seeing his daughter in heels. It's just an excuse for his ego.\n\nYTA", "Right? I'm the tallest and youngest among my sisters and almost 4-5 inches taller than my mother. I'm the only one in my family who likes to wear heels so sometimes during pictures it is awkward but no-one ever stopped me from wearing them. YTA op", "Also adding, as one ages gravity and the degradation of your body makes you shorter.  He’s just going to get shorter as he ages.  Then what is he going to do?", "Seriously. Like, sorry you got bullied. That sucks. It sounded awful. That's not your daughters problem though. Quit making your problems theirs. Totally YTA.", "Ther👏a👏py👏", "I am also flabbergasted that his phobia is of tall women, not the men who bullied him. It's not as if anyone can choose their height, so he's penalizing the wrong people in this situation.", "Hello fellow tall daughter!! I am taller than all of my immediate family members. By a lot. I wore flats to my older sister's wedding and they were all in heels and I still had a minimum of 4 inches on the next person. Her wedding pictures are hilarious to me. My father proudly calls me his tall child. He would never shame me like this. \n\nI cannot imagine the self esteem issues OP'S daughter is going to face if he keeps this up. Knock it off OP. Take care of your issues with a therapist and stop making it your daughter's problem. YTA.", "YTA. Agree above that you need more therapy. For your daughter's sake, please talk to therapist about this post.", "Exactly. \n\nYou’re fucking 44, a grown ass man. grow the fuck up and seek help. Stop making your *daughter* is not responsible for your ego and your trauma. \n\nYTA", "I hope you see these comments and take them to heart, OP. It is no one else’s job to carry the weight of your trauma or bruised ego, or accommodate you because you haven’t put the work in to fully process and heal from your trauma.\n\nThey are not excluding you because of your height. YOU are excluding YOURSELF because of your own insecurities about it. Nobody else but you gives a damn. You have labeled the situation “unfair,” but it’s your own behavior and demands that are unfair. You expect everyone else to bend to your insecurities and live around them to coddle your ego.\n\nDo not project your insecurities onto your daughter. Her choices should not be ruled by your issues. Love her enough to let her live her own life without having to live it around your problems. That’s what therapy is for. Keep working on yourself. YTA.", "I’m surprised that a grown adult is having a meltdown over his daughter’s totally reasonable shoe choice.\n\nDude.  It’s shoes.  Grow up and enjoy your wedding.  Your wife and future happiness should be what you’re focused on FFS. YTA.", "I really feel for the daughter here for the seriously messed up \"lesson\" being pushed by the dad.\n\nSo basically, she has to have body insecurity issues because of the projection of an insecure male authority figure in her life?\n\nOP is seriously setting up some long term damage and problems here. It's frankly extremely cruel and creepy to obsess this much to the point that he had been sabotaging and preventing the kid's personal choices for her appearance.\n\nThat's the kind of betrayal that ends up costing future relationships. \"Dad\" needs to get his own shit together.", "Sit in the corner & be a good daughter??? No body puts Baby in a corner!!!! \n\nI love how he says they're *almost* the same height; no dude, you're 5'6\" & your daughter is 2 inches taller than your 5'4\" wife (sorry but that is also 5'6\", you're the same height).", "Don’t forget, he’s been working in humanizing her since she was a baby 😳", ">I think knowing her since she was a baby and watching her grow myself helped my brain to humanize her and not seeing her now as I see other tall girls.\n\nWhat about this gem?", ">Since she stopped growing a couple of years ago\n\n\nO man I so hope she gets a late growth spurt. That's really not that uncommon.", "insightful wording", "What he must think of basketball players!!", "How does this guy do things like go to work or go out to eat? Tall people and women in heels are everywhere and presumably he manages these things without a mental breakdown in public.", "Obviously outside of his home, he tolerates the existence of women who are taller than he is.  Also, there will almost certainly be taller women at the wedding, but notice he isn't threatening to have a meltdown if he should happen to see one of *them*.", "Right? My dad's 5'6\". I'm 5'9\". Whenever he sees me in heels his only comment is how nice I look. And I was taller than him by age 11.", "I'm all in favor of this idea!", "This. All of this. Cosigned a 5'9 woman. 💙💙💙\n\nYTA. You were given a complex about your height and now you're determined to pass it on to your daughter to make yourself feel slightly better.", ">Back to therapy YTA\n\nRight? Get back in the office, OP. You are not done.", "Exactly, his triggers aren’t his daughters problem. Please seek more therapy because it obviously didn’t work, YTA", "Also, there is a possibility that his daughter may still grow. She is only 16. I didn’t stop growing till I was 19. \n\nWhat’s he going to do then? Have a panic attack every time she walks into the room? Chop her off at the ankles??!!", "Seriously, I'm 5'8\" which isn't even tall, and I got so much shit for it from people.", "He's going to make her hesitant to date short men.", "The part about only being able to humanize his “tall” daughter unlike other tall women is concerning", "I was looking for this comment - How does OP go anywhere?  Taller women aren't so rare that you won't see them if you go out.  Like, how does he go to the grocery story?  \n\n\nAnd if the phobia is that bad how is OP planning to go to a wedding where there will presumably be other women who are tall and/or are wearing heels?", "She’s only 16… decent chance she does still grow a little more.", "This is what I was thinking aswel. He is becoming the bully in this scenario.", "I’m 6’4”. My partner is 5’7” and honestly I’m going to show him this post because he thinks he hasn’t handled our height difference well. And he doesn’t try to stop me when I wear heels. He also sees me as, you know, a human being, unlike how this dude sees his daughter.", "Agree yta but therapy is important", "Yeah me also. He’s literally doing to her what his own family did to him growing up. He shaming her for her height and punishing her and now making her feel bad. \n\nAnd honestly, almost everyone who sees her is going to say “oh honey, you look great” and they’re going to see that she’s in heels. Everybody knows that women who wear heels are not as tall as they are in the heels, because -shock- heels make you taller. \n\nOP is reading wayyy too much into this, and he is causing all of this negative attention on the fact that he’s short. If he just ignored it, let it go and didn’t say anything -nobody would probably even notice.\nEdit to add:\n\nOP- the smart, brave and grown up thing to do would be to get used to her wearing heels now before the wedding so it’s not a shock. Stop running from it and maybe you can one day embrace it and make light of it “I’m so proud she’s tall. she won’t have to face the same things I did growing up” “she may be taller but she still my little girl”", "I struggle to understand why some users do that. I need to understand what illness is behind that. They take all the time of the world writing these soap operas 🤣", ">Please let your almost-adult daughter \n\nThis is wrong, OP is in no position to let or not let the daughter wear heels. Daughter is 16 at this point she can wear what she wants. OP just needs to keep quite. \n\nIt is one thing to make a child wear/not wear something for safety reasons. Like not letting them run barefoot over glass, or on fire. But once kids hit a certain age even stuff like that you can't control. A 18 year old wants to walk on glass you can't do anything about it.", ">be the bigger person\n\nouch lol", "She can’t be the bigger person…she’s only 5’6”", "You’re right. I’m the shortest in my family at 5’6-7” and hate it. I don’t know how I ended up this short compared to the rest of the giants in my family, but it really bothers me. It shouldn’t, but decades of comments do a number on a person. My daughter is just a bit shorter than me and I sometimes feel bad about it. I talk myself down and never make her feel bad. It’s my problem not hers.", "He doesn’t manage with taller women, he doesn’t think they’re human. He even admitted he ONLY humanizes his daughter because he watched her grow", "OP, you need to seek out therapy. You’re putting your insecurities on your daughter, and you are potentially putting a trauma on her that she doesn’t deserve. Do you want your daughter to be insecure about her height? Did you really think she would never want to try out heels? \n\nShe’s growing up, and you really are putting a dark vibe on a life milestone for her: being dressed up in a special role is a big deal for some teens girls, and it seems like it is for her. This trauma that you have, you’re imposing it on every woman taller than you by dehumanizing them. That’s your hang up, it’s your job to handle it. If you need to cry, cry. No shame in it. Let it out. Might actually make you feel better to release all of that pain and start healing. Our children are not responsible for the feelings of grown ass adults. YTA. \n\nPlease work on you, apologize to your daughter, tell her how stunning she looks in those heels and that dress, and allow yourself to enjoy the event for her sake. \n\nWe can’t help the bodies we are born into, and it’s shameful that so many made you feel bad for that, but it doesn’t give you free reign to shame your daughter for the body she was born into.", "> what about walking her down the aisle one day? would you prevent her wearing heels on her own day?\n\nbased on the post, OP likely would. Everyone turning and looking at the bride directly next to him would likely be too much to bear.\n\nOP, you'll be so much happier when you work this out. In the meantime there is a great solution -don't go- that you can use.\n\nIt's not excluding you due to height. It's you gracefully realizing you cannot manage the social situation without turmoil, so you save everyone especially yourself the drama.", "Op is a man.\n\nBut yes, YTA. Therapy is required.", "Also - how’s she too young to be a bridesmaid? Another red flag of control to me 🤷🏽‍♀️. Not adding another judgment. Already listed one above", "But it gets more disturbing if you read it. But he does manage to see his daughter as human! (Which is apparently a great accomplishment.)", "Hail yourself!", "\"I have trauma so YOU have to change.\"\n\nYTA", "This is just too insane to be real. His own daughter wearing high heels would traumatize him to the point of tears and a panic attack? And what about the fact that there will undoubtedly be other women there who are taller than him both in and out of heels? Or is he a moron too?\n\nIf it is real, back to therapy for you OP!", "Oh god, I didn’t even think about that, but it definitely seems like he would give the ultimatum of “no high heels or I won’t walk you down the aisle”. Or what if he has a grandchild that’s taller than him? \n\nOP, for your sake and your daughter’s, you gotta go back to trauma therapy. From one person with severe trauma to another, I know it sucks and it’s hard and there’s a point where it feels like you aren’t making progress, but this is untenable.", "Yeah, I’m a 6’ tall woman, and there are two types of shorter guys — those who are happy with who they are and confident, and those who have a weird resentment of my height. I’ve happily dated many of the former and steer well clear of the latter.", "I’m so glad someone else was so put off by that bit. I read it and was like “so you… don’t see women taller than 5’6” as human beings??” I know he says he’s been to therapy, but he needs to find a different one and go to more, because he didn’t actually deal with his problem, he just went no contact his brothers and found enough confidence to be with a woman shorter than himself. He cut out the people who bullied him and now focuses all his rage and insecurity on innocent women who just happened to be as tall or taller than he is. It’s not anyone else’s fault that your brothers are horrible, sir, so why are you letting the trauma they caused you serve as your excuse for inflicting trauma on others??", "The fact he said he had to humanize his own freaking daughter made me want to scream.", "Yes, absolutely! It was so disturbing to read. \n\nI already had a bad feeling at this line: \n\n> I have never been able to stop phobia I have towards women that are taller than me.\n\nbut phobia could mean a lot, could be fear. Now with the dehumanizing of them, oh well… It’s interesting how OP was bullied exclusively by men (brothers, father) but takes it out on taller women.\n\nEdit: I can’t let this go. There are so many stories by men that can’t find a partner and blame women as a collective for it. Or men like OP that had something bad happen to them and he dehumanizes all women with the attributes but not men with attributes of his bullies. On the other hand I never heard stories of women not finding a partner and blaming men as a collective. Also sooo many women are assaulted by men, yet they are still able to see men overall as humans. Why is it so easy for men to dehumanize women? Why don’t women do the same? Wth is wrong in society and the way men are raised?", "that \"humanizes her\" line solidified to me that this is a YTA 🤦‍♀️ like... really? you struggle to view your daughter as a human being because she's tall, and imagining her as a fragile little girl is the only thing that gets you through it? jeez.", "That's when I stopped reading and came down here. OP is a piece of work. Definitely needs even MORE therapy if this is what they truly believe.", "My guess is that he doesn’t actually even view short women as humans if he can view tall women that way. He probably just views them as weaker and better able to control.", "Thank you. That line made me uncomfortable as well.", "Right? It was his brothers and father that gave him a hard time, men. Yet he takes it out on women? Gross.", "A lot of the teasing and bullying short guys get relates to how they're never going to find romantic partners because people don't want short guys. There is a lot of media out there about women wanting a tall guy, it's worsened due to dating apps where men under a certain height don't get any matches at all because they're auto filtered out of searches. Some men can't handle this if they're unlucky in love and start to believe it's only their height - once they're able to move past that, things turn around for them generally, but it's a body issue that people can have and it's valid.\n\nI'm not defending OP in the least here because he has some serious trauma that he's projecting onto his daughter and absolutely should not do that - but as someone who is of similar height as OP and dealt with this kind of thing when I was a teenager, it's not unusual or uncommon that it's more of a response against taller women than taller men.\n\nETA: I feel I need to add here that understanding an event or phenomena and explaining that DOESN'T equate to accepting or excusing it. It's just how it is.", "Agreed. The comment about only being able to humanize his daughter because he saw her grow up and doesn’t see her like “other tall girls” is concerning. \n\nGet some help, OP. Girls and women over 5’6” aren’t out to get you. We’re not some monolith of evil. YTA, but this is a treatable issue. Maybe not in time for the wedding, but doable in the long run. I’d advise you to skip the wedding altogether if it’s going to re-traumatize you.", "My question is, if he has such a phobia against women taller than him, how does he function at all at events like weddings?", "also, there are (likely) going to be women taller than him in heels at this wedding. What is he going to do? Take a bat to their knees? Forcibly remove their shoes?", "It's not even just heels if she's close in height to her father. Certain types of running shoes or sneakers would make her taller than him.   \nDaddio needs some serious therapy. Gentle YTA.", "My dad jokes about it now, but I’ll admit, it’s weird being taller than my dad. I’m 6’1-6’2ish and my dad is probably 5’9ish. I don’t really wear heels often, but it’s not because my dad throws a fit about it.", "this makes me wonder what ops plan for his daughters wedding has been, to force her to wear flats or he won’t come?", ">After all, dynamite comes in small boxes.\n\nI mean, sure, but more dynamite comes in bigger boxes.", "This is really important OP! If she gets married, are you going to ruin her day by insisting she doesn't wear heels???? It's not about you.", "The answer is yes, yes he would love his daughter less if she was taller than him.\n\nAlso he treated the fact that she grew tall as some huge unpleasant, and near traitorous, surprise. Did no one ever tell this dude that you can pass on genes from your family that aren’t prominent in you. Her height gene probably came from him.", "Did you mean to respond to my comment calling me an AH or is OP the AH?? I’m confused..\nEven if she is the same height, he is projecting his issues on his kid.", ">seems like OP’s approach risks making her self-conscious about her height in the same way his family bullied him around that age.\n\nIt might already have done so, as he says he's been \"been silently preventing my daughter to wear heels or any kind of shoes that make her appear taller than me.\"  He said it hasn't been an issue because she hasn't wanted to, but kids notice disapproval (and perhaps that's *why* she hasn't wanted to).  \n\nOP, gentle YTA.  Please get therapy for this -- you deserve to not be held down by your past traumas, and to not have them interfere with your enjoyment of time with family and friends.  If you're really worried about the wedding, you could get lift shoes to put you a couple of inches taller for the event (or for whenever you wish).", "I laughed at that too. If she's 2 inches taller than her 5'4\" wife, then she too is 5'6\" and they're the same height.", "lol he couldn't even bring himself to type out her height, the mental gymnastics this man is doing", "Came looking for this comment!!!", "Yep this is the one that made me gag. does he realise that he is talking about his daughter? He needed to humanise his own daughter?", "This is the part that made my jaw drop. “Knowing her since she was a baby” lol Wut.", "Not the right award for this, but that sentence made me want to vom. There’s just random average sized woman going about their lives being vilified by this man because he won’t seek therapy. \n\nHis poor daughter", "I tried to ignore that. From a father.", "Especially considering 5’6 isn’t even tall for a girl.", "Damn, I'm 6'4. Where were you girls when I was younger? Lol 😆 🙃🙃", "I had a big growth spurt at that age and didn't stop growing till I was 19", "My husband and I are the reverse from you. He's just shy of 6'4\". We're expecting our daughter to end up in the 5'9\" range eventually. (Just realized it wasn't completely clear I'm female in my post). \n\nBut my sister in law is 5'10\" and her husband is 5'11\" and she wears heels. He used to be insecure about it,  but he got over it. \n\nAnd I mean, you chose to be with him. That should be flattering! At 6'4\" you're unlikely to find many men taller than you, true, but if you wanted somebody taller or closer to your height you wouldn't have married him. You chose HIM and the height was not a deal breaker.", "Thirded. Vehemently!!!!  \n\nI totally understand that the experiences we have in childhood stay with you forever. But **nowhere** in your post have you said anything about dealing with this trauma other than marrying a woman shorter than you. \n\nEverything you write about your daughter and boys is just a deflection from YOUR issue. It’s 100% a YOU issue, and not your wife’s, and definitely not your daughter’s. Even if your daughter wasn’t “talented”, etc, she should still be allowed to wear heels if she wishes!!!\n\nFor everyone’s sake, but especially your own, sit out the wedding, shut up about heels, and **go to therapy.***", "I think you're misunderstanding my statement here. My point is, she's 16. Practically an adult. Plenty old enough to wear heels.", "Oh god. You're right. Oh GOD", "Megustalations!", "Hail Gein!", ">Or what if he has a grandchild that’s taller than him?\n\nBy the time his grandchildren are teens or adults, he'll probably have shrunk enough due to old age that they will be. That's just a fact of life. In \\~20 years his daughter will probably be taller than him too. He'd better learn to cope.", "And the latter guys don’t realize that their attitude is why they’re alone, not their height.", "It's especially weird considering that (based on his own account) it was *men* who bullied him/enabled his bullying. Yet all his resentment seems to be directed at women - including his own daughter. He never mentioned struggling to \"humanize\" men over 5'6.", "You’re right, it’s super disturbing and part of a larger trend. We as a society, and especially men, need to take a close look at these kinds of dynamics and what is going wrong and how we can fix it. \n\nIt’s wrong if OP was tormented by his own family for his height but even more wrong that he now takes it out on any woman taller than roughly 5’5” (can’t be taller than him and I’m sure being as tall as him is also questionable) to the point he views them differently and needs to check himself when his own daughter’s heels make her taller than 5’6”. Jesus Christ it’s disturbing. Men with attitudes like this kill women. I am NOT saying OP is going to kill anyone but this type of attitude is the one you see in those who do, it’s the incel-type thoughts.", "Yeah, and about half of the adult female population in the US is going to be this tall or taller, so he really needs to get help. \n\nInfo: In what ways do you *dehumanize* women who are as tall or taller than you?  \n\n\n&#x200B;\n\nYTA. Your wife is right. If you can’t deal with this yet, you need to stay home. Otherwise you are continuing put issues onto your own daughter, because let’s face it, I’m certain you have already managed to make her feel like she is too tall. There is no way she has grown up with someone as neurotic as you about women’s height and not managed to internalize some of that neurosis. You’ve probably given her the female equivalent of a “short guy complex” at this point. Do you really want to make it worse?", "The sad thing is, I've dated and been very attracted to men shorter than that. But I've also had some of them subject me to the same kind of insecure, controlling, self-obsessed behavior that OP is subjecting his daughter to, so I'm very reluctant to be romantically involved with one ever again.\n\nOP, break that cycle and definitely skip the wedding if you can't get your feelings and behavior under control. No one is excluding you because of your height; they just don't want to deal with your wildly unfair and irrational demands of them. If you ever want to repair your relationship with your family, women in general, and *yourself*, you're gonna have to get that distinction through your head.", "What gets me is that it was MEN who emotionally terrorized him. His brothers and father. Yet he blames WOMEN.", "Now I know why some short men are so nasty to tall females, I am 5' 12\". And yes we have had to hold our own against these assholes many times. YTA", "It's always weird being taller than a parent or caregiver.\n\nYou spend so much of your childhood being tiny in comparison.  My cousin's boys were all 6 ft tall before they turned 13.  I just about cried when I came home from college and realized I could no longer throw the youngest over my shoulder or give any of them a piggy back ride.\n\nBut ...  That's just the nature of growing up.  That's not anything they did to me or anything they had any control over. They're still the goofy kids I love.", "No I put YTA there cause I wanted the bot to count my vote. I wholeheartedly agree with you.", "There’s a weird dominance thing involved, speaking as a short woman who this type of short guy thinks they can finally push around. Jokes on them but Napoleon complex is a thing and it sucks.", "Exactly! It’s all in the attitude. Plenty of short guys have no problems finding women to date.", "Seriously! If there’s something about yourself that you can’t control, lean into what you can and the right people will find you and love you all the same!", "Exactly 💯%. Not to mention, there’s a good chance she could get a bit taller before she’s done growing. Will OP completely shun her then? OP get therapy ASAP and buy some lifts for the wedding.", "I like to call that the \"Tall Girl Complex\", my ex-boyfriend was insecure about his height and took it out on me for being taller than him (I'm 6'0) and it led to very discrete emotional abuse that most people didn't pick up on, leading me to think that no guy would love me because I'm tall.  \n\n\nIn this case, the dad is \\*definitely\\* the asshole and I'd definitely suggest getting therapy. I'm taller than my dad, which he admitted surprised him because no one in my family expected me to be this tall, but he never tried to control what I wore or how I acted because of it.", "My wife was very concerned about this when we first met as I am significantly shorter.\n\nI like my Amazon ;P", "Please use either men and women OR male and female. Men and females makes one gender sound like a biological specimen you’re studying.", "5'12\" is 6'.", "My brothers are 6’6 and 6’0 but we do get our height from our mothers side of the family. My mom is even taller than my dad. But we have totally gotten used to it and it’s just how we are. It’s not like we got to decide how tall we are. Bc I wouldn’t be 6’2.. it’s hard to find jeans for my long legs!", "I’m 5’7”, my eldest child is 6’3 or 6’4…\nMy bio father is/was 6’, and my Ex-Wife’s dad and grandfather were tall (6’ and 6’3 respectively), so the height gene skipped a generation.", "A lot of people don’t know this, but the bot only counts the top comment. So since you were replying to another comment, your vote can’t be the top comment and therefore the bot doesn’t count it.", "Alrighty! I would have taken the judgement, but it was a little unclear for me! 🤣", "Oooh, big time.\n\nI don’t avoid short men. I’ve dated them and it hasn’t been an issue. The real insecure ones tel on themselves early on - the ones who won’t let you wear heels (one even resented my docs, for fuck’s sake) - will bring up height on the first date. One guy who was clearly maybe an inch taller than me kept insisting he was 5’8”. Like bro… 5’8 is head and shoulders taller than me. You are NOT 5’8, and I didn’t have an issue with it until you made it an issue.", "No she won't because OP magically stopped her from growing once she reached his height. /s\n\n*My wife is 5'4\" tall and my daughter is currently 2-inches taller than her mother. That makes her almost exactly the same height as me. I never expected her to be so tall but I have been able to remain mostly calm about it.  Since she stopped growing a couple of years ago, I have been silently preventing my daughter to wear heels or any kind of shoes that make her appear taller than me.*", "Noooo? Really? No shit Sherlock! /s\n\nInterestingly a lot of men tell me I can't be 6' because they are 6' while they are shorter than me and this is why I know I am 5' 12\". They don't argue with me if I tell them I am 5' 12\".", "Lol, yeah.  You sound like my cousins.  Trying to find rental cars that fit or fly to travel is always awkward.", "Sorry for the confusion!"]}