{"id": 4333, "submission_id": "zgyj14", "title": "AITA for using a handicapped spot in a target parking lot?", "selftext": "Hi, as of about a year ago I (17M) have been dealing with pretty bad chronic pain. I visited the doctor about it and she confirmed that this was chronic and therefore gave me a handicapped sticker. She gave me the choice of getting a cane or something akin to it but I unfortunately don’t have the money to cover it and my insurance sucks. So it’s not very obvious that I’m disabled. \nNow to start off context is needed. I was skipping school (it’s my senior year and we weren’t going to do anything all day) and I decided that going to target would be fun. So I drove there and parked in a handicapped spot. I was in target for maybe 40 minutes to an hour before I got bored and checked out. I was walking out to my car with a very clear limp in my step when I noticed a lady standing right by it. She had to have been in her 40’s. \nI walk up to her and ask if she’s okay and she goes “no I’m not okay actually, I couldn’t help but notice you getting out of your car earlier. You seem a bit young to be in a handicapped spot.” I was curious as to why she stood there for an hour just to confront me, but regardless she was fairly nice about it so despite by discomfort I explained to her that I have an invisible disability and it’s hard for me to walk.\nShe ended up getting into my face and saying “so why don’t you have a cane? Of a wheelchair?? Just admit that you’re a fucking liar!!!” \nI. Was. Flabbergasted. \nAt this point I’m done with this lady’s bullshit so I look at her and tell her “aren’t you a bit too saggy to be in a 17 year olds face like this? Back the fuck up and get a life bitch” She didn’t take kindly to me calling her saggy and so she yelled at me about how other people need it more than I do (at this point I was struggling to stand, how ironic). So I just get into my car and drive off.\n\nI do feel kind of bad for calling her saggy and a bitch (even if she was) and I do know that there are more people that are more disabled than me. Am I the asshole, Reddit?", "created_utc": 1670595550, "permalink": "/r/AmItheAsshole/comments/zgyj14/aita_for_using_a_handicapped_spot_in_a_target/", "score": 214, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I need to know if I was an asshole for responding as aggressively as I did to this woman.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Some people really need to get a fucking life. As long as you have a sticker, you are good to go. People have different disabilities.", "NTA.\n\nNext time just say very confidently to someone \"the disabled placard is approved by a doctor.  Not you.\" And move along.  If you had the sticker, she had no business confronting you.  Only a police officer could do that and once they determine the placard was issued directly to you, they'll leave you alone too.", "NTA \nI have multiple autoimmune disorders~ disability for 14 years... I still have yet to get a disability parking pass ...  due to people like that... 😡 I don't use a cane or wheelchair yet and don't want to deal with anyone saying that I don't need to use the handicapped parking space... so at times when I'm in a lot of pain, I drive around til I find a space close enough so I don't have to walk too far... but I think I'm getting to the point where I have to give in ...\nSo I applaud you 👏 👏👏👏", "NTA. Your disability is none of her business. She needs to get a life.", "NTA\n\nYou had every right to park there.\n\nDid the woman need the spot or was she just complaining?\n\nYour answer was not the best, but I might also lash out in that situation.", "NTA do not feel bad at all, as someone who has an invisible illness and also suffers from chronic pain I feel for you. But you have every right to be in the bay ignore her and there will be many more haters but you handled it well. Keep going I do hope you find some relief for your pain.", "Wow this person should find something better to do with their time and mind their own business. \n\nNTA", "NTA And a good response to people like this is, \"You aren't my doctor, so mind your own business.\"", "NTA. Turnabout is fair play. Once she calls you a liar, you're free to name call.", "NTA\n\nIf you have the placard to be there then the convo is over.", "NTA - if you have the sticker that lets you legally park in a handicap spot, you are under no obligation to explain your medical issues to some random dipshit. Just tell them if they’re that concerned, call the police, otherwise, mind their fucking business.", "NTA. I totally feel you. Got a chronic pain condition and didn’t get a cane for a while (also young person). People pulled crap like that all the time. \n\nPeople need to learn to mind their own damn business. It’s very understandable you were mad. Can’t be dealing with people‘s bs when in pain. (Especially when being wrongly accused)", "NTA. Next time call the police. If you have a Salvation Army or goodwill close by you might be able to get a cane from there cheaper than elsewhere.", "NTA. While I think the situation could've been handled a lot better, the lady was handling this in a very immature manner. Think of it: She got up in your face and yelled at you for being handicapped.. and parking in a handicapped spot. Does that sound right? You're not in the wrong, she is.", "NTA - A medical professional deemed you handicap enough to refer you a plaque stating such. Anything more is no one else's business. Pain does not discriminate by age.", "NTA. She made this personal and you retaliated. It's obviously not *kind* to say mean things, but she can't just demand your medical history from you. As long as your sticker is clearly posted, you have every right to park there without interference.", "Was your handicap stocker on your car?", "NTA\n\nchronic pain is already a hard enough affliction without strangers screaming at you and preventing you from getting back in your car. Also super creepy that a grown adult waited for almost an hr to berate a teen she doesn't know.", "NTA.  You qualify for the spot, so that lady can go F off", "NTA. Some may argue that name calling is petty but I don’t give a shit. She started it. Kindness rarely works on assholes.", "Nta", "NTA. You're right, not all disabilities are visible. you don't have to explain everything to everyone. it was none of her business, but you took the time to give her an answer. She didn't like the answer so turned to verbal abuse. She clearly had nothing better to do with her day, but wait by your car for an hour and shout at you. I would have called her worse than saggy", "Nta\n\nDisability is hard, and people questioning you because you don't look disabled enough is rough too. That being said it took me a long time to come to terms with my mobility issues enough to get a cane and I have found it helps a lot on my bad days. You can get collapsible ones on Amazon for less than 20 bucks (I didn't want to spend a bunch of money because I didn't know if I'd actually use it, and I still feel really self concious about it and dont use it as much as I should) and they fold up small enough to fit easily in a backpack. \n\nI'm not trying to say that you need to prove it by any means, obviously that lady was way in the wrong and you reacted as any person being falsely confronted would, just some friendly and cost effective advice from someone who also suffers chronic pain that affects my ability to move around.", "NTA\n\nI hate revenge name calling, really I do, but I always understand the impulse.\n\nShe was simply wrong. It isn't her business. You have the sticker. She can fuck all the way off.", "NTA. You reap what you sow. She was all in your face, and you reacted accordingly. There were better ways of dealing with her, sure, like pointing to your sticker, or sticking to the point without resorting to insulting her age and appearance, but this isn't Utopia and we don't all live off of sunshine and unicorn tears.", "NTA. The fact that she had no qualms about confronting and berating a 17-year-old speaks volumes. Had this been her child,  she would've lost her mind. I'd talk with store managers and law enforcement with your parents present.  Explain how an adult accosted you for parking in the handicap spot. Because of this, you don't want any other issues like this to happen again. You fear for your safety as someone underage and deemed disabled by your doctor.", "NTA. You have a placard, you're allowed to use the spaces", "NTA You didn't need to give her a single second of your time. She's the AH and deserved anything you said when she decided she knew more about your medical condition than you and your doctor.", "NTA this happened to me at sams and an old lady tried took a picture of my license plates and threatened to call the cops. I’m 35 and if you see me it looks like I don’t have anything wrong but I have bad knees worse after surgery now. People are just to quick to judge because they see young", "NTA. You could have called her far worse after her performance.", "Oh honey no. Your disability, no matter is visibility level to others, is always 100% your business and never some ransom strangers. \n\nYou had your pass and she was just an ass NTA", "NTA\n\n&#x200B;\n\nYou handled her well, and were far to friendly. But in the future stick to: \"LLeave me alone, or I will call the police\".", "NTA but you can get a cane for like $10 at target if you need one. I got one at Walmart for my dad.", "Did the other people in the parking lot clap?", "If this is real, NTA for parking in a spot that you are allowed to park in. Y T A for skipping school.", "Yes and no.  The lady was an a-hole for questioning your disability because, as you indicate and are correct, there are many hidden disabilities.  However, your response to her a-hole-ry wasn't great either.  Next time, take the high road.  Showing her the handicap sticker and reiterating the definition of hidden disabilities with an example or two would have been better.  Lowering yourself to cussing and insults just makes you look as if you have anger control issues or are rightfully being put on the defensive.\n\nAlso, if you expect to have this issue long-term, you might consider purchasing explanatory cards from this organization that you can just hand out without a word when you encounter a-holes like this:  https://hiddendisabilitiesstore.com/us/shop/make-it-yours.html", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi, as of about a year ago I (17M) have been dealing with pretty bad chronic pain. I visited the doctor about it and she confirmed that this was chronic and therefore gave me a handicapped sticker. She gave me the choice of getting a cane or something akin to it but I unfortunately don’t have the money to cover it and my insurance sucks. So it’s not very obvious that I’m disabled. \nNow to start off context is needed. I was skipping school (it’s my senior year and we weren’t going to do anything all day) and I decided that going to target would be fun. So I drove there and parked in a handicapped spot. I was in target for maybe 40 minutes to an hour before I got bored and checked out. I was walking out to my car with a very clear limp in my step when I noticed a lady standing right by it. She had to have been in her 40’s. \nI walk up to her and ask if she’s okay and she goes “no I’m not okay actually, I couldn’t help but notice you getting out of your car earlier. You seem a bit young to be in a handicapped spot.” I was curious as to why she stood there for an hour just to confront me, but regardless she was fairly nice about it so despite by discomfort I explained to her that I have an invisible disability and it’s hard for me to walk.\nShe ended up getting into my face and saying “so why don’t you have a cane? Of a wheelchair?? Just admit that you’re a fucking liar!!!” \nI. Was. Flabbergasted. \nAt this point I’m done with this lady’s bullshit so I look at her and tell her “aren’t you a bit too saggy to be in a 17 year olds face like this? Back the fuck up and get a life bitch” She didn’t take kindly to me calling her saggy and so she yelled at me about how other people need it more than I do (at this point I was struggling to stand, how ironic). So I just get into my car and drive off.\n\nI do feel kind of bad for calling her saggy and a bitch (even if she was) and I do know that there are more people that are more disabled than me. Am I the asshole, Reddit?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "[removed]", "[removed]", "[removed]", "Thank everyone who’s replying so far, and thank you all for the genuine criticism in how I myself responded. I appreciate you guys 🫶🫶", "I'm middle aged and ooverweight. And was hit by a car a few years ago. I was struggling to walk and some jerk said \"hey fatty, get out of my way\" because I wasn't fast enough for him. That was nasty. \n\nDon't worry about people like her. You have a handicap sticker rhats approved because you need it. You don't owe anyone an explanation. It's none of her business or anyone else's.", "NTA. I worry about this sometimes. I have a chronic condition and a tag too. I only use it when having flare ups but it’s not obvious. You reacted better than me; I don’t do well with confrontation.", "NTA. You explained yourself once (not that an explanation was necessary with a handicapped sticker) and she escalated. She's the asshole.", "Nta. You have the sticker, the rest is none of her business.", "You have the sticker because you needed the parking. You did everything you needed to do to legally get this parking space. You wouldn’t have had to call her saggy if she wasn’t such a gigantic asshole to you! Disabled people do not owe kindness to people who do not show them kindness. NTA.", "Your response was appropriate and proportional to what she said and did.  There are a LOT of people with disabilities that aren't immediaely obvious (I used to work with an organization that assisted people with mental and physical disabilities,and it was a  learning experience to say the least!)\n\nNTA.", "Funny, you don’t look disabled. I have a “hidden disability”.  Up until a double lung transplant, I was unable to walk long distances without needing to stop to catch my breath. This qualified me for an HP Placard. I looked healthy when I left my vehicle, until my breathing caught up to me. You qualify for a placard just as much as I did. The public, especially saggy women, need to understand that there are many of us with “hidden disabilities”. \nYou are definitely NTA and are entitled to se your placard.", "NTA a hundred times over. Signed, someone with severe chronic pain and mobility issues", "Since you had a valid placard/sticker/etc then NTA", "NTA as long as you have the handicapped indicator visible.", "You have a placard that you use for yourself, if you need it use it if there are times you don't need it don't use it, or use it that what it is for.  But do keep in mind that Van accessibility is few and far between so if you can avoid parking in the van accommodating spots do that to the best of your ability.", "Although this kind of thing happens all the time, this post feels super mad up.\n\nYTA", "Don't believe this story as writ, but yta for thinking you're never getting old.", "Why can't you get a cane?  There are several types available on Amazon for under $20.  I paid a little more for mine cause it has one of those fancy little feet, but still it was only $40.", "NTA. “Where did you go to medical school?” is an appropriate response to these people.", "My favorite catch all is saying \"....do I *know* you‽\" loud enough for passersby to hear & then continuing on with my life. It's short enough to just blurt out instead of trying to compose any medical/legal argument", "Ignore the “yea ofc” I replied to you accidentally with the intention to reply to someone else. I didn’t know if she needed the spot", "Yes. My SO works at a Goodwill and he told me that medical aids are anywhere from free to pennies on the dollar compared to retail prices. Also, employees (at his store) earn pink money every month they meet their quotas and employees do donate some of that to store's Help Fund - just ask an associate if it's available. It's for people who are financially strapped. Please don't be embarrassed.\n\nYou're NTA. The woman definitely is one. Here's a sentence I've seen mentioned in other posts/comments: \"I have a disability placard that I received from my doctor. I have a hidden disability. I do not have to tell you my medical history. I'm sure you do not want to give me details of your medical history. If you have concerns, call the police.\" Then get in your car. Repeat the phrase about calling the police if the person continues to harass you. If they block you from getting in your vehicle, state that they are blocking you from entering your vehicle and they need to move or you will call the police and report harassment and intimidation. If you don't feel comfortable, return to the store and ask for a manager and ask for an escort. If you're unable to return to the store because of your disability, set off the car alarm and ask a passerby to call the police or ask for a store manager.", "Yes it was", "I’ll definitely look into that, thank you", "I probably won’t take legal action but thank you, genuinely.", "Oh god I’m so sorry :( thank you", "I’m very tall so the ones at Walmart don’t work very well for me :(", "I know I shouldn’t have skipped, however that’s also not what this post is about 💀", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Next time, I suggest looking them dead in the eye and just sadly saying “I wish that were the case” when someone says you are too young to be handicapped. If someone threatens to call the cops use “You do what you think you need to.”\n\nYou do not owe her or anyone else your medical history.", "Believe what you wish, but as you said, this happens all the time", "If she stood there waiting for you for an hour, I’m going to guess she didn’t need the spot that badly. Don’t feel bad about what you said, she was looking for a fight.", "Then NTA.    She deserves what she gets", "Ah, okay. That's fair. Dad usually makes his own, carving large sticks. However, his was stolen, so I grabbed one for him while out.", "The thing is that I can’t confirm whether or not she actually stood there for as long as I was inside, or if she saw me get out, did her shopping, saw my car was still there, and came out. Either way I thought I should tell", "Honestly it doesn’t matter either way. I was just pointing that out to be snarky. You have a pass and you have every right to use. And of course someone your age can be disabled but also someone your age (or any age) could have a broken leg or something like that and have a temporary handicap pass. If she’s too stupid to think that through… well she must have a very frustrating and annoying life, but that doesn’t give her the right to yell at you. You responded in an understandable way. Don’t stress yourself out over this.", "Right that’s fair, thank you, honestly.", "NTA, as someone with invisible disabilities this is unfortunately a common occurrence. \"You're too young to be sick/disabled or you don't look sick/disabled\" are comments that happen regularly. Good on you for not putting up with her bs and throwing back in her face. I use a walking stick instead of a cane when on walks with my husband because I'm very confrontational and I know I won't be nice in the slightest to people like this. I hope you're able to find something that works for you and helps with your chronic pain friend!", "NTA and as someone who’s young and whose handicap is also chronic pain (CRPS), i’ve flat out stopped being polite to assholes like that. There’s no age limit/minimum on disabilities and pain and it’s none of her business anyways. Also….if you’re looking for affordable canes, walmart sells pretty patterned ones for cheap.", "NTA. What is ***with*** people? Being physically handicapped does not start at a certain age, it can even happen to infants!", "NTA. Why do people make this their business? You have the placard. Sure, it could be a parent’s or something - but that’s not up to her to police.\n\nThis post also made me fondly reminisce about being in highschool and skipping class to go Walmart lol.", "Well sometimes people ask to be given insults. If she was able to stand there waiting for an hour just to berate you then she was less in need of the space than you. People need to remember not all dsabilities are obvious. NTA.", "NTA but why didn't you just show her the handicap sticker?", "NTA please if faced with a situation like this again call shop security or police.  Being a younger person with a disability can be hard especially when some people only belive older people can be disabled.  With people like this let security deal with them and call the police if they are stopping you form accessing your car, touch you or start becoming threatening.  You have every right to use that space as does anyone with a disability badge, noone other than the badge issuer has a right to tell you if you have a right to a badge.  I have had my share if idiots saying things like I'm too young to be disabled amd frowning looks till I start struggling out of my car with my stick.", "NTA. \n\nI have chronic pain as well, invisible illnesses are the WORST. People get so goddamn judgmental and always assume you’re lying because they can’t physically *see* anything wrong with you. It’s demeaning, frustrating, hurtful and can just plain tip you over the edge now and then. You’re absolutely not in the wrong for getting fed up and snapping at a rude old dustbag who had ZERO business trying to stick her nasty nose where it definitely doesn’t belong.", "NTA. **90%** of disabilities are invisible, and how could she have known if you were an ambulatory wheelchair user, for example? She needs to be taught a lesson.  Maaaayyybbeee, it wasn't the best response because she could double down instead of being open-minded but whatever.", "NTA. Not all handicaps are visible to the eye.It’s not her business.", "NTA - she was being rude, although next time thank her for offering to buy you the cane you need since you can’t afford it 😉", "NTA. I have had multiple back surgeries & I have lupus. You can’t see that I’m sick just by looking at me. I get nasty looks all the time. It sucks. People need to mind their own business.  On my good days when I can move with less pain I will park farther away but when I’m hurting I will absolutely use the disabled parking spot. \n\nThe Dr thought that you needed the handicap sticker. You shouldn’t feel bad about using it. I hope you feel better soon.", "NTA.  I assume you had a valid handicap placard hanging from your mirror.  It's none of her damn business what your handicap is.  She was incredibly rude for confronting you and you had every right to be pissed and nasty back to her.\n\nMy wife is in a similar situation.  She has some major issues but they aren't visable to the outside world.  Had a guy try to give us crap one time and I told him that her medical condition is none of his fucking business, that we have a valid handicap placard and if he doesn't like it - he can call the police.\n\nPeople like this are just jerks.  I hope you can find an answer for your pain.", "NTA This woman really had the audacity to wait for you for almost an HOUR to confront you about being disabled? That's disturbing. I would have gone off on her too.", "NTA. She had no right to judge you. How does she know how much pain you are in? Your age doesn't matter,your parking sticker does. You had one. The rest is absolutely none of her business. She needed to back the hell up and you told her as much. You did nothing wrong.", ">  I visited the doctor about it and she confirmed that this was chronic and therefore gave me a handicapped sticker.\n\nDidnt need to read past this. NTA", "You’re not an asshole but you’re pretty dumb for thinking you may be the asshole in this situation… I mean like seriously? You’re handicapped, so why would you be an asshole for parking in a spot dedicated to people who are handicapped. Like ??? Do you hear yourself?", "NTA.  Your doctor approved this and it's his license on the line if he does so without a medical reason.  Anyway, you can find canes at Walgreens pretty inexpensive.  But, they are a pain, so if you can get by without one, I would hold off as long as possible", "Exactly. A medical professional decided you should have it. It's not anyone else's business why.", "Oh no I’m so sorry about that. Thank you though, I appreciate this", "The ones at Walmart are too short for me unfortunately :( but thank you!", "Yeah and I would understand if she calmly asked if it was mine or my parents. I would be mildly annoyed but regardless it would be a fair question. But she just?? Jumped straight to conclusions??", "What makes this story even worse is that she was standing right in front of it 😭 maybe she thought I was using someone else’s? Idk", "I’m sorry I know this is supposed to be serious but the “rude old dustbag” SENT ME 💀", "I unfortunately dont have any way to order things online (I have no card at the moment) and the ones in store are too short for me :( thank you though", "Yes I don’t park in the van accessible spots. I would never, I park in specifically the car areas, but I did need it that day. Thank you for the advice though !", "Omg that’s perfect now I’m mad at myself for not thinking about saying that 😭", "I was wondering if I was the asshole for reacting how I did to this lady but okay 😀🫶", "I can get by without a cane, it would be easier with one. Unfortunately I’m too tall for the ones sold in most stores. Thank you though :)", "I always upvote a well-placed interrobang.", "Thanks. It took me a long time to stop caring about what strangers think but it's difficult when people aren't happy and try to make others as unhappy as they are", "Aww sorry to hear that! I hope you’re able to find an affordable one soon! I use a knee scooter myself", "She deserved it… cmon now.", "I’m sorry for calling you dumb I didn’t even expect you to reply. But I just can’t fathom how you would possibly think you are in the wrong here. That lady is an asshole, very much so. Like it’s very obvious.", "I have rlly bad anxiety so I always think the worst possible thing in every situation. I accept your apology even if I’m still mildly annoyed at being called dumb.", "I mean maybe you could of not called her saggy although I’m not even sure what that meant. Like saggy boobs? Or saggy stomach? Lol. Yea idk I kind of just wrote the first thing that came to my mind but that was an asshole move on my part so Im glad u accept it. But yea ur def not the asshole."]}