{"id": 4342, "submission_id": "zh5gbe", "title": "AITA for telling my younger sister I am not her mother?", "selftext": "I'm 18f and have a sister 12f. Our parents aren't great people. They had me, dicked around with parenting for a bit but I don't remember them ever being parents to me. Then when I was 6 they had my sister. Suddenly I'm expected to take care of a baby. They left us alone a lot. They made me take care of her and would sometimes sit there and tell me what to do with her. If she cried I was called and my dad's parents were around and knew but did fuck all to help us. I remember being 10 and she was 4 and I was eating food and being shamed by my grandparents for eating while my sister had no food, because at the time I was trying to get someone else to take care of her. I started to teach my sister how to take care of herself a year later. So she was 5. I had to teach her to make sandwiches and how to get a drink for herself. I also had her get herself to bed by that age. My parents only got worse leaving us alone for longer stretches of time. I hated it. I resented every second of having to be a parent to my sister and when I turned 18 a couple of months ago I ran like my ass was on fire. I called CPS and talked to someone there but my sister remained with our parents and I was told there was no proof of anything negligent there. My sister asked to live with me repeatedly and then showed up at my door a few days ago and told me she needs me, that I'm basically her mom and I need to take care of her. I told her I'm not her mom and I need my own life. She told me she has nobody else. I told her I didn't either and that I did my best to teach her the stuff I had to learn on my own. She said that's mom stuff and she needs me to keep being that for her. I told her again I am not her mom and I told her I won't go back to mothering her. She ended up storming back to our parents house. She then came over the day after and told me I was mean and should do whatever it takes for her because I'm older. She also said I was so mean for saying I'm not her mom when I'm all she knows.\n\nI know I am older, I know this is hard for her, but I also know I have no desire to keep doing this. I know I will resent her if I have to spend the next 6 years taking care of her. But I also know I hurt her when I said what I did and for walking away.\n\nAITA?", "created_utc": 1670612181, "permalink": "/r/AmItheAsshole/comments/zh5gbe/aita_for_telling_my_younger_sister_i_am_not_her/", "score": 856, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my sister I was not her mother and I have said no to her living with me. This makes me feel weird. I know she has nobody else, that nobody else in the family will help take care of her. I know she's a kid and needs someone. I could do it, sacrifice going to school and go full time in my job, and take care of her. There's nothing technically stopping me because my parents would say yes. I just don't want to and paired with telling her that the person who did raise and teach her until now is not her mother... Ugh. I'm not but I did fill that role for her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nMaybe CPS will accept her word that her parents are refusing to care for her?", "NTA.\n\nCall CPS again. Make a stink. Tell them everything you wrote here, and more. \n\nThe treatment your sister is getting is called abandonment, and this is serious.\n\nIs there anyone else you can contact about this? For example, a trusted teacher who might've noticed something was off when you were little. Or a relative who has their head on straight. Or the parents of friends who may have witnessed your own abandonment/family issues.\n\nI'm so sorry this happened to you. But you aren't your sister's mother, and you also were mistreated as a kid. \n\nI wish you only the best :)", "This is heartbreaking to read. Your parents suck. As do the grandparents who watched it happen and did nothing about it. You and your sister are NTAs. Just a messed up situation that you found yourselves in.", "NTA. Your only mistake here is that you didn’t run far enough.", "If your life story could be transformed into a book, the book would be called, “*Parentified*”.\n\n**The synopsis**\n\nYour parents decided that they didn’t want to take care of their child, so they deemed you a six year old parent.\n\nYou’re now in charge of nap-times, diaper changes, and feeding the new baby. After all, according to mom and dad, this is not just your sister. She is also now your baby. \n\nYou are now officially expected to forget that you’re a child because your parents have robbed you of your childhood. They have now replaced the identity they stole from you with an expectation of adulthood. As the years go by, you forget what it was like to *just be a kid*. You don’t have many childhood memories because you spent your entire life raising an abandoned baby. \n\n**Years later.**\n\nYour sister shows up on your doorstep. She’s telling you that she’s your long, lost child and she’s reaching out to you for help. She’s still living with your parents, and it’s clear she’s also still being neglected.\n\nThe story has been left open to interpretation here. There are a hundred blank pages still yet to be written, but all that you know in the back of your mind is that *you both deserve a happy ending*.\n\nI think it’s time to finish this story by calling CPS again to get a status update and to tell them what happened. The more information you provide them, they can have more to use in their investigation. If you stand by and do nothing, your sister could still be going through abuse and neglect, and you can only do so much on your end, but you’re the only one trying to do anything about it.\n\nAfter all, your grandparents are in on this too. There is no one on her side but you. You deserve to finally have your life back, and your sister deserves to be placed with a better one who will help her move past all the years she was neglected and will provide her with one where she’s loved and protected.\n\nYou and your sister are not the assholes here. Your dad and your mom are, and they do not *ever* deserve to be parents again, and truthfully, if you look back at your entire life, in the end, they never were.\n\nNTA.", "NTA.   It is bad enough that your parents ruined your child hood.  Tell her to tell her school guidance counselor or call CPS", "NTA, I'm sorry you had all that responsibility thrust on you at such a young age. All the adults in your life are the AHs here. Please take this time to live for yourself free from their burdens.", "NTA\n\nTell you sister to tell her teachers that no one is taking care of her now that you’ve moved out. They are mandated reporters and CPS will take them more seriously.", "What a mess. But the assholes here are your parents who should not have had children they didn't want to parent. NTA. But neither is your sister.", "You're 100% NTA - this is all on your parents.", "NTA your childhood was stolen from you, don’t give your adulthood away too. You’re not responsible for this.", "NTA, you aren’t responsible for taking care of a child you didn’t bring into this world, especially at 18. you’re responsible for yourself now, and you did what you needed to do to protect yourself. yes, she may feel abandoned and hurt, but you’re not the one who abandoned her. your parents did that. even if they’re still present, they abandoned her emotionally, and they refuse to care for her. that’s on them. they’re the a-holes, not you.", "Ouch, that's very rough and a painful situation.\n\nAbsolutely NTA. Your parents are responsible for your sister's upbringing. It's not fair or reasonable to expect you to take over as a mom.\n\nAlso, legally, her showing up doesn't change the fact your parents have custody. It would be serious problems as you would need legal authority to handle anything for her school, health, etc.\n\nGood luck. Sounds like a bad situation for everyone :(", "NTA\n\ncan you move farther away? You are surrounded by people that want you to do everything but what you want to do. Remind your sister that you too, were an orphan at 12, but you had a baby.", "NTA. I'm sorry that this was your childhood. I'm sorry that your sister feels so entitled to your life because she has been so thoroughly neglected by her supposed parents. \n\nOne note: you won't come to resent her over the next six years. You already do. I don't blame you. Your childhood was stolen from you and not one deadbeat in your extended family gave a damn. If you do not want the responsibility of raising your sister anymore, then do not do it. Preserve your sanity and make your life what you want it to be. You sacrificed your early years under duress. I'm sorry for your sister but she will have to figure her own way out.", "NTA\r  \n\r  \nI'm so sorry your childhood was ruined with such shitty parents, and that it was up to you to raise your sister. I don't blame you for moving out as soon as you could and wanting to cut all contact with them. \r  \n\r  \nMy heart does break a bit for your little sister as she's now on her own. Granted you were too, but she's only known you as being there for her and someone to lean on. Now she has no one.", "NTA \n\nYou are right, it’s not your responsibility to parent your young sibling. It’s unfortunate you were stuck in a parental role, and your sister was taught to rely on you as the parental figure. I’m sure she is floundering and vulnerable and insecure now that you’ve moved out. It will be a hard transition for her to learn to be self sufficient without you there to be her caregiver and support system. \n\nStill you’re allowed to live your own life. You aren’t her legal guardian so you don’t have to taken on that responsibility. \n\nBut, would it hurt you to at least give her a little support when she needs advice or help to learn how she do something? I mean she’s still your sibling.", "NTA.  You have been tasked your entire adolescence with a parentified role you didn’t ask for or want.  It is unfair that you were placed in this position.  It’s heartbreaking your sister had to go through it as well but you have put so much of your life on hold for so long that it’s reasonable to want to break free.  I know you don’t blame your sister and I’m sure you feel bad for being harsh with her, and it’s unfortunate that she’s going to be stuck in the same position as you.  It’s unfair to both of you.  But you can’t be expected to be forced into this role forever.  It’s not nor ever should have been your responsibility.  I do encourage you to start therapy if you are able to, and perhaps get into some therapy with your sister as well, but of course that’s if your situation allows for this.  Please take care of yourself and know that this has been truly an impossible situation for the two of you to be placed into.", "NTA, your sister is not entitled to your life for 6 years. You did the right thing by calling CPS who sadly didn’t take it seriously. This is why I’m glad I am a only child cause otherwise I would have been in the exact same position", "NTA. \nI'm so sorry you both went through this. Is there a way for her to stay at a child protection home? (Idk about other countries, however there are shelters that take kids with difficult family backgrounds in)\nAnother possibility would be to get her school involved (although this could also escalate things).\nIf she wants to stay with you, but you have no wish to accomodate her for a long period, maybe she could stay on weekends.\nBut tbh- she needs a support group outside of you, maybe friends or stable, sensible grown-ups. You deserve to heal from your own experiences, so I'm glad you got a place for yourself.\n\nHope you both find a peaceful solution and wish you well.", "If this is real, have you thought about calling CPS?\n\nYour parents sound like they should be charged with neglect.\n\nNTA", "YTA\n\nIt shouldn't be your responsibility, but taking that out on her isn't good either. You're not completely st fault, but your treatment of her is atrocious.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm 18f and have a sister 12f. Our parents aren't great people. They had me, dicked around with parenting for a bit but I don't remember them ever being parents to me. Then when I was 6 they had my sister. Suddenly I'm expected to take care of a baby. They left us alone a lot. They made me take care of her and would sometimes sit there and tell me what to do with her. If she cried I was called and my dad's parents were around and knew but did fuck all to help us. I remember being 10 and she was 4 and I was eating food and being shamed by my grandparents for eating while my sister had no food, because at the time I was trying to get someone else to take care of her. I started to teach my sister how to take care of herself a year later. So she was 5. I had to teach her to make sandwiches and how to get a drink for herself. I also had her get herself to bed by that age. My parents only got worse leaving us alone for longer stretches of time. I hated it. I resented every second of having to be a parent to my sister and when I turned 18 a couple of months ago I ran like my ass was on fire. I called CPS and talked to someone there but my sister remained with our parents and I was told there was no proof of anything negligent there. My sister asked to live with me repeatedly and then showed up at my door a few days ago and told me she needs me, that I'm basically her mom and I need to take care of her. I told her I'm not her mom and I need my own life. She told me she has nobody else. I told her I didn't either and that I did my best to teach her the stuff I had to learn on my own. She said that's mom stuff and she needs me to keep being that for her. I told her again I am not her mom and I told her I won't go back to mothering her. She ended up storming back to our parents house. She then came over the day after and told me I was mean and should do whatever it takes for her because I'm older. She also said I was so mean for saying I'm not her mom when I'm all she knows.\n\nI know I am older, I know this is hard for her, but I also know I have no desire to keep doing this. I know I will resent her if I have to spend the next 6 years taking care of her. But I also know I hurt her when I said what I did and for walking away.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I’m so sorry OP.. the only AH’s here are your parents!", "I'm so sorry for both of you. You both should have someone that takes care of you and its totally understandable and healthy, that you drew a line now and put yourself first for once. It sucks for her, but so it does for you and at some point you also have to take care of yourself. \n\nBoth you and your sister are no A-holes in any way. Just both victims of abusively neglecting parents. I won't even call them assholes, because they are so much more than that. \n\nAsk CPS for help again and tell your sister to call there herself. They might start to act if the complaints repeat and come from more than one person.", "INFO\n\nHow exactly did your sister A) know where you were living and B) get herself to your doorstep?\n\nSomething about this story doesn't make sense.  She's 12.\n\nhow does a 12 year old find out where you live and then cross a city to find you on her onw?", "nta\n\nOh gosh poor you. Poor her.  Poor both of you.  \n\nShe's going to be really hurt by losing you as a caregiver *which is not your fault*.\n\nShe hasn't been given the tools to healthily address this *which is not your fault* so she's destroying the relationship instead of finding a way to respect your needs, which has to happen.\n\nOffer to make a report with her to CPS documenting what she's experiencing, and to go to her school guidance counselor with this.  (If anyone knows a better person at school please comment but frankly everyone at school should be a mandatory reporter anyways)\n\nYou are absolutely right that you need to live your own life.  It's not your fault that your parents failed you and now she's being hurt by your reasonable behavior.", "NTA\n\nThis is such a sad situation. You deserve a life of your own.", "NTA", "YTA. If you're the older sister and she's your sibling then you should be responsible for taking care of her either way. Even if your parents are bad at it. Especially if she has no one else.", "NTA.  \nYour sister is now 12. As long as the home isn't abusive, and there is food and warmth and clothing, then she can survive.    \nCan I suggest that your home be open to her, \\*as a sister\\*?  \nLike, make it clear that you are not her mom, but that your home is there for her to visit, and occasional overnights. Maybe the odd call to help with homework. But that you deserve your own young adult life.   \n\"I love you. I want you to succeed. And I need you to love me enough to want \\*me\\* to succeed too! This is our first chance to be sisters, and I want you to be my little sister.\"", "As sad as this sounds, I was thinking the same thing. I know this will probably get me downvoted but have you thought of moving somewhere far and not telling anyone. Delete all social media, change your number and just start fresh.", "Yes, I mentioned that I called CPS but they kept my sister with my parents because of a lack of proof of anything neglectful.", "Did you read the post?", "How did she take it out on her exactly? All she said was no I'm not your mother.", "Are you insane?  She was parentified starting from literal childhood and you think that her finally hitting her breaking point and snapping is atrocious? \n\nWrong.\n\nThe parents who put her in this position are atrocious.  She had zero childhood and now is trying to piece together some sort of life that doesn’t revolve around nonstop caregiving.  She hit a breaking point like us all and calling her an AH over it means you probably have zero idea what it feels like to be in her position. She’s not even a little at fault for wanting her own life.  And being forced into parenthood for a child that isn’t yours and being expected to continue mothering is unfair. I’m sure she feels guilty for snapping at her sister but honestly this was building up because she had been forced into this position she didn’t sign up for her entire life.  Parents using their children as forced labor parenting is some real bullshit.", "It’s not her responsibility. Point blank. No one can put this on OP as her fault. Their parents are the only AH’s here. OP is 18 and deserves to finally live for herself.", "WTF? OP being parentified (WHICH IS ABUSE) doesn’t mean she’s responsible for taking care of her sister any longer. OP being the older sibling doesn’t make her the mother.", "Absolutely not. The PARENTS fucked up and didn't raise either of their kids, they left it for the 18 year old to do for the younger.", "Oh, what a pleasant surprise. I didn’t know OP’s mom was on Reddit.", ">If you're the older sister and she's your sibling then you should be responsible for taking care of her either way.\n\nUnless OP birthed her, she's not responsible for her sister. Not forever or even long periods of time", "Who was responsible for her? How can an 18 year old support both of them?", "No she shouldn’t!!!", "No , that’s not a siblings job especially if they moved out.", "BULLSHIT", "Why is it her responsibility? CPS should be doing something about it, but their lack of fixing it should not fall on OP", "Not taking care of her own younger sister who's only 12 is what I'd call abuse to be honest. \n\nShe's the older sister of someone who has no where else to go. If the parents are incapable of fulfilling the job, then she should be. She's the older sister and clearly the younger one had no where else to turn to, on that basis the OP should be obligated to taking care of her sister (to be quite frank I find it quite shocking and morally unethical that this question was even brought up, but that's not the point of the discussion here). Also, she doesn't have to mother her, taking care of and being a mother are two different things. The OP is just coming across as self- centred and bitter, taking the bitterness she has for her parents out onto her sister.", "Okay. So the 18 year old should be correcting that and taking care of her younger sister so that the same that happened to her doesn't repeat.", "Could be the sister too", "Doesn't really matter. She's closer to her then pretty much anybody else on this planet. If the parents are unable to, then the duty falls on to her. I say this but really it shouldn't even be a question. Its her moral duty to be taking care of her own sister.", "She's legally a adult? Anyways the OP has not mentioned whether the parents are also refusing financial support so we can't be sure about that.", "It is a siblings job. Especially if said sibling is the older one. As the OP said her sister has no one else. She is obligated to taking care of her sister.", "She's the older sibling? She has a bigger obligation of taking care of her own sibling that she's lived her entire live with then some random strangers. What is even the question here? The younger sibling herself came to her, not the CPS. Its clear she would not want possibly get rehomed.", "*Hi there!*\n\nI just wanted to stop by to let you know that we have a special, heartwarming Christmas Card to read to you from all of your AITA friends at Reddit!\n\n*opens card and clears throat*\n\nIt says, “*You have no idea what you’re talking about. Children are not responsible for parenting their siblings. Parentification is a severe form of abuse.*\n\n*BTW, are you OP’s mom? Asking for a friend.*\n\n*Merry Christmas to the people of the world, including you because you’re also an asshole.*”\n\nThat’s it! Have a great day!", "No.\n\nThere are legal issues involved for starters if she would even be allowed. And frankly not the responsibility of the 18 to have to raise the sister, she needs to focus on her own life and stability.\n\nNobody wins in the scenario.", "Touché.", "Siblings are an equal relationship. No older sibling is obligated to look after their younger siblings just because they're younger. OP has her own life to live and probably can't even afford to raise a kid at 18. It's not that their parents are unable to, they're not willing to", "It’s absolutely not the sibling’s job. OP has no obligation to her sister.", "OP is finally getting to live for herself. She should not have to be responsible for the misgivings of her parents… \n\nShe never got a childhood due to basically parenting her sister. Why aren’t the grandparents who witnessed this helping the little sister? \nOP deserves her own life.", "The older sibling has a moral obligation of taking care of their older siblings. Especially if they have no where else to go. This isn't \"parentification\" this is just being a sibling. Simple as that.", "Doubt it. 18 is legally adult. She's not taking care of a new born. She should be taking care of her 12 year old sister. At least until 18. Wanting to \"focus on her own life and stability\" whilst ruining her younger sisters one quite frankly sounds self centred.", "It's the siblings moral duty to be taking care of their own siblings who may be less capable then themselves, even more so if they're younger and sibling is legally a adult.", "And she should also not be starting her own cycle of misgivings by selfishly abandoning her own sister. As the older sibling, its her moral obligation to be someone who the younger sibling can turn to if there is no one else. The grandparents may be deceased? Regardless, the question posed here was whether SHE is the a-hole for denying her sister. Not whether it should be her or her grand parents taking care of her little sister. And I gave the verdict that she is a a-hole for abandoning her little sister.", "Lies. That is not true whatsoever.\n\nSo you’re okay with children being expected to parent their siblings their entire lives and having to take on the responsibility of taking care of them when they are an adult and get the chance to have their own life?\n\nYou have an extremely illogical viewpoint here, I hope you understand that. \n\nIf you carry a child around for nine months and you and the dad stick your baby on your kids, this is called *terrible parenting*, and maybe they shouldn’t have had kids in the first place if they didn’t want the responsibility of taking care of them.\n\nThe assholes here are absolutely 100% the parents. OP is a victim of abuse, not her sister’s parent.", "Who said their entire life? Even the OP said at least until she is 18 herself. But either way, much better then the sibling potentially being taken away and rehoused, abandoned by her own family and growing up with the butt load of emotional problems they often grow up with. So yes, I would expect the sibling to not ruin their siblings life by being self centred and bitter and taking that bitterness for their parents out onto the younger sibling.\n\nNot really.\n\nNo ones denying the parents being terrible. But that doesn't mean the older sibling also forsakes their younger sibling. It's a moral obligation.\n\nSure, but so is the OP for being so self centred and not taking care of her own younger sister, even when she came calling with no where else to go. The OP is also a abuser and continuing the cycle by abusing and abandoning her younger sister.", "NTA. Instead of calling CPS, call the cops. Ask them to do a wellness check on your sister. Tell them the precise reasons why, neglect, abuse. They will and it is their job to take her away from earshot and talk with them, hopefully she can be brave enough to tell them the extent of the neglect. Also, make them aware that the grandparents have been complicit in this and they are not to be trusted. If she, or you for that matter, have teachers that can also attest to signs of neglect it may allow her to get in care with another family member, friend, or even foster home. I know you don't want it to come to the last, but I can tell you that there are many wonderful foster parents (I am a mandatory reporter and I volunteer with CPS and know many amazing foster families. If your parents are as bad as you say, it may be for the best.", "NTA. Going to be yelled at but do not call CPS.\n\nI get it, your sister needs help but she is going to land on your doorstep. So don't. \n\nAlso, I would not be surprised if mom and dad are making her go to you. I mean why would moving out keep you from being free help?\n\nGo to someone you trust and ask them for help. Your sister needs to get out of there, but you need to be prepared to refuse to take her in.\n\nGood luck and congrats on getting out.", "This is truly a sad story, I heard cps does get involved if there's multiple complaints, maybe the school, your sister, can call aswell.\n\n\"I got around without a parent so you should too\" is survival bias. It's not true, your sister needs help and a patent. But you are not the right person to give her that.\n\nSo NTA, but maybe you can pressure cps some more?", "NTA, my oldest  sister went through the same hell.  Unfortunately for her she was the oldest of six.  You need to be on your own to take care of your emotional and mental health.  Your sister is lost without you and scared.  Maybe between the two of you there would be a way to convince CPS to help.  Perhaps call when the parents have been gone for an extended amount of time or not gone grocery shopping? You need to take care of you but your sister also needs help so keep petitioning CPS.", "NTA- you need to record what she says so you will have proof for cps or send them to the house when they leave her alone in that house, and let them know your grandparents are complicit in all this BS too so they dont get her and a check from the state.", "NTA you are right, you are NOT her mom. And don't let anyone guilttrip you. Live your life because you are not responsible for her.", "NTA  I really don't understand why CPS didn't take her.  Makes no sense to me.  Perhaps call in again and report child endangerment.", "NTA. Parentification is abuse and you aren't wrong. My heart breaks for your sister but you did what you could. You aren't mean, you aren't wrong. Your parents, now that's what are the reigning king and queen of Assholeland.", "Call CPS again but talk to your sister about it and tell her to tell them her parents aren't taking care of her", "As much as you have every right to decide the way you did, I have to say YTA. What happened was never okay, and your parents should have never parentified you. You have every right to feel the way you do about things. However. Making a sandwich and going to bed is not all a child needs to be ready for life. She is 12, not 5. At this age, you will not have to play mom for 6 years. She will be getting more and more independent and soon, you will not have to be her mom anymore. She will in a year or two be much more of a sister then child to you. I feel like as much as your resentment and hate towards your parents is valid, you are taking it out on her, who is just as much of a victim as you are. Now she has no one to be there for her. And those wounds never fully heal.", "NTA. But if CPS doesn't step up - and they might not, because COS is chronically underfunded and ineffective - you need to consider whether you really feel okay about being yet another person to abandon your sister. It really, really sucks, and you're NTA if you do put yourself first. But you have an opportunity to break the cycle here. You could put clear boundaries in place, requiring that your sister be a lot more self-reliant than most 12 year olds are. Make it clear to her that if she screws up - doesn't pull her weight in terms of chores, fails to do all that's required at school, gets into substance abuse, whatever - she'll be going back to mom and dad.\n\nAnd then tap into all the resources that are available. Get both of you into counseling. Get yourself into some sort of career guidance program, so that your choices moving forward all work towards building you a rewarding and happy life. Find out what financial programs are available and tap into those. A social worker or someone at your old school should be able to advise you.\n\nYou don't have to be her mom, but you could still be her big sis and take the lead in setting BOTH of you free from the horrible start your parents gave you.", "NAH. You want to have a life where you can do what's best for you and that's fine. She wants to have someone give a shit about her, that's also fine. I know you don't have to OP, but try to spend time with her every now and then. You can start building a relationship and see each other as sisters instead of being in this weird dynamic your parents forced you into.\n\nLOL downvoted for not calling an abandoned child an asshole and suggesting kindness. Happy holidays reddit.", "I understand that you don’t want to raise her and be responsible for her. I’m sorry your parents suck:( The only thing is, you are a big part of your sisters life. She looks up to you. I know you don’t want raise her, but I would still try to see her. Have her stay the night once a week and call or text her often. Let her know she can call you often.  I’m sure it  really sucks for your sister too.", "This is heartbreaking. And i get where you are coming from. Raising her is not your job, yet you had to do it. I don't blame you for wanting your own life- you deserve it. But just keep in mind you are the only family she has and knows. And now you are just gone. It's not fair to her either. Do you have to help her? No. But maybe just guide her a little or talk to her still keep a relationship. Don't just dissappear off the face of the earth. Man your parents are horrible. I hope shit gets easier for you, and for her.", "This. OP, keep calling and making reports. Call again and let them know what happened with your sister. Go into more details about what happened to you. If you have ANY other family that might be able to pressure your parents into parenting, call them. But you do not need to act as a parent to this girl any longer, as sad as that is for her.", "Agreed NTA op but yea this broke my heart to read. You got screwed into being a parent as a child and don't want to be one anymore and I get that. And your younger sister is now alone floundering in uncertainty and not knowing where to look too since both yalls parents suck shit and you are wanting to do your own thing. I don't blame you in the least bit but fuck my heart breaks for little sister. Try to be there for her as much you possible can while also looking after your own mental health and well being", "They can't force OP to take her. That's not something  CPS is allowed to do.", "When the 12 year old was left to fend herself.", "That's not the relationship they have and that's not the relationship the younger sister wants, so OP will end up in the same position just in her place of safety, which will no longer then be her place of safety.", "All of you saying Y T A should band together to give OP all the money she needs to get custody, find a safe place to live, buy her a vehicle that is reliable to get to and from the work you all will surely find for her with flexible hours. \n\nIt isn’t just that OP shouldn’t have to help her sister. She *can’t*.", ">You're not completely st fault,\n\nOP isn't even the teensiest fraction at fault. At least the sister had someone there for her during her youngest years-OP didn't even have that AND she had to raise an infant. I can't even imagine responding the way you did to this story, you should be ashamed of yourself", "She is not taking out on her. She is removing herself from a situation she should've never been put into. It's her right. It's sad for the sister but she did what she could", "How do you expect an 18yo to have the money to support her sister, to say nothing of getting custody and paying fees for that? Depending on where she lives OP could have gotten in legal trouble just letting a minor over which she has 0 custody stay overnight with her.  \n\nFeel free to offer OP all your money to do what you think she should do.", "Repeat after me: **Older siblings are not built-in caretakers.**", "Right, but sister could end up in the system and will be told that. So she needs to be prepared to refuse so she doesn't cave.", "if your sister comes back, record everything she says. take that tape to CPS as proof. obviously your \"parents\" have her terrified of what would happen if CPS actually knew what was going on, so show them if you can.", "NTA a million times over. \n\nThere isn’t anything you can do for your sister if the state won’t take her away. Even if the state does there is a good chance they won’t place her with someone so young. CPS is a wildcard — it’s impossible to say what they will or will not do. \n\nYou’ve done what you can. I hope the rest of your life is joyous to make up for the shitty 18 years you spent in that house.", "Agreed. OP is still a kid herself. Yes, legal adult, but good great gravy how in the hell these Y T A commenters think it is even feasible for her to do this?", "\"But she is olderrr\" what a terrible AH to say such things to someone who was thorough that much in their brief life.", "I will agree with that. She needs to be prepared for them to try to guilt her into taking her sister.", "No she shouldn't be obligated at all to do sh*t. This woman lost her childhood to take care of her sister she won't lose her youth doing this.", "But she doesn't want and that's enough. Your take is wrong.", "It is? So when did the sibling get to decide to have a younger sibling...oh right, never. You are just as bad as OP's parents.", "This women is making her younger sister lose her childhood as well, if not worse, if the CPS take her away as a result. So yes she is obligated to be taking care of her younger sister. She is taking her bitterness for her parents out on to her younger sister and for that yes she is a A-hole.", "Doesn't really matter. Its her younger sister. She has a moral duty to take care of her.", "When did the younger sibling get to decide to have a non caring older sibling? I don't know how in any way that is comparable. The OP herself understands this.", "No she has not. This doesn't exist. This is delusional.", "OP don't listen to this person her take is awful. She is victim blaming and putting a responsibility you don't have and shouldn't entertain on your shoulders they are the AHs just like your family.", "She doesn't want to do it and it's her right. She lost her childhood to her sister and she doesn't need to keep doing this. She is not self centered she is surviving you have NO IDEA what it looks like.", "No she is not. And you are just bullying an abused child...", "No one has a moral duty to people they didn't have you are delusional.", "You're being deliberately obtuse.", "Nope. She has a moral duty to be taking care of her younger sibling. It shouldn't even be a question about whether she should abandon her own younger sister or not.", "One of the rules here is accept the judgement not argue about someone elses and/or defend position. I've given my verdict. She is the AH for abandoning her younger sister. End off. I didn't ask for you opinion on my verdict.", "And I never tried to stop her. But she'd be a a-hole if she did. Simple. She asked. Not me. So yes, if she abandons her own younger sibling and wants to be selfish, then she can but she'd be a a-hole in my book.", "This person is not a child at 18 years old. This person also asked for my opinion. If you don't like it don't respond.", "As the older sibling she does.", "And I don't remember asking for your opinion on my judgement.", "You know what's a moral obligation? *Parents* taking care of their own kids.\n\nYou know what's self-centered? *Parents* not taking care of their own child.\n\nYou know what's an abuser? *Parents* who abandon their child. *Parents* who make their older kid(s) take care of their younger kid(s)\n\nChildren are not responsible for children.\n\nThat's important, so I'll say it again.\n\n***CHILDREN ARE NOT RESPONSIBLE FOR CHILDREN!***", "Do you have children?\n\nIf so, would you essentially abandon your child’s needs to make their sibling take care of them, essentially forcing them to give up their childhood?\n\nIf you’re not, please do not have kids.\n\nParents who do this are grade A assholes.\n\nIt is not a moral obligation for a sibling to *EVER* have to be the parent for a sibling.\n\nIt’s the parent’s obligation to take care of that child until the child can at least be legally emancipated or turns 18.\n\nPeriod.", "No she doesn't.", "Next time give your opinion in a diary no one will dispute.", "Your book is an AH book.", "The parents didn't write this, the OP did. In either case if the parents failed to, then she should be taking care of her younger sister and giving her what she herself couldn't get. Not continuing the cycle by abandoning her own younger sibling. Sure, but abandoning your own younger sister and taking the bitterness you have for your parents into them is also self centred. Sure. Abandoning your younger sister is also abuse though. She shouldn't be following her parents footsteps and also abusing her younger sister by abandoning her. It is a siblings moral obligation to take care of their other sibling, whether younger, disabled or whatever if they have no where to go and they come calling to you, its a siblings moral responsibility and obligation, not doing that makes the OP a AH.", "No. But yes. It'd be their moral obligation. Taking care of their siblings doesn't mean they have to give up their childhood. That's a silly idea.\n\nIt is, it is their moral duty to take care of their younger siblings, doing what their parents couldn't/were unable to. They shouldn't be taking away from their younger siblings what they may not have had. Simple as that. The OP is 18, she can take care of her younger sister, and this shouldn't even be a question. Its her moral duty. Not doing so and abandoning her own younger sister does make her AH.", "Yes she does and that's my verdict. Deal with it.", "No. The OP asked for my opinion and I gave it her.", "I don't remember asking for your opinion.", "Yeah, the parents didn’t write this because they’re too busy being irresponsible assholes by not taking care of their kid.\n\nOP wrote this because her parents and grandparents have guilt-tripped her throughout her entire life by making her feel responsible to parent her younger sister.\n\nAre you serious right now? Do you actually think this way?\n\nThis is just unbelievable that someone would think this is even logical or morally right, considering the fact that this is actually *traumatizing* for someone.", "Bullshit.\n\nThe responsibility lies on their parents- *not* her sister.", "Well you are commenting in a public forum next time write in your diary and people won't give their opinion", "NTA, and I'm so sorry that you and your sister have gone through this.\n\nMy suggestion to you would be that the next time your sister comes by to encourage her to talk to her school counselor or teachers.  They can reach out to CPS.  Maybe another call from a mandated reporter will help.", "I called CPS on a situation, and nothing was done about it because the person was able to fake like she was a perfect parent and I spoke to cops about it when it resulted to cops being called and they told me that any time a child is endangered or abandoned, or being abused to call the cops before you call CPS because then when you call CPS you can say there’s already a police log about it and that’s evidence to CPS.", "NTA and even if it hurt go NC with her. I tell you because I have a similar experience (no the same, but it's for the context of feeling like you lose part of life for taking care of someone else).\n\nMy cousin since she was 15 has told that she didn't like to live with her mother. Fast forward, she came to live with my family (my mom, grandma, my stepdad, my uncle and my brothers). SURPRISE!! She was just a brat kid who wanted to skip school, date boys, take alcohol in the park, smoke pot, came home late and all my family feel so afraid it's something wrong happened, maybe she have and accident,etc. And, she only want to have fun. Me with 20 something years, took the role of parent, because a didn't want to distress my mom or my grandma. I have to deal with her attitude, teach her basic feminine hygiene,I make her repeat a year because she didn't learn anything and my punishment to her was to make the scholar year again because if she was old and mature enough to drink and smoke, she will be mature enough to think that with the grades she have, she wouldn't go to college. Fast forward 5 years, she became worse and her mom was like yours, no intention of make her a better person and teaching that she is a person who is capable of putting in risky situations for be a \"popular girl\". I kicked of my house, and speak with her mother \"your kid, your problem\".  I didn't lose my childhood and teen years like you, but I UNDERSTAND 100000% WHAT IS LIKE TO BE A PARENT FIGURE FOR SOMEONE WHO ISN'T YOUR CHILD.\n\nTo be encharge of someone who is a minor, who has to be taught and sometimes have to be punished, and teach how to an independent human for the society it's so difficult, and it's worse if it's not your child.\n\nI hope for the best results with your problems, and that your sister understand that she isn't the culprit but for her you lose your entire life. And for your parents...just NC never.", "NTA Give her the number you called - maybe CPS will listen to her. That's all you can do.\n\nShe's innocent, but this is no more your responsibility than people starving in Africa.", "Run OP run \n\nNTA", "Tell *her* to call CPS.\n\nI'm sorry you were parentified.", "NTA, but if there's a compromise, take it. Could you set a time once a week to hang out with her or something?", "NTA\n\nWrite  her a detailed letter of all this, and explain that your parents stole your childhood and you were advised to escape for your own mental health. \n\nIf she shows up again, give her a copy, otherwise have it delivered when she turns 18. \n\nAnd save yourself. Cal CPS and give them all the knowledge you have but let yourself have the best 20’s you can in recompense. Good luck.", "NAH- I can't fault a child to go to the only person she though It was save and would take care of her.  I also don't fault you for not wanting to be a parent at 18.I Hope she has more luck that you were and find people who care earlier. I admit that I hurt more for your sister because she is younger and had you and then lost in a heartbeat, but this mess wasn't your fault.", "Yes! Keep making reports! Have sister talk to them! Maybe even get a camera to record more times sister comes over again for proof. Also, I hope you and your sister get therapy because this isn’t good for mental health", "This is such a sad but true point. Her sister's situation is awful but her sister at least doesn't have to take care of anyone else.", "Emotionally she would have to play mom. There are absolutely no normal boundaries in place in this 'sister' relationship. She should not ever have had to be her mom in the first place - it's abuse and she shouldn't stay in it. You can't heal when you stay within an abusive situation. She's not taking it out on her, she's trying to set a boundary. Until her sister can accept the boundary that she emotionally, physically, financially is not her parent, she will continue to cross it and keep emotionally (unintentionally) adding to OP's trauma. Those boundaries need time to build for OP to have a healthy future. Even perhaps for them to be able to have a healthy relationship at all.", "I would advise no overnights. That will be abused by the shitty parents immediately", "Call her school and speak to her councilor. Is there a boys and girls club nearby? A YMCA? She needs to speak to her teachers, councilor and look for other avenues for help. I’m so sorry for both of you.", "I agree with you. It's so very sad. OP needs to keep her mental health, but should also keep an eye on little sis. You know what happens in situations like this...the younger child ends up with the wrong crowd doing drugs or getting in so much trouble, pregnant at a young age from any guy guy who shows her an ounce of attention that she is so desperately craving. It isn't OPs responsibility to parent her sister and I get it, she's done and run. But she didn't run far enough if her sister found her. If OP truly wants nothing to do with any of them, she needs to run further away or she'll be constantly seeing little sis begging for her", "She was taking care of a newborn at 6. Six. Years. Old. \n\nDo you sincerely think a person with that kind of childhood doesn't have some mental/emotional issues of their own that will likely preclude them from being able to nurture a preteen/teenager?", "And she'd be giving her own younger sister a lot more mental/emotional issues by not taking care of her and abandoning her. Imagine being rejected by her older sister, the same sister that had been taking care of her, when she has no where else to go. Even worse if CPS ended up rehousing her and OP still let it happen.", "That's such a tired, lame argument. By posting your judgement you invited people to give an opinion. But you have no strong argument so you fall back on the childish \"no one asked you\" grade school comeback.", "Last I checked it was the OP asking for the opinions. Not me. Either way, where's your argument? The OP is knowingly putting her younger sister through the wringer because she's selfish, that alone is enough criteria to be a AH in my book.", "OP=NTA\n\nand your sister is just desperate so she doesn't get a-h either.\n\nGive her the CPS number and tell her to keep calling it every time she's left alone, every time there's not food in the house, every time she feels in danger.  If she has a cell phone, have her record them(if one party consent is legal where you are) when they are refusing to care for her.  Or telling her to run to you for \"mothering\".   Suggest ways she can get proof.\n\nYou have a choice right now, you can save yourself or you can save your sister.  These next six years are important years, getting a higher education/training.  Getting job experience.  You can't get those while mothering your sister.  \n\nYou must have been scared so many times, hurt too, but unless you are willing to sacrifice yourself, you have to step out of the situation and force your parents to deal with your sister(or have CPS finally do something0", "NTA. Giant flashing letters. You cannot take this on and it's best to manage her expectations. CPS was a bust this time, but talk to her school, let them know, and the mandatory reporters' word when they spot things might carry more weight.", "You're 100% NTA but you will be (albeit against yourself) if you succumb to the gaslighting. It's understandable why your sister does it, but that doesn't change the fact that you're right; you are not her mother. And you deserve to FINALLY have your own life. The simple fact is that **you** didn't do anything to her. Your parents did.", "NAH here, you are 100% right to get tf out of there but can‘t blame sister for trying to get in. I hope she finds someone who can look after her but it really shouldn‘t be you.", "I’m gonna go NAH.\n\nYou are deffo N T A. You’ve done nothing wrong.\n\nYour sister has also done nothing wrong.\n\n(Because the situation in question doesn’t involve the parents, I’m going NAH rather than N T A)", "I'm so sorry your parents are garbage. But you deserve your own life. Poor kid. She's going to have a tough time but that is not your job. You did great by giving her the care you did and teaching her what you could for so long. Maybe tell her if she needs you for anything major you will be there for her like a big sister would. But she will have to hang in there for the little day to day things. Don't fully desert her. She won't make it. NTA, hope the best for you both.", "This is heart breaking.  All this time sister thought you loved her but luckily now you set her straight.  She had no one at all that cares for her.  Poor sister.", "NTA your sister isn’t an AH either. I understand not wanting to mother her but maybe reach out and have a sisterly relationship. Your awful parents notwithstanding you two can break the cycle together.", "I'm so sorry.\n\n\n\nSome considerations:\n\n\nYou can be there for your sister without having her move in.\n\n\nYou can (I think) get stipends to help for care if she were to move in with you (which could keep you from having to give up school)\n\n\nYou can continue making cps reports, have your sister report to teachers multiple times.\n\n\nTherapy would also probably be very beneficial, if you can find a way.\n\n\nYou are in charge of your life now. You can make things happen for you. Best of luck ❤️", "What happened with the CPS situation they usually ask the child questions your sister's 12. So CPS more than likely asked her about the situation and she lied and told them a totally different story that's why they didn't pursue anything. \n\nSo yeah she can stay there with the parents since she didn't know her mouth so the situation can get rectified she can go ahead and stay with her parents and I would do exactly what you were doing . Do not change your stant", "Why do you think crossing a city is so hard for a 12 year old?", "No it doesn't work that way. OPs health and well-being need to come first now that she has the option to stop living in an abusive situation. Stop guilting her. It's disgusting, unrealistic, un-empathetic, and completely out of touch with what this abusive situation is.", "It does work that way. She is the older sibling. She's not escaping a abusive situation by abandoning her helpless younger sister and ruining her life (if the CPS ends up rehoming her). She's continuing the cycle of abuse and inflicting abuse upon her own sister by willingly abandoning her. Is she a AH for? Yes she is.", "Her abuse included parentification. If she continues to be parentified, she herself is not getting a chance to heal. She is continuing to be faced with the reminder of that abuse everyday as well as having it continue. She needs to help herself before she can help anyone else. She is not obligated to take care of her sister if it continues to damage her mental health.", "In other words she is being self centred and knowingly ruining the life of her own younger sister by abandoning her. She is taking the bitterness of her own trauma out onto her sister by knowingly abandoning her because it is guaranteed that it will traumatise her younger sister far more, being abandoned by everybody including her own sister, then what she herself had to go through. And if she would like to still go through with that. Then there is no words for that. Her seeing it that way, that her taking care of her younger sister is somehow damaging her, is in itself a major problem.", "How about you take care of OP’s sister? No, it’s not your responsibility is what you say? Well it’s not OP’s either. She was neglected by her parents and then forced to parent her sister from 6 years old.  And you want to force her to continue, never getting a chance to live her own life, for another 6 years until her sister is 18? So OP suffers for 24 years because you believe that her being born means she’s forced into this “moral obligation”?\n\nYour thought process is sickening and disturbing that you don’t believe after 18 years of psychological abuse and neglect that she should be obligated to care for someone she didn’t birth.  The parents brought her sister into the world.  It is her parents responsibility to be parents.  OP has suffered enough and your backwards thinking makes me think you probably would parenting your own children and think it’s okay just because you graced them with the “gift” of life.\n\nShe was forced into a parental role at 6 years old and raised that child for the last 12 years.  She tried to call CPS and they did nothing because our system is broke as hell here in America.  She at some point needs to be allowed to live her own life because she’s never been allowed to have one. People like you want to continue to strip that from her.  The sister is in an unfortunately horrible situation but so was OP and the fact is that you have zero sympathy for a girl whose life was stolen from her by her parents.  It IS parentification and you have zero idea what you are talking about and it’s truly disgusting.", "She's been abused...if you stay in your abusive situation (parentification) you can't heal from abuse. End of story. She has no moral obligation to continue to place herself in a situation that will further her trauma and prevent her from healing. None at all.", "What a silly question. Why should I? Its the responsibility of the blood relative, the one that's been living with her, her entire life, the one that younger sister came to ask for help as she had no one else. Yes because that's her younger sister? They aren't random strangers. And she seems to now want to neglect her own sister as well, following in the foot steps of her parents. No, she asked whether she would be a AH for not continuing and I simply stated why I think she would. Simple as that. No one can force anybody to do anything, but I simply told her the consequences. Yes, she is the older sister off course she'd have the moral obligation of taking care of her younger sister. They aren't strangers.\n\nWhat's even more sickening and disturbing is you seemingly wanting her to become psychologically abusive as well and follow in the footsteps of her parents by abandoning her sister. The parents aren't the ones asking here. OP should be doing what her parents failed to do. Yes, why shouldn't the older child \"parent\" their younger sibling? Nothing wrong with that. Its not \"backwards thinking\" at all.\n\nOkay, so even more reason as to why her stopping now would be ridiculous, you would think she'd be a little more empathetic to her own sibling. Taking care of her own sister, does not mean she can't live her life, that is toxic and self centred thinking and absolute AH level. Yes, and it seems like the OP wants to put her sister into a even more unfortunately horrible situation by not taking care of her and completely abandoning her and that there is why she would be the AH here. \n\nMean whilst, it seems you have zero sympathy for the younger sister who you seem to encouraging the OP to abandon and forsake. No it isn't. How is it parentification? Exactly why can not she allow her sister to live with her? The OP is clearly taking the bitterness she has for her parents out onto her younger sister.", "And she wants to now abuse and abandon her younger sister. That makes her every bit a AH as her parents. She has a moral duty of protecting her younger sister as if it were her own (I mean, technically she is), and not inflicting the same trauma she experienced upon her, \"parentification\" seems like code word for dodging responsibility.", "🤦🏻‍♀️ \n\nThis is like trying to reason with my toddler", "You're out of touch completely with how breaking trauma cycles work. And with OP seeing these comments and going through a horrible situation, we need to call you out on your shit.", "No, me recognising that the OP wants to continue said trauma cycle by not taking care of her own younger sister who has even stated that he has no where else to go is not being \"out of touch\". Its' stating the truth. As the older sister she is obligated to take care of her sister and not allow her to suffer what she did or worse. She should understand that herself without even asking.", "> In either case if the parents failed to, then she should be taking care of her younger sister and giving her what she herself couldn't get\n\n***NO SHE SHOULD NOT!!!!!*** It is the *parents'* duty, ***not*** the siblings'.\n\n> Not continuing the cycle by abandoning her own younger sibling.\n\nThere is no cycle, since her sibling is not now, never has been, and never will be her responsibility.\n\n> Sure, but abandoning your own younger sister and taking the bitterness you have for your parents into them is also self centred. Sure. Abandoning your younger sister is also abuse though. \n\nIt is not abandoning, since no person is ever responsible for their sibling(s).\n\n> She shouldn't be following her parents footsteps and also abusing her younger sister by abandoning her.\n\nShe isn't because her sister is her parents' responsibility, not hers.\n\n> It is a siblings moral obligation to take care of their other sibling, whether younger, disabled or whatever if they have no where to go and they come calling to you, its a siblings moral responsibility and obligation\n\nNo person is ***EVER*** obligated to take care of another unless they contributed to *creating* that person. And even then, adoption exists. Anybody who thinks otherwise is a monstrous boundary-overstepping asshole.", "She's not selfish. She wants her own life, as she's been forced to give up her childhood for her sister. She had to grow up super fast. OP needs to take care of herself, and put up the boundary that she isn't the mother, that she will not continue this messed up mother-sister thing. If that means distance and low or no contact, then so be it.", "ESH, except the sister. You don’t have to take your sister in to not be an asshole, but you treated her with no care.", "NTA This is just a shit situation which you and your sister were born into. I know you are tired of taking care of your sister, but I would say to at least check up on her from time to time. While you may have survived well enough alone growing up, she might not. She has nobody to care for her and give her attention, so she might join the wrong crowd and do drugs and/or get pregnant at a young age because she will look for anyone who will give her the attention she is neglected at home. She isn't your responsibility, so I would understand if you just left completely. I would just suggest that you try and be there for your sister as much as you can while also making sure that your mental health is fine because if you leave sister behind then she might suffer and you may regret it later.", "This entire situation sucks. \n\nYou deserve to have your own life and it is great that you taught her as much as you could. \n\nTry not to stay mad at her for what your parents have done. You are her sister and you love her. If you want what is best for her, Make school administrators aware of the situation. School nurses also. The more people advocating for her the more likely she will get away from your parents while allowing you the chance at a life with a SISTER.\n\n\nGood luck in the next stages of you growth!", "NTA\nBut you need therapy because you're directing a lot of this anger and resentment at a child who has done nothing wrong. These emotions should be aimed at your parents. You don't have to be your sister's mum but I hope for both your sakes that you are still offering emotional and mental support. You may end up only having each other as you get older.", "NTA.  If your sister comes back, ask her if there are things they are or aren’t doing that you can report to CPS.  If they leave her alone overnight, don’t feed her enough, are t getting her proper clothing for the weather or having her kids school.  Tell her the most you can help us report them when they do these things, but you need to know at the time so the cops can come and find her there alone or without food, etc.", "NTA ... such a sad story and to ppl who saying call CPS , they brly get involved unless is something like rape/physical abuse/starvation then good luck ... they are so understaffed and no budget that as long as the kid has a roof, has food and no physical abuse then its a win for them ... Ive heard something crazy like one case worker has like 300-400 cases ... that is insane, thy shouldn't have more then 50.", "Yeah this is a NAH. That poor girl. Wow", "Correct judgment would be NAH", "Everything about this situation breaks my heart and the sister is obviously not an AH. Glad someone else noticed.", "OP’s sister doesn’t WANT a sister, she wants a mom. It’ll be extremely hard to even get to the point of sisters when the other sister doesn’t want it in the first place.", "> I know you don't have to OP, but\n\nPro-tip: Every time you start a sentence with this *stop* and reconsider what you're saying. You're qualifying it; you know you're about to say something unreasonable and possibly harmful. \n\n>LOL downvoted for not calling an abandoned child an asshole and suggesting kindness.\n\nNo you're being downvoted for telling OP to do something she's made very plain she doesn't want to do. That's not kindness.", "OP: I want nothing to do with this person.\n\nYou: Okay but you should babysit her once a week, talk to her all the time and basically just be her parent anyway!", "literally how do you expect her to treat her? Pretend that they’re mother and daughter?", "If there's a pediatrician, get in contact with them too, ASAP, and report.", "That’s the point of calling—to get her into the system.", "You’re either trolling or incredibly ignorant. No, siblings do not have a “moral obligation” to take care of their younger siblings (aka parent them and take all responsibility over them). That would never have to happen if the ACTUAL parents decided to ya know PARENT. You don’t have children so that they can then take care of the children you decided to give birth to afterwards. This is parentification and it IS abuse.", "NTA but OP, I was in your position. My sister was in a slightly altered position (we had different dads, her dad was an asshole and stepmom wasn’t really great). She lived with them, I lived with our neglectful and alcoholic mom, but at the *bare minimum* I texted her periodically and followed her on SM to make sure she was safe. She wasn’t being neglected, physically hurt, but her dad wasn’t the nicest person. \n\nYou are by no means obligated to take care of her and that should’ve never been your responsibility. There is a middle ground and I know you were thrown to an extreme. It’s easy to think to the next extreme when it was all you knew. \n\nYou’re doing great by focusing on your safety and mental health, this is so important for you. Boundaries are important and I can imagine it was hard to say that to your sister when she arrived. I just…I don’t know how I feel about doing nothing if she came to me begging for help. Granted I don’t know your sister’s personality or the intricate details, but at the very least you can at least call CPS once or twice more, you can call her school and let them in the loop too. \n\nAgain, I know it’s not your responsibility and should never have been, but it’s not like you’re having her move in again, she literally has NO ONE, she can’t move out on her own, and these phone calls shouldn’t take any more than a few hours. I’m so sorry that you and your sister have had to go through this. I would really take the time to think over your options. I’m proud of you for taking the first steps and just know it’ll get better.", "Absolutely NTA. You deserve your own life.", "Life is hard and taking care of her would be extremely difficult in your situation. But do it anyway. You will always have each other. You will look back on abandoning her with regret.", "NTA. Your parents are huge AHs for not even being parents for either of you. Your sister doesn’t know any better. However you’re not responsible for her.", "And to be honest, negligence is one of the most screened out reports you can make. Because of CPS's extremely messed up history in the US where they used to take too many kids, mainly Black & Native kids, the pendulum is the other direction right now and it's extremely hard to clear the bar of proof for CPS to take action, and even taking action often means \"monthly check-ins\" or \"family therapy,\" not removal of kids.\n\nThe bar is so high that the kids I've met in my work in education that have been removed were all in situations that were hard to even imagine, in the child molestation or attempted murder range (and even that doesn't remotely guarantee removal). Your suggestion of seeking trusted help is a good one, ranging from school staff to community organizations & members.", "> who is just as much of a victim as you are.\n\nIf she's \"just as much a victim as OP\" then why is OP the one who has to suffer? Why are we not concerned about OP healing? Why do you seem to legit think that OP is responsible for raising this kid now?", "> Can I suggest that your home be open to her, *as a sister*?\n\nOP: I want nothing to do with this person.\n\nYou: Okay but you really should just be raising her anyway.", "> then you should be responsible for taking care of her either way.\n\nThis is just you confessing that you're too lazy to raise your own kids, right? So whose doing it?", "My thoughts as well.", "Maybe have your sister call CPS herself and see what happens.", "> on that basis the OP should be obligated to taking care of her sister\n\nFrom the bottom of my heart I want to sincerely thank you for talking shit like this. Its not very often that people lay the crazy of DNA Fetishism out so plainly for rational people to read and decide against.", "> She's not escaping a abusive situation by abandoning her helpless younger sister and ruining her life \n\nGetting herself into a situation where she no longer has to parent her sister is the *exact method* of escaping her abuse because--and read this slowly til you get it--her having to raise her sister was the abuse. You're sitting here claiming that OP has a moral duty to *be abused more.*", "> It is a siblings job.\n\nNo, that's *the parents' job.* OP didn't decide to have children. When you decide to have children you take on the job of raising them.", "> It's the siblings moral duty\n\nAccording to what morality set?", "You're dodging the question because you can't answer it.", "OP, don’t give up and keep calling CPS. I’ve called CPS, my aunt has called them for me, but it wasn’t until my teacher and school counselor called them that they actually took me serious. You’re not your sister’s mother, and you do not owe her anything. But I think asking your old teachers or your sister’s current teachers to call CPS to get her out of the situation you had to live in would be nice. \n\nNTA btw", "NTA. I read these horror stories and it makes me extra careful with my own children as they have an 11yr gap. While I appreciate the insight into parentification, I feel so terrible for those of you who have to go through this. You were failed by so many adults. While it sucks for your sister, you did what you could and you deserve your own life.", "NTA Would you feel better if you took her out for a weekly girls’ afternoon tea? I do that with my sister. It’s a bestie sister thing and not a Mum thing.", "NAH\n\nYour sister has a desiderata need,  but it is not your responsibility to fill that gap \n\n(Actually your parents and the CPS are assholes, but this is about an issue between you and your sister,  and neither of you are assholes)", "NTA but going cold turkey with your sister is going to be problematic. She depended on you so much, you are the only RESPONSIBLE adult she knows. I don’t think you should cut her off but slowly ease her away where she visits once or twice a week/month.  You should NOT take care of her but reformat your relationship to little sis/big sis. Just a thought.", "NTA. Write up everything you recall about how you were treated and what you were expected to do for your sister with as many dates or approximate dates as possible. Ask neighbors, extended family, friends, teachers, doctors and anyone else you can think of to provide witness statements. Ask friends if they remember coming over and seeing how you were treated and write down what they tell you. If CPS won't help, see if there's a state agency or non-profit that will help. Talk to your sister's teachers and school officials because they are mandated reporters. Use the words that trigger mandated reporting and CPS action like abandonment, neglect, psychological abuse. Also write down the names of everyone who knew exactly what was going on and refused to help or collaborated with your parents. Speak to an attorney to see if there are any legal remedies for you or your sister. Tell your sister that you can't be her mother but you are working hard to get her a better living situation and the help she needs. Explain to her that you are just as much a victim in this situation as she is and therefore not qualified to parent her since like her, you need to get help for the trauma you've suffered. Make sure you start seeing a mental health therapist asap."]}