{"id": 4396, "submission_id": "zhu9aa", "title": "AITA for telling my son that his dad was lying?", "selftext": "My ex has been telling our children that he’s going to bring me home so we can be a family again. It’s confusing and upsetting our son who keeps insisting I go with him whenever he goes to visit his dad.\n\nI tried to speak to my ex but he was ignoring all of my calls and my son was getting more and more upset each time he had to visit his dad and I wouldn’t go so I finally told him that his dad was lying. He was devastated and angry with his dad since he’s 5 so this was a huge betrayal to him.\n\nThe last time my children went to see their dad, he apparently kept yelling at his dad and calling him a liar. It was so bad my ex sent them home early as our son kept getting himself worked up and making himself sick because he wanted to come home.\n\nMy ex confronted me a few days ago after work. He wanted to know what I had said to our son to make him so upset with him. I told him what I had said and told him off for lying to our son. He's furious with me and has accused me of trying to turn our son against him. He claims I'm the one who's lying to our son and told me to think twice the next time I try to turn our son against him.\n\nAITA?", "created_utc": 1670683494, "permalink": "/r/AmItheAsshole/comments/zhu9aa/aita_for_telling_my_son_that_his_dad_was_lying/", "score": 94, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my son that his dad was lying about him bringing me home so we can be a family again. I didn’t discuss it with my ex before I told our son he was lying and I could’ve worded it better so my son wasn’t as upset with his dad.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but please consider documenting these exchanges and his threats so you can show it to a lawyer.", "This is... child abuse? Emotional manipulation? Dunno. But lying to his kid and then yelling at you for not going along with it is absolutely disgusting behaviour. Oh sure he says it's because you're turning his son against him, but in real world language he's doing that to himself by lying. Even if he had hopes of getting back together with you, this seems like the worst way to go about it. \n\nNTA.", "NTA\n\nHe was outright lying to your son and you weren't going to play along with the lie so you told your son the truth. He made his bed by lying to your son, he can now sleep in it.", "Not the AH. Your ex shouldn't be giving your son false hope like that. You did the right thing. Your son will calm down given time. You did not turn him against your ex, your son was confused and you told him the truth. Your son comes first and you put him first. Not the AH", "NTA\n\nUnless I’m some weird universe you’ve hinted you’re getting back together (which I seriously seriously doubt) your ex is living in cookoo land and needs to get real.\n\nYou did nothing wrong and this is going to have seriously affected your child. Keep checking in hon as he may never trust anyone again I’m sorry to say.", "NTA!\nDocument as much of this as you can...and see if you can get your son to a child psychologist to deal with this obviously cruel abuse. Your son is too young to get over this without some help - I imagine he is devastated.\n\nYour ex is a total AH.", "NTA - you were trying to protect your son from being confused and upset   \nby his father's lies. It's not your fault that your ex was lying to your  \n son and it was important for you to set the record straight. Your ex's   \nreaction is not your responsibility and you did the right thing by   \nspeaking up for your son.", "Nta..... document and get your son into therapy asap. Courts like 3rd party documentation not just parental. Does he go to school?  Get teachers on board. Don't speak bad of your ex, keep focus on the child at all times. What's good for him, what behaviors you see, what he has been saying, etc....", "NTA. Is this one of the reasons you’re no longer together?\n\nBUT, this isn’t healthy for your son no matter who is lying. \n\nKimochis or generation mindful are great tools to start teaching emotional regulation and explain what emotions mean as well as positive and productive ways to show emotions. \n\nHaving meltdowns is exhausting and just because you set the record straight doesn’t mean your son isn’t experiencing conflict and all kinds of other exhausting emotions. You don’t want your kid to end up traumatized with all this. I suggest you sit and explain things at an age appropriate level and then do so with your ex. \n\nYou don’t want to be “right” while also damming your own kid.", "Nta, he did thi not you", "NTA. I’m sorry, that sounds so traumatic for him. If you haven’t done this already I would look into counseling for him. He’s probably got a lot of big feelings he needs help identifying. It might also help to have an objective party assist him in recognizing these unrealistic promises his dad is making. If you have a lawyer they need to be aware of all of this too.", "This man is not someone I would want around my kids, even if he is their progenitor. Speak to a lawyer asap. NTA", "NTa\n\n&#x200B;\n\nYOu were right: He WAS lying to your son.\n\n&#x200B;\n\nYOu just told your son the truth.", "NTA but keep in mind if you start dating again your ex will lie to your son about your dates. He's manipulating your kids to make you get back together with him; he's making it seem like it's your fault that the relationship is over. Talk to a lawyer. Also consider a child psychologist for your kids.", "NTA- Holy twisted manipulation Batman, please check your car and communication devices for trackers/snooping or tracking software. Telling a 5 year old he will 'bring' an unwilling partner 'home' (to where she doesn't live) is hella stalky.", "You need to take your ex back to court for full custody if you can. This kind of manipulation is extremely unhealthy for your child and can do some real mental damage to your son.", "Your ex is blatantly trying to manipulate you into getting back together with him. He probably expected one of two things to happen:\n\n1: You rethink leaving him and come back to keep your son happy.\n2: You tell your son you won't be back and your son thinks it's your fault therefore turning him against you. You get back with your ex to make son happy again.\n\nNow he's pissed that it didn't work. Boo hoo.\n\nI recommend making a record of these interactions just incase they're needed and maybe speak to a lawyer??", "NTA \n\nThis is child abuse. You should get the court involved", "ESH, 5 yo is too young to understand the complexities of relationships, it sounds like your ex wants to get back with you, so he’s stating a wish rather than a fact\n\nYou obviously don’t want to get back together, but that doesn’t mean he’s a liar, it means he’s wrong \n\nTelling your 5 yo the ex’s a liar makes everything the ex says a lie", "Everyone’s the AH. Calling him a lier was wrong, because this could be what you ex truly believes and isn’t intentionally lying. I can’t imagine he got to feel you had feelings and may be coming back to him on his own. It takes two (most times) for him to feel so much like you may get back together to tell your kids about it. \n\nHow the situation should have been handled was you speak to you ex about this first, even if it took days or weeks to get ahold of him. Just the two of you talk, *then after you talk alone* sit down with your kids and talk *together* about it. He shouldn’t be giving the kids hope you’ll get back together when it’s clearly not what you want. You can’t go around calling him a “lier” to a 5 year old. This is *clearly* an issue between you and your ex that needs to be resolved. Your BOTH AH for getting the kids in the middle of it.\n\nIn the future if your ex tries to get the kids involved in *your relationship drama* don’t stoop to his level and get them *more* involved.", "ESH", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy ex has been telling our children that he’s going to bring me home so we can be a family again. It’s confusing and upsetting our son who keeps insisting I go with him whenever he goes to visit his dad.\n\nI tried to speak to my ex but he was ignoring all of my calls and my son was getting more and more upset each time he had to visit his dad and I wouldn’t go so I finally told him that his dad was lying. He was devastated and angry with his dad since he’s 5 so this was a huge betrayal to him.\n\nThe last time my children went to see their dad, he apparently kept yelling at his dad and calling him a liar. It was so bad my ex sent them home early as our son kept getting himself worked up and making himself sick because he wanted to come home.\n\nMy ex confronted me a few days ago after work. He wanted to know what I had said to our son to make him so upset with him. I told him what I had said and told him off for lying to our son. He's furious with me and has accused me of trying to turn our son against him. He claims I'm the one who's lying to our son and told me to think twice the next time I try to turn our son against him.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA: Get text records in case this guy decides to try something and make sure you let someone know about the situation.", "NTA.\n\nIf you don't want to get caught out on your lies, don't lie.", "NTA As soon as you heard about the lie you should’ve documented it. What he is doing isn’t right. From now on document everything.", "YTA\n\nSpeaking to the ex and telling him he's a liar is one thing. Telling your five year old is petty and not how you could have handled it. You could have negated the father's attempts to manipulate you and your son by saying something a 5 year old could understand along the lines of \"Your too young to understand but sometimes one person wants a relationship to continue when the other does not. Daddy is in the former category. Maybe he's (the ex) is too young to understand too.\" If your son has ever been in the position of not wanting to be friends with some other child you can use that as an example.", "This this this! Document. Your ex is establishing a pattern of being manipulative and setting the ground work for emotional abuse. You need to stay on your toes and see this for what it is. Document every little damn thing.", "Why wouldn't the ex take her phone calls if he wanted to get back together? Why lie and threaten her with repercussions for clearing up a falsehood?\n\nIt doesn't sound like he is trying very hard to get back together... more like it's an easy thing to say to get the kids to calm down when she's not around, or to manage/manipulate their behaviour in some other way, maybe to avoid dealing with their feelings and thoughts about the breakup in the moment.\n\nHim not doing anything to get along or demonstrate love or compassion and him actively avoiding her phone calls make his claims to be \"bringing her home\" into full on lies. \n\nI agree that the wording between \"daddy is a liar\" and \"daddy told a lie/daddy's can't keep that promise\" is different, but I don't know exactly how she said it, and we don't even know if the kid acted out that day and was upset over the one (big) false promise, or if he thinks everything dad says is untrue because of how she said it... So INFO, I guess.", "[removed]", "How is it petty? 5yr old is being told something is fact by someone he trusts and is getting frustrated its not happening. OP tells him the truth and he feels betrayed and lied to. He's 5. He's not going to understand relationship dynamics and manipulation. He knows truth and lies and anger and hurt. And he's rightfully hurt. How is she TA for being truthful to her child?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Oh, and it was just so unforeseeable that a 5 year old would have a meltdown?  Nice parenting skills there!", "Who said that?"]}