{"id": 4430, "submission_id": "zhx1fg", "title": "WIBTA if I don’t listen to my moms wishes during my brothers funeral?", "selftext": "So background, a week ago my brother was found dead. He had a lot of mental issues (possible schizophrenia) and burned a lot of bridges. But in the end he’s my brother and I know his actions came from being unwell. \n\nGrowing up it was my mom and us, dad out of the picture. As an adult I found out my mom lied when she told us my dad didn’t care but in reality she made it hard for him to find us, out of spite and not because he was dangerous. \n\nMy mom isolated my brother from family in the end  and paid all his bills (come to find out she used this against him “if you contact so and so I’ll stop paying for your things”) Everyone who tried to reach out and get him mental help was pushed away, either by her or my brother (he refused psychological help). Now she’s saying no one helped, when we will tried. Literally can’t think of a family member who did not take my brother in and try to help at some point.\n\nMy mom is 100% the AH. You’d think she would lighten her control at my brothers funeral but she isn’t. She completely excluded my dad in the obituary, excluded our siblings he had with his wife, and now my dad has to sit in the back.\n\nI know for mothers who lost a child it’s hard. Beyond hard. But I just hate that my dad has to sit in the back. He tried fighting for full custody, he tried to keep us, but my mom would lie and now he’s painted as this absent father who has to sit in the back of his first son/child funeral. WIBTA if I go against my moms wishes and bring him to the front (away from my mom of course)?\n\nIN ADDITION: I also told my mom I don’t want her in my life a few weeks before my brother died. I stated he wasn’t getting the help he needed and it wasn’t right, with some other things in addition to that. So already not in good standing with her.\n\nUpdate: thanks for all the advice! I will sit with my father in the back and be there for each other.", "created_utc": 1670690591, "permalink": "/r/AmItheAsshole/comments/zhx1fg/wibta_if_i_dont_listen_to_my_moms_wishes_during/", "score": 98, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I want to let my father sit in the front during my brothers funeral and not in the back where my mom wants him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. That said, you may cause a scene. (Yes, I get that your mom is the one really causing it, but hear what I'm saying.)\n\nI had something similar happen at a funeral, and it wasn't until it was over that I knew it had happened - it was done quickly and behind my back. If I had a do over, I would have just sat in the back with my mom. The deceased don't care where we're sitting. If you want to bring your dad up front, by all means. You could just sit with him wherever, though.\n\nI'm sorry for your loss.", "Sit with him in back.  If you invite them, would your other siblings join you?", "Absolutely NTA for the sentiment. But be ready for a huge meltdown from your mom. She might cause a scene, so it’s something to consider.", "NTA for sure but you'll have to deal with a lot of drama after. I'm not saying it's fair that you would have to deal with a lot of drama after, but that's the situation. Your mom could start yelling at your dad or creating a scene. She does not sound like someone who reacts well to not being in control. \n\nAnother option is for you to go back and sit with your father at the back, which sends a significant message, I think. Maybe just go with your gut and what feels right. I'm sorry you have to deal with this.", "YWBTA, in terms of optics, if nothing else. \n\nIf you bring your dad to the front, then mom gets to make a scene about him and how badly HE behaved at the funeral. That's not fair to him.\n\nIf you sit in the back with him, then the meltdown will be about YOUR behavior,  which is fair because it's YOUR decision. And that will kick down the door for other people in your family to question why YOU don't think he's a monster. And that starts a conversation your family probably needs to have. \n\nI'm so sorry for the loss of your brother, and I hope this a gateway for your family to heal.", "YWBTA to bring your father to the front family mourners bench and start a ruckus. Far better for you to sit in the back with your father. Let the other mourners and family interpret that as they will. I’m sorry for your loss.", "Sit in the back with your dad.\n\nAll you can do now is tell him you see him, you see the position he’s been put in, and you want to be as close to him as you can be moving forward.\n\nNTA", "NTA. Sit in the back with dad. Tell anyone who asks that: mom insists that my father, the man who tried to be there for myself and brother, sit in the back.", "NTA\n\nThis is a tough one. You’d be doing right by your father, his family, and yourself to make them feel included, and acknowledged, by inviting them up front.\n\nOn the other hand, it could create a very ugly scene that would leave everyone, yourself included, even more devastated on a very difficult day. \n\nMaybe the best thing you can do for yourself, and your dad’s family, is to embrace them when they are there. Spend time with them. Go find them “in the back”. Be open to them. If you share in each other’s grief and forge a stronger bond, you’ll be honouring yourself, your brother, and your father.\n\nThe most important thing you can do the day of the funeral is give comfort to those sharing in the loss of your brother, and let them comfort you. \n\nYou are all extremely fragile at the moment; spending time being present with each other is what is going to help you find a balm for your grief. It’s ultimately not about where everyone sits or your physical proximity to each other or the service; but how emotionally close you get to each other that day.\n\nI am so sorry for your loss and for your mother’s difficult behaviour. May you find comfort in your family.\n\n(Edited: first sentence for repeated word)", "NTA I’m sorry your bro died. I’m sorry he had a rough go. Your mom sounds exhausting. \n\nYou can take a stance if you’re up for the scene. Personally I’d prefer to remember my brother on the day of his funeral reflectively.  Where everyone is sitting really doesn’t matter much. Your mom controlling those aspects demonstrates a sad, unhinged person at work. Let her crazy shine. She is her own karma.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo background, a week ago my brother was found dead. He had a lot of mental issues (possible schizophrenia) and burned a lot of bridges. But in the end he’s my brother and I know his actions came from being unwell. \n\nGrowing up it was my mom and us, dad out of the picture. As an adult I found out my mom lied when she told us my dad didn’t care but in reality she made it hard for him to find us, out of spite and not because he was dangerous. \n\nMy mom isolated my brother from family in the end  and paid all his bills (come to find out she used this against him “if you contact so and so I’ll stop paying for your things”) Everyone who tried to reach out and get him mental help was pushed away, either by her or my brother (he refused psychological help). Now she’s saying no one helped, when we will tried. Literally can’t think of a family member who did not take my brother in and try to help at some point.\n\nMy mom is 100% the AH. You’d think she would lighten her control at my brothers funeral but she isn’t. She completely excluded my dad in the obituary, excluded our siblings he had with his wife, and now my dad has to sit in the back.\n\nI know for mothers who lost a child it’s hard. Beyond hard. But I just hate that my dad has to sit in the back. He tried fighting for full custody, he tried to keep us, but my mom would lie and now he’s painted as this absent father who has to sit in the back of his first son/child funeral. WIBTA if I go against my moms wishes and bring him to the front (away from my mom of course)?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - but just sit with dad and let this go. Then avoid your asshole mom from now on!", "Good for you for sitting in back with your dad!", "Yeah I was thinking no matter what I want to sit with him but at the same time I don’t want to let my mom control where he sits.", "From my moms side, no. My other siblings from my dad are unable to attend. I think mainly to not make things worse with my mom", "That’s what I’m worried about. I know if we don’t react to her, everyone will just see her for how she is. My dad is so peaceful, never uttered a bad word about her, even now just keeps saying she’s just hurting. I had just recently cut my mom off from my life early November so it’s awkward for me talking to her now.", "I hear you, I do -- but your mom is clearly going to be who she is. You can't control everything and everyone, but you can control yourself. Your mom will have to live with her behavior, but don't give her the power to take your attention away from your brother at his service.", "Think of it this way — sitting in the back would be a way of refusing to let her dictate where *you* should sit.", "Funerals are like weddings. Whoever pays gets to make the decisions. \n\nYou could also have a memorial/remembrance  ceremony later and run it how you want.", "You don't need to have a service with her. She can have her own.", " Very true. I do think it’ll send a powerful message if I am seen sitting with my dad.\n\nEdit: I’m not doing it just to send a message. My dad and I have been very close for years now, trying to find what we lost. I just don’t want him to be alone and left out. I know me there will help him.", "NTA whatsoever. Respectfully with your brother passing away, it's time to cut your mom off. I mean it's either her or the rest of your family imo."]}