{"id": 4466, "submission_id": "ziu4e3", "title": "AITA for telling my wife ahead of time that if she confronted my mom over something I viewed as stupid, i would not defend her from the fallout?", "selftext": "I recently got married to the love of my life \"Callie\" she has issues with my mom and i've always supported her as my mom is difficult. My mom knows I won't let her be bitchy to Callie and I hope Callie knows I have her back.\n\nThe day of the wedding my mom was radio silent. I could tell she was getting more and more agitated just because she didn't look good and was starting to get pale and shaky. Finally her brother came and said I needed to talk to my mom she was going to pass out. I went to deal with it and she was so upset because she really didn't want to do the mother son dance. She had a hard time even communicating this and was just squeezing the shit out of her brother's hand and like I can't, I can't. \n\nI finally got it out of her and said it was no big deal. I just casually let the DJ know and they took the song out of the lineup. It wasn't even something I cared about. We were just doing it for tradition's sake and my mom doesn't like to be touched so really it is fine.\n\nI explained to Callie and she seemed ok with it. During the reception my mom danced for hours with my boss. My boss is an attention whore and was also drunk, so super attention seeking dancing, throwing her, spinning her, etc. Callie was clearly pissed. She made a comment about oh look who can clearly dance and I asked her to let it go.\n\nWe are back from our honeymoon and had to see my mom for a holiday thing. Callie is big on talking out every feeling you have and wants to have a conversation with my mom about her behavior. She says it was an intentional snub and needs to be addressed. I told her I'm not going to control her, but in this situation I won't back her as I asked her not to bring it up.\n\nWell she did and my mom called her an idiot. She got a nasty tone and said that man she was dancing with wasn't her son, so it is completely irrelevant and she didn't want to touch her kid like that. Callie did hold her own and clap back, but when we were alone told me she was extremely hurt that I let my mom call her an idiot. I reminded her of what I said going into it, but she said I failed in that situation and I need to back her even if I don't agree with her.", "created_utc": 1670768902, "permalink": "/r/AmItheAsshole/comments/ziu4e3/aita_for_telling_my_wife_ahead_of_time_that_if/", "score": 2332, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I refused to back my wife because it wasn't important to me, but it was clearly important to her. I allowed my mom to get away with calling her an idiot which sets a bad precedent going forward\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Callie needs to learn to back off. If it was an intentional snub it was directed at you not her so she needed to let you take the lead on how to address it.\nI think you should back up your spouse in general but when your spouse is TA they gave to take their lumps on their own. \n\nNTA", "NTA.\n\nPeople need to know what fights are worth having and what ones aren't.  This was your thing, and if you were fine with it, she should have been as well.  The fact that she wanted to bring this up after the fact is just stirring the pot unnecessarily", "[deleted]", "NTA \nAnd you do NOT have to back your wife if you don't agree with her. You are not her little puppet/support person who watches her make an ass of herself and just say \"yes, dear\".\n\nFor whatever reason, your mom wasn't comfortable comfortable dancing with you. You were ok with that, and moved on. Your wife wants to make a big deal out of a nothing burger AND she expects you to cosign her crazy?\n\nNo, you are NTA.", "Is your mom afraid that if she dances with you she’ll end up fucking you? What does it mean that she doesn’t want to touch her children in that way as if to suggest there’s something sexual or wrong with just dancing. Sounds like she has some issues. All the while Callie should’ve understood it was a dead issue to you, you should’ve drawn the line at name calling on any side.", "Sounds like a MIL troll with the bizzare behaviour from MIL, the wife confronting her and the son not backing the wife because his mother is how she is.", "NTA. What was Callie trying to accomplish", "NTA\n\n>She says it was an intentional snub and needs to be addressed\n\nThe entitlement is strong in this one; my sympathies to you.  This is an issue (if even that) between you and your mom, so that's up to you to manage, not her.", "NTA. Callie needs to stay in her own lane. Your relationship with your mother is *yours* and not something Callie gets to control because she’s your wife now. You warned her in advance that she was on her own if she chose to pursue this fight with your mom. Hopefully Callie learned a lesson about minding her own business.", "NTA. Your wife is choosing to pick a fight about this, & choosing not to understand the difference between a specific mother/son dance & just dancing in general. There are many, much worse things an unhappy MIL can do to deliberately screw up a wedding, & from the looks of this, your mother didn't & wasn't trying to screw up your wedding at all - she just didn't want to dance that one particular dance, with you, & you were okay with it. Also - important! - your wife said she was okay with it at the time, too. So to turn around & get pissy about it because your mother did dance with someone else later on is ultimately just childish. \n\n\nYou told your wife up front that you weren't going to back her up if she decided to pick a fight with your mother over this, & I think you were right to do so. She got into it with your mother anyway, which she shouldn't have done if she wasn't capable of handling whatever your mother chose to reply with. Your mom could probably have chosen a nicer word than idiot, but why should she have to when she's basically being attacked weeks after your wedding for not dancing the mother/son dance, but dancing other songs, which she was told was okay at the time? You're not an asshole for letting Callie understand that just her being your wife doesn't magically make every action she does or thought that crosses her mind the correct one & you'll defend them to the death.", "NTA. Sounds like your mom had an overload of anxiety about having to be in the spotlight with all eyes on her and you dancing center stage. I've never cared much for these sorts of traditions, as it feels like a kind of forced intimacy in front of a whole audience. Your mom was super uncomfortable, you understood, and that should have just been the end of it. \n\nI'm not sure what your wife hoped to solve by hashing this out with your mom, other than to stir everything up. I mean, it's in the past now, so what did she expect your mom to do about it?", "Normally I think husbands should always refund their wives but you are NTA here. Adults need to learn that not all feelings need to be explored and sometimes you let stuff go. \nShe needs to learn the old adage “you can be right or you can be happy”", "No, no. You do not \"need to back her even when you don't agree with her\". That is a very immature attitude. Enabling and support are not the same. It seems Callie can't tell the difference between injustice and a bruised ego. NTA.", "NTA let me get this straight… \n\nSo your wife is mad that your mom had anxiety over the SPOTLIGHT being on just her and her son for the mother/son dance. You were kind and understanding to your mom and your wife is pissed because YOU didn’t get to dance with YOUR mom. She’s the AH, not you. \n\nThere is a distinct difference between dancing in a crowd with people around you dancing too and doing a solo dance in front of a crowd of people, many I’m sure she didn’t know. Your wife is being very insensitive, selfish and quite frankly bratty. She picked a fight with your mom over something you clearly don’t care about. “It wasn’t even something I cared about.” As you only were doing it “for tradition’s sake” not for any sentimental, life changing, importance. How ever will you recover from missing this dance? /s \n\nDid she do her Father/Daughter dance? My guess is yes, so she needs to stop instigating nonsense when you clearly couldn’t care less either way. This was YOUR dance not hers.. \nBuckle up for a fun life of pettiness and pot stirring, she sounds fun.", "ESH. Telling your mom to not call Callie an idiot is NOT agreeing with her or backing her up, it's standing up for the woman you married. You could have told your mother that while you didn't care about not dancing, that treating your wife that way is unacceptable.", "NTA.  Your wife is as toxic as your mother.", "Is it possible that your wife was pissed for you ? Because your mother's explanation is just BS.", "NTA you communicated beforehand and it was her choice to bring it up regardless. \n\nAlso the back me up even if you don't agree seems like a pretty big red flag to me. I think you need a good and honest conversation with your wife about this.", "As someone who takes things to heart, I somehow understand your wife but she didn’t have to talk to your mom about it, because for some reason it feel like your mother either loves playing the victim or shearing just a great attention … person. \n\nHOWEVER you should have told your mother off for calling her an idiot. What type of response is that? It’s clear she did that on purpose (getting even more attention, since all the attention was on you and Callie) and got mad for being call out for it. \n\nI feel like the major AH is your mother for being such an attention seeker and calling Callie an idiot for expressing herself. (It depends indeed how Callie talked to the mother, but since you didn’t mention Callie being out of line, I’m going to assume she wasn’t out of line). The second AH is you simply for not telling you mom to STFU with the name calling. She’s not a child, she’s a grown ass woman who need to be able to have a conversation on a topic. You don’t just get to call someone an idiot just because you feel called out ;) \nI’m in between with Callie. I might be biased though.", "Is that you, MIL troll?\n\n8/10 creative but not enough drama.", "Mil troll.", "Your wife was out of line. Not sure what she thought she was going to accomplish. And I’m not sure why she’s so butt hurt that you didn’t do a mother/son dance. \n\nESH\n\nYour mom needs some therapy. My mom pulled drama crap at my wedding too and it’s just sad to see adults behave that way.\n\nYou’re the AH for not stepping in when your mom called your wife and idiot.\n\nBut the biggest AH is your wife. There’s a difference between being assertive and what she’s doing which isn’t “empowered woman” it’s that she’s trying to assert dominance.", "I go with ESH. But you less than your wife. She should have let it go. But you can’t say that you won’t back her up, not knowing how the conversation will go. If your mother insults your wife with harsh profanities, there comes the point you have to intervene.", "ESH\n\nYour mother for having some weird rule about \"touching her son '*like that*'\" at something I have literally seen at every wedding, and waiting until she was wound up tighter than a drum the day of before saying something.\n\nYour wife for picking a fight. When you become a big girl, you learn to control that urge to \"talk out every feeling you have\" when you know upfront it's going to cause a completely unnecessary fight.\n\nYou for being an ostrich.\n\nSounds like you married someone not too far from what you grew up with.", "So you’ve married a woman who likes to pick fights with your mother? That sounds like it’s going to go great for you. /s ESH", "ESH your mom for.being rude and it does seem she used this as a snub.  You for not saying your mom your decision to your wife.  And your wife because she is making a mountain of a mole hill. \n\nYou all seem pretty AHish.  Maybe therapy and distance yourself from your mom since she is toxic as you claim.", "This seems like ESH but it's not fully clear. Callie had no reason to pick the fight; the mom clearly has issues; and you generally need to have your wife's back or at a minimum do a better job of discussing the matter with her so that you understand what her deeper concerns are. In this case you're probably less TA but still not great.\n\nI think ultimately, though, we don't have enough information to really understand the dynamics here. We need to know what the bigger patterns in these relationships are: you say your mom is \"difficult,\" but like how? It seems like it was pretty over the top for her to be about to come to pieces because she couldn't just tell you that she didn't want to dance with you. Does she have a habit of coming up with reasons that big events need to be about her in some way? Like are we looking at a narcissist here?\n\nCallie picked this fight, and clearly has beef with your mom. You've indicated that they've had problems before--how bad has it been? What have previous fights been about? You said Callie wants to talk things through all the time, which normally is a good thing!, but maybe that is just completely contrary to your mom's whole vibe?\n\nIn general, dude, I think you sound like you're in a position where your wife and your mother are going to fight. You need to figure out how you're going to manage this because it's not going away. Maybe you address this directly with the two of them and try to work it out? Maybe you end up needing to cut one of them out (which could possibly mean the marriage failing). But look man, this sounds like a systemic issue that you need to get a handle on somehow because it's not going to go away.", "Esh bordering on YTA. Mom is an attention seeker. All attention to her before the wedding for the dance, having a breakdown so all had to run to her...mother/son dance was news? Every wedding (almost) has a mother/son dance. She could have brought it up at any time so it could be handled and addressed. Instead she waits until right before wedding. Groom could have danced with someone else, for example. And then, after hating to be touched and all that, is going wild on the dance floor with son's drunk boss? Talk about center of attention. So I call BS on mom and my guess is OPs wife is upset, not just about this instance, but about all the other times mom has made her needs the center of attention. So, OP step up. And what you think is stupid, may not be stupid to your wife cause situations and behavior cumulate.", "ESH. Callie should prob let it go but letting her call her names, is different then just not supporting her on the argument. There is a difference. It sounds to me like this has built and built and now the wedding pushed it over the edge for Callie. Are you *sure* you stand up for her as much as you think you do? Maybe just check in with Callie and see if it was really just about this one instance or if it’s added up?", "I wish you would have insisted more in explaining to your wife that: \n\n1. You were the one who had the conversation with your mom, and your judgement is that it wasn't a snub but genuine discomfort. \n\n2. No one gets to decide who touches someone else in which way - your mom has free reign over her bodily autonomy and can choose which people she is comfortable being physically close to, even on her son's wedding day. \n\n3. You were not upset about not doing the dance, it worked out great for you. She will not get to be offended for you.\n\n4. This is not her fight, this is between you and your mother and any issue has already been resolved without your wife's involvement.\n\n5. Her pressing this issue is not only confronting your mother, she's also disrespecting you in your decision about -your- dance.\n\n6. This is not about her and the cancelled dance does not involve her or \"snub\" her in any way. This is a display of affection between mom and son, and if this is not how you are comfortable expressing affection with each other then that is your personal choice and not something your wife should be so judgemental over.\n\nYou went neutral instead of taking a stand, and therefore allowed a conflict to happen -in your name-. Hands off is not the best approach when people are trying to fight your battles against your will.\n\nESH, except your mom. You for not speaking your mind and standing up for your own decision about the dance, Callie for desperately searching for things to be upset about and butting in and creating issues where there are none.\n\nOh, and Callie gets a gold star in AH for this:\n\n>she said I failed in that situation and I need to back her even if I don't agree with her.\n\nSo if you two are having an argument, do you have to back her opinion against your own, or is it just when she's speaking with someone else that you have to pretend to agree with her? So when do you get to have your own opinions? That's just insane, and not how marriage works. Defend each other from viciousness - yes! But you are still two different people who can have different opinions out in the world. And she doesn't get to pick a fight and then have you fight it for her, FFS... She can fight her how battles and let you fight yours, and you can help each other when it's actually needed (not to secure a petty victory, but to protect each other against harm).", "INFO: Why are you not weirded out that your mom thinks dancing with you is sexual?", "NTA.\n\nYou've drawn a line in the sand regarding your mum, good on you. Your wife needs to learn to do the same.", "You went from N T A to ESH once the name calling started. Your wife should have left it alone right at the start. She wants to address it anyway that’s on her, she’s the AH, you’re not really because you already asked her to drop it. Your mom called your wife an idiot, she’s an AH. You just sat there while your mom called your wife an idiot, you’re an AH. You can disagree with your wife and still stand up for her once that line is crossed.", "YTA - There's a difference between backing someone up and defending them from abuse. You could have allowed them to talk but still corrected your mother in a way that didn't escalate things. Just a \"hey hey... Be civil\" would have been fine and still kept you out of it. Name calling is petty and childish, and she shouldn't be doing it regardless of who is right or wrong.", "NTA. There is a difference between having someone's back and fighting their fights for them. In this situation I think it would have been patronizing for you to step into Callie's fight, she needs to be able to hold her own.", "NTA. Good on her for trying to defend you, but like you said, you were okay with it. If anyone should have been slighted, it should have been you, but you didn't seem to think it was a big deal. The spring should not rise higher than its source. Looks like Callie just wanted to have a reason to stir up drama.", "NTA.  The dance was you and your mom,  it had nothing to do with Callie.  You told her to stay out of it and she didn't so she got what she deserved.", "NTA, why, why would you talk this one out.  It reminds me of an old saying when you fight it out with stupid stupid will bring you down to its own level and win every time.  I’m not calling anyone here stupid but obviously your mom has one thought process which I find weird and your wife is hyper sensitive to find closure on every process.  Why have a convo on this one let it go and move on.  Maybe this is the difference of the genders because I would have rather enjoyed getting a beer and staring into space, some call this burying my feelings but I find it delightful.\n\nSo in summary your wife wanted to talk out a situation that happened between you and your mom and your mom has some really weird logic.  You said nope not getting involved because I told you this wasn’t a door worth opening and feelings would get hurt.  I agree with you, this is weird drama….\n\nI guess you could have tried playing mediator but that seems like a no win for you.", "ESH. You should have stood up for your wife. If you agreed with her or disagreed with her was irrelevant. If someone is insulting your wife, you stand up for her and say that’s not ok. \nCallie should have followed your lead. If you wanted to handle it a certain way, and it was an issue involving you, she should have let you handle your family the way you see fit. \nYour mom should not have insulted your wife. Whether she likes it or not, your wife is family now and the person you chose to be with, name calling was unnecessary.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI recently got married to the love of my life \"Callie\" she has issues with my mom and i've always supported her as my mom is difficult. My mom knows I won't let her be bitchy to Callie and I hope Callie knows I have her back.\n\nThe day of the wedding my mom was radio silent. I could tell she was getting more and more agitated just because she didn't look good and was starting to get pale and shaky. Finally her brother came and said I needed to talk to my mom she was going to pass out. I went to deal with it and she was so upset because she really didn't want to do the mother son dance. She had a hard time even communicating this and was just squeezing the shit out of her brother's hand and like I can't, I can't. \n\nI finally got it out of her and said it was no big deal. I just casually let the DJ know and they took the song out of the lineup. It wasn't even something I cared about. We were just doing it for tradition's sake and my mom doesn't like to be touched so really it is fine.\n\nI explained to Callie and she seemed ok with it. During the reception my mom danced for hours with my boss. My boss is an attention whore and was also drunk, so super attention seeking dancing, throwing her, spinning her, etc. Callie was clearly pissed. She made a comment about oh look who can clearly dance and I asked her to let it go.\n\nWe are back from our honeymoon and had to see my mom for a holiday thing. Callie is big on talking out every feeling you have and wants to have a conversation with my mom about her behavior. She says it was an intentional snub and needs to be addressed. I told her I'm not going to control her, but in this situation I won't back her as I asked her not to bring it up.\n\nWell she did and my mom called her an idiot. She got a nasty tone and said that man she was dancing with wasn't her son, so it is completely irrelevant and she didn't want to touch her kid like that. Callie did hold her own and clap back, but when we were alone told me she was extremely hurt that I let my mom call her an idiot. I reminded her of what I said going into it, but she said I failed in that situation and I need to back her even if I don't agree with her.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. No, you don't have to back her when you don't agree with her. We don't back our SO's when THEY are the one's doing the bad behavior. You even WARNED her against this. Essentially Callie didn't respect YOUR boundary to leave your mother alone on this topic. Her own need to attack your mother was *more important to her* than your feelings were. So, against YOUR wishes, she proceeded to attack, and now she's whining about it? She reaped what she sowed.", "NTA  since Callie likes to tal things out. Talk to her until she accepts that she cannot dictate the relationship you and your have. Mom didn't want to dance. You were ok with it. Mom dance with someone else. You were still ok. Callie cannot decide that your both wrong here. \n\nIf she wants you to defend her against your mother,  she needs to not make unnecessary drama too. You could've told your mom she went to far by calling Callie an idiot. Now you both have something to work on.", "NTA. I don’t understand why you always have to agree with you partner over anyone else, sometimes my partner is wrong. Just because I married them doesn’t mean I have to agree and back them up with everything. \n\nYour wife chose to get into it with your mom, the dance didn’t matter to you so what’s the big deal that it didn’t happen.", "NTA.  I'm giving your mom the benefit of the doubt and assume that her fear was real.  You didn't give any indication that she was anything but genuine in her feelings. I'm guessing that she was relieved after you accommodated  her anxiety and then could relax and party.  I'm sorry that your bride took offense.", "Wedding troll.", "NTA\n\nYou asked her to let it go, she didn't, you told her you wouldn't have her back if she said anything, she started something anyway.", "NTA. This sounds exhausting.", "ESH and your mom is weird", "NTA\n\nWhy does your wife care, at all, about an interaction between you and your mom that you don't even care about. She sounds controlling... Good luck with her bro.", "Nta bordering on esh based on the idiot comment. Your wife was stirring up drama when there didn’t need to be drama- it was your place to be upset or not based on what happened at the wedding and you weren’t, so that should have been the end of it. The idiot comment was immature and annoying, but I give you a pass for not saying anything only based on not wanting to escalate an argument that shouldn’t have happened in the first place and your wife seemed to be able to defend herself. You didn’t take your moms side, you just didn’t take a side at all. \nGenerally I don’t think backing up your spouse in an argument for the sake of being supportive is always a bad thing, but this situation seems unnecessary and your mom seems to have some anxiety or problems that are above Reddit.", "NTA\n\nYou setting a boundary before hand was a great communication move. Wife disregarded you and got exactly what she paid for, which was also good on your part, sticking to the boundary.\n\nJust because you're always supposed to have each other's backs doesn't mean it gives you carte blanche to act a fool and expect the other to fight your battles", "NTA You said you won't defend her. if it didn't bother you then she didn't need to defend you by confronting your mother.\n\nBut it was definitely suspish that she didn't wanna do dance with you but wanted with that guy", "NTA. OP needs to sit down and have a long conversation with his wife. What’s the relationship going to be with his family. Fix this before the kids come along. Does the wife live you more than proving a point with mother in law.", "NTA - You warned her. Callie picked an unnecessary fight so she should be prepared to accept the consequences. Additionally, your mom has the right to choose who she wants to dance with and when.", "Callie needs to reflect on what her end game is.  Does it benefit the two of you to air it all out, or not?  Who benefits here?  Are you all better off now that this discussion has taken place or are you all worse?  NTA, and have your wife talk to a therapist instead of stirring up unnecessary drama.", "I definitely wouldn’t let my mom call my husband and idiot even if they disagreed. Not like I would have made a scene or anything prob would have at least said something like “mom I get why you’re upset but plz no name calling” I do understand you warned her though lol her fault.", "NAH. I get that Callie wants to speak her peace. But, you have made peace with what happened and don't want to reengage. I love my husband. Truly. I just don't always agree with him. So, I think what you told your beloved wife was fair and just. You love her. But, no way are you always going to agree with her.\n\nI am far more confrontational than you seem to be and even I don't always want to argue. Sometimes some shut up and let the sleeping dog sleep works for me. So, I feel you.", "YTA - you can tell your mom not to insult your wife while not backing your wife up for quixotically trying to confront your mom. \n\nYou do know that, right?", "NTA.", "INFO: You mention that your mom can be difficult - had this sort of thing happened before (ie, your mum finding some way to make everything about her and looking to gain sympathy/attention)? As a stand alone incident, it doesn’t make sense to make such a big deal of it, but if there are other things of a similar nature that have happened, I can understand Callie’s frustration.", "NTA.\n \nSometimes spouses can step out of line and it's reasonable to say I'm not supporting you in that. She didn't need to insert herself into being offended over something that wasn't about her.  Since the issue was between you and your mom, your wife should have respected your feelings on it.  You weren't upset and didn't feel the need to address it.   She did it anyway to appease her own emotions and caused unnecessary conflict.  She gets to deal with the consequences.", "Callie anyone you confront and talk trash to has the option of putting you in your place - no matter how righteous and \"right\" you feel. Its how arguments work. You argue. Someone else argues back. You insult. They insult you back. Most people, right or wrong aren't just going to sit still while you go off on them. Surely you know that?", "You told her in advance. The whole point is ridiculous. Please explain how she is snubbed by your mother refusing to dance with you? If it’s ok with you it should be ok with her. NTA.", "NTA. Callie picked this fight knowing your response. You understood her feelings but knew it would serve no purpose with your mom but she pushed ahead. At this point, this is drama that Callie has created.", "NTA \n\nYour wide put her nose into something that honestly does not concern her. You didn't care about the dance, so she should have left it alone, but she chose not to.", "NTA. Having someone's back is a two way street. It seems she didn't have your back when you specifically told her to drop the issue.", "ESH\n\nIf OP/Groom doesn’t care about the mother-son dance idk why the Bride is upset…\n\nIt’s out of line from the OP’s mother to jump straight to calling her an “idiot”.\n\nThis post reeks of: “we’re all just really honest with each other”…which is generally code for T.A.", "YTA \n\nWhy was your mother acting this way? Was there a medical issue which passed (Like low blood sugar)? Or was she acting that way because she was having a temper tantrum? \n\nTBH, it’s a huge insult that she chose not to dance with you, and an even bigger FU that she danced so much afterwards. It was a dig at your wife, imo. A childish, petty, nasty, r/justNoMIL worthy stunt. \n\nAnd for you to call it stupid is wrong. You’re invalidating your wife’s feelings. And you say you have her back…but you’re fresh off your honeymoon, and showing the exact opposite. \n\n>I told her I won’t back her\n\nAnd then you did it again by not stepping in and standing up for your wife when she was insulted by your mom.", "ESH. Mainly you only suck because letting your mom name call is just low. Your wife sucks because a marriage is a 2 way street. You asked her to please not bring it up because it didn't matter and she chose to do it anyway. Your mom sucks because she called your wife an idiot. \n\nNo person should be forced to do something that makes them uncomfortable. Honestly, if I did the whole big wedding thing, I wouldn't have done the father daughter dance not because of some improper  reason but we aren't traditional and it would be weird.  \n\nI think you and your wife need to have a conversation about this situation. Sure she's someone that needs to hash things out, but if you normally have her back, she needs to have yours when you make some requests like this sometimes.", "YTA, and you mom is too with the ridiculous fake momentary fibromyalgia fit , your wife was 100% right to discuss it instead of enabling it\n\nSo you with should have confronted your mom for her terrible behavior towards your wife, instead of silently supporting it, now wife has learned to either abruptly leave when horrible MIL acts horrible or escalate and really destroy her verbally (and you better not take moms side and “defend her from the fallout” when that happens\n\n*edit to point out OP said mother was a former dancer and loves being in the spotlight but was focused on the dance being “incestuous”, and that mom doesn’t like wife and has been pulling away from OP\n\nSo my response is the only home run", "My MIL also refused a mother-son dance at our wedding. It hurt my husband’s feelings, but we weren’t surprised. We just didn’t do parent dances and I asked my dad to dance separately later and my photographer knew. My mom ended up dancing with my husband and the photographer got one of my favorite pictures of my husband during the dance. Just pure laughter from them both. \n\nHe said he never wanted to bring it up. We never did. It changed their relationship entirely and she doesn’t know why. And she won’t ever probably. But that’s not my job. It’s his mom, he doesn’t want to talk about it with her, so we never did. \n\nIt’s not hard to listen to your spouse about something that affects them and their parents alone.  I don’t get OP’s wife stance here. OP should be the one taking the lead on this issue, she should follow. Period.", "If Callie is pissed, I get that part. But she should not go to bat for her husband's sake when he clearly does not want this. So, confronting her MIL was her choice. And it stung her a bit.\n\n I only want my spouse to back me when I'm right. If I'm not, I'd really rather gently be told this than make a fool of myself off on a tangent over nothing? And if I ask him to stand down on an issue that is about me and how I am being treated - I expect him to respect that I get to make the choice.", "That’s ridiculously wrong", "It’ll be fun to learn what fights are worth having while this woman spirals. Hope you like your mom more than your wife.", "In OPs retelling of moms explanation weirdly sexualizes the dance though.  I get anxiety and jitters.  Never been a fan of public speaking.", "Yup, my spouse and his mom are close but she couldn't handle more than thirty seconds of the mother-son dance bc she's shy and doesn't like being any kind of center of attention. It's not the same thing as regular dancing.", "Go tell that to people on Reddit, they think that everyone should always side with their S/O even if they are in the wrong.", "She finds dancing more of a sexual and/ or romantic thing. We aren't close at the moment and she stopped hugging me a while ago. She doesn't like being touched in general and has been getting more and more stand offish with me.", "Yes! This has got to be the same troll, with the neurotic MIL and her oddly close brother.", "Agreed. Also a weird sexual component.", "Being the first person to not be a doormat for MIL", "Completely wrong, she has to deal with monster MIL and a son that supports it \n\nThe only logical step is for her to refuse to deal with and be around MIL", "To be fair my mom has no issue with being the center of attention. She used to be a professional dancer/show girl type thing. Her issue was dancing with her kid felt incestuous or something, but she was definitely the center of attention dancing with my boss", "Monster Mother in-law  is causing all the trouble. None of you see her manipulation going on. New wife sees right through the monster in-law manipulation. Son is a weak man.", "But Callie is 100% the instigator here, and OP told her from the beginning that if she chose to pick a fight about this with his mom then she would have to go it alone. \n\nClearly, the thought of having to perform this one particular dance triggered something in the mom to the point that she had an anxiety attack. Callie insisted on triggering the mom all over again and then acts surprised at the result of ambushing someone and dredging up their deep anxiety. \n\nIf you ask me, it's *Callie's* treatment of the mom that is unacceptable.", "[removed]", "Isn't his wife treating him poorly by going against his wishes over a nothing burger?\n\nIsn't this a little sexist? If she sought out the conflict, then she needs to handle it herself unless the mother really crosses a line.", ">It wasn't even something I cared about. We were just doing it for tradition's sake\n\nNo, wife is pissed for the sake of being pissed.", "No, it absolutely isn't.  There is a huge difference between dancing one on one while everyone watches and dancing as part of a party.  What a bizarre thing to say.", "I could see this. My husband's family are steamrollers, and it would drive me crazy that he didn't care if they were dismissive, unfair or mean to us. It took years of marriage before he acknowledged his feelings and realized he was worthy of being given respect. Once he set boundaries, they were so much better, and now we have a much better relationship. \n\nMaybe she's sick of him being passive and not defending himself. So it might hurt her feelings even more that he didn't defend her from name calling when she wouldn't be in the fight if not for him.\n\nI can appreciate he didn't ask her to do it, but some people, myself included, can't sit idly by when someone is disrespectful to their partner.", "Completely wrong, wife is the only normal person and won’t be accepting crazy MIL behavior,\n\nInevitably mil won’t be welcome in their home and daughter won’t be with her but from OPs other comments that’s clearly what MIL is trying to make happen", "> Does she have a habit of coming up with reasons that big events need to be about her in some way? \n\nNot really about her but she does just shut down when she feels like she can't use words. She stops talking and just like freezes, though it's pretty clear she doesn't want my attention during those little fits. She will actually hide from me. The only person who can be near her when she gets that way is her brother.\n\nShe is just difficult in general because she really struggles with communicating. She doesn't like Callie, doesn't want to talk about it, and when she realized I wasn't ok with it she began pushing me out of her life. She kind of acts like she's scared of me, like doesn't want to be touched, tries to not be alone with me. She is very snarky and tbh I find her funny but Callie doesn't and I 100% respect that and told my mom she needs to stop. She now claims she is \"shy\" which lmao no she is not, and claims she doesn't know what to say.", "That's nice, except: \n\n>It wasn't even something I cared about. We were just doing it for tradition's sake\n\nWhy making such a big issue out of a none-issue?", "> So I call BS on mom\n\nI feel like she genuinely found it sexual but didn't want to hurt my feelings as our relationship isn't great anymore. i always knew she liked attention and liked dancing (used to do it professionally) but to be fair to her she isn't even comfortable hugging me anymore", "She is entitled to her opinions and to be honest I found it a bit weird too. Not necessarily sexual but I view dancing as more of a romantic thing. This is a woman who already struggles with being touched and doesn't even want to hug, so i wasn't surprised she felt that way", "So now he must fight with his mom because his wife choose to pick a fight? Like op told her upfront and she still choose to pick a fight. The ah here is the one who picked a fight for someone else and then tried to blame op for not wanting to fight.", "I love that this is abuse. \n\nWas calling her an idiot mean?  Sure.  But my god, you people call everything abuse now.", "    \"I told her I'm not going to control her, but in this situation I won't back her as I asked her not to bring it up.\"\n\nSo, Callie decided to have go at MIL anyway.  She gets what she gets.  IMO it is an idiot thing to do, picking a fight with someone about an issue that does not concern them and when the \"injured party\" says they aren't injured.\n\nI agree with an other commenter - Callie needs to stay in her own lane.\n\nNTA", "She shuts down sometimes and just won't talk, look at you, etc. but it is very clear she doesn't want my attention during those episodes. She wants nothing to do with me and the only person who can get close to her is her brother.", "> *\"Why was your mother acting this way? Was there a medical issue which passed (Like low blood sugar)?\"*\n\nI mean, should they have demanded she present them with a doctor's note? Weddings put a *ton* of pressure on people and it sounds like the mom had a bit of an anxiety attack. Forcing someone to do something they are very uncomfortable with for the sake of \"tradition\" is just wrong. OP saw that his mom was extremely uncomfortable about having a spotlight dance with him and he understood and didn't press her any further. Good on him. That's called \"respecting other people's boundaries.\"\n\nOP's wife needs to learn how to pick her battles more wisely and not make mountains out of molehills.", "All the points you made are why you think op should be offended, he says he’s not. Ops wife invalided ops feelings when she choose to picks fight. So no op should defend meanness fighting just cause his wife feels like it?  Ops wife doesn’t get to be offended for op and then get mad that he stuck by his word.", "> Or was she acting that way because she was having a temper tantrum? \n\nanxiety about impending unwanted touch. I'm not insulted because I don't think anyone owes anyone unwanted touch", "OP warned wife that her feelings may be valid h it the confrontation wasn’t. She pushed ahead and suffered the consequences. This is life.", "> fibromyalgia \n\nI'm not sure you know what that word means", "This is how you do it. What a beautiful photo it must be.", "My dad felt uncomfortable with the whole thing. He never danced in public and I knew he would do it for me as he felt it a duty of fatherhood. No one was watching us twirl around in the candlelight, though. I looped old video of me and my sisters and brothers dancing with our feet on dad's when we were kids. And people were watching the video - not me and pop.\n\n Now, dance with his wife? That wasn't awkward for him at all. That was just fun between them. Gotta' love parents as the unique constellation they really are. 😊", "Ok", "It's not really relevant, though, is it? Regardless of her reasoning, she was nonetheless very uncomfortable about having to do this dance and so she bowed out. Even if we think their reasons are silly, it still doesn't mean someone should be forced to do something they don't want to do, especially when it causes them so much anxiety that they get a panic attack.", "[deleted]", "That's why I'm here, to inject a note of reason and common sense. It doesn't work...but that doesn't stop me from trying...", "Then you should have planned accordingly to include her in a way that was comfortable to her. My ILs don’t like the spotlight either and preferred not to be part of the procession or dance so we found other ways to honor them in our ceremony and reception. I’m going to say YTA more than the two of them. Mild ESH", "Its turning hard to believe in any of this storys", "She wouldn’t have had to deal with it if she didn’t run her mouth.", "MIL did nothing to Callie in this situation Callie is 100% making up all of the drama and needs to cut it out. \n\nSure Callie could reside to be around MIL for this but Callie would be an ahole and even bigger idiot.", "It still seems from your original post that she has always felt this way with regards to the touching and her children. While a mother/son dance is innocent enough it could be triggering for her for something else. I truly wonder if there is more to it all, perhaps from her childhood and upbringing that would cause such a visceral reaction. If it really has nothing to do with the attention being on her. Either way kudos to you for not pressuring your mom into something that clearly made her uncomfortable and almost physically sick. \n\nI think it’s pretty safe to say that we all don’t agree with our parents behaviors 100% of the time. The difference is you make the choice to accept their quirks and love them or you do what your wife is doing to your mom, and it’s not ok to go at her over something she was clearly uncomfortable doing. Good on you for not ganging up on your mom with your wife. Should she have called your wife an idiot, no. That should and needs to be addressed. The bigger shame is on your wife for starting it all in the first place.", "Am I the only one who finds this part of the story the most odd… Why is no one asking more questions about that?!", "There is something seriously wrong with your mother. No wonder your wife is pissed. If you had a backbone you would be too. You should have had your wife's back. You have been enabling your mother's crap for too long. Time to go low contact with your mother.", "Was there any explanation of the reception prior to the wedding day and opportunity for her to decline, or was it some surprise you two were going to lambada?", "Can't be upset with someone for calling a spade a spade", "[removed]", "How is this sexist? Genuinely asking, not trying to bait you into an argument.", "No, MIL faked a medical problem and showed she was full of BS\n\nNew family member isn’t just accepting it like everyone else", "OP's mother didn't say anything about dancing one on one but about her son touching her. The other dude touched her plenty and she had no problem with that.", "I'd argue it's more bizarre to feel weird about having to innocently touch your son's shoulders for the length of a single song.", "Okay whaaaaat are you leaving out here. Was there something that happened where your mother suddenly became scared of you and didn’t want to be alone with you?", "I don’t think he did. His fiancé did.", "This is not normal.", "She found the mother-son dance *sexual*?! What is wrong with your mom??", "How? She or you would be the ones to make it sexual. If only she could do a red flag dance. I know you love your mother like we all do but this was a tantrum. (I’m sure mommy will never get upset about having to travel, host a dinner, etc. ever in the future) Your wife has the extra courage lacking in this relationship and she’ll likely need it with her manipulator-in-law.", "She’s not entitled to AH feelings that affect other people", "How is saying calmly “Hey mom, name calling is not ok” picking a fight? It’s establishing rules for adult discussion. OP doesn’t have to be bothered just because his wife is. We also weren’t told how wife started the conversation. “Hey MIL, this bothered me” also isn’t picking a fight, but we don’t know how it went down. I stand by ESH.", "Verbal battery, then? You can argue semantics all you want, but name calling is within the textbook definition of verbal abuse. I'd apologize for being accurate, but I don't think there's much point if something that tiny offends you. Lol", "I love how Reddit takes things to such a ridiculous extreme counterpoint like anyone was asking for a doctor’s note. Logically, not dancing mother son on the day of, without any forewarning like ‘hey I don’t want to do this on the wedding day’, is weird. And asking if there was a medical issue was trying to make sense of weird behavior. You don’t go from being uncomfortable with dancing with your son on his wedding day, to making a scene dancing with his boss all night. That isn’t logical and it doesn’t track.\n\nAnd dismissing this as a molehill, when it actually might be a mountain for the wife, could potentially destroy this marriage. It doesn’t matter whether you or I see it as a mountain or a molehill. It matters that his wife sees it as a mountain and he sees it as a molehill. And coming to Reddit for advice from people who may not understand marriage, could potentially make OP feel justified in his stance, which could actually further the divide between him and his wife.", "She may be offended. And if she is, that’s how she feels. For OP To just dismiss it is going to damage their relationship. It’s not about how you or I view it. We’re not the ones who matter.\n\nOP told his wife he had her back always, and then specifically didn’t. He didn’t say he’d have her back only on matters he agrees with.", "We have gotten to a ridiculous point in life where we’re talking about ‘unwanted touch’ from another son dance when she’s all over his boss.", "There’s no twist", "MIL intentionally created drama, the only appropriate response is to confront it", "MIL faked a medical incident, OP said she loves dancing and being the center of attention, to create drama and a rift solely because she doesn’t like wife", "I still go back to the spotlight aspect, even though she may have been a dancer/show girl type thing; If she has any icky feelings towards her (albeit odd) incestuous ideas surrounding dancing with her son (hence why I question past trauma), then people watching her in that uncomfortable situation, only amplifies that strong reaction.", "Yea this comment really adds a new dimension to the original story - it makes everything a lot weirder. If the reason the mom didn’t want to dance with her son was because it felt incestuous then is that what the wife is actually mad about? Because if all of a sudden on my wedding day my partner’s parent thought something was incestuous, I’d be confused and annoyed as all hell. Also if it was *my* parent who thought semi-hugging me and swaying in any way had sexual vibes, I would for sure have thoughts and feelings about it", "Because common sense eludes some… many. Plus if you don’t know what a traumatic reaction is or looks like.. then it’s easier to just blame the mom (victim) for being dramatic versus realizing something terrible could have happened to her that she lived through to cause her to react that way. She also could have suppressed those memories and not understand why she feels that way herself. Hopefully OP encourages his mom to seek therapy.", "We are low contact. I don't see why I would want to force fake affection from anyone. I don't want unwanted touches from someone upset by it", "We didn't talk much about it. She knew it was going to happen but she has the worst communication skills and was probably scared of hurting me", "> *\"I could tell she was getting more and more agitated just because she didn't look good and was starting to get pale and shaky. Finally her brother came and said I needed to talk to my mom she was going to pass out. I went to deal with it and she was so upset because she really didn't want to do the mother son dance. She had a hard time even communicating this and was just squeezing the shit out of her brother's hand and like I can't, I can't.\"*\n\nShe's a great actress, then. Here's the thing, people don't need to plead with you and offer you elaborate explanations as to why they are so uncomfortable about doing something in order for you to accept their answer when they tell you \"no.\" \n\nOP saw that his mom was extremely uncomfortable/upset about having to do this one particular dance and he accepted her answer of \"no.\" That's it. He didn't fight with her about it, he didn't accuse her of faking her anxiety, he didn't try to guilt her into doing anything she clearly didn't want to do. Good on him. That's a great example of respecting other people's feelings and boundaries. The new family member needs to learn how to do this as well.", "Faked a medical problem? If you take the post at face value, she probably has anxiety. Dancing with someone while everyone is dancing is one thing. Dancing with your son on the mother-son dance in front of everyone while they are looking at you is another. Those aren't even remotely comparable.", "Common sense says how she presented was clearly a panic attack in the making. Unless he is exaggerating her behavior. Also he mentions she kept just saying she can’t she can’t. HE gave the excuse of knowing she doesn’t like to be touched. What if her reasoning is having the spotlight on her for a solo dance? It’s very different having others dancing around you and you being watched by others…. 👀", "It’s the MIL troll. Hates her son, didn’t want to be a mum, was abused by family/husband, doesn’t like to be touched etc etc. This is really common\n\nedit: Sorry was on mobile. Meant to say, \"This is a really common troll,\"", "Personally, I feel scared of being alone with my father because he was doing things unpleasant to me during my childhood. Never have I ever heard of a parent being scared of their child, unless something like what happened to me happened to OP's mother.", "Nothing happened. She just doesnt really like Callie so we aren't close anymore and she doesn't let many people near her. Her own parents can't touch her", "Well she danced sexually as a career choice - doesn’t seem strange she would view dancing as a sexual activity.", "First of all I can kind of get it as I found it a bit awkward to begin with. I've just never danced with a woman who I wasn't in a relationship with or hitting on. I don't necessarily find it sexual, but I am in no way entitled to anyone's touch if it makes that person uncomfortable. My mom doesn't even do hugs. I don't get your examples. Why would she have to travel or host dinners? Who is going to make her do those things?", "No but I'm also not entitled to her touching me", "People are allowed to dislike close physical touch. OP, the only party who would have the right to be hurt, clearly understood and accepted (and even feels similarly as his mom) it without issue.", "Your forgetting this situation was entirely between op and his mom. Op’s wife getting in the middle of it is the issue. What’s the next thing she will be “offended” by?  I agree op’s mom calling her an idiot is rude, but like you said we don’t know how op’s wife started this conversation. It’s just as likely started this conversation off rude, especially seeing how she choose to jump in the middle of a  mother son issue.", "I assume op is cool with Callie calling mommy fugues-a-lot any nasty word she chooses as long as  he didn’t agree to defend her? You all suck but at least your wife has a spine.", "Your completely ignoring the fact that she is offended for op, on top of that causing a fight completely ignores ops want for no fighting. So op should give up any personal feelings if his wife says something? Yea that’s definitely a healthy relationship. \n\nThis girl completely dismissed ops desire to not fight with his mom of the silly dance. So he fixed the situation. Op’s wife then choose to go out of her way to pick a fight with op’s mom. But yes she’s the real victim here.", "So because she touches someone she has to touch someone else? Eww. It was probably sexual with my boss. At least it certainly was on his part. If she finds dancing sexual it makes total sense why she didn't want to dance with me", "[deleted]", "Why are you so obsessed with this thread that you feel the need to reply 12 times to ignorantly tell people their thoughts on the matter are wrong? You should stop. This isn’t a debate sub. Go show off your foolishness somewhere else.", "We don't know that MIl faked a medical incident.\nLiking dancing is not the same as always wanting to dance or be the center of attention. You can generally like x, but not want to do x in a specific situation. \n\nThe mom/son dance really does not have much to do with the wife, it is not bout her. \n\nThe potential aggrieved party here would have been OP, OP didn't care. \n\nI think the person trying to make drama is the wife. \n\nDancing with the boss is waaaay different than dancing with he son during the mom/son dance.", "OP later said mom loves dancing and being the center of attention, she was clearly doing it for attention and to create drama and a rift with the asinine explanation that she felt it was too sexual", "This is exactly what I thought. The not wanting to be touched but very willing to let a stranger touch her…the daughter in law wanting a confrontation. I mean at least this time MIL Troll didn’t put the MIL in a bikini?\n(This may be a true AITA post but it has many similarities to the MIL Troll poster’s main theme)", "Even for Reddit, that's a reach", "Maybe it doesn’t involve you but have you considered that those behaviors aren’t typical? Something happened to your mom. AND, if she doesn’t want to be touched by HER parents and thinks a mother/son dance is incestual…", "I'm on the wife's side, so you might be talking to the wrong person. Lol\n\nI don't think anyone should be name calling in a civil discussion.", "Gotcha, if the crazy part was added later", "Oh I would bet anything that some serious shit has happened to her, but she doesn't want to talk about it and I'm not entitled to know.", "Okay well then you need to give Callie that information so handles with a little more care. And if she knows that and doesn’t care, well..", "YTA. Your mother had no problem dancing the night away with your boss and couldn’t dance just one innocent dance with you. Your mom is TA, as well.", "First of all you don't talk to other adults about their \"behavior\" as if they are a child. She went looking for trouble and she found it. You warned her, not your problem and certainly not your fight. \n\nIf she can't get through life without expressing every thought in her head this will be an ongoing issue. And it's good you set up some boundaries unless you want to go along for the ride. NTA", "[removed]", "NTA in this instance.", "NTA you wife chose to POKE THE BEAR and you warned her. She should have left well enough alone; it's your mother and your dynamic regarding the dance. IMHO not a hill worth dying on.", "NTA- if callie wants to pick stupid fights , it's not on you to get involved. Callie needs to learn to just ignore your mother, she'll be much happier in the long run.", "NTA\n\nas a person who gets anxious with attention from strangers...i get it. i assume mother-son dance means only you 2 would dance whereas everyone else watches...whereas rest of the time there were other people danciny in the area, meaning less attention on your mom. 2 completely different things really.", "INFO: Was the mother-son dance a formal thing, where everyone was going to be watching, like with the husband & bride dance?\n\nBecause it sounds like your Mum got anxiety due to the pressure, and she was able to relax and dance with the Boss because that pressure was removed and no one was paying attention to her. If this is the case, your wife is a massive AH for bringing it up at all, especially when you weren't offended, & owes your Mum an apology.", "NTA\n\nWhy did she expect you to back her not backing you? You told her how you felt but how she felt overrides your feelings?", "NTA\nSo exhausting", "NTA. Callie made an issue out of something she shouldn't have. You didn't care about the dance. Callie just wanted a reason to argue with your mother. You being expected to back her even if you don't agree is absurd. Apparently you aren't allowed to have your own opinions. I feel bad for you.", "NTA she should have let it go. It was between you and your mom it had nothing to do with her.", "I don’t think these dances are a thing here in uk and I am kind of glad as I find them creepy", "My daughter is getting married next fall and is contemplating a mother/daughter dance along with the father/daughter dance. I used to sing Bridge Over Troubled Water to her as a baby and child and she wants to play that. It’s incredibly sweet though unusual. If she wants it, she’s got it.", "NTA, Your mom was the AH and good for you for rolling through it if it truly doesn't bother you. Your new wife fought a battle for you even though you made it pretty clear you didn't want that to happen. \n\nWe had an incident with FIL at our wedding and because my wife got over it and didn't want to address it that's where it ends.\n\nAlso maybe next time you don't need to be in the middle of the fight and you can let everybody have their opinions but you don't need to let your wife be insulted with petty name calling. Marriage is a fun learning curve!", "The thing that sticks out to me here is that because Callie \"is big on talking out every feeling,\" that doesn't mean she gets to force conversations with others because that is just her thing.  Too many people get away with inappropriate behavior (and I think confronting your mother when you asked her not to was inappropriate) because of the old \"that's just the way I am.\" I think everyone here is ESH -- Callie for disregarding your wishes, your mother for calling her an idiot and you for obviously catering to Callie's every wish that so that she thinks it is okay to start shit. Good luck in the future.\n\nEDIT:  I think you also need to realize that Callie bringing this up and not letting you handle your crap with your mother is just Callie wanting to control things. Wanting to discuss every feeling she has is manipulation.", "NTA. The mother-son dance concerns exactly two people: the mother and the son. If you didn’t feel the need to argue with your mom, Callie had no business bringing it up.", "Not everything needs to be discussed or hashed out. Your wife is out of line here. You told her to leave it and really, it had nothing to do with her. Your wife caused this.\nNTA", "Nta but calling someone an idiot isnt cool. Could have told your mom to chill on the name calling and backed away slowly from the argument imo", "NTA\n\nShe *is* an idiot.", "NTA.  Nothing good was to come from your wife confronting your mom.   Some things are best left alone", "NTA.\n\nYour mother performing the mother-son dance at the wedding is between the two of you. If you're fine with it not happening, that's all that matters.\n\nI'm sad Callie can't understand that perhaps the idea of the entire room being focused on one dancing pair can cause panic and distress, while relaxing and being one of many dancers (even if garnering attention) can be a very different experience for some people.\n\nYour wife had no right to address the situation with your mother because it wasn't about her. You communicated with her ahead of time that you did not want her to do so, and that you were not going to back her up in this particular discussion. She did it anyhow, and expected you to fold.\n\nIt sounds like Callie may have boundary issues, as this was a clear overstep.", "NTA You deal with your family, and she should deal with yours. You and your mum spoke about the dance before hand. She had social anxiety, which is very common and didn't want all eyes on her at that moment. She was more relaxed later dancing with a stranger. You dealt with the situation at the time, in person and with your mum. It had absolutely nothing to do with your wife and she should never have confronted your mum, she was very much in the wrong. The mother son dance is an extremely modern addition anyway. Not one that goes way back and would hardly ruin a wedding.", "Callie needs a little compassion and prespective. There is a very big difference between daning in the spotlight with her son and dancing in a group setting. I didn't want to donthe first dance at my own wedding, but I am happy to dance with everyone all night long. This isn't about her.", "NTA, and NO backing someone when they intentionally create drama just Encourages them to Create Drama.", "Is it a Mother/Son dance or a Bride/Groom dance?.. because I don't understand how she has any say in the matter. Your wife is the A-hole and she was mad at your mom and then you. Sure, your mom could have been more.. tactical.. in her choice of words, but it was stupid for her not to let it go after you asked her to, and she messed around and found out.\n\nWifey needs to get over it... or not and spend eternity angry about a \\[not her\\] dance and being called an idiot.", "So tired of this MIL/DIL storyline", "I cannot fathom being so hot under the collar about dancing. First world problems. NTA", "Nta - callie shouldn't pick fights if she does not want the results of said fight", "NTA\n\nYou warned her, and she did it any way.\n\nThe only thing I can slightly agree with is letting mom name call. Me personally I would have stepped in and calmly told me she can have a discussion without calling names. That is uncalled for. Otherwise staying out of it was best, as you handled your mom in your own way, and your wife felt entitle enough to handle it hers, and didn't like the outcome.", "NAH between you and Callie. I get it, she overstepped. \n\nBut she’s fed up. Your mom is ridiculous and hurtful and she’s recognizing that she is looking at a lifetime of petty disappointments from your mom, and is still figuring out her role and boundaries as your wife. \n\nYou likely could have said “let’s leave namecalling out of it. Mom, I get why being the center of attention created some anxiety. I will say it was difficult to see you be comfortable being the center of attention with my boss, but at this point I’m not surprised or upset. Callie, I get you have my back and appreciate it, but this is not a productive conversation, and I’m asking you to drop it for me.” \n\nRemember you can’t be neutral between them. It sucks for you. I get it.\n\nConsider also that as a married couple, while she’s your mom, Callie’s feelings of embarrassment or disappointment are valid. Her MIL made a scene with your boss at her wedding. You know?", "Leaning to YTA. Your wife is healthier, as something like that would fester. Your Mom sounds like an AH and clearly did it on purpose.  Just because you are used to dealing with your Mom's a-holery, doesn't mean your wife is. I suppose you are doing the \"pick your battles\" game with your Mom, and just letting your wife get a taste of it.  But it is also a good thing that your wife is setting boundaries.  I would say talk it out with your wife and do low contact with your mother.", "YTA\n\n1. Your mother could have brought this up earlier rather than creating a scene on the day. It's not like the mother/son dance is suddenly sprung up on her out of nowhere. Since she didn't, it's reasonable to conclude this was intentional to stir up drama. Your wife's reaction isn't unreasonable.\n2. You said yourself that she was hurt by you not doing anything when she INSULTED her, not because you didn't back her in the argument. There's a difference and she's valid to be hurt by you not stepping in and calling your mother out for crossing the line into petty insults.\n3. Your mother jumped to a \"nasty tone\" straight up and you don't have anything to say about that? dude...", "NTA. Callie doesn't seem to be a person who can go with the flow though. Sometimes things don't go to plan, live with it.", "This Dont' be an asshole and expect me to back you...", "The thing is, Callie didn't have her spouses back. One who said it was stupid amd not worth a fight. Callie decided she was more important regardless of what OP felt like.", "How is she the TA? It sounds like there is something wrong with the mother but dancing with the son’s boss for hours  but can’t do one dance with her son and putting some weird spin on it too. Cmon.", "Husband and I didn't have bridal dance because he's anxious about being in the spotlight. Saved him the bad experience.", "It's a super-weird hill on which to die. Callie's wrong in at least two ways:\n\n1) If it was a snub (and son seems not to interpret it that way, so who is being snubbed exactly?) it's the son who was affected, not Callie.\n\n2) Any issue between the couple and a family member should be communicated (if at all) via the part of the couple that is part of the relevant family. So, if there's a difficult issue to be settled with the son's mother, it's the son who should do the communicating.\n\nCallie's just buying trouble.\n\nFurthermore, while I agree that, in general, one should support ones spouse, there are clearly limits. An obvious (albeit extreme) case - your spouse sexually abuses a child.\n\nSo, there are limits. And one reasonable limit is doing something gratuitously stupid that your spouse as warned you not to do. \"Honey, I love you, but I warned you not to touch that third rail, and while I will help you salve your burns, I'm not going to touch the third rail myself just to prove that I'm supportive.\"", "> Callie is big on talking out every feeling you have\n\nMaximizing conflict and grievances", "Getting to be difficult and play the victim.", "We're just missing the step dad or boyfriend who enables the mil/moms odd behavior.", "Also the MIL doesn't like being touched but had her brothers hand in a vice grip and was dancing a ton with OP's boss. 🤔\n\nI def got the vibe this was yet another short story from their collection.", "How about you buckle up. You only heard his side of the story. If something did happen to her as a child that is where a narcissist gets created. I doubt it happened on the dance floor. She knew the dance was going to happen. You have only heard the mama’s boy side of the story he told to make his new bride look bad.", "You don’t have to stand up for someone who is wrong, and Callie stuck her nose in something that had nothing to do with her. His wife is required to have his back too and not start shit that he asked her not too. NTA,", "Yeah, fwiw, if my mom called my boyfriend an idiot to his face, I would calmly let her know that if she spoke to either of us that way, we would leave", "His wife started trouble over something that was none of her business and that doesn't mean he has to get in a fight with his mother.  The matter was worked out between them and his wife is an asshole for brining it up.", "I know plenty of people who wouldn’t want a spotlight dance with their kid- it’s incredible pressure. In fact I’ve never seen a mother/son dance at a wedding. Is this really a normal thing? Why isn’t she allowed not want to have a romantic dance with her kid?", "But OP doesn't care. He isn't hurt or bothered at all. Being pissed for him is fucking ridiculous", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "yes but she is in no way shy. She used to perform professionally, and people were definitely looking when my boss was drunkenly throwing and spinning her. Her issue was really the touching and viewing dancing as romantic or sexual", "It isn't even about pick your battles. It is about why would I want forced affection? I'm not that desperate that I need her to fake something for me, and I don't just assume things are on purpose when she has a lifelong history of not wanting to be touched. We are already a very mutual and peaceful low contact", "Full agreement from me. I'll take OP's word that his mom is \"difficult\", but based on OP's story, Callie is the one that appears difficult.  \n\n\nOP's mom didn't look good, was getting pale and was shaking. She had a hard time speaking, was squeezing her brother's hand hard, and on the verge of passing out. I'm not one for diagnosing people online, but that sounds 0% like an attempt to snub and 100% like an anxiety/panic attack. Once the mother-son dance was off the table, OP's mom was able to calm down and enjoy the rest of the party, hence why she was able to dance later. OP had no issues whatsoever with any of this.  \n\n\nCallie, however, is a different story. First, she somehow interpreted what was possibly a panic attack as some kind of personal insult directed at herself, even though exactly 0% of the situation had anything to do with her. Then, she used this perceived slight as an excuse to berate the mom for having a panic attack, which got her an entirely justified and expected \"idiot\" back. *Then* she was so offended that OP's mom called her an idiot instead of throwing herself at Callie's feet to kiss and beg for forgiveness that she \"clapped back\", which I assume means she spewed even *more* vitriol at OP's mom over something that was none of Callie's business to begin with.  \n\n\nNTA, OP, but I'm fairly certain your mom isn't the only \"difficult\" one between the three of you, even outside this particular situation.", "Here is the 1 difference between you and Callie.  OP married a version of his mother. Your husband married a better version of himself. You know when to hold and fold. Callie never folds just like dear old mom.", "Right, but they probably communicated this to you in advance, right? The way this went down, with MIL going full waif at the wedding, is way more problematic. Both women have some responsibility here.", "Why would that affect your husband's relationship with his Mum so deeply? Was it out of character? Are you worried that one day you'll do something that unintentionally hurts your husband and he'll never tell you, so you'll know your marriage changed but never get an answer as to why?", "Yeah, you know how some people unwittingly pick spouses that are JUST LIKE the parents they consider a problem?… \n\nLike mom was having a panic attack about the dance. She didn’t make a scene later. What’s the big deal? \n\nCallie seems to have some boundary issues. It’s one thing to want to discuss your feelings as to not breed resentment, but there are also cases where you just need to let it go. Mom was clearly going through something and Callie chose to make it about her and insisted on having it out with her. \n\nCallie needs to learn that if discussing the problem isn’t going to result in any sort of solution, aside from your own self satisfaction with being right, its not effective to do so.", "Yeah but it doesn’t seem like that was the issue. The mom made it weird and sexual.", "If you start a fight with every person because you're such a judgemental twit that you can't let anything go, you will have a miserable life.", "Or break up with them for the minorest misunderstanding", "Or proving her dominance over a woman prone to panic attacks. Or, possibly both.", "Completely wrong, not wanting to do a dance with her son at a wedding doesn’t make the MIL a “monster.” People are allowed to have boundaries, even MIL’s.", "Fear of sexual interaction in non-sexual situations and panic attacks are signs of trauma, so is seeking positive attention to recover from a stressor. So your mom was displaying symptoms of trauma and Callie piled on her. You are NTA", "Idk why you are getting down voted. Reddit is weird. It sucks that your mom struggles with affection. Internet hug from a mom. I'm glad my son still likes hugging me. Will be sad if he decides to stop hugging. You deserve mom hugs too. Big hug hun", "Sending mom hugs.", "And she probably has good reason to feel that way given that you eluded elsewhere something probably happened to her. It's to babd your wife can't appreciate that and that her anxiety isn't fake.", "Who is to say she didn’t go through something when she was younger?", "Just because you go through trauma as a child doesn’t make you a narcissist.. maybe just MAYBE she sees the abusive nature of her DIL and that’s why she avoids her and her son. Because DIL triggers memories of her own abusive childhood. \n\nBUCKLE UP FOR THIS ONE… \n\nFun fact a lot of people who experience childhood trauma go on to live a life of being a victim NOT THE ABUSER. Narcissists usually don’t view themselves as victims unless they are trying to DARVO their victim and shift blame to someone else. He repeatedly said she didn’t want to talk about it and avoided. Narcissists don’t believe they were victimized and usually abusers have their scape goat and the golden child. The golden child tends to become the NARC if anything, sometimes if a scapegoat idealizes the narcissist to an extreme and craves their affection so much so, they too could also turn into a Narc. \n\nThe behavior of this mom doesn’t seem to be one of a Narc because she wouldn’t want to be seen as unable to handle something. She would want to show off her talents and dance abilities ESPECIALLY in a one on one dance with the total spotlight on her.", "Your mom has romantic feelings for your boss. Got it.", "In which case I want to say NTA.  \n\nIf your mom has some sort of anxiety/panic disorder, it’s definitely not her fault. Maybe she needs to get some therapy, but that’s not on either you or your wife.\n\nYou made it clear to your wife that you have her back generally, but wouldn’t get involved with this one. \n\nI do sympathise with the people saying you should have stepped in when your mom called your wife an idiot - but at the end of the day, if Callie feels her relationship with her MIL is independent enough to speak to her about this after you told her you’re not getting involved, then she can deal with the fall out by herself as well.", "Completely wrong, the wife is the worst of them and the least normal. Her having to start trouble over something her husband and his mom agreed on that only affected them shows that there’s something wrong with her.", "I used to perform all the time, pandemic forced a stop in 2020 and I haven't been able to get on stage since due to the anxiety I've developed, I get people disbelieving I suffer from panic attacks because they saw me on stage often in 2019 all the time. So if your Mother-Son dance was a solo dance with an audience, your Mum may genuinely have struggled, especially if she already was uncomfortable dancing with her son. While exuberantly dancing with your boss was fine because she was wasn't uncomfortable, they weren't the only people dancing, her anxiety was under control and presumably she'd had a few drinks by then. \n\nAt the end of the day if you didn't want to address it with your Mum your wife was out of line deciding to do it on your behalf. That comes across as looking for drama to stir.", "Yeah my dad isn’t big on dancing in front of people either so we combined the father daughter and mother son dance. That way he wasn’t the only parent up there.", "My dad was slightly nervous, but I surprised him with the song and he spent the first half sobbing 😭 it was so sweet.", "[removed]", "It was the week of, not day of, so yeah there was notice.", "Because she danced with his brothers at their weddings. He’s the youngest and significantly younger than his siblings (an “oops” baby, if you will) and he’s always been a little left out by his family. We all got married within a 18 months of each other and we were the only wedding where they acted as guests. It was the first time he was treated differently publicly, and we only had a wedding at all because he wanted his family there. (I would have preferred to elope and have a better, longer honeymoon).", "Your mil isn’t “every person”— actually a very specific person. Put up with this tantrum and live them for life.", "I assume because they are telling OP is obligated to support his wife, but the wife isn’t supporting him and his boundaries with his family and apparently that doesn’t matter. If it were equal, the wife would be the one called out for not having his back", "The guy who responded to you hit the nail on the head.\n\nSeems a bit of a double standard. Its ok for her not to support him, but when she goes and picks a fight against his wishes, hes an ass for not defending her.", "Bad take sir, very bad take", "I don't think she faked anything. It sounds like she was experiencing a fairly serious panic or anxiety attack. Being forced into a situation that is uncomfortable to you, during which you'll be the sole focus of attention, can be very different for some people than being relaxed and having fun on a full dance floor.\n\nI'm not saying she isn't also perhaps generally difficult, but it sounds like something very real was going on here. But most importantly, the son did not care one way or the other about the mother-son dance. It wasn't his wife's place to take up this battle.", "That's fine. She's allowed to", "She is entitled to not touch or be touched by anyone she doesn’t consent to.", "Huh, believe it or not people can decide who they consent to being touched by. It's not just a blanket yes or no thing.", "Dancing is often sexual, that’s why it’s most frequently between partners- why are people not allowing this boundary? This is totally reasonable and OP didn’t care. Forcing someone into the spotlight is ok when they are uncomfortable? If the question was ‘AITA for forcing my mother to dance in front of all my guests *because it’s mY wEdDiNg* they’d be destroyed", "Of course nobody was asking for a doctor's note. That's called hyperbole. \n\n> *\"And dismissing this as a molehill, when it actually might be a mountain for the wife, could potentially destroy this marriage.\"*\n\nI mean, is that not also a bit extreme? Also, aren't you completely dismissing the mom's feelings because *you* view this particular dance as a *molehill?* You think it's \"weird\" that she doesn't want to do this one particular dance with her son, but this one particular dance is clearly a *mountain* to her, so much so, in fact, that it triggered an anxiety attack in her. \n\n> *\"It doesn’t matter whether you or I see it as a mountain or a molehill. It matters that his wife sees it as a mountain and he sees it as a molehill.\"*\n\nAgain, how about how the mom sees the situation? Again, does it matter how she feels? Or, again, is it only Callie's perspective that matters? \n\nOP saw that his mom was *clearly* upset/uncomfortable about doing this one particular dance and he understood and accepted her answer of \"no.\" That's a great example of respecting the feelings and boundaries of others. He didn't berate her for being \"weird,\" he didn't accuse her of faking her anxiety or being dramatic, he didn't drill her with questions or demand that she explain herself, he didn't press her or try to guilt her into doing anything she *didn't want to do.* He accepted her answer and moved on, which was the absolute right thing to do. \n\nHis wife *chose* to interject herself in this situation and she *chose* to ignore and dismiss OP's request that she not press his mom about this and to instead just let it go. She is the instigator here, she was in the wrong, and OP absolutely *is* justified in his stance.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Oh dear, that's a lot of built up resentment and mistreatment that's going to come bursting out one day", "The only one intentionally creating drama is OP’s wife.", "You didn't read it he said his boss", "Please explain how you know for sure that OP’s mom faked a medical incident.", "I used to look at my own mothers behaviors as a reflection of me. I realize now that she went through some stuff when she was younger and that’s the reason she is the way she is. It’s helped me handle so much disappointment in life. LC has always worked best for me too. Firm boundaries also helps. I implore you to explore that this may be due to trauma she has sustained. If she was just trying to get attention by making up an issue she is an AH but what you describe doesn’t match that. So I hold out hope it is something she can work through with encouragement.", "I agree it WAS a mother/son issue, until mother made a spectacle of herself at son/DIL’s wedding by dancing with attention seeking boss.", "Did she hug people as a career choice as well???\n\nMom is wrong here.", "People can have the boundary that they don't want to dance. That's fine. \n\nSexualising a dance between mother and son is gross. \n\nI dance with my toddler everyday. Dancing is much more often done with friends and loved ones than partners.", "Assuming facts not in evidence. So now the mother can only touch people sexually? LOL\n\nIf this was a known issue, bride and groom would have known about this when planning the wedding. ‘I’m not comfortable with a mom and son dance because xyz’. Not day of, and she can barely stand at the thought of dancing with her own son. \n\nHow crazy.", "> (and no, I did not just miss it)\n\nIt’s also in the auto-mod post copy, so I think you *maaaay* have just missed it", "There’s not an asterix in the date of the post so it hasn’t been edited (unless it was in the first 3 minutes). Think you just missed it.", "He said his boss loves being the centre of attention, so he was dancing fancily, not his mother. Not wanting all eyes on you dancing with your son is incredibly different to enjoying a dance with someone else amongst other dancers. I find the mother son dance weird as f as well", "See right there, that does not change the fact it is a mother/son issue. You are forgetting the spotlight dance that dance is. And even besides that it still doesn’t change this being a mother/son dance.", "Are you actually claiming that people have to accept being hugged and touched even if they are uncomfortable? And must dance under a spotlight while people watch, or they’re bad people? People on the spectrum must seem awful to you. \n\nNeither her or her son had a problem with what happened. What business is it of anyone else to tell them what they HAVE to do? The mother hasn’t told anyone else that they shouldn’t do a mother son dance. She established her own boundary and it affected no one. Stop forcing your feelings on others", "This isn’t about you! The mother associates dancing with romance. This is about her and what she wants, and she finds it uncomfortable to dance with her son while a large group of people watch. That is a ridiculously acceptable boundary, and people are saying that because they’re ok with it she had to be? Stop forcing your feelings on others. She is allowed to consider dancing sexual. If she told you that you were wrong for dancing with your son, she’d be wrong. Just as you are wrong for telling her she has to be ok with it.", "I’m firmly on the wife’s side. Separately, if my MIL called me an idiot and my husband was a flaccid joke, I’d love documenting our mistake Xmas before moving on", "Then you need to tell your fucking wife to back off your traumatized mother's back? You know, grow a spine?", "That makes it even worse that your wife is starting trouble with your mom over her trauma responses. You need to have a serious conversation with your wife about how she’s not allowed to bully your mother.", "People in general, no. But a Mom with her son, then yes.\n\nI'm not saying that the wife was correct in calling out her MiL, that's OP's business. But it is still weird that his mom thinks hugging him is sexual", "I'm not sure how many times I can say she's allowed to have boundaries and she is allowed to not dance. What isn't right is her perverted thinking and how she reacted. She needs to address that.", "That’s all I’ve been saying! People clearly don’t know what a traumatic response is. She was triggered. She probably stays away from her son because her DIL is a monster to her and pushes her from being comfortable. I wouldn’t be surprised too if she is on the spectrum. There is so much more to this that OP didn’t include in the original post that is pretty important info to have.", "I don’t see where the mom thinks hugging him is sexual - just that she doesn’t hug him. It was explained that the mom finds dancing sexual and that why she didn’t want to dance with him.", "She never said that. She said she doesn’t like people touching her- including her own parents, and OP states in a comment that he believes she has some significant trauma that has led to this, but she has never spoken of it and he doesn’t feel it’s his place to ask. So again, respect peoples feelings, you have no idea what they are dealing with, and so long as they don’t impose those feelings on your lifestyle, it is no business of yours to judge", "So her having trauma, according to OP, is what makes her TA? Nice opinion", "That's fair OP, rereading OP said is that his mom doesn't feel comfortable hugging him anymore.", "ESH. Your mom refused to dance with you but was cool with dancing with your boss. Your wife said something even though you asked her not to. You didn’t back her up even though her discomfort was logical. You all sound insufferable.", "These mother in law stories are so boring. Always the same silly details too, like \"she doesn't like to be touched\".", "NTA... not every situation needs to be talked out. And there is no reason  to be upset about no mother son dance. One is a performance the other is spontaneous.  Completely different.  Wife needs to learn to leave some battles alone especially when she is in the wrong.", "NTA.  You told your wife you wouldn't back her up if she brought it up.  You kept your word.  Really...this doesn't seem like a hill to die on.", "There’s a lot more to this relationship than you put here.  Your mom doesn’t want to be touched, so she didn’t want to do the mother-son dance with you.  Yet while explaining this, she was holding her brother’s hand.  Then she spent the night dancing with your boss.  I kinda get why you don’t want your wife to confront your mother about it.  You’re afraid she might discover why your mother is seemingly ok with touch from anyone but you.  What did you do?", "NTA.\nCallie got told.\nNo surprise.", "so glad that there is no such thing in the UK", "I think Callie should have taken your advice and dropped the whole thing. Nothing good came from that conversation and it probably made things worse. You are NTA and if your wife can’t accept this then you’ve got a long road ahead of you.", "YTA", "NTA. Apart from anything else, I don't see this as a snub anyway. Dancing with your son with everyone watching is *clearly* different to dancing flirtatiously in a room full of people. She was clearly very anxious about the idea. Honestly, sometimes it's not about you (to wife).", "NTA this issue identity even worth it.", "NTA", "ESH. You don’t have to back her up, but you could at least make sure that if they disagree, they keep it civil. The name calling is unnecessary and that should be noted. That goes both ways, imo.", "NTA, good on you for not being a yes man to everything and setting boundaries right away. I hope your wife learns the importance of choosing more important battles instead of more petty ones like the one she chose.", "NTA Callie should have butt out. It’s not her place to confront your mother about a dance that has nothing to do with her over your objections.", ">I need to back her even if I don't agree with her.\n\nThat is not how it works. Nta", "NTA. \nMy FIL didn’t go to our wedding because he is shy, the same happened to our son’s first birthday. I was angry about it and told my husband that I wasn’t going to put his name on the list for the caterer the following party because I knew he wasn’t going.  My husband said it was between his dad and him and he didn’t want me to butt in the situation, so I didn’t, simple like that. \n\nHe asked if I was upset with him not going to his grandson’s birthday this year and I said I “understood and hoped he would be able to be there next year”. I know he won’t. Of course I was angry for paying his meal and he didn’t show up, and it is clear that I am upset that he is never present in our celebrations, BUT I decided long ago to not make a big deal out of it in front of my FIL because my husband asked me not to, specially because his father can be very ignorant sometimes and he might yell at me; I don’t want to put myself or my husband in that situation. Specially when my husband doesn’t want to be in that situation.\n\nIf your wife wants to have a happy marriage she needs to learn to let go. If it is between you and your family it’s not her place to pick a fight, specially if you ask her not to. Not saying what you want is the best way to avoid hearing what you don’t want.", "NTA. But has your mom ever been diagnosed with an anxiety disorder because that 100% what this sounds like. Callie needs to back off and learn not everything needs a confrontation especially if its not that hig of a deal. \nWhen I got married we didn't even do a parents dance because neither my MIL nor my dad are much of dancers at least not when the focus on them. Sounds like this was what your mom might have been feeling.", "NTA.   Awesome boundary setting!  If she wants to get her undies in a bundle about something, she needs to be able to fight her own battles.  Esp because this wasn't HER battle to fight in the first place.   The only one that would possibly be hurt by the dance situation was you, and you didn't mind.  So her getting a while hate up her ass about it was her problem.   \n\nWe are not required to side with our partners on everything.  We aren't required to fight their battles either.   That's enmeshment, not connection.", "Esh. Your mom didn't want to be in the spotlight and your wife is just looking for drama, and you're enabling both of them.", "ESH. Callie was an instigator but you should not allow your mom to call your wife names.", "NTA.\n\nCallie ignored your warning and didn’t respect your boundaries/request.", "NTA never back someone you don't agree with.", "NTA.  Your mom is right.  There is a huge difference between being the only two on the dance floor watched by everyone and being in a group of people dancing.  I know.   I would be horrified to be in the first situation.", "Dancing in a room full of other people dancing is way different from dancing with your son with the attention of the entire guest list. \n\nNTA", "ESH stop pretending you have your wife’s back, you don’t. Personally I don’t see why OPs mom is uncomfortable, unless she has trama being touched (I do as well.) but clearly with the boss she dosnt. It’s clear the the mother did that for attention, but it’s up to OP to deal with it. Other wise the mom is just gonna keep doing it\nEdit: spelling", "My father-in-law refused to dance with his own wife at my wedding. I have a lovely photo of her dancing with my father and she looks so happy!", "YTA for not defending your wife when mum called her an idiot, but your wife shouldn’t have said anything. The only person who had a place to saying anything was you, but as you weren’t concerned, wife should have left it alone.", "Personally I think all the NTA here are willingly overlooking a lot of things. Why does your mother's comfort level come above that of your new wife? I get your mom might have some issues but it was obviously specifically aimed at you considering her action with your boss who I would assume isnt as close to your mother as her own child. \n\nI think its wierd for that kind of snub on your wedding day to not be fully addressed or explained. If your mother has specific reason she doesnt want to touch you, your wife should be aware of that and fully in the know. It seems like there are some unspoken things and I dont blame Callie for not being okay with just leaving it as is, all that does it set up the future for more harm. I think her wanting to start a dialogue with your mom is fine but it needs to be just that. A dialogue. Regardless of you opinion letting your mom insult your wife isnt a good way to start a marriage. \n\n Your mom is an AH for reacting that way and you're a partial AH for letting her. \n\nI think you should want everyone to be on the same page and setting your wife up to deal with something that made her uncomfortable alone because youd rather not talk about it, isnt really cool.", "You’re a bit of an ass for letting your mom ruin your wedding with a drunk and snubbing you, yeah. Callie needs to learn to chill a bit. ESH.", "ESH none of your explanations help understand why your mom snubbed you that way. Your further clarifications doesn’t help anything. \n\nShe doesn’t like to be touched but was fine gripping her brothers hand while she was saying she can’t do it. She also danced with a rando and had no problem touching or being touched. She is also a professional dancer. What?\n\nSo the problem was she didn’t want to dance with YOU specifically. Why wouldn’t someone who loved you not feel offended on your behalf? You may not care but you know everyone else would have noticed it and clearly it bothered your wife enough to ask her directly.", "Your wife took the bait, and let your mom dictate the conversation. This is unhealthy, and will lead to a lot of strife going forward. You need to go NC/LC with your mom, and have a serious chat with your wife, whilst explaining your plan.", "Sounds like your mom was having a panic attack, which was probably pretty embarrassing to have happen in front of people at her son's wedding, so the way you handled it was great. She probably really appreciated it, and felt a huge sense of relief.\n\nHaving a few drinks, feeling good, and dancing with/amongst others at a wedding reception is much different than being put in a spotlight for the entire crowd to watch. As someone who struggles with severe anxiety, I can easily see this happening.\n\nWhile you may view your mother as difficult, it doesn't sound like your wife is any less difficult. She stuck her nose where it wasn't wanted after you told her not to. Your mother reacted to being attacked. I'm not saying that name-calling is appropriate, but your wife chose to poke the bear.\n\nThat said, yes YTA for not putting a stop to your mother's name-calling and insults, and your wife is an AH for overstepping your boundaries. Over something so trivial in the grand scheme of things, this could be an eye-opening experience of things to come.", "There is a big difference between having a very public dance where all eyes would be on you and dancing with the rest of the party. My MIL had the same fear and it wasn’t an issue to let it go. It’s one day and letting her be comfortable at her son’s wedding feels more important. \nThat said, when you marry someone, it’s important to have their back. While it might not have mattered to OP, it clearly mattered to his wife to talk about the issue. Even though the OP didn’t agree, his mom calling his wife an idiot is crossing a line. The family. Should be able to have a civil conversation about things they don’t agree on, without resorting to name calling. He could have stayed out of the main argument but still supported his wife when his mom called her an idiot.", "Yep. I'm surprised that a lot of people don't catch it. The Troll's stories are all the same/have the same tropes.", "1/10 creative because it's the same old tropes they always use.", "Standing up for her for what? She is the one causing the issue to begin with", "It sounds like Callie had been the one on the attack, not mom. Either OP needs to shut both of them down for being unkind or none of them. Obviously he couldn’t stop his wife from being unkind and mom is somewhat justified in her response. The only better solution would be to refuse that they come into contact with each other until Callie sees a therapist and learns to get over it.", "Then his wife minds her fucking business, he doesn’t have to back her up when she started shit.", "She didn't have social anxiety. She went like that (the seemingly unwell) purely because she didn't want to dance with her son as she thinks it is sexual. She is fine dancing with a man she can be attracted to.", "Because she finds dancing romantic and/or sexual and I'm her son", "Why should he have stepped in to an issue the wife instigated and he literally told her he would not be inserting himself into?", "how did she ruin my wedding by dancing with him? It was my wedding night I wasn't paying attention to either of them", "> She doesn’t like to be touched but was fine gripping her brothers hand while she was saying she can’t do it. \n\nThey are twins, rules don't apply to him.\n\n> She also danced with a rando and had no problem touching or being touched.\n\nI've said a couple of times she is ok with it in a sexual or romantic context\n\n> She is also a professional dancer. What?\n\nThat didn't require being touched", "i mean we are pretty low contact in general, but I would never lower contact because she didn't want to touch me. She doesn't have to touch anyone", "I think the huge difference between your story ans OP's is the fact that OP didn't seem to react to the fact that his mother refused to dance with him but danced with another man (that she might not even know that well considering it's OP's boss). \nConsidering that the wife and MIL are not on good terms and the whole \"panic attack\" before the wedding, it seems like MIL tried to find a way to not validate her son's wife/wedding. A bit of a back up would have been nice. Your husband had a reaction. OP didn't.", "Sounds like Callie is on the lookout for things to be angry with her MIL about... While I imagine that something legitimate happened in the past to make the her dislike her MIL, it is unhealthy to seek things out...\n\nBeing offended on behalf of other people (who are not offended themselves) is a problem as well.", "Honestly, what is she upset about? It wasn’t her dance with her parent. If she’s upset that the wedding wasn’t exactly as she planned it or conforming to a tradition, that’s frankly a bridezilla move. She needs to understand that this wasn’t her moment and she needs to be less controlling. \n\nI think of it this way. She could either have them do no dance or she could have a scene in front of everyone. Which would she prefer?", "She's TA because she didn't respect or listen to her spouse's wishes and then got mad and wanted him to go to bat for her in a situation she created entirely of her own accord.", "There is a big difference between having an official mother son dance, where probably the entire guest crowd is staring at you and taking pictures, and being one couple dancing among others for hours - let alone that later on probably also some alcohol flowed and relaxed people. I can totally see how MiL might have had a panic attack in the first scenario and might have been fine with dancing with the boss later.\n\nThe wife deserved the title idiot; she does sound like the difficult one and OP NTA. Probably OP won’t have much fun with her either, if her behavior is a long term trend.", "Im not gonna read it again, but i thought MIL also mentioned, in the final paragraph, she didnt want \"to touch her son like that'. 'Touching' seems to be mentioned a couple times...i wonder if MIL has issues there.", "It really depends on if it affects the S/O or not.  On everything that affects the S/O or the kids, yes, the spouse should side with the S/O.  Like if the MIL had decided to wear a white dress at the wedding, that's a direct stab at the S/O.  But this is just about the OP and how the MIL somehow feels weirdly about dancing.  There's obviously some fuckery going on with the fainting and trying to make a scene about the dance, but it didn't have to do with the S/O.", "Yeah, that's the defintion of drama queen.", "Yep, op just a preview of the rest of his life.", "Every time we get to the “mom doesn’t like to be touched” I know it’s the misogynistic MIL troll. There are a few things that appear in nearly every story.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Defending himself from what? He said he didn't even really care about the dance, just had it for tradition.", "He didn’t just not ask her to do it, he specifically asked her not to. She wasn’t taking up for him or being selfless in any way, she was doing it for herself.", "I hear you. But you know that’s not normal, yeah?", "[removed]", "That sounds so wonderful. What a wonderful memory you made out of other memories.", "It's not even the discomfort that's the issue IMO. It's how she has sexualised it.", "MIL is weird as hell. What mother can't dance with her son because she doesn't want to touch him like that( her own words) That's creepy as hell. OPs mom can dance with a drunk but not her own son. Yuck", "Someone privately having a panic attack isn't going to take away your spotlight, don't worry. It's not like the mother could control it.", "Exactly. Talk with your therapist, don’t just stir up the pot further. \n\nBut Callie may be trying to estrange OP from his mother - clearly this want a move to improve their connection with each other", "I can't tell if that was the real reason, or if that's what she told Callie because Callie wouldn't let it go.", "It wasn’t a panic attack, MIL loves dancing and being the center of attention so the only explanation is being an AH", "Not insane fake boundaries you make up because you don’t like your daughter in law", "This honestly took me tf out 💀", "Don’t. She doesn’t want hugs. Send her a wave.", "I don’t think that OP really knew that she was opposed to doing a mother son dance until the day of. Who knows, she might not have realized it was such a stressor until then as well", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Something that means she can't do a dance with her own son but can be span around all over the show by a random man?", "You put a lot of medical diagnoses on here. You don’t know anything of the situation. She had no problem dancing with a man at the wedding. She just couldn’t stand the thought of dancing a regular dance with her son at his wedding. His mother will do more to hurt his wife as she can. Research narcissist and you can learn how they develop as children and how they are when they grow up.", "Idk, my guy. I'm explaining a potential thought process. I wasn't there.", "Then, I'd argue she deserves to be able to do that given her MIL behavior at the wedding was likely embarrassing. It's reasonable to want an apology for that. The question isn't really about any of that, though. It's about whether the dude is an AH for allowing his mother to call his new wife an idiot. I'd have the same opinion if he let his wife call his mother names unchecked even if his mother were still (as far as I'm concerned) in the wrong. I don't think letting his family call her names early in their marriage is a great precedent to allow his mother to set.\n\nI guess I just don't understand why he's not required to have any accountability for keeping peace just because he wants to remain neutral. You don't need to back someone's stance up to help keep things civil.", "Who cares?", "Wrong again, she has two options since tolerating crazy mother-in-law nonsense is not reasonable. Completely cut her out and avoid her, which is what mother-in-law wants, or confront her when it’s justified", "Oh I get it you are one of those people who read JNMIL and take it seriously. I just don't get why you are not making fun of a valid medical condition?", "I did the same!!! I didn’t tell my dad the song, his face was lit up when he recognized it and he sobbed all over me lol", "They’re both insufferable and OP has a hell of a life ahead.", "OP says that his mom is uncomfortable with touch except with her partner or lover. While it’s a bit odd, nobody is obliged to be touched except with their consent. OP didn’t care about this dance, it’s fine with everyone that mattered to cancel it. It frankly wasn’t Callie’s business at all.", "No no mom hugs for op.", "Wrong , OP said his mother has developed a new problem of not wanting any physical contact with son that coincidentally started as soon as the new GF she doesn’t like came into the picture \n\nWife is just the first person to not tolerate the insane power tripping manipulation \n\n\nLol @ she was going to feint", "How so ?", "If you love dancing and being the center of attention, but refuse to do a normal harmless dance with your son and his wedding because you feel it is sexual and have a fake panic attack, and then instantly start dancing enthusiastically with a stranger, the only logical conclusion is that she was faking it because she doesn’t like the wife, OP pointed this out", "“She has the worst communication skills” and you let her meltdown at your wedding like a stranger?", "Read his comments she doesn’t like touching and views dancing as a sexual thing so it makes her uncomfortable. Who are we to judge what makes another uncomfortable", "Says the person who threw out the term narcissist and tried alluding that the mom is one. This is a perfect example of someone twisting BS and accusing someone else of something… hmm who else does this behavior.. oh yes narcissists. \n\nI am thoroughly informed on narcissism and narcissists, I was married to one. I know the games, I know the BS, oh and that childhood trauma.. ya I lived it and guess what IM NOT A NARCISSIST! I stopped the generational trauma. Just because someone grew up with that, doesn’t make them turn into a narcissist. I write from my own experience and years and years of research. Get off Wikipedia and read real medical journals and abstracts about it. Read the body keeps the score on childhood trauma. When and ONLY when you’ve fully educated yourself then come back and be a keyboard warrior. Until then stop attacking people who have had childhood trauma. You making blanket statements like that is irresponsible and reckless and perpetuates abusers ways of blaming victims for being victims. \n\nShame on you", "I agree with you. It’s just so weird to me to think a mother cannot even touch her child, though. I do hope op didn’t have to grow up without any physical affection. Human children need that.", "She loves dancing and always has according to OP, it’s just the one AH time (the only time she ever should have danced) that she decided not to\n\nSo it’s clearly not a touch issue, it’s an AH issue", "But you are a crazy AH if you are happy dancing and being the center of attention, but are unwilling to do a normal slow traditional dance with your son", "[deleted]", "Or perhaps someone that’s worked in the medical field.\n\n1) why do you believe it’s valid (the medical community doesn’t)\n\n2) and by your response it suggests that it’s an element in this scenario, so your mother claims to have it?", "Then why be hyperbolic? Like, I was legit wondering if there was some sort of medical issue because the way she was acting is mind boggling.\n\nI don’t think I’m being dramatic. Go check out r/justNoMIL or r/justnoSO and read post after post of marriages that are in the shitter because one spouse doesn’t feel like the other will have their back.", "Agreed on that note.", "[Does she have a habit of coming up with reasons that big events need to be about her in some way?\n\nNot really about her but she does just shut down when she feels like she can't use words. She stops talking and just like freezes, though it's pretty clear she doesn't want my attention during those little fits. She will actually hide from me. The only person who can be near her when she gets that way is her brother.\n\nShe is just difficult in general because she really struggles with communicating. She doesn't like Callie, doesn't want to talk about it, and when she realized I wasn't ok with it she began pushing me out of her life. She kind of acts like she's scared of me, like doesn't want to be touched, tries to not be alone with me. She is very snarky and tbh I find her funny but Callie doesn't and I 100% respect that and told my mom she needs to stop. She now claims she is \"shy\" which lmao no she is not, and claims she doesn't know what to say.]", "Apparently I’m the only person with logic and judgement, everyone else wants to virtue signal", "It’s extremely odd to defend the mother-in-law for creating a rift prior to the wedding because she doesn’t like the normal daughter that doesn’t tolerate her insane behavior, then caused the scene at the wedding, then called wife an idiot when confronted about it", "No, In another post he talked about how much she loves dancing and being the center of attention \n\nSo the only time she should have danced is the only time she didn’t want to", "She clearly did, read the comments by OPM, she loves dancing but for some reason insanely thought dancing with her son would be sexual", "MIL danced with countless people throughout her life but now suddenly (once GF came around) can’t have physical contact with her son\n\nThat can only be an insane AH power move", ">If you love dancing and being the center of attention, but refuse to do a normal harmless dance with your son and his wedding because you feel it is sexual and have a fake panic attack, and then instantly start dancing enthusiastically with a stranger, the only logical conclusion is that she was faking it because she doesn’t like the wife, OP pointed this out\n\nWhat evidence do you have that she faked it?  OP said she was pale and sweating; those are autonomous functions.  Also, he never said she instantly started dancing.  What's up with you?", ">and then instantly start dancing enthusiastically with a stranger\n\nexactly, a stranger not a family member, not her son but a man. That makes sense considering she finds dancing sexual", "Agreed! I can't even imagine.", "According to OP,  the mom has always had an issue with touch if you look at his comments.", "What are you going on about? all I said is I find dancing a bit intimate and can see why it would be weird to do with family. Just because something is expected or tradition doesn't mean people should be forced to do it.", "1) umm no just because some people calling themselves professionals are uneducated does not mean the entire medical field doesn't think it is real\n\n2) huh, are you just making shit up now? My mom never said she had it. You are the one who brought it up, and I'm just pointing out that making fun of medical conditions is disgusting", "it was fresh off the keyboard when I commented, but I have now deleted mine", "\"She just doesnt really like Callie so we aren't close anymore and she doesn't let many people near her. Her own parents can't touch her\"\n\n\"Oh I would bet anything that some serious shit has happened to her, but she doesn't want to talk about it and I'm not entitled to know.\"", "And in his comments he stated his mom doesn't like to hug him or touch him", "Later in a comment said his mom has always loved dancing and being the center of attention", "She had been a professional dancer, as soon as son gets a GF she doesn’t like she suddenly can’t have physical contact with son, has a fake fit the one time she should dance, then instantly goes back to being a lifelong enthusiast dancer and being the center of attention \n\n\nIt’s very clear what’s happening", "She was a professional dancer, so no she doesn’t find it sexual, he said she started not wanting to touch him when the girlfriend came around\n\n\nThat’s clearly the real issue", "He said it started when new GF came around iirc", "[removed]", "Since GF came around….\n\n\n\n[Does she have a habit of coming up with reasons that big events need to be about her in some way?\n\nNot really about her but she does just shut down when she feels like she can't use words. She stops talking and just like freezes, though it's pretty clear she doesn't want my attention during those little fits. She will actually hide from me. The only person who can be near her when she gets that way is her brother.\n\nShe is just difficult in general because she really struggles with communicating. She doesn't like Callie, doesn't want to talk about it, and when she realized I wasn't ok with it she began pushing me out of her life. She kind of acts like she's scared of me, like doesn't want to be touched, tries to not be alone with me. She is very snarky and tbh I find her funny but Callie doesn't and I 100% respect that and told my mom she needs to stop. She now claims she is \"shy\" which lmao no she is not, and claims she doesn't know what to say.]", "Are you missing the fact that you replied to OP here? You're arguing with OP about what HE said.", "He said it got worse, yes, but she doesn't even let her own parents touch her, so it's always been bad.", "lol but you can call someone a shrew. Idiot is a pretty mild word and I'm sure my wife's called my mom a few names.", "I’m pointing out how he and mother are wrong according to any objective perspective", "[Does she have a habit of coming up with reasons that big events need to be about her in some way?\n\nNot really about her but she does just shut down when she feels like she can't use words. She stops talking and just like freezes, though it's pretty clear she doesn't want my attention during those little fits. She will actually hide from me. The only person who can be near her when she gets that way is her brother.\n\nShe is just difficult in general because she really struggles with communicating. She doesn't like Callie, doesn't want to talk about it, and when she realized I wasn't ok with it she began pushing me out of her life. She kind of acts like she's scared of me, like doesn't want to be touched, tries to not be alone with me. She is very snarky and tbh I find her funny but Callie doesn't and I 100% respect that and told my mom she needs to stop. She now claims she is \"shy\" which lmao no she is not, and claims she doesn't know what to say.]", "That’s a lot of assumptions without proof.", "Trauma can be a reason but not an excuse.", "You still don’t defend your wife or consider her. Such a catch", "I don’t know the shrew. She isn’t my mil", "Did mommy call you an idiot often? Is that why it’s nbd? Mild verbal abuse from a woman uncomfortable having her son put his hand on her shoulder is the most interesting. What else was sexy to her?", "\"She just doesnt really like Callie so we aren't close anymore and she doesn't let many people near her. Her own parents can't touch her\"\n\n\"Oh I would bet anything that some serious shit has happened to her, but she doesn't want to talk about it and I'm not entitled to know.\"", "This is based on OPs comments he describes someone who doesn’t like touching. My own kids have sensory issues. So if it’s not trauma (due to her mindset as well) then I question sensory/spectrum issues. Again going based off OPs comments throughout. Paints a bigger picture than what was presented.", "OP replied to someone asking if the mom was traumatized — in the context of her claim that dancing with her soon seemed like incest —  that he was aware something of the sort happened to her. Ultimately, the DIL doesn't have any reason or justification for her behavior.", "She doesn’t want to dance with her son. She doesn’t like touching her parents. Why does that offend you so much? Some people kiss on the lips to platonically say hello, others aren’t comfortable with a handshake. She doesn’t want to press her body against her son because to her that’s too intimate, that’s not perverted, that is her boundary. And until she forces that belief on anyone else, it makes no difference. She is allowed to find dancing with a family member too intimate, the same way a person doesn’t have to accept a platonic kiss. People are different, they don’t all have to abide by your rules for society just cos you think you are the only one who is right", "And yet you call people names, interesting.", "YTA. Please pay attention to the fact that the whole inability-to-dance thing boils down to one of two issues, both of which are very bad:\n\n1. She is so disgusted by the idea of you marrying Callie she couldn't do the one thing you asked of her and did, in a minor way, attempt to sabotage the wedding;\n2. Or, your mom is a lot worse than we thought.\n\n\"She got a nasty tone and said that man she was dancing with wasn't her son, so it is completely irrelevant and she *didn't want to touch her kid like that.\"*\n\nUm. Let's go back. Was she... sexualizing the idea of the mother/son dance? Is that why she was sooo queasy she couldn't possibly do it?\n\nListen, I never ever jump to these conclusions. I'm just saying, that's an extremely weird thing to say as a reason for why you can't dance with your son. She could've just said to Callie that she was sorry, she truly felt unwell, and then made some kind of other effort to show public support of the two of you.\n\nBut... she didn't. She said she didn't want to touch her kid like that.\n\nI don't know. It's just weird.\n\nEdit: a follow-up answer from OP details that Mom's issue was \"dancing with her kid feels incestuous or something.\" Another one says that \"She finds dancing more of a sexual and/or romantic thing. We aren't close at the moment and she stopped hugging me a while ago.\"\n\n*Weird.*", "[removed]", "NTA It sounds like Callie wanted to control every aspect of your wedding by having it picture book perfect. People are not puppets. Keep an eye on Callie because she might slowly begin to control you over time.", "NTA.  Your new wife needs to back up and stop trying to control your mom.  You and your mom made a decision for her own comfort that night, it had nothing to do with snubbing anyone, and your wife turning this of all things into a fight is pretty silly.", "What is it about those dumb dances (m/s f/d) that bring out the worst in people? Nta but sheesh your wife might be and your mother needs therapy", ">Callie is big on talking out every feeling you have and wants to have a conversation with my mom about her behavior.\n\nAnd on AITA this is routinely the subject of an asshole verdict, because sometimes you're just plain not entitled to a \"discussion.\"\n\n>She says it was an intentional snub and needs to be addressed. I told her I'm not going to control her, but in this situation I won't back her as I asked her not to bring it up.\n\nPerfectly reasonable.\n\n>Callie did hold her own and clap back, but when we were alone told me she was extremely hurt that I let my mom call her an idiot. I reminded her of what I said going into it, but she said I failed in that situation and I need to back her even if I don't agree with her.\n\nNo offense but your wife is a bit pathetic. It's 2022 and she's picking fights like a teenager, but crying because her strong man didn't protect her from the mean words. What she was expecting was for you to gang up on your mother, which is grossly toxic of her.\n\nRemind her to pick her fights and not antagonize someone if she doesn't wanna be insulted to her face.\n\nNTA", "Dancing in front of a crowd as a performance (cause it kind of is?), and later dancing in a large group with someone who is gregarious is not the same thing. She can blend with a crowd and maybe that guy made her feel comfortable by showing her dancing isn’t that big of a deal. I don’t think it’s a snub. Tell your wife to have a hard think about empathy and the situation.\n\nNTA", "You need to back her if she's being called an idiot..but only for that. \"Mom, calling my wife and idiot is not something I'll accept. Don’t do it again.\" Problem solved. She, your wife, needs to stand on her own two feet if she picks and argument with your mom when you asked her to let it go and would not support her if she didn't. Standing up to your mom is the thing to do but only if it's justified. Your wife won't be right all the time and neither will your mom. Your wife needs to understand what and when you'll back her up and when you won't and she'll be on her own. Make sure to have that conversation so she can't clap back at you when she knew going in how and what level of support you'll give her. Never let anyone in your family disrespect her but she needs to respect your mom as well. Somethings are just better letting it go.", "NTA. You’ve got two difficult women in your life, so I wish you luck!", "ESH. OPs mom seemed to have a genuine panic attack and your wife seemed to be okay with the change up because of the physical reaction your mother was having. \nIt was pretty crappy of your mother to be involved in such “attention seeking dancing” as you put it, right after making such a fuss about not feeling comfortable with being touched and not being able to dance. \nIt was also pretty crappy of your wife to ignore your wishes and bring it up. \nFinally, it was crappy of you to allow your mother to call your wife an idiot in front of a group of people. I get that you said you wouldn’t back her when it came to this topic but there’s a huge difference between not backing someone and allowing your mother to be blatantly disrespectful. Name calling never needed to be involved and now your mother knows she can get away with calling your wife that in later disagreements. You said yourself that your mom can be difficult and if your wife wants to talk everything through. This means that there’s likely going to be a lot of confrontations in your future. Even if you disagree with what your wife is arguing for, you shouldn’t allow for unnecessary name calling to get involved. That’s going to make things get progressively more hostile in later confrontations.", "NTA, but Callie is.\n\nYou mom sounds like a very high maintenance person, who is prone to instigating drama. If Callie insists on hashing out every little thing, she's going to be fighting forever. And what's the point of that? \n\nI applaud you for having your wife's back in most cases (too many husbands defer to their moms), but you don't have to be her personal enforcer for things that you don't agree with, and especially not those things you've specifically asked her to let go.", "NTA. There’s a difference between dancing with someone when everyone else is dancing, and dancing in an amplified moment with a room full of people just watching you. Sorry you missed your dance, but seems like a panic attack. Also, not every wedding does the mother son dance, anyway.", "NTA", "NTA.", "Soft YTA.\nIt's perfectly normal for a bride to be upset at 1) being upstaged (which the mom and boss were sort of doing) and 2) things not going as intended.  However \"normal\" is not the same as healthy or morally correct  It sounds like the wedding went as planned except for mom not dancing with you.  And as for that being a \"snub,\" the only one who has any right to feel offended by your mom not dancing with you is you, and you weren't offended so no harm no foul.  Your wife was not snubbed so she doesn't need to be upset.  You were not an asshole for refusing to back up your wife in the needless fight she decided to pick.\nHowever you really should not have let your mom call your wife an idiot.  You should have put your foot down and said \"I don't agree with my wife on attacking you for this but you have absolutely no right to use name calling on my wife.\"", "NTA, it's your mom and it was you who would have been injured by this. Your wife should be letting this go because you, the affected party, want it let go of.\n\nYou two are partners, that means neither one of you is a leader and the other a follower. You are equals, and part of that means that she needs to respect your boundaries", "Well if you don't care that your own mum can't stand to touch you but your boss (a stranger to her) is good, why should your loving wife care? At least your wife sees how toxic your mother is. She loves you and is offended for you, that is why she did not want to just let it go. If I were her, I would go NC with your toxic Mum and let you do what ever you want. ESH!", "NTA. You did warn her. You have set boundaries with your mom and have your wife's back which is great, but your right. This was something that didn't need to be brought up. It was between you and your mother, so it wasn't really her business. It was over.", "NTA /theres a difference between dancing in front of people alone and dancing around a group of people", "NTA. The parent-child dance is a very important dance. Only the two couples are on the floor. Formal pictures are being taken. A mess-up would be permanently etched in people’s minds. It is very stressful, not everyone can do it. Your mom could not. \n\nDancing with someone else when everyone is on the dance floor and no one notices a mess-up is totally different. It is no stress, and probably by then alcohol had released some inhibitions. So of course your mom could dance with someone that was not her child.", "Yes you’re TA. A major one at that. Be careful Callie may end up divorcing your sorry ass.", "NTA. Sounds like your mom was having a bad panic attack. Mother/son dances generally focus attention on the pair dancing. Her dancing later with his boss? Unless they were the only ones on the floor, then all eyes weren't on her. There was no need to bring anything up after the fact. That Callie chose to is on her. You should not feel obligated to 'have her back' in this instance, especially when you were up-front in telling her she was on her own.", "NTA - as someone who’s mother in law went out of her way to steal the limelight at every opportunity at our wedding, Callie needs to calm down. There’s a BIG difference between dancing in a crowd and dancing when everyone is watching just you. Callie also has to understand that while she likes to talk everything out, other people don’t. Her forcing anyone to do so against their will is AH behavior.", "ESH\n\n1. Callie should have backed off and gotten over it seen as it didn't bother you and if there was a slight it was of you, not her\n2. Your Mom shouldn't have called her an idiot\n3. You shouldn't have said nothing when your Mom called her an idiot (you could very easily have said \"Mom I don't agree with Callie here but it is not acceptable for you to insult my wife\").", "NTA \n\nHow does your mother not dancing with you affect Callie? And so much so she held onto it *through the honeymoon*?\n\nYour mom brought up a great point about her discomfort with the dance - I'd never thought of that being an issue, but your mom clearly had a boundary she needed respected and you did that.\n\nWhile Callie might value hashing out everything, your mother clearly did not want this and tried drawing a boundary.\n\nCallie trampled all over that.\n\nWedding's over, Callie. Time for Bridezilla is well passed.", "My ex was like this.  You're fucked, dude...  She's going to push you to go no/low contact with your mom, and wait until you have kids.  It's never going to stop.\n\nNTA", "NTA\n\nIt’s your mom and your relationship - YOU are the one who should deal with any issues with her, not your wife. Callie overstepped when you explicitly asked her not to. \n\nThat said - I assumed your mom was uncomfortable with having all the attention on her dance with you. The parent-child dances have a lot more attention on them than when the dance floor is open. I can see being uncomfortable with one and not the other. \n\nBut then During the argument your mom actually did share her reason - she didn’t want to touch YOU, her son. I’d be livid if I heard that - your mom somehow thinks a dance with you was lewd. That’s super insulting and I am sorry your mom is such an asshole. \n\nCallie still should have stayed out of it.", "NTA but dang. I hope y’all all find some peace.", "YTA. You let your mom abuse your wife. Nothing else matters.", "Let’s do the checklist:\n\n1. “My mom and wife don’t like each other, and we’re already low contact/not close.”\n\n2. Wife doesn’t like MIL or want to associate with her but is also offended that MIL isn’t making a symbolic gesture of closeness, even though wife wouldn’t actually have direct involvement. \n\n3. Original post is missing information which later vindicates MIL’s response (MIL may have trauma around physical contact). \n\n4. Repeated defence of MIL because “she shouldn’t have to do something she doesn’t want to do.”\n\n5. Emphasizing that MIL is attractive/popular/interesting and has a man who’s all over her. \n\n6. Tons and tons of responses that repeat the same thing over and over without really going into details of the overall relationship \n\nHey MIL troll, I see you’re back again. Doesn’t it get boring at some point doing this endlessly?  No matter how often you play out these fantasy scenarios of your son defending his poor innocent beautiful quirky mother from mean unreasonable wife, it’s not going to fix your IRL misery. Not even if a whole chorus of internet strangers back him up. \n\nYTA for doing this bullshit every week. Please get therapy and a new hobby.", "Ia op used to his mother treating him like shit?\nI'd be pissed at her as well if I was the wife. Without an explanation, your mother is seriously messed up. To pull that messed power play at your wedding.", "OP says he usually has his wife's back,  but he warned her, and she did it anyway.  She should've just let it go.  If MIL was trying to get under her skin, all she did was show her it worked", "NTA, you asked her to let it go, and she didn't.", "NTA. You told her it's fine, that it didn't bother you. She should have respected that and trusted you. You gave her fair warning to let it go, and that you were staying out of it. She chose to have this conversation, anyway. She opened the door. She doesn't get to complain about what's on the other side.  \nIt's a little weird that your mom doesn't want to touch you \"like that\". What does that even mean?", "This is your mother and it was suppose to be your dance. If you weren't bothered by skipping it then Callie needs to let it go. You told her that you didn't care about it, not to make an issue out of it and that you would not back her up in a fight about it. She was fair warned. NTA.", "Your wife was out of line. Doing the mother-son dance is a lot different.  I was scared to death to do the father-daughter dance at my daughter's wedding. We did it. But I was so uncomfortable.  I guess I just don't like being the center of attention and am very self conscious.  She wasn't the center of attention dancing with others.", "NTA. when my husband and his mum have issues I don't get involved unless he asks me to. It wasn't Callie's conversation to initiate, she should have respected his wishes. This comes across like Callie is starting a row with his mum just to have a go at her because she doesn't like her.", "Nta. It’s really annoying when there’s a snub meant for you, and you don’t care, and then someone decides to take matters into their hands and avenge you. Your word about whether it bothered you or not should have been enough.", "Perfectly said. MIL gets to choose if she wants to do the mother-son dance. Period. Wife is out of line for confronting her. OP is NTA for opting not to side with wife on this trivial petty issue.", "Yup just a variation on the mil who won’t hug the grandkids", "I see your point. I do wonder how heated Callie got before his mom called Callie an idiot- had Callie kept her cool and was she really trying to have a geniune conversation? If so, I agree OP should have said something narrowly addressing that. But I really wonder if Callie was escalating the situation either through rhetoric or tone and while name calling is unacceptable, if this is what OP anticipated when he told Callie to let it go, I do see why OP would stay out of it completely.", "ESH Exactly! I wouldn't be happy with Callie by not accepting my boundaries. That being said even if my spouse and family fight, I will never tolerate name telling from both sides. You can say what you want to without belittling the other person.", "While I’m sure it’s a typo, “refund their wives” is giving me a mental image of returning his wife to the store and getting an undamaged replacement, which is both awful and hilarious.", "I wish they could just ban the Troll all together.", "> Why does your mother's comfort level come above that of your new wife?\n\nbecause it is her body. I don't care who the bride is, how much I love my wife, etc. no one's comfort trumps the person who doesn't want their body touched.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "> That’s super insulting\n\nI don't see how it is insulting. She finds dancing a romantic/sexual thing, nothing to do with me", "treating me like shit because she doesnt want to be touched in ways that make her uncomfortable? We used to have a great relationship and unfortunately don't anymore, but I can understand her being uncomfortable with having to go up and fake it. She finds dancing very romantic and/or sexual and I thought dancing with my mom was a bit weird to begin with", "> but clearly with the boss she dosnt. \n\nI've said multiple times her issue was because I'm her kid and she views it as romantic/sexual. My boss has no relation to her", "My partner has two sets of parents and i just have the one. We were silly and we did a little round robin type thing and we started with the traditional mother son and father daughter and then switched so we each danced with the three parents. \n\nIt wasn't something we rehersed just something we talked about. The only awkward part was when the mums went to dance with hubby's dad. My mum took one for the team so MIL didn't have to dance with her ex (he cheated with the new wife they are on parenting terms but not crazy friendly).", "My dad has acid reflux and on our wedding day, I guess the food didn't agree with him because he was throwing up when we were supposed to dance together. So I never really had the father/daughter dance, but my FIL stepped in. Idk what was going on with OP's mom, but if she wasn't willing/able to dance with OP, that has nothing to do with his wife and she just needs to drop it.", "This! Nta", ">they think that everyone should always side with their S/O\n\nWell technically Callie should side with her husband and respect his decision on this matter  :P", "I’d love to hear Callie’s side. Picking fights with a new mil is a choice unless the mil is a torrent of drama and wasted efforts.", "Well, we are on reddit now, and the highest rated comments are all NTA", "It’s a brother this time for variety!", "“She used to be a showgirl and my boss was all over her” was a new twist on “she’s still young and everyone loves her and her new husband adores her and hates us”", "No husband for MIL, no fashion issues. But I’m probably giving them a little too much credit.", "Oh… you’re just the MIL troll.", "Would be neat to know what would happen if Callie called Manipulator-in-law an idiot.", "They’d have to do an IP ban at least, and nobody’s making that much effort for a subreddit. It’s always a new account.", "Then ESH. Callie shouldn't have started a fight and your mom should have said \"hey I don't feel comfortable with this situation\" well before it got to the point of shutting down.\n\n\n\nJust freaking out with no communication is childish no matter what, but it's especially crappy on her part to pull this crap if she knows she gets that way sometimes. It's an issue she's aware of and can anticipate. She needs to be an adult and use her words *before* she's in the middle of an anxiety attack.\n\n\n\nI say that as someone who deals with anxiety like that daily due to PTSD. Her mental health issues are her responsibility. *She* needs to learn what boundaries she needs and enforce them. Children say nothing and then melt down. Adults remove themselves from the situation and/or speak up.", "Seeing as it’s your mom, I’m glad you don’t find that insulting. I do - people dance with their friends and young children, parents and grandparents, all the time and it’s insulting to consider all of that sexual. It’s very clearly not a sexual thing. Hell, dance is often taught in gym classes during school. \n\nThe only time dancing is sexual is if two people are basically grinding against each other. Which isn’t the kind of dance you would have done with a parent. \n\nSo yeah, I think your mom and Callie are both assholes. You’re not though! Sorry you’ve been stuck with this conflict between them.", "I agree that Callie lacks empathy in this situation and is being selfish. OP has vouched that mom didn't look great and he was fine with no dance. Wife needs to get over herself and start creating problems where they don't exist.", "I'd say ESH. I get why Callie is an ass, but it's also incredibly childish of the mom to not speak up like an adult well beforehand instead of creating drama at the wedding. Callie is wrong for making such a big deal but OP's mom is an adult and adults use their words to communicate discomfort. She most likely had months to speak up and if Callie is an asshole for not behaving like an adult, so is OP's mom.\n\n\nI say all of this as a person who suffers severe anxiety, PTSD specifically related to speaking up for oneself, and with the understanding that it's hard to speak up. Yes, it is hard. I understand better than most as the ability to do so was literally physically beaten out of me and I had to learn how while dealing with the fear that setting boundaries would result in a beating. Being an adult means communicating that anxiety, not using it as a get out of jail free card.\n\n\nEdited to add: I'm not calling potentially having a panic attack childish. I'm calling it childish to take absolutely no precautions and then just flip out with no warning or explanation. Those of us with severe anxiety issues know that it's not everyone else's responsibility to avoid anything that *maybe could potentially* be a trigger. It's our job to learn them and set necessary boundaries. For example, I am extremely sensitive to religious talk due to the ptsd. Yes, it's important that the people I'm close with follow the boundaries around religious discussions I've created, but ultimately, it's my job to enforce my own boundaries and take precautions like avoiding any close relationships with religious people.", "I was think it sounded like an anxiety/panic attack, too. Maybe the thought of being such a focus of attention  was too much for her, it's  not for everyone.", "“Callie needs to learn that if discussing the problem isn’t going to result in any sort of solution, aside from your own self satisfaction with being right, its not effective to do so.“ Putting this in the vault.", "Yeah, hopefully she will change if they go to counseling, but drama queens are hard", "Or maybe some women just have weird behaviors or reactions to things? Its bizarre to think every story involving a MIL is some sort of anti women screed, especially when the people writing most of these stories are women themselves.", "And also OP’s boss to show that MIL is still super attractive.", "> Idk why you are getting down voted. Reddit is weird\n\nReddit's full of children, that's why.", "I get her behavior is pretty abnormal but to be honest I find parent child dances a bit weird.", "Maybe she was hoping she'd manage to get through it. Maybe she actually thought it was OP and Callie's big day and didn't want to burden either with her own issues. Maybe it was her first panic attack (if that is indeed what it was), in which case planning for it would be impossible. It's also not clear where mom was when she was dealing with it. If she was in the middle of the room demanding everyone's attention while it happened I'd agree with an E S H, but OP's wording (\"Finally her brother came to me\") made it sound to me like she was either off to the side somewhere or in a different room altogether.  \n\n\nI agree that mom would be an AH if she could have spoken up, but chose not to, or intentionally created a big scene at the wedding. But there's nothing in the OP that gives a basis for the assumption that mom actually intended to create drama, or did it for attention. That means that the stuff I pointed out in the paragraph above are equally as likely to be true as your assumption that she could have spoken up, but chose not to, and only did it for attention.", "As someone with PTSD, I can tell you it was her responsibility to speak up *before* it turned into a panic attack the day of.", "Except it’s not a fake boundary and it has nothing to do with her DIL.", "There are like half a dozen repeating elements that always play out the same way with this particular troll. It’s not hard to spot after the third or fourth go around. There are plenty of other posts involving MIL relationships which are different/legitimate (like one right now about accidentally insulting infertility), but this isn’t one of them. \n\nI’m pretty sure troll is the MIL in all these scenarios", " I don’t think Callie would pick a fight if she didn’t already know MIL was drama with a sensible shoe. I’m sad she learned after the wedding that a mother’s manufactured drama is always valid and justification for poor treatment from an enabler.", "I'm not saying that it was intentional for attention. Just that it's her responsibility to express her discomfort *before* it was an anxiety attack. \n\n\nAs previously mentioned, I understand how anxiety works from a lot of awful personal experiences. But that doesn't change that she most likely had months to speak up like an adult instead of waiting til the day of like a child. Not to mention the fact that she made a big enough deal that her son noticed her behavior well before her brother said anything and she was \"radio silent\" about the issue all day despite being visibly upset. \n\n\nOur mental health issues are not others' responsibility to manage. She is an adult. She had plenty of opportunities to say \"hey, I'm uncomfortable and don't want to do the dance\". For whatever reason, she didn't do that and instead handed it like a child. That makes her *as much* of an asshole as the bride who flipped out about it on behalf of her new hubby for no real reason.", "Then why did she dance with a complete stranger?", "I think \"Callie\" found her way to this thread, lmao", "Oh, got it, sorry", "No, it’s a person who posts a variation of this with a new user name about once a week. Usually wedding or lately holiday celebration related.", "You're refusing to accept that there could be other explanations for why things wound up the way they did, and are basing your judgment on the assumption that mom knew this would happen, and therefore should have taken steps to mitigate it. But there is nothing in the post that supports your assumption, because all the post lays out concerning mom is *what* happened, not *why*.  \n\n\nOP might have known something was going on with mom because it's his mom and he's intimately familiar with how she expresses discomfort. That doesn't mean it was apparent to anyone else at the wedding. She might have been \"radio silent\" simply because she didn't want to draw OP's attention away from his wedding and wife.  \n\n\nThere is simply nothing in the OP that allows you to reasonably conclude that the alternate explanations I've provided are wrong, which means there is also nothing in the OP that allows you to reasonably conclude that the explanation you've provided is correct. You're basing your judgment of mom on an assumption you have no basis for anywhere in the OP.", "LMAO. The new DIL who wants to start drama for funsies is the least normal person there and the one with the most insane behavior.", "I think we found Callie", "Again, pallor and sweating are autonomous functions, so unless you're suggesting in this fantasy world of yours that she poisoned herself, she was having a panic attack.  And again, nowhere did OP say she started dancing \"instantly\", that's a figment of your imagination.  So once again, I ask, what's up with you?", "Dying at you trying to argue and tell the OP what HE said. Truly laughable.💀", "She was a showgirl type dancer, so it was meant to be sexy and there was no partner/no one touching her. She absolutely does view dancing with a man as a romantic thing. When I began dating my wife, we were no longer close and she was no longer comfortable with affection", "Panic attack, women feinting, fibromyalgia \n\n\nShe may have believed she was having physical symptoms that instantly disappeared once it was time to party \n\n\nBut that’s still fake of course", "[removed]", "So she couldn’t hug once you got a girlfriend?  What’s the explanation for that?", "As someone with PTSD due to awful childhood experiences Callie is not completely to blame. She's a total ah for sure, but at the same time OP's mom is an adult and fully capable of using her words. She had all day to say something and probably at least a week leading up to the wedding. She may not have started the fight, but her lack of responsibility for taking care of her symptoms is a problem as well.", ">Panic attack, women feinting, fibromyalgia \n>\n>\n>She may have believed she was having physical symptoms that instantly disappeared once it was time to party \n>\n>\n>But that’s still fake of course\n\n\nYou could have just said, \"I hate women.\" and gone on your way.  Would've saved a lot of time.", "Can you read? Did I say confused? No I didn’t. I said laughable.\n\nYou’re the only who needs a reality check, you seem oddly invested, you know this is a Reddit stranger right? Unless…it’s not? Callie, is that you?", "You're pointing out to OP how he's wrong, objectively, about the things he himself said and experienced?", "We began having issues and weren't close anymore", "No, but she taught me not to start fights and then play the victim. What type of dancing are you doing if you think it was only her shoulder?", "Your wife needs to respect YOUR boundaries and how you decide you want to deal with things that involve you.\n\nShould you have let your mom call her an idiot? No. But she does need to learn some boundaries.\n\nESH.", "NTA.  You told your wife not to create the confrontation and that you would not support her in this argument. Then you simply did what you said you would.  Callie may have called you a failure, but in my opinion *you did not fail*.  You stated your intention and you stuck to it, that is the kind of person I respect.\n\nHave you and Callie been together a long time?  Why is Callie so unaware of how your mother behaves?\n\nKudos to you for navigating murky waters.  Issues between MILs and DILs are often conflict filled.  That's a shame, they both love the same man (son or husband) so why fight over it?", "NTA but that isn't what 'radio silence' means", "YTA\n\n&#x200B;\n\n\" and I hope Callie knows I have her back.\" ... That's a lie. You don't, and you know it.", "NTA.  Your wife should pick her battles.  This one was not worth discussing.  You warned her in advance, so it was her choice to get into an unnecessary argument.", "NTA \n\nAlso the mother-son dance puts the absolute limelight on your mother. \n\nShe doesn’t like being touched. Was uncomfortable with touching her son that way and probably didn’t want 200 people staring at her. \n\nThis is totally different to dancing on a packed dance floor. \n\nCallie needs to chill and pick her fights more wisely", "NTA. If your mom called your wife an idiot, why is that your fault?", "NTA. This would be wholly different if she intentionally snubbed your wife and you told her to let it go. You would be TA then. But if you didn’t mind that your mom didn’t want to dance then your wife should have taken your lead and dropped it as well.", "NTA. I get that she’s upset about it maybe ruining the aesthetic of the wedding since it “changed tradition,” but if you were fine with it then ultimately that’s really what matters. The dance is meant to have significance/meaning for you and your mom, not your mom and Callie. She picked a fight that wasn’t hers to fight (and that wasn’t even a fight to begin with since you were fine with the change).", "Your wife needs to learn to stay in her lane.  It was inappropriate of her to talk to your mom about that when it didn't concern her one bit and you weren't even bothered by the issue.  NTA", "You warned your wife, so you aren't the AH.", "Honestly it’s hard to tell if your mom really snubbed you out of smite. But she at least was able to tell you without making a scene at the wedding which is all you can ask for. Your wife should learn that something’s just need to be dropped. NTA", "INFO: You sure ramp these up around the holidays Mother in law troll", "NTA. And you dont have to have your spouses back when they are in the wrong. Ill have my wife's back most of the time. But ill also let her know when I think she's wrong. Usually in privite unless the situation can't be helped.", "op=NTA \n\nBecause you warned her ahead of time and there wasn't a reason to bring it up, it accomplished nothing\n\nThat said, your mother was pretty much an A-H, you were going to do a formal dance not dirty dancing yet later she has no problem being at the center of attention which actually probably did directly affect your new bride as they were stealing attention from her for (dirty?) dancing.  \n\nYour mother made it about herself TWICE.  So at least you could acknowledge your new bride's feelings.", "NTA There is also a lot of difference between just letting loose on the dance floor and being the center of an entire room's attention.", "Mom having a near panic attack at having to dance is rather weak looking.  But, if the son is okay with her bagging out on it, then that's that.  This didn't need to become an argument.  If I wanted to do a mother-son dance at my wedding (I didn't) and my mother didn't want to, it wouldn't bother me.  My wife wouldn't care either.", "NTA. Her being your wife doesn’t mean she gets special treatment.", "You have to have her back even if she's wrong? No, if she's wrong you tell her she's wrong, you don't support or condone it. If she insists on acting in the wrong, she is on her own. NTA.", "Lightly ESH. You chose to become a team with your wife and should honor that. While I don't believe that means defending every single thing blindly, I do think how you phrase it is important. From the title, calling her thoughts and feelings stupid, is demeaning. If you said it that way to her you're saying what she feels only matters if you agree. Her feelings are valid whether you deem them based on a good reason or not. \n\nIn that same breath that also means she should respect your feelings also and she should have followed your lead on how to handle this situation. It was your wedding too and your mother so if you didn't find issue with not having one little dance your wife should have dropped it. Compromise, understanding, and figuring out how to maneuver situations as a team is vital to a healthy marriage so I hope you both work on these together.\n\nI'm glad your mom didn't pass out but her behavior is pretty weird. You know her well and called her difficult yourself so idk that your wife thinking this was a slight is that far off base. Especially given the showboat dancing she enjoyed for hours that same night. Her calling your wife names is pretty unwarranted though and that isn't something you should allow no matter who you view as right or wrong. \n\nAt the end of the day this doesn't seem like something worth starting a big fight over. A quick \"Sorry for the misunderstanding, let's move on from this\" from everyone seems sufficient.", "Yes, you should back your spouse in vegetal.  So when OP said missing the mother/ son dance was no big deal,  and don't bring it up.  Callie should have backed him.", "Eww who dismisses people’s feelings and anxiety as weak looking", "I read this as being dismissive of her feelings if it's something he doesn't care about.", "She seems to be okay with “taking out every feeling” as long as people agree with her", "They post every damn day almost. I wonder what they even get out of it.", "I have to wonder: do you strongly resemble your father?\n\nThere might be some past history or memories that make your mother have hangups with close contact with her adult son.  Maybe a family issue you are not aware of.\n\nIn any case, NTA.  It was a no-win scenario whether you supported your wife or your mother.\n\n> Callie is big on talking out every feeling you have\n\nThis is an area you may need to sit down with your wife about.  Talking over things is good, but life is not a sit-com or a soap opera.  Not every problem can be tackled by just talking about it.  Sometimes letting sleeping dogs lie is a better solution even if it is unsatisfying for your wife.", ">Once the mother-son dance was off the table, OP's mom was able to calm down and enjoy the rest of the party, hence why she was able to dance later. OP had no issues whatsoever with any of this.\n\nThis is why I used to get accused of faking my panic attacks and (diagnosed) anxiety. Because once the pressure of the situation was off, I could do the thing later. Like, planned events of me in the spotlight, nope. Doing the exact same thing casually, with no pressure and no plan - much easier.", "I’m sure this is the first, weird thing Diana", "It almost feels like it's a fetish for them. Which makes it even worse, because none of us have consented to it.", "OOTL, who is this troll, was it an old post that blew up? Or are we reading MIL drama fiction...", "Except she still danced with the boss.\n\nIt sounds a lot more like she has autism to me.", "> There might be some past history or memories that make your mother have hangups with close contact with her adult son. Maybe a family issue you are not aware of.\n\nNo I look like her. She's pretty chill with my dad, says he is a bad person but claims it isn't his fault.", "omg that is so sweet.   idk parent child dances at weddings sound intimidating. at my quinceañera, we had the dj play like 10 seconds of a super sappy father daughter song, then cut to i feel good by james brown. my fam all joined on the dance floor. it was super fun and sweet!!! i will definitely do the same at my wedding.", "I think I learned it in DBT! It was something like, questions to ask yourself before choosing to confront someone.", "People like that tend to use therapy as a tool to further their behavior.", "I wish the mods would do something. I’ve seen some sites check IP addresses to make sure ppl aren’t trolling on forums. But I guess  a mod wouldn’t have access to something like that. Especially when people always comment and engage on these stories. Usually I go with the suspension of disbelief on reddit so I can enjoy stories even if they may not be true. But this is just the same story over and over again.", "There is a running list of the same tropes in these stories. Someone on here even created a BINGO card because the Troll uses the same 4 - 7 plot points.", "I think you both need to stop diagnosing strangers over the internet.", "they forgot the rich asshole husband that \"coddles\" her", "I would very much like to see that.", "Noting symptoms and diagnosing people are two different things. \n\nThe person above literally did the exact same thing except you're not accusing them of diagnosing her with sexual trauma.", "Faking the medical problem is a leap with the information we have", "Nope - it’s an established pattern.", "\"I'm always right. Everyone else is the problem.\" -You apparently", "Any objective perspective? Hardly, I'm reading through all the comments and the vast majority of OBJECTIVE perspectives heartilly disagree with you. We are talking about %90+", "YTA. Poor Callie, she did the mature thing and tried to talk it out instead of holding a grudge.", "YTA. The entire rest of the situation is ultimately irrelevant: you let somebody call your wife an idiot to her face *without defending her*. You don't have to argue on her behalf or even agree with her regarding the issue at hand, but what's wrong with you that you would let somebody straight up insult your wife right in front of you? Of course she's hurt, dummy - If her own husband won't have her back, who will? Apologize to your wife, and make it clear to your mother that she will not speak to her in that manner *ever* again. At the risk of appealing to outdated ideals of masculinity, be a fucking man next time if you don't want to lose your woman.", "INFO: I'm sorry but I don't think anyone should be giving judgement here before we know what the heck was going on with OPs mom? Like what the actual heck?\n\n\nShe \"went silent, got agitated, pale and shaky, almost passed out\" because she didn't want to do the mother-son dance. And somehow she never mentioned this beforehand.\nShe hates being touched but can dance with your boss for hours? \nSo she wasn't just nervous to be seen dancing and was comfortable dancing very flashy with some dude but almost has a mental breakdown dancing with her child? Why??\n\n\nI feel like I'm going insane because not enough people are questioning this weird stuff before making a judgement because honestly that is so weird that I completely understand if OPs wife needs to talk about it.", "YTA, your Mom is a bigger one. I'm pissed just reading it because you start out by saying your mom is difficult, you should do something about that if it's affecting your marriage.", "NTA your mom didn’t want to dance with you for her own reasons, your wife should have left it alone", "One shouldn't overstep hard boundaries to pick fights that don't concern them without expecting retaliation. Callie is an adult and capable of fighting her battles. All cards were on deck. She's no Damsel in distress.\n\nNTA.", "Nta and in defense of your mom . The mother son dance tell your wife it would of been just your mom and you with everyone watching.. as an introvert myself that doesn't sound fun at all.", "ESH\n\nCallie needs to chill. People shouldn't have to be forced to dance with people they don't want to dance with, even if it is an intentional snub. That was between you and your mom. You were fine with it. It's almost as if Callie was being offended FOR you, which is childish. Heck, Callie WAS being an idiot. It no way should have mattered, even if traditional wedding. She started drama, now she has to deal with it.\n\nYour mom is being irrational. You say it's because she doesn't like being touched, but she litterally spent the whole event touching with your boss. Creepy in general. But also? Ew, her viewing a simple mother-son dance as sexual. Mother-son and Father-daughter dances have been big for decades, and not sexual at all! She sounds like she has some sort of trauma, with how you describe it in comments, that needs to be taken to a therapist.\n\nYou? You still should have supported your partner, though yes she should've left it between you two. You still shouldn't have tolerated name calling. The first thing you did when you got married? Was leave her out on her own. Yikes.", "NTA. You gotta know when to pick your battles. A mother son dance is not worth fighting over. You didn ' t want it. Your mom didn' t want it. That should have ended it. Callie may be  at the stage where everything your mom does bothers her. (Often called Bitch Eating Crackers stage).", "NTA", "NTA. Callie needs to know that sometimes shit is just OVER. And needs the be let go.", "another wife spending too much time on r/justnomil . NTA.", "ESH. OPs mom seemed to have a genuine panic attack and your wife seemed to be okay with the change up because of the physical reaction your mother was having. \n\nIt was pretty crappy of your mother to be involved in such “attention seeking dancing” as you put it, right after making such a fuss about not feeling comfortable with being touched and not being able to dance. \n\nIt was also pretty crappy of your wife to ignore your wishes and bring it up. \n\nFinally, it was crappy of you to allow your mother to call your wife an idiot in front of a group of people. \n\nI get that you said you wouldn’t back her when it came to this topic but there’s a huge difference between not backing someone and allowing your mother to be blatantly disrespectful. Name calling never needed to be involved and now your mother knows she can get away with calling your wife that in later disagreements. You said yourself that your mom can be difficult and if your wife wants to talk everything through, This means that there’s likely going to be a lot of confrontations in your future. Even if you disagree with what your wife is arguing for, you shouldn’t allow for unnecessary name calling to get involved. That’s going to make things get progressively more hostile in later confrontations.", "I disagree. The point where OP became the asshole was when he allowed his mother to straight up insult his wife in response to a disagreement. I would *never* allow somebody to speak to my wife in a disrespectful manner, regardless of who they were to me. His wife could very well be wrong about it being an intentional snub, but that does not justify name-calling and she's rightfully hurt that the literal one person in the entire world who should always have her back let that happen.", "Mother son dance when everyone is (supposed to be) watching is also very different to just having fun on the dance floor, where less people are watching.", "The wife needs to have the husband's back and not create a situation where boundaries are intentionally broken and consequences that are predicted from discussions arise.\n\nUnless you view *support and having back* as a gender role men need to take on exclusively while women get to walk all over them and their boundaries.", "I have. We have greatly lowered contact, but I draw the line at telling her that she needs to let anyone touch her against her will", "[deleted]", "So why did she wait until the day of to bring it up? Why didn’t it come up in the *months* of planning wedding require?", "The fact that your own mother won't hug you is super depressing man... regardless of whether you're the asshole here, *she* definitely is.", "Hahaha", "I agree with all of your premise but the painting of this story this way just made me think something was weird.  I kind of feel like the mom is painted as crazy and the wife as hippy dippy.", "Nah, thats not crossing the line imo. Threats or violence or severe insults would be. But i mean, the line is subjective i suppose..\n\nIt is a little sexist, nothing new for reddit though", "Maybe she thought she’d be able to do it but had too much anxiety the day of. Similar to panic attacks before public presentations or any other high attention event.", "That's not it at all though. Somebody insulted her to her face - he's obligated to defend her there, regardless of who was right or wrong in the initial disagreement. It's not about gender, it's about partnership. If somebody called me an idiot in front of my wife, even if it was over an argument where she disagreed with me, she would still defend me. You guys seem to mistake a disagreement with childish name-calling. He didn't agree with her grievance about his mother, and that's fine, but to sit back and just let his mom talk shit to his wife is pretty pathetic.", "Name calling, especially to your daughter in law,  is absolutely crossing the line. It's unnecessary and immature. \n\nHow does this have anything to do with being male/female?", "The wife needs to respect her husband's boundaries the same way he's expected to respect her's. Which in this case, is going off limits in starting drama with MIL. She loses absolutely nothing by pretending MIL doesn't exist. No confrontation necessary until MIL does something *specifically* to the wife. \n\nThe wife fucked around and found out. Not her mom, not her battle to fight. Not doing the dance with OP is entirely a mother and son business. \n\nNone of wife's business. She knowingly overstepped and intended to instigate a reaction and wanted her husband to come to her rescue. \n\nYou shouldn't be picking fights if you need a knight in a shining armor to save you from your own fuck-ups.", "I'm gonna keep my eyes out for the posts from now on, but do you have a link to any of these fake ones?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You are leaping to conclusions that the refusal to dance with her son has anything to do with \"not liking the new DIL\".\n\nThere is almost certainly parts of this story we don't know about, such as why the MIL doesn't want casual contact with her son.  OP may simply not want to bring up that here on Reddit as it could be deep emotional trauma or other issues.\n\nThe simple fact is that Callie butted into a family matter that she didn't know all the facts about, and got her feelings hurt by being called an idiot.  Her husband is right as the son he should know his mother better than Callie which is why he *asked* her not to bring this up and start a fight.\n\nIMHO, Callie's reason for being upset is more likely due to being a bit of a Bridezilla who saw something not go perfectly on her wedding day.  She can learn to grow up and let things go.  Not everyone wants to live like a soap opera character...", "Projection much?", "_\"Callie is big on talking out every feeling you have and wants to have a conversation with my mom about her behavior.\"_\n\nSome things don't warrant a conversation, and I think wisdom is knowing when to engage and when to let things go. It was the mother/son dance. The mother didn't want to do it, and it wasn't important to OP. In reality, this aspect of the reception didn't have anything to do with the bride, and it was foolish for OP's wife to try to make this about herself.", "At this point we really need to get a specific report option just called \"MIL troll\".", "Over experiencing everything is what my childhood best friend always did. It didn’t turn out to he a healthy way to deal with the world. Everything becomes overwhelmingly important and stressful.", "Standing up for her when his mother is straight up insulting her? Would you let anybody call your partner an idiot to their face?", "You don't have to argue on behalf of someone you disagree with, but you do have to stand up for your partner when somebody is insulting them. There's a big difference between \"I agree with my wife\" and \" Don't insult my wife\". The first is an endorsement of her opinion, and the second is a defense of her dignity. She may not be entitled to the first, but I would argue that she is definitely entitled to the second from her own husband if nobody else.", "Except she didn't mind holding her brothers' hand repeatedly, and touching her boss to dance. That's why I'm leaning more towards ESH, the mom for what I stated above, the wife for dredging this all up when asked not to, and OP for not interfering when his mom called his wife an idiot (not saying OP should have his wife's back on the rest, but he could have made 1 comment about the namecalling and leave it at that).", "You are sexist and wrong. Idiot is such a basic and nothing insult it barely warrants a response.", "Maybe she didn't know that would set her off. Do you know 100% of the time what may and may not trigger your PTSD? I don't have anxiety attacks or PTSD, but I had a panic attack in a grocery store once and was hiding in a corner, in near-panic mode, nearly hyperventilating, waiting for my son. Did I suspect at all that this would happen? No, so how could I warn my son that it might happen? Now, I do have claustrophobia and warn people when I need to be in a crowded place that I might have to leave or I might get nervous. But claustrophobia wasn't the issue that time.", "I very clearly said \"I think *you* ***both*** need to stop...\" \n\nI wasn't going to say more than that, but if you're going to kick a fit then here's the longer version.\n\nYou're not noting symptoms if you say, \"sounds like autism.\" That's not how that works. It takes several guided sessions with a professional to officially diagnose any form of neurodivergence. Literally no one, not even an expert in the field of psychology, is capable of assessing symptoms from a post like this, much less considering a diagnosis. You're not even hearing the side of the person in question. \n\nAnd I'd say it borders on ableism to look at a post where someone is objectively behaving against expectations and pointing directly to ASD without any proof or knowledge. Autism isn't a catch-all for othering unlikable people.\n\nAssuming symptoms, trauma, intention at all is ridiculous with so little information. You could just as arbitrarily point to narcissism, TBI, being drunk/high, a derealization/fugue state, a manic episode, or being raised by a pair of incestuous trapeze artists. \n\nShe could also very well just be an AH with a weird thing about touching. So, it's better to just vote whether OP is the AH instead of playing pin-the-tail-on-the-mental-illness.", "INFO:\nYour mom lobbed a direct insult, \"idiot\", at your wife. Did Callie come back with something similar or did she manage to keep the focus on the issue of the dance and her feelings?          \n\nIf she and your mom traded insults then yeah, NTA. You told her not to bring it up and it's not fair to ask you to play referee in a verbal catfight.          \n\nIf your mom was the only one calling names, then a tiny bit YTA. You didn't need to address the dance thing or take your wife's side, but if you heard your mom call your wife an idiot (while your wife is maturely bringing up an issue she has) you should have at least pulled the \"hey, insults are uncalled for\" card.", "So if my wife has an agreement with her father that has nothing to do with me, absolutely 0. Is it cool if I go against her wishes to disagree and talk on her behalf to the dad?\n\nI think I'd be deserved to be called idiot for doing that, seeking out conflict, not respecting my partner's boundaries and whatnot over something that has fuck all to do with me.", "I doubt it very much if she was out there whooping it up shortly after.", "> Wife needs to get over herself and **start creating problems** where they don't exist.\n\nSure about that?", "I suffer from massive anxiety/panic attacks. Often I feel much better soon after 'the threat' is gone. That's literally how it works for many of us.", "Lol meant stop"]}