{"id": 4474, "submission_id": "ziin4k", "title": "AITA for telling my fiancé his brother can't come to our wedding", "selftext": "I'm 27F and my fiancé is 25M. We've been together since my senior (and his junior) year of hs and have been engaged for about 6 months. We've just started the process of wedding planning and so far don't have an exact date yet and no one has been invited. \n\nMy fiancé's brother (22M) is to put it simply a bad person. We've never gotten along. I've always been close with his other family members, but his brother has been mean to me since day one of us dating and is literally a criminal. \n\nHe was in and out of juvy throughout highschool, mostly for shoplifting. He currently is unemployed and taking complete advantage of his gf while he does illegal substances and she works 2 jobs. \n\nMy brother and him are the same age and were in the same class, and they absolutely hate each other. He was my brother's bully in hs, and my brother came home on multiple occasions literally crying because my fiancé's brother was making fun of him or trying to peer pressure him into illegal activity. \n\nDuring this time my fiancé always was on my side and would talk to his brother and try to stop it. He's never been close with him and never defended his behavior. \n\nWhich is why when I told him I don't want his brother at the wedding I was surprised he had any issue. A few nights ago we were making a guest list of everyone we think we want to invite, and we were riding down all the names of his family members. I told him \"well everyone besides (brothers name) can come because obviously we don't need him there.\"  \n\nMy fiancé got super upset. He told me that's he's family and it would be wrong not to invite him. He said it's his wedding too and I don't get to decide weather or not his own brother can come. \n\nI told him I'm not under any circumstances having someone like that at my wedding, especially since my brother will be there and it'll probably cause a fight. I told him it's a \"No. Period.\" and I'm not even considering inviting him. \n\nHe said I'm being controlling and I'm acting like it's only my wedding when it's also his too. \n\nBut, am I really? I just don't want toxic people there. I don't want fights between our brothers. And like I said my fiancé and him aren't even close, it's not like I'm taking away his best friend. They haven't even spoken in a year. \n\nMy fiancé has been mad at me for days now over it and neither of us are budging. And now idk what to do. I'm worried if I don't let him come it'll ruin the whole day for my fiancé and if he does come it'll ruin the whole day for me and my brother. \n\nAITA for telling him his brother isn't allowed to come?", "created_utc": 1670741174, "permalink": "/r/AmItheAsshole/comments/ziin4k/aita_for_telling_my_fiancé_his_brother_cant_come/", "score": 118, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Because it's his wedding too and I don't get to just decide who will come. His brother is family.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Oof. Elope?", "NAH\n\nYou're right in deciding what kind of people you want in your wedding.\n\nBut it's also you're fiancé's wedding and he gets a choice too. \n\nYou'll just have to come to a compromise.", "INFO: Are you willing to not get married if you aren't willing to invite his brother? That's the question to ask yourself, because it may come to that. If the answer is yes, you're not TA; if no, you are.", "NTA. Don't marry someone who insists you tolerate abusive people just because they're family.", "NTA. A deep conversation needs to be had on why this is so important to your fiancé when they haven't talked for a year and his brother was such a bully he made someone repeatedly cry. Someone who would be there and doesn't deserve to have to be around that person. \nSomething seems off about that. Is it possible he just wants to elope and doesn't want to say that outright?", "Saying \"No. Period\" ?????? To a person you're wanting to spend the rest of your life with?  You have your list of who you want, he has his. If you disagree with who he wants, you need to have a serious discussion about it - like adults do. Your fiancé has equal rights here which you seem to completely disregard.  And for that I say YTA.", "[deleted]", "YTA because of the way you are approaching this. You just instructed your fiancé that of course his brother will not be attending your wedding, like you already made the decision for both of you and he doesn’t even get to have any input. That’s not how you’re supposed to make decisions in a marriage. \n\nFamilies are complicated. His brother is becoming your brother as well. You two need to sit down and have some serious conversations about what kind of relationship you will both have with him and how he’ll fit into your lives. But you can’t just declare that you won’t even talk about inviting his brother and your decision is final. \n\nIt’s only 50% your wedding. It’s 50% his too. You need to be discussing these decisions together.", "YTA for marrying the brother of YOUR brother’s bully, and expecting him to not invite his own brother to important events. They might not be close but do you really think you can just avoid your future BIL forever??", "NTA only because the brother honestly does not deserve to be there at all for you. Your fiance can disagree with you by all means but it does not make YTA. I think something you should consider it the way you worded it to him may be the bigger reason of him being upset. Enjoy experiencing the needed flexibility of a marriage figuring this one out!", "ESH \nIt's his wedding and his brother, you can't unilaterally make this decision. However, if his fiance and future BIL hate his brother, who, according to you, he isn't that close with, it does bring into question his priorities. Both of you suck a little for not discussing the reality that you'll be family and what that means. It's your wedding now, but what about family events? Will your fiancé keep inviting his brother to things that you really don't want him at? Best of luck OP, hopefully the big day goes well.", "NTA you don't let abusers in your environment ever.", "There was a bride on TikTok making a PSA in the bathroom and hallway at her wedding/wedding reception. The reason was, she invited her dad to be there.\n\nHe got drunk and fought, causing a huge scene! It ended with the bride crying her eyes out in a bathroom and hallway.\n\nShe advised; that person you’re scared to invite, because you think they may ruin your wedding. DON’T, because they will!\n\nDon’t ignore your gut. Remind your husband that you would never get over it, if anything happened to ruin both your day. \n\nNTA", "NTA and youight want to reconsider the whole thing do you want that kind of person around future children", "You guys really have to discuss what the future dynamic will be with your BIL.\n\nDoes your husband gloss over his BS and expect everyone to tolerate it? What happens if you two decide to have kids and he wants some sort of involvement?  \n\nYou're NTA for not wanting a toxic person around, but this is a bigger problem than an invite list.", "Soft YTA: your position is sympathetic, but you do not technically have the right to stop your fiancé from inviting his own brother as it is his wedding too. \n\nThere's nothing wrong with trying to persuade him, though, with the right approach. Try to get to the heart of the matter and find out why he really wants him there, given how they're not even close, how the brother hates you and bullied your brother, and the potential for upset if he's there. The two of you definitely need to reach some sort of agreement or compromise.", "YMBTA, when I was about to get married to my first wife the premarriage counselor(required in the church we had rented) said \"This is her day, you just have to stand there.\" I replied \"If I'm not standing there she doesn't get \"her\" day as you put it.\" So yes he gets to choose as well who attends, you can either compromise(big part of marriage) or not get married.", "they haven’t even talked in a year and he was your brothers bully? Why is it important to your fiancé that he come? \n\nI would be concerned that he’s placing someone who hates you over you and your wants for the wedding. I get that it’s both of your weddings, and he should have a say, but seriously?? His brother is not a good person and was actively harmful to someone you are close to plus he hates you! I wouldn’t want him at my wedding either. \n\nNTA", "YTA, but with understanding of your position. \n\nIf his brother ever changes course in life, everyone will feel badly that he wasn’t there to share the day. However, boundaries should be drawn. Hire security, and tell your fiancé that if ANYONE causes a ruckus, they will be escorted out—brother or not. There will be no room for error. If he can’t agree to that, THEN you have a problem.", "YWBTA.   Why so many brides believe they have the final say so on the wedding invites.  Regardless of how you feel, it’s his brother-ahole that he is.  Invite him, tell your fiancé if he causes a problem he better have people lined up to remove him.  Warn your brother and make sure family keeps the separated.  Anyone who starts trouble gets removed.  I know this sounds easier then it probably is, but you are getting married.  Marriage is synonymous with compromise.", "your fiance is correct, it IS also his wedding which means he can invite who he wants. Either dont get married to this person or just tell your brother not to cause any problems and ignore your fiance's brother. You cannot speak about your fiance's feelings towards his family members, you can only guess. If you really want to marry him, I would ask him why he wants his brother there so badly.", "YTA. Your fiancé has every right to invite his brother. If you can invite your brother, so can he.", "Nta. If he thinks that you should have someone who is aggressive and hateful towards you and severely bullied your brother at your wedding, then you shouldn't marry this person, period.", "Nta", "NTA \n\nYour husband is TA for wanting to invite someone to his wedding who is openly mean to his future wife (and bullys his fiancees family)", "YTA. Unilaterally declaring your fiancé's brother forbidden from your wedding is not reasonable or how to work in a partnership. I can understand why you would not want him there, and it might be sensible to discuss some possible restrictions or behavioural expectations, but if your fiancé really wants his brother there, it would be wrong to try to prevent him. You have not said that he had done anything specifically to you. Hire some security to eject anyone who tries to start trouble.", "It has been 7 years from high school. \nWhy would you think a fight would start now? \n\nYou don’t get to veto who your fiancé invites. Think how you would feel if he told you not to invite your brother. Even if they aren’t close, this is obviously still important to him..", "NTA.  \n\nBecause fiancé’s brother has also bullied OP.   \n\nIf he hasn’t changed his stripes (and it doesn’t sound like he has), he should not get the chance to bully her at her own wedding.", "“At my wedding”. “No period”?  You are quite overbearing and obviously think you are the boss.  He should run unless he is into a life of servitude.  YTA and his brother is also an AH.", "Your worried about the brother ruining the day. But how much worse will it be if the groom doesn’t show up?", "ESH\n\nHe want's an asshole to his wedding and you don't want to properly discuss the Guestlist with your fiancée. Also you dated and are marrying your brother's bully's brother, who still sees him as family? This is a recipe for disaster and you know it. You need to get a strategy sorted out for when they eventually meet at family gatherings, because it will happen at some point", "NTA. But aren't the brothers old enough by now that they can act civil for a few hours?", "NTA. Never, never, never. While both you and your intended do have every right to invite whoever you each choose you should not have to tolerate someone who hates you and who you in return do not like. Your fiancé should be attuned to your feelings and have your best interests at heart in all things.\n\nMaybe ask your fiancé who he loves more, you or his brother? Ask him if he is happy to see you upset and crying on your wedding day - tear stained makeup makes for horrible photos - because of his presence? If all else fails tell him this is a hill you will die on and if the brother is there you won't be. I don't think this is too extreme a position to take, he is already disrespecting your feelings on a serious issue, will this attitude persist throughout your marriage?\n\nJust a final thought: what if your brother refuses to come if his former bully is going to be there? Is that fair? I wouldn't mind betting that your husband-to-be will find that perfectly acceptable.", "YTA.  Lightly.  Your fiancé gets a say.  But, I can’t understand why your fiancé even wants to invite someone who would disrespect you—family or not.  His brother should have been put in check ages ago.  It should have been made clear that if he disrespected you, they could have no relationship and if the two of you decided to marry, he wouldn’t be invited.  That way, the brother’s behavior would determine whether or not he gets invited to the wedding and he knows it.", "ESH. Fiance for inviting a person you and your brother have a long list of issues with. You for trying to do a unilateral no because it's his wedding as well. Both of you are in difficult positions on this one. He's your brother's bully and you want your brother to be comfortable and welcomed that day. This is still your fiance's brother, your future BIL, so there will be pressure from his family on him to make sure his brother is included. You 2 need to sit down and have a serious talk not only about this but what a future role his brother will have in your new family.", "The only compromise I see here is that your fiancé is in charge of his brother if he messes up gets too drunk rowdy whatever your fiancé has to remove him from the premises that way he gets his brother but is also aware of his responsibilities attached to his guest.", "Your husband wants yours and your brothers bully in your wedding...? OK\n\n\nNTA", "NTA, I would ask your fiance to justify inviting him beyond \"he's my brother\".\n\nDo they even have a relationship, if anyone else had acted half as shitty as his brother would they get an invite? If the roles were reversed between siblings how would he feel about the situation.  Do you have any other \"cheaters\" at the wedding?  any one not get an invite because they couldn't respect their own wedding vows.\n\nIf he gets on well with your brother ask him to explain it to your bro \"If you want him there you can explain to my brother why you want him there and try and ask his position\"\n\nI prefer \"i'm not having him at my wedding, I do not like him, I never want him in my house, and I will never put him in the same room as my brother. If you insist on him being at your wedding, it won't be to me\".", "NTA. I'd postpone the wedding a while longer. If he' stands his ground for the wedding after what the brother has done. The holidays will be a repeat. Need to get this worked out be for any I do's.", "YTA. His brother was incarcerated before he was an adult. He might take “illegal substance” but many people who weren’t in “juvy” in high school also do this. \n\nYou could ask the future BIL to extend an olive branch to your brother, ask that he acknowledge and apologize, and move on. \n\nThe whole time you’re going to be married he will still be your spouse’s brother. You’re going to have to deal with him on some level for the rest of your life. Set a better time now.", "Soft YTA... so as much as I feel that you have some valid points this is still his brother. He should be able to invite him. This is a major event if your brother and his brother can't put differences aside for that day neither of them should go. Make it very clear to both of them that the moment either one starts anything they will be escorted out. This isn't your brother's day this is yours and your future husband's day. His brother shouldn't be left out because you think it would ruin your brothers time.", "YTA\n\nIf a fight is what you are worried about just don’t invite your brother.", "Why would you marry the brother of your brothers bully? Weirdness aside your fiancé is right, it’s his wedding too so you need to have some compromise. Can’t they put aside some old schoolyard beef for a wedding? They are adults now, being bullied sucks but you have to move on with your life at some stage. If it was that bad for your family then you shouldn’t marry his brother. He clearly has serious problems and has obviously struggled his entire life, AH behaviour isn’t excused by this but you’re talking about his issues trivially and with a lot of judgment and labelling him as a “toxic person”, don’t expect the relationship to ever improve while you hold this attitude - YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm 27F and my fiancé is 25M. We've been together since my senior (and his junior) year of hs and have been engaged for about 6 months. We've just started the process of wedding planning and so far don't have an exact date yet and no one has been invited. \n\nMy fiancé's brother (22M) is to put it simply a bad person. We've never gotten along. I've always been close with his other family members, but his brother has been mean to me since day one of us dating and is literally a criminal. \n\nHe was in and out of juvy throughout highschool, mostly for shoplifting. He currently is unemployed and taking complete advantage of his gf while he does illegal substances and she works 2 jobs. \n\nMy brother and him are the same age and were in the same class, and they absolutely hate each other. He was my brother's bully in hs, and my brother came home on multiple occasions literally crying because my fiancé's brother was making fun of him or trying to peer pressure him into illegal activity. \n\nDuring this time my fiancé always was on my side and would talk to his brother and try to stop it. He's never been close with him and never defended his behavior. \n\nWhich is why when I told him I don't want his brother at the wedding I was surprised he had any issue. A few nights ago we were making a guest list of everyone we think we want to invite, and we were riding down all the names of his family members. I told him \"well everyone besides (brothers name) can come because obviously we don't need him there.\"  \n\nMy fiancé got super upset. He told me that's he's family and it would be wrong not to invite him. He said it's his wedding too and I don't get to decide weather or not his own brother can come. \n\nI told him I'm not under any circumstances having someone like that at my wedding, especially since my brother will be there and it'll probably cause a fight. I told him it's a \"No. Period.\" and I'm not even considering inviting him. \n\nHe said I'm being controlling and I'm acting like it's only my wedding when it's also his too. \n\nBut, am I really? I just don't want toxic people there. I don't want fights between our brothers. And like I said my fiancé and him aren't even close, it's not like I'm taking away his best friend. They haven't even spoken in a year. \n\nMy fiancé has been mad at me for days now over it and neither of us are budging. And now idk what to do. I'm worried if I don't let him come it'll ruin the whole day for my fiancé and if he does come it'll ruin the whole day for me and my brother. \n\nAITA for telling him his brother isn't allowed to come?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "This one’s hard honestly:/ NAH because you’re looking out for your brother and I’m someone who’s very much stick with the person in the right regardless of my relation to them. So I prob wouldn’t want him there either. Do you think he’s truly going to make a big scene at the wedding? Your husband will probably have ruined relationships with other family members because of this and it’ll cause SO many issues with him unfortunately. What if you guys let him come, and the first sight of him acting out have a security ask him to leave. Talk to your brother and ask if he is okay with this plan. If not then I’m sorry idk. Elope? Lol", "It sounds like your fiancé only wants to invite him because of a sense of tradition (family is invited to weddings). But the hurt this guy causes is a little more real. I’m sure you’ve had all manner of convos around this, just maybe try pointing this out to fiancé? It’s a tough situation for sure. I still say NTA though.", "NTA if he's that terrible.  The fact that your fiance isn't close to him cinches it for me.\n\nI would talk this out with fiance though.  Is he getting pressure from his parents because there will be no return regarding their relationship once it's done?  Are they or he (or both) mainly concerned about what it will look like?  If a brother of the bride or groom isn't even there, it's going to become a topic of conversation at least among some people.  It's generally a pretty nuclear move.", "Yes, it is his day and of course he should be allowed to decide just as much who participates and who does not.\n\nWhich leads me to my question, why does he want to invite a person who has not only been cruel to your brother and who will most likely misbehave at your wedding - but who is also regularly mean to you?\n\nJust because he is \"family\" he can overlook his behaviour??? And expects the same from you?\n\n🚩\n\nA compromise is to just not get married and stay together like that. After all, you don't have to get married these days.\nOr you can get married in a very small circle, only at the registry office, in which case no one is invited.\n\nHowever, this is not about the wedding or the guest list, but about how your fiancé positions himself when it comes to you and your brother and the person who is cruel to you. The family aspect doesn’t matter in this question. \n\nNTA", "YTA. This is only the beginning and it isn’t looking like a great start.", "NTA, but you’d better have a calm, sit down talk with your fiancé about WHY he wants to invite him. All he has provided as a reason is ‘ he’s family’. Is he dreading the backlash from his brother, mother, other family if he doesn’t invite him? Is he afraid of his brother and thinks he may retaliate? Is he thinking the invite will bridge the gap between them so they can have a relationship?", "YTA because your steamrolling and thinking you can 100% dictate the guest list and leave your partners brother out. Unless your partner is on board you can’t ban his immediate family from his wedding.\n\nYou are acting like your brother has a more important role in the wedding than your partner does. \n\nYou talk to your brother, he talks to his. \n\nThey are warned to stay away from each other. That this is a day about you and your partner and if either of them try and start shit - they’ll be thrown out and not invited to anything moving forward. \n\nHire security so you don’t have to involve other guests or deal with it beyond “get that person out”.  I would even give them a photo of each and tell them to keep an eye on them. That the main reason they are hired is so these two don’t start shit. \n\nIt may seem unfair since your brother is the victim. But there’s a chance your brother could see this as a way to get back as his bully because if shit starts the bully’s the only one with consequence. \n\nIf you brother is up for it, do a test run. Maybe have a smaller gathering and see how they do in the same space, are they capable of ignoring each other? \n\nOr elope. Personally I’d choose this route.", "YTA. You cannot unilaterally make these kinds of decisions. It's not just your wedding. Yes, it sucks that his brother did some messed up things, but this is not how you handle it.", "Is it possible that fiancé is not ready to get married and is using this issue to put a halt to things?\n\nYou’re not wrong to want to not invite toxic people to your wedding regardless of familial status.", "There is a solution , don't have a wedding, go to a justice of the peace and get married. \n\nThat way neither of you have a bad day, ruined by fiancés brother.\n\nI am sorry, I would not invite someone to my wedding who was mean to me, and bullied my brother.\n\nI understand it is the fiancés brother, but he knows what type of person his brother is, and the fact his hasn't talked to him in a year, but wants to invite him to both of your special day just so he can ruin it, because lets face it he will is just a dick move.\n\nHe is right it is both of your day and wedding. But his brother has made peoples life a living hell, and he can't expect you to deal with it, and potentially ruin both of your wedding because of the behavior of his brother.", "NTAH, you have all the reasons in the world to not want that men your wedding, that said, your fiancé is not wrong either, its his brother after all, I think that neither of you are being AH in this situation", "Elope.", "NTA. You have the rational moral high ground--the obvious choice is to not invite a criminal who bullied your family member that your fiance isn't even close to. \n\nBut this isn't a rational time. Go back and talk to your fiancé and ask what solutions he has in mind to make sure his brother stays away from your brother, and doesn't steal from the other guests. So, maybe he's invited to the wedding, but seated far from your family. Will he need to sit with fiancé's family? They might also need to be seated in the back in order to keep peace. Is it fair? No. But neither is wanting to invite a toxic family member fiancé doesn't even like. So things like that will be the price to pay to invite him. Has fiancé thought this all through? Your brother's (and other guests') emotional and physical safety has to come first. \n\nYou might need to hire security specifically to stay on him. Invite him, but require he passes a drug test before entrance. Think about all of the ways his brother could potentially throw a wrench into the day and come up with ways to mitigate those scenarios. \n\nYou can keep an open mind and be willing to give him a chance, but it doesn't mean you shouldn't also be smart about it and compassionate to your other guests as well. So come up with realistic solutions.", "NTA I wouldn’t be happy with that either, if it is such an issue for your SO though to exclude him then how about hiring a security guard to kick out BIL as soon as he makes any trouble, if he knows there is security he may not even turn up tbh so it may solve the issue “please present your invite to event security on arrival”.", "YTA for the ultimatum. YTA for making decisions regarding your wedding on your own. NTA for looking out for your brother. But the thing is, this wedding isn't for your brother. It is for you and your future husband. If he wants his brother there, his brother should be invited. If you don't want him there, don't go through with the marriage.", "YTA - not condoning bully behavior, but seriously? None of you have been in high school for almost 10 years, and that is the reason you want to exclude him? Additionally, someone else said it best with what in the world were you thinking g would happen dating your brothers bully? Do you think his family would disown him because he teased your brother? \n\nYou need to stop taking your and your brothers feelings over your husband's familial ties and actually figure out a plan. Lack of contact doesn't mean they don't consider each other family still.  Based on your future husband's reaction, not inviting him is not an option you have, so YTA, if you continue to push excluding his family from his wedding.", "NAH- it sucks because you have some really valid reasons for not wanting him there but he is right that it's his brother.\nA good compromise would be inviting him to the ceremony bur he can't come to the reception. \nBecause the reception is where he can access alcohol and freely talk (cause problems). Also I wouldn't trust anyone with substance abuse problems to be around high value items. Even non addicted people will steal wedding gifts and cash out of envelopes.  I saw this a lot in the first few weddings I attended and I personally do not bring gifts to weddings ever because of this and send it directly to the couples home and make sure they received all the items. I've had companies not send all the items in the order ans assume the sender never finds out because they didn't receive it.", "N T A for not wanting him there but slight A H for the way you said it \"obviously don't need\". You should said \"I know he's your brother but you're not close and I don't want him there because of his bullying of my brother and his thievery and substance use\". Ask your fiancee if he's going to watch your brother like a hawk the entire time of the reception to make sure he doesn't swipe anything from a guests belongings while they may be on the dance floor. If anyone else knows the brothers history and see him there, any one of them can claim to have had something stolen and whether or not the brother did it 🤷🏼‍♀️ he'll still catch the blame for it and people will be crying to you. Certainly you don't want him to be wasted at your wedding.", "Invite both people but you tell them both, any trouble they both get kicked out whoever starts it", "YTA\n\n&#x200B;\n\n**So you have in effect canceled the wedding.**", "🚩🚩 You need to find out why future hubby is so insistent on having someone who's abusive to both you and your brother at the wedding.  Why is he OK with inviting someone who is beyond disrespectful to you?  The person he claims to want to spend his life with? Why does he think it's OK to invite someone like that to share in your wedding? It doesn't matter that it's his brother, he's abusive\n\nperiod. \n\nFull stop.\n\nEnd of story.\n\nNTA", "YTA for not discussing it proper and going period. You are acting like it’s only your wedding. If you want that then marry yourself", "Mild YTA because you made a decision without consulting your partner. You need to discuss these things together and reach a consensus. there is a huge difference between “of course your brother can’t come” and “what are we going to do about your brother, should we not invite him?”.", "Lol that might honestly happen at this point", "On the one hand I agree, on the other hand the fiance just whipped out the \"well they're abusive but they're family so must be tolerated\" card which is, at best, deeply worrying.", "The compromise can be that the brother can attend, but he must remain in a shark cage during the entire event. Done and done.\n\nProblem solving right here, folks.", "So what would you do if your partner wanted to invite their brother who brutally bullied your brother to the point of tears, is a convicted criminal who continues to practice dangerous criminal activity, and financially abuses his own partner? I'm asking in complete sincerity: what compromise would you use?\n\nNTA, OP. Fiance has proven FAMILY! overrrides everything, no matter how much he dislikes his brother. Take it as a prediction of what will come. \"I need to dip into our savings to bail my brother out of jail and get him an attorney -- family. My brother's been evicted, and I have to let him stay with us -- family. I know he stole from us, but we can't press charges -- family. Of course my brother will be allowed to hold our baby and babysit our kid alone -- FAMILY!\"", "Plus discuss it with your brother who've been bullied to see how he feels about it ? That might make one of you change is view.", "Yep, a wedding's guest list isn't just to tally all the family- it's to have dear ones close to celebrate the union and uplift the couple in what some may see as joining families. DF knows his brother has been problematic to his own family, let alone his future spouse and in-laws - it's probably very hard to admit, but I wonder what he'd say he truly thinks his brother would come to the wedding for, and if he thinks his brother truly wants and offers the best for them and for him in his marriage and healthy life.", "His Mom loves me and she was always the one trying to get his brother to stop and comforting my brother when stuff happened between them. I assume she'd understand and support me. His Dad and sister would probably feel the same as my fiancé does.", "Okay but seeing him once a year at thanksgiving is different than your own wedding. I wouldn’t want to invite a toxic shitty person that didn’t like me and bullied my brother at my wedding either.", "The fiancé wasn’t the bully, his brother was.", "Yeah that's fair, I might have been a little harsh", "Thanks for the advice", "Thanks, this kind of sums up my thoughts", "Tell the victim of bullying to not cause any problems with the bully?", ">or just tell your brother not to cause any problems and ignore your fiance's brother.\n\n1. Wow. The guy getting bullied should not cause any trouble?? \n\n2. The brother doesn't just bully OP's brother. He is also openly mean to OP and hates her. If he hates OP so much, he shouldn't get to go to her wedding.", "My brother never caused any tension with anyone that's a whole different thing. Also my brother is close to both of us, his brother hasn't even spoke with him in a year and hates me.", ">You have not said that he had done anything specifically to you.\n\nYes she did.", "Maybe- but his brother is still basically 16 mentally. He's the type of person to make a \"joke\" which is really a targeted insult just to stir things up and get a reaction.", "No - they aren't close. They don't even talk on the phone. They'll occasionally text each other like maybe every couple months but that's it. They weren't even close as teenagers.", "I'm only worried about that because my fiancé's brother would start that fight. My brother wouldn't be the one starting anything, that's not fair.", "Seriously? OP should uninvite her brother but invite her fiances brother who is mean to her and hates her?", "Of course! OP should totally not invite her brother who was a victim but instead invites the criminal bully who hates her to her wedding. /s\n\nYeah fuck that. OP should elope or cancel the wedding.", "So as usual the bully wins.", "Thus punishing her brother, because his brother will start shit.", "Even if you decide to elope. You and your fiance need to have a serious conversation about both of your brothers. Will he expect his brother at all big events even if he doesn't get clean? Is his family putting pressure on him? How will you guys deal with your brother being around his brother? What if you have kids?\n\nNeither you or your fiance are the AH but this is more than a wedding guest list problem", "So you can’t tolerate him at your wedding, but you think if you just skip the wedding you’ll be able to tolerate him…forever? I’m no Einstein but that’s not adding up to me.", "Prob for the best- that’s a tough sitch", "No without a signed, notarized contract stating Fiance will never give his brother money or invite him to stay with you or let him be around your kids and will definitely press charges if he steals from you.", "This. \"We must tolerate and forgive bad behavior because family\" is actually a huge red flag.", "I absolutely love the mental picture your comment painted in my mind.", "I like the way you think, however, a shark cage has large slats through which future-nightmare-BIL (FNBIL) could still wreak havoc (yelling, throwing things, drug use, etc). Perhaps a restraint setup like Hannibal from Silence of the Lambs is in order.", "But the brother doesn't just bully OP's brother. He is also openly mean to OP. \n\nI wouldn't want someone at my wedding who is mean to me and my family.", "This person said “the brother of your brothers bully” so they get that already", "To reiterate what another poster said, you realize this won't end with the wedding, right?  Every special event, every holiday, will be the same argument.  UNLESS you two get on the same page right now.", "Any chance your fiancé is pushing back because he feels you were being too dictatorial about it? Basically, does he actually want his brother there or is his problem with you acting like you can decide about his family?\n\nIt’s a problem either way that you need to explore and resolve, but they’re different problems.", "I’m wondering if anyone has considered the part of the ceremony where they ask if there are any objections to this wedding? What’s to stop the bullying brother who is mean to OP from standing up and objecting and turning it into a massive drama scene where he can sit back and laugh while enjoying the shit show he caused?", "There are several good reasons not to invite BIL, but only one will persuade your fiancé: the fact that BIL hates you.  Tell fiancé that you don’t want someone who hates you to attend your wedding.", "Someone who hates you should not be at your wedding. That would be enough right there for me to say NTA.", "Well then you need to talk with your husband. Don't just tell him no. If he wants to invite his brother and you are uncomfortable with that, come up with something that you both are ok with. You shouldn't invite someone who hates u to your wedding but that person is also a family member, so talk it out.", "Makes me wonder why he wants him there. Is he planning a surprise ritual sacrifice on behalf of you and your brother to appease the marriage gods?", "Then I don't understand his position. please consider my above talking points above.  Tell him that inviting his brother would ruin his relationship with your brother/his soon to be BIL. Ask him which relationship he values more and pick one.", "I was just making a point, it hurts to think of not having your brother at the wedding. Your fiancé feels the same way about his brother. You are going to be married to this man which means you are going to have to see his brother. Are you going to tell his parents you will never go to there home for holidays or birthdays? Are you going to force your husband to distance himself from his family? What if the jerk has kids? Does your husband not get to see his nieces and nephews? Until your husband decides to go NC with his brother himself you are just going to have to deal with it. Dictating to other people their relationships is not okay.\n\nAlso plenty of jerks have behaved at weddings. Your fiancé is just going to have to talk with his brother and maybe assign someone to keep an eye on him like a cousin friend or even his father.", "I'd upvote this more if I could.", "It’s unfortunate that this hasn’t come up before but I agree they need to have this talk now. Also OP stop “telling” your fiancé stuff. You aren’t his mom and that’s not the way to effectively communicate. I understand your passion on the subject but it will serve you well to have future conversations where you state your concern and allow space for fiancé to respond as well.", "Lets take her brother out of the equation here, \n\nWhy does her fiancé want to invite someone to their wedding that is literally mean to her all the time?\n\nWhy would he put her in a position to be uncomfortable or possibly have something said or happen to her by his brother at their wedding.\n\nHe knows that his brother is mean to her, but by wanting him invited to their wedding he is showing her that it is ok for his brother to treat her however he wants and he will choose his brother over her every time, because he is family.\n\nThat is a red flag if you ask me.", "yeah…. I can see OP thinking that since her fiancé isn’t close to his brother, maybe they can avoid this conflict by avoiding the event that fiancé feels the brother should be invited to. However, weddings are good barometers for relationships. Avoiding the problem just kicks it down the road. If they have kids will her partner insist that his brother be allowed to bond with them as an uncle? What about any future family-oriented gatherings they might host?", ">If Fiancé has been No Contact with his brother for a year(and presumably low contact for before that) I can see why OP wouldn't have had a discussion about it.  But yes, they need to have one now that it is an issue.", "I pictures guards around a cage with harpoons lol.", "I second this. The way you worded it was very assuming and absolute. Telling people what to do with their own family (even when it affects you) even when they agree often ends poorly. I bet this conversation would have gone very differently if you would have brought up your concerns about his brother and asked him what to do.", "What's to stop him banging on the glass window overlooking the wedding venue shouting \"Elaine!\" over and over, before using a giant crucifix to bolt the front doors closed and make his getaway? The mind boggles.", "Hey! How did you know my middle name! LOL the mental image you just gave me almost made me spit out my coffee!"]}