{"id": 4502, "submission_id": "zj4s4t", "title": "AITA for telling my older sister that I am not interested in rebuilding our relationship after she left and disappeared for years due to our parents?", "selftext": "My two sisters and I \\[F\\] come from a bad household. Lets say my parents were not very nice people and you can understand the rest. When my Older sister turned 18 she left and disappeared. I was 12 and my other sister was 7 when she left. She left and never looked back , as the first time we had contact again I was 19 years old. I am 21 now and we barely have any relationship. \n\n we met by coincidence last week. We sat down and talked a little. She started being sentimental and reminiscing about our childhood and then she wondered how did we end up like this , basically strangers. I was kind of pissed and told her \" Maybe you leaving me and not having any contact for almost 10 years is a starting point\". She said that she had no choice, she had to get out of our situation. I told her I do not have any problem about her leaving and I do not blame her for that. it is not her fault. But I do not understand the complete no contact for all these years. She apologized and asked me if we can try to rebuild our relationship again . I refused and told her that you can not just forget that you had a sister for like 10 years and then say lets try to be sisters again and that she can try with our youngest sister if she want , but for me this ship has sailed and I stopped having an older sister years ago. AITA?", "created_utc": 1670786359, "permalink": "/r/AmItheAsshole/comments/zj4s4t/aita_for_telling_my_older_sister_that_i_am_not/", "score": 620, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1- Told that you can not just forget that You have a sister and then say lets start again\n\n2- I am not interested in rebuilding our relationship\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NAH, your feelings are completely normal. Your sister had to make this choice for her own well being, but ofcourse it hurts she went nc. You probably feel she abandoned you while you needed her. I think you should give it some time, maybe hear her out and then decide whether you want to have contact at the moment. You are not obliged to stay in touch, but you might change your mind one day.", "NAH. She's not an AH and neither are you. At 18 she did what she had to do. Pragmatically, contacting you but not your parents (the actual AHs in this story) would likely not have been simple. I doubt she forgot about you.", "NAH except your parents. You can go no contact with your sister if you want, but life is long & this is probably a bad decision.  Someday you will understand that 18 is very young & she just didn’t know any other way to get away so she ran.", "Nah except your parents. She wasn18. A teenager herself. She survived the only way she knew how. \n\nFor all she knew if she tried to keep a relationship with you guys your parents would have been upset. \n\nBut yeah you're not obligated but she did her best as a teen herself.", "NAH - Except of course your parents. \n\nYou’re not obligated to have a relationship with her and your feelings if abandonment are valid as is your sister getting herself out of that situation as soon as she could.", "NAH\n\nYou have no obligation to let anyone in your life.\n\nIt might be worth at least hearing her out. She probably felt horrible leaving you behind, but she was 18yo. She could have been waiting until she was fully prepared to reach out.", "NAH. The only AH's here are your parents.", "INFO what exactly did you expect her to do as a teenager fleeing an abusive home?", "NAH. At 18, she did what she needed to for her own health and well-being and, as you said, you don't blame her for that, as for no communication in that time, she may have felt like she couldn't... like contacting you would bring her back into your parents' orbit and thus risk becoming a victim to them again. That said, you're right that it's simply too little, too late for a sisterly relationship. Would you be open to maybe building a different type of relationship with her (friends, light-friends, something that maintains contact but isn't sisterly and doesn't bring up the past anymore)? If so, offer that as compromise. If not, you've met and gotten some measure of closure and can just move forward separately while wishing each other well.", "INFO: How did she react upon hearing that?\n\nThat for me determines whether she's an AH or not (you're not TA regardless)", "NAH\nI understand that you're hurt, but I also understand that she had to leave and go NC. You can make your decision either way, but ask yourself if you are willing to lose her again.", "NTA. But you are being dishonest with yourself in saying you don’t blame her for getting out. You can understand why she left and didn’t want to risk getting pulled back in and still be resentful that she left you and your younger sibling behind in that atmosphere, that’s a totally reasonable thing to feel and you should probably stop denying it for your own health. This doesn’t mean you have to forgive her and reconnect, but it’s not healthy to deny your own feelings when that’s clearly what you’re expressing.", "NTA you don't have to have a relationship if you don't want. She could have emailed or anything to touch base every now and then.", "NAH. Maybe your sister was traumatised and had to get out that house  the moment she could. Everything in and around that house must have been upsetting to her for a long, long time. It wasn't created by you, but your parents of course. \n\nTake baby steps repairing the relationship, but only if you want to.", "NTA. You are completely justified. She was not obligated to support her younger sisters when she left, but neither are you obligated to restore your familial relationship with her at her request. \n\nMaybe give her an opening to begin to repair the relationship slowly, if you want, but you have no moral obligation to her whatsoever.", "I think you’re being a bit harsh on your sister. Maybe her leaving and the lack of contact was what she had to do to get strong again. I think NAH though as you’ve both clearly been through a lot and are just trying to deal with it all.", "NTA. It's your decision if you want to have a relationship with your older sister or not. But, your older sister is NTA as well. I can understand both of you your positions. You had to grow up without an older sister that didn't contact you in 10 years, and she had to leave the house and (of course I don't know why) not contact you. If you feel really bad about your sister or your gut says to establish a relationship with her, then you can give her an opportunity, but remember. ITS.YOUR.DECISION!!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy two sisters and I \\[F\\] come from a bad household. Lets say my parents were not very nice people and you can understand the rest. When my Older sister turned 18 she left and disappeared. I was 12 and my other sister was 7 when she left. She left and never looked back , as the first time we had contact again I was 19 years old. I am 21 now and we barely have any relationship. \n\n we met by coincidence last week. We sat down and talked a little. She started being sentimental and reminiscing about our childhood and then she wondered how did we end up like this , basically strangers. I was kind of pissed and told her \" Maybe you leaving me and not having any contact for almost 10 years is a starting point\". She said that she had no choice, she had to get out of our situation. I told her I do not have any problem about her leaving and I do not blame her for that. it is not her fault. But I do not understand the complete no contact for all these years. She apologized and asked me if we can try to rebuild our relationship again . I refused and told her that you can not just forget that you had a sister for like 10 years and then say lets try to be sisters again and that she can try with our youngest sister if she want , but for me this ship has sailed and I stopped having an older sister years ago. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH", "NTA and this is really sad. I hope she will keep trying (with your younger sister too), but do it by really showing you that she's sorry and really demonstrating that she can be a sister again.", "NAH - Your feelings are totally valid and you would not be an AH to decide that it isn’t worth it to you to rebuild a relationship. However, please keep in mind that it would have been difficult for your sister to have a relationship with you when you were underage without having to interact with your abusive parents. It would have taken her awhile to deal with the abuse she suffered from as a child and she wouldn’t have known how to navigate this issue at 18. You might want to consider giving her some grace here.", "NAH She did what she needed to do to get away. College was my way out at 18, but my mother sabotaged my college applications, so I had to reapply the following year and do everything in complete secret to protect myself. Running is pretty much all you can do at that age. If I had a younger sibling I have no idea how I could of possibly kept in touch with them whilst escaping my narcissistic and violent mother. I have no idea how your sister could both possibly escape and keep in contact with a minor still in the household of her NC parents. It is likely they would of forbidden contact. You are asking for something that was probably pretty impossible.", "Like people are saying\n\nNAH\n\nMy wife's eldest sister got pregnant at 17, or maybe 16, and got thrown out. The father of that baby married my wife's eldest sister, and abused her, and tossed her aside. My wife's eldest sister abandoned the child to the abusive father when she was 18 or 19.\n\nMy wife tried to get the estranged son in contact with her eldest sister, the abandoned boy's mother, when the boy became an adult and reached out to my wife, when my wife was in her early 20's, and my wife's eldest sister wouldn't, or couldn't, handle that.\n\nMy wife held a lot of anger towards her eldest sister for a lot of years, for being abandoned in the horror she had to continue to live with, and later over the abandonment of a child, but they occasionally have long talks on the phone now, more than 4 decades later.\n\nMy wife is one of four sisters, and my wife has been through a lot of psychotherapy. My wife thinks her eldest sister is still in a bad place, but my wife is feeling much better, so my wife can be forgiving of the other victims of what they went through. That forgiveness is limited, and we don't go and visit my wife's sisters in person, but my wife accepts the fact they all had their own rocky roads to travel, and they all made some pretty bad choices along the way. There were no good choices available.\n\nGood luck.", "Nothing. But lets say when she was 21 or 22. She knew where I go to school and the road that I took each day. She could not have once come and see me? It is not like my parents have guards following me. My uncle , the one who helped her after she left, was also willing to help us have some kind of contact without my parents knowing  but She did not want to take any risks.", "she was kind of stunned. apologized again and left.", "Lose her again? She never got her back.", "I am not denying my feelings .  I do not blame her for leaving but I have resentment for the complete no contact. She kept contact with our uncle as he was the one who helped her after she left. He was willing to help us keep some kind of contact behind my parents back but she did not want to take any risks that could potentially have her cross path with my parents again.", "She shouldn't keep trying with OP. She should respect her boundaries and hope she reaches out when she's ready.", "I'm not going to call you the AH here but you're angry at the wrong person.", "“She did not want to take any risks” \n\nShe was trying to keep herself safe and healthy. That’s a priority over your wants. \n\nAnd schools don’t like random adults popping in, they’d have alerted your parents. \n\nI mean this with compassion, but you need to see a therapist. You are upset your sister for trying to save her own life and not risking that to see you at lunch. \nLearn to direct you anger at your parents instead of another of their victims.", "Then NAH. I do think she should've tried to keep contact with you, not take you in but just keep contact. But I don't think she's an AH for failing to do that considering the circumstances. But she's got no right to then be upset that the ship has sailed, and it sounds like she took it fairly well. People can leave whenever they want but they can't come back as they please.\n\nDo either of you keep in contact with your younger sister? It sounds like she's 16 and so I'm guessing she's still with your parents", "NAH. She saw risk in contacting you - maybe for herself, or maybe for you. What would have happened to you if your parents found out you had contact with her? It’s a sad, terrible situation your parents put you in. Hindsight is 20/20. Give it a chance.", "I get you are upset. But she did the best she could and undoubtedly it was also done for you since it had to be done behind your parents back. You could always answer honestly “I do not have contact with her” and she didn’t have to keep looking over her shoulder. Did your parents ask you “where is your sister? Have you spoken with her?” If they did, then yes she kept you both safe. You could deny and not risk divulging. She did you a solid one! It’s hard to see. You must feel abandoned.", "Here's a question. Will you hold on to this a resentment forever? Or will talking to her about it and working through it help your mental state?\n\nI have a lot of issues with my siblings but having the chance to talk about them is helping me move on more than helping me build my relationship with them. If you can benefit from talking to her and it would help you then you should do it.", "OP has the right to feel what she feels. Don’t downplay her own trauma.", "well yeah that's her choice. To be fair, it is really hard for me to have a lot of understanding for her. I was in the same situation as her. I turned 18 and had a younger sister and I did not abandon her. That's why I feel our relationship is just irreversibly broken.", "I am still living with my parents until she is 18 and we can then get out from there together.", "You didn't abandon her because of your own feelings about your older sister. She didn't exactly have an example or idea of what to do like you do, and your age difference with your older sister is drastic compared to your younger. Letting in your sister is definitely your own personal decision and you're not an asshole for having any of these feelings. I do strongly recommend trying though, seeing if the relationship you can build with her (which would obviously be rocky) would be worth it. You can always change your mind if you say yes now, but you may not get the opportunity to if you say no, y'know? \n\nPlus, I don't know if you would've wanted her to contact you frequently all through that time. The period after escaping an abusive situation is an emotional toss up. Things either went right up or they went right down and I can't imagine how stressful that would've been for a 12 and 7 year old.", "But you weren’t in the same situation.\n\nShe was alone with them for 6 years. She was the oldest child with younger siblings with abusive parents for 12 years. \n\nShe is her own person, with her own personality and he own experiences and her own brain. Her needs are not your needs. And while you feel you have the strength to be their for your younger sib, she may have not. \n\nYour parents stole an incredible amount of stuff from you. They stole all of your childhoods, your right to be safe and loved. They stole your relationship with your older sister. \n\nShe did nothing wrong. You can feel sad and upset about her choices, but she had to do what she could to survive. \n\nSo your sister choose to not sacrifice all of her 20’s just to put herself at risk of your parents abuse just to say “hi” to you at lunch. That is ALLOWED. In fact, many therapists would suggest your sister do exactly that for her own mental health. \n\nPlease be mad all you want. But your sister did not abuse you. She reacted to that abuse the best way she could, just as you are doing. And you both reacted differently. But the person to blame here, is your parents. Who chose to put this burden on all of you as children.", "Have your parents asked if you have spoken with her?", "I never said she abused me. As you said she is her own person who reacted in her own way and I am my own person who reacted in another way. Unfortunately, our reactions to this situation is so different that I do not see a way to meet again.", "I wish you luck, And please talk to a therapist before you let your parents steal even more of your life from you.", "NAH, from experience I can tell you, I am in the same position as your sister, I had to leave my dad and stepmothers house due to physical and financial abuse at 21 ( I am now 27).\n I left behind 4 brothers and a sister. My sister and one of my brothers (both now in their 20s) can understand why we did not have contact for those years. As much as it breaks my heart that I live near talk to the younger 3 boys (one is 14, the other 2 are 8 or 9 now), I drive past their school everyday before and after work but I cannot just go see them before they got on a bus. It would put them in a horrible position of lying to their parents, possibly getting found out and hurt or my dad could be there and hurt me himself. I have to hope that when they are older they will understand or even let me explain and apologise to them for how things happened. It us not that I don't want to help them, I just can't without putting them, or myself in danger. \nPlease speak to a professional about your feelings, if you don't, you'll do more damage to yourself than your sister or parents ever could.", "NAH. She did what she needed to do to get out. Now you're doing what you need to do to protect yourself from pain. You are both victims of the household you grew up in, and I'm sorry it is continuing to cause you pain.", "NTA, for all the people defending the big sister, that's totally valid but think about what it was like for Op.\n\nYou think OP had things easier once she left? Or do you think all the abuse thrown at 3 kids was suddenly passed on to the two left? \n\nYou think the middle kid partially shielded by the fact of not being the eldest, didn't feel anything when the only person they could count on suddenly left? And didn't even send a note?\n\nI get that sister really didn't do nothing wrong, bit put yourself in OPs shows and think if that's a person you'd ever entertain in public, let alone forgive and build and familial relationship? \n\nOP whatever your decision is moving forward I honestly can't blame you, cause I know I definitely wouldn't have handled it as maturely as you did.", "Damn. I feel for you and both your siblings. \n\nShe didn’t do anything wrong but I understand your feelings of abandonment. \n\nI hope you get some therapy. Your parents are the only ones at fault here. \n\nNAH", "NAH. When you leave a bad family situation you cannot maintain contact with the littles. Imagine for a moment that you have a nine year old - is an adult you have zero relationship with allowed to be friends… nope.  I have often regretted not being able to maintain relationships with cousins and my niece, but their parents are toxic and it was never worth the abuse. Now that they are young adults, they are bitter - “ you should have tried harder…” they don’t maintain close relationships with their AH parents but as a young adult I was supposed to fight for time…. Often the AH nut doesn’t fall far from the tree. Walk on and find your own peace.", "NAH, but you're being real harsh. Yeah, it's horrible, it sucks, she shouldn't have done that. But what would happen if she got in contact and your parents found out? I would do so much to have a chance to reconnect with my sister after we fell out, and now she's dead, and I regret it", "NTA-One day you’ll realize that your siblings are the only people on the planet who know what you went thru. They know and understand your POV.", "NAH.  Your sister was trying to survive.  At 12, you couldn't know all that she went through.  Give her a chance.  You sound very angry, which is expected.  But you are directing your anger at another victim, not the perpetrators - your parents.", "Maybe she did not contact you because she felt shame/guilt for leaving you behind.  She could barely take care of herself, she did not want to be dragged back to that situation.", "No one can fault her for leaving or you for feeling abandoned. It's a very complex situation, you don't know what was going on in her head.Try talking to her about the situation and get her point of view. If you don't want to, just go no contact and move on.", "NTA neither is your sister, really... just maybe in denial a bit.", "NTA. It's possible that you may change your mind in the future, but I'd say to do as you wish until then. I don't agree with the majority here and believe she should've reached out to you earlier when it was possible for her. She severed her bond to you as a sister and likely would've ignored you forever had you not run into her out of coincidence.", "NAH.   She chose to save herself, and I don’t think anyone faults her for that.   But yeah.   It feels like she could have stayed in touch - even a little - before now.     She cut ties and moved forward with her life which is apparently what she needed to do, and that’s fine.    But sadly you were one of those ties.\n\nSo very sorry that your parents sucked ,  and that you also lost your older sister because of it.   I hope you and your younger sister are on a healthier path forward.", "If the parents are that abusive they could monitor that sort of communication, and block her or change OP’s email to force no contact. Plus could make things worse for OP and her sister for having that communication.\n\nIf the sister continued after that, the parents could legally go after her for harassment or stalking. That’s also a bad situation.", ">She knew where I go to school and the road that I took each day.\n\nLegally, your parents would have been able to nail her for stalking.", "Many schools would call the police if an adult they don't know anything about just turned up at a school, and then your parents would hear about it.\n\nIt sucks, I am sorry but its inappropriate for an adult to do this. I am not trying to invalidate you and how you feel, just giving a reason as to why she probably never came to the school.", "i think she was afraid and fear so strong can make u just about do anything to avoid.", "You are NTA for feeling the way you do; maybe she is and maybe she isn't either.  When you're a kid, you have the family you were born into. Once you're an adult you choose the family you want in your life. If that includes the bio ones, fine. But if not, don't let anyone make you feel bad about that. You do you.", "You are not responsible for your younger sister, and she was not responsible for you.  Your parents were responsible for all of you, and they failed.", ">I turned 18 and had a younger sister and I did not abandon her. That's why I feel our relationship is just irreversibly broken.\n\nAnd I understand why you feel that way, but the fact of the matter is, there is no right or wrong in how either of you chose to deal with the situation. She's not an awful person for abandoning you, and you're not an awful peraon for staying for your sister. \n\nI just want you to think about the things I'm going to say, and I hope you realize that ppl have different ways of internalizing trauma and you can't predict how they're going to react. \n\nLet's say your younger sister comes to realize the sacrifice you've been making for her (assuming she hasn't already). What would you think if she got angry at you for it, and was upset that you put yourself through that for her sake? What if she told you she wished you hadn't done that? Would you be upset? Would you feel sad?\n\nI want you to compare that to what your older sister is feeling now. She had no idea how you would think about her, whether she stayed or left. Either way, she was risking a negative reaction from you. I don't blame her for choosing the option that gave her freedom from your parent's abuse. \n\nI also want you to think about what might have happened, if your sister chose to keep in contact, had your parents found out about it. Do you think your parents would just get mad at her? Or do you think they would have lashed out at you as well? Do you think maybe your sister was trying to protect both herself *and* you by not maintaining contact?\n\nAnd this may be the hardest thing to think about, but aske yourself this: if your parents are not aware that you're staying on behalf of your younger sister but somehow find out, is there a chance their abuse toward the two of you could get worse? Are there any instances where your parents take their anger out on you on your sister instead? You say you're staying so you don't abandon your sister, but are you able to do anything for her in the midst of the abuse?\n\nI think having this mentality of \"my sister abandoned me\" is reasonable, but flawed. Your sister was extremely limited in what she was able to do for you, and frankly, you have no way of knowing if things would have been better had she stayed. You have no way of knowing if she could have protected you or been a source of mental healing for you. You have no idea if she would have crumbled under your parent's abuse and done somethingn awful to herself. \n\nIt kind of sounds like you were expecting her to be this lighthouse in the storm for you, someone to place all your hopes on, but another person just cannot fill that kind of role for you. Your sister simply cannot be your emotional stability or savior.", "Previous poster didn't downplay it.  They rightfully observed it's misdirected.     \n\n\nShe was 18.    OP, you're 21 now.    Believe it or not, ten years from now you're going to look back on this and realize that you're a very young person, and an 18 year old is practically a child.    She was an abuse victim who did what she had to do to save herself.    No, stalking a minor on her way to school was not a realistic thing for her to do, not safely at all.    \n\n\nPlease....give your sister a little grace here.   \n\n\nNAH.", ">Don’t downplay her own trauma.\n\nThe comment above yours doesn't do that", "Reading comprehension is important", "In fairness, isn't the OP now allowed to not have a strong bond with this sister? It isn't fair but it seems that her sister is now part of her family trama because of when she left and what happened after she was gone.", "By telling OP they’re misdirecting their anger seems like they’re downplaying it. OP feels abandoned by their sister and has a right to feel angry at her. Anger is a legit emotion in this case where there are NAH (except the parents) and also a response to trauma.\n\nETA for misspelling.", "I agree. My point still stands.", "NAH - but OP your anger is misdirected here.   Be angry at your parents.\n\nShe had no power to see you if your parents didn’t want her to see you.  Having your uncle smuggle messages back and forth is not a real solution to this.\n\nYou are still so young.  Maybe you’ll feel differently as you gain more life experience.", "NAH\n\nYou should tell your older sister that if she honestly loves you and wants to make up with you, she should help you and your younger sister escape your parents so you can survive like she did. To me that would show if she honestly cares about you or if shes just bs-ing to you.", "NAH", "NAH", "INFO: Are you close with your younger sister?\n\nAlso, I mean this gently, but I think when you are older you will understand your older sister’s side of things a lot more.", "She is your sister. Do what you want. You may wish to reflect more carefully on the situation or you may not.", "NAH.  Imagine running from a household the minute you were legally able to, but most likely not financially or mentally equipped to handle the situation.  She was probably struggling on so many levels.  She may have been afraid that should she try to contact you, she would have to do so through your parents.  During that absence she probably had survivors guilt for leaving you two behind.  She was probably also afraid of what she might find.  She may have gotten to a place where she has learned to live with her decision and not beat herself up over it.  She should not be punished for it if she has.", "NAH. This is all your parents fault. You two are completely justified to feel how you guys feel.", "Nta", "People can change", "YTA. Being mad at your sibling for fleeing an abusive situation and holding a grudge over it is wrong and cruel and no matter how you try to spin it that is what you’re doing. I wish I could hug your sister. I wish her the best when it comes to her long-term healing.", "NTA, but she may have felt like she couldn’t contact you. I went no contact with my mother 30 years ago and it meant going no contact with almost everyone on that side of the family. \n\nShe lied to everyone about why I wouldn’t talk to her, but that was to be expected, there’s no way she’d ever admit to what she did. \n\nBut my biggest regret was not staying in touch with my brother. I cry every time I think about it. I shouldn’t have let her keep me from talking to him.  I deeply regret this.", "NTA at all for feeling the way you do but maybe your sister had to in order to survive.  Mental health makes you do weird things and sometimes you have to cut off entirely to rebuild and save yourself.", "Nta, neither is your sister. I see you’ve mentioned that your uncle helped her. I take it he was an adult at the time. Where he could tell your parents to kick rocks and continue on with helping you sister. He couldn’t protect YOU from your parents had they found out about the secret communication. Yes he could of told them to kick rocks but realistically in the privacy of your home it would be a different story. I think your sister understood that and did what she felt to protect you. Did you want her to put both of you at mercy of your parents? What’s to say if she didn’t get out when she did she would of taken the other option? I get you’re sticking it out for your little sister but what if your older sister didn’t have that mental capacity to do that when she was 18 for you two? \n\nSomething similar happened with two of my siblings one left when she was 15 and the other at 18 I did see or hear from either of them for 8+ years because they were avoiding seeing our “parents” Our parents would make up the worst stories about both of them. I understood; we didn’t see each other again in person until our youngest sibling passed of an overdose. It brought up a lot of this between us and talking it through has been the best thing for us. I’m not super close to either of them but we do stay in touch and check in more often now.", "NTA, but you probably need to re-evaluate your decision. You understand the situation,  but she was wrong and just made a bad decision where you and your sister were concerned. Being older, she regrets it and apologized. You seem to still be hurt and feel abandoned at that time by your sister. Completely understandable,  but children raised that way, don't make good decisions when trying to escape. Life is along time, and it sounds like your sister wants to reconnect with the good parts of her family,  you and your sister. She was young, dumb, traumatized and didn't make the right decision. Being away from the situation,  she probably grew and recognized her mistake in not keeping in contact with you and your sister. Go to family counseling and maybe develop that relationship and forgive her. It will help you as well.", "There's no AH here.\nBut I can't even imagine how difficult your older sister's life must have been.\nYou should try.. for you.", "The issue isn't her leaving, OP says she understands that her sister had to get the hell out of dodge. The issue is her not bothering to contact OP in the 10 years she was gone. Surely, at some point after you'd got yourself established you'd reach out to your sisters who couldn't escape with you. The only excuse for that I could ever see would be getting in contact with OP without going through their parents could be hard, and that would only be the case of their parents religiously checked their phone.", "OP, you aren't the AH, but you could be missing out. You sound hurt and unwilling to give it a try.  People can change.  Hopefully others will be more merciful with you.", "The annoying part is the sister asking \"how did we end up here\" as if the answer isn't kind of evident", "yeah, just a sad and hard position. She did what she had to do, but can't expect to just come back for a relationship now. It was the best for the sister, but OP can't erase how they feel about it. If OP does want to rebuild the relationship, should be on their terms.", "There’s plenty of parents who would beat any information out of their younger kids if the eldest ran away. \n\nShe could have very well not contacted her sisters out of fear that they’d be physically harmed for communicating with her. \n\nThe fact that she waited until OP was 19 and presumably on her own before reaching out was probably to protect her sisters.", "I am imagining that the thought of anything to do with the home she grew up in (even reaching out to contact her sisters) was stress-inducing and therefore she avoided it. I can understand that. The only AH here are the parents.", "Sister left with OP was 12. Bet OP didn’t have a cell phone. How was her sister supposed to reach out to a child without contacting the abusive parents?? \n\nHow could the sister be sure that reaching out wouldn’t put her into a shitty situation?? \n\nOPs feelings are valid. But hopefully she will move past them.", "> She did not want to take any risks.\n\nYou recognize it was a risk, so why are you expecting someone who is fleeing abuse to take risks?", "My suggestion is therapy. She was in an untenable situation, and unfortunately, it hurt you deeply when she left. You are too hurt to see that she didn't have a choice. Your sister also escaped a trauma and has lingering feelings as well. Your feelings are valid, BUT so are hers. I don't think either of you will see the other person's point of view without help. And please bring your little sister too because I'm certain she has her own feelings and trauma from this situation that are separate from both of you. \nNAH except the parents", "You should add it to the post. This is important.\n\nNTA.", "NTA  you have every right to be angry. Especially for she could have contacted you through your uncle. Being abandoned is extremely painful and traumatic, even more so when it comes from someone you thought cared.", "It looks like your sister was scared for her life. We don't know what she had to endure, probably same as you and even worse since she was the oldest... And personal experience says the older ones take the hardest toll\nI dont blame you if you don't want a relationship with her. But you can't blame her for what she did if you dont know the whole picture, how she felt, and why she felt that way. You are resenting her for the terrible fear she felt for your parents..", "OP feels abandoned. She has every right to not talk to someone who, intentionally or not, probably added to her trauma.", "That’s true, OP sister was protecting her mental health by leaving", "She can be angry at both her sister and her parents, it's not mutually exclusive.\n\nObviously their parents are TA here but OP has every right to be angry at her sister. They were both in an incredibly traumatic situation and the sister had every right to leave, and from the sisters perspective she may have had a very good reason not to contact OP during that period.\n\nBut she still left and cut off contact for a decade. Regardless of the reason, OP has every right to feel hurt and angry about that.", "Reckon you're more pissed that she escaped and left you with your parents. You know that she had no other choice, she didn't abandon you, she saved herself. Maybe direct your anger at your actual abusers instead of their victims.", "So, you’re saying, you feel safe enough to continue living with your parents? That’s great. Your sister did not. You may need to accept that more or different things happened to her, or she just reacted differently.", "Regardless the sister made a choice and has no right to be upset, at all, if OP doesn’t want to be near her because of said choice.", "This right here.", "She didn’t say that she felt safe enough to continuing living with her parents.\n\nIt’s that to her, her personal safety comes second to making sure her younger sibling is safe and cared for.", "Are you even sure that she was in the same town? Did you ask what she was doing during that time? Maybe she couldn’t come see you at lunch be cause she was at work, trying to pay for a roof over her head. As a much older sister, I can promise her experience was different from yours. Even in a healthy home, the oldest has more pressure, more responsibility and more expectations on them. If you have even a single memory of her trying to protect you, then you can trust that she did it multiple times. She may wish that she had done things differently now, but at the time she did what she had to do to protect herself. She was in no position to take you both with her. You don’t have to be friends with her, but it may be worth it to see if she will go to a counselling session with you so that you can both try to gain each others perspective.", "That’s not how it works. If OP gets to be upset (which I said was ok) then sister Also gets to be upset.  And the youngest gets to be upset at OP too if she wants later on!", "The no contact thing is something that sometimes has to happen for someone to be able to heal from trauma. You were a minor when she left and probably she would have had to deal with your parents while trying to maintain a relationship with you. This would have led to a lot of re-traumatization. I completely understand why she did it and it probably had a lot more to do with trauma triggers and your parents than it did with you. When you go no contact, you do have to sometimes cut off more people than you want. You're NTA for wanting to not rebuild that with her though.", "NAH.\n\nI am glad she accepted what you said and left. That shows she can treat you with respect. \n\nI am going to state one of the truths of life.\n\nActions have consequences. We hope good actions have good consequences and bad actions bad ones, but that isn't always true. \n\nSometimes you make all the right choices and still have negative consequences. \n\nThis is what has happened for your sister. She did what she had to do for her safety and her well-being. But, she lost you in the process.\n\nI hope for you that one day you can move forward with her, but even if you can't,  you are not the AH.\n\nI hope you get through the next few years safely for you and your younger sister.", "NTA, you both have a right to feel how you feel, but sis was gone ten years, op wasn't in stasis for ten years, she eventually turned 18 and able to make her own decisions, she couldn't have Uncle try and reach out, but op it is your decision, you should at least give her a chance, life is to short and if it doesn't work out at least you tried.", "NAH just like you were a hurting child, so was she, even though in your young mind, she was almost grown up. Please also consider that by age 18, she had suffered many more years of abuse and the trauma was probably significant . I feel for you so much, I know you needed your sister. She may have been so damaged at the time, she COULDNT be who you needed her to be. So sad for all 3 of you. I hope you find a way to connect and forge a relationship. My sisters are my greatest gift.", "She probably did the best that she could under the circumstances.  How would she get around your folks to keep in touch with you and your sister?  I think that you are making a mistake that you will regret.", "NAH minus your parents. But you keep commenting that your sister could’ve done something to see you. I want you to understand how hard your parents probably worked to prevent that from happening. Any contact with you while you were in their home also put her at risk. I really would look into getting therapy so you can learn to articulate this anger and direct it at the proper causes.", "NTA. Your feelings are completely valid. You do not have to justify your feelings or attempt to charge them for the sake of your older sister. Focus on your relationship with your younger sister and stay safe. Good luck to you and your younger sister.", "NAH\n\nYou are absolutely allowed to feel what you feel. You were 12 and left largely alone to face your abusive family. From a practical perspective, it would have been difficult for her to navigate independence and bypassing your parents for contact.  Yes, she should have done something at some point earlier than now, but life is long and lonely without your siblings.", "NAH\n\nShe tried to survive the abuse by leaving.\n\nYou lived what she also had gone through. but you also feel left behind.\n\nShe probably was not equipped financially or emotionally to spend more time with you and your other sibling.\n\nYou all lived through difficult situations. She probably the best she can, but you also owe her nothing. Hope you are both seeing someone to help make peace with the past.", "Nah, but I think you should give her a chance", "NAH.  Your sister did what she had to do to survive.  She may have been to a lot of counseling or had to get herself to a place mentally where she could contact you. She may have suffered from mental health issues and felt unable to reach out.  She may have feared your parents would mistreat you if you knew where she was.  She may have been deeply ashamed and felt guilt for leaving.   You do not know.  You were a child that felt abandoned and have blamed her for leaving you. It sounds like you all suffered alot of trauma.  I hope you can explore this in therapy  maybe with your sister or without.  Good luck OP.", "NTA. I was in your older sister’s position, and I totally understand why my younger sister doesn’t want to have a relationship. I left her to be raised by the same wolves that turned on me, and I can’t be surprised that she stuck with them.", "Im inclined to say NTA. I am very fortunate in that i have and always had a stable and relatively \"normal\" home life/family. Someone who hasnt please answer, how could you leave your siblings in a situation you know is bad. Im not saying that at 18 the sister should have taken her sisters and provide for them, thats not practical. But going full NC seems impossible to me. You know the house is broken, you know what has happened and what probably will continue to happen. I dont think i could leave them and not at least talk to them and if possible visit/meet up with the siblings. Again i have not been in this type of situation so if you have feel free to let me know your thoughts. I am open to be \"wrong\"!", "NTA \n\nMaybe an unpopular opinion too, but you have every right to be angry your sister. Where was she when you turned 18? I don't buy into the \"she had to do what was best for her\" either she did what was easiest on her. Did it not occur to her that she was leaving you and your sister in that messed up situation she was now able to run away from? \n\nI'll admit I'm biased here because I knew a guy in probably a similar situation. His parents were physically and emotionally abusive to him and his 2 brothers. The second he turned 18 he joined the Army and got custody.", "OP I do think that your feelings are valid. For that NTA. However, with abuse comes triggers. \n\nYou seem to be doing well now which I’m glad about. A kid tho who is raised by abusers does have similar traits. I know I can’t stay around my family for a long time without being triggered. \nIt might sound like an excuse but to get better someitmes completely separating yourslef is what’s needed. It’s not to say you don’t have a right to be upset or to not want a relationship. She wasn’t your parent tho. As much  as it sucks I don’t think she’s to blame. \n\nAnother thing cutting contact is really hard as is, there is a lot of guilt that comes along with being the first one to leave the house like that. You’ll constantly want to go back for your siblings eventhough it’s not an option and it takes a big mental toll. \n\nSo again you are well wishin your right to not want to build a relationship.", "NAH except your folks \n\nI understand you not wanting to forgive her for abandoning you. Suddenly, a huge burden was placed on you and your younger sister that the 3 of you used to share. Things were probably especially hard after she left as your parents had newly intensified feelings of anger, regret, and injustice that they already sucked at dealing with. You had to step up and be the big sis and take on her role as well as your own which I'm sure was incredibly painful. As an adult, your sister could have begun to fight for custody of you and your other sister, or worked with authorities to ensure you were safe. She could have texted, emailed, or called. \n\nShe might have been afraid of the repercussions you would face if your parents found out, though. My mom smashed my phone when she found out I was texting my dad and locked me in the bathroom for hours. She might have envisioned something like that happening to you and decided it was selfish to reach out to you. So she went it alone. Your sister ran from a bad situation. It might have taken her quite a while to get her life in order after that and she might have been scared to reach out to you or embarrassed about what her life looked like during that time. I know some people in similar situations who turned to bad crowds for a while when they were trying to figure themselves out and how to navigate life at a young age. She should have reached out to you, but who knows? She might have fallen into a drug/alcohol problem, or repeated the cycle of abuse by having an abusive/manipulative/controlling partner for a while. She also experienced trauma from your parents and may have had a serious trauma response such as forgetting a lot of her childhood and not feeling emotional attachments properly for a while. Things might have gotten out of hand in her life. \n\nI understand needing time, but I think you're misplacing your anger some by cutting her off. She had to survive and did what she felt she had to do. Your relationship will never be the same, but you could end up forging a completely unique relationship as fellow survivors of your childhoods. As long as she never harmed you or abused you, I think there's hope that one day you'll at least be able to smile at one another and feel some kind of friendship and comfort.", "Edit: NAH \n\nAs an older sister who left when I was 16 to escape an abusive household, leaving behind my younger brother who was 15 at the time, I can promise you she feels shitty about it but did what she had to do to get through what was I'm sure an actual hell on earth. \n\nI didn't have contact with my brother for years. He didn't have a phone and I wasn't going to risk going back to the house or anywhere near where my father could be. Do I feel bad? Yes, I feel awful, but I did what had to be done to protect myself because I was no good to anyone if I wound up killing myself, which was the only other outcome if I didn't leave. I could have gone to his school, sure, but that would be weird. It's not like I knew his schedule, his teachers, or if he would tell my father where I was. Would he have gotten in trouble if he let it slip that he saw me?\n\nWe are back in contact now, barely. We have a terrible relationship and he blames me, my father, and the whole world for his situation. At this point I'm 29 and he's 28 and he's let what happened turn him into a miserable, awful person. Who still lives with our father to boot. I'm sure he wishes he was more of a priority to me, but frankly my priority was not dying and then trying to wade through literal decades of trauma. As much as I wished I could, I literally could not hold space for him as I went through my own stuff. \n\nDo what you want with your sister, but I definitely suggest getting therapy if you haven't already. And you need to decide if you are open to any form of relationship with her. It's okay if you're not, but you might always wonder \"what if\". \n\nFigured I'd offer a different perspective.", "I really appreciate this explanation. I feel like this sub tries so hard to function in terms of black-and-white scenarios, but the world - and especially difficult family situations - are far more complex than that. \n\nAYTAH for wanting distance? No, not necessarily (I wouldn’t say *asshole* per se; your feelings are valid and you are certainly allowed to draw boundaries around anyone and everyone in your life). But even with all that time she left you with your awful parents, if my sibling put in the effort she appears to be willing and able to put in, I’d try to meet her in the middle. Take your time and let her build up things slowly, but still give her the chance. She did what she had to do to survive and while I know that must have crushed you in the moment, I’m sure it was difficult for her to leave her sisters; I’m sure she never stopped loving you, as proven by her efforts to connect. It sounds like she’s trying. \n\nRegardless of all of it, I’m sorry OP, that you had to go through this. I hope you can rebuild your family, with only the parts that are loving and welcome, in time.", "But she is 21 now. Her sister had 3 years to go find her and contact her. Even now, she said they found each other accidentally. The fact is, she wouldn’t even be asking her sister for a relationship if they hadn’t been at the same store. That’s just messed up.", "1- yes. I am still living with our parents until she is 18 .", "Eloquently stated.", "I mean my life wasn't any better", "I can relate to both you and your sister. I disappeared for a couple years, and went sort of low contact with my younger brothers. We were always close, and we had periods of high contact where we would play games together for a month or so before I would disappear again. It was tough, I was in college, then I dropped out, moved states, found different jobs, went back to college, etc. After that rough period in my life I resumed \"normal contact\" if you will.\n\nWhen each of my brothers went through the same age I was at that time, they did something similar, sometimes not talking to me for months on end, damn near a year one time. It was normal, they are getting their life together, mending pieces without parental support or any sort of mentor figure in this world is hard.\n\nIf your sister is a good person, perhaps take the above words to heart and give her a chance to be a sibling again. Go to the movies, talk about things, learn from each other. If she had the strength and knowledge, she probably would have done things differently. That is being sorry for your actions in the truest sense, a regret and desire to have acted differently.\n\nBut she was still a teenager reeling from abuse. Maybe you don't remember (or know) just how bad it actually was for her. How many beatings she got, or how emotionally viscous and manipulative things were for her. She was struggling for air, and could think of nothing but escape and survival.\n\nYou are not viewing her as an equal, or a person in need of help.  If you can look past that, you might be able to salvage a sibling from the wreckage of your childhood.", "NTA, but as you get older and possibly get some therapy, you may change your viewpoint on this. Dealing with childhood abuse is complicated. And you’re committing to 5 more years in that household? Any chance you can get out and bring your younger sister with you? Can your uncle help? You both need to get out of there. Curious as to what type of abuse you’re talking about, like how serious?", "[deleted]", "Did you have strict/abusive parents? Their social media was likely being monitored.", "If they didn’t have a phone I doubt they would have unrestricted access to a social media", "This has nothing to do with feeling safe. There just no chance I will leave my sister in that house alone", "I was in a similar situation. You are absolutely not the AH. \n\nI don’t think your sister is an AH either. She did what she needed to do and the consequences are you feeling estranged and not wanting to build that relationship. She should do what she must to make peace with that. You both are entitled to your own happiness. \n\n\nThe only thing I’d suggest, is maybe work through any anger/resentment you may feel. (Not meaning you have to forgive her/talk to her) I just hope that this meeting with her doesn’t effect your healing.\nNeither of you are in the wrong for choosing yourself and what you need/needed in those circumstances. It’s such a hard and complex situation. \n\n\nI hope you both are able to heal, and that you both continue to have a life filled with relationships you are happy with.", "I still side that you are NTA, i would say keep the option there. Maybe dont fully cut her off, but you dont need to rebuild your realtionship right now if you are not ready and still angry. If she truly loves and respects you and wants a relationship she should be willing to wait. Work on yourself first. Who knows, maybe by this time next year you may want a relationship again. Or not. Only you know how you feel. I agree with others saying that it would suck if one day you regret not having her in your life.", "People learn vicariously from others. You had to live with the fact that a person you loved disappeared for years. You took that pain and used it to make sure your little sister did not experience that. Your older sister did not have that experience to shape her. \n\nUltimately you have the right to take any approach you want without judgement. Perhaps in time you will feel differently perhaps not. But you did come to the internet to ask so folks are going to give and opinion and judgement. I wish the best for you. If you change your mind at some point I’m sure your sister will understand.", "Where did they say the anger was wrong? That OP shouldn't be angry? I don't see that anywhere. Just that it's at the WRONG PERSON. Observing that a person is taking anger on someone else who doesn't deserve it isn't saying that anger isn't valid", "I would urge you to speak to a therapist about your need to prioritize someone else over yourself. Maybe it’s because you wish someone had done it for you. But, it’s not fair to resent your sister for protecting herself.", "Well I guess sisters gonna have to get over it like OP had to get over being abandoned.", "I am your older sister not literally because I only have one sister (so you can’t be my sister) but my heart sank when I read your post. You’re not TA and your feelings are valid. But, let me give you my perspective so maybe you can give your big sister a chance to build your relationship. \n\nI was 8 years older than my sister. I was kicked out at 16 left for 6 months our mom kicked her ex out so I came home until 18, but bounced after that. I came home pregnant a while later. Was there until mom stole 7k (my entire life savings) from me. I bounced again and never looked back. When I lived at home I was the scapegoat and my sister was the golden child. I was beaten and slaved and she was so young. I always sent money home for her basketball program or shoes etc. I thought she knew it was me doing all that for her and not mom. She never knew though. I wasn’t allowed to talk to her when I would call because I wasn’t a good influence aka I wasn’t controllable anymore. For the better part of her teen’s up until just recently she was under such a tight control of my mom I was honestly afraid of her. I didn’t know what she was capable of or what she would tell mom. She has started counseling and has set boundaries with my mom now though so I am trying to be there because now I know she is not a mini mom. \n\nI hope you give your sister a chance. I know she thought about you constantly and I know she carried her own guilt for feeling helpless and like she left you behind.", "YTA. What was she supposed to do, fly in like superman and rescue you? She had to protect herself, and she knew that if she reached out to you while you were living with them, she'd put you both in danger. Grow up.", "NAH she had just as much trauma to heal from as you do and may have seen it at endangering you to try to continue a relationship with you when she was unwilling to do so with y'all's parents", "OP- listen. I’m the oldest sister in a very similar situation. There was violence in our household. Bad stuff happened. I was 25. My sisters were 13 and 11. I had to leave. I never saw them again  and in the ensuing years my parents poisoned both of them against me. By the time I could make contact with them as adults it was already too late. They don’t want to have anything to do with me. I was just the one who got away, and I would have cut my heart out for either of them. I’m not sure what your sister’s reasons were, but if you ever do anything for an internet stranger you owe nothing to- give your sister one chance.", "I dont think either of u is ta but just a reminder that ur sister had to leave for her too\n\nmy situation is somewhat similar and i miss my siblings like hell but sometimes u cant go back and have to cross paths with ur siblings again when u move forward\n\nparents like ours will  continue to hurt us for anything so u need to avoid that... even if it means not being able to see the ones u love but cant come along yet\n\ni hope u can maybe understand her perspective later down the road and maybe forgive her more(?) u dont have to rebuild if u dont want to tho", "ESH, it's unfair to lay your unhappiness at her feet, she was escaping and that's not at all the same as 'walking away'.", "NTA. However, you WBTA if you fail to redirect your anger toward your parents who abused you (and continue to do so?). Your sister did nothing wrong by getting far away from your abusive parents. I grew up as the oldest child in an abusive home and my younger siblings were sometimes weaponized against me. They were rarely a source of emotional support for me and I couldn’t really protect them from being abused as well. It sucked.\n\nIt seems like you are still viewing your older sister from the perspective of a disappointed 12 year old. Your sis probably could not help you in your home, couldn’t take you away, and couldn’t help you heal from your parents abuse. At 12 there was nothing you could do to help her either.\n\nDo what you need to do to feel whole, just remember your parents are to blame for all of this, and your younger sister might choose to rekindle a relationship with your older sis. You May be back in this same boat if you don’t deal with your feelings in a healthy way.", "The younger sister is still in the home?", "EAH....  \nI wsa in a similar situation as your sister...the oldest of four boys, an unhealthy home environment, I was essentially homeless for about six months before I left for the military, came home maybe 3 or 4 times in 22 years. Now parents are very old, they never saw my kids grow up....I honestly think it was the right thing for my family...I believe my mother lived with untreated and undiagnosed mental illness that caused lots of problems for our family but I know a couple of my siblings don't see it as \"Zeb escaped\" they see it as \"Zeb abandoned us\".  \nIt is what it is...I've repaired the relationship with one brother....and even have a little contact with my parents, but it's not healthy...All I can suggest is put yourself in her shoes a bit, ask yourself if  you would have gotten out or would you have really stayed if you didn't have to...18 is really young, I'm not saying she has NO accountability in the situation, but is it really 100%?", "NAH - you dont owe anyone a relationship. Ultimately what she did was a gamble irt anyone she cut off that she might wanna relationship with again. A gamble she lost when it came to you. \n\nShe clearly had her reasons. But you also have your reasons for refusing.", "NTA. I would say that it's N A H had she not asked \n\n> how did we end up like this\n\nYou were a kid, she was 18. Maybe your parents could have blocked her from contacting you somehow but had she tried anyway? When you turned 18, did she think to try then? If the situation was so bad she had to leave when she turned 18, I'm wondering where her concern for her kid sisters was, leaving them in that bad situation she had to so badly escape from.\n\nIf you two did not *by chance* meet in public, would she even think about trying to reach out and rebuild a relationship?", "NAH except the parents, maybe you could tell her you also need time to think about it. She took 10 years, you could use a couple too who knows", "OP and little sister are still in the parent's home", "But the reality is that if the sister contacted her before 18, she likely would have had to deal with her abusive/toxic parents again. Looks like the sister reconnected once OP was 19, which seems reasonable to me if there parents were as awful as OP suggests.", "> \"she did not want to take any risks\"\n\nThat's a perfectly logical and fair explaination, I'm surprised you don't see it. You have every right to not want a relationship but she had no way of *truly* knowing how your parents would be. Sure she had some information from her uncle, but she knew her uncle's perspective isn't gonna be the same as yours. It's possible, when children leave abusive households, that the parents are going to be angrier and even more abusive towards the remaining children. Its possible that one day within those ten years, you leave your phone out or you get caught seeing her and it's game over for you", "Sis #2 is 21, but sis #3 is 17. Sis #1 may not be completely out of the clear until all the siblings are away from the household. If #2 is still involved with the parents elder sis is right to keep her distance! Especially because #2is angry with her and might use the parents or the younger sis to cause her more pain.", "She was right to avoid risking your safety for a chat. You may have been willing to risk it at the time, but then your aita might read, “aita for being angry at my sis for the beatings I incurred when she ran away and went behind my parents back to contact me?”", "She chose to get herself out of danger ASAP, did you expect her to stay until all three of you were old enough to leave together? \nWhile I’m gonna vote NAH for the overall situation, I’d highly recommend looking into therapy for just your trauma, your need to set aside your own safety, and your anger towards your older sister. \nEscaping from an abusive household means avoiding everyone in the house. You or your sister could’ve accidentally let slip that you were meeting with your sister and that could’ve caused tons of trouble for all three of you. \nI promise your sister was feeling guilt and hurt every day knowing you were trapped there, but you can ask anyone with chronic pain, over time the pain just becomes part of your life and you lose focus on it. \n\nI’m not saying immediately forgive your sister, but don’t completely discard the notion of a future relationship once all three of you are safe", "Agree", "It's not really that drastic: older sis is 6 years older and younger sis is 5 years younger. That age difference is actually pretty similar.", "It's okay if you feel that way now. 21 is not that old though. Leave some space in your heart to reconnect, because your feelings may and probably will change. Her life is probably just starting to get stable-ish now. I would encourage you to seek therapy (if you are in school most colleges offer this for free or part of the student health plan) and get some professional insight. Good luck. <3", "Have you given any thought to the fact that your sister may have suffered more abuse or been unable to live thru the abuse as you did. How you reacted to what was done may be completely different from how your sister handled things.", "I realized after the 50 upvotes and was very too lazy to edit, thank you lolol, someone needed to call me out, I think I can sleep now"]}