{"id": 4521, "submission_id": "zjj90j", "title": "AITA for having nudes on my phone?", "selftext": "Throwaway because my family follows me on my other account.\n\nAnyway, I (F20) attended an annual Christmas party a few days ago that our group of family friends put on every year. We've been doing this since I was about 7. So at this party there were a bunch of little kids running around. Well long story short one of the kids (F8) took my phone out of my hand while I was on it. \n\nI tried to grab my phone back, but she was fast and ran away from me. Well she ended up going onto my Snapchat and seeing some pictures that I had taken for my boyfriend (it wasn't my genitals BTW. It was just my boobs, ass, and some pics of me in lingerie). She dropped my phone and ran to her mother and told her what she saw. \n\nHer mother came up to me and told me that she was very mad that I had thoes pictures in the first place and was even more mad that her daughter was able to see them so easily. I tried to explain what happened but she wouldn't listen to me and called me a creep. \n\nI ended up leaving the party in tears because I've known these people since I was born and I felt bad. I've gotten a few mixed messages from other family friends and I just wanted to know AITA?", "created_utc": 1670810941, "permalink": "/r/AmItheAsshole/comments/zjj90j/aita_for_having_nudes_on_my_phone/", "score": 252, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I'm the asshole because maybe I should've \"hid\" my photos a bit better.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\n> her daughter was able to see them so easily\n\n#Because SHE STOLE the phone!", "NTA her kid stole the phone, she needs to teach her kids manners and social responsibility not be worrying about the private stuff you have on your phone.", "NTA. Mother should have been controlling her kid.", "NTA,\n\nYou need to stand up for yourself. \n\nShe is a bad parent.  In 8 years, she still has not teach her daughter not to take things that do not belong to her.  Nor teach her not to snoop.\n\nI guarantee you she has nudes or things on her phone that she would not want anyone else to see.   You need to call her out.", "NTA. I am so sorry that happened to you op that sounds so humiliating. It is not your fault at all and the mother should have disciplined HER kid for stealing. In the further though I do encourage you to use the my eyes only feature in case it were to get stolen again.", "NTA\n\nMommy needs to teach her daughter that stealing is wrong.", "NTA\n\nTell them to get a leash for their brat. They're old enough to know to keep their hands to themselves. It's the first damn thing taught in school.", "NTA. It’s your phone, your body, your business. If my kid takes something and sees or does something they aren’t suppose to, that’s fully my fault as the parent.", "Wtf is wrong with people!? You are in no way a creep, it’s your phone, it’s your body, you have every right to store whatever photo of yourself you want in your phone. She’s the one who grabbed and accessed your phone without your permission!!!", "NTA\n\nShe purposefully went on your phone and the opened SNAPCHAT.\n\nFricking weirdo, that kid", "NTA, lil girl and her mother are the assholes", "Uh, it's not like you showed her the pictures, SHE stole your phone and invaded your privacy! NTA.", "NTA.  The user interface on phones these days is very intuitive.  I show my son pictures I take of him on my phone, and before he was two, he figured out how to go to the next picture.  He barely touches my phone, it's that intuitive.  So an 8 year old getting into Snapchat shouldn't surprise anyone. Your property was taken, and privacy invaded.  The inattentive parent has no one to blame but themselves for the things their child saw.", "NTA tell her to teach her kid not to steal if she doesn't want her exposed to private stuff", "Nope, that mother should be slapped though for raising a kid that thinks it is perfectly fine to take someone's phone and run off with it.", "NTA\n\nThe mother should have scolded her child for going through an adults phone!", "I simply do not understand parents that don’t instill the golden rule of FAFO in their children. \n\nNTA", "NTA it isn't like you gave the kid your phone, and their mother should talk with the kid about taking things that don't belong to them", "NTA. The mom needs to teach her child about stealing and privacy. It's your phone and it's not as if you handed it to the kid showing your nudes.", "NTA-Darlin you have nothing to be ashamed of. Lots of us (myself included) have risky photos in our phones. The maternal unit should have taught her spawn that it’s impolite to take phones that do not belong to them.", "NTA", "NTA. Maybe she should teach her little brat not to be a thief.", "Of course NTA, it's your phone and you're an adult!", "NTA. It’s your  phone. Someone stole it even if temporarily. You’re allowed to have private things on your phone.", "NTA and tell that mother to punish her kid for stealing your phone.", "NTA at all\n\nBut you really gotta make it so its not that easy for people to see. Kind of a rookie mistake there.", "NTA but thats a rookie mistake", "You’re NTA!\n\nBUT - I’ve said this a million times:\n\nOnce something is out there is digital form, there’s is no taking it back.  “Private” means almost nothing.\n\nIf you want to make sure something “private” doesn’t get out, don’t involve anything digital or internet.\n\nEven “delete” doesn’t totally get rid of something.", "NAH - But just a general word of advice from a 30-something woman.  Your phone isn't really private.  Nudes aren't really private.  It's very easy to fall the victim or revenge porn.  It's very easy for your phone to fall into the hands of someone you don't want to have it.  Keep that in mind.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway because my family follows me on my other account.\n\nAnyway, I (F20) attended an annual Christmas party a few days ago that our group of family friends put on every year. We've been doing this since I was about 7. So at this party there were a bunch of little kids running around. Well long story short one of the kids (F8) took my phone out of my hand while I was on it. \n\nI tried to grab my phone back, but she was fast and ran away from me. Well she ended up going onto my Snapchat and seeing some pictures that I had taken for my boyfriend (it wasn't my genitals BTW. It was just my boobs, ass, and some pics of me in lingerie). She dropped my phone and ran to her mother and told her what she saw. \n\nHer mother came up to me and told me that she was very mad that I had thoes pictures in the first place and was even more mad that her daughter was able to see them so easily. I tried to explain what happened but she wouldn't listen to me and called me a creep. \n\nI ended up leaving the party in tears because I've known these people since I was born and I felt bad. I've gotten a few mixed messages from other family friends and I just wanted to know AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA.  Your phone and you’re an adult.  KID stole your phone.  Parent is an idiot that needs to reprimand their child and apologize to you on their behalf.", "NTA. Tell her to get control of her kids and stop them from stealing shit! \n\nSeriously, not even slightly to blame in this situation. People have an expectation to privacy on their phones.", "The mom is mad at you for having private things on YOUR phone that was \"so easily accessible\" as if you pulled up snap on your phone and handed it to her kid. Wtf, she should teach her little monster not to snatch things out of other people's hands, especially things that don't belong to them.\n\nI teach my little monsters not to do that. It's not hard.\n\nNTA", "Mother should have apologized for violating your privacy.", "The audacity has me shook.  Nta", "I have a feeling if Mommy’s phone was grabbed, there would be suggestive searches, photos, something. You have nothing to feel bad about. Her daughter was absolutely wrong going through your stuff. \n\nNTA.", "The only AH here is the kid’s mom. She should have used this opportunity to teach her daughter that it’s not okay to get other’s belongings without approval AND she should have apologized/made her daughter apologize to you. I can imagine how humiliating this situation must have been, but please don’t feel guilty: you did nothing wrong and YOU are the victim.", "Nta. Her child went and stile your phone and then went thru your snap. Mom needs to handle her kid", "NTA\nThe fact that the child saw the nudes was due to theft. Her criminal tendencies should be more concerning than your photos.", "YTA. Your nudes are your responsibility to protect and keep secure. \n\nI’m a male, if my nudes were to end up in the possession of an 8 year old it wouldn’t matter the circumstances that led up to it happening. That’s a serious issue that could have far lasting implications upon my life and that of the child who came into their possession.", "YTA. Nude selfies are so 2010.", "Hmm,\n\nHaven't heard both sides, however assuming you're telling the objective truth, I'd say that you aren't an Asshole. The only thing that could be you being an Asshole was the photos, (To clarify I mean The content within the pictographs).\n\nThe real Asshole is the little Shit! I mean, they not only complain about free ass, but they snitch about their misdeeds and gets back-up? I mean, you did nothing... Literally nothing...\n\nThe kid did something, the mom did something and both were definitely overreacting.", "INFO: I thought the whole point of snapchat is deleting your photos after you send them? How did she see these pictures?", "NTA - but honestly, you've gotta know better. DEFINITELY DON'T KEEP NUDES in anything except password protected apps/files.", "You are probably NTA, but the only way I'll be able to tell for sure is if you send me those pics so that I can judge by seeing what the child saw.  Then I'll get back to you with a more definitive answer./s😆", "And mother should have given back the phone without a comment.  Mother is extremely rude and creepy!", "I usually use the secure folder feature on my phone, but this time I simply forgot to. I dont open Snapchat very often so I didn't even think anyone would come close to seeing.", "I'm going to add my NTA to your post, since you didn't vote one way or the other. ;)", "Yeah she's a really wild kid😅😅 I've known her since she was born and she's always had a problem with listening.", "The sad thing is that she absolutely knows it's not okay. she's a very intelligent little girl, she just doesn't listen😞😞", "yes I know it is😞 I usually keep my private photos in a secure folder, but this time I did not smh.", "Brat could just as easily got into her purse and stolen printed photos. This isn't an issue of something being spread across the internet. It's an issue of entitled parent.", "So taking a photo of yourself on my phone isn’t private even if it’s just in your gallery and not uploaded to cloud isn’t private?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "The kid stole the phone??? Not her fault that the kid has zero boundaries and no sense of respect to others property. lmao", "Lmao no they're not💀", "They weren't in any messages, which is where they would delete after that 24 hours. They were in the camera roll section of the app. I normally don't take photos on Snapchat, but I wanted to use a filter they had. I saved the photos to my picture folder of the app.", "Yes yes I do know better. I usually automatically transfer them to the secure folder, but this time I forgot because I took the pictures on Snapchat", "you're not funny.", "Oh yeah, my bad, was too annoyed to remember to vote I guess. Defo NTA.", "Probably because her parents had an issue raising a child 😊 \n\nNo offense to you or fam, just observing", "Yup but what did mom do on this occasion? She sure didn’t reinforce “You shouldn’t have had your hands on that phone in the first place.”", "Dont beat yourself up, my friends store their nudes in the regular photos app with all their other photos", "Not if you get hacked, lose your phone, have it stolen etc. Even deleted texts and stuff can still be accessed by someone who knows what they're doing.", "There’s no excuse good enough for exposing yourself to an 8 year old. None.", "The joke writes itself but I can't type it in because I will get banned from AITA and I really don't want to be banned.", "I'm sorry, you don't deserve to be humiliated for an oversight. But honestly, its a huge risk of keeping nudes around. Hopefully you'll never have to go through something like this again.", "Yikes! I couldn't be that bold😂", "See this is funny bc she didn’t expose herself to the kid. The kid took her property, went through it, and found her stash. I believe they call it “Fuck around and find out”", "I agree. Luckily that didn't happen.", "Expect 8 year olds do 8 year old things and it’s up to the adults in the room to keep them from getting into adult material. \n\n“No excuse is good enough” - me", "Did we not read the same post? Because an 8yo saw illicit images. That’s exposure.", "The adults like her parents?", "Good thing you don’t make quotes then. 8 is old enough to know basic respect in asking to use one’s property. This kid lacked such knowledge and exposed themselves to whatever was on the phone. Your responses change nothing except continuously show how glaringly wrong you are on this.", "You said \"yourself\". the kid may have gotten exposed to, but not by OP.", "Her parents are obviously upset by what happened and addressed it.", "I also said that we have a responsibility to protect our illicit images.", "They didn’t address their concerns to the right person. That’s their rude thieving daughter.", "They were the adults that allowed this to happen and still haven't adequately adressed it.", "I wasn't agreeing with that part. As far as I'm concerned OP did that", "NTA- Seven is old enough to know not to take things that don't belong to you. Her mom is mad at the wrong person, she should be upset that her kid is taking other people's things without asking. Your not obligated to keep you phone kid friendly on the chance that some rogue kid will come along and take your phone while it's unlocked.", "But at the same time how quickly and easily it became viewable to other unintended parties.\n\nToo many boyfriends out there sharing sharing nudes and holding on to them even after breaking up for viewing pleasure.", "\"Maybe you should teach that bratty little shit she shouldn't be taking people's things.\"\n\nNYA", "NTA, she needs to teach her kid not to steal.", "NTA - Its your phone. You can have what ever you want on there as long as its legal. The kid stole your phone. You did nothing wrong.", "NTA.\n\nShe needs to discipline her kid for stealing the phone AND for looking at your pictures AND for telling what she saw.", "While I don't think it's a good idea to keep nudes in your phone, I do believe your relative was in the wrong for letting her child take the property others.", "To quote Dalton, \"opinions vary\". But since you seem to be incapable of discerning humor, I was not actually asking for the nudes. I understand this is hard for you, but grow up.", "Exactly, repeat after me: \"I am not responsible for the trauma you might possibly endure when you stomp all over my privacy and personal boundaries.  No matter what age you are, you do not get to invade my privacy then claim to be the victim.\"\n\nNTA", "I know you were not actually asking for nudes. Your \"joke\" was unfunny and not appropriate considering the circumstances of my post. Have an amazing night.", "Then I would like to apologize. I had meant to try to lighten a bad situation with a little bit of levity. It obviously didn't work and was unappreciated. Please accept my apology and have an amazing night, and life as well. And no, you are NTA. As a parent, she should teach her children not to act that way and invade other people's privacy.", "I appreciate your apology, and I accept it fully. Thank you for understanding how it made me and explaining what you meant by it 💗", "They should have addressed it with their thief child who thinks it's appropriate to snatch other people's property 🤷", "NTA\n\nWhere was her mother when she stole your phone?! The mother has no right to police your content on your personal device. She needs to keep an eye on her own kid and stop her from stealing people's things", "NTA.", "NTA kids a jerk", "NTA\nWhy did the kid go to snapchat  anyway.", "NTA. She's a crappy mother for not seeing the problem with her daughter stealing your phone. 8 yrs old is old enough to know right from wrong.", "NTA but mom needs to teach her kid to respect peoples privacy. At first I thought this post was gonna be a I have nudes from exe's and I'm in a new relationship type thing. but having some racey photos you took of yourself for your current relationship. psh pretty standard mom and kid are TA", "You got outran by an 8 year old lmao?\n\nAlso, NTA.", "This is so wrong. The little child is learning she can violate someone's privacy and get no punishment/wont be her fault", "Yeah if anything this should be a lesson for the kid to not breach people’s privacy.", "idk where else I'm supposed to keep nudes lol", "her mom posts on Snapchat regularly with the kid, I'm assuming it was familiar app🤷‍♀️", "hey man, she had a head start😭😂", "she fucked around and found out. maybe now she will start listening?", "One option is to upload them onto an online service and delete them from the device. At least that way, people need to snoop a little more. But I think there's also a way to create hidden albums, though I don't know how to do that. You could look it up online.", "Makes sense. I think it's weird but still makes sense.", "Haha fair enough!", "Lot of people do haha. Woman's intrusive and letting her kid roll her over."]}