{"id": 4528, "submission_id": "zjp6ta", "title": "AITA for leaving my friends get together because of her chihuahua?", "selftext": "I know the title may seem funny but I’m getting a lot of crap from my friend for this. This happened last week. If anything is confusing or if you need other info let me know.\n\nI’m 32f and my friend “Dana” (30f) wanted our friend group to go to her house to hang out, have some drinks, chat and just have a good time. We were all down for it. Our friend group is “Amy” 31f (who is part of this) then “Mark” 33m (Amy’s husband) 37m, & 25f. Dana bought a chihuahua about 2 months ago named “Chica”. It’s an adult and she said it had “issues” like separation anxiety and she had to put her on a specific feeding schedule but was over all a good dog. She said NOTHING about any aggressive behavior. I’d like to mention that I love animals big and small. So I was looking forward to meeting Chica. I get to her house a little later and everyone’s there already hanging out so I join in. About 15 minutes after I get there Dana brings the dog out and introduces her like the monkey does with simba in the Lion King, which we all laughed at and thought was funny. AS SOON AS SHE SETS THE DOG DOWN it runs over to Amy and starts biting the sh** out of her leg completely latched onto her, growling. She was the 1st person at the end of the couch. We all jumped up like oh fu**! Amy is screaming and crying trying to push Chica off her and Mark gets up and tries to pull the dog off her. Meanwhile the whole time this is happening Dana is SCREAMING “DON’T HURT MY BABY WHAT ARE YOU DOING LEAVE HER ALONE” after mark got the dog off her he’s holding her in the air saying “take it!” So Dana grabs her and runs back in her room and slams the door. We all tried to calm Amy down but she wasn’t having it, which I completely understand. She was wearing jeans but she had blood run down her leg when she pulled her pant leg up. So they left and the rest of us are sitting there like holy crap wth just happened. Dana comes out of her bedroom and nonchalantly asks where Amy and Mark went. We told her they left (we were in awe with how casual she was acting) then she said well I calmed Chica down and i’m letting her back out. I said “yep i’m out of here.” She started screaming at me saying if I left then say goodbye to our friendship and a bunch of other sh**. I told her “I’M WEARING SHORTS if your dog bites me I might drop kick it into the oblivion and I’m not about that life.” (I had a couple drinks by then lol) wasn’t trying to be funny when I said that but our friends started laughing and Dana got even more mad and said get TF out! So I did. \nI haven’t stopped getting messages from her telling me I ruined the rest of the party because our other friends left directly after me. I don’t know. She has said in the text messages that her dog has bitten someone else before but “it wasn’t a big deal” completely unprovoked. Also, sorry this is so long!", "created_utc": 1670824676, "permalink": "/r/AmItheAsshole/comments/zjp6ta/aita_for_leaving_my_friends_get_together_because/", "score": 164, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I basically yelled at my friend that I was leaving because her dog bit our friend and I wasn’t going to be next. She said I ruined her party because everyone left after I did.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. And I hope Amy is making sure Dana covers any medical expenses.", "NTA: her dog is feral. Honestly I hate chihuahuas in general so I'm slightly biased against the dog and it's owner here, but according to op, the FIRST THING this dog did after being released was ATTACK someone. If this was a bigger dog animal control would have been called. But people think this behavior is acceptable in small dogs when it isn't. If I went to someone's house and found out they have an aggressive animal that they fully intend to let loose on guests, I'd leave too. NTA.", "NTA - Dana should have had the dog on a short lead when guests are over until she know how the dog will react. The fact that there’s a prior bite makes Dana liable.", "To state the supremely obvious if this is the full story then no you’re NTA.  The fuzzball bit someone the second someone took their hands off of it and this is apparently not the first time.  In most cases legally that means the little beast would be put down.  The party being over is the barest of minimums and for your friend to resent that is the height of stupidity.  Drop her and mock her relentlessly.", "Chihuahuas are little bastards (yes I know there are the occasional non-bastardy ones so shout out to the Not All Chihuahuas crowd), they are near the top of the most aggressive dog breeds lists year after year. People think it's not a big deal because they're little. Those people are wrong. You are NTA and your friend needs a reality check. Her vicious little cutie pie is gonna get taken away and put down to check it for rabies if it keeps biting--much as I dislike 99% of all Chihuahuas I've ever met, I hate to see animals get killed for behaviors that can be trained out of them with time and effort and persistence. Your friend needs to take the little bastard to training and work like hell to make it stop biting, and in the meantime, of freaking COURSE no one wants to be around it!", "NTA you didn't cause everyone to leave mini cujo caused everyone to leave, I hope the dog's owner has to pay your friends medical bills, and I hope the dog is up on its shots because going through a rabies series sucks.", "NTA. And not the dog's fault. It is obviously a rescue and may have been mistreated or at least not trained. The fact that your friend knew it had bitung tendencies opens her up to liability. She ruined her own party by having her dog chase everyone away", "NTA. Fear biters are often the worst ones. Poor dog needs help but your friend is endangering her friends and the dog with this irresponsible behavior.", "NTA, party was pretty much over after Amy got bit anyway. It would have been super awkward even if the dog didn't come back out.", "Amy had to go to the hospital to get stitches. I tried to add this in my post but I don’t know how.", "Nta. I would never go to her house again and would seriously reevaluate this friendship.", "NTA\n\nLike, there are a million reasons a dog can turn aggressive that may not necessarily be the owner's fault, but I really freaking hate when owners downplay the behavior of aggressive dogs just because the dog is tiny.  She's only had this dog a short while, and she may not have predicted that the dog would act this way in front of strangers, but it was the owner's responsibility to remove the dog from the situation the moment she realized the dog was not handling it well.  It was extremely AH of her to try and re-integrate the dog with the guests after such an incident.\n\nYour friend is probably really surprised that this happened, doesn't know how to psychologically process that her dog has serious problems, and is taking it out on you.  It is not your fault that other people decided to leave after you did, and Dana ruined her own party by putting her guests' safety at risk.", "It didn’t give me an option to put in why I might be the AH. So I’ll put it in here\nI might be the AH because I messed up the rest of her party by leaving and causing everyone else to leave because I wasn’t understanding to her dog’s needs.", "NTA. I'm a dog owner.\nYou were very right to separate yourself from an aggressive dog and an irresponsible dog owner. Dana is doing Chica a disservice. Chica should be trained to be calm around strangers and she should be properly socialised with humans. Dana should have showed Chica her behaviour wasn't ok, and that she's safe with her friend group.\n\nYou, very rightly, didn't want to get attacked by a vicious chihuahua and instead of making the situation worse for the dog and yourself by staying and being nervous around her, you left.\nYou did right by both yourself and Chica.\n\nDana shouldn't have such a nervous dog, since she obviously can't handle her.\n\nEditted typo", "I'm going to preface this by saying I have this same chihuahua. I usually don't have friends over because he tries to bite everyone he doesn't know and he's very unpredictable. I had a gathering of friends recently and I gave him a bit of Trazodone and even with that he was still very perky I did let him out and he managed to control himself but at the same time I have no expectations of other people to put up with that. I always explain to people coming over that he is not friendly and that he tries to bite and I either keep him away from the group or I manage his behavior as best I can. He has certain movements that he reacts to so I usually grab him if someone is about to stand up or walk out the door. As long as everyone is sitting he is usually fine. I think it is ridiculous that your friend would expect other people to tolerate being bitten by her dog and not even apologize to her friend who was injured. That is not a friend in my opinion. Anyway you are nta, I don't think that you ruined the party, I think everybody left because the dog owner doesn't know how to behave.", "NTA at all. The only AH here is Dana because she’s seriously neglecting her dog’s obvious behavioral problems/needs. I have a dog who I absolutely adore to pieces. But she is very resource guardy, including with me. It’s not bad with other adults, but she gets super bothered when I give any attention to or play with young kids like my niece or nephews. It’s on me to a) know my dog well enough to notice that she’s stressed out by a situation and b) to intervene and either correct, redirect, or remove her from it if it’s too much BEFORE anyone can get hurt. Your friend sounds like an irresponsible and neglectful owner who just wants to perks of dog ownership without any of the responsibility, and I hope Amy (and the rest of the friends) hold her accountable for her behavior.", "NTA \n\nBut what? She was getting her attack dog out again when everyone was drinking? \n\nGood idea to leave!", "NTA obviously, you did the right thing. Chihuahuas are grumpy little beasts, but given their small size, many people underestimate them. But I guess your friends won't do that anymore. The real problem is Dana, who is so enthralled by her new baby that she didn't even realize what happened in her living room. You do well to stay away until she takes a bath of reality, maybe the hospital bill will open her eyes, I hope it arrives and that the couple doesn't mind delivering it, it's only right that she pays for it. I hope Amy recovers soon and without scars.", "I’ve never seen a chihuahua bite produce blood, much less through jeans. Are you sure that dog is a chihuahua? Did someone file down its teeth?", "NTA. I’m probably biased as I detest chihuahuas, every one I’ve ever met has been an absolute yapping nightmare demon with anyone but it’s ONE person, but I’d be pressing charges if the thing had bitten me. Amy is being far too nice, and you leaving the house was just sensible.", "NTA-I personally am deathly afraid of chihuahuas (feel free to laugh lol) after being almost bitten by two different Chihuahuas belonging to two different people out of nowhere.\n\nTheir owners seem completely oblivious to the little furry devils, but those adorable mini-Terminators can be relentless if they don't like you lol.\n\nI'd definitely check on your friend Amy to see if she's OK and to encourage her to seek medical care and to see if she needs rabies' shots or stitches. Dana sounds very irresponsible with her behavior, and the immediate issue at hand is making sure that your friend will hopefully recover before trying to ascertain what is going on with Dana if you feel obligated to (like if she's oblivious, having mental health issues, etc.)", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI know the title may seem funny but I’m getting a lot of crap from my friend for this. This happened last week. If anything is confusing or if you need other info let me know.\n\nI’m 32f and my friend “Dana” (30f) wanted our friend group to go to her house to hang out, have some drinks, chat and just have a good time. We were all down for it. Our friend group is “Amy” 31f (who is part of this) then “Mark” 33m (Amy’s husband) 37m, & 25f. Dana bought a chihuahua about 2 months ago named “Chica”. It’s an adult and she said it had “issues” like separation anxiety and she had to put her on a specific feeding schedule but was over all a good dog. She said NOTHING about any aggressive behavior. I’d like to mention that I love animals big and small. So I was looking forward to meeting Chica. I get to her house a little later and everyone’s there already hanging out so I join in. About 15 minutes after I get there Dana brings the dog out and introduces her like the monkey does with simba in the Lion King, which we all laughed at and thought was funny. AS SOON AS SHE SETS THE DOG DOWN it runs over to Amy and starts biting the sh** out of her leg completely latched onto her, growling. She was the 1st person at the end of the couch. We all jumped up like oh fu**! Amy is screaming and crying trying to push Chica off her and Mark gets up and tries to pull the dog off her. Meanwhile the whole time this is happening Dana is SCREAMING “DON’T HURT MY BABY WHAT ARE YOU DOING LEAVE HER ALONE” after mark got the dog off her he’s holding her in the air saying “take it!” So Dana grabs her and runs back in her room and slams the door. We all tried to calm Amy down but she wasn’t having it, which I completely understand. She was wearing jeans but she had blood run down her leg when she pulled her pant leg up. So they left and the rest of us are sitting there like holy crap wth just happened. Dana comes out of her bedroom and nonchalantly asks where Amy and Mark went. We told her they left (we were in awe with how casual she was acting) then she said well I calmed Chica down and i’m letting her back out. I said “yep i’m out of here.” She started screaming at me saying if I left then say goodbye to our friendship and a bunch of other sh**. I told her “I’M WEARING SHORTS if your dog bites me I might drop kick it into the oblivion and I’m not about that life.” (I had a couple drinks by then lol) wasn’t trying to be funny when I said that but our friends started laughing and Dana got even more mad and said get TF out! So I did. \nI haven’t stopped getting messages from her telling me I ruined the rest of the party because our other friends left directly after me. I don’t know. She has said in the text messages that her dog has bitten someone else before but “it wasn’t a big deal” completely unprovoked. Also, sorry this is so long!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - I feel sorry for the dog. It seems like one of these situation were a small dog has to be a stand- in for a child and cant handle it. Poor thing. I hope Amy is alright.", "NTA. Honestly Dana is lucky Mark didn't just yeet the dog out the nearest door (or window). I've had a chihuahua bite me and it hurt! And that was an old dog with practically no teeth. It sounds like Chica has plenty of teeth and Dana needs a reality check.", "Ahora, yo quiero Taco Bell.", "NTA. If I was Amy I'd be reporting the dog and bites to the police and the relevant animal authorities. Fuck that noise.\n\nEdit - small, badly trained Covid lockdown dogs are basically the sole reason I wear steel toed boots wherever I go now", "NTA as someone who used to own a large aggressive dog, I have never understood the nonchalance of some small dog owners.\nI never took my dog off the property without a muzzle.\nWhy would she bring her dog out during a party knowing he bites??", "NTA the dog needs to be reported...wtf is it with some dog owners...the dog needs to be put down.", "That’s what I told Dana in our text messages because Amy had to go to the hospital to get stitches. I couldn’t get everything in the post.", "I love chihuahuas and have one and he’s my freaking life, but I’ve also been attacked bad enough to go directly to urgent care by a random chihuahua on the street. Like, this dog tore my flesh up. Children were screaming. And I could have hurt it to make it stop, but I didn’t want to, and if I’d had to, I’d be traumatized now. So fuck irresponsible chihuahua owners who let their violent dogs run wild.", "It’s the full story but of course there are little details I couldn’t fit in there. I don’t know anything about the dog besides what I put in the post. I feel bad for the dog more than I do for leaving the party", "I was really blessed that the only chihuahuas that I knew were a breeder friend’s. They all got outside to run around like little maniacs and lived in the house, not in cages. They people who bought them loved them and if they ran into a situation where they couldn’t keep a dog she’d take it back. \n\nI never knew any of her dogs to be aggressive or mean. They were good visitors when they’d come to visit as well. \n\nThat said I understand that’s the exception not the rule. \n\nSmall dogs are treacherous. \n\nOne of my uncles had his eye bitten out by a Pom when he was a baby. His parents were visiting friends in Seattle and there happened to be a pediatric eye surgeon in town visiting the medical school. \n\nHis eye was repaired beautifully, apparently. I never even noticed a scar. \n\nBut out of all of the aunts and uncles and cousins absolutely zero ever had a small dog. We were a big dog family and that story was told whenever dog bites were a topic.", "They are not little bastards. They are a breed suffering massively for being small and not take serious enough to be treated like they deserve it. Like dogs. Not like child stand- ins or toys.   \nThese dogs get aggressive because their boundaries are overstepped constantly.", "Amy had to get stitches. I don’t know if she’s going to have Dana pay for it yet", "I don’t think it’s the dogs fault either. She’s an older dog and could have been through a lot of crap. I don’t think my friend is taking that into consideration. She just wants to have a super friendly dog right off the bat.", "I agree with you 100%!", "There should be three tiny dots on the upper right above the post. Click on that and you should get an option to edit. \n\nBy the way. NTA. I wish you would’ve gotten an opportunity to follow through on your threat lol", "I am never going there again. She also told me to never come back unless I apologize. She also wants Amy to apologize. Everyone knows that’s definitely not happening. So she’s going to lose 3 friendships because of this. Me, Amy & mark", "Thank you for this. I was really starting to feel bad because if the dog. She’s tiny but the way she was biting and holding on to my friends leg was freaking terrifying", "It’s not the first person the dog has done it to though.", "Dana and her little monster caused people to leave, not you.", "I’m right there with you. She won’t listen to any of us, even after this happened. She’s saying she’s going to cut me and Amy and Mark off because of it.", "Chica needs to be put down. Not the first bite and won't be the last.", "god owner? Lol\n\n&#x200B;\n\nIn all seriousness, poor pupper.", "Thank you for that. I had an aggressive dog (medium size) about 10 years ago and I made sure I took him to training and helped him learn how to be around people without being so anxious. It was a lot of work but worth it.", "Yes I feel the same. It’s sad for the dog. And Amy is like traumatized. And she loves animals!", "Dana is also at risk of her home insurance premiums going WAYYYY up if Amy chooses to file a claim to pay the medical bills (which she SHOULD!).", "Yep, chihuahuas and dashhounds are apparently the most aggressive breeds without the right training. They are small but that dog was out of control and Dana’s behaviour was chilling \n\nNTA", "Exactly. Little =/= harmless.", "I hope Dana has some good renters or homeowners insurance.", "She better", "I got 4 stitches in my thumb and it cost $4800.", "It sounds like she is very much the wrong owner for this dog, who sounds like she's been through a lot and needs an owner with lots of patience and perseverance to help work her past her traumas and learn to behave and trust humans again. I really think the best thing she could do for this dog is give it back. She can't handle the dog properly and she's going to get that dog killed.", "I do a lot of volunteer work with domestic and wildlife rescues in my area. Irresponsible ownership absolutely hurts animals way more than it should. Socialization must be done correctly with traumatized animals. Training is especially important in small fearful dogs.", "Noo lmao I wouldn’t ever want to. But I don’t know how I would react in that situation though lol", "Wtf does she want Amy to apologize for??? Did she get blood on the carpet or something? JFC the gall of this woman.\n\nNC from all of you. She's as deranged as the damn dog\n\nNTA", "I’ve talked to Amy and she’s not going forward with anything. She just wants an apology but also for Dana to take the dog to “doggy therapy” that’s what Amy calls it. Dana said already she wants me, Amy & Mark to give HER an apology. So I think the friendship is done. Which is a shame", "She said before the hangout that she didn’t know exactly what her dog went through before she adopted her. Just that she had issues. So I don’t know if she was keeping the full truth from us", "If I ever see that fucking dog…Google “Ray Guy.”", "Now that Dana's decided to torch the friendship over this, there's no reason for Amy not to get those bills taken care of.", "Separation anxiety often comes hand in hand with previously abusive or neglectful environments. I'm suspicious that a reputable rescue would hide issues since their priority is usually to find the most suitable environment for the animals needs.", "I think she was hiding what she knows about the dogs past now after everything happened. Because the way it just ran up to the 1st person it seen and started attacking", "Yeah. I'm really afraid for this dog. If could end up labeled aggressive enough for authorities to step in. If your friend needed stitches the hospital likely asked about rabies vaccination status. This dog is very likely about to hit the radar...😭\n\nI hope the original rescue intervenes before it's too late to help the pup.", "Amy didn’t say anything specific in the hospital. But I’ve said in another comment that Amy just wants an apology and for the dog to go into doggy therapy. Dana doesn’t give af and wants an apology from me, Amy & mark. So the friendship with Dana is pretty much over.", "I'm going to pm you real quick. I have some recommendations. 💙💙💙", "NTA, any animal can be vicious if it's been mistreated, but it sure seems like chihuahuas are piranha dogs. I have cats, and their first instinct on meeting new people is to quickly run under Mom's bed!", "Please make sure Amy got her tetanus shot.\n\nAlso NTA. Your life is better without Dana", "NTA. If that dog were bigger this would be an even more significant problem than it already is. That sort of aggression is not okay. They terminate dogs for that, for good reason. \n\nImagine even that little dog does that to someone old or with compromised immunity.", "Who in their right mind thinks it’s okay to let out their *obviously aggressive* pet around strangers is a good idea? Especially if Amy had to get *stitches* from the attack. I hope she’s okay now!\n\nNTA whatsoever. People forget how dangerous a dog attack, let alone a bite, can be on someone. They’re still animals that can attack and really hurt someone, and need to be restrained when that’s the case.\n\nFrom the comments I’ve seen, doesn’t look like Dana is going to admit wrong here. It’s unfortunate but it’s probably for the best this friendship isn’t working if Dana cares about her dog over her friends’ safety.", "NTA but I feel terrible for the dog. She introduced an anxious small dog to a crowd by dangling it in the air?", "You are better without that piece of work \"friend\". NTA.. Move on.", "NTA\n\nHonestly the dog needs to be put down immediately.\n\nRepeat biting to the point of drawing blood. Completely unexcusable.\n\nAnd obviously Dana is an asshole and a completely irresponsible dog owner. She's lucky not to be brought up on charges in addition to having to pay Amy's medical bills.", "Yeah usually by the time they're old their teeth are so jacked they couldn't manage it.", "She's tiny to you, imagine if it got hold of a baby/toddler.", "You're right in that they unfortunately suffer due to being so small that people disregard their aggression levels and don't get the training they deserve.\n\nThey're still little bastards.", "Oh my Darwin.\n\nIs there any authority you can report the dog to without risking it being put down?", "I'm not very keen on putting down dogs because they bit someone more than once. I think Chica needs to be properly trained. My experience with dogs makes me believe all behavioural issues are trainable.", "Haha thanks for pointing out the typo. I'm also a cat owner. They sure think they're gods...", "The problem with chihuahuas and other small breeds is that people don’t treat them like a dog. When a medium or large dog does something it shouldn’t a responsible owners corrects them, but when a small dog does it people think it’s cute/harmless and reinforces the action. Not to mention the questionable overbreeding of them which can lead to neurological problems with the breed. Chihuahuas and other small dogs are so misunderstood thanks to bad owners when they can be so lovable when properly trained and socialized.\n\nEdit: Forgot to add that people also tend to violate small dogs’ boundaries in often. Small dogs get picked up and handled even when they don’t want to be. Only idiots would try to pet or pick up an unhappy/unwilling german shepherd. Though people that handles small dogs that way are idiots too.", "Dashhounds aggressiveness is often forgotten about unlike chihuahuas, but my animal loving tried his hand at having two (who were okay) but they had puppies. A large amount of puppies. Those dogs killed his ducks, my sisters cats, another dog, and put the literal fear of doggy God into my dads old extremely aggressive goose. I'm truly believe they are why that goose died.", "What if this is a child next time? \n\nSure she could be trained but that level of aggression is highly disturbing. To simply run to the first available person and start biting is drastically past the point of training imo.", "You’re better off with that friendship ending if that is how Dana treats people. Definitely not a shame", "Your future bare legs and likely testicles thank you for sacrificing this friendship.", "Unfortunately, a high prey driven animal doing what a high prey driven animal does. They need lots of socializing to be with small animals and even then prey drive can still take over.", "Those guys were bred to hunt *badgers*. I would not mix it with a dachshund.", "How do people forget?  They were bred to go after badgers and hunt wild boar and wolverines.  You gotta be super aggressive and a touch insane to go after those kinds of animals.", "NTA. a party of strangers is not the time to introduce a dog. The dog needs training and gradually introduced to people. I hope Amy went to the hospoir urgent care for wound care. If if covered by insurance, send her the bill or EOB ( not sure where you are located though)  \nI love animals too but I am less fond of little digs because of they are too yippy.", "NTA", "NTA - she ruined the party by bringing a dog thats clearly not safe to be around people.", "NTA. I love dogs but as soon as one bites me it’s across the room.", "Like Dana like chica\n\nBoth assholes\n\nI hope OP chica oppned ur eyes abt Dana and her attitude towards her friends. I know for lots of ppl pets are like family. That dont means biting is fne or to ask apology frm sum1 who got bitten by her dog. \n\nEdit: i wonder what if chica get hit by a car, and is Dana gonna apologize to car owner???\nNTA", "Jumping on the top comment to add -- If Chica has not had her rabies vaccination then she must get tested for the disease and Amy will likely have to get the series of anti-rabies shots. You MUST NOT wait to see if symptoms appear in Amy because by then it IS too late to treat and IS fatal.", "Just so you know, even if Amy doesn't report this, many times hospitals and doctors will report bites to animal control. It's a public health risk and a way to track rhings like rabies. So your friend may have a visit from animal control even if she was not directly reported by Amy.\n\nNTA btw. Your friend will get her dog killed if she doesn't figure out real quick how to curb that unacceptable aggression. Maybe if you tell her exactly how animals are tested for rabies she will wise up... but probably not.", "The only reason chihuahua’s are labeled as ‘aggressive’ is because they’re the smallest dog breed and are constantly on guard. They’re stepped on, kicked, tossed around like a toy and constantly have their boundaries stomped. I 100% agree that it’s on the owners fault for not properly training her animal and making slow introductions, but not all chihuahuas are going to take your ankle out. All the ones I’ve had are incredibly sweet and well-adjusted. NTA", "You didn't cause everyone else to leave. I guarantee you they were already making that decision as soon as Dana said she'd be bringing Chica back out. You just said it out loud first.", "There is nothing you could have done for that dog in that moment. Her dog's needs would not have been solved by you staying at the party, and it's extremely rude to keep partying after someone has to leave for a legitimate medical emergency *like getting attacked by the host's dog.*", "Laws vary on rabies….\nIn my state, doctors are required to report any dog/cat bites. A vaccinated animal must be checked 3 times in a 10 day period for any neurological issues. The report then goes to the state.. An unvaccinated animal needs to be quarantined at a shelter for a certain amount of time. Off the top of my head. I can’t remember how long. \nThe only sure fire way to test for rabies is to euthanize Chica, and send in brain tissue to a state lab. (If in the US)", "Also rabies vaccinations are extremely expensive (and painful) so she should definitely file a claim with her insurance", "Size doesn't matter much when something is chewing on your leg. I occasionally have previously abused pets and my scariest was a 700g/1.5lb ferret jill. Find 95% of ferrets sweet and those who aren't tend to be badly socialised or abused. But she spent six months charging and swarming me to go for eyes and throat before settling. She was actually a lovely girl once settled. Had her for 5 years but could not trust her with strangers. Vet had a special protocol for her.\nI feel sorry for the dog but your friend has to take her needs seriously. And that includes not letting a possibly territorial dog overwhelmed or let her bite guests. Nothing wrong with keeping everyone safe by having her in a bedroom.", "Which puts you one up on the actual owner, who isn't taking the dog's needs seriously at all.", "Actually, they are not painful at all. The IV was worse.", "Cost depends on location. In cities where stray animals are common (e.g. in Asia, South America) you can often get them very cheap. The government hospital near me does the shots themselves for free, with a 10 rupee (0.12 USD) charge for paperwork and the private clinics do it for approx. 350 per shot (4 USD).", "Doubtful, unless you can contact the rescue society and prove that she's violating her adoption contract by mishandling/putting it at risk by refusing to accept that she has a reactive dog and acting to keep people safe from it.", "My sister was four years old, and the neighbor's dog came onto my grandfather's property, grabbed her by the back of her neck, dragged her down and started shaking her violently.  My grandfather didn't give the owner time to have the dog trained, if you catch my meaning.  He wasn't too worried about the dog's issues. The owner got sued for hospital bills.", "True, I literally worship my cats as godesses.", "NTA, but please ask Amy to reconsider and to report Dana and the dog to animal control, especially if she is the second person that dog has bitten.\n\nWhen I was a child, a neighbor's dog pretty savagely attacked me when I went to pet it (I was not warned not to) biting my face. I came out of it with pretty minor scarring, tha kfully, but a pretty gnarly fear of small dogs.\n\nNeighbor told us that had never happened before, so we only asked that the dog be quarantined, nothing more.\n\nNeighbor lied. I was the second person it bit. It came home from quarantine and attacked another neighbor the next day. \n\nIf the dog is attacking people unprovoked, it needs to be dealt with.", "\"I'm sorry that I did not report you to the police for having a viscous animal, I should have done so but I mistakenly valued our friendship instead. If you'd like me to make up for that transgression, I will happily tell the police all about how your dog attacked me unprovoked to the point that I needed to visit the ER.\"", "You are absolutely right. I have a chihuahua and I trained it like I would train any other dog and did 3 mile walks every day with him. He never barks or growls and would never bite as I've never allowed that behavior.", "My kid asked a neighbor if he could pet her (tiny) dog. She just yoinked him up by his leash/harness to hold him so my kid could pat his head. No wonder those dogs have issues, they can’t trust they won’t be just suddenly dangling midair!", "Agree, if the dog had gone after a baby in a carrier, she could have easily killed it.\n\nDog bites are no joke, they are dirty wounds and punctures can easily get infected and cause a ton of complications. Yes, dogs can be trained, but knowingly housing a dog that attacks at first sight is asking for trouble.", "Vicious. Viscous means something very different.", "Some cats are viscous."]}