{"id": 4532, "submission_id": "zjgm3m", "title": "AITA for wanting to stick with the deal I made with my daughter?", "selftext": "I (54m) am a single parent to emily (13f), a few months ago we moved to a 2 bedroom apartment. For some context before we moved here we lived with relatives or family friends sometimes so clearly we weren’t in the best situation but we’re doing better now. \n\nNow on the the situation, the apartment we moved into is a 2 bedroom 2 bath, one bedroom is the masters with a full bathroom and 2 closets in it while the other is much smaller with a bathroom directly outside the bedroom door and a small closet. \n\nI work long hours and I am usually too tired to come home and do all the cooking and cleaning after a long day of work. I also have some medical issues which makes me working that much harder for me. Since before we moved here I’ve tried to get Emily to help me out with cooking and cleaning but she feels that it’s not her job to take care of the house or cook for us. \n\nWe’ve had a lot of arguments over this and it was like pulling teeth trying to get her to help me. She’d make herself food and keep her own room clean but she refused to clean up after anybody (not even me) but herself when we lived with other people. \n\nSo when we moved to this apartment I told her she could have the masters if she cooked and cleaned and she agreed. It’s been a few months since then and she has gone back on our deal and still refuses to clean my bathroom and room even though she’s home all day doing nothing . She cooks when I ask her to but since it’s her responsibility I feel like I shouldn’t have to tell her to cook every single day and sometimes it feels like she purposefully makes bad food so I won’t ask her to cook.\nI’ve talked to her and she feels its unfair on her to do all the cooking and cleaning but I told her that we made a deal and I won’t allow her to go back on it just because she’s lazy. \n\nI feel like I might be the aita because I won’t allow her to go back on the deal and switch bedrooms just so she doesn’t have to take care of her responsibilities.\n\nSo aita for holding her to the deal we made?", "created_utc": 1670805433, "permalink": "/r/AmItheAsshole/comments/zjgm3m/aita_for_wanting_to_stick_with_the_deal_i_made/", "score": 369, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the ah because I won’t allow her to just switch bedrooms with me and since she’s young maybe she didn’t understand all that I was expecting when we made this deal.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Bro, you are in for a rude awakening here on Reddit. Won’t be long now….It’s gonna be brutal.", "She's not your roommate.\n\nShe's not your partner\n\nShe's not your coparent.\n\nSHE IS A MINOR.\n\nYTA for trying to make her your maid... in exchange for what, living there rent -free? \n\nWHY IS SHE NOT IN SCHOOL?\n\nYou're doing something very very wrong here. Shape up before CPS gets involved for you being neglectful an abusive by making her be your unpaid servant and child labourer.", "YTA - I understand that you are struggling but putting the weight of the household you chose to have on your 13 year old child's shoulders is never the right move. She made the deal, tried it out, and has learned that taking care of a home and her gown ass mother isn't something she is ready for right now which is perfectly okay since she is a child and clearly manages her own reasonable chores (like keeping her own space clean) just fine. Let her switch back, and learn to parent maturely. YOU chose to have a kid, so YOU get to be the adult who is obligated to provide financially and feed her and give her a healthy environment. If you can't handle the basic tasks of parenting and providing, hire help. If you can't afford that, downsize.\n\nAlso, \"home all day doing nothing\" ??? She should be IN SCHOOL. SCHOOL IS HER JOB, and it comes with homework, studying, extra curriculars, and friendships (learning how to be social is a vital part of growing up). That isn't \\*nothing\\*", "YTA why is this child home all day and not in school?", "If she’s at home all day doing nothing, why isn’t she at school? She’s your daughter, not your live in servant. Start acting like a parent! YTA", "INFO: did you get the age right? She's 13, not 23 or 33. She goes to school, no?? So she's not home all day, just lounging. She's going to school, presumably completing homework, and enjoying being a young teen.", "Yes, YTA. \n\nIncreased percentage of the household chores I could understand, but you expect her to clean YOUR bedroom and bathroom? Am I reading that right? Wow. Just wow.\n\nAdd into that that she's only 13 too and yes, YTA completely.", "INFO: you work all day and she’s home schooled. Who teaches her? There’s no homeschooling in my country, but I thought one the parents did that and it’s apparently just the 2 of you", "YTA for trying to make you 13yo daughter your live in servant. You're an adult, and despite having health problems, it's not her duty to clean up after you or make your food. Sure, it would be nice if she helped out more, but what kind of dad would make a deal where his teenage daughter cleans his bedroom and bathroom? Have chores she helps with in the shared spaces, quit being a slob and keep your spaces clean, and share food making. Not saying make her cook half the time, but help find easy stuff she can help out with making a couple times a week. There's nothing wrong with a kid having some chores and very minor things like making easy meals. And if she doesn't want to make dinners, that's fine, she's your daughter, not your wife or roommate. It's your responsibility to take care of her, not the other way around.", "YTA for making the deal in the first place\n\nYou made an adult deal with a CHILD and are surprised she is acting like a CHILD? \n\nYour 13 YEAR OLD is not YOUR parent. You are HER parent. So be the parent!", "YTA 100% \n\nShe is your daughter not your servant or even partner. She is not your maid, she doesn't owe you anything. Why would she clean your room? Or your bathroom? That's frankly disrespectful of her as a person to make her do that. \n\nI completely support asking for help and you had me until you said you expect her to clean your bathroom and bedroom. I can see why she makes shit food for you, that's what you deserve. \n\nYour daughter should consider calling CPS as you are clearly an unfit parent.", "YTA. SHE'S 13! WTH?? It is normal for kids that age to have chores (mine are 14, 16), but she is not an indentured servant  and to expect her to do all the cooking/cleaning in exchange for a bigger room is such a dick move.\n\nIf you're going to hold this over her head over a few extra square feet, take the bigger room and give her a break. This is a great way for you kid to peace out at 18 and never talk to you again.\n\nYTA.", "YTA, she is not your maid, wth? She’s 13, you’re the parent.", "Yta. She has a full time job too. She's a student with homework. Take the master, she gets the small bedroom and she gets to be a kid. She shouldn't even be cookkng for herself nightly, let alone cleaning up after you. Developmentally inappropriate. Her making dinner when you do the dishes or or you cooking and her doing the dishes would be fair-ish but still  a lot for a 13. She isn't a roommate she is your child.", "YTA.\n\nShe's 13. If you want someone who does all the cooking and cleaning, hire someone.", "YTA for making this deal. She’s 13, a child. Household chores are fine, running a household is not. Give her reasonable weekly chores and figure out how to manage what needs to be done without putting the burden on a child.", "Yta.  She’s a 13 , and why is she not in school all day? A kid should be doing schoolwork and extra activities, studies etc to further her future. Not cleaning up after her 54 yo father. She’s a kid. Go figure your own crap out not asking a kid to cook for you.", "YTA - your kid is right; it's not her job to take care of your grown ass.", "Making your 13 year old kid responsible for 100% of the cooking and housework absolutely makes YTA, and a bad parent to boot.\n\nYour kid is not a wife or a slave. Get your shit together.", "YTA - you have turned your daughter into the servant or wife. That’s not ok. Clean your own bathroom", "YTA.. your daughter is a child.. not your servant.. \nwhy did you even think this deal is ok to make?! You are the parent, please start acting like it.", "YTA. She is your child not your maid. She shouldn't have to cook your meals and clean up after you. You are the parent and those are your responsibilities.  She takes care of herself and it sounds like she has done so for years. She's a kid and you're an adult. Not the other way around.", "If you read Reddits you know how many women with husbands and kids work full time, come home and cook and clean, and take care of the kids.  Very often their husbands will not help and now we meet you. Hmm.  Are you saying you can’t work as hard as all those women!  If your daughter was a son, would you be demanding housekeeping services and cooking from him?  \n\nWhy is she home all day doing nothing!  Why isn’t she  in school, doing homework and participating in sports or rehearsing for the school play?  Does dhe even have friends?", "YTA. You have a child to provide a safe space for, not a roommate who isn’t holding up their end up a deal. This whole thing reads as if you’re more her friend than her mother and THAT is going to cause you a lot of problems. The teen years just started, strap in!", "Sorry OP but YTA. She isn’t your roommate, she’s a child. It’s on you to provide for her. Cleaning up after herself is fine, and maybe getting a meal together one day a week is fine, but as a child, she’s expected to clean up your bathroom? Cook for you both on a regular basis? That IS unfair. Let her be a kid-she has her entire life to adult.\n\nI’m sorry you’re in this position, but this arrangement seems very unfair to your child. Can you order in sometimes? If you’re struggling can you look into local soup kitchens or WIC? There are options. Wishing you both the best.", "YTA. \n\nYes, a 13 year old should have chores. She should not be responsible for the entire home including your private areas because you don't want to clean. A 13 year old should also be in school so unless you have removed her from her education she isn't home all day everyday doing nothing. She is also not responsible for cleaning your bedroom or bathroom. She isn't your housecleaner. She isn't responsible for you. You are suppose to be responsible for her. You are to take care of her. \n\nAnd she makes bad food? She is 13! Not all of her meals are going to be winners. She cleans after after herself, presumably attends school, cooks, cleans other than your messes etc. She is doing great.", ">I feel like I might be the aita\n\nWell at least you got one thing right.", "YTA because you are treating your daughter like a roommate not a child you are supposed to be parenting. Look into taking some parenting classes", "She shouldn't have to cook every day. Your daughter is a child, not your stay at home wife.\n\nWhile I agree that she should help with maintaining the public areas of the house (help, you should be doing your share) she is not responsible for cleaning your bedroom and bathroom. Once again, she is your child not your maid.\n\nYTA in so many ways", "She's 13. This stuff isn't her responsibility no matter if she agreed to your attempt to dupe her or not.\n\nYTA, and a bad parent to boot.", "She's 13, she isn't your maid.\n\n\nYTA", "So your 13 year old daughter has been taking care of herself while you made her homeless, and now you want to strong arm her into taking care of you too? Does she have to wait until you die to actually be a child? YTA MASSIVELY. Your job is to provide and care for her, and to help her launch into adulthood from a secure base. You have so far been unable to provide any of that, and now that she has the tiniest bit of stability, you want HER to take over as the adult? Do some self reflection on your entitlement and refusal to take responsibility here, OP.", "Is your daughter's name Cinderella?  \n\nYou seem to think that a 13 year old girl should take on the household chores like she's an equal partner.  More than that you want her to do them all!  She's homeschooled online?  WTF, this sounds like a nightmare top to bottom and it is all on you.  YTA.", "YTA. Are you seriously forcing your 13 year old daughter out of childhood and into the role of your maid and personal chef?\n\n\nETA: she’s not lazy. She’s a kid. You however are a whole other category.", "YTA. She’s 13, she’s gonna act like a child", "YTA. And honestly, I almost feel like someone should call CPS on you. There's something creepily wrong about you expecting her to perform SAHP duties, such as doing all of the household cleaning and cooking. She may be homeschooled, but she's still got to learn and study and do homework. I'm also concerned-- she stays at home alone ALL DAY by herself? How is she making friends? When is she socializing? Is her mental health alright? Would you know if it wasn't? Why isn't she attending regular public school??\n\nThis is a weird kind of parentification, and this situation is not normal or right. It's almost like you expect her to mommy *you.* Make you nice meals every day and clean your room even though she's THIRTEEN. Your deal itself was gross from the start.\n\nChores are fine. Have her take out the trash, wash the dishes-- normal stuff. Not clean the household top to bottom and cook 3 times a day.\n\nEdit to add:\n\nI hope you don't *EVER* call her lazy to her face. She's doing more than any 13 year old should ever ever ever be expected to do. She probably has low self esteem from being socially stunted by you, and the last thing she needs is to have her confidence in herself destroyed.", "YTA. she’s your child, not your maid.", "YTA\n\nIt is normal for kids to have chores, however it is not normal to demand 100% of the house management from them.\n\nCan you hire a cleaning service? Meal prep on weekends? Idk find ways you make less of a mess... she is your child, not your employee", "YTA since you won't even allow her to switch rooms now that she knows it is too much for her.", "YTA\n\nWhy do you think your daughter is your housewife? There is zero reason she should be cleaning your bedroom and bathroom. You are a grown ass man. Either keep your personal space clean or clean it yourself. Pick up after yourself and no one will need to clean.", "YTA never seen someone parentify their child when they only have one child. You're the adult, she's 13, she's not about to take care of a whole home. Either figure something else out or just put up with a slightly messy house and some microwave meals.", "YTA\n\nI feel for you, and I’m glad you were at least giving her the master bedroom in exchange for parentifying her, but you should switch back. \n\nThese things are NOT her responsibility. She is right. Take the master bedroom back and let her be a kid because that’s what she is.", "YTA, your 13 year old is not your servant", "YTA \n\nYou want your 13 year old to cook and clean for you!\n\nWow!\n\nGiving her chores is one thing. Giving her all the chores is abuse!", "You will be the AH if you don't figure out a compromise. \n1. She doesn't clean your personal space. *Your bedroom and bathroom*. \n2. You take turns cooking. She cooks, you clean, then switch roles. \n3. You each clean up after yourself. If you drop it, pick it up. If you dirty it, clean it. \n4. You take turns vacuuming, mopping, laundry, etc. \nWrite it on a calendar if you have to. \n\nYou have gone on about her negative traits, but you need to focus on what she's doing good.  Are her grades good?\nDoes she have social interactions with kids her age?\nHer schooling IS a full time job. \nEveryone is upset with you for her chores and age. Yes, she is only 13, but you are not raising a child. You are raising a young adult. If you do it right she will have the life skills to survive on her own one day. \nShe is not a servant, she is your daughter. Your number one job is to guide her to adulthood.", "So, let me get this straight… your young teenage daughter took care of herself, cooked for herself, and cleaned up after herself, but this wasn’t good enough for you? She should have to take care of you as well? She should take on the role of parent just because you have a job and you make money? That “deal” you made was totally unreasonable. That’s a lot to ask of someone her age. That’s full time job a lot. Not cool. YTA. I get that you’re tired after work, but that does not mean your responsibilities as a father are over.", "YTA, sorry tricking a child into permanently being your caretaker isn't working out for you?", "YTA you’re the adult here, why would you even suggest something like this. Asking a 13 year old to be responsible for all of the cooking and cleaning is just lazy parenting. She’s not at home doing nothing, she’s in school!! Jesus she’s a child not your maid.", "She’s old enough to clean and cook some…NOT all of it though. Expecting for her to cook every night and clean the entire house is extreme.\nYou need to sit down together and make up a fair agreement and weekly chores/menu. She can cook 2-3 nights easily but you need to step up the other nights. She can clean her area and the living room but you need to take your area and the kitchen - or whatever other equitable division you can agree upon.", "YTA and a really bad parent", "YTA what is with the posts today of people making ridiculous \"deals\" with their young children.", "She’s not a replacement for her mother. YTA.", "YTA she's your child not your wife. Be a parent and clean up after yourself.", "YTA. She’s 13. Period.", "Why are you making your 13 year old the adult of the house and you become the child? \n\nShe’s 13 she should not be cooking all your meals and cleaning your bathroom. YTA", "YTA. I believe kids should contribute to the household in age appropriate ways, but the scenario you've created is terrible. No chance she's \"homeschooling\" when there's no one there to provide support and guidance, and obviously you're not up for that when you get home from work, since you're expecting to come home to a clean house and meal. This is a child in need of parenting and school, not your housewife. The bedroom arrangement is the least of the problems here.", "YTA go get a Stouffer’s and take back the master bedroom for yourself. Everyone needs to clean their own damn bathroom.", "Idc if she has nothing to do all day… not her job.\n\nBoo fucking hoo sucks to be you. I’d feel pity but u have a kid. U don’t get excuses. Idc if ur depressed or suicidal or whatever.\n\nYou have no excuse to not be a good parent for ur kid.\n\nUr not doing ur job and trying to make ur 13 year old do it for u. I’d be proud she’s so good at setting boundaries. I’d also ask myself why the fuck a 13 year old girl is so adamant at setting hard boundaries with her father. I sense you’ve been a shitty parent longer than this", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (54m) am a single parent to emily (13f), a few months ago we moved to a 2 bedroom apartment. For some context before we moved here we lived with relatives or family friends sometimes so clearly we weren’t in the best situation but we’re doing better now. \n\nNow on the the situation, the apartment we moved into is a 2 bedroom 2 bath, one bedroom is the masters with a full bathroom and 2 closets in it while the other is much smaller with a bathroom directly outside the bedroom door and a small closet. \n\nI work long hours and I am usually too tired to come home and do all the cooking and cleaning after a long day of work. I also have some medical issues which makes me working that much harder for me. Since before we moved here I’ve tried to get Emily to help me out with cooking and cleaning but she feels that it’s not her job to take care of the house or cook for us. \n\nWe’ve had a lot of arguments over this and it was like pulling teeth trying to get her to help me. She’d make herself food and keep her own room clean but she refused to clean up after anybody (not even me) but herself when we lived with other people. \n\nSo when we moved to this apartment I told her she could have the masters if she cooked and cleaned and she agreed. It’s been a few months since then and she has gone back on our deal and still refuses to clean my bathroom and room even though she’s home all day doing nothing . She cooks when I ask her to but since it’s her responsibility I feel like I shouldn’t have to tell her to cook every single day and sometimes it feels like she purposefully makes bad food so I won’t ask her to cook.\nI’ve talked to her and she feels its unfair on her to do all the cooking and cleaning but I told her that we made a deal and I won’t allow her to go back on it just because she’s lazy. \n\nI feel like I might be the aita because I won’t allow her to go back on the deal and switch bedrooms just so she doesn’t have to take care of her responsibilities.\n\nSo aita for holding her to the deal we made?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. Expecting a 13 year old to attend school, cook and clean for you is hugely inappropriate.", "Your daughter is not your maid. YTA. Clean your own damn messes.", "YTA. Homeschool is work, not sitting around all day. Let her be 13 and you should be so lazy. \n\nWhy do I think that if OP had a son, he wouldn’t be acting like this….", "YTA. Dude...she's a kid... not a housekeeping/cook.", "I was ready to say you weren't the a until i realized you expect her to clean your bedroom and bathroom.  Your the AH. I understand expecting your child to have the meal ready and picking up in the house but she shouldn't have to clean after a grown as adult. Yta", "Yta , why do you think it’s her responsibility to cook and clean after you?", "YTA. She’s 13.", "Bill fing shit story.", "It’s bad parents day tonight huh", "YTA but not for the reason you think. Your daughter is 13. Her only responsibilities should be school, fun teenage activities, and maybe a part time after school job like babysitting. Instead, you’re attempting to bribe her into being an unpaid house servant. \n\nYou’re not doing your job as a parent. It is YOUR job to figure out how to maintain the home, not hers.", "YTA. This just makes me sad. I hope when she’s 18 she can get out.\n\nOP you are a TA.", "YTA please put your child in to school. You are failing her by not having her interact with others her age. This is the time she needs to learn how to socialize with others if she does not get the chance now it will make life much harder for her in the future.", "YTA. Clean your own damn room and bathroom.", "Dude…. You daughter should not be cleaning your bathroom and cooking your meals. If cooking is so stressful but a crockpot.  If you want you daughter to cook, make life easy on her, have her cook 2x a week or something.  You are a grown man, clean up after yourself.", "Is her name Cinderella? Yta", "INFO: Why are you trying to groom your 13 year old daughter into being your wife? \n\nWhy aren’t you involving her with groups to help with her socialization?\n\nWhy are you being such a monster?", "Jesus Christ, YTA.", "YTA, basically you’re making a 13yo kid a personal servant and you don’t see what’s wrong with that just because you’re the parent lmao", "she is fucking 13. you need to hire some help if you can’t do it yourself, not make your damn child do it. SHE’S lazy?????? you have a lot to reevaluate. YTA unbelievably so", "YTA.  She is not the parent here however it really seems that way.  And she definitely shouldn't be needing to clean up after you,  can you not throw things away and put them where they belong or does your 13 year old have you show you? GL. YTA.", "YTA. Is it still parentification if there are no younger siblings? Your 13yr old child should not have the primary responsibility for household chores. Should she help? Yes. Should it be on her to take care of most if not all the cooking and cleaning? No. You are the parent. You are the adult. Act like it.", "It sounds like you've been having a hard time and are just now trying to get on your feet and perhaps are still a bit overwhelmed.\n\nIt's understandable that you would like some help, and I get your daughter is getting old enough to where she can physically do those things, but she is still a child. You absolutely cannot expect a child to do all of the cooking and cleaning for you regardless of what size bedroom you give her.\n\nYou are the parent. You are going to have to figure it out. You, not your kid.", "She’s right, it’s not your 13 year olds job to cook and clean - either do it yourself or hire someone. Stop putting adult responsibilities on your child. She does nothing all day? School?? This is really sick. YTA.", "YTA you should take care of HER. Stop this right now. You cannot make her cook. Just very now and then you teach her to cook...to get her prepared for adulthood...but at this age you do that WITH her just now and then. Again: at this age just small chores.", "YTA. Swap rooms with her and give her back her life. Hardly seems like a fair swap does it?  Think about that.", "YTA here.  \n\n\nShe's 13!  Being your daughter in no way obligates her to be your servant. There's a huge difference between doing reasonable household chores, and being essentially a \"wife\" as you're expecting her to do.\n\nI too suffer from painful illnesses that make stuff difficult to do.  Figure out some workarounds other than making your child wait on you hand and foot.\n\nOh, and switch bedrooms back.  The \"deal\" you made was not a fair one and you're just going to constantly resent it for every single chore you feel she \"owes\" you for the \"cost\" of the master bedroom.\n\nYou need to apologize to her and start this whole thing over again.  Make a REASONABLE help/chore list and leave it at that.  Figure out ways to workaround your illnesses.  \n\nPay your daughter per piece of extra help she gives you, that is, those outside normal reasonable chores.", "YTA but I think it's fixable. \n\nIt's perfectly reasonable for a 13YO to do an equal share of household chores. Key word being equal. Y'all need to share the duties. Try to make a weekly plan for who will do what on which day.\nCook together some days.\n\n(I'm in the middle of teaching my 11YO son the ways of the kitchen. Soon he will be able to make some meals without supervision. Some of our best quality time together is when we're in there making food. )", "YOU'RE the parent, it isn't her responsibility to take care of you. Its YOUR responsibility to take care of her, she shouldn't be cleaning your or bathroom. She isn't your servant, stop treating her as such. \n\nThis is boarderline child neglect, YTA", "Gross YTA you’re expecting way too much of a *literal* child sir", "Op shame on you and yta.", "YTA - She’s 13 and she cleans her room and after herself? Count yourself lucky. You shouldn’t have made a deal with a kid like that. School is her job not cleaning up after and taking care of you, that is your job as a parent.\n\nChange your attitude about school, and start acting like a parent not a roommate", "YTA. She's 13. She is not your live-in maid, of course she doesn't like this. Also-\n\n> even though she's home all day doing nothing\n\n**WHY ISN'T SHE AT SCHOOL**", "YTA\n\n\nYou make me so angry. I have health issues that mean I'm sometimes unable to stand upright nevermind long enough to boil water. Yet I manage to feed my children on those rare days. I do not make my 13-year child do it, hell I don't make my 17-year-old it. I do it. Do you know why? I chose to have my children. I brought them into this world. They didn't get a choice in it. Therefore my job is to love, care and provide for them, keep them safe and happy. That's it. You sacrifice for your kids. You give up what you want for them. If it's a choice between being in pain and them not being in pain, you choose to be in pain.\n\nThats not to say a 13 year old can't help around the house in the form of chores. Chores are good for teaching them self reliance but chores are a far cry from being a housewife for you.\n\nYour idea that she is sat around doing nothing all day is ridiculous.  You leave your CHILD alone all day to educate herself while expecting her to keep your home clean and you fed. You need to seriously seriously wake up and see all the ways your fucking up this poor child.\n\nGet your daughter in school first of all.\nClean up after yourself. Your room and bathroom are your responsibility. \nMeal prep, frozen ready meals for those days you can't do anything. Get organised.\n\nBut please please stop treating your child like your godamn maid/cook. She is a 13 year old child. Yes a teenager, but from raising 3 of my own 13 is still so much of a child. She will still want to play with dolls, watch cartoons and play as well as exploring growing up. They are so complex at this age. You need to do better, so much better.", "Info - what do you mean home all day? Is she not in school?", "YTA. She’s a child, not a maid. Clean your own shit stains in your bathroom and learn how to take care of her instead of forcing her to take care of herself.", "YTA\n\nShe’s 13 years old. It looks like she’s very isolated, doing homeschooling (presumably alone?) and then expected to keep the house and cook?! \n\nGet it together. She seems like a good girl and you need to do better. It sucks that you have health issues but simple meals at the end of the day and cleaning a 2 bedroom apartment is not hard between two people if you attempt to be organised.\n\nEdit - i just read more comments. Get her into school! These are formative years for her. She needs to be with her peers and trusted adults!", "YTA. She’s the child. Ultimately you are responsible for the adult side of things. She should be able to keep her own spaces clean and she isn’t at home all day doing nothing because she should doing schoolwork. Also, you say she’s home schooled but who is doing the teaching? You are isolating your child and she’s not going to be able to cope in the real world. You should be keeping your own spaces clean.", "YTA. It sounds as though you’re wanting her to be a servant. It doesn’t matter if you have health issues. What kind of health issues do you have that you can work, but can’t cook and clean up after yourself? Don’t be surprised when she goes LC or NC with you when she is able to.", "Your daughter is 13, it isn't her job to look after the home.  As a parent to a minor it is your job, if you cannot fulfill running the house then you get outside help not pawn it off to her.  YTA", "YTA, you’re trying to get a CHILD to be your servant.  The comments you made about her only cleaning her room and cooking for herself when you were at other places…WOW!  She’s more mature than you are!", "YTA. My dad raised me on his own from the time I was twelve. He never expected me to take care of the house the way you are expecting your daughter to. My dad always told me my job was to go to school and try to do the best I can. You say she is home all day and does nothing. She is school aged why isn't she in school? Or taking online classes from home. That alone can get cps involved. Btw if she is doing online school or I person school that isn't easy either that literally is HER job. YOU are the PARENT, it is. YOUR jib to keep a home for her.", "YTA \n\nshe’s 13 \n\nLet her be a kid. It’s not her job to handle the household", "NTA this is common in many cultures that kids help maintain the house. The massive amount of shame rolling your way come from people who have bought into the participation trophy leave it braver- kids are the king culture that is the current norm for priviliged families in the US.\n\nSet a date and an expectation and then if not met she gets the little room.", "YTA\n\na 13 year old shouldn't need to be taking care of YOUR responsibilities as a parent.", "YTA\n\nThat shit is exhausting as an adult without any disabilities. I can’t imagine doing it at 13.\n\nDo meal prep on the weekend or something. There are better ways to handle this instead of making your kid do it.", "YTA!!!!!!!!!!! You chose to have a child. Now deal with it. Children are not your live in slaves.", "Also would be so pressed about your child cooking if she was a male???? Omg you are still tA", "Info: when you say the deal was to cook and clean do you mean completely? Like she would do all the cooking and cleaning. Or that there would be certain days she would cook and certain areas of cleaning that would be her duty?", "Doesn’t she go to school?", "YTA.\n\nYou should never have made that deal in the first place.\n\nAlso, you say she does nothing all day, really? Why is she not going to school to work on her future?\n\nThis whole situation sounds very unhealthy and not good for your daughter. And probably not for you either. You need to find other solutions.\n\nLike, if you can't work full time and take care of the household, because of your medical issues, then you need to look at that first. You can't expect a 13 year old child to solve that for you! Check to see if you have insurance for example, maybe you can get money for being unable to work full time, so you can work less hours and cook and clean yourself. Or see if you can get help any other way from the outside (government, relatives, your employer, anyone. But not your child).\n\nAlso if you \"don't allow her to get back on it\" it's not a deal at all. It is you forcing her. It sounds like she never had a choice here at all.", "YTA, “my THIRTEEN year old won’t act like a wife and take care of the household duties for me even though I gave her the bigger bedroom”. \n\nYou’re the parent. Act like it. She’s a child and your excuse of “being too tired” isn’t good enough.  Switch rooms and take care of yourself and your daughter like you’re supposed to.", "YTA. She is a child, not your substitute wife.", "YTA you need to send your kid to an actual school, you are setting her up for not being able to cope with the world. She isn’t doing nothing all day she is learning and she is not responsible for mess she didn’t make", "You're the Asshole\n\nYour child isn't an indentured servant   \nChildren don't ask to be brought into the world, you can her mother did that.    its your job as HER PARENT   - to feed her and help support her and raise her -       She Does Not Owe You Anything           - She shouldn't have to clean up your bathroom and your messes   -   you're the lazy one, medical issues or not. You get days off that you can take care of your own shit\nYour an adult, practically elderly and with a kid, grow up    \nYou tricked your daughter into waiting on you -      \nYou probably took advantage by being extra slobby cause 'she'll get it for me' , you definitely took advantage but making her work for nothing -            \nOf course she wouldn't want to keep taking care of you, shes not supposed to have to take care of you\nKids don't get much time to be kids, as a parent why would you take any of that time away???\nTeenagers go through alot of stupid emotions and with the hormonal rollercoasters that girls her age get hit with, she should be able to have time for herself to figure those out, along with personal time figuring out how she can make herself happy in the future instead of waiting on you hand and foot\nYou're not considerate of her feelings, your not treating her like a genuine individual who may also be going through things you can't see.\nyou tricking her will definitely make her not want to do your chores for you. \nAnd if you go back on your word often you could cause her to develop trust issues, in you for sure, but also with other people making future realationships harder to form \nGenuinely respect your child", "YTA if she offered to move back. Is she doing nothing all day or is she doing school / school work? Also, why can’t you just pick up after yourself as you go along? It sounds like you’re not able to take care of yourself and your daughter, and it’s time to get help that’s not from a minor. Get a cleaner 2 hours a week, plan meals so they’re easy and take twenty minutes from cupboard to plate. There are plenty of nutritious foods out there that are convenient. Agree something better with your daughter, like you’ll cook half the meals each.", "YTA, your the parent (and the adult at that) and she’s a 13 y/o child. I understand wanting her to contribute but to clean your bathroom and bedroom and cook for you every single night? \n\nThe fact she keeps her room clean and is able and willing to make herself food is good enough. Less work for you to do. I’m sorry that your a single parent and have some medical issues but you have the responsibility of your daughter. Plenty of single parents and even married parents are exhausted working full time and than basically working overtime at home with the up keep and family. But that’s life and all the responsibilities that goes with the role of parents when you have kids. \n\nAgain I want to reiterate that she is not your maid, servant or wife. She is your child. Stop trying to make her clean up your mess and cook your own food or prep before you go to work or the night before.", "Now that the home schooled thing has been revealed I’m pretty sure this is just a case of straight up child abuse. This girl needs help asap. YTA", "YTA - do you really need validation that this is wrong?\n\nYou want a child to do all the chores at home because it's hard for you? Welcome to be a parent.\nYou say she does nothing at home beside being homeschooled? That's a full-time job for a 13-year old!\nYou're reasons for her being homeschooled? Possible shootings and that she might be bullied? Your solution - to separate you're child from other preteens !\nOr did you homeschool her that she can do all the chores at home? Think about it.\n\nYou're parenting choices are just wrong. Do better and act like an actual parent.", "Yta. She's fucking 13. Why are you asking your literal child to care for you? It's not her job. Shes right. It's not her fucking job.\n\nYOU gave birth to HER. She didn't ask to be brought here to be your caretaker. The fact you expect her to is disgustingly unaware at best. Deal? She's fucking 13. Why are you making deals with a CHILD that are unreasonable for her to uphold at THIRTEEN FUCKING YEARS OLD.\n\nCook and clean all of your things? Is she suddenly your mom or wife? Mom shouldn't be cleaning up after her adult children, wife shouldn't be treated like your mom. Why are you treating your daughter like that? Regardless of age.\n\nREGARDING AGE SHES 13. THIRTEEEEEEEEEN. GROW THE FUCK UP. YOURE THE ADULT. YOURE THE PARENT. ACT LIKE IT.\n\nJfc. Jesus. Christ. \n\nI'm chronically ill. I would never have kids because of it (I didn't really wanna anyways but that squashed all possibilities).\n\nI'm just remembering my mom, after I protested taking care of her kids for her going \"well I had kids so i didn't have to do those things.\" \n\nYou may not mean it, but you're teaching your daughter she's a tool to use. My mom was explicit, but even at 13 you pick up on the non verbal cues and internalize them.\n\nTalk to your daughter. Listen to her. Be a reasonable adult. If you disagree, calmly explain why, and be OPEN to listening and possibly accepting her side of things.\n\nShe's at the age where you should be teaching her to have adult conversation and instead you're punishing her for not..... *checks notes* cleaning up after her literal parent?\n\nDude, I'm telling you as someone who has no contact with either parents now as an adult. Who's parents used them as a substitute parent and a support system for things way out of my playing field (which the latter, you're asking her to do. You are, intentionally or not, you are). Don't do this to your kid.\n\nTell her you're sorry. Get therapy for yourself. Ask if she'd be open to joint therapy after you sit down with her and GENUINELY listen to her.\n\nYou're a whole human. That's just fact.\n\nYou're raising a whole human. Don't forget she's a people too. She's old enough for you to stop pulling the \"because I said so\" card.", "YTA\nYes, a 13 year old should have chores & responsibilities.\n\nNo a 13 year old should not be the default cook/maid regardless if she’s home all day or not. I assume she’s homeschooled which means she should be doing some form of studying or something while at home all day.\n\nBe an adult and do your part or hire someone who can do these tasks (which it sounds like you probably can’t).", "YTA \nYou are isolating your daughter. She needs time out in the world interacting with people her age. If not school then other activities. Otherwise she will never learn to make friends. This is so so so bad for her development.\n\nYou need to take responsibility for your own bedroom and bathroom at the very least. You cannot put all this work on a literal child. \n\nShe’s not “doing nothing all day”. She is teaching herself because you won’t let her go to school nor will you teach her yourself. I hope she’s at least in an online program and not literally teaching herself.\n\nThis isn’t good for her and is going to hinder her development. Stop wrapping her in bubble wrap and start setting up a proper parent child relationship. One where she is allowed to be a kid and you don’t expect her to care for you.", "YTA and you need to make some major changes to rectify this situation. Take the master bedroom back and nullify the “deal” with your daughter - she doesn’t need your load of adult crap on her shoulders. Enroll her in school. If you’re worried about her, then start being an involved parent. Plan and prepare your meals ahead of time. Maybe you and your daughter can cook together for a few hours on the weekend. You need to do better. Isolating your *child* and placing adult responsibilities on her is not fair to her. Letting *your* fears cripple *her* life is abusive.", "I'm going NAH.\n\nYou are in a bind because you work full time and you have medical issues that make you tried.\n\nYour daughter shouldn't have to pick up the slack here, but this isn't an ideal world and sometimes kids have to do a few more chores than we'd ideally like.\n\nFind a compromise, find easy meals to cook, get a slow cooker so you can just pile stuff into it in the morning, and come home to a cooked meal.\n\n\\*All\\* the cooking and cleaning, no, sorry, you are the asshole for this. It's OK that she does chores, maybe even a lot of chores, but \\*all\\* the cooking and cleaning is too much. Find a compromise.\n\nCooking is far easier and faster than some people make it. Find stuff that is easy to make.", "NTA. If you're out working to provide for everything it takes to keep a 13-year-old Child Alive and healthy, then there is absolutely no reason why she cannot do her part around the house. 13 is more than old enough to be able to cook and clean. I didn't see anything in there about you wanting her to rebuild a car engine, or lay block. So all you're asking is for her to do what it takes to keep a house in decent shape and help the person that's winning the money that keeps the house going. You're only real problem is allowing her to think that she should have any choice in the matter. If she doesn't want to cook and clean, then tell her what her part of the rent and groceries are and let her get the money the best way she's able. Because that's how the world that she will eventually have to move into works. You need to teach her, help her actually, be a productive adult when she grows up.", "NTA, everyone has chores, and cooking and cleaning are your daughter's chores. You shouldn't feel bad for expecting her to do them", "NTA : She agreed to a deal and if you don't follow through, what are you teaching her?\n\nI definitely don't agree with most of the posts on here bitching about 'making her be the parent, etc'.\n\nYou are doing the best that you can and making a teenager be responsible isn't a bad thing.", "NTA.  I would move her out of that room before the son sets today. Also, she would not be getting any new cloths or any extras until she starts helping.  It is her job to help keep the house clean. I would just buy cereal for meals. My kids never wanted to play \"I don't want to\" game with me.  In the game I would only do the things that where required by law. A roof, food, cloths. Cloths only birthday and holiday.if they wanted something I would say \"I don't want to \".  It works every time", "I missed the part where he said he was making her do all this for her room and board. I did see where he said she made the offer for that deal in exchange for the larger of the bedrooms. In other words, she made a deal for something that she wanted, and now she wants to back out of it. I also read the part where he mentions that he works many long hours in order to support her lazy ass. That he has medical problems and she's too selfish to even help him out. The best thing he could do for this child, in my opinion, is to let her act as an adult. Charge her half of rent, utilities, food, entertainment, clothes, and any other bills that come up as a result of living in that house. If she has time to cook for herself, but refuses to cook for him, then it's not a matter of labor. It's a matter of selfishness.", "Perhaps you simply were unable to read the part where this was expected in return for her getting the larger of the two bedrooms with a private bathroom in it. In other words, she gave her word that she would do those things in order to get something that she wanted. And now he expects her to do that which she said she would do as part of that deal. In other words, she went back on her word. You're never too young to learn the importance of keeping your word. And Trust me, the work she's doing is a lot less than the chores that most children have to do at that age. Perhaps you also were unable to read the part where he talks about working long hours to pay for her food, the bedroom she sleeps in, the house she lives in, the clothes she wears, the electricity and entertainment she enjoys in the house, and all of the other things that make life worth living. And perhaps you didn't read the part where he has medical problems so that it's harder for him to do these things after he comes home from working long hours in order to provide those things for her. And perhaps you also didn't read the part where she's not going to school and does nothing at home all day. Well, except for the part where she cooks for herself and cleans her room. This is obviously a lazy child who needs to learn the importance of keeping her word and doing a little bit of work. Not hard work, just work.", "I wanted to say congratulations on getting a home for just you and your daughter. Thank you for working hard to provide for her.\n\nI do believe you should switch rooms and come up with an appropriate chore chart for the both of you. She is 13 and stuck at home 24/7 and having the responsibility of a SAHM is not fair to her. If she can't keep up with the deal (understandable for her age) then make it even.\n\nGood luck and just try to keep communication open with her and try to enjoy time together.", "Haha I love the post where you know someone is gonna get shredded. These people obviously need it in some situations as they're being absolute assholes to put it lightly", "Love this response 😂", "OP says she’s homeschooled because\n-he’s afraid of school shootings\n-she doesn’t make friends\n-he’s afraid she’ll be bullied. \n\n\nSo he gets a free maid, at the cost of her future. He’s isolating her and hobbling her entire future and demanding she cook and clean for him. And depriving her of ways to learn to make friends and deal with bullies. It’s very troubling. Super concerned.", "Grown ass FATHER, OP is male", "She is homeschooled", "She is homeschooled and she does her work online", "She’s apparently home schooled / online school", "She teaches herself online since I have to work", "She is also \"homeschooled\", which according to him means she teaches herself online (whatever the hell that means). This poor girl needs help.", "This is completely accurate. You should be ashamed of yourself,  honestly.", "I normally don't think anyone should get CPS involved unless some type of abuse is taking place, mostly because of how bad the system is...But, wow. I hope someone contacts CPS because if he thinks his THIRTEEN YEAR OLD daughter should act like a live-in maid and cook I can't even imagine how bad his parenting is in other regards.\n\nThis is horrifying. And the fact she thinks that his daughter is the asshole in this situation?! My God, what is wrong with OP?!", "He is NTA, you are. It's attitudes like this that show why Western Civilization is in the decline it's in. As a 13-year-old, she is more than able to cook, clean, and help keep up the house. That's what being part of a family is. Doing your share. Especially if you can help someone who has problems. This isn't a let's make her cook because she's a girl situation. This is a she is home while I'm out working to provide for the house, the food, the clothes, and the amenities. She's not out working, and if it's summertime and she's not at school, then she should definitely be doing that around the house if that's what her parents ask of her. The permissive kind of attitude that you're talking about is why children nowadays have no idea how to function as adults when they get older.", "Would like to add that wives should not be slaves as well, but otherwise I agree", "Wife or slave? Pls edit.", "He isn’t preparing her for being an independent adult, considering he doesn’t even let her go to school.", "So what chores does OP have?", "She’s doing all the work a SAHP would do AND attending school, so she’s working the same amount of hours OP is and is totally responsible for keeping up the house. That’s not even touching on how a child has been burdened with keeping a house.", "Its her job to keep the house clean? She's fucking 13. Why should a child be responsible for cooking and cleaning for the both of them? It was a ridiculous deal for him to make to begin with. \n\nTo make it worse this girl is homeschooled and probably never goes out or socializes. Just stuck at home being her fathers maid. \n\nYou sound like just as big an asshole as OP.", "Wtf??! She’s a 13 year old CHILD!!", "The part that he doesn’t let her go to school is an additional failure in parenting, not a reason for her to do all of the housework. He is trying to completely sabotage her future.", "actually terrifying... \n\nIt sounds like OP is viewing her not as a child, but a future partner that he's trying to mold to his tastes. CPS and the police need to be involved... OP sounds creepy.", "INFO: why? So she can be your maid?", "If she’s being homeschooled but you aren’t home, who’s schooling her?", "So you dint parent your child, you don’t teach her, you provide her with no socialisation opportunities, and you dint cook or clean. You do nothing for you child except provide a roof over her head, and you expect everything - once again, of a CHILD - in return. Yeah, YTA, this deal should never have been made. Your daughter needs a better living situation pronto. Shoe needs school and social opportunities, and to not be forced to be an indentured servant to someone who isn’t looking out for her interests.", "She schools herself.", "How the fuck is she homeschooling if you're gone all day?", "So your 13yo CHILD is home alone all day (ie, not in school or being socialized), just moved into to a new place where nobody knows her, and is responsible for all chores? \n\nSounds like somebody is pretty close to having a child bride.", "Info: Who is homeschooling her?", "Then she is not home all day doing nothing!!!! She is going to school. If you keep your crap up you are going to lose your daughter......major YTA", "Being homeschooled =/= at home all day doing nothing", "I absolutely do not trust that you’re doing a great job homeschooling this child.", "You can't say she does nothing all day of she is homeschooled. She ks thirteen. Stop trying to raise a maid and take care of her like a father.", "If you work all day, who is home schooling her? Why is she left all alone and not in actual school?", "Still, she’s a thirteen year old child. She’s not your maid, she’s your daughter", "Soooo she isn’t sitting around doing nothing she’s doing her school work. YTA", "Then why did you say she's \"doing nothing\"?", "So she is not doing nothing. The thing is, you are in a difficult situation and I get it. The problem is, none of this is her responsability and trying to make it her responsability won't help. What you could have done is talk to your daughter, explaining the situation and tell that, it is unfair but you need her help and you need her be part of the family. Not impose deals on her. She's not your roomate", "If you are at work all day who is homeschooling her? Homeschool implies there is an adult in the home that takes care of the curriculum and helps her with school. Who is doing that if you aren't home all day?", "Homeschooled??? Alone? Online? That’s not right! You have to let her go to a school. This is very very baseline. You are not doing right by your daughter. Please step up!", "I hope she goes no contact with you later holy", "I'm doubling up on my YTA after reading this. You are just a bad parent.", "I work from home as a fully grown adult, and I don't always have the time to do housekeeping type stuff. I've also benefited from being in my 30s, knowing how to cook and clean. If I were a 13 year old, I think it would take me much longer. She's learning- at school, living skills. She shouldn't be expected to be the full-time housekeeper.\n\nYTA, OP.", "This is not homeschooling (I was homeschooled k-12.) Homeschooling includes parent involvement. Parents teaching and raising their children. You're daughter may be doing an online school.program but she is not homeschooling.\n\nShe is also not your servant. When we were in middle school and high school my brother and each had some chores (cleaning a bathroom every 2 weeks, cooking for the family once a week, helping with dishes and trash etc.) but those were to teach us life skills not so we could be our parents' servants. You are treating your daughter like an adult partner. She is not am adult. She is a child. Her responsibility is to learn. Your responsibility is to teach her life skills and make sure she is able to actually enjoy her childhood. Look up adultification and get both yourself and your daughter into therapy to rectify the situation you have created. Your daughter shouldn't have to be advocating for herself to her parent. You should be advocating for her to the rest of the world.", "So she is left alone all day, she has to teach herself, plus clean up after you, plus cook for you?You are a piss poor excuse of a parent.", "Dear lord, so she has to the teaching+learning and all the housework?? You are giving her way more responsibility a gir her age should have. One thing is to ask her to do the dishes, but all the cleaning and the job to teach herself is really harsh. Your child will likely develop a lot of issues if you keep it that way\nEdit: grammar", "What is her plan for after graduation?", "So you won't cancelled the deal to\" teach her responsibility\", while not assuming *your* responsabilties as a parent.\n\nShe is only 13 ! And she is working all day to teach herself because you abandoned her, but you are not even willing to canceled the deal and let her be a kid !\n\nSince when are you trying to use her as a maid for the whole family ?", "So she is responsible for all her schooling with no help from you. Looks and cleans after herself and you expect her to look after you and do your share of house hold and parenting responsibilities when she is already doing the lions share....YTA", "So you are NEGLECTING her!", "I think the fact he is socially isolating her and isn't even around to check on her mental health is another huge reason to bring CPS into this.", "You are actually going against the rights of children outlined by the United Nations. They don't condone slavery \n\nGood on you", "She’s not “doing her share” though. She is doing all of it.", "“Her share” as a 13yo is more than nothing and less than everything.  At that age I was responsible for my own room and to pick up after myself plus around 30 minutes of additional chores on weekdays and an hour on weekends.  My brother and I did the dishes for the family without a dishwasher, and that was the major chunk of weekdays - we also all had 1 rotating chore, caring for the pets or daily tidying of bathrooms or the general “spiff up” person.  Weekends my parents made a list of chores, set a timer for 30 minutes, and we all (including them) worked on that list until the timer went off or we were done.\n\nEven when I get busy now, I look to simplify meals - get a crockpot or throw together sheet pan meals to take that off daughter’s shoulders most days, and maybe have her do 2 days a week.  Give her some specific chores to be responsible for, but not everything.  Find another solution - she’s a young teen, not an adult partner.", "Why won't they hire a maid or a housekeeper? These types of people love to take advantage of their children's 'help' in the name of responsibility. A thirteen year old cleaning her room and cooking for herself is enough. She should be concentrating on her studies without getting harassed into being a maid.", "You're an idiot. This is an \"I made an adult decision to have a child with someone, and I shouldn't expect my accidental creation to take care of me\" situation. In the animal kingdom, animals don't have kids to take care of them, they have kids to extend the existence of their species. Humans do the same, except some of those parents don't have the proper instinct to raise those kids until they are capable to take care of themselves. And some decide to have kids to make sure they're taken care of when the get old and incapable. \n\nSorry \"western civilization\" focuses more on raising their kids to take care of themselves, rather than raising them to take care of their own obsolete and aging asses.", "No worries! Just switch rooms and then she can do what she wants. That is the lesson that needs to be learned. Not cleaning the house!", "When I was 13 my chores around the house were feeding the chickens, mowing the grass, pulling the weeds beside the house because back then we didn't have weed eaters, splitting firewood, and stacking said firewood. In Return for that I got a place to live, food to eat, clothes to wear, and the lesson in how to be a man from my dad. I'm thankful everyday that he taught me to work hard, taught me the value of hard work, and taught me how to do it without bitching. If she can cook for herself but refuses to cook for anyone else, that's not a labor issue, it's selfishness. If she refuses to help clean up the house, not paint it, not do woodworking or plumbing, but clean, then that's not labor issue just laziness. This is a selfish and spoiled child who needs to learn the value of work, and keeping her word.", "This is exactly the feeling I got from his post. It's disgusting. He's treating her like a live-in girlfriend, not his barely teenaged daughter. All for the privilege of a \"master bedroom\" which honestly, if she never leaves that house she deserves all the space she can get. And then he pretends he's being a good parent and teaching her a lesson by not letting her switch rooms to get out of being his slave.", "No she’s not a maid nor do I want to make her one she is homeschooled because I don’t think schools are safe (school shootings) and she also isn’t very good with making friends so I’m scared she might be bullied", "This is my question!!", "Child bride! Ding ding ding", "Good question! Poor girl seems very isolated and alone.", "By then he will have had her so isolated, uneducated and dependant on him that her only option is to continue living with him. And as much as he is isolating her and keeping her uneducated..because that is not home schooling....he is grooming her to be his wife.\n\nEdit you are criminally yta", "And what does he mean by ‘she does nothing all day’ ?", "[removed]", "We must have read two different posts. I see nothing about him asking her to do it all. I see him holding her to the deal she made. A deal she made in order to get something that she wanted. And besides, having been a stay-at-home dad at various points throughout my life, I can tell you that it's not really as hard to cook and clean as people would have you believe. One good cleaning on monday, and the house stays pretty well tidy if you keep it picked up the rest of the week. Two, maybe three meals a day is not that difficult, or time consuming. It only becomes a problem in sitcoms, when they milk it for laughs.", "We must have read two different posts. I seen nothing in there about doing everything. I do see where he made a deal with her to give her the large bedroom if she cooked and cleaned. And she has went back up on that deal. The best thing he could do at this point is to switch back, still make her do all the chores, teach her how to be responsible, and show her that there are consequences for going back on your word. You sound like you survived it well enough, with no long-term ill effects. My guess is you can understand the need for a child to have some responsibilities. When he starts asking her to rebuild car engines, lay block foundations for an addition to the house, and go out and cut a hay field with a hand sickle, then I'll agree he's went a bit too far.", "Read the end of the post. OP won’t allow her to switch rooms. Dude’s a complete AH.", "You do realise that the chores you listed doing at her age are a lot less than what she has to do, right?", "> she also isn’t very good with making friends\n\nGee, I wonder why /s", "So… instead of being a parent. You make her stay at home and socially isolate her. This depriving her of learning the skills to make friends and deal with bullies? \n\nAnd then you say “she does nothing all day”? When she’s doing school work? \n How is she going to survive on her own when she’s an adult OP?  Or are you hoping she stays with you forever cleaning and cooking? \n\nYou are a bad parent.", "She isn’t good at making friends because you have completely isolated her.", "Isolating your kid for your own unhinged and illogical anxiety coupled with everything else is giving me abusive mom vibes", "If she isn't good at making friends, homeschooling is gonna make it waaaaaaay worse.\n\nYour poor child.", "YTA. So you socially isolate her and take the role of caretaker to you when you are her parent. This is very close to abuse. I had parents like you and now I have very low contact with them. Get ready for your future.", "You don't let her go to school because you're scared she might be bullied?\n\nThis is such a terrible message to send her", "You should take care of your fucking house and let her live her life.\nI hope she is able to move out as soon as she can because if not she will have no live and will be FORCED to be your maid.\nGROW THE FUCK UP AND LET HER LIVE HER LIFE, BASTARD!", "You are a terrible terrible parent.\n\nIt is your job to ensure that she is getting a good education. And letting a kid learn by herself online is not the way.\n\nAlso it's your responsibility to provide a clean house and food to her. She is not responsible for cooking and cleaning after you. You should be thankful that she cleans her room and fixes herself food. \n\nDo better", "That stood out to me too. Like, a thirteen year old should be in school at least half of the day. I think it’s ok to expect her to clean her own room and bathroom and maybe vacuuming shared spaces once a week but everything else is on OP as the parent. The daughter even cooks for herself and cleans up afterwards so why is OP even complaining?", "Sorry, it's not a little cleaning and cooking\n\nIt's being forced to take care of the entire household because her parent is neglectful \n\nShe is being forced to act as a caretaker in return for room and board, in a scenario where she can't leave (in civilised society that is slavery if not just straight up abuse) \n\nHate to break it to you, but keeping a child from receiving an education so they are your servant isn't normal", "\"People out there have it worse so no one is ever allowed to complain\" bullshit. Abusive behavior is abusive behavior no matter if it's small or excessive. Stop excusing OP for being a shit parent.", "If he's asking her to even clean his bedroom and bathroom then what exactly is he doing so she's not doing it all?", "Mate, he’s asking her to clean his bedroom and personal bathroom, and basically do everything. Shes 13 and his daughter.", "If it’s not that hard than OP (the actual parent, who chose to have a child) can do it.", "He literally said in the post he expects her to do all of the housework and cooking including cleaning his own room and bath room.", "Are you daft?", ">We must have read two different posts\n\nI'm not sure you actually read anything, tbh.", "\"You sound like you survived it well enough, with no long-term ill effects\"\n\nBro, you ever heard of therapy?\n\nAlso, just because you learn to cope with long-term effects doesn't mean they don't exist.\n\nThis is at best neglectful, at worst emotional incest.\n\nStop using your eldest daughters as a substitute parent/partner????\n\nWhen he starts cleaning up after himself, then I'll agree she's going to far.", "True. This situation sounds horrifying, the poor kid. Kids who are actually home-schooled usually have a parent teaching them and helping them with work, often there are siblings around, and home-schooling parents organize groups that get together and go on field trips, etc, so their kids can socialize with each other. The situation OP is describing sounds crushingly isolating and lonely to the point of abuse.", "Except, he is the dad.", "Yes, yes they are. I've been reading their replies, and I think there are some major issues in their life.", "YTA for expecting a 13 year old girl to do all the cooking and cleaning for the both of you.\n\nI taught middle school for several years. The fact that you have a 13 year old who cleans up after herself at all is astounding. But she is a child, and it is YOUR responsibility to take care of HER, not the other way around. As for the agreement you made, developmentally, 13 is not an age that understands long term commitment. She heard the terms of your deal, imagined herself doing chores or cooking every now and then and thought “yeah, I can do that”, wanting the bigger room and feeling like it’s not a big deal. An adult knows what a grind it is to do basic house chores and cooking every day because, unless you’ve got staff for that sort of thing, we all have to do it. Holding a 13 year old to an agreement that she wasn’t developmentally able to fully understand is cruel.", "YTA \n\nYou don’t have a daughter, you have a slave and on top of that you are isolating her, you should be ashamed of yourself. Don’t be surprised if she runs away from home or goes NC when she turns 18\n\nPull it together man and start acting your age and clean after yourself and cook dinner for both of you at least half the time", "YTA. 13 year old should not think about your problems.", "mate at what point did you lose perspective and  stopped seeing your daughter as your daughter. She needs to go to school, and you need to suck it up and be the parent who takes care of her.", "YTA. You shouldn't be trying to give a child adult responsibilities. There was no way she was ever going to keep to that agreement and it's bizarre that you thought she would. Again, she's a child.", "You’re the parent.  These things are NOT your kids responsibility.  Helping out and age-appropriate chores? Yes.  Running a household? No! \n\nStop parentifying your child.  YTA.", "She’s 13!! YTA. \n\nWhy is she home all day? Shouldn’t she be at school?? \n\nShe is a child, you are the parent. We are all tired after working but we still have to feed our children and clean our houses.", "YTA she’s not your mother. She’s too young to be looking after a full grown human. You’re the parent, I strongly suggest you be a parent.", "You sound like you're talking about a wife not your 13 year old child. YTA.", "YTA, seems like you don't want a daughter but a built in maid. Also your idea of homeschooling may reck her life later on, especially if she starts agreeing with you that it means she's doing nothing all day. Get her a tutor and be a good father to her cause your failing at that right now", "She's not being lazy... She is a freakin 13 year old you are asking way too much from her.", "ESH, I get having her wash dishes, clean kitchen and living room but having her clean your room is too much. At 13 it is good to have her help around the house and instill that in her but to have her cooking everyday is to much, I thought you would say once a week. Also you shouldn’t have made no deal, she’s the child, assign her some chores let that be that.", "YTA... She's 13. She should not have this responsibility. One or two days a week.... Ok. But not every day.", "YTA, she's 13!!!!", "Yta. I know someone who's dad did exactly this to them, except he placed them in a small room. It's not your child's job to clean up after you, its not your child's job to take care of you. You're lucky she even cleans up after herself and cooks for herself because some teens don't. You're on a straight path to her not talking to you again once she turns 18.", "YTA in every possible way. Send your daughter to school and hire a cleaning service", "YTA. But just to be clear, CPS doesn’t come out for parents who treat their kids like servants guys 😭😅. MAYBE for neglect (strong maybe). \n\nBut anyways, you are a shitty person for putting this on your daughter. So what that you have to work long hours and have medical issues. If you can work, then they obviously aren’t that bad. Therefore, suck it up and be a parent. OR, leave her with family because she’s probably better off. You are teaching her that her only role is to take care of a man. If you had a son what would you expect out of him? You should be grateful she decides to keep her space clean and knows how to feed herself. A lot of 13 yr olds are incapable of that.\n\n**I just saw the comment about her being homeschooled, WOW! She obviously isn’t doing anything based on your post. You should really be ashamed of yourself. You are completely robbing her of a decent future. You must want her to be a mooch like you when she grows up. I hope CPS is called for obvious neglect.", "she’s THIRTEEN. god you suck. what do you mean she’s home all day? doesn’t she have school? you’re the parent here ffs. YTA.", "YTA. That’s your daughter, not a maid. Screw this manipulative deal you’ve made, that girl deserves her childhood, not to be forced into a caretaker role for her own damn parent. What is wrong with you?", "YTA for making a kid bear an adult’s (your own, no less) responsibility. \n\nShould she do chores? Yes. Should she be responsible for what sounds like the whole household? No. I get that you’re having a hard time, but so is she. And she is a kid. \n\nBE HER DAD, NOT HER WHINY ROOMMATE.", "YTA\n\nIt's too much to expect of a 13 year old.  Be thankful that she looks after herself and keeps her own room clean.\n\nYou say \"she’s home all day doing nothing\" - does she not attend school and have homework to do?\n\n>I feel like I might be the aita because I won’t allow her to go back on the deal and switch bedrooms just so she doesn’t have to take care of her responsibilities.\n\nThese are not **her** responsibilities, these are **your** responsibilities.  It may be difficult as a single parent but you are responsible for looking after her, yourself and your home.", "YTA -\n\n Shame on you.\n\nShame on your family.\n\nShame on your cow.", "YTA - it’s a lot of responsibility to take care of a whole house and it shouldn’t be carried fully by her. If she can keep the house and her bedroom clean I think she’s doing a fantastic job! To even suggest that her intentions with cooking are malicious is rude. She’s probably still learning to cook and she doesn’t have anyone else around her to help. Along with that it shouldn’t be her full responsibility. What I’ve seen it usually doesn’t help the father-daughter relationship and only causes estrangement. \n\nI also think there is more to the story than you’re sharing on why she doesn’t want to clean your rooms.", "I'm sorry you're struggling as a single parent but YTA.\n\nSo she's by herself all day, having to teach herself the school curriculum with no help, then has to make sure all of the cleaning and cooking is done?\n\nDo you even hear yourself? Does she have ANYBODY in her life who cares about her or who she can speak to? Do you let her have friends? Or is she completely isolated until you return\n\nShe's like a victorian housewife, jesus christ. You're ruining your daughter's life here.", "To do all of the cooking and cleaning is a lot for a 13 year old. It’s good to give her responsibility and chores, but not this amount. If you told her that she has to help with the cooking every day (except when she has some activity or meeting friends - there has to be time for that as well) and be responsible for cleaning the floor or bathrooms or something like that, that would be more fair. You can’t treat a 13 year old like an adult. Also, if she is homeschooled, she’s not ”home all day doing nothing”. She is (or should be) home all day doing schoolwork. YTA for making an unreasonable deal with a child.", "YTA - she is 13! You are the parent. Sure she should be helping out with chores and cooking now and again but you basically have her down all the cooking, cleaning and parenting. I’m assuming she is at school so studying and not just sitting at home all day. If this were like “while she is on holidays” kinda shtick I could appreciate it a bit more; though still a heavy load your putting in a barely teen.", "YTA.\n\nShe’s 13! Unless your child is somehow not in school, she doesn’t sit around doing nothing all day! She goes to school, has homework, and is, you know, a child. It SHOULD NOT be her responsibility to manage your household and clean up after you. You’re a grown adult. Pick up after yourself!", "NTA everyone in the house should participate in keeping the house clean and cooking meals. If you expect her to to all the housework then YTA.", "She's thirteen. That's too much to ask. YTA", "NTA, as long as you’re only asking for a reasonable amount of the house work to be done. I will tell you in my household there are two parents and five children. Seven people. Seven days in a week. Each person has one day per week they are responsible for making dinner for the family and doing dishes afterwards. \n\nIt’s reasonable to expect all members of a family unit to contribute to the household in a meaningful and fair way.", "I N F O. Are you the parent or is Emily? Because so far I’m hearing that she has to clean the house, cook all the meals and TEACH HER DAMN SELF THROUGH HOMESCHOOLING… sounds like she’s more of a parent than you are. You work and do groceries (I hope) but I wouldn’t call that being a parent.\n\nYTA. Grow up and act like a damn adult. Your daughter does not deserve to be treated like a servant by the only parent she has.", "INFO: You said she does nothing all day. You also said she's homeschooled. Who is homeschooling her? You're at work. She can't teach herself, that def would not be legal.", "YTA.\n\nWhy is she 13 and not in school?! You said she is home all day but she should be half the day in school at least and the second part doing homework + sport.\n\nYou decided to have a daughter now act like a parent. She is not your servant.", "YTA. You are a grown ass man complaining that his *13 year old* daughter isn't doing all the cooking and cleaning at home and think you deserve to have her do all the household chores because * checks notes * you go to work? Not to mention you're complaining that she wasn't cleaning up after you when you guys were staying with family??? I'd love to hear what they have to say about their brother/son/cousin getting his food and shelter provided by his family and then having the gall to expect his child to do his share of the household chores as well.\n\nYour daughter didn't ask to be born. If you want someone to clean up after you, pay for a housekeeper, don't make a literal child do it.", "I don't understand the posters saying YTA. Of course you're not. There's absolutely no reason your daughter can't help out. Good lord. It's called having chores. A lot of us had them growing up. And suggesting people call CPS because she's being asked to do them is outrageous.  Good lord. You're not turning her into Cinderella. My suggestion is you need to claim that main bedroom. And tell that kid to do her chores. A 13 year old can have the regular bedroom. You're the adult. You pay the bills. Stop spoiling that kid and parent her.", "Just give me your info so I can call your local cps and tell them how you can’t care for your own damn child .", "FFS. Put your kid in school and grow up. You're selfish and disgusting. YTA", "The more you read this whole situation the more concerning it is. \n\nHe’s:\n-Isolated her from other children and other adults to “protect her from the outside world”\n-House jumped with her from a young age\n-leaves her all day while he works, alone to school herself\n-Expects her to cook and clean all spaces in the home to be able to keep her private space with her private bathroom. \n\nI’m starting more and more to hope this is a fake post and if it’s real someone needs to get this girl out of that house she is not ok and because he’s made this normal and isolated her from other children she doesn’t know that it’s not normal. Someone needs to check on this Kid. Whoever they were staying with during their couch surfing should be checking on this kid.", "YTA This is not home-schooling, your daughter deserves an actual childhood more you deserve an unpaid child maid. \n\nWhich, to be clear, no one should have an unpaid child maid to isolate and manipulate but you appear to believe you don't have to parent or care for your child and there is nothing disturbing about teaching your daughter that love is conditional on tolerating mistreatment", "NTA. You are the breadwinner, take back the master bedroom \nThere is nothing wrong with giving your daughter chores but she shouldn’t have the whole responsibility of the house at 13.", "NTA, I was going exactly the same thing at her age because my mum worked stupid hours (6am - 2pm, 10pm - 6am but then it changed to 6am - 6pm) and I went to school, came home, chilled for an hour and then got on with dinner for myself and always left my mum a portion so that she could heat it up in the microwave when she got home. You are teaching your daughter important life skills and she will later thank you for it. I certainly thank my mum for that as now at 24 I don't live at home and I can easily take care of a house if I need to.\n\nI really don't get all the people saying YTA I really don't. This was a key development moment and I am forever grateful to my mum for that.", "This post gives me chills. Why she not at school? Why do you want her to be your slave? Cleaning your bathroom?? Gross- somethings way off here. I hope I’m wrong and there’s no other abuse going on, but he’s giving me the creeps.\n\nYTA", "AND SEND YOUR CHILD TO SCHOOL", "She probably makes shit food because she's 13 years old!\n\nHer dad has clearly never helped her learn to cook and he doesn't mention anything about her having cooking classes at school or with other family members. Poor kid is probably doing the best she can and still getting scolded for it", "6. Get her involved in outside activities! She needs to find friends and most cities have homeschool meetups, sports, game nights, etc so that kids can be with their peers!\nShe needs interaction with other kids for her own development.", "She's not going to school and doesn't have a social life because OP claims she doesn't get along with other kids and is afraid she'll be bullied and he's afraid of school shootings. \nHe's posted some comments, he claims she's homeschooled, but that consists of her staying home alone each and every day and taking a couple online classes, he's a grade A jerk!", "Yes the deal was she takes care of all the cooking and cleaning for the both of is in exchange for the bigger bedroom", "What does she need new clothes for? This ah keeps her home and isolated all day, allegedly doing “school” and her chores. She has no friends, no social life, nada. She is the embodiment of Cinderella but with no mice to cheer her up.", ">I work long hours and I am usually too tired to come home and do all the cooking and cleaning after a long day of work.\n\n&#x200B;\n\n>She is homeschooled\n\nHow is she home schooled if you are out all day at work?", "Uhhhh, she's homeschooled but you're not there and she's home alone. That is the most ridiculous thing I've ever heard about education in a long, long time if not ever. If she's homeschooled there needs to be a tutor or teacher (often a parent or guardian) there to actually educate her. So either she's in online school (not homeschooled) or you're actually keeping her out of school and away from education. Whichever one it is, you're an AH!", "Then she's not \"doing nothing all day\" YTA", "You're worse than a man with a stay at home mom as a wife.\n\nYTA - hire a maid if you dint want to clean, but putting it all on your CHILD like this is abuse.", "How is she home schooled if no one is with her?? If there’s no one there teaching her anything then she isn’t home schooled.", "How is she homeschooled If you're not there?", "Are you religious? This is grooming territory imo (expecting “wife duties” of your female child, holding her to “agreements”)", "I am a teacher to 13 year old. She does not teach herself stop being ridiculous. Every high school teacher knows that students proved during lockdown they can't self teach", "WHY???? Why a kid is not going to a regular school?", "Unbelievable.  So what exactly do you feel like your responsibilities as a parent are, if any?\n\nYTA x 1,000,000", "Your parenting is lazy and neglectful at best. Shame on you. YTA", "This is child abuse. And then some. I wish I knew your real name and location so I could call CPS and the police on you. You're a horrible excuse for a parent.", "I feel so sorry for your child, having to act like a servant to you. You're the adult, get off your ass and cook/clean. It's part of being a parent.", "Send her to school!", "This is exactly how i grew up. I was home “homeschooling” (teaching myself online), cooking, cleaning, and babysitting my 3yo sister. It was never enough - they were constantly telling me i owed them more. \nWe don’t talk anymore, they don’t know my kids. Thankfully, your daughter sounds more headstrong than i was and hopefully that means she won’t tolerate your bullshit as long as i did. YTA, but speaking from experience you probably don’t care.", "I don’t think anyone has pointed out that OP has been fighting with his 13-yr-old be a maid for a while - “we’ve had a lot of arguments” and “she refused to clean up for anybody (not even me) but herself when we lived with other people.” So this is a pattern of behavior on OP’s part. Who knows how long this poor girl has been treated this way!", "Yeah that's absolutely not a responsibility she should have. Sure she agreed to the deal surrounding that but she is a child and should not be the main maintainer of the house. Having alternating nights where both of you make dinner and splitting general chores is how most families do it because it reduces the chores for the parent but also still let's the child be cared for. \n\n\nThe child doesn't need to earn her keep by doing chores. I understand that you are asking if YTA for going through with the promise and you're not really, there's no real reason for her to have the master bedroom. But she should not have those responsibilities as a child and even as an adult that would be putting too much on a person. \n\n\nI may be reaching here but it gives the feeling that you are expecting her to do these big things because she is a girl and you bring the income. It may just be inexperience or misunderstanding but if you were to convince her to completely manage cooking and cleaning the house then in the future she would be slaving away after her family based on these values and not prioritise herself. \n\n\nMaybe look into getting advice from other parental figures in your life? Whether that is your own parents or you child's friends parents.\n\nEdit: just reread your post and realised you're not letting her move rooms to not have the master bedroom and no Ionger have those responsibilities so yes, you are absolutely in the wrong even in that aspect. You are the one breaking the promise by not letting her go back.", "In absolutely no defense of OP because they’re clearly the AH here, I will say at her age I was homeschooled too. It was video classes and other than occasionally grade my tests, I homeschooled myself…..because I had a similar dad to this poor kid.\n\nThe point of my comment was to say it’s entirely possible to homeschool when OP isn’t home.\n\nHe’s still an AH.\n\nCarry on.", "That’s what I was thinking too. It wasn’t her fault they had to live with other people and it certainly isn’t her responsibility to repay these peoples kindness with her cleaning and cooking for them. Why is she not in school? Why is she being expected to have all the what I can only call “woman” responsibilities in the home. Cook and clean? He’s calling her lazy because she’s not (let me get this straight) staying home all day to cook for and clean up after her father? Something is really not right with this situation. Sounds like she hasn’t had much of a childhood as it is. Get her in school, get her some friends and give her a break. You do not hold having a roof over head (which is 100% your responsibility as a parent) to have her be your servant.", "You realize if she is homeschooled you should be there teaching her right? You don't just leave the kid on their own to figure it out. \n\nI feel awful for this kid. You are failing her in so many ways but are too focused on yourself to see it.", "If you want her to do all the cooking and cleaning she actually is a maid. Or no, you're right, not a maid, since you don't pay her a decent salary for it but only provide a place to sleep, she's actually a slave. Congrats asshole, 156 years after slavery was abolished, you still managed to get yourself one.", "maybe she is bad at making friends because's shut in an apartment all day with no social interaction.", "You DO want her to be your maid, and personal chef! To the point if th8nking she should clean YOUR personal spaces! \n\nYou've isolated her from other people,  how is she supposed to make friends??\n\nYou are looking at a future where she gets away from you as soon as she possibly can. We can only hope it's not into the arms of a different older man who wants to exploit her.", "Somebody desperately needs to call CPS on you. You are severely abusing your child.", "That really sucks for you, but in that case you also weren't properly homeschooled. Real homeschooling is at least as intensive as regular school. With outings and socializing as a core part of your education while possibly the basic classes can be done online.", "Why tf should she clean HIS bathroom? And cook for both of them every day? Her doing everything is makinf her a maid, which she is not. She is a 13 y.o. child", "Oh yeah. 100% agree. I’m just ASSUMING OP has something similar set up for his kid.", "Indeed. Some weird idea of fathering", "I am very concerned by this story and all info that OP shared. Is there a way to find him and save this child ?", "…. She’s 13", "YTA\n\nStop treating your daughter like a maid,  I'd even say your treating her like some stay at home wife.\n\nHow did you think you'd get any agreement here.\n\nYou daughter is right, its not her job to look after you and clean up after you, thats your job as her parent.\n\nAnd if anyone is the lazy person here, it's you. Clean up after yourself", "[removed]", "YTA ...... stop making your daughter pay for your short comings !! And I don't mean your health issues !!", "YTA. Take care of yourself! You’re the adult. Also, she needs to be in school. Sounds like you’ve isolated her 100%", "YTA. Your daughter is 13, and still in school. It is not her responsibility to take care of the house and the cooking. It is her responsibility to get an education and have FUN. At 13, I think keeping her own room and bathroom is fine, and *occasionally* cooking dinner, but expecting her to clean YOUR room and bathroom(plus the rest of the house) as a grown ass adult is weird. You’re calling her lazy, but the only lazy person I see here is you, OP. Pick up after your damn self.", "YTA I grew up in a very similar situation and still resent my mother for making me clean her room and manage the household my entire childhood, whether she had to work or not, I was a child and she used me. I suspect that the same thing will happen to you.", "YTA", "Dude. It doesn’t matter how tired you are, you are the parent. Clean the damn house. If you can’t, find a housekeeper to clean it once a month. It isn’t her job to keep the house, it is yours as the adult. She does need to keep her area and clean up after herself but not you. This sadly makes why you all were in a bad situation a lot of sense. I’m sure you have days off and this can clean up after yourself. YTA. Stop parentifying your daughter! YOU ARE THE PARENT.", "YTA\n\nLiterally the only thing I could say while I read your post is SHE IS THIRTEEN. She is also not your spouse, she is your CHILD. Should she have household responsibilities? Sure, that's just good habit building. But she is NOT responsible for your entire house dude. That's literally on you.", "YTA. You are the parent, and your kid is 13. Sure she should be keeping her room clean, and not making a mess. But she should not be cleaning your bathroom, or your own room, nor should she be cooking for you every night. You are an adult, working or not you can clean your own room and bathroom and make your own dinner. Many many people are single moms with health issue and still make it work. Your daughter is not your servant, she is only a child once, don’t take that away from her. Time to grow up and do your own cleaning and cooking.", "YTA - sounds like you need to hire help. She is a kid. She is not sitting at home all day doing nothing…she is being a kid! Grow up!", "YTA she is your *daughter, a child*, you are her *parent, an adult* be the fucking adult and *take care of yourself and your own kid* she’s not your fucking maid or servant, she doesn’t *have* to cook or clean for you, that’s not her responsibility, it’s *yours* as a parent jfc", "YTA\n\nI can’t believe a grown man sat here and wrote this. she’s 13 not 30 and doesn’t deserve all that extra ridiculous responsibility. be a parent and do your job that includes cooking and cleaning up after yourself and her because she’s a child.", "He thinks the 13 yr old makes bad food on purpose 🙄, dude she’s 13. Also, cooking and cleaning doesn’t mean personal spaces. YOU clean your own bedroom and bathroom. That’s just gross. She can cook and clean in kitchen. But remember, she’s a child it’s her job to HELP, not do it all. As the parent it’s your job to cook and clean and teach her to cook better, FOR HER HERSELF AND HER LIFE SKILLS. Not to be an indentured servant.\n\nYa Yta.  Parent her, she’s not your wife/girlfriend.  She owes you nothing, she’s a teenager.", "YTA. You made a deal with a child in which you expect her to be the parent. I get that you have medical issues that makes you more exhausted, but that’s not an excuse to want your child to take over the responsibilities of care that she should be receiving from you…for a bedroom. She is a child. Her job is to go to school, get through puberty, and be a child. This doesn’t mean that she shouldn’t have responsibilities, but she shouldn’t be the parent here. She’s not a chef nor a maid. She is a child. It’s time that you reassess this situation. Work with her to come up with reasonable chores, and then you find a way to step up to be the dad.", "Yta - this one made me really sad for the child.  13, no friends, no school, no outside activities, isolated in an apartment and expected to do all the cooking and cleaning, including his bedroom? What a childhood.", "YTA", "YTA my 12 yo does 1 chore a day to contribute to the running of his home. That can be making a simple meal like pasta or eggs, putting on a wash or helping with a larger task such as cleaning the bathroom or kitchen. It’s no more then 20 minutes a day. That’s fair. Your daughter isn’t responsible for you and your health. This coming from a wheelchair user. She is NOT YOUR CARER.", "YTA. it was never her responsibility to clean up after family/friends regardless of living with them. as her PARENT, you definitely should have NEVER made that deal with her. asking her to help from time to time is completely different than expecting her to do your chores regularly.\n\nprep your own meals on your days off. get a slow cooker and throw it in before work. you can also find plenty of quick and cheap meals to make that won’t take long if its prepped for you in advance.\n\nfigure out a cleaning schedule for yourself. take on little tasks like wiping down the sink area when you have a chance. clean the shower once a week. little by little you’ll notice a difference.", "YTA. She's 13. Not a mother.  Not a wife.  Guess what.  Parents are always tired.  It's always a lot of work.  You are at least fortunate to have a 13yo who can and will take care of herself. She shouldn't have to take care of you or anyone else.  At 13, she shouldn't HAVE to take care of herself honestly. Figure it out bud.", "YTA. She’s a kid not a fucking maid. Give her the smaller room and man the heck up.", "YTA\n\nYou expect her to cook and clean everything, homeschool HERSELF and don’t let her have any friends? Beyond you being an asshole, you are stunting your child’s development HORRIBLY. The isolation, lack of proper education and constant disrespecting of her boundaries will make life as an adult incredibly hard for her. You are actively ruining her future. You cannot do this to your daughter. I understand it’s hard but right now you are failing at being a father. Get help asap before this situation gets worse and you lose her forever", "YTA and I feel awful for this child who’s isolated at home while you try and make her cook and clean. You’re the parent. She’s the child.", "YTA. Enroll her in a public (free) local school. SHE IS A CHILD. YOUR CHILD. NOT YOUR MAID OR SOME 50s TV VERSION OF A HOUSEWIFE. You want her to CLEAN YOUR BATHROOM??? That’s lazy and disgusting of you. She is not home all day doing nothing!! She is studying and should have the opportunity to be a CHILD. You are older and, frankly, terrible at the job of “parent”. Give her a chance at a life of her own. And get some mental health support.", "Wife. What you are looking for is a wife. You are forcing your literal child to take the place of a wife.\n\nYTA. Enroll her in actual school so that she can make some friends and have a future that does not revolve around taking care of you and your needs.\n\nYour actions are at the very least abusive and neglectful, and at worst are bordering on incest. Let your child be a child, and look for a wife elsewhere.", "YTA - she isn’t your maid. You’re tired? Tough shit. I 100% believe 13 year olds can and should contribute, but that isn’t what you’re asking. You’re asking for a servant.", "YTA, she’s not doing nothing all day long, she is *being a kid* all day long. Not your co-parent, not your roommate. Some chores sure, but not your personal chef and housecleaner.", "YTA- she is a CHILD. Your child. You’re upset because she wont clean up after you? You sound like a terrible parent. It is NOT her responsibility to cook and clean for you. She is not your servant. As her parent is Is your job to make sure she eats and has a clean environment.", "Yta,\nShe's a child, not your slave.", "She’s 13. Wtf is wrong with you. She’s not your maid. She’s doing amazingly if she cares so much for herself! She has not responsibility to care for you or others. Don’t take her youth away from her. \n\nYTA. If she’s happy to switch rooms just switch rooms you knobhead.", "Info: why isn't your kid in school?\n\nMy sleepy brain read the comments. She's homeschooled, but the way it's worded it seems it's not through any actual homeschool place, she's teaching herself. \n\nYTA. She's a kid, you're an adult. Your messes are your problem, not hers. Let her be a kid, maybe get her into an extracurricular program so she can make friends. It sounds like you just leave her at home 24/7 because of your fear of schools and her being bullied.", "YTA.  She's 13, of course she doesn't want to cook and clean.  Just switch rooms back.", "Info: why is a 13 year old girl home all day and not in school?", "I hope to god your daughter finds it within her to escape your abuse eventually. \nI do not say this lightly: you’re beyond a bad father, you’re a downright bad person and when you are completely alone in life one day, think back to the hell you’re making your daughter live and maybe you’ll understand why.", "Look, I was completely able to cook, clean, do laundry and even manage a budget when I was 13. But I was never asked to do so. Why is she not in school? If she were a boy, would you be asking the same? How many hours do you work that you cant clean on your day off?\n\nWhen I was 16, my mom would meal prep some stuff and I cooked, cant you do the same? Season some chicken breasts or whatever, put it in the fridge and then any of you simply throw it in the pan when needed. And get a rice cooker. \n\n\nYou are being a lazy parent, it is your responsability to keep your kid fed and clean, not the other way around. YTA", "NTA. This is the age at which one learns responsibility. As long as you aren't expecting her to cook and clean up constantly and it is simply to help you, it should be fine. How about you give her a few chores, such as laundry and vacuuming/sweeping once a week. Maybe dishes a few nights. But she shouldn't need to do a lot more. \n\nMore importantly, talk to her. Tell her you would appreciate her help. And listen to what she has to say too. That doesn't mean you need to do whatever she says. Be the parent.", "I think your deal is reasonable for her space and for shared spaces. But to have her also clean your room and your bathroom? That's going beyond teaching a 13 year old responsibility and sticking to her word.", "YTA . Your daughter is 13, she is not your maid, you may say you’re not trying to make her be your maid but you need to re read your own post ….", "YTA. You're talking about her like she's your partner or roommate. She's your kid. Making her clean after your bedroom and bathroom is just wrong.\n\n>she’s home all day doing nothing \n\nDoesn't she go to school? Have activities? If she's doing nothing all day that's on you. But cleaning after you isn't what she should be expected to fill her time with.\n\nThis whole post make some very uncomfortable.", "Yta she is your 13 yo child. Not your maid, not your chef.  She should not be responsible for cooking dinner every night and doing the majority of the house work.\n\n\nIt's also pretty clear she s 'home schooled' so you can keep her ignorant and servant like. Which she is thankfully pushing back on.  Send her to actual school.\n\nOn a more helpful side, do crock pot meals. Or batch cook on the weekends and then freeze it.", "YTA\nShe's your daughter not a servant. \nIt's one thing to teach her how to cook and clean as all kids should learn this. But she should clean your bathroom? Your bedroom? Nah, you should be setting an example and doing this yourself. \n\nSaying she's home all day doing nothing, she should be at school or at least she should be a child and enjoy her childhood rather than clean up after you.\n\n Be a father and a grown up and stop whining", "YTA. \n\nMy heart breaks for your child and the childhood you're depriving her of.", "YTA - children aren't servants. Does she not go to school? It sounds clear why you are a single parent.", "YTA why is no one advocating for this isolated child. She is going to have zero life skills and it’s like you set her up to be your forever maid and caretaker. What a freaking nightmare.", "Switching bedrooms isn't \"going back on the deal.\" You weren't clear enough with how draining the responsibilities that she would be in charge of would be, she's overwhelmed, and you're refusing to let her take the hit in living space so that she can be less overwhelmed. You've put a thirteen year old in charge of everything in the house and you're wondering why it's going badly. \n\nYTA.", "YTA I actually had to scroll back to check your daughters age, you can’t put such a burden on a 13 year old. You are her parent. Sure she should have some household chores but you want her to do everything and cook for you every day. She’s a child so she’s still in school and isn’t „doing nothing all day“. If you can’t cook and clean hire someone to do it.", "I grew up like a maid. When I was 12 I took care of the entire household. To make everything worse - I lived with my older brother, older step sister, step father and my mother. Aperently, non of them had the time for chores. If I didnt do just one thing from to do list, I would get grounded. So every day I would come home from school. I would start cooking. While the is getting cooked, I would vacum the entire house. Do the dishes (we didnt had a dishwasher), deal with laundary, etc.\n\nOnly \"free\" time i had in one day was after the dinner, then I could chose betwen studying and relaxing. Ofcourse, they've expected from me to be straight A's student, if I had any B, I would still be grounded.\n\nI got so used to it, that most of my childhood I didnt even think about it. \n\nWhen I got in to college, it got worse. I was still living with my family, they still expected from me to take care of everything. But they also expected from me to get a job and be a great student. Eversince I was a kid, my mom would monitor my entire day. She knew how long it took me do all of my stuff and if I had an hour a day just for relaxing, she would lose her mind calling me lazy and useless. Imagine how scared and anxious I was. I knew that my brother didnt had to do half of the stuff that i had, but whenever I tried to speak, no one would care. Not to mention my mother, who would come from work and spend hours just resting. She had free weekends, so she could do whatever she wanted. While I had only 3 hours a week to spend with my friends.\n\nOne of the weirdest things that has happen, was when one day I cooked the lunch, but I didnt do the dishes, since I had to go to a class. My brother was home the entire day and he didnt eat, because the dishes were dirty. I was yell at. So, mentaly, I was in a terrible place. \n\nOver the years, my grades were going down, I couldnt finnish all the classes. And my anxiety was trough the roof. I couldnt sleep, I couldnt relax even for a minute. I was just expecting to hear how terrible I am. It wasnt until I was 26 when I finally realized that I was abused.\nThere were no information on mental abuse when I was a child. There was no one who could stop my family. There was one one to tell me to leave them.\n\nNow Im 28. Still in college. Still doing low paid jobs and still dealing with anxiety. I'm trying to overcome all of the abuse and build myself a better life. When it comes to my family, we are still living together, only because Im not ready to leave them for good. I have agoraphobia and Im not earning enough to live on my own, plus Im paying therapy, cause I realy need it. But things are a little different now. I've set some boundaries and most of the time, im not hurt when they try to lecture me, now I just defend myself. And that is my ultimate goal. Not to runaway and hide myself, but to walkaway fully secure in myself.\n\nIm sorry for my bad english, its not my first language.\nThe point Im trying to make is that you can ruin your daughters life by expecting from her to act as an adult, while she is a child. And eventrough it looks like she is doing nothing all day, it only looks like that to you. Cause, she is still going to school, doing homework and she deserves couple of hours to herself. You are working, but you want couple of hours to yourself when you get home. Its not fair to her. \n\nOnly advice that I can offer you, that could help you with your life is to plan your meals better. Cook more on your day offs, freeze all of the extra meals that you've made. I will not taste good as fresh, but you will have more time for yourself. Cause house chores are not worth the fight. Instead try to be more grateful for having such a good daughter. My brother would rather die from starvation, then make himself a sandwich.", "Yta she is a CHILD. It ISN’T her responsibility to clean up after you or anyone else. The fact that she keeps her own space clean at 13 is impressive. My 13 year old is a trash gremlin", "YTA. Getting a child to clean your room and bathroom? Are you serious? YOU clean YOU cook YOU parent. She's a kid. Of course she can help out but NONE of this is her responsibility because she's a literal child.", "Yes YTA\n\nShe's absolutely right that it's not her job\n \nShe's 13. Her job is to be a teenager not your partner/roommate.\n\nIt's YOUR job to take care of HER. Not the other way around.", "Your poor child, this is not a childhood! It is your job to care for her, not the other way around. Of course YTA", "YTA. I get that it's just the two of you, but you're treating her as a stay-at-home wife. That's not her job. You are still the parent, and she is still the kid. At least she's not leaving her messes and is actually cleaning up after herself. I think you should go back to the parent-child relationship and move her into the smaller room and not expect those things from her. Work on being her parent, not her partner.", "YTA- buy a crockpot to make easy meals and for the cleaning- you can handle your own bathroom and then do chores together \nIf you are unable to do chores now what happens when she’s 18 and is out of there. It is not her job to be the cleaning staff", "YTA - your 13 yo daughter is responsible for cleaning your bedroom?\n\nBet you’d be embarrassed if any friends, family, or coworkers found out, right?\n\nThere’s a reason for that, you are a grown man, clean up your own mess!", "I’m a former social worker and I am nauseous. There are so many blatant and terrifying abuses happening here. You should not have custody of a child and deserve to catch some charges", "YTA she is you daughter NOT your wife or maid.  Kids should help with the Chores but should not do alle of them everyday. And she is in school and does not sit at home all day \" doing nothing\". You are the adult and the parent. Guess what, I also work full time and do all my chores because I am an adult and live alone. It's called being an adult. Like I said, she should help but you are taking this too far.", "You are behaving as if you are living with a roommate/ flatmate and not a literal child. I get it that you are tired but your daughter is picking up after herself and cooking for herself. Anything more than this shouldn’t be expected from a child.", "YTA. You are the adult you clean up. How much of a mess can 2 people make. She can clean her room and bathroom and you are responsible for yours and 2 work together on the common area. But it is your responsibility. Then cooking crockpot meals so you don’t have to cook when you get home. Your daughter isn’t a maid or substitute wife. You are the parent your job is to take care of her.", "YTA She’s 13 the s ain’t the Middle Ages get a delivery, learn to cook abs leave your daughter alone she is not your slave", "There’s nothing wrong with your daughter having chores and contributing to the household but you’re putting it all on her and she’s 13. You are the parent and you can clean your own bathroom.  having her clean her own bathroom and clean up after herself when she uses the kitchen or the living room is completely normal.   She’s not a maid she’s your child.   YTA", "Yta. It's not her job. If you can't manage the cleaning, get a cleaner. If you can't manage the cooking, batch cook and you can just heat it up. \nShe didn't ask to be born, she would help you from her heart if you weren't being such a ah about it. You're on a 1 way track to NC with her as soon as she can move out.\nIt's almost like you're treating her like a wife. That's bloody WEIRD. It's not ok to ask her to clean your bedroom and bathroom, she's not your live in maid/cook. Send her to school and get a grip.", "Dude YTA… she’s a child. Get her enrolled in school don’t make her your servant.", "You mean to tell me that your 13yr old was bribed with accommodation and refuses to become your chef and maid? I’m shocked…said nobody ever. YTA", "YTA. Do you read your entitled, hypocritical attitude the way I do? Your MINOR child is not responsible for easing your medical issues. I am a disabled mother to a 13yo girl and while she does have the responsibility of one household chore (of her choosing), she has that chore to earn her allowance. It is my responsibility to find ways to adapt my environment to suit my disabilities. Putting that on your child will only lead her to feel resentment for you.", "YTA. She is 13 let her be!! But yea you can switch the bedrooms, she did refuse to fulfil the deal. Other than that dude I understand you're struggling but she's just a kid and I think she is helping you enough.", "Yep this is called covert/emotional incest! When a parent tries to make their child fill* their partner/spouse role. He needs therapy ASAFP eta: and it is considered a form of abuse", "My first thought!  Why isn't this child in school?", "I wonder if he would have made this deal with a son….", "She's not in school, she is \"homeschooled\". Not by an adult, he expects her to teach herself all day, alone. Most adults I know aren't disciplined enough to do this for a class, but this kid is expected to do this for her whole education. And then he complains that she \"does nothing all day\" and she should be cleaning for him. It makes my skin crawl.", "I’m wondering if he keeps her from school so she can’t report his abuse or realise that being a slave isn’t normal for 13 year olds.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "\"everyone has chores\" so what are OP's?", "\"he works to support her lazy ass\" THAT'S HIS KID, HE LEGALLY HAS TO SUPPORT HER, STOP ACTING LIKE HE'S DOING HER SOME HUGE FAVOR, IT IS THE BASIC REQUIREMENTS OF A PARENT. he is failing her as a parent.", "Oh okay that's disturbing", "Who is homeschooling her?  Clearly not him.", "So you don’t do any parenting at all and want a live in maid. Gotcha", "1. That's not homeschooling.\n2. Then she's not 'doing nothing all day'", "Okay this took you well over an AH into piss poor parent of the year. As a kid who was “homeschooled” like this, truly screw you. She needs social experiences, she needs a helping hand and guidance in her education, and you need to make absolute sure she has all the opportunities possible for her learning journey. It infuriates me to think that you’re so damn concerned over her scrubbing your toilet but not the least bit with her future. I missed out on so much because I was left to contend with my education entirely on my own. You are a selfish, immature, dusty mess. I hope for your daughter’s sake some of this opened your eyes but I sincerely doubt it. You’re only concerned with making your 13 year old child your stepford wife.", "You are failing as a parent. Enroll your child in public school.", "Homeschooled and online schooled apparently", "She is not homeschooled. She is at home teaching herself. \n\nYou are such a poor excuse for a parent. Actually you don’t deserve to be called parent . You are abusive dna donor .", "You’re at home with her teaching her then? Right? Or does ‘homeschooled’ in this context mean ‘neglected’?", "Why are you putting all the housework on your barely teen daughter? You realize she is a child, right?", "Homeschooling is when a parent stays home all day to teach  their kids. What you're having her do isn't homeschooling, it's straight up neglect.", "Based on your other replies, it looks like you have purposefully isolated her and dictate everything she can and can not do. You treat her like a live-in slave and have such little regard for her, and you are holding this bedroom over her head to basically get what you want. Be an actual parent, look after her. You are failing in that regard already. Fix everything before she decides that by the time she's 18, she wants nothing to do with you.", "Im suspecting she is \"homeschooled\" so she can have time to cook and clean for OP.", "Yikes yikes yikes so much big yikes. This girl it’s going to be in therapy forever for abandonment and parentification. This is abuse.", "Don’t you know that wives are supposed to do the cleaning and cookin with no gratitude or other payment? We shouldn’t even really be votin. \n\n/s", "Your child is 13. THIRTEEN!!! You are the adult, YOU should be taking care of her, and instead you're forcing the role of caregiver on to her! How disgusting and abusive of you! I don't care if you are tired by the end of the day, YOU ARE THE PARENT SO ACT LIKE IT!!!! YTA!", "She's 13. A child. Your daughter. Not spouse. \n\nYTA", "I am very confused. Is she your parent or are you hers ?", "She's a child! Your \"deal\" was inappropriate to make with a 13 year old.\n\nShe isn't your servant.", "I was going to ask if we had enough information that somebody could call CPS.", "He’s says online schooling.", "He said he’s afraid of school shooting", "That’s my question. Has OP answered it anywhere yet?", "you had to do wayyy less chores than she has to. she has to do all the cleaning and cooking, including OP's bedroom and bathroom. she is not his slave.", "Sonsband (this iirc is an actual nickname for forced incestuous relationship where mothers forces their sons to be replacement husband) meet wifeter or daughfe. Whichever it is, it's absolutely very very wrong.", "But he's apparently not afraid of his daughter being 30, dependent on him and have to do house chores like the forced incest wife that she's forced to be.\n\nI'm honestly impressed this 13 year old is very independent and stands up for herself. Knows how to play her father so she gets the benefits too. However, seeing the shitty father's neglect. No wonder she had to grow up on her own.", "Even though US is \"famous\" for it, Americans get shot at churches, concerts, streets etc, so unless he wants to totally isolate her, so she would think it is normal for a child to take care of her parent, his reasoning is weird. But wait...", "Wow what kind of parent are you?\n\nChildren need to be exposed to other kids, that's how they learn valuable social skills like how to make friends, socialize, deal with bullies/confrontation. If she is having trouble with that it's because you have forced her into isolation instead of dealing with the issues like a proper parent.\n\nYou are setting up your daughter for failure.", "This child needs to be removed away from you asap", "Yeah that happens when you socially isolate and neglect a child, they struggle with socialising.", "Of course you don’t want her to be a maid, that would mean you’d have to pay her. She more like a slave who has to cook and clean for you.", "This gives me cult leader vibes for some reason", "I understand the fear however the point in homeschooling is that you are meant to homeschool her"]}