{"id": 454, "submission_id": "ygmrq8", "title": "AITA? My roommate called me a leech.", "selftext": "The autogenerated username is pretty fitting, because I feel miserable. I used to work a really stressful job with hard hours and terrible coworkers. I was also supplementing my income by renting out the third bedroom in my house. The other spare was a guest room/storage. She paid/pays me 700 every month and we used to split the utilities in half.\n\nThings got really bad at work, and I wanted to leave. I decided to clean out the guest room and rent it out. I told my roommate, and she was unhappy, because she didn't want to share a bathroom. I pointed out her share of the utilities would go down, but she didn't really care about that. Anyway, I rented out the room. Not long after I quit my job.\n\nAnyway, my mortgage is 1500 a month, so right now I'm paying about $100 a month plus the rent from both girls and living off of my savings while I look for a job. My roommate noticed I'm not going into work anymore. I told her I left that job and am looking for a new one. She said \"so now you're a professional homeowner, basically?\" I disagreed with that assessment. She said I'm leeching off of her and the other girl because I don't want to work.\n\nI do want to work. It's just that I need to find a new job, and since people need cheap places to stay, renting out these rooms allows me to keep paying my mortgage while I look. My roommate says I'm taking advantage of her, but she chose to move in here. I don't consider myself to be a leech, but she thinks I'm a selfish asshole. Am I?", "created_utc": 1667057884, "permalink": "/r/AmItheAsshole/comments/ygmrq8/aita_my_roommate_called_me_a_leech/", "score": 8649, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I quit my job and am living off of rent from my roommates and my savings. They are both still working, and I have a little time I can afford to not work because they live here. One roomm\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nShe's free to look for a different living situation if she's unhappy with the changes made. Regardless of who she decides to rent from, they will be profiting in some way from their rent payments. It's not like you turned the living room into a private space just to squeeze more renters into your home.", "NTA.\n\nA \"professional homeowner\" is called a landlord.  If you can get people to live in your house and pay your mortgage while you get another job, there's no shame in that.\n\nThey're living in *your* house that *you* bought.", "NTA. Start looking for a replacement roommate.", "Your first tenant rented a room that included a private bathroom in a house shared by two people. That changed to sharing a bathroom and living in a house shared by three people. That's a significant reduction of services, so if you didn't lower her rent to compensate for that, YTA.", "So I have a slightly different take on this. While I think your mental health is important and it's good you found a way to quit a toxic job to better your situation... you did kind of screw her.\n\nPart of agreeing to pay x amount of rent is what goes with it. She moved in thinking there was going to be one other person and having her own bathroom. You decided to change that without actually giving her a discount on her rent - which I think you should, especially with the bathroom thing - and just depended on \"less on utilities\" (which will it be?) to make up for it.\n\nWhat makes me further think you kind of suck with this is that you knew you were going to tick her off with this move but that your being able to quit was dependent on her not moving out. It may have been subconsciously - I don't think you are a bad person - but part of your choice to do this is that you knew you held all the cards and that even though she's going to be in a worse position, mental health wise, there is nothing she can do about it.\n\nI think she went a bit too far, but you sprung her having less privacy, less of her own space, with no discount on rent on her, so her bitterness and anger is understandable.\n\nI really don't think you are a bad person, and I really don't think you saw anything wrong with what you are doing, but I really think she should be paying a little less in rent.\n\nDo with that what you will...\n\n\\*edit\\* \"Just move out\" that's what I mean by OP holds all the cards, OP needed her roommate to not \"just move out\" and knows how bad it is right now with rents jumping and places being left empty, so OP could change the rules and there is little  the roommate can do about it. Again maybe subconsciously, but still. That's what \"holding all the cards\" was referring to", "YTA. Sounds like she was paying for something and her own space and suddenly the whole deal is being changed out of nowhere? Of course she would be frustrated.", "I have also rented out a room in a place I owned, to someone who wasn’t a friend. If I had decided to bring in another tenant (when the possibility/inevitably of an additional renter hadn’t been discussed as part of the original agreement), I would have discussed with the first tenant, including lowering the rent since he would now be sharing the common areas with an additional person (or so he had notice and could make plans to leave if the new arrangement didn’t work for him). I can’t imagine moving in a third person and still charging the same amount. I’d feel like a real asshole.\n\nIf I were renting a room in a place where the third room had been presented as a guest/storage room and not an additional room that would be rented out, and that suddenly changed , especially without a reduction in rent, I would not be happy. I agreed to the rent amount when the home was presented as a two-person occupancy. Adding a third person changes the equation. If I had a longer lease, I’d be looking to see if I could legally break it without a fee. If it were month-to-month, I’d be looking to leave as soon as I could manage. Either way, I would not think very well of you for the surprise change. YTA", "YTA, and I'm honestly shocked at how many people are saying NTA. There must be a lot of landlords on this sub.\n\nYou're a live-in landlord AND you pulled a bait-and-switch on your tenant. You are especially TA if you never made the tenant aware that the room may be rented out in the future. You own a three bedroom house, **you live in the house**, and you're charging two tenants the ENTIRE cost of the mortgage, save for $100? At the very least you should be charging them less, wtf.", "YTA. You told your tenant you were going to double up the tenant occupancy, giving her less privacy, less time to use the bathroom and kitchen and common spaces, and said \n\n“Oh, and you’re gonna keep paying the same rent. Me, I’m just going to basically stop working and just pay whatever’s leftover after the new tenant starts kicking in another $700.”", "NAH I don't think you are an asshole, it is your property and you are free to do whatever you wish. You were in a tight spot and needed some extra cash to pay the rent. However I can see why she's upset, if I moved in somewhere under the impression that two people were going to share the space and suddenly the two people turned into three, I would be mighty unhappy. Adapting to one person can be hard , adapting to two can be miserable. Also, I'm not sure if you have a lease with your tenant but there might be stipulations regarding this in the lease. I wouldn't be surprised if she wanted to move due to this change, this frankly doesn't benefit her in any way.", "You’re n-t-a for having two roommates and no job, but YTA for changing someone’s living agreement in the middle of a lease. I’d be pissed if I was paying a certain agreed upon amount for my own bathroom and sharing a place with one person, to then have it decided AFTER the agreement that a third person would be added, private bathroom no more, AND still paying the same amount of rent? Yeah, you suck. You ARE leeching. Lower her rent amount if you are changing the agreed upon terms to living there.", "YTA for changing the terms of the living arrangement. Sharing a bathroom is much different than having your own bathroom. You're not wrong for being a landlord or for taking the time to find a new job, but you need to reduce her rent since you've changed the living arrangements.", "It sounds like you sprung this new tenant on your original one without much consultation. She’s perfectly valid in her expectation to have a private bathroom, esp if it was outlined in the lease you had her sign. She’s right to be upset about it, especially since you have not even offered to reduce her rent. This kind of stuff is exactly why I rent from companies instead of private homeowners - because at least apartment companies don’t try to stick another random stranger in my home without my consent.\n\nAlso, if you’re upset by her implication that you’re a mooch because she’s paying for the home you live in, then it’s time to get going on that new job, because she’s not wrong about that either.", "Yes YTA. Shocked at all these N t a votes. She agreed to move into the house at a set rate based on having one roommate and access to a spare room. Now she has to share the living space with a whole other person for the same cost. Plus you’re suddenly home all day, adding to wear and tear, mess, lack of privacy etc. You’re absolutely stiffing her based on what she agreed to pay for a year ago. Would you pay the same amount to live with 2 roommates instead of one? I sure wouldn’t. Would you be totally peachy keen if she  moved a romantic partner in and suddenly they were in your bathroom, cooking in your kitchen, parking behind your car, whatever minor inconveniences having extra roommates brings. \n\nIf you want to rent both rooms you need a agreement with roommates who both agree up front with that and price it accordingly. (Which might well still be $700 each, rent is crazy expensive.)", "YTA.\n\nRenting out a room is fine. What the issue is - taking on an additional person. Lowering someone's utilities doesn't make up for having another person in the house.", "At the moment you are a full time landlord, I think any live in landlord who doesn't work is going to attract resentment because the tenant can see they are working to subsidising your lifestyle of not having to work whilst also paying off your mortgage.", "NTA and not a leech. A leech doesn’t provide anything and just takes. You’re providing a place to live. Your tenant is off base here. My friend bought and renovated a three bedroom home in SoCal. She rents out 2 of the 3 bedrooms, renting out the master and lives in the smallest bedroom. Her two renters pay her mortgage, she pays utilities. It’s a very common approach to home ownership for single people.", "Slight AH. You’re allowed to have your roommates pay your mortgage. That’s what landowners do. But I’d be pissed if my house share was two people, and rent included bonuses like storage and my own bathroom, and I had to suddenly share communal space with another stranger. That wasn’t the agreement when she moved in. Do you have a lease?", "YTA- you changed the terms of her rental situation putting her in a uncomfortable room arrangement to suit yourself. Claiming “it’s still cheaper” only shows how self important you are to your own wants and expecting her to just “deal with it”. I hope she turns you into the housing authority.", "OP has said that there's no lease, they don't report their income, this is all under the table. \n\nYTA for exploiting renters. You're using below market rent to create a situation where moving out is always going to be unaffordable for them, but because of your willful negligence, they don't have adequate legal protections on the basis of which they could rightfully dispute sudden changes like this. Sure, the renter should have done their due diligence and signed a contract and everything, but with significantly better rent than they'd have otherwise, can you blame them? OP, if you want to be a landlord, you have to actually *be* a landlord. What you're doing right now is literally just tax evasion, and you want to bring in another person so you can evade taxes even more?", "You are n t a for having roommates.\n\nHowever, YTA for charging her the same rent when she no longer has a private bathroom (same money for a lesser situation). The utilities may not go down as much as you think with a third person living there. I'd be pissed about the new situation too.", "YTA.\n\nYou are not a leech, and you are entitled to rent out both rooms so you can pay your mortgage while you look for a new job \n\nHowever, your roommate was paying $700/mo to rent a room and private bathroom in a house with one other person, and now she is paying $700/mo to share a bathroom and have two roommates. Unless you told her when she moved in that you would be renting out the other room and the bathroom would be shared, you have changed the terms of her rental agreement without her consent. Not cool.", "the people saying that this girl should be evicted or have her rent hiked up bc someones feelings are hurt are genuinely psychotic, yes it was rude but to take away her house over it ??? this just goes to show the crazy power imbalance that can come with living with your landlord. atleast OP seems like a decent person that isnt listening to this awful petty advice.", "YTA. Your roommate was right when she said you were leeching off of her. It's one thing to own a house that you rent out to tenants *and don't live in*, but because you live there you are technically a roommate. You had a new person move in despite your roommate vocalizing her unhappiness with this situation - and rightfully so, you threw a wrench into a living situation that sounds like it was going well until you did this - and so now YOU are not paying rent, but the two roommates are splitting your mortgage payment?? That doesn't make any fucking sense. If a third roommate moves in, then everyone should be paying the same amount. So you should have reduced your roommate's rent as well, especially because she would no longer have a private bathroom.\n\nI've had two different roommates pull this, both times it was a three bedroom house. Both times, my other housemate and I were PISSED. You're applying landlord logic to a roommate situation, and think that your roommates should be understanding and cool with you not contributing to the house financially whatsoever because you own it. But you have put yourself in this situation. You bought a house that you couldn't afford on your own (literally why did you do that), you lived with a roommate and then suddenly decided to quit your job and thought your roommate would be supportive of you upending the house suddenly?? You can either be the landlord, and rent to two or three people and live in another house. Or you can be the roommate and split things equally. But you can't do both and expect other people to be cool with it. You're a major AH.", "YTA. Sounds like you may not have a lease for your roommate as her landlord. If you did, it would specify what exactly she is renting. You normally rent a whole unit or a room. It seems like she thought she was renting a unit and you’re just adding a roommate, which wouldn’t be ok if there was a lease.\n\nAlso, landlords are inherently leeches because you’re having someone else pay your bills while not contributing.", "YTA unless you told her that you would be getting another roommate when you rented to her or have decreased her rent. Expecting a person to pay the same amount while adding another roommate after the fact is unethical.   \n\n\nI hope the new tenant makes you as uncomfortable as you have made her and may the rental faires smile upon her.", "YTA you are a leech living off of their labor", "This is going to be an unpopular opinion, but YTA simply for being a landlord. Landlords are leeches who bring in income for themselves without bringing in any benefit for society. Congratulations! You’re a useless byproduct of late stage capitalism.", "INFO: When your first roommate agreed to $700 per month, was it with the understanding that there would only be 2 people in the house, or was the possibility always there that there would be a third?\n\nThere's nothing wrong with having your roommates pay your mortgage if they agree to the rent that you're asking for, but I can see how someone would be upset over having an additional person in the house using shared spaces without a reduction in rent if they hadn't agreed on that.", "I can understand her being upset if she rented a room with access to a private bathroom and now she is getting something else (a room with access to a *shared* bathroom). Also, common areas are shared with one more person (kitchen, laundry room, living room..). It's a different experience accommodating more people in the same space. Personally, sharing a bathroom would be a deal breaker for me. \n\nI don't know what's actually in your lease, so legally you probably didn't do anything wrong. But, it sucks for her that her living situation changed when she's paying the same rent. \n\nINFO: Did you offer to let her out of the lease with no penalties? Is she constantly confrontational, or are you just unhappy with her opinion? \n\nDealing with unhappy tenants is something you'll have to deal with as a landlord. And she'll have to deal with the problems that can arise from renting just a room in someone else's house. \n\nYTA.", "You should have reduced her rent when you moved in someone else and made her share a bathroom. You changed her living conditions without even asking her. Even just a gesture to say you each can pay $600 a month wouldn’t probably put you in a bad financial spot, and would go a long way. If you can’t afford a $300 a month mortgage with your savings, you better find a job quickly.", "YTA you already had a contract with her and she didn’t want to share the space she was paying for", "YTA. I agree with her assessment. Everyone here is calling it being a landlord, like it makes any difference. Landlord is a professional leach. It's the whole problem with renting. Landleeches do nothing to maintain the property while charging half of people's pay cheques for a place that was built in the 80s (if you are lucky!). \n\nThe poor girl can't afford her own place, so she is stuck in this situation. She can't have her own pets, do any renovations to her property, etc. Nothing available to her because she has no ability to compete with all the professional landleeches. Companies buying up all the homes, AirBnB making it impossible to find housing. \n\nI'll agree with others that all landleeches are all AHs. I don't care about the downvotes.", "INFO:  in your rental agreement did you state that there would be a shared bathroom?", "YTA- not for renting the rooms, but for changing the bathroom dynamic and not adjusting the rent slightly. The living spaces, kitchen and bathroom are now all shared by another person. You should drop her rent by 50. You'd still be making out well, but it would acknowledge the reduced quality of what you're offering now.", "ESH. You undoubtedly told her she would have a private bathroom, when you originally rented to her. You should discuss some form of compensation with her, perhaps reduced rent, include utilities, better parking spot.\nWhat you do with your day is none of her business.", "YTA. She went from one room mate situation at basically half, now two room mates, and still paying half when it should be a third.", "Yta- the rent she agreed to pay was based on the previous number of roommates, and having her own bathroom. You should not have invited another tenant to move in without lowering the rent of your first roommate. Also, moving another person in without the express consent of everybody else who lives there is an asshole move, sure it's your right as a landlord, but you are being a really bad roommate", "You added another person to the house and made the existing tenant pay the same amount? YTA. It’s a completely different living situation than what she signed up for. Sure, she can move out but it’s still a YTA move.", "Eh, I don't think YTA but I think she may have a right to he upset about a new roomate. The first renter agreed to $700 with only you as a roommate and her own bathroom. With renting the second out, there's another person and now has to share a bathroom while rent stays $700. Utilities are less, sure but that isn't what she agreed/expected when moving in. Unless she knew from the start that there was a possibility this would happen someday and she agreed, I can understand why she's not happy about it. Especially if only received short notice that this was happening. Obviously she can leave/move out, you aren't obligated to make/keep her happy but I know I'd be upset about the change. Idk if there is a lease or rental agreement at all so she may have agreed to all this in writing, even.  Don't think calling you a leech is OK at all. I just think it's reasonable for her to he upset about the change in general, not upset with you neccessarily or for leaving a stressful job and doing what you need to to get the bills paid", "YTA. You cannot just make her share a bathroom and the rest of the house. That was not the original agreement.", "YTA. She had her own bathroom and now she doesn’t because of your decision. I’d be super pissed if you did this to me.", "your roommate is paying the same rent as before? Thus her living conditions have decreased but she wasnt compensated for that. That utilities are shared between 3 people is logical, but a reduction in price because now there are 3 people using the common spaces instead of 2 would have been appropriate. You worsened the conditions of her renting. YTA", "YTA you are indeed taking advantage of your tenant she moved in with the expectation that she would have her own bathroom and you need to live up to that", "I thought we hated landlords on reddit, so I'm surprised with all the n t a's  lol", "YTA. you should lower her rent if your getting another income from the other room, also for having to share the bathroom. being a landlord is not going to make you likable. set boundries and decide you dont care about your relationship with these people as nothing more then expendable tenants, or give them a fair price.", "You could have compromised with her by lowering her rent a bit to make up for the fact that she’s now sharing the space she rents with an additional person. If she moved in under the pretense that she had her own bathroom and then you suddenly take that away while keeping her rent the same, then I’m kind of leaning towards Yta.", "YTA if you rented her a room at $700 where she has her own bathroom… and then later took that amenity away. You shouldn’t change the terms on someone mid-lease. \n\nIf you did this during a lease renewal period, I’d go with N T A.", "YTA. She was rude, but she decided to rent a place where the common spaces were shared with one other person, whom she had met, and where she was not sharing a bathroom, and it seems you did not tell her before she moved in that it was a possibility that you would rent out the other room. And you didn't even lower her rent now that she shares a bathroom and the common space is shared 3 ways? That's not cool. You had an agreement with her and you changed the conditions. Having a private bathroom is a key thing I look for when renting a place, and I would NOT be okay with a landlord changing that mid-lease.", "YTA, she rented a room with one other person and a private bathroom, and you changed the agreement. You need to lower her rent a little because those are amenities that people pay extra for, often hundreds of dollars. Just knocking off $100 would be enough.", "As someone who owns their home and has two “tenants” (my partner and bff) I do think YTA. I make sure everything is 100% equal, aside from me paying for upgrades/stuff for the house because they’re paying 2/3rds of my mortgage. If I lose my job it would absolutely be shitty of me to throw another person in the house because I can’t pay my share of the bills.", "Info: you live there too right? I think it's kind of unfair of you to be also living there and not paying a fair share.\n\nDid your first roommate move in with the idea that she would have a private bathroom? Did she sign a lease? Cause if she did and it specifies private bathroom and only 1 other roommate then that is also kinda shitty to now have to share especially after she expressed she didn't want another roommate. \n\nI see the people commenting that she is just being a landlord but most landlords don't also live in the same place/apartment/dwelling. They have their own space. She is more  roommate than a landlord. They were literally paying the same amount before and only her rent went down with the new tenant coming in. Shitty. \n\nSo yes I kinda think YTA here for getting them to pay a majority of your living expenses and having you basically live for free. The only thing that would change my mind slightly is if you were planning to decrease their rent and increase yours once you get a job, but from the sounds of it that's doubtful. \n\nFrom the looks of it I've got an unpopular opinion but 🤷‍♀️", "I think YTA because you asked, she told you why she didn’t want it, and then you did it with no compromises. You should have lowered her rent a bit for like six months, which would give her warning and time to move if she wanted, and compensate her for not having her own bathroom. She shouldn’t have called you a leech, but you are more in the wrong in this situation. \n\nAnd yes, legally there isn’t anything wrong with it but I still think you’re the AH.", "you are having roommates with no equity pay almost the sum total of your mortgage for you so yeah you are leeching off them right now. that's what being a landlord is. others on this sub will make you feel righteous about it but it is the reality of what you're doing. 700 for one bedroom and sharing a bathroom is not 'helping others while helping myself' pricing either. you're taking advantage of what the rental market has normalised and taking advantage of the fact they would not be able to themselves get a mortgage and are stuck renting from ppl such as your self who exploit that to get their bills paid.", "All landlords are AH.", "NTA, does your roommate expect free rent or something? You have done nothing wrong, it’s your business how you manage your home and finances and if she doesn’t like it she could move out.", "YTA- only for the fact that you baited and switched roommate number 1.  You rented to her under the premise of a private bath. If she’s in a lease then she’s got exclusive use of that bathroom.  \n\n30 to 60 days later and no lease, rent away.", "Info: when you advertised the first room and it’s price did you list it as “private bathroom”? \n\nIf so then you really should have given her a cut in rent when she had to start sharing", "YTA. If the bank were in a pinch due to rate changes and decided to sell off half your house to someone else to make a bit more money, you'd be justifiably enraged. That goes against the agreement you have with them.\n\nSame thing. You made an agreement, then changed the terms in the middle of it.", "She's not wrong, but we also live in a capitalist society and we all need to get by. \n\nAt the same time, adding a roommate (and now having the mortgage basically covered almost for free while you also live there) is a bit unfair to the renters. You're charging more than the 1/3 share of the mortgage to each of them, and you get to keep the equity of the house at the end of the day. \n\nLandlording is inherently exploitive, and anyone who gets into it with the expectation of getting free living space, free equity, etc., is inherently leeching off the labor of others. \n\nThere's a line though, and it doesn't seem like you're (far) across it. \n\nEither way, she could have approached it better. YBTA.", "YTA I really hope you lower that first person’s rent since she now has to share a bathroom. That’s really shitty of you to make her pay the same, I don’t care that the utilities are lower. Also you’re a landlord and I’m sorry but my definition landlords are leeches. BUT this doesn’t seem permeant. I hope you get a job that you like and lower their rents.", "YTA. She's not your roommate; she's your live-in tenant. You changed the terms of the lease agreement (i.e., took away a private bathroom) and didn't reduce her rent. You are taking advantage of her because you are in the power position of the dynamic. I'm a landlord, too, and you're the kind that sucks.", "Was she aware when she moved in that it was a shared bathroom and there was always a possibility of sharing it? If so then a huge NTA. if not, then you’re kinda TA.", "If she signed up to have her own bathroom, and now, for the same rent, she has a shared bathroom, then not only are YTA, you're also on the wrong side of the law.  You should get a grip and deal with this before she notices that she holds all the legal cards here.", "NTA you can rent out your rooms however you want.  If she doesn’t like it she can move out.", "Nta, tell her if she is unhappy with the arrangement you will happily let her out of her lease.  Ask her when does she want to move out? That should shut her up real quick, also you don't owe her an answer. As long as everything is working in the house that is all she's paying rent for is a room.", "ESH. Clearly being a landlord is not being a leach. But changing the arrangement after she rents, so she has to share a bathroom, is crummy. You should have offered to lower her rent. She was already paying an outrageous amount for 1 bedroom, but she agreed to it. She didn't agree to share a bath. You suck.", "NTA - It really isn't any of her business as a renter whether you work or not.  I assume she isn't a good friend, as well as assume you live somewhere that $700 a month is a fair cost (seems a bit high for one bedroom in someone else's home).   If a good friend, it might have been considerate to explain your plan before getting the other renter but even then, it'd be your choice/decision and you would have only been telling her your 'why' vs asking permission.  Most likely she is simply a bit resentful of you not working right now, but that isn't your problem in the least.", "NTA\n\nPeople have to pay rent to live somewhere, the two people you're renting to are paying rent to you like they would whether you're working or not. You're looking for a job so what's the problem.", "Nta\n\nOp, it's your house. If you lived entirely off the income from renters, and never worked an outside job again, you still are not a leech.  Your title is, Property Owner.", "NTA. Tell her to leave if she doesn’t like it. She won’t because she’s getting a good deal. Unbelievable.", "NTA because it's your house and you choose what to do.\n\nNow for how I feel about it... Hmmmm, since she needs to share a bathroom now, it would be nice to lower her rent a bit, especially if she's a clean/okay person and you don't want her looking elsewhere.\n\nShe was rude to call you a leech but this shows her feelings... and that if you want to keep her as a tenant it would be nice to give a little yourself. After all, she signed up for something different.", "Your roommate is resentful. But, she's paying for you to not have to go to a job you didn't like anymore so quite frankly I'm not surprised by this at all. How selective are you planning to be about your next job? Will you raise their rent if you run out of savings before finding a job you want?\n\nNAH, yet.", "It's your house, she chose to rent out a room and that comes with risks and very little say. I rented a room for 3 years and I'd never do it again for these reasons. You're at the will to the owner of the house or lease. \n\nNTA, but you should have lowered her rent because she's sharing a bathroom.", "ESH. You are an asshole for not having a lease or contractual agreement in place. This will leave you both at a disadvantage when any questions or issues arise. ( I’m getting this info from the comments). So now your baiting and switching your tenant with a shared bathroom, that anyone would be salty about. But she has no lease so really nothing to latch too, so she is also an AH for that. Calling you a leech was also wrong and out of line, AH for that too. \nHow someone invites strangers into their home to live with them, and don’t have anything on paper is insane to me. So many horror stories out there. Squatters laws may even apply here.  Watch the Netflix series about crazy roommates, it’s a good one!", "In hindsight you should have told her you were living off your savings while your between jobs w/o mentioning how much your house payment is. I would mention that owning the home makes you responsible for things like new roof, etc.  also let her know that renting rooms made it possible to become a homeowner and she should consider it in the future.", "You should have reduced her rent as she lost a private bathroom for a shared one. Otherwise, NTA", "ESH.\n\nYou changed the terms of her tenancy without her consent. When she moved in, she didn't agree to share a bathroom and kitchen/other common areas with another tenant. In an ideal world you would have discussed this with her and offered a concession like $50 off on rent.\n\nYour tenant is being ridiculous by going off on what sounds like Very Online rants. You aren't a multinational conglomerate, buying up entire blocks to rent out at eye-popping rates. You're just a regular person with one home, trying to make ends meet and renting out a couple rooms. Unless you live in a very low COL area or your house is a dump, your rent is reasonable to me.\n\nOffer your tenant a small rent concession and put this drama to bed.", "NTA that lady is jealous but that’s a her problem not a you problem do ignore it and let her know she’s free to give her notice and leave so you can find someone else and then live a peaceful life. Her views of you are not important because she isn’t", "NTA. If the change in her living arrangements was such a huge deal she can move out and get a different place - it’s your home and you can do whatever you want with it. It’s not leeching off people to charge them for living in your home, it would only be leeching off them if you were also eating their food and using things that they buy when you aren’t personally contributing to those things or something, which I’m assuming isn’t the case.", "NTA. It's your house; you can rent out the other room if you want. And she's not your roommate, she's your tenant. If she doesn't like it there, she's free to find another place to live.", "NTA\n\nShe’s just pissed about sharing a bathroom. Which I can appreciate. But if she doesn’t like it, she can move.", "NTA  It's none of roommates business as to your work status. You named a price and she agreed to that price.", "I'd recommend looking into squatters rights in your state.  I have heard of some bad situations go worse when someone finds out they can stop paying altogether and make your life a living hell. Think, no one paying rent anymore and you are not able to even kick them out without going through an eviction process.  Be careful.\n\nEdit: forgot to add NTA. Your house.  You can do what you want regarding renting space.", "NTA- If she doesn’t like the situation, there is no one stopping her from moving out.", "INFO: Are you a legit landlord? That is are you doing what your state city says to be a landlord? The last thing you need is her dropping a dime on you if you aren't legit. If you aren't legit get legit.\n\nDepending on how tense the relationship is you might let her know she's free to find another place to live.\n\nI don't get what you leaving your job has to do with anything? She's paying the same amount of rent if you work or not. She's mad you added another person is all.", "NTA and not the leech. You are renting out rooms at what is presumably fair market rate. Many people live off investments including rental properties - you have mortgage, maintenance, taxes to pay for your home. \n\nWhere you are not being completely fair is that she rented the room with the expectation that she would have a private bathroom. For many people a private bathroom is quite an important feature and the loss of it would be significant. There is not any way that the loss of a private bathroom is the same value as what she is saving on utilities by splitting by 1/3. Obviously I don't know if $700 is reasonable for a room with private bath or reasonable for a shared bath - I do know that if I had rented a place for a certain amount with a private bath I would be pissed if I suddenly had to share. The landlord wouldn't be a \"leech\" but I would certain feel that I was getting exploited and would want a rent reduction in addition to the utility sharing.", "NTA. I feel like a lot of ppl gave you extremely confrontational advice about this, but i honestly don't see the need to be super aggressive with your tenant. We only have this one interaction to go off. You're completely in the right, but honestly, maybe try and think about it from her perspective? She signed the lease and started living with you under certain expectations; you have now changed her living situation without her input. You're in the right to do so of course, it is your home, but i can understand her being upset. Adding a third person to the home does completely change the living situation imo, even though she still has her own room. My personal opinion is that you should have lowered her rent slightly (not by a ton, maybe $50 or $100), and charged the new person the same amount. You don't *have* to do this, again, you're perfectly within your rights, but that's what I would have done.\n\nI'm going to give you an example of something thas happened to me. I was living in a similar situation (live in landlord), she had a 3 bedroom place with a small den, one other roommate when i moved in. One bathroom, no yard, I was paying $800 (Vancouver rent is crazy). After a few months of living there, the initial roomate moved out, and she moved a couple into the other bedroom. So now 4 people. Then she moved someone into the den... 5 people. Then she decided to put a wall up halfway through the living room, converting it into another bedroom... 6 people. And then her boyfriend moved in... 7 people. My rent never went down, and I talked to the other tenants, and they were paying MORE than me, $900-1050. This is an extreme situation obviously, but you can see how frustrating it was for me. Was she allowed to do this? Yes. Was it right? I don't think so personally. I'm not suggesting that you are planning on moving as many people into your house as possible, but I can see why your tenant is feeling upset.", "Your renter is out of line; it’s your home, and nobody is making her live there.  It’s not leeching, the audacity of her.  You also said you were looking for new employment, so I’m not sure where she gets off. NTA.", "Edit:\n\nNTA \n\nShe doesn't have a year long lease and can leave at anytime. But you should have your tenants actually sign something even if they're month to month for your protection.", "NTA but her rent should go down if she will have to split the bathroom and shared spaces.", "NTA.\n\nSince you own the house, any maintenance and decrease in value have to come out of your pocket. She rents and doesn't have any risks.\n\nSo, no. Not leeching. But it would have been nice to lower her rent a little, but not doing that does not make you a leech.", "NTA: is your roommate dumb? Does she think any homeowner that rents to her is taking advantage of her/anyone that rents? Lol tell her to go buy her own home if she doesn't want to be 'taken advantage of'. She sounds jealous to be honest. If she becomes unbearable kick her out and find someone better.", "Nta. Tell her to move if she doesn’t like it", "NTA you are renting her a room, not the entire house. If she does not like it, she is free to look for another room to rent. Is she expecting to live with you for free? Or get a discount of some kind? That would be leeching.", "NTA, but I do understand where she's coming from, and I think that since she rented the room under the impression she was going to have a private bathroom and now has to share, you should consider knocking a little off her rent to compensate (which I imagine you can afford to do if you're only paying $100/mo of your own money towards your mortgage).", "NTA. There’s actually nothing wrong with being a landlord (or professional homeowner as she calls it). It’s your property, and you can rent it out to either supplement your income or use it as your full income if you want. Lots of people do that.", "NTA. Jobs get lost or left when they become too toxic. You simply did that. Your roommate is simply paying her portion of the rent she agreed to. It doesn't go down just because you're not working.\n\nEveryone bounces between jobs nowadays. Just try to find something quickly so you don't lose your savings. She needs to stop being so judgemental and crappy toward you.", "NTA, and stop telling people so much of your business. She's there because it suits her, if it doesn't she can feel free to leave", "NTA you worked to get your house.\n\nI hope you find a job you like soon.", "NTA she's not your roommate. She's your tenant. And you're not a leech-- you're her landlord. The fact she doesn't see you like that is an entitlement on her part im having a difficult time swallowing", "I understand being annoyed about sharing with 2 people when she expected to share with one, but if she didn’t sign a lease to that effect, her option is to leave if she doesn’t like it. It is absolutely none of her business when or where you work or how much you are charging someone else. NTA.", "NTA in any way shape or form.", "NTA. Every time she complains, ask her when she plans to move out.", "NTA - next time she calls you leech, you can ask her when she plans to cut her lease short and move out, so that she’s not subsiding a homeowner. Though maybe also point out how flawed her logic is and if it’s such a big issue to pay rent which covers a home’s mortgage maybe she should get her own mortgage and then she won’t be subsiding anyone. \n\nAnd then find a new tenant.", "INFO: How long have you been without a job?", "NTA. She is a RENTER, so of course she has to pay RENT regardless of who the owner is. She needs to get a clue about how RENTING works.", "It's called a \"landlord.\" Many people (full disclosure: including myself) make their entire living out of renting out properties. Now, landlords might be the first against the wall when the revolution comes, but meanwhile, they provide a necessary service. \n\nNTA as long as the premises remains habitable.\n\n(You may have been the asshole for bringing in the second renter, thereby forcing the first to share a bath. There are definitely legal issues there. But it's not really your question so it's not figuring in to my analysis.)", "NTA but your first roomate has the right to break any lease and move out after you moved a stranger into her (now shared ) bathroom - ewww. I hope she does .", "YTA - you entered a rental agreement and then unilaterally changed the terms without compensation. That's an asshole move, and also probably illegal.", "This might shock the roommate but most landlords charge 50%-200% more than the mortgage on properties they own so they make a profit. OP isn't making a profit even.", "THIS. Roomie can feel free to move out if she's not satisfied with the current arrangement. OP, I wouldn't put up with more insults from her.  It looks like its not that difficult to get other roommates. Tell roomie that your place isn't the best fit for her and she can live somewhere else where there are no \"moochers\" around. NTA", "It seemed like such a perfect solution. I could take time to find a good job without being pressured to grab something because I'm panicking about bills. I guess nothing is ever perfect.", "I agree with the judgement and I think she was in the wrong, but also I've only wanted to rent a place with a private bathroom, I'd be super unhappy if the owner just decided to make it a shared bathroom. \n\nI wonder what's in the contract about that, or if it's mentioned (it's absolutely something I'd make sure was in there, as someone who has looked for places before).", "I will say if the roommate rented on the basis that they didn’t have to share a bathroom and now they do, their rent should also be reduced. They are not getting what they originally paid for", ">They're living in your house that you bought.\n\nConsidering they're the ones actually paying the mortgage, not OP, this is a weird statement.", "Yes, but her living there are rent payment was based on sharing a house with one person, now it's two people and a shared bathroom. If op didn't disclose this was a possibility when they signed the lease, it's shitty to change the terms midway, and not discounting the tent", "Yes, but part of being a landlord means that you have to actually act professionally.  Telling his existing tenant that she now needs to share a bathroom is not professional.", "I wanted to say just this. A landlord owns properties they don't inhabit while upcharging tenets so they can make a living from others' income. OP is sharing their home and working to make ends meet. That's an enormous distinction.\n\nNTA", "THIS right here. The actual jerks are the developers and landlords who own multiple properties they put on  airbnb making local affordable housing unavailable to locals. This is NOT what you're doing. You're rommie has the audacity to call you a \"leech.\" Tell her that what you're doing is absolutely reasonable. She's free to disagree, in her had. If she makes another comment along these lines, tell her she's always fre to leave. NTA.", "There are a lot of forms of land lording that are absolutely showered in shame day in and day out. \n\nOP renting out rooms in their house is absolutely fine. Completely NTA\n\nBut professional landlords deserve all the shame we can heap on them", "Changing the agreement with a tenant to include another person in the property with no care to the current tenant is pretty shitty and may in fact be illegal.", ">A \"professional homeowner\" is called a landlord\n\nQuite a few people would call a landlord a leech.", "Unless he has the deed, the bank owns the place.", "OP didnt buy it, the bank \"bought\" it, and OP just took out a loan from the bank, which his two tenants are paying off. So op is just a middle man between the bank and the people paying off his loan to the bank.\n\n.", "Renters have rights. Landlords have to hold up their end of a rental contract. If you're paying to have your own bathroom and then you have to share the bathroom that is a unilateral alteration of an agreement. Depending on where you live it might be illegal.", "A “professional homeowner” is called a landlord and is, in fact, a leech.", "But OP *hasn't* bought the house. His/her bank owns the house. And these roommates are buying OP's house for him/her. So yeah, it's kinda parasitic. All landlords are parasites.", "NTA. OP, ask your roommate if she'd like to move out. Tell her the mean comments needs to stop, or you'll be serving her notice (if she's month-to-month) or won't be renewing her lease. This is ONLY if you're in an area where there's a high demand for rooms, which is most of the world right now.", "A lot of people do actually think there’s shame im being a landlord. Agree or disagree, it’s not exactly a radical view anymore.", "There is shame in that. A lot of fucking shame. That's literally being a leech - sucking value out of society while contributing absolutely nothing. OP is exploiting these two girls just so they don't have to get off their lazy ass. That's absolutely shameful.", "I could not agree more.", "There is a growing segment of young people online who seem to believe it’s immoral to be a landlord. The corporations have ruined everything.", "Landlords are leeches by definition", "The purpose of my rental property was to make me money. The end. 😂", "OP is not a landlord because there's no lease. They haven't done any of the legal or material things that would make them a landlord. It woulr seem they're literally just committing tax evasion lol", "> A \"professional homeowner\" is called a landlord.\n\nWhich is why OP is TA.\n\n> If you can get people to live in your house and pay your mortgage while you get another job, there's no shame in that.\n\nYes there is.\n\n> They're living in your house that you bought.\n\nSounds like they're paying a lot more on this house than OP is.\n\nOP isn't even a particularly good landlord, considering that they're unilaterally taking away amenities that presumably the tenant could reasonably expect when they agreed to pay the rent.\n\nExpecting people to pay anything beyond some nominal upkeep fees without a transfer of equity is immoral, end of story. The fact that this is considered socially acceptable is the primary reason why more than half a million people are homeless in my country.", "I don't know if I could do that. I'd feel bad because she's lived here over a year. Plus, most rooms for rent in this area are expensive, so she'd have trouble finding a place.", "This is terrible advice. Being mean does not constitute a breach of their rental agreement.", "Yeah, I agree with this. She at least deserves a discount on rent for sharing a bathroom. That's not what she signed up for.", "This is exactly what I was thinking as well! OP, YTA", "I can't believe this reasonable take has been drowned out by \"NTA - it's ok for you to pay next to nothing on your own mortgage even though you use a third of the living space and change the rental arrangements against your tenants wishes\" \n\nI'm with you\n\nOP, YTA \n\nNot a terrible one, but one nonetheless", "Oh you’re completely right. OP, YTA for this reason. Maybe it didn’t occur to you, that’s understandable.  But her rent should be lowered.", "Oh yeah, the landlord fans and general bootlicking in this sub are unreal.", "Landlords and temporarily embarrassed millionaires.", "Hey, I've been a landlord, and I think OP is an AH.  It sounds like the tenant was a good tenant before, and I would do anything to keep a good tenant.  There are so many really bad ones out there.  Not much is a bigger pain than looking for a new tenant.", "Yeah if I lost a private bathroom I would expect my rent to go down.", "Especially with the bathroom issue! If she moved in knowing that she would have her own bathroom, it's a **big change** to all of a sudden be expected to share a bathroom with a stranger. I would go so far as to say OP should offer to lower her rent because of it.", "It's crazy how far I had to scroll for an OUNCE of compassion for the renter in this story! Everyone in this thread is obsessed with defending landlords. \"OP is NTA because she can just leave\" is such a shitty position to take. Her living situation has been radically changed with no input from her, and now people are saying if she doesn't like it she can \"just\" uproot her entire life and live somewhere else. Absolutely bananas.", "Considering OP stated that if their roommate were to move out they would pay even more somewhere else they should just take the L and move on. If they’re so unhappy then move out. They didn’t move into the house together, it’s OP’s house and they rent the room out to their roommate. As long as OP isn’t taking away the roommates room then that’s just kind of how renting works.", "The point you made about if she had a partner move in is interesting. I'm sure OP would be increasing the rent if that were the case, not just dividing the utilities. My roommate and I split our apartment and utilities evenly. If she wanted a bf to move in, I would demand that they both pay more in rent because there's more people in the house using the kitchen and shared paces, plus dividing the utilities. It's just not about utilities, it's about more people being in the home with more noise, more communal space, and more storage space being used.", "Lotta landlords in this sub. Bunch of them talk about their own tenants.", "If the roommate is unhappy about this situation she can find another place? Nothing about her rent increased… she’s paying the same money. \n\nIf she feels $700 is too much, and she’s being taken advantage of, it must be that rent is normally cheaper? Go ahead and find a new spot\n\n\nEdit: just saw comments further down from OP that the $700 is much cheaper than standard rent. Incredibly entitled nonsense from that roommate. Time to grow up", "The thing is that they aren't paying off op's mortgage.  Most of it, but the rent isn't even covering the full mortgage never mind living expenses.\n\nIt's not like op has never worked - op saved up and made choices to be able to leave a bad work environment.  Renters can and do do this as well.", "Does the tenant feel they are subsidizing the grocery store when they buy food the groceries didn’t grow?", "Indeed, and this makes OP a leech - just like all landlords. YTA (OP, not you).", "The people that built the house provided a place to live. Landlords just hoard more than they need and then use that hoarding as a way to leach more money.", "Exactly. This is like saying any business owner who trades good/services for money is a leech. \nThe renter clearly doesn't understand the dynamic. OP put forth the resources and took the risks/commitment that comes along with purchasing a property. It is an investment. Renting a room is a business exchange. \n\nWhile I get the renter being miffed at suddently having a share a bathroom, if I were OP, I wouldn't be renewing this person's lease and finding a new renter. She sounds like she is a bit too comfortable insulting OP in their own home.", "3rd person living there while OP is also home All Day Every Day. I would be shocked if the utilities haven't gone up significantly just with OP being home all the time.", "Yeah, it's not just about utilities, it's about how she now has to share a bathroom with someone else, possibly make and arrangement for toilet paper/soap, and now they will have a third person needing storage in the kitchen cabinets, refrigerator, using the kitchen, and whatever else they need to store, as well as more noise and more guests coming over. I've lived in houses with 3+ people and the kitchen is usually one of the main areas that has the most problems, because most people will be making food around the same time. The bathroom was also a problem area if there is only one shower/tub.", "Thank god I’m not the only one here who feels this way", "The amount of people calling landleeching a job too lmfao", "It doesn't really say anything about the bathroom. It just says her rent covers shared use of common areas. It's not incredibly detailed.", "I agree that she should have gotten a rent reduction when another roommate was brought in.  A room with a \"mostly private\" bathroom is worth more than a room with a fully shared bathroom.", "She’s paying for a room though, not half the house.", "Was the renter going to kick in half when the roof needs new shingles or the water heater goes out?  No, of course not.  Her rent wasn't for half the house. It was for the room and use of the other facilities.  If she's unhappy with the current situation, she doesn't have to stay there.", "This subreddit is filled with so many of them, no wonder Op's getting so much support. Leeches lift up leeches.", "I'm guessing that's what her next move will be, wanting free rent or an even bigger discount. I'd already be looking for her replacement, but that's just me.", "No. I didn't consider it private because it's not attached to her room.", "Actually she doesn’t need OP to let her out of anything after she moved a stranger in . Unless that was listed as a possibility on the lease she signed she’s in the right if she leaves .", "I don't know. That feels really confrontational.", "No, we aren't friends. We met through a website where people look for rooms to rent. Rent in my area is really, really high. I charge less than most because my house doesn't really have a backyard (or even much of a front yard) because of its awkward placement on the street.", "What about the bait and switch she seemed to pull with the bathroom..one minute the first roommate is paying $700/ month for a bedroom AND her own bath but then OP moves a stranger into the bathroom? She would be left paying that $700 herself til she found a replacement.", "If she leaves he won't be able to pay his mortgage.", "I agree and IMO the first roomate would be in the right if she decided to move out and break the lease because OP probably broke it first . I wouldn’t share a bathroom with a stranger when I thought I was paying to have my own . OP pulled a bait and switch", "She's already paying less in utilities so is having to pay less", "I don't think I can raise rent just because of my money problems. But since the mortgage is $100 a month (after I apply rental income) utilities about another $75, groceries about $150, gas $50, HOA $125 and miscellaneous another $100, that's only around $600 a month in expenses. It will take about a year for that to eat through my regular savings and start cutting into my emergency savings.", "Except that the price she agreed to was under better circumstances. She went from one roommate and her own bathroom to two roommates and having to share a bathroom with a stranger. Did she get a say in who would share or did OP just say here is the rando I found of craigslist?", "Evictions take thirty to sixty days, but they also ruin your credit, so most people try to avoid them. It makes it really hard to rent a real apartment or get a mortgage and sometimes even if you're looking for a job. My brother got evicted once. We all tried to warn him to work something out with the apartment complex he was living in, but he didn't listen. 50 days later he was back home with mom and dad and hasn't been able to find a new place since and it took him a while to find a new job.", "> I'd recommend looking into squatters rights in your state.\n\nThey're not relevant. Nobody here is a squatter. OP is in the same house.\n\nTenant's Rights would be relevant, but just mean OP may have to follow certain rules to evict them if the roommate stopped paying.", "Yes, Netflix had a limited series call Worst Roommate Ever. I think that was the name.  Anyway, there were some really awful stories about roommates that squatted, didn't pay a dime, made the original owner or lessee's life a living hell and took months to get rid of them, at great expense.  It was scary.", "Perhaps upset about never having the house to herself anymore and live in landlord running up utilities by being there all the time?   \n\n\nOn top of that, now adding a random stranger to her living space that she wasn't told about when she moved in?", "I'm not aware of any law against renting out rooms in my city. I know a lot of people do it, and there are websites and Facebook groups to find rooms. There's other people in my neighborhood renting out rooms even.", "Wow. She moved people into the living room? That's crazy. Sorry you went through that. That's bananas.", "She was renting her a room AND a private bath but then pulled a bait and switch to move a stranger into the “private” bath", "Nothing wrong with it except y'know being completely morally reprehensible.", "Thank you <3", "Three weeks", "Housing scalpers don't provide a service. Housing scalpers buy up more properties than they need resulting in the housing crisis.", "Why would there be legal issues sharing a bathroom in a house? I've rented in 13 different properties over my time as a renter and I've not once had a private bathroom.", "I didn't see where the OP laid out the details of the rental agreement, where did you see that?", "No. No they didn’t.", "Another view of this, too...\n\nIn the home I live in, I don't pay property taxes on the first ~$75,000 of its value, and my property taxes cannot increase more than 10% in a year.\n\nWhen I converted my condo to a rental (from owner-occupied), the property taxes immediately went up almost 50% because I had to pay the taxes on the first $75,000 of value. Then, a few years later, the city decided that the value of it almost doubled in a single year, so they skyrocketed again.\n\nBoo hoo, poor me...but to turn it around, we KNOW that landlords will generally recover mortgage, property taxes, insurance, maintenance, and profit. If their property taxes go up, all it does is hurt people who sometimes/often can't afford to buy. When my taxes doubled, I was about to tell the tenant the rent would go up in 6 months when that tax increase kicked in (thankfully we get a lot of notice), but before I could even do that, she came by my house (we had a good relationship and I live nearby, so she wanted to deliver the news in person) and personally handed me her notice to vacate because she was buying a home. But then the next renter absorbed the tax increase (and general increase in rents...tenant had been there for 4 years and I had never raised her rent).\n\nAt that time, I had been hanging onto the condo (a first-floor flat with barely any stairs (3, to disclose) in and out) because I thought my mom might need to move into it if she became too frail to live in her big, multi-floor home. It was a place she could live independently without having to hike stairs to do laundry, generally get in and out (her house had a decent number of outdoor stairs to enter and exit), and didn't require things like lawn maintenance, snow shoveling, etc. (the beauty of condos). Mom ended up dying before that time came, but by the time the next tenant vacated, it became nigh impossible to sell one-bedroom condos (a friend has had one on the market for a couple months with no takers, a few in my neighborhood have been on the market for the better part of a year and aren't moving) because everyone wants a home office if they're buying, since Covid hit. But people will still rent them. Not sorry at all that I'm not going to lose money to sell it if I can still rent it and cover costs (profit is really minimal...based on the formula the city uses to calculate how much you can increase rent if you do improvements on a rent-controlled property (mine isn't rent controlled because I own just the one rental; if a rent-controlled property does capital improvements, they are allowed a *12%* rate of return on their full investment when setting the new rent!), it's around 2.5% per year).", "Lmao there is no shot in hell you can charge anywhere near that unless you got the house like 10 years ago for cheap", "I just think it's disrespectful to call someone a leech when you're living in *their* home.  Granted, the roommate is paying to live there, but still.", "You can do as you please with your assets BUT your original tenant rented under the assumption that it would just be the two of you…", "Just give her notice. Tell her she is welcome to move out and you can find someone else to rent her room.\n\nYou are not a leech because you are offering a service in exchange for money. She is paying for the room that she would have to pay for elsewhere as well. \n\nNTA", "Did you lower her rent because she has to share a bathroom?", "It was a perfect solution for you, but not for your roommate. You get all the benefit of the second roommate. Meanwhile, she now has a second roommate and has to share the bathroom. She was wrong to call you a leech, but you were way out of line to change the terms of your rental agreement with her. Wouldn't you be pissed if you were expected to pay the same rent for a worse situation?", "NTA, but I think the first tenant's rent should've gone down a little bit since she's sharing the bathroom and there's now a third person sharing in all the common spaces. Maybe $50-100 less a month.", "I think you should have adjusted her rent down.  She signed up for a bathroom and bedroom to herself.  She is now getting less value for her money.  NTA because you have the right to rent out the room.", "Perfect for you because it means you don't have to work. It wasn't perfect for your tenant who objected and who is now sharing space with an additional person.", "Did your agreement with her have anything specific about her bathroom being hers alone?  Because if so, then YTA.  You can’t change your mind on that after she’s already moved in.  \n\nIf you didn’t have any agreement about the bathroom specifically, then NTA, but I wouldn’t blame her if she moves out.", "If she had to start sharing the bathroom unexpectedly, did you offer to knock off a few bucks from her rent?  I think that would be fair to do.  She didn’t come into renting from you thinking she’d have to share the bathroom eventually, did she?", "Aw. Professional landlords ARE leeches, but we're talking people who often own hundreds of houses, driving up the cost of buying while holding shelter for ransom by charging as much as they can for rent.\n\nRenting out A room or even A house is not that! Renting is the right thing for lots of people at any given time: your roomate is being an idiot and a jerk. Don't feel bad!", "INFO: Did you lower the first girl's rent since she now has to share a bathroom and share the house with 2 people not 1 which is what she originally signed up for? If not, YTA", "Dont believe her. I just wanted to say that you are doing the smart thing by making things work to find a better job. Taking care of yourself is very important and a crap job can do so much damage to your health. Dont believe what your tenant says and I hope you can find a great job. You are not a mooch you are using the resources available to you to better your life and that is awesome.", "Leech. Reduce her rent since you reduced what she’s getting for it.", "If she asks again if you're a \"profenssional homeowner now\", answer \"yes, I am. Never heard of passive income? If you don't like it, I can rent to someone else\". \n\nAlso tell her it's not leeching because the money is yours. She is paying you for the room. What does she think renting means?", "She's a hater. Tell her to just pay her rent and min her business.", "Paying basically nothing while others pay off YOUR loan obligations. You should absolutely be paying 1/3rd of the cost for using up 1/3rd of the resource. Paying less than 1/3rd is \"leeching\" off the others.", "I agree. If a private bathroom was part of the deal he should be held to that.", "yeah OP should've at least lowered her rent. a private bathroom is an amenity, one that she is still paying for but not receiving.", "It’s also different living with one roommate you interviewed with than living in a group house where you don’t have any say over your roommates. He changed the terms of the living arrangement pretty dramatically mid-lease, and should have given her the option to leave or re-negotiate the rent. He’s not an AH for renting out the rooms in his home, but if he IS going to be a professional landlord and treat this as a tenant rather than roommate relationship (which he is wholly within his rights to do), then he also needs to take the extra business accountability of that move.", "Right? Unless it's in the lease that the bathroom isn't private, OP made an inconsiderate and possible breach of contract type of call. As far as claiming utilities will decrease, those may not necessarily be cheaper if a third person is added because while costs will be divided among three, they will likely increase thanks to usage. I'd be annoyed as the tenant! Yes, the tenant can be grateful for a good deal but the landlord still has obligations to fulfill.", "I agree. If the private bathroom was part of the deal, then the deal needs to change.", "This 100% applies to Airbnb as well.", "The real issue is our zoning laws discussing enough housing from being built imo. Outside of landlords just being assholes, which happens, the biggest issue is people feel taken advantage of because there is little to no competition to drive prices down.", "Technically, yes, but he's the one responsible for the mortgage.", "Leeches suck off their hosts and don't give anything in return.  If you're getting an apartment for your rent, you're getting something in return.\n\nI'm not saying there aren't landlords who engage in shitty behavior, but it's not a parasitic relationship.", "Ahn, you understood the part where OP is between jobs right? That he is unemployed because of a problema at the old job not because he’s lazy? That he is looking for a new job and he could not be renting the room?", "Then tell her to stop complaining. She’s out of line.", "If she doesn’t want to share a bathroom, she may end up leaving anyway", "NTA. It’s your home, you’re apparently charging under market and she thinks she can tell you your you’re selfish?  Her choices are rent from you at the established rate while you make your own life choices or rent somewhere else. You don’t have to let her berate you not do you have to feel bad about her prospects for living elsewhere.", "So, tell her that. \"We are in transactional relationships, you are getting a room, I am getting money. That's how market works. If you are unhappy about paying for a place to live, you are more than welcome to purchase your own house or move in with your parents or significant other. Until then I'd ask you to keep our transactional relationships civil and stop harassing me\".", "I'd empathize with the sentiment if you were overcharging, but i it doesn't seem like you are? If she's paying less than market rate for a room then she has nothing to complain about. I'd choose not to renew her lease when it comes due.", "Sucks for her. You are offering a service. Even if you are a “professional homeowner” there is nothing wrong with that. She’s jealous. You are kind enough to allow her to rent in a high priced area for a good price and she repays you by being rude.", "And that shows you aren't a leech as if you were you would be charging her maximum rent", "You should learn about boundaries and being assertive. This is a business relationship.", "This is your answer. She can find somewhere else, deal with the roommate, or pony up the extra cash.", "So regardless of everyone saying find new roommate etc, you're a landlord. You're acting as a landlord. You are providing a service and she is paying for it. If you were providing nothing and she was paying, then yes you're a leach. That is not the case. \n\nSecond point, she would have to pay rent anywhere she lived. Does she think all landlords are leaches? Like, what's her thought process?\n\nMy point is OP, doesn't waste your energy on her complaints. She is welcome to move if she is unhappy. And if you want to let her stay, then ok. But her unhappiness is not your problem.\n\nShe's only complaining cuz she's unhappy about the bathroom situation.", "The rules are different when the landlord shares premises with the tenant. \n\nIf it's been over a year you're also well within your right to raise the rent, and that's not being unfair, that's normal in the world of rentals. \n\nThis girl has a lot of nerve insulting the person whose home she is living in. She fucked around and she should find out.", "I know it’s hard to hear, but you have to start prioritizing yourself over others. You don’t owe her anything and her opinion of you will not matter in the grand scheme of things. It is not mean or selfish to put your needs first.\n\nI learned this the hard way. I used to be a doormat to everyone and was miserable because I never put my own needs first.", "Exactly.  You're NTA.  You didn't increase her rent when you were out of work or change her financial terms in any way.  She is not a friend, or a roommate.  She is a tenant.  The agreement is she lives there for $700 a month.  Full stop.", "I don't see how any of that is a, you problem....i had a boarder/renter, once, who pretty much said this, but not in the same way, they said I was money hungry for charging them $100 weekly for expenses, and dinner.\n\nThey were upset I refused to let them eat my childrens snacks and lunches. \n\nI told them if they want me to get them those meals it would cost an extra $50.\n\nI sat them down and told them, if they wanted to pay the extra or they were more then welcome to leave.\n\n They chose to leave.\n\nThen tried coming back a month later because the only thing they could rent for $150 (a caravan with power included) wasn't good enough and the cost of food was too much, they had to spend ALL their money on themselves.\n\nI said no, because I found I actually really enjoyed not having the extra person in my house and the atmosphere was so much more better, without them here.\n\nThe rent they paid only covered their living expenses, so having them here was no gain, nor was them leaving, a loss.", "You can do it. \n\nAll of the reasons you listed are things that effect her, not you. She’s disrespecting you in your own home. Why would you be concerned about her wellbeing and feelings when she could care less about yours? **It’s okay to stand up for yourself and do things that will have a positive effect on your life.**", "that's her problem. should have kept her mouth shut instead of biting the hand that feeds her.", "Then she shouldn't make you feel bad for resetting your mental health while looking for a stable job. She is the one who is at risk of losing her home if she wants to really FAFO. That over a year caveat tells me its time for a yearly price increase to stay current with market offers, but you can still cut her a deal and only charge and extra 200$.\n\nI'm sure 900$ rent is not an easy find at all in any city, big or small, in this country right now.", "Stop being nice. She is taking advantage of you.", "Grow a spine and look out for yourself this time…", "So? \n\nDon’t be a chump, my dear.", "Well there you go. If she’s not paying The market value, then she’s actually leeching off of you.", "Do you enjoy the rudeness and the disrespect? She obviously treats you like this because she knows you're a doormat. It's your house, you're her landlord, she's your tenant. That's it. Not your fault she's stupid and doesn't get this. If she's a pain to live with, you'll make her leave. If she doesn't like the way you handle things, she can go and find a different place.", "NTA BUT I will say that it is a little unfair to change Roommate 1's amenities in the middle of a lease. It's one thing if you expressed this with fair warning, also saying that you would waive the fee the break the lease if she wanted to find different accommodations. But if that wasn't a proposed option, then maybe mild ESH.", "Don't bite the hand that feeds.  You should feel comfortable in your own home and if she isn't comfortable having a rude person live in her house then she has every right to tell her to look for a new place.", "Put N T A with spaces otherwise the bot will count it, instead of the YTA", "It might not even be a third of the living space. Maybe roommate has free reign of every other spot in the house except OP and third roommates bedrooms, but at the very least OP gets a private bathroom and roommates don’t (I’m assuming that granted, but the story doesn’t make a ton of sense if OP and roommate were already sharing a bathroom, so I assume they both had their own).", "It drives me fucking crazy", "The correct term is “housing scalper”. We fought a whole ass war to get rid of lords and kings and shit.", "Absolutely! She is not just sharing a bathroom, but also a kitchen, living room, etc with this new person.", "I think it depends on what was put on the contract at the point of renting. If the contract has the condition that there will be no other renters, then the complains about the shared bathroom use is justified.", "I wonder if they would pay more for the same situation. There’s obviously a lot of potential circumstances here but it seems odd to me that she’d pay more for “well you get one room for $700 and have to share a bathroom”. I imagine she’d pay more but would think she might get more. Certainly depends on the area; I’d pay more for places around me but I’d get an apartment, not one room. \n\nAnd heck, maybe instead of paying $700 for one room and a shared bathroom, she should buy an entire 3 bedroom house, pay $1500 a month, and make someone pay half of it for one bedroom. Or better yet, rent out both bedrooms and just pay nothing. \n\nI don’t think OP is an asshole for the record, unless roommate was explicitly told she would have a private bathroom and OP is suddenly changing the terms. I just think the situation sounds incredibly beneficial to OP and not so much to the tenants. If they’re willing to pay it then no problem, who am I to judge? Maybe OP got a real sweetheart deal on that mortgage that nobody else can get, but man, seems like it’d be way easier for roommate to just pay the same amount for an entire house minus one bedroom rather than begging for a private bathroom.", "Her price point was without another person sharing the bathroom. I’d say NAH.", "Her rent actually decreased from utilities", ">Nothing about her rent increased…\n\nExcept she was renting a bedroom and private bathroom and now she’s sharing a bathroom with no decrease in rent. She initially chose to live with one other person, whom she chose to live with, and now she’s suddenly living with two people, one of which she had no choice in.\n\nThese are obviously different, inferior circumstances, yet her rent is the same.", ">Nothing about her rent increased… she’s paying the same money. \n\nSo she's paying the same for a worse living situation? YTA. The rent should be substantially lower when you increase the number of people living there by 50%.", "That's not what he said. He said similar places + yard are going for 100-200 more. He doesn't have a yard.", "> If she feels $700 is too much, and she’s being taken advantage of, it must be that rent is normally cheaper?\n\nThis is just accepting the logic of the market. It's the same as saying, \"Don't like being paid minimum wage? Find another job.\" I get it's a bit of a weird situation given that OP actually lives in this house. But at the end of the day, they're using their position of relative privilege in an unjust class system as leverage to get their tenants to subsidize their lifestyle, and that's not cool.", "Yeah. The mortgage being covered isn’t extravagant. There are property taxes, utilities (if included in the rent,) maintenance and upkeep, repairs, etc.", "“They’re not paying her full mortgage lmao🤪just enough so she doesn’t have to work!! So what you took away part of her living space and didn’t lower the rent! It’s yourrrrr house😛🤑” y’all are a joke", "Exactly - OP isn't making a profit here. They've just bought themselves a little bit of time to look for work.", "So grocery stores are also leeches? They didn't grow the food after all.", "Was the first tenant the sole user of that bathroom?", "Did it say anything about sharing with one person (you)? Now she has to share with two, of which one (you) is home a lot (which probably also increases the costs of utilities)", "[deleted]", "She was paying for a room and private bathroom", "Renters don't have to kick in half. They basically pay for the whole thing.  Major repairs are infrequent and completely optional for the landlord. If they decide to even make those repairs, the tenants are the ones financing it.", "This is every landlords excuse. The reality is that stuff like that doesn’t happen every day and landlords use it as an excuse to take advantage of people. And for a record, landlord do make tenants pay for that in the form of security deposits and escalated rent.", "It's probably in your best interest to have a lease for each tenant. You can say it's a way to clarify anything that may have been unclear about. For example: how the bathroom is a common area for use by all in the home. \n\nUnrelated but did she think you were splitting the mortgage payment with her? It seems she's upset about sharing space with another person which could be because she thought her payment would be reduced.", "You can say it gently. “I am sorry you feel that way. Would you like to move out?”", "She called you a leech, she who is living in your house, called you a leech!\n\nConfrontational may be the way to go. \n\nNTA, find a job with less stress and don't worry about your rude TENANT (not roomate).", "And we found George McFly's Reddit account.", "Come on. Grow a backbone. This is business, not personal.", "But you rented to her with the promise of having her own bathroom, right? So now you're expecting her to share that bathroom with a stranger. That's a big change. I think it's fair to offer her a lower rental rate because you're taking away a huge amount of her privacy, and the ability to shower, shave, and shit whenever she wants. \n\nI say this *regardless of the fact* that you aren't charging an arm and a leg for rent. She rented the bedroom and bathroom for a year for $700, and your decision is taking away a big part of that. \n\nNTA for wanting to rent out your other room, but Y T A for not considering the impact it would actually have on your current tenant.", "yeah, then completely NTA - what ever her problem is - is exactly that, her problem.", "Don’t devalue your property. So what if there isn’t a yard? \n\nPro tip: The the more you charge, the less likely you are to get whiny ridiculous roommates.", "I guess you could maybe call it bait and switch...and I guess OP could offer a nominal reduction in rent for now having to share a guest bath with someone else -- but if it's already a decent value as OP says...and unless it was explicitly 'sold' as a 'private' bath...it's a rabbit hole. \n\nYet that is not the point here - the point is the renter is complaining that the home owner isn't working --THAT is none of the renter's business, Period.", "Exactly. Where I leave that would leave OP open to legal problems as a landlord. I'd be unhappy with the bait and switch.", "If she leaves *she wont be around* to pay his mortgage. FTFY", "Eh? Just how much are utilities compared to the $700/month that it's such an amazing deal? And utilities go up a bit when there are more people to use the water/electricity/gas. She is being inconvenienced, not sure the $15 she's saving on utilities is amazing enough to make it better.", "Landlord pulled a bait in switch if she never mentioned to the first roommate about having to share her bathroom in the future", "That's not a discount, that's just splitting things equally", "You effectively have raised the first tenant’s rent by lowering the value of the space you’ve rented them because sharing bathroom with a potential stranger the landlord picked (did you consult?) and sharing space with 3 ppl rather than 2. She’d save $10 max on utilities. Not an even trade", "How selective are you planning to be about your next job?", "That is assuming they care.  But you probably know them better than I do, but I am always leary of what strangers are capable of.  Check out worst roommate ever on Netflix. One guy made a lifestyle of this.", "It's not smart to not check that before renting out the first room", "In some places it's illegal for a landlord to live where they have tenants. It does sound like there's taxes you're not paying and legal obligations you're not holding yourself to. Under the table or not your renter has legal protections and you have legal obligations. I hope they get third party legal council from a renters rights group to protect themselves.\n\nYTA for being a bad landlord if only for your expectation that you can do it under the table and not encounter/create problems that greatly effect peoples lives.", "It was truly Wild, I felt like I was living in the twilight zone... It's amazing what people will try and get away with. Tbh, if you're a better landlord than her 😂 I think you're doing alright.", "LOL. Are you just saying silly things just to be shocking? In what way is renting property morally reprehensible? I’m really keen to know.", "Sorry to ask, I was skeptical in thinking it would have been longer. NTA", "If you went into a rental agreement that said \"you get a private bathroom\", and then the landlord unilaterally decides to renege on that is illegal.\n\nNow in this case it seems there never was a written contract, so it'll depend on how the law interprets informal contracts.", "Yeah, it's definitely a transactional relationship. But I've always tried to be friendly to her, and she really hurt my feelings.", "Depending where they live $700 is cheap too they are being ridiculous and have 0 say anyway, they are a boarder/tenant and don’t make the rules.  When the person owns their own house they get to make the rules", "Plus, it's not like this person is paying extra rent because OP is job hunting. OP is NTA and this person is way out of line.", "Especially since mortgages usually are always lower than equivalent rent. If we added up the rent, the two roommates aren’t even contributing enough to pay the mortgage. Let alone the fact that it can be very hard to get a home, and various expenses such as repairs and property taxes. If we used that same logic, we could say that companies are leeches because they charge above the cost. \n\nOP you are far from TA, and I applaud you for reasonable rents. Hell, I paid $1200/mo IN 2019 to live in 1 of 4 bedrooms in shitty university housing in Seattle. Recently, I got a good deal for renewing my 1bd at $2120/mo, while the market rate in my building is $3000/mo for the same unit.", "The whole “their home” argument has been used to spew BS all the over the world all my life. My father used it last summer after violently slapping my nephew. “my house my rules”. Here she pays rent “but still”? As long as she rents it it’s her house too. And though nobody wants to be disrespected in their house, you have to admit it’s different when the house is how you get money, or if the people causing problem are not here by the grace of your invitation. If I change a factory so that it also becomes my house, can I get rid of workers complaining of issues because they are “disrespectful to me under my roof”? The landlord ideal is not something to be proud of. Whenever you bitch on it people look at you like you’re a communist. I understand how this is a temporary situation. But for now he’s a landlord to her. And for her that means he’s leeching. And smarter people than us, a lot of them, some like Thomas Piketty who’s a Nobel prize, agree with her. She was supposed to share the house with one person that she chose. Now he’s looking for someone else. She’s not involved in the selection process even though she’s gonna have to adapt to the other tenant just as well. She didn’t sign on this. I’d be pissed. YTA", "The roommates are paying the bills. Calling someone a leech in their home is disgraceful, but OP wouldn’t have a home if it weren’t for the tenants.", "This, actually probably illegal to boot. Though naturally anyone renting in these situations doesn't exacrly have the privilege of hiring lawyer and upending their living and potentially financial situation.", "Exactly! And how much say did she get in who this new person would be?", "I thought the same thing. Unless she knew when first renting that this was a possibility then I'd feel upset with the change. Yes, technically she is renting the \"room\" but still - renting a room in a house that had my own bathroom with only 1 other person living there is VERY different than sharing one and now a 3rd person. The 2nd renter agreed for that price knowing they'd be sharing a bathroom and that there was 2 people there. I am wondering if there is a written agreement and regardless, what was said verbally when she initially started renting it. If when renting, it was advertised as a room with their own bathroom - then I'd absolutely feel a bit \"had\" when that changed without a discussion/agreement or change in rent. Not enough to call someone a leech and I don't think that's OK but still.", "100% . Unless she was told before this was a possibility then I'd be feeling a bit screwed over. Especially if no discussion was had in advance or minimal warning where I could even try to find another place to live. Sure, some may value saving money more than having their own bathroom and decide to stay anyway but you can't assume that's the case or think they should be happy they have a cheap place to live regardless of the situation. They may not feel it's worth it anymore. Which hey - they can leave unless there's a lease / written agreement preventing that in some way but if they had minimal notice then they were forced into something essentially. Hell no would I want to share a bathroom with a total stranger.", "Agreed - lower her rent", "This. What she agreed to was changed. This is why you need written contracts. Its a lease even without being being written. She is understandably mad about it, even if she says things too far", "She still deserves to have the conditions of the agreement met - they were changed without her consent, in a way that affects her every day. That's shitty behaviour.", "I mean, this dude is doing this under the table where he can avoid tax, apparently, whatever, but tenant rights still apply here which I am not sure he is aware of which means a verbal lease cannot necessarily simply be changed", "Why are so many people down voting this... All of them can't seriously say they'd have no issues with those changes made midway through a lease. $700 is a lot for a bedroom and SHARED bathroom in almost all locations.", "The fact of the matter is owning property is a privilege. I know we have cult of wealth in this country where we pretend we're the only reason anything happens in our lives, but come on. I have a pretty nice gaming PC...and guess what there's about ten thousand things that could have occured in my life to prevent that, but they didn't. Same thing with my car and anything else. My choice to save and work is practically irrelevant in terms of causality and certainly not the shining example people want to think it is. People vastly over estimate the amount of control they have over their good fortune. \n\nI know that's not how we think, as a sense of free will and internal narratives are a part of human psychology and usually extremely important for a sense of self worth but this 'no one should be envious of your good luck' vibe I'm seeing here is ridiculous and only makes sense in a just world, which this is most certainly not even remotely. Obviously he does not necessarily need to be apologetic, but some awareness goes a long way, usually people don't say asshole things for no reason. I'd be mad too if I agreed to a lease (verbally counts as well), and then the lease is upended", "I do wonder if the bathroom in general is also the guest bathroom. Many houses with two bathrooms have one private and one \"open\" bathroom that she may have been primary user of", "Should be the other way around.  Unless explicitly stated to have a private bathroom in the lease, shared would be the expectation.\n\nIt's usually renting a bedroom with access to shared spaces.", "Agreed", "Air BnB is far worse than being a landlord. at least landlords are providing long term housing for people, air bnb are reducing the housing stock in the area, helping push up rents and housing prices while often charging more than more traditional forms of holiday accommodation.", "which he's neatly subcontracted to his tenants and he's only paying one fifteenth of it himself.", "You understand the part where OP was not fired but CHOSE to rent to an additional tenant so they could quit simply because they were unhappy? You understand that OP chose the option to completely disrespect and inconvenience their paying tenant to make their own life easier? I've had jobs where I was physically assaulted to the point of drawing blood and permanent scarring by patients and verbally assaulted by my bosses on a daily basis and couldn't quit because I would've been homeless for not paying my own damn bills. The fact that OP is not paying anywhere near what the tenants are makes them, by definition, a leech because without tenants to feed off of OP would already be on the streets. \n\nPutting a burden onto someone else so you don't have to hold it is basically the definition of completely selfish laziness.\n\nOP is TA and a leech in this situation. If OP had been fired I would almost be willing to accept your BS excuse for them but they had the discussion with their paying tenant BEFORE THEY QUIT and then made the decision to find a second tenant so OP didn't have to worry about paying their bills.\n\nEven owning the house, subletting of an apartment without full consent of the current tenants is illegal in some places and for good reason. If I was OP's tenant I'd be looking into my legal options for getting rent lowered and overpayments reimbursed just because OP was a jerk about it. Even if it's legal where OP lives it's still a really crappy situation to force someone into, especially when that person is paying your bills.", "If she wants to bitch, she can bitch about paying the market rate.", "Exactly this!", "Not massively under, and my house doesn't really have a yard. So I think it's fair. I've seen rooms go up to 1200 that were massive and had attached baths and the house had a pool and stuff. But houses like mine where the rooms don't have private baths and there is no pool tend to go from $800 to $900 per room and like I said, no real yard, so it seemed fair.", "Elegantly said.", "Which is it? A transaction or a kindness? She's out of line but OP can't have it both ways", "I used to rent a room from a person. He had no problem raising my rent after a year.", "Yes the rush to report everyone to CPS is chilling as well.", "And a landlord who no longer works and is bound to be around more.", "Just because it's what OP is paying for a mortgage does not mean that you could *rent* a comparable house in the area for the same price. Mortgages are usually cheaper than whatever the market rate for rent is. I don't think it's that confusing. \n\nIt's beneficial to the tenants because they are paying below market value. Unless they have the money for a down payment, it definitely wouldn't be easier to buy a house.", "Still if other places that offer similar are going for $200+ more than what she's paying, I'd say sharing a bathroom could be considered in that price difference. Plus op said the new roommates room used to be a guest room so I doubt there's anything on the lease about never having to share a bathroom.", "I guess it would depend on whether or not the room was advertised with a private bathroom or not… I don’t think the OP stated whether or not that was the case. Even if a landlord isn’t currently renting out another room, unless an advertisement/contract stipulates the bathroom is private, the tenant can’t assume the bathroom is only for them.", "Not imo. Had a spare room, now it’s normal occupancy. Maybe a small drop would be fair… but she’s already below market rate. \n\nSeems pretty ridiculous to be mad", "I mean, I can’t argue with you this system is pure garbage. \nI think we should consider that OP didn’t create the system. It’s not their fault. They likely had to put up a huge down payment to secure that mortgage. \nIn my case, it came out of my RRSP. Was not provided by family etc. \nso subsidizing their own living situation while also providing below average cost housing to two other people doesn’t seem like an evil capitalist to me", "Dude, it's literally someone renting out rooms in their own house. Yeah, clearly OP is an evil capitalist who only wants to... not lose their house while between jobs.", "This. Let’s also mention how OP most likely had to have a decently sized down payment just to be approved for a mortgage.", "Unless it's rent to own OP is profiting by building equity.", "Guests also used it.", "No. I never let her use the guest bedroom. It had a separate key. My mom would stay there sometimes and my aunt. And I used the walk-in closet to store linen and seasonal decorations and stuff. When I decided to rent it out I put the stuff I was storing in my room. Now when my family visits they just use my bed.", "She was paying for a room and splitting utilities for shared spaces. The only private bath is in the master bedroom. She just got lucky that there wasn't another tenant to share with.", "Okay, yeah, if she brings it up again, I can day that. That's not harsh.", "Like from back to the future? I don't remember there being a part where he has a roommate.", "I look forward to her post on r/legaladvice where we learn about tenant rights\n\nOP rented her a room and a bathroom and unilaterally changed the terms\n\nYTA", "Her problem is that her living arrangement has spontaneously changed and her rent hasn't. Ask yourself this, would she have to pay more rent to OP if she moved someone in with her? Or would they just \"divide up the utilities\"?\n\nPlus OP even says there's no lease. So probably no insurance either, which will make declaring this income a bit odd. Bit of a sticky situation if you ask me.", "Wow. You’re a landlord aren’t you?", "I wouldn’t have complained , just demanded my security deposit back on my way out the door with any movers .", "You think utilities on a house are $45/month?  lol", "Depending on where you live, could be significant.\n\nMy utilities in Texas are hundreds of dollars a month.  So going from half to a third could also be hundreds of dollars.", "I don't know. I'm seeing what happens. That sounds vague, but I'm considering many different paths right now, so I don't have a concrete answer.", "Oh, I don't think I should look that up, sorry. I get really bad anxiety. I do think she cares, yes. Evictions can really ruin people's lives. I even remember her saying something about it once during that one John Oliver episode.", "Well it is probably going to be longer. I plan on doing lots of interviews and really taking my time to weigh all options before making a decision.", "That makes sense, I hadn't thought of a private bathroom being in a rental contract.", "Tell her if she is unhappy she can give notice and move out.\n\nDon’t let her make you feel bad. She knew what she was getting into, if she feels that way landlords she probably shouldn’t be living with one.\n\nIt might be a good idea anyway. There are some really vitriolic opinions on landlords, which is probably where the “leech” thing is coming from. If you read some of the stuff it’s super dehumanizing and sometimes a bit violent?\n\nI’m not trying to scare you or anything but all things being equal, living with someone who doesn’t think of you as a leech is probably best", "Tell her feel free to find another place to live if she feels that way. I am sure that you can find someone else to rent that room. Maybe even for a little more money.", "Well if she’s unhappy let her know you will let her out of her lease. She can move out tomorrow if she would like. \n\nOh.. wait…. It’s cheaper to live where she is? That doesn’t sound like you are a professional. A professional would be making more money.  Hmm…  in order for her to be right you would need to raise her rent. So you can professionally pay zero of your bills. \n\nNTA. Look you took the risk buying a house and pay for repairs. Would you be a leech if you just had savings? She’s mad her life changed. I wouldn’t feel bad but honestly if she’s miserable offer to\nLet her out of her lease.", "Well, lesson learned, fuck being friendly.  She's not a roommate, she's a tenant.  If she's not on a lease, I'd tell her you're planning on raising her rent as a \"market adjustment\" after her conversation helpfully made you look at things in a more professional light.", "Bro don't feel bad, this is the smart way to pay your mortgage. Even with a job I would keep a roommate just to suppliment that. Your house, they need cheap rent, etc. I currently live with my friend who owns the house and I have no issue paying bc its the cheapest rent I can find while I get back on my feet. Its transactional yeah, but it helps everyone out. Otherwise I'd be paying 1200+ a month, and I'd be boned rn, lol.", "You’re not leeching. A. You are looking for work. B. Being a landlord is a job in itself and you are a landlord.\nNTA.", "@OP: remember: it’s YOUR house, not hers. She’s a tenant, not co-owner. Not even simply a housemate: cos housematw implies you hunted together and share everything towards costs. She’s not that. \n\nSo go rent/stream the Joy Luck Club and channel that scene when the wife tells her spineless husband: “Get out of MY house.” \n\nWRT to the gaslighting: no, you’re not leeching off her: cos it’s your house, your life, your options, and if your wise, rational decisions offend her, here’s what to say “I would hate that you feel unhappy living under these conditions that you object to, and I don’t want to be told that I am leeching off you: you should be free to exercise the options and find somewhere else where you would be happy.”", "NTA—The thing is, it’s literally none of her business what you are doing for employment and with your money. It’s a business relationship. That’s that. Maybe her physical proximity to you made her feel entitled to comment on the situation, but it was completely out of line. Moreover, if you’re leeching off of anyone, it’s your past self for saving that money. You were smart to save money, and you were smart to quit a toxic job that was affecting your mental health. She has no right to an opinion here.", "That was the point. She was trying to shame you. Thing is, you are using your assets to ensure you don't have to take a terrible job. There's nothing wrong with that. She can move out of she feels you're leeching off her. Meanwhile, anywhere she tents, she's giving money to a professional homeowner, aka a landlord.\n\nNTA", "I'm sorry but why are you allowing that disrespect in your own home? you can even not work and just rent the rooms and sit home all damn day if you want, they really shouldn't be saying anything to you.", "NTA. My brother rents out the extra rooms in his home. Nothing wrong with being smart about your finances.", "For some people being friendly is a sign of weakness. If you meet such people cut them off. I suggest you to get rid of her legally. Don't renew her lease and rent to someone better. It is very clear that she is not happy with paying any rent and she would like to have whole house to herself. If she is not happy let her go.", "I’m in the same boat. I had a breakup recently, and I’m renting a room in someone’s home. I would never call him a leech for renting me a room for 650$.. she sounds ungrateful.", "And that's why you keep business separate from personal.  People are funny like that. It's all good until they feel you have little more or have a great opportunity.", "$700 sounds Like here in California and in that case she should really be quiet and know she has a decent deal", "Seriously, even from what I hear about NJ (family lives there), rent has gone up to like $1000 for a one bedroom apartment. Here in WA you're lucky to find a place for $1000 for a studio or a one bedroom.  Most places are around $1300-1500 for studios/one bedroom apartment, and that's considered cheap.", "The roommates are paying to live there, and paying a portion of the utilities.  (It sounds like each roommate is paying a third.)  And the fact is, if those tenants left, he could get different tenants.  \n\nI'd much rather be in his position right now than theirs.", "Yeah, I very very briefly rented a room from someone where I was told it would be the owner and his wife in their suite and then one female roommate that I would share a bathroom with. \n\nWhat it actually turned out to be was owner + wife, female \"roommate\" was the owner's adult daughter and moved in her baby daddy and their toddler and the other bedroom was being used by another family member and their partner who had three kids staying over every other weekend and sleeping in the living room. 6-9 of us sharing the second full bath and a powder room and up to 4 hellions screaming when I was trying to sleep after a night shift. Couldn't ever do laundry or cook because someone else was always already using the appliances or waiting to use them. My \"fridge space\" turned out to be one and a half of the fridge door shelves so good luck storing any actual food. Then the dude was all shocked Pikachu face when I told him I was moving out after two weeks.", "Good point. The whole situation is messy.", "If it's anything like my house I'd be even more pissed as the roommate. 2 full baths, one is the master en suite and the other is a semi-attached bathroom that opens into a bedroom on one side and the hallway on the other. If you're only using the attached bedroom you lock the hall door and the bedroom door to keep people out but there's really no good way to prevent someone from going through the bedroom-bathroom door uninvited unless you completely block it off. So not only would you lose privacy but now you have to leave your bedroom to use the bathroom.", "Even if not in the lease, it may have been stated while being advertised or verbally when they discussed it or when they came to check it out. Like.. \"It's just me here. So this would be your room. I don't use this bathroom, it'd be all yours\".  Even if lease/rental agreement does not say specifically either way, it may have been implied in some way when advertised or while talking and likely a huge part of the reason someone agreed to live there. Regardless of legality, it comes across as dishonest and misleading and I think it's reasonable to expect someone to be upset by it. OP could legally do it even if it upset them, but it just shouldn't be a surpise that they are upset or feel a bit taken advantage of since the value the $700 used to get them has changed significantly. It should have been a discussion or written to begin with. The renter would have learned a hard lesson to make sure things are in writing", "She’s just renting out extra rooms in her house (and for cheaper than market rate too). How is this leeching? It’s like I have a car that I don’t use all the time, so I let my friend use it for a small fee and now I have some passive income that allows me some flexibility in my work choices. It’s called using your resources to make your own life easier, it’s not like she’s buying up all the houses on the street and jacking up property prices. The house would have been hers either way, the only difference is whether she would have to stay in a job she hated or not. This way the renter gets a cheaper deal than normal and she gets the flexibility to quit the job she hates. No one owes you a room in their own house lol", "You understand the part where OP actually OWNS the house and can rent it out as he/she sees fit?  Unless it was in the least she got exclusive use of the bathroom then NTA.\n\nJust because one room was unoccupied when you moved in does not mean it will  always be so.", "Would she say that to a landlord who isn't a live-in landlord? You own a home, you rent a room out to her. You could sit in your room, plaiting your pubes, warbling Bohemian f*cling Rhapsody all day, and her personal opinion of you would not matter one iota.\n\nEdit: autocorrect changed pubes to pubs.", "Where it's you or not, she would likely be renting elsewhere. So don't feel bad, she's getting prickly about systematic things and taking it rudely.out on you. Take a step back, don't extend yourself to be overly friendly and maintain a professional distance. If shes going to get confrontational like that to your face, just save yourself the emotional drain and focus on your next moves.", "You don’t have to raise her rent or kick her out or anything but it’s obvious she doesn’t really respect you as a landlord or a roommate. It’s great that you want to keep things fair but she sounds like the type who will walk all over you if you let her.", "I saw another person on here saying that they use a Management Service to rent out their spare rooms. From the other renters perspective they think you're just another tenant - the trick is to NOT TELL THEM you own the place.\n\nIt keeps your private life and business of renting have a healthy boundary.\n\nAny changes you make you do through the service, so no more of those \"feeling guilty\". Long term, you gotta do what you gotta do and that will include making difficult decisions that benefit you.\n\nNTA in this situation, how you manage your money is none of her business.", "Both. It’s a transaction but the low price relative to other places in the area is the kindness.", "That's not what he said. He said similar places + yard are going for 100-200 more. He doesn't have a yard.", ">I doubt there's anything on the lease about never having to share a bathroom\n\nJust because it's legal doesn't make it moral. OP and tenant had an agreement, landlord decided to unanimously change that agreement for his huge benefit at a cost of space and privacy to his tenant.\n\nTotally legal, asshole move.", "It's not just the bathroom, a lot changes with more people in the apartment.\n\nThe owner should state \"this is a guest room/storage room\", or \"this is another room im looking to rent out\" before renting out the first room. Calling it a guest room/storage and then changing it after she's moved in is asshole behaviour.", "The living arrangement changed. When you move in like that it's a lot more to consider than just the rent and square meters. These are strangers living together.\n\nIt's also not just a spare room, they share bathroom and kitchen I assume. So the kitchen and bathroom will be occupied 100% more, and your room in cabinets and fridge are 33% less.\n\nTwice as likely to wake up in the middle of the night because a roomate drops a glass. Twice as many friends come over to the apartment. Twice as likely to have your shit stolen. Twice as likely to get assaulted by whatever guy the new girl brings home. \n\nIt's a lot more than just a room.", "Big difference between occasionally sharing a bathroom with guests and daily sharing a bathroom with a roommate, also guests don't tend to bring their own stuff; products and appliances (hair dryers, curling irons, hair straighteners etc) that permanently take up space.", "Be careful and move anything not replaceable out of the house. Scan all important photos. Backup all of your electronics to some cloud. Document anything expensive and scan receipts. You should do all of this anyways minus the not replaceable stuff, for your home insurance. \n\nIt's a long shot that she'd destroy your stuff, but you wouldn't be the first landlord whose tenant destroyed their property.", "I'm hung up on you being so worried about being \"harsh\" to the person that called you a leech in your own home. Sweetie, I don't think you are cut out to be a landlord  <3", "George \"Isn't good at confrontation.\".  As he says.", "They are referring to you being a doormat. You're being way too passive here, stand up for yourself.", "Oh, bless your heart.", "Op doesn’t have a formal lease agreement or is reporting the rental income either. They’re doing a lot more wrong here", "They’re coming out the woodworks in here and it’s fucking disturbing to hear how they talk about other human beings.", "No, and that math doesn't make any sense. I'm saying that with utilities going up anyway, the savings might be low enough not to make a whole lot of difference.", "Well, that’s Texas. You have the country’s worst and most price gouging utility setup.", "It's also going up a third.  Not a great deal", "I'm getting the feeling from your post and your responses that you are already thinking about not working permanently but feel guilty about that. The reason your housemates comments have hit a nerve with you is because some of it rings true to you.", "Why do you blatantly ignore all the post accusing you of bait and switching? (Which you technically did do)", "Yeah, skip that one then.  It was a really messed up guy.  Did this to multiple people and ruined their lives and credit due to them not being able to pay their bills. Things ended very badly for him and others around him.", "So  what if the roommate does move out but OP doesn’t find another tenant to take her place and pay the rent she was paying? That puts OP behind the 8 ball. Not the greatest advice", "That feels a little unnecessarily confrontational. After all, shouldn't she and the other girl be paying the same? And the other girl only moved in three months ago, so it seems mean to change it after three months.", ">. If she's not on a lease, I'd tell her you're planning on raising her rent as a \"market adjustment\" after her conversation helpfully made you look at things in a more professional light\n\nThis is why people hate landlords. Powertrips don't look good on anyone", "Right. She's a tenant. A tenant who agreed to pay $700/mo in exchange for a room, private bathroom, and one roommate, and is now being told she has to pay $700/mo for a room, shared bathroom, and two roommates. Her living situation has been downgraded and OP wonders why she's salty about it.", "this is why people call landlords leeches lmao….", "And when she moves out and OP has to pick up the tab for her rent or go back to the job he hated, what then?\n\nThis is a terrible idea.", "There are laws about when you can increase rent and by how much", ">If she's not on a lease, I'd tell her you're planning on raising her rent as a \"market adjustment\"\n\nYeah because that doesn't sound super illegal, as if peolle aren't protected outside of a lease. As long as she's living there, she's a legal tenant. And I don't think the landlord gets to make unanimous decisions about the tenants living spaces without adjusting the agreement between both parties.\n\n\nNot just this leech deciding he doesn't want to work, and you saying he should raise her rent because she doesn't want to be taken advantage of.\n\nWhat the fuck is wrong with you morally?", "I’m in WA too and I lived in a 1 br in Kirkland for 2 years and my place was cheap with rent of only $1550/ mo", ">I'd much rather be in his position right now than theirs.\n\nThis means nothing. I'd rather be a leech than a regular worm", "bruh I'm sorry for you", "It was a little different when I was renting part of my house because the bathroom was basically en-suite, but I made sure to write an \"emergency\" exception into that bathroom being private in general. I'd have to look up the lease and don't feel like doing that now, but the lawyer who wrote it included plumbing breakdowns in my bathroom (there are only 2 in my house, so that makes sense) for sure, and I think may have included health emergencies for me or my guests (like someone is going to get sick and the only other bathroom is occupied). It was also reciprocal, so if the boarder's bathroom was broken (and here is where I think it was super-specific to the toilet and shower/bath, because if someone just needs to wash their hands, there's a kitchen sink in the common space that can be used) or there was a health emergency, they could use mine.", "Thanks for the mental picture newpe...", "Omg. Hilarious!!", "I disagree. The risk you take renting a room and not an entire property is that other rooms may eventually be rented out as well. It just is what it is. I can understand being disappointed that you now have to share a bathroom, but it’s not a reflection of OP’s character.", "When you rent a room in the house, you are usually getting a private room and privileges to use the rest of the common space in the house. Unless it is specified in the rental agreement that you have exclusive use of any other rooms, you’re going to be sharing space with others in the house. Unless the number of people in the house exceeds the number of bedrooms in the house, as a renter you have no right to tell the owner whether they can or cannot rent out other bedrooms. The renter simply resents the fact that OP is not working and is being “subsidized” by her rent payment. Guess what? She’s been subsidizing OP _all_ _along_. If she wanted complete control over her living space, she could (1) rent an apartment on her own or (2) find a friend to share an apartment together.", "If it is no longer worth it to her, she can move out. When you rent a room you don't get a vote in what happens to the other rooms in the house", "It really isn't. When you rent a room, you're renting exclusive, private access to that room, to an en-suite if applicable, and then access to shared spaces the landlord has complete control over. If they choose to change the kitchen cabinets, they can. If they decide to fill the other guest room, they can. \n\nIn this case, the tenant has access to a bathroom they didn't have to share often (only with guests) but that was not an en-suite.\n\nTenant can decide it's not worth it to live with an additional person and move. But OP is NTA for filling the other available room and not a leech for using the rental income to take the time to find a more enjoyable job.", "if she would like say over the other room, she is welcome to rent it. I don't get a say over who moves in and out of the apartments near me, or the houses nearby, even though I pay exponentially more than the roomate in rent. When you're renting a room, you're doing just that- renting the *room*. The areas outside that are communal.\n\nRoom locks are cheap, and if she truly wants a solitary place with just her, there are plenty around that she can rent. Affordable, probably not unless it's super far from where she wants to be, but that's the unfortunate state we're in as a society. She doesn't get to take that out on someone charging her a lower price than anyone else in the area, especially when they're escaping a toxic work environment.", "Oh right. I forgot. Sorry, haven't watched them in a while.", "I'm aware, just saying there are possible scenarios where splitting utilities isn't nothing.", "How would that even be possible when OP is having to dip into their savings? Not working isn't viable for them.", "What part of “I have to find work within a year or I’ll wipe out all my regular savings and have to start using my emergency savings for food” gives you the feeling they’re planning to never work again and just live large off of their tenants?", "Where on earth did you get that from the fact op has at least $600/month uncovered living expenses even with the two roommates???", "I read them. You're not really supposed to respond to people unless they ask a question, just accept their judgement. They judged that I was duplicitous. There's nothing further for me to say.", "That gives me a stomach ache thinking about it.", "You're still living there.  Don't make things worse just to prove a point.  Making things more hostile just because you raise her rent and she was mean wont make you feel better.", "I read an AITA here a while back where a woman was in a similar situation as you, only she didn’t tell her housemates she owned the house. Instead, she hired a management company and that’s what her tenants paid rent to every month. \n\nOf course you can’t do this now, but in the future if your housemates leave, you might want to consider this plan. It would save you some headaches and help you avoid confrontation and judginess from housemates, going forward.", "Don't do this, it will make your living situation stressful. Reddit has plenty of people who like being very nasty on screen.", "Just chiming in to say do NOT take this advice. Not only is retaliating against a tenant a dick move, it could get you into trouble depending on where you live and what kind of protections renters have.", "I would have another conversation first to set a professional tone. Tell her straight up that you don't appreciate being called a leech by someone that's living in the house you bought. Tell her it's extremely hypocritical for her to be complaining about paying the exact same rent she's been paying this whole time. You having a job or not doesn't impact her or how much she pays, so how exactly are you leeching off of her? Also let her know that as her landlord, you're going to refuse to renew her lease if she continues with the hostility. This is her first warning, and she gets three (or however many you want to give her). Just some food for thought.", "for real, that's an asshole move. do not take advice that is vindictive and selfish. \n\nyou're NTA here but some folks in this thread sure are.", "If the leases end at different times, then you may be making rent adjustments where they aren't paying the same all the time. (You have leases, right?)\n\nAnd there can be lots of reasons why they don't have the same rent (room size, view, access to other amenities etc)", "Yeah don't do that it got a lot of upvotes but as a fellow \"professional homeowner\" it's not great advice, if that's all she's done and she's otherwise been a good tenant who pays on time and isnt a hassle to live with maybe talk to her about how she hurt your feelings but dont do anything that would make her leave, a good tenant can be a hard thing to find and a lot of nightmares out there who are good at hiding what they really are before they move in.", "It would be vindictive and ridiculous to punish someone for expressing an opinion that hurt your feelings.", "Yeah AITA seems really fond of giving shitty advice and acting like people are total doormats unless they follow it. Don't raise her rent in retaliation. If you think you can replace her relatively easily, then maybe suggest that she finds a different living situation.", "It definitely is unnecessarily confrontational. It's retaliation, which will only make things uglier.\n\nTenants don't necessarily have to pay the same amount, and it does make renting really hard to have rent change often. Don't be that landlord.", "Yes. Redditors often like to suggest retaliatory things they know full well they’d never try themselves.\n\nLook, she’s your tenant. She gets what she pays for which is a room with pretty low rent. If she’s not happy, she can go. What do you do with the house that you own is up to you. She’s in the wrong for asking any damn questions about your finances. \n\nBest of luck finding a new job you like.", "Yeah i disagree with the commentor on doing anything out of spite.  It wont end well and just breeds animosity.  HOWEVER i do agree in that you need to put your foot down and confront them on how they spoke to you was unacceptable.\n\n1. Constructive feedback/complaint is fine in regards to something they want to fix/change about their living conditions.  But that should not consist name-calling\n\n2. Its none of her business on how youre managing your own money and job", "So you’ve been out of work for 3 months? Man, I’d hurry it up.", "Personally, I would be willing to pay less for a three person houseshare than a two person, so I can see why she's pissed off with you.", "I agree with you. In addition she has lost her single bathroom which if you advertised/contracted on the basis she would have one, could get tricky. I don't think you're the asshole but I think you would be if you raised the rent due yo a personal disagreement.", "You don't have to be confrontational. You also aren't obligated to renew her lease. Which is my suggestion. Make sure you do this legally and correctly but I would frame it as, \"You have made it clear you aren't comfortable with living in my home and I'm going to forgo renewing your lease so you have the opportunity to find a residence better suited to your needs without breaking the lease.\" This is also what I would have advised her to do. I'm a poor person. I also rent. I chose the shitty low income apartments vs a roommate for medical reasons that paid off for me with pandemic. It's not perfect but I am also not the one on the hook for the leaky roof, broken appliances (they're included in my lease), and I can find a more expensive non rent controlled option with less crime if I wanted. I just would starve. I don't pretend my landlord is my friend because it's a business transaction. \n\nEven when I rented a room no one was my friend after the first time I fell for that manipulation. Living together with someone owning the space is absolutely a choice. It does not mean you owe them something outside your lease. You may want to look into hiding your ownership from future tenants and using a management company or something along that line so you have a buffer this way. If she doesn't want roommates she needs to live in a single person space and pay for that.", "She's paying below market and giving shit to the person whose house she's living in.  That's the power trip here: being an AH to OP who is obviously high strung and mousy.\n\n  Newsflash: OP doesn owe a room to her.  OP didn't give birth to the brat.", "Yes - I bought my first house last year after many, many years of living in share houses. I rent out a room in my house - if I want to change the conditions of the house so that someone is sharing a bathroom and also sharing the house space with an extra person, then the rent should be lowered to reflect that. \n\nI think the tenant is annoyed about that - not so much about you not working (unless you’re home all the time and that is yet another encroachment on her use of the house!!!) \n\nYour tenant is not just paying rent for her room, she is paying rent for the use of the house. You changed that use, and didn’t lower the rent even by $5 or $10 a week. \n\nHonestly, this is a YTA. (Although - the tenant should have asked for a reduction in rent or said she would move out, so it’s kind of on her too).", "Ah  yes.  I missed this.", "So she moves and has to pay more for a room in that area, but at least knows it from the beginning and OP gets even more from someone who isn't salty.  Win/win.\n\nOr she doesn't move because she realizes she's not going to do any better, and gets over herself to keep peace with the person whose house she lives in, after a reality check about her situation.  Also a win win.\n\nTell me the downside of asking salty tenant to pay market rates again?  I lost it in there somewhere", "Nobody ever said she had a private restroom. To me it sounds like an extra restroom he’ has and maybe it’s the regular common restroom that she just so happens to not have to share because he has his private one…And if it’s a shared restroom It Hass to say in the lease that she doesn’t have to share it with any more than one person; needs to be specific. Is there anything in the lease that says he’s not allowed to have family stay, Does it specify how the restroom is shared etc etc if it doesn’t then she’s not entitled to compensation for changes aren’t even specified in the lease", "It's not illegal, if there's no lease in most jurisdictions it's month to month.   Meaning it's negotiable almost at will in most jurisdictions, ESPECIALLY when it's also the owne's primary residence.  You're talking out of your ass.\n\nIf  tenant doesn't like it, tenant is free to move.    OP made clear that tenant is living there paying under market rates.  If anyone is taking advantage of anyone it's bratty tenant who's using OPs obvious issues with confrontation to live under market rates in someone else's house and acting like they're entitled to it.\n\nHow is someone living in their own house and paying a mortgage as best they can a leech? Lol.   In what fucking world view is tenant owed OP's labor?  OP should work to help keep tenant from paying more?  Lmao.  What percentage of OPs paycheck does the tenant have a right to, exactly?", "I think the specific detail of the song being Bohemian Rhapsody really made it *chef’s kiss*", "Haha, well if you want to drive a point home...", ">If it is no longer worth it to her, she can move out.\n\nThat doesn't make OP not an AH though. Forcing someone out of their home by making changes to their living arrangement against their protests still makes someone a jerk.", "This is AITA not legal advice. Of course he has the right. But it's an asshole move to have someone move in on some pretenses and then change it afterwards.", "I understand being afraid of confrontation, but you gotta learn to stand up for yourself. It’s unacceptable that she insulted you in your own home.", "Sorry about that. But just be careful and you are NTA here.", "I know, this person giving terrible internet cowboy advice. Shit sounds great on reddit but doesn't work in the real world", "Totally agree. The important thing is that you understand that you have not done anything that is wrong or crummy in any way. At all. If the first tenant does not like sharing a bathroom, she can find a new place. It's that simple. She was being a total jerk to you. Don't let it affect your self-image.\n\nThe one thing you can learn from this is that if you decide to let a room go vacant in the future, you need to make it clear to the present tenant that having the bathroom to themselves is a courtesy that they may lose if you decide to rent out the second room of future point.", "Once OP gets a job and the lease runs out, Miss Thing should just gtfo. And OP can shut the lease renewal off, or deny a month-to-month if done...I think, at least a full month in advance? IANAL, so OP should check on their rights in their state on that one.", "I remember that one, the tenant tried to force that OP out of her own home, saying the management company said they could have the whole place or something like that.", "Long term, this is actually the right answer.  If you're going to be a landlord, be professional and self protective about it.", "In that one, though, the owner and the tenants were in separate living quarters, not sharing space. That's legally different, and the owner has more rights when they share the living space with the lodger. It may be advantageous to have the lodger know they are sharing space with the owner and don't have the same rights of a tenant.", "u/Miserable-Hat-6390 Pay attention to this. Because, from what you described, as soon as you have a job, this tenant is going to be asking for her rent to be reduced because you are now renting and have a second tenant and don't need as much money so she should be entitled to a discount.", "I agree what you describe barely even pays your mortgage it doesn’t support you much other than that", "I mean her living conditens got worse because he rented to one more tenant to make more money. The rent should go down to reflect that.", "Yes - you don’t want a huge confrontation, but you do need to make it clear that her behaviour was unacceptable and that you won’t be bullied in your own home.\n\nIn my experience, bullies only back down when you demonstrate you won’t put up with any further bad behaviour.", "The rooms are the same size and both have two windows that don't face anything but my neighbors.", "They have to be a little bit careful about that in Cali we have a lot of renter rights around here and that room rent sounds pretty Cali to me😂😂 in which case he’s charging her kind of cheap and she needs to STFU", "I don’t think you should kick her out or raise her rent out of spite but you do not have to take that from someone renting from you. You can find a new roommate if she doesn’t like it and she can move out.", "What would you call someone calling you a leach for owning a home you live in?", "Yeah, just like if I owned a shop and banned someone who came in berating me. This is his home, he shouldn't have put up with comments like that.\n\nNTA", "It's not being vindictive.  OP owns the house, AH tenant has no right be there beyond that.  This is a purely transactional relationship.  Tenant wants to be an asshole, tenant cam pay market rates.  OP made clear they charge less than average", "Another way to look at it- she's paying almost $1000 a month (including util) for a bedroom. Whether that's below market or not depends on the area but that's still ridiculous.", "I mean OP could've just changed the terms of the lease ( if there is an official one, haven't seen in the comments yet) whenever it was up as well, and considering they're offering below market for the area then fuck em, OP NTA. If there's a spare room that's not mentioned as being kept a storage room only then you as a renter shouldn't be that surprised if that changes. Would be the same deal if OP had a significant other move in", "When you rent a room, you are renting the room and access to shared spaces.. Period. \n\nUnless OP told their tenant, upon move in or in a lease, \"You will have exclusive rights to the guest bathroom save for occasional guest usage and I will not move in an additional tenant in my other empty room\" OP is not the AH. If you have a comment where OP confirms they did say something like this I'll agree, then, that they're the AH. \n\nOtherwise, the tenant made weird assumptions about how room renting works and is now annoyed because they were wrong. And they're using they annoyance to insult their landlord. That makes tenant the AH.", "No, it's okay. I appreciate the information, even if it did make me nauseous.", "Yeah if you’re living with the person it’s probably not a good time to be a vigilante. I know Reddit loves it’s revenge porn but jfc have a reality check.", "Absolutely not. She’s technically not your roommate but your tenant. And as a tenant, she doesn’t need explanations as to any of your personal or business decisions/information. Period. Remind her respectfully that she’s a tenant. That you’re not asking for any advice on this matter and if she continues to act as if she’s the homeowner, then simply reply she’s welcomed to give her 30 day notice since we can not seem to work our business arrangement out. Obviously finding someone to take the bedroom will be no problem. \n\nThis woman is way out of line. From this point onward, don’t explain yourself to her unless you feel she has a “need to know” type of situation like having work done that may be loud during this time to that time, type of situation...\n\nI was renting a room out and for the first year, I was the only tenant and thus had the 2nd bathroom all to myself. In fact, had a small living room/study room as well to myself. \n\nWhen another tenant moved in, we had to share space, primarily the bathroom. Did I like the idea of this?? Absolutely not, however, I remembered that I was a tenant foremost, (though the owners are my friends, have been for over 13 yrs. prior and still current since) the new girl and I showed respect for one another, I removed half of my items from the bathroom so she could have equal space and we managed to get along with one another. I worked nights and she days, so this helped out as well.", "Yep — that’s the one!", "Man I would love an update on that situation.", "She should be though. The living conditions she agreed to have changed.", "You have leases, right?", "Then the response is easy. \"Oh I'm sorry that this arrangement no longer works for you. So when exactly are you planning on moving so I can have another tenant set up for the vacancy?\" And really that's just a nice reminder that she is infact a tenant, NOT a roommate. Please make sure you have solid lease in place so she can't just leave you high and dry", "r/assholetax", "Im just saying *IF* you let this slide, shes gonna walk all over you. Being called a leech while under the roof you bought is not a little disrespectful, its majorly disrespectful. Its not too confrontational if you raise her rent, actions have consequences. Its not like you are serving her an eviction notice (the next step if she actually starts something imo).\n\nEdit; also in addition you have the wrong title. It *should* say “I recently quit my job, and I’m in the process of looking for a better one. My tenant called me a leach, AITA?”", "I would honestly evict her. “I didn’t want to ‘take advantage’ of you anymore, so you can go live with someone that won’t “", "You may have answered this elsewhere but,  did you decrease her rent to reflect the changing living conditions? She has gone from her own bathroom and shared spares with just one other person, to a shared bathroom and two other people, her rent should reflect that change. You changed the living conditions she signed up for. If you didn’t reflect that in the rent you charge, Y TA \n\nI reread the post and see you’re charging them both the same. I’m going to go YTA. It’s not her business that you’re not working and looking for a better fit, but I can see how it would sting to be paying the same, for less. Have a mature conversation about her leaving if that’s what you want, but jacking up her rent as some people are suggesting would be a hella dick move. (I think you said you don’t want to, so fair play)", "Awfully bold to be mean to the person who can decide to not renew your lease if you're too much of a hassle.", "She didn’t “berate” OP. They expressed an opinion harshly, once.", "She’s a good tenant, apart from saying one kind of harsh thing, once. Good tenants are not that plentiful, as you can see by casually perusing AITA.", "You don't get it. It's not about the extra room. It's about the extra person in the apartment. She moved into an apartment where one person lived. That's the deal she signed up for. That's not the deal she's getting. \n\nHe can do whatever he wants with his spare room, but if another person moves into the apartment she should be compensated by a lower rate for the inconvenience.\n\nLikewise it would be an asshole move for the her to have a boyfriend staying over in her room all the time, basically living there.", "It's not reddit, this guy in particular is shitty and dumb", "If she was a “tenant” then she would never get away with changing the occupancy terms overnight so the tenant had to share a bathroom.\n\nEdit: there are laws that protect tenants and leases etc..", "I didn't see that... anyone got a link?", "that thread was awesome", "Evidently he does not...", "If the OP is in the US, this could be seen as retaliation under the federal Fair Housing Act, not to mention state laws and local ordinances.\n\nWhat you are suggesting for them to do may actually be illegal.  If OP even wants to consider this, they need to look at their local laws and not go off halfcocked because someone on Reddit told them to.", "I think there are probably better ways to handle it without being unnecessarily spiteful, which is exactly what raising rent because of hurt feelings would be.", "Some dictator. A disagreement doesn't mean you must punish someone you have power over.", "Thats s*tty advice, if that tenant moves out, OP will have serious troubles making the ends meet for a while", "Since she called you “a professional homeowner” then it’s time to start acting like one. Or you can simply not renew her lease.", "You canNOT evict a tenant just because they said something rude. JFC, people. This tenant said a jerky thing, for sure. And I don’t think OP is an asshole here. But tenants have rights! You can’t just evict them because you are mad at them!", "YTA.  Thank God, someone has some sense!  Not only is there another person there, but you are home more, too.  You should be charging her less, not more.", "Not even an opinion…. The sole breadwinners in the house are the tenants…. It’s a fact. Maybe you don’t like the terminology, and maybe the roommate could have kept it to herself, but it’s not worth being *even more*  of an asshole over.", "She's not even paying market rates, by definition a sub par tenant.", "She signed up to have a room and access to shared spaces. She still has that. \n\nI'm in a place where room renting is pretty popular. No one I know who's done it has had a choice on whether their landlord/roommate rented out an additional extra room. Even great setups, where my partner's bff has rented the same room for 8+ years, gets discounts for dog and house sitting when the landlords travel, and is genuinely friends with them, doesn't get veto power when they choose to rent out the other bedrooms. \n\nIt's the difference between being equal roommates, where you signed up so that everyone had to agree on big decisions (such as a new roommate), versus tenancy, where you signed on knowing you'd have no control over anything but your private space (even then, you can't do modifications without permission).\n\nTenant signed on knowing that they weren't an equal roommate with equal say. Knowing that OP could rent out the other room (tho he didn't have any plan to do so at the moment) and that wouldn't change the tenant's rent. That's not how tenancy works. \n\nOP can choose to do kind and change the rate, but it's already below market rate by $100 a month. OP is doing the right thing and making sure utilities are split fairly. That's all OP owes legally or morally."]}