{"id": 4558, "submission_id": "zk57qr", "title": "UPDATE: AITA for not wanting to go to my sisters wedding because of my \"insomnia\"", "selftext": "Original [here](https://www.reddit.com/r/AmItheAsshole/comments/zcf9fk/aita_for_not_wanting_to_go_to_my_26f_sisters_29f/)\n\nFirst off, it was a big eye opener to see that so many people thought I was the asshole, and after reading your comments I agree with you. I guess I have been living a kind of sheltered life, and I wasn't thinking about the wedding the way I should have - I was kind of viewing it as a big party, more like a birthday party, than a once-in-a-lifetime event, and that was a mistake. \n\nHanna asked me if I could get coffee with her outside of the house, and I was a little surprised that she wanted to meet that way but I obviously said yes, I was getting really worried that she wasn't going to respond at all. But I think that was the best decsion ever because Hanna and I had a great conversation, it was kind of intense but I think really necessary, about some stuff that happened when we were kids and our relationship with our mom. I won't go into all of it here but TLDR, Hanna apologized for trying to wake me up whenever she visited, I apologized for laughing about her wedding, and we both agreed that I need to A) talk to more doctors and B) move out of our mother's house.\n\nWe grew up pretty sheltered, and I hadn't realized how much it was impacting my mood and energy until Hanna started talking about what she experienced when she moved out and went to college. She left home pretty early, at sixteen, so we really didn't know each other as adults much at all. Hanna told me that when she first moved out, everything got easier with our mother, and she started going to therapy and got really into fitness and nutrition, and she realized that she felt a lot better with less contact with our family, but she got really worried about me being left home, and wanted to check up on me/encourage me to move out too, but didn't know how to communicate that, particularly since I was always sleeping when she was over.\n\nI have some money saved from freelancing and saving on rent, so I am going to think about different places to move to. My job can be done from anywhere so now that I'm thinking about moving out it feels weird that I was so stuck in my high school routine that I didn't even consider any other options.\n\nMy sleeping schedule is still super fucked up but Hanna has a friend who is a nutritionist that is willing to do a consult with me over Zoom, so that's something I'm going to do next week. I called my family doctor and asked for referrals but the only available appointment slot is like two months out, and I'm not sure if I will even be in the state at that point, so I didn't book it yet but I'm definitely going to try and get a medical team once I know what my plans are.\n\nThanks again to everyone, particularly everyone who messaged me directly with advice <3", "created_utc": 1670865751, "permalink": "/r/AmItheAsshole/comments/zk57qr/update_aita_for_not_wanting_to_go_to_my_sisters/", "score": 2997, "replies": ["Great news sleepyhead!", "I'm glad you two were able to work it out and you have plans to get yourself on a road to wellness.", "So glad you were able to gracefully accept the advice here and from your sister. Rooting for you!", "So happy for you!!!", "I'm so glad that your relationship with your sister is improving. Remember, nutrition can do a lot, but also in a bad way. Make sure you can go to a specialist before you start changing everything about your food.", "That's great news! \n\nI think you'll find that your sleep will change when you get into a different environment.", "I'm glad you will be able to see the doctor. I was shocked when you said you're doctor didn't think it was a big deal. And even that you didn't think it was a big deal when it impacts everything in your life in an obvious way. Good luck with the doctors.", "I'm glad you worked things out.\n\nMake the appointment with the Dr. If you can't be there cancel it with enough time that they can give it to someone else. You might still be close enough to go, and waiting lists for appointments like this can get longer.", "I’m glad you talked to your sister and worked things out! Good luck with your future move!", "[removed]", "Great news! As someone who used to have a similar problem as you, I'd also recommend seeing a neurologist to rule out narcolepsy (which can surprisingly cause severe insomnia) because that is what ended up being my issue. Best of luck to you!", "you don’t need a nutritionist lmao you need a doctor", "Echoing many others: maybe a registered dietician could help you, but you need a REAL DOCTOR that can give you specialized care regarding sleep. Not some webMD nutritionist that’s going to claim they can fix your life by minimizing your seed oil intake and buying a bottle of valerian extract.\n\nBook an appointment WITH A REAL DOCTOR.", "You need to book that appointment.  Find out their cancellation policy.  And if you move cancel before you have pay a fee. If you don't move you can go.  ..I hope you find a nice place to live.", "Book it. you can always cancel if you find something else sooner. Also if you're on the books with a note you'd like a sooner appointment you're first call if someone else cancels.", "My sleeping schedule is like this when I'm depressed.", "I'm so happy that you guys worked it out. I hope the wedding goes well. And yes to finding a new doctor!", "Glad to hear this update!  I too am a night owl. If I don't set alarms I'll look up and it'll be 2am without me ever noticing.   Sadly, most of the world runs day light hours so I gotta adjust.", "Also, have you talked to a counselor. Have you suffered from depression? And also, set an alarm to clock and get your ass out of bed. You don't have to stay up to all hours of the night. Cut food off at a certain time before you want to go to bed, shut off the computer and phone at that time too, and make an effort.  Set the alarm for 10:00 a.m., then go to 9:00 a.m., and and then earlier. You can make the habit", "Search for a sleep center in your area that has sleep medicine doctors and sleep psychologists. There is so much that can help!", "While you’re waiting for a medical consult, come hang with us over in r/dspd. If you do have DSPD, a nutritionist is unlikely to be of help. Unfortunately there are limits to how much a doctor can help, since it isn’t curable, but you may be able to improve the situation.", "Yes, this was a surprisingly nice ending", "Yeah and if you want legit advice about nutrition, you’ll want to see a registered dietitian. People can become “nutritionists” just from taking a few online courses", "The biggest AH in all of this is the doctor who dismissed this and let OP think that this is just how her life is going to be.", "Or at least a registered dietician who can work with her doctor.", "Gross.", "I may have to have a talk with my mom and night owl brother. He's had similar sleeping patterns for a long while.\n\nWishing you and your sister the best!", "Good for you!! Also, consider talking to a doctor about a possible depression diagnosis. I thought I couldn’t possibly be depressed as a teen, and I didn’t really understand till I was in college that I wasn’t a sad depressed, just a very tired one. \n\nAdditional tip: \nWhen you move out, make sure that your bedroom is ONLY for sleeping. Don’t hang out in bed. Don’t read in bed. Don’t work in bed. This will make sure that you and your body associates your bed with sleeping and you can get to sleep faster.", "I had terrible insomnia for years and saw a sleep psychologist who actually helped me more than the sleep studies and specialists did. If you can't find relief through other specialists maybe try to find one in your area! My whole life changed!", "Doctors appointments everywhere are two months out.\n\nBook it. \n\nIf you move, cancel it with a few days notice and its fine.  If you don't, you're not looking to get a new appointment in two months to find its two months out and starting this all over.  \n\nBook the appointment.", "Don’t be silly, book the appointment. Cancel if you move in the meantime. \n\nAnything sleep related has massive health and life consequences, so treat this matter with some urgency. Good luck.", "I have struggled with insomnia, and it is generally related to some other underlying mental issues as well. For me, it was my chronic anxiety. I have gone with like 10 hours of sleep in 7 days due to insomnia so I know. Then my sleep cycle was fucked up most of my life, I gained weight and that escalated my PCOD. It was a shit situation overall. Now finally when I live with my husband and have gone to therapy so much and have been working in a job where I have to get up at 6.30am every single day, I am finally able to get 6 to 7 hours of sleep every night which is a big win for me. Apart from a nutritionist, I will suggest also see a therapist.", "Good to hear things are moving forward... Not sure if allowed - but circle back once you dig deeper into the medical aspect of the sleep issues!! \n\nNutrition is very important and a great first step!! Yet use caution that it would be a one and done fix.  If it hasn't been mentioned yet - don't dismiss Universities (w/Medical Schools attached) as a source or a place to start for help/referrals.   Not only as full service care with \"in-house\" referrals; but some offer sliding scale costs (fees based on your income) and also many engage in research.  Many research programs are free for services and sometimes even pay patients to be involved.  (Do a search for \"sleep issues university research programs\" you can add your state/city at the end of the search to narrow it down to be more local)  Good Luck!", "OP, book the appointment with the specialist and then call every few days and ask if there are any cancellations or whatever and see if they can move your appointment up.", "Book it! These specialist appts are very hard to get. So book it now, while it's available, and if it looks like you're not going to keep it because you're moving (yay!), you can always cancel it a few days ahead of time. \n\nI read your original post and am so happy things worked out this way! Best of luck to you, sleep muffin!", "Great update! So nice that you talked, and I wish you and your sister the best of luck. I'm glad that your sister helped you see that you are not helpless when it comes to your health. It's a journey for sure, but it's *your* ship.", "Nice update--just wanted to let you know that when I was living with my parents, my sleeping habit was like yours where I slept during the day and was up all night.  It wasn't something I did purposefully but if left to naturally sleep/wake, etc... I would just end up with a schedule like yours.  Now, I do suffer from some insomnia which, thankfully, is currently under control but my insomnia was actually SEPARATE from that sleep issue.  It turns out I was depressed, anxious, etc. in the environment I was in and my natural defense/response was to basically sleep and switch into a schedule opposite everyone else's.  It took a while to \"correct\" (and then we could actually tackle the real insomnia) but once I was living on my own for a while, I did find that my schedule, while still not \"normal\" became closer to it (I still am more awake/wired at night so I tend to get most work done at night).  I always assumed I was more of a night owl and that was why I couldn't sleep at my parents' but when I saw my cousin start doing the same thing when she moved in with my parents when she had never had any sleep issues or anything, it occurred to me that it was likely a way of dealing with an environment we found toxic.\n\n&#x200B;\n\nThis isn't to say you are in the same situation but it doesn't hurt to keep this possibility in mind as well.  Certainly you should still look into seeing more doctors but you may find that just being away from your mom's place will end up doing wonders for your mental--and sleep- healthy.", "Hey Op. Have you ever heard of Delayed Sleep Phase Disorder? It's a chronic condition that effects the REM cycle. And what you are describing sounds exactly like it. If you do have it, it's important to understand that it is not something you can control. I know this because I have it myself. And I spent a lot of my life trying to live on a 'normal' day schedule and became incredibly sick and suicidal due to the lack of sleep. Nowadays, I have a midshift schedule and am able to get the sleep that the human body requires to live. All this to say, it sounds like you have a legitimate disability and should talk to a sleep specialist/neurologist. Every now and then, it's totally reasonable for anyone to get up early (early to you may not be early to everyone else and that is ok) especially for things as important as a wedding. But not always. And it's not ok that everyone is dismissing what seems to be a very real illness. Making up with your family is good. Going to your sisters wedding is good. But ignoring your health in general is not. Nor is your family (and everyone in this sub apparently) expecting you to always conform to a schedule that isn't possible for you on a regular basis. Illnesses come in lots of different shapes, sizes, and forms.", "NTA. You told her you would skip brunch but attend the rest of the festivities. Then she had a bridezilla attack. My husband is on his 30+ third shift year and people think he has all day to do stuff because he's home. The man works, he leaves at 8:30 pm and return home at 7:30 in the morning. He needs to sleep during the day. Insomnia is the same thing, you sleep when your body allows you. I know my thoughts are not the majority, but you take care of you. If you can, it will be great to go, but if your sister really loves you, and I'm sure she does, she doesn't want to see a zombie with huge bags around their eyes!", "Thanks for the update! It’s so good to hear that you and your sisters were able to have a heart-to-heart as two mature adults.", "I agree. This was a really nice update! OP, I'm glad you're in a better place with your sis and you are on your way to changing your life for the better. Kudos and thank you for the update!", "Some doctors suck. My pediatrician dismissed my mom and my concerns when, at 13, I started vomiting randomly, for HOURS- every 5 minutes, for 8+ hours, with no obvious cause. Couldn't keep anything down. Said it was normal and I'd grow up and grow out of it. It kept getting worse over time, but pediatrician was never concerned \n\nSpoiler alert, it didn't go away in time. It's actually a super rare congenital defect. Part of my digestive tract is straight up the wrong cell type, and it only showed up once I started growing (best guess is as a kid, I was small enough that hormones that regulate that cell type elsewhere could still reach and act on the f'ed cells, but that stopped as I got bigger). I have to take meds to regulate those cells or they cause severe acidosis, which was causing the extreme vomiting. I was functionally flirting with an acute medical emergency and risking organ failure every few weeks. NBD 🙄\n\nBy the time a doc actually caught it (after insisting I was magically pregnant for, at that point, over 6 years straight while a virgin) more than 98% of my esophagus had been chemically scarred, and parts of my throat as well. If it had been caught when mom first brought it up, we probably could have gotten a handle on it earlier and had no lasting damage.", "I’ve noticed this happening to several friends. I think many doctors live with severe sleep deprivation during residency and so, they think it’s normal. A friend of mine rarely Sleeps more than 3 hours a night, and MDs have told him not to worry about it", "Hi, I'm definitely going to book with other specialists, the nutritionist is just one part of the medical team I hope to put together, I just mentioned her explicitly since I already have that appointment scheduled and I think it's nice that my sister helped me connect with her friend", "Narcolepsy or Delayed Sleep Phase Syndrome. I have a friend with dsps and it's a significant issue for her because she just can't sleep until 2am, because her circadian rhythm is just totally reversed.", "Ok. I just saw that you do have DSPD. And yeah, you can't expect everything (especially something big like a wedding) to be planned around you, but it sounds like your family is generally dismissive of what is a very real and very difficult illness. This wedding is one thing, but you should also have a discussion with them about how they wake up when you need to be sleeping and about how you do have a right to some accommodations. You wouldn't wake them up at 3am so it isn't ok for them to wake you up at noon. My family plans events that can be in the afternoon for the afternoon. When they can't, they help me out when I am having to deal with very little sleep. It's a two way street.", "Her symptoms are pretty standard for a sleep phase disorder. It’s not something you can really just handle by going to bed earlier.", "People can become nutritionists by putting up a sign saying they’re a nutritionist. Not even a few online courses are necessary.", "This is really important. Nutritionists may be well intentioned and well informed, but there's not much guarantee of that and a lot aren't. Dieticians are fully qualified doctors who go on to study nutrition and diet.", "Holy cow, I'm so sorry that happened. Nowhere near as severe but at about that age I started having random dizzy spells and spots before my eyes and a rapid heartbeat. Once it happened on vacation in the presence of a family friend who was a medical doctor so I was NOT faking it. Our pediatrician dismissed it completely, saw in the notes later he wrote \"dieting?\" like I was starving myself and sent us home.\n\n20 years later a random doctor says, \"You know you have a heart arrthymia, right?\" How no one else heard it in all those years is beyond me, but I finally felt vindicated that I was not, in fact, crazy.", "I have something like that.\n\nAfter literally 5 years of doctors and diets and pills and not having things and blood tests and sticking things up my ass they finally found out I’m allergic to milk and eggs.\n\nWhy tf did it take 5 years to figure this out?\n\nI was 210 now I weigh 130. Haven’t really been able to work, hold relationships, party with friends, go to a lot of family events, etc. because of this.\n\nAll it took was a fucking nurse practitioner(? I think? Couldn’t see actual doctor) reading all my stuff then getting me a basic blood test. Whereas before I had countless doctors making it legitimately worse for me. It would be ‘it’s probably lack of fiber in your diet see you in 3 months’ and that would fuck me up even more. Or ‘marijuana is clearly the issue. I know you told me you only started smoking in response to the pain… but marijuana clearly started all this’.\n\nReally turned me off doctors tbh, which I know isn’t good. But it was beyond frustrating going to ‘specialists’ for years and no one having any clue, then my new primary care’s freaking doctor-sidekick-person found the cause.\n\nAggravating!!!", "This isn't anywhere near what you went through, but my doctor was signed-off for about 2 years. During this time we had another doctor, Isabella. She was useless. I won't go into the long list of her incompetencies, but one in particular stood out to me. I was on a medication from a specialist that had a really negative effect on me and made me incredibly uncoordinated and clumsy, and resulted in me hitting my head at an awkward angle. My head was sore, but the impact went straight down my back and I heard a crack and had an awful pain. I was incredibly groggy from the medication, so I tried to ignore it for a couple of days, but by the fourth day I was in agony. I went to urgent care where I saw a nurse who was wonderful. She wanted me to get an x-ray, so got Isabella to see me immediately to schedule an x-ray right away. I get to Isabella, tell her the situation (not very well, I was still ridiculously groggy, but well enough the nurse understood and explained what happened over the phone). Isabella didn't think I needed an x-ray and said I should go home and take some paracetamol. I repeated the nurse thought it was important, and didn't she even want to see for herself? She eventually agreed to examine my back. She did this by poking me twice through 5 layers (it was January) and said \"you have a lot of tension. It's because you have large breasts\". I was 33. They hadn't just appeared the day I hit my head. I don't remember what I said but I did eventually get the x-ray that afternoon, but they made me wait 10 weeks for the results. After 7 weeks I went to a physiotherapist. Turns out I had two upper thoracic vertebrae significantly out of alignment. Two sessions with him fixed it, fortunately. I went back to Isabella because he was concerned about my C1 vertebrae and was hoping to see the x-ray. She actually blanched when she saw my x-ray (really not a good doctor)...", "Ask the doctor about some lesser known sleep disorders that fall under the group, Circadian Rhythm Disorders. \n\nYour symptoms sound similar to Delayed Sleep Phase Disorder. But there are other ones in that it could. For years I thought I had insomnia until I found the right doctor and was diagnosed with Non 24-Hour sleep disorder.", "Dieticians do a lot of study and are definitely reliable health professionals, but they aren't \"fully qualified doctors\".", "I bout sent the surgical notes to the pediatrician like \"see??? I wasn't lying or making it up!\"", "It sucks when the people who should be doctors, aren't. A nurse practitioner saved my hearing in my right ear and spent way more time with me than the doctors ever did. I appreciate her so much.", "I'm glad it turned out alright for you, cause it sounds like you were lucky that you hadn't torn anything/didn't further dislocate your vertebrae and damage your spinal cord! That would have been infinitely worse than what I deal with!", "I really was lucky. I was in so much pain I was struggling to cope, and a few friends all independently recommended this physiotherapist. They all warned me his treatment is always astoundingly painful, but just as effective. They were right. He did an amazing job and for only €50 in total! It really could have been so much worse.\n\nPeople in positions of responsibility for vulnerable people (and in my mind that includes any doctor-patient relationship) not doing their jobs just infuriates me like nothing else. I'm so sorry for everything you went through!", "Hey I hope this works out for you!\n\nI am prescribed trazodone because I have a sleep disorder as well. I will normally fall asleep around 8 am, and sleep until around 4 pm. I bartend and my shifts don’t start until 5 pm so it’s fine, but not great for living life.\n\nWith trazodone I can take it whenever and I’m asleep within 15 minutes. It also helps me stay asleep because I wake up constantly without it. \n\nMaybe something similar will help you!", "Unsolicited advice: book the appointment. You can always cancel. But that way it’s there when you need it.", "My son (25) has some of the same issues. He is still living with his dad and stepmom and still had the routine of a teenager. I’ve told him countless times he needs to do at least 2 things: 1) Move out on his own and 2) Stop being on his phone until the early hours of the morning. Now that he is done with school and working full time and has a GF that has more “normal” hours, he is improving. He is saving up for a place and at least trying, with mixed results, of maintaining a consistent sleep rhythm. Time will tell if he needs further assistance but at least he is taking some positive steps. Best of luck with you.", "Excellent work reaching out to your sister. \n\nAnd I’m glad to see you’re working on getting your sleep issues checked out. Your sleep schedule is definitely a big concern. The fact that your mom has let you do this for years without getting your health checked is appalling. (I know you’re an adult now and you need to deal with it yourself, but your mom should have been concerned about this a long, long time ago.)", "Thanks so much for the update!! This is fantastic news!! Congratulations on deciding to move out & address these issues that have been holding you back. \n Good Luck!", "I’m not trying to be rude but you keep a consistent sleep schedule. You don’t have insomnia. If you went to bed at 10pm every night and couldn’t fall asleep until 4 and then had to wake up at 8 THAT would be insomnia. You just have a nocturnal schedule, which is fine, but you don’t have insomnia.", "I had sleep reversal. Melatonin really helped me.", "Love this 🥰.  Thanks for the update!", ">I called my family doctor and asked for referrals but the only available appointment slot is like two months out, and I'm not sure if I will even be in the state at that point, so I didn't book it yet but I'm definitely going to try and get a medical team once I know what my plans are.\n\nWhy not book it while it is available? If you leave the state or find an alternative appointment or whatever, you can always cancel it at that time. That way if you decide to not move too far away, you don’t have to wait another two months or longer.", "Yeap that's wonderful news!", "Now I've got Lazyhead and Sleepybones by They Might Be Giants stuck in my head.", "Having a nocturnal sleep schedule is not insomnia.", "You are getting downvoted but you’re right. What OP is describing is NOT insomnia and i can’t believe no one else is pointing that out.", "The pessimist in me is worried this \"nutritionist\" is an MLM hun", "That’s horrible to hear! I’m glad someone caught it. \n\nSomething similar comes to mind, when I was 5 I started complaining of leg pain (the upper leg joint). 3 doctors and my parents dismissed it but my grandma, god rest her beautiful soul, insisted we needed to get second and third opinions because she believed my pain was something serious. With the 4th doctor it turns out I had a pretty rare disease, legg perthes, that could have left me paralyzed had it not been caught on time. I had a cast on for a few months and it turned out fine. \n\nMy grandma saved me for being a resilient badass that would not take growing pains for an answer.", "I think their main point was the distinction between nutritionist and dietician.", "My point really was that you try all of those things before you just labeled things insomnia.  You take out sugar,, practice good sleep hygiene, you attempt to give yourself enough time to sleep, (don't stay up until 3:00, settling yourself in, turn off screens etc an hour or two before you are going to go to bed, maybe put a journal next to the bed or read a book versus screens) and THEN if it's still a problem, then maybe assume it's insomnia.  Hormones can actually cause this too.", "Maybe that's different in some countries then...?", "How long ago? Is a malpractice suit possible?", "I don't know about other countries, but in the US, dietitians have training beyond a bachelor's degree (such as a master's degree in nutrition), but they are not doctors and do not have that kind of training.", "Which ones? I cant find any countries where dieticians are qualified doctors.", "No, and honestly wouldn't be worth the costs and headache anyway. And it would be a long shot to even win", "Good luck, OP! I’m glad you and sis were able to talk. \n\nJust unsolicited advice about the nutritionist, make sure they have “RD” after their name. It’s the registered dietician license that requires renewal!", "OP--it is always great to see someone take on board the advice given and work to improve their life.  \nGood luck with your future plans and I hope you find medical solutions(and any other work arounds) that help you create a life and home that make you happy/contented.\n\nETA--I hope you get to attend Hanna's wedding and you are able to develop a closer relationship with her.", "Book that appt. And keep trying for a sooner appt. Even if you THINK you are not going to be available. That is an excuse. Book it, go to it if you can. If you cannot. Cancel in 24 hours in advance if you know you cannot make it. Believe me, waiting and then trying to book again, means another appt 2 months out and it becomes a cycle. You can do it. I belueve in you!!! It also sounds like you have your sister for support. Keep us all posted. We love success stories. This is totally a success story. Hugs to you on your journey.", "So glad to hear about the progress with your sister, OP! From one sleep-disordered person to another, please make sure you follow up with a sleep specialist. Truly, it will probably change your life.", "That’s great news. One suggestion though, make the appointment now. If things change and you are not in state you can always call and cancel. But if it’s two months out now…it’ll be another two months out or more when you call later.", "YAY!!!!!", "Book the appointment. If needed, you can always cancel it outside of any cancellation fee period. You cancelling just opens up a spot for another person who's also waiting :)", "Thank you for effort to become a better human. We need more of yous here on Earth.", "This was such a wholesome reply, it made me smile!", "Make the appointment and then ask to be added to the list for canceled list. That way, if an appointment opens up sooner, you could get in before you leave. You can always cancel it if you need to.", "Also, OP, don't be put off by a couple months wait to see a specialist. That's really common, and 2 mos. is pretty short wait, really. You should book that appointment NOW.", "I became a nutritionist when some moist bint lobbed a scimitar at me. My credentials are rock solid.", "Huh, that's sort of a less severe version of what happened in the memoir *Beautiful Affliction.*   \n\nIt had sounded like her non-diagnosis occurred because of bad timing, how the Swedish medical system was at the time, and a suck-it-up-buttercup culture around her.  I guess not because the chances of any given random Internet person being from Sweden seems pretty low.", "That sucks!  Are common allergens one of the first things docs checked for when weird symptoms happen?  \n\nIt took 7 years for docs to diagnose a friend with a vitamin B deficiency, even though some of those docs were the ones who removed the vitamin B-absorbing part of his body in the first place.", "I had an allergy test like two years ago and nada.\n\nIdk how it works but you think they would’ve caught two major/common allergens.\n\nI suspected I was lactose intolerant so I was taking lactase pills when I had dairy stuff and avoided straight up milk… didn’t matter though because allergies.", "My cousin is a medical doctor who specialized in nutrition in Guatemala.  She is currently practicing in Honduras.", "Interesting. Does she call herself a dietician?", "I didn’t see the original post, but I would strongly suggest they you see a sleep specialist. There is such a thing as a specialty in medicine for sleep disturbance.  You may actually have a form of sleep apnea or narcolepsy. These people can help you.", "i just want to say, i agree with Hanna, once i moved out my relationship with my parents improved SO MUCH because we finally had space from each other! i went from a crabby teenager constantly annoyed with my parents to having a really good relationship with them. \n\nglad to hear you guys had a productive talk!!", "I read something about cherry juice or something can help.", "Thanks for the update. So glad that you’re finally getting out more, and have plans to consult a nutritionist, as well as a doctor. Take your time to plan a move. In the US, or outside of the country, just go on the internet. Do some research as for areas you might like, Weather conditions, property taxes,  suburb or city. Might decide to stay in the same town/ city. Glad you made peace with Hanna. Get out there, and enjoy life.", "Wonderful job darling! We are so glad to hear it!!", "Amazing! So happy for the two of you", "It depends on where you are. In some countries \"nutritionist\" is the regulated profession and everyone can call themselves \"dietitian\".", "Please get a licensed dietitian and not a nutritionist. Dietitians are medical professionals who belong in a medical team while nutritionists are any random joe who chooses to market themselves as such with no training or credentials necessary. I'm sure your sister's friend is a lovely person but with there being no standards or regulations on nutritionists, it's not worth it to gamble with your health.", "I'm also glad to hear that you have an appointment scheduled with a sleep specialist. Just a quick note to say that sometimes you can do tele-health appointments with specialists not in your area, so if this one falls through or doesn't take you seriously, you might be able to keep that as a backup option.", "Great news! Also, book the two-month-out appt; you can always cancel later. It’s incredibly difficult to get dr’s appts.", "She is nocturnal!  That’s fine!  Settle down with the “you must see a doctor” advice!   I am a fucking doctor!  I have always been very nocturnal.  It was a struggle my whole life!  So I chose a career that would allow me to have a schedule that works with my sleep.  I am an ER Dr that works nights!  I get paid more to work nights because nobody else wants to!  I got to negotiate for A LOT more money to work only nights!  I get PAID MORE because of my sleep habits!  I am very healthy and I am a champion sleeper during the daytime with my shades and shutter to make my room nice and dark.  \n\nYou don’t have to change anything and see a bunch of doctors to “make you better”!  You already said you do freelance work which means you can work anytime that works for you.   Just know that you will occasionally have to go on little sleep when you have to do daytime things with the rest of the world because nobody seems to want to have meetings/weddings in the middle of the night to accommodate my sleep schedule.  \n\nBut I worked my life and career around my sleep cycle and you can too if you want to.  (Now luckily I don’t have kids and I assume that would be different if you had kids that required sleep at normal hours.) \n\nSo take it for what it’s worth, but I just want you to know that there are very normal nocturnal people out here that can turn their sleep habits to their advantage.  When i applied to hospitals and asked “are you willing to hire me with a nights only contract” they were practically drooling and begging me to sign with them.  🤷‍♀️\n\nETA: I am happy that you have worked things out with your sister.  Many people over the years have called me lazy and just don’t understand it.  But I just say that I am super productive at night when nobody is around to bother me.  Clearly I’ve done well so they seem to finally get it.", "You weren’t the asshole just saying. Your sister majorly overreacted and owes you an apology. You need to start setting boundaries with these people and if they don’t respect it, cut them out of your life for good, you don’t need or deserve this.", "Thanks to your original post i kinda just realized i may need to see a specialist too.😅. I regularly go to sleep around 4-5am and get up around 1-2 pm although i have been known to go 24 hrs or so without sleep or at least one day a week i will only get 2-3 hrs of sleep.", "It was almost like I read a book. Had a beginning, then a twist, and a nice ending. Good on you OP!", "Amazing maturity and personal growth. Honestly that puts you ahead of most people already, so good on you.", "Good on you OP! we're all here cheering for you!", "Great news, have fun at the wedding ☺️", "good luck with the sleep doctor! as someone with sleep issues, i know how debilitating and frustrating they can be, and how much they can prevent you from having a normal life. i hope the appointment gives you some answers, and just as importantly, a plan for being able to sleep well.", "Book the appointment now before it’s taken you can always cancel. Also get blood work checked in meantime, thyroid and vitamin d in particular", "What a lovely lovely sister you have! Congratulations to both of you for working things out. Always cherish your siblings :)\n\nWishing you a speedy recovery for your insomnia.", "Hey friend, don't know if anyone mentioned it yet but you should look into delayed sleep phase disorder/syndrome. It's a circadian rhythm disorder where your brain doesn't make melatonin at the \"appropriate\" time, meaning you can't sleep until very late and you feel perpetually jetlagged. It's notoriously difficult to treat too, e.g. you can't just go to bed earlier or get up earlier, sleep hygiene does very little to help most of us, \"you'll sleep when you're tired\" isn't a thing, and the vast majority of the population does not understand what this is like because they don't struggle with it. To them it looks like laziness, hence people waking you up in the middle of your \"night\" because everyone else is up why aren't you up yet you should have gone to bed earlier why were you up so late etc ad nauseum.\n\nJust putting this out there because if you DO have DSPD you will probably have a hard time finding a doctor who knows about it. It's quite rare in adults (about 0.16% of the adult population has it) because most people who develop it on adolescence grow out of it by adulthood. It's commonly misdiagnosed as insomnia or a mental health issue when it's really a neurological difference that you don't get to control. Your brain is literally wired differently than people with a \"normal\" sleep schedule.\n\nI would suggest heading on over to the r/DSPD sub for more information. You'll want to call and vet doctors ahead of time before seeing them to make sure they know about DSPD or you're likely to get misdiagnosed. You can do this by calling to talk to their nurse to confirm that this is a thing that doctor diagnoses and treats. Start keeping a sleep journal (or use an app on your phone) to log when you sleep, quality of sleep, how you feel the next day, any meds you've taken, etc. A good sleep doc will have you do one anyway so you'll be ahead of the curve when you eventually get in to see someone. There's fancy testing for it but it's usually diagnosed based on history and a detailed sleep journal. \n\nAnd for the record, as someone who has struggled with DSPD since childhood and am now in my mid 30s, I don't think you were the asshole at all in your original post. You could have had a bit more tact, but imo it is 100% okay for you to miss an event (yes, even an important one) if it will cause you physical harm. Because having to wake up in the middle of your night does cause you measurable physical harm (hellooooo immune system) and you will be absolutely miserable all day. Ask your sis if she would think it's reasonable for you to expect her at a 2 am wedding because that's what she's asking you to do.\n\nIt's okay for her to be upset and also okay for you to step back and only attend part of the wedding to accommodate your sleep schedule, but remember that ultimately she chose her wedding schedule KNOWING you have chronic sleep issues and now she's all mad that you won't just make it work for her, not realizing what a huge ask that is for someone with DSPD. It's not like you can just \"go to bed early just this once\" or \"just take a unisom\" because anything short of drugging yourself to oblivion will not work and from experience I can tell you that doing that anyway will really fucking suck.\n\nThe only way I've ever been able to maintain a \"normal\" sleep schedule is by taking multiple sleep aids around 11 pm because that's the earliest I could make it work (all under medical supervision). And even then I can only manage it months at a time, it takes months of careful medication management and self control to reach that earlier bedtime, and even one night of staying up an hour or two later screws me up and I have to start all over from square one. This experience is depressingly common with DSPD. I've been trying to make my peace with it and embrace my natural circadian rhythm because although it makes a lot of things far more challenging (i.e. literally everything you do while awake and much of it must be done during normal business hours, so you only get half the time everyone else does) at least I feel less like garbage during my \"day\". I go to bed between 2-4 am and sleep until noon at least. It's inconvenient for pretty much everyone in my life but you know what? Them expecting me to fight a literal disability that is incredibly difficult to treat in to be less inconvenient is a far shittier thing to do.\n\nBecause for real, DSPD is an actual physical disability. You're not being lazy, you're not procrastinating your sleep, you're not \"not trying hard enough\". A very important life activity (sleep) is being severely impacted by a neurological sleep disorder and unfortunately that affects any activity that happens when the sun is up, like that wedding. Attending the latter part only might be disappointing to sis but imo is a very reasonable accommodation for a DISABILITY, no different than asking for a ramp if you're in a wheelchair.\n\nGood luck to you!", "You'd be surprised how many doctors are like this. I have DSPD, a circadian rhythm disorder that is very much like what OP has described (would not be surprised if they also have it), and it is infuriatingly difficult to find a doctor who will take you seriously. It's almost always \"just go to bed earlier\" or \"get up earlier\" or \"you're just being lazy\" or my personal favorite, the referral for a psych consult. All because I Can't. Fucking. Sleep. At least, not during what's considered \"acceptable\" hours. If left to my own devices I can sleep just fine, it just isn't until 2-4 am.\n\nSleep disorders affect every facet of your life and it's something most people don't think about until they are in a position where they HAVE to think about it, i.e. they are having trouble sleeping. Doctors tend to dismiss these things because they think it's all a matter of self control and if you're staying up too late, well, you just need self control. Except with circadian rhythm disorders it's a physiological difference in how the brain is wired and no amount of self control will fix it. It's like telling someone who is having a panic attack that they just need to calm down. Never in the history of freaking the fuck out has it ever helped to be told \"you just need to calm down\". It's easier for doctors to give simplistic advice like \"follow better sleep hygiene\" or \"here take this pill\" instead of actually trying to find the source of the sleep issue and then work with it instead of against it, since clearly working against it isn't working or that person wouldn't be at the doctor.", "Oh god, OP I just saw the bit about the nutritionist friend. BAD IDEA. BAD, BAD, TERRIBLE IDEA. *Your friend is in no way qualified to help you with your sleep issues.* Abort mission! \n\nNutrition isn't going to fix a sleep disorder or millions fewer of us would have sleep disorders. I would sleep like a fucking baby if it was just a nutrition issue. That's like going to see a dentist for knee surgery. You need an actual sleep specialist who can diagnose what's going on, preferably one who knows about DSPD because you pretty much described my life and I didn't find out about DSPD until my 30s. Was always told it's just insomnia, have always been treated like your family treats you (which is very much not okay btw).\n\nStart with your primary care doctor and ask for a referral to a sleep specialist. Go into that appointment already having done some research into appropriate doctors. In particular, call every sleep specialist your insurance covers and explicitly ask if they diagnose and treat DSPD. You will likely have to hunt for one (and maybe even have to travel a bit to see them) but it's worth it to get the right diagnosis. The treatment for insomnia is very different than the treatment for DSPD. This already affects every single aspect of your life and you owe it to yourself to find the root of the problem instead of having people (like your sister and the nutritionist friend) throw misinformation at you.", "Yes, and I don't know how a nutritionist can help cure DSPD.  OP needs a sleep study.\n\nOP, as.a fellow pack member of your sleep disorder, I wish you all the luck in the world.", "Sounds like the mom was big contributing factor too, possibly a control freak who enjoyed how much control she got to exert over OP as a result of her sleep disorder.", "I got the impression that OP’s mom doesn’t understand healthy eating, and that OP’s sister also suffered poor heath until she moved out. In other words, OP’s sleep disorder may be exacerbated by poor dietary habits reinforced by their mom.", "Ironically, apparently the distinction between the two is flipped in other countries. In the States, a dietitian is medically certified, but in Canada, the  nutritionist is the one with a medical certification. \n\n(Feel free to fact check me, this is based on watching some YouTube videos)", "Strange women lying in ponds distributing food advice is not a rational basis for  a system of healthy eating", "This isn’t true - we call ourselves dietitians in Canada, too :) my source is me, a Canadian registered dietitian lol\n\n(Technically it depends on the province, but “dietitian” is a protected title everywhere - meaning you can’t call yourself an RD registered dietitian without the degree + internship + exam + ongoing registration. Some dietitians go by “registered dietitian nutritionist” as that’s a protected title in a few provinces (maybe Ontario? I don’t live or practice there tho, so can’t tell you).)", "Thanks! I just remember reading and hearing contradictory information about which term is the one that is actually medically certified and noticing it came down to a regional difference. I would prefer being wrong, because it means international consistency.", "Just a quick word of advice with the whole nutritionist thing: dietician is the licensed, protected term, while anyone can call themselves a nutritionist and they may or may not truly know what they're talking about. If it's the same sort of money: consult with a dietician instead because it's kind of like the difference between going to a medical doctor and a naturopath. Best of luck!", "This is a great update, I hope you’re able to figure out the cause of your sleep problems. I have just recently been getting to the root of my own, and it’s definitely a journey. Best of luck!", "Great update! Though I would recommend getting yourself potentially checked for narcolepsy because certain types can manifest in the way you are describing your insomnia. I hope you get answers from your doctor!", "what is a \"fully qualified doctor\"?", "This is really good news.\n\nHowever, even though the appointment is 2 months away, why not book it and cancel it if you won't be in the state? (as long as there's not stupidly high charge for cancelling, of course).", "I'm not really good with \"medical stuff\" but having recently watched a family member in the hospital, it's so clear how medicine is really a team effort - your body is like a Rubicks Cube....if you focus on just 1 side, the rest may start to align, but it'll never be quite right.  You'll probably need 2 or 3 kinds of specialists to get your colors all blocked out correctly.  And I bet it'll feel like magic!", "My brain has been sagging in my skull (chiari malformation) causing extreme headaches and a bunch of other stuff for over a decade and I just got diagnosed. I had a lot of years of “stress.” Doctors can suck sometimes", "Someone who completes medical school and is licensed to practice medicine.", "Really awesome ending. Love how accepting of criticism from strangers and the fact that you took a look at yourself. Props OP. Good luck in life. You’re a good one", "Happy for your outcome op, btw your post was what also got me looking into dpsd (I've never heard of it until coming across your post and its comments) and I think I might have it too 😂😂 super relieving to know that I'm not the only one who has such sleeping issues and that it is a Thing (my parents are normal people so they've always been convinced I just had bad sleeping habits as though I haven't already had said bad sleeping habits since I was like 9 or so)", "Do your own research on sleep specialists, there are offices that don't require referrals  - it just may take some hunting. good luck!", "Sometimes it takes the \"silliest\" of things to really show you that something is wrong. I am really happy that you two had that talk and it allowed you guys to grow. More than anything, talks like that deepen a relationship so much. I hope you get the help you need and the changes you need as well. If it makes you feel better, you're already really doing well in your steps toward that. First is recognizing the problem and then making a plan and you're already in it. Cheers, and take care", "A nutritionist is *not* a legit, credited specialist like a Dietitian would be. Please seek out an actual registered Dietitian!\n\n&#x200B;\n\nEditing to add; make the appointment at the place you got the referral to! 2 months isn't too long of a wait!", "Same here, and that's what I thought when I read the original story. Delayed Sleep Phase Disorder.  I almost died from exhaustion - twice! - trying to work a regular day shift because I can only get REM sleep between like 6am and midday.  I literally ended up in hospital because of it, before one of the ER docs finally suggested I see a neurologist specialising in sleep and... boom.  ANSWERS. \n\nThe down side is that by the time I got diagnosed, I was in my mid-thirties. My neurologist told me, and I quote, \"If we'd figured this out when you were younger then there were treatments we could have tried to correct your circadian rhythm, but... you're too old now. You've been this way for too long. We can't fix it now, and it would be cruel to try.\"\n\nIt really stuck with me because I'd never had a medical professional suggest that treatment would be \"cruel\".  She used that actual word. Shocked me to my core.  \n\nAnyway, on the off chance that OP sees this, you may still be young enough to get treated! So get in there and try it! Apparently it involves something to do with light therapy to reprogramme your circadian rhythm or something, so it's not even scary or anything.", "It's not uncommon for doctors to dismiss anything women say about their health.", "Sleepyhead by passion pit is also a great song", "Just in case you didn't know: there are two kinds of allergy tests. Blood tests and the \"scratch\" test (no idea what it's called in English). To be absolutely certain, get both. According to a very helpful nurse they check different things. \n\nI *think* it's that the blood test is for antibodies currently in your body, and the scratch test for immediate reaction? So if you've avoided the allergen for a while, the blood test might come up negative because you haven't pissed off your immune system in a while.\n\nFeel free to correct me if I'm wrong, I recently had an allergic reaction (the joys of nut allergies + Christmas) so my brain is mush."]}