{"id": 4572, "submission_id": "zkasxa", "title": "AITA for making my parents choose between my sister going to jail or replacing my car with their vacation money.", "selftext": "I (f17) live with my parents. I have an older sister (29) that they had when they were super young. Like I think my mom was 19 and my dad was 18. \n\nThey did not do a great job with her and she has a lot of problems.  She is chronically unemployed and she is a thief.  \n\nShe has two kids that are okay. They live with us as well because her boyfriend didn't want them around.  I like the kids but they are spoiled little brats my parents dote on to make up for being shitty parents to their mom.  \n\nMy parents won't let me put a lock on my door because it is their house and they don't want that.  No problem. I talked to the kids and explained about what would happen if they came into my room without permission. We have an understanding.  \n\nWell my sister broke up with her boyfriend and she needed a place to stay. I begged my parents not to let her stay with us.  They declined. So I begged again for a lock for my door. No dice. \n\nI have to go to school so I can't guard my stuff at all times.  When I came home on Friday I found my car absolutely trashed and the side of it destroyed.  \n\nMy sister had gone into my room, found my spare key and taken my car.  Then lost control on the ice after a day of eating crap and tossing fast food wrappers everywhere. She sideswiped a tree. \n\nWhen I saw my car I was livid.  I told my parents that I expected her to pay to fix it.  They said she didn't have any money. So I said that I would call my grandparents. They had helped me get the car and insurance.  \n\nAfter talking with my grandfather I came back to talk to my parents.  I said that the insurance would cover fixing or replacing my car depending on the damage. But that I would have to file a police report. And that my sister would probably be charged for stealing my car.  They begged me to tell insurance that she had permission.  I said nope. \n\nSo rather than go through insurance they are replacing my car. But they are using money that they had sett aside to take me and my nieces to Orlando next summer for my graduation.  It's fine. I can do without seeing Disney World again.  But my parents, sister, and nieces are upset with me and saying that I'm an asshole for denying my nieces the opportunity to go on a vacation that they have never had.  \n\nI just asked them if a lock for my door would have been cheaper.  \n\nAITA?\n\n#EDIT\n\nHey. I just got home from school.  There is a deadbolt on my bedroom door.  And my mom gave me a key.  She says that she is keeping the other one for emergency.  I agreed as long as it was only for emergencies.", "created_utc": 1670877760, "permalink": "/r/AmItheAsshole/comments/zkasxa/aita_for_making_my_parents_choose_between_my/", "score": 19554, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my parents that my sister had to pay to fix my car after she stole it or I would report it stolen. I might be the asshole because my parents are using money they had saved up to take us to Florida for a vacation to replace my car. My nieces were very disappointed that they won't get to go.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, and you still need a lock.", "NTA, your parents could go the cheaper route and send your sister to jail for grand theft and teach her they won’t always bail her out, then no “ruined” vacation either", "NTA - \"Play stupid games, win stupid prizes\"\n\n>I just asked them if a lock for my door would have been cheaper.\n\nLEGEND", "You're right, A lock would have been cheaper\n\nNta", "But nobody blames your sister? Criminy. NTA", "\"Honestly, the more I think about it, the more I'm thinking that we should just report it to the police and let the chips fall where they may. After all, Sister *did* steal my car, and you are right that it's not fair to Nieces to have to miss the trip because of Sister's decision to break your trust and break the law. And the last thing I want is to be responsible for Nieces missing out. So let's just report it to the police.\"\n\nNTA. While I understand families deciding to handle situations like this within the family, rather than reporting it to the authorities, that is dependent on the wrongdoer being genuinely sorry for their mistake. But your sister isn't sorry. Not even a little. Otherwise, she would recognize that *her* choice took the trip away from her children, and not be constantly trying to guilt or blame you.", "NTA .  Sounds like you should go live with your grandparents.", "NTA and your parents are STILL bad parents to her and to her kids. Letting kids get away with everything and not having to face consequences is, imo, abusive because then they have no idea how to function in the real world.\n\nIf your parents had actually learned anything about parenting, they'd make your sister deal with this or would at least force her to get a job to repay them... if they did that, then the kids wouldn't miss out on Disney. \n\nEvery single aspect of this has been your parents' fault, and they are still failing.", "NTA.  She made the choice to steal your car.  They made the choice to shield her from the consequences of her actions.  I can only assume that this isn't the first time since you referred to her as a thief.", "Ha they could have gotten a $5-$10 lock, but now have to spend thousands of dollars on a car. NTA", "NTA Honestly I would of just filed the police report. Play stupid games win stupid prizes.", "NTA.\n\nIt sucks for your nieces, but honestly the sooner they learn that this is the consequence of their mother and their grandparent's choices, the better. In the long term, you're setting a good example for those kids, as the only principled person around.", "NTA - speak with your grandparents and until you're 18 move in with them.\nWhen you're asked why, explain that you don't feel safe living in a household were you're treated like a second class person isn't right and you no longer feel safe.", "NTA and your last sentence makes you an icon I wish I had comebacks like that at 17", "NTA and that last line killed me. 🤣😍🤣\n\nJust one thought about that lock- would they agree if you offered to give one of them a spare key? That seems pretty reasonable to me.", "Super NTA. They enable your sister's shit behavior; they can clean up her messes.", "NTA \n\nYour parents are toxic and your sister is a Rat. Its about time for your sister to realize that she cant get away with this at all. And its time for your parents to stop condoning your sisters behavior as well. \n\nFile the police report. That will scare your sister straight. And maybe she'll think twice next time. If she hasn't killed herself from her recklessness.", "NTA: your sisters actions have consequences. You should point out that you also had set a senario where you could have locked your room and none of this would have happened. Your sister is a known thief, what did your parents really expect was going to happen?", "NTA. Tell your nieces that it was your sister who cost them their trip, not you.", "NTA\nIt was your sister's actions that caused this mess. Not being able to go on vacation is the consequence of HER ACTIONS. she is an adult, she can't blame anyone but herself. If she feels bad enough, she can get a job and pay for the money used. \nYour parents need to stop the enabling.", "You didn’t deny your sister’s children anything; she did so with her dishonesty and theft, and your parents have enabled her while endangering you and your belongings. I’d ask them to replace your car with a van so you have somewhere else to live. NTA and I hope you make it out okay.", "I would find a safer spot then your parents house for all your important documents. Social security card, passport, birth certificate, anything like that. Maybe keep it at your grandparents.", "NTA. Truthfully, I don't think your sister will learn any lesson until she faces direct consequences such as going to jail. The money is technically your parents' so it does not have any direct impact on her financially unless your parents find a way to make her pay back the money. Don't feel bad, you are not in the wrong. You wouldn't be in the wrong even if you caused your sister to go to jail. You should move out as soon as you can, though. Staying in a toxic household will be a lot on your mental health.", "NTA - Your sister can get a job and replace the money your parents had to take from their vacation fund.", "Love the ending quip of “wouldn’t a lock have been cheaper?” Lol", "Nta. Your parents suck.", "NTA would it be possible for you to stay with your grandparents? You are absolutely right your sister is out of control and it's not your fault that the vacation funds will be depleted it's your sister's fault. If your parents or your nieces want to say something and blame you for it say no if she wouldn't have taking my car we wouldn't be in this position.", "NTA. It isn’t you who killed the trip to Disney - it’s your sister. Your parents can try to blame you all they want, but this was all a result of her choices. Good for you for standing up to your entire family when they were pressuring you to do something so obviously wrong. \n\nAnd lovely job asking them if the lock would have been cheaper.", "NTA. None of this is on you. You seem like the type not afraid to set boundaries and stand up for yourself. You’re going to do just fine in life. I’m virtually high fiving you for the line about how the lock woulda been cheaper. Epic!", "NTA.  I think the sooner you get out of there the better.  Can you stay with your grandparents?", "Nope. NTA.\n\nRemind them that you did offer a choice. If the trip is so important, then sis can spend some time behind bars (which personally I still think you should do.)\n\nGood for you for standing up for yourself and sticking to it", "NTA\n\nActions have consequences.  Your parents enable your sister in her poor choices, and now they get to pay for the consequences of their choices.", "NTA - well maybe she can get a job and repay  her parents. Also please take your valuables out of the house .", "If you can live with your grandparents I say move out and then file the police report\n\nNTA", "NTA. Buy a lock and I'm so sorry you have parents like this and such a vile person as your sibling, if is anyone to blame, is her.", "NTA\n\nI mean, if anyone is denying your nieces the opportunity to go to Disneyland, maybe they should look at the person who caused the damage to your car in the first place? Just a thought.", "NTA  She's more than old enough to do better.", "NTA your sister is the AH for being a failed mother, pawning her children off on your parents, rummaging through your room, stealing your car, then wrecking said car. Actions have consequences & if she didn't steal & wreck your car, her kids would still be getting the planned vacation. I guess sister can get a job to pay your parents back but it sounds like they won't enforce that.", "NTA. She took that opportunity from her kids, not you. The fact that she wasn’t even sorry for stealing and wrecking your car says it all. If she doesn’t have any money than she had no business stealing your car and buying fast food", ">So I said that I would call my grandparents. They had helped me get the car and insurance.\n\nWhy do I get the feeling that sister is the golden child? \n\nOP, NTA at all. And good on you for not backing down.", "INFO.\n\nWhose name is on the car title?", "NTA, they refused to protect your privacy so now they get to pay for what your sister stole and destroyed. It's not your fault they won't have vacation money, it's theirs and your sister's.  Once you get out of school I'd go VLC with the lot of them.", "NTA your sister a couple and utter asshole.", "NTA.\n\nYour final comeback is pure legend.", "NTA but your parents and sister definitely are. So sorry you’re in this situation OP-I hope you’re putting together a plan to move out when you turn 18!", "NTA.", "NTA.  At all.  And tell your parents to fuck their vacation. They created that mess and now they're grounded.", "Nta tell your neices that mom stole your car and wrecked it.  They can be angry at the person who actually spent the money.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f17) live with my parents. I have an older sister (29) that they had when they were super young. Like I think my mom was 19 and my dad was 18. \n\nThey did not do a great job with her and she has a lot of problems.  She is chronically unemployed and she is a thief.  \n\nShe has two kids that are okay. They live with us as well because her boyfriend didn't want them around.  I like the kids but they are spoiled little brats my parents dote on to make up for being shitty parents to their mom.  \n\nMy parents won't let me put a lock on my door because it is their house and they don't want that.  No problem. I talked to the kids and explained about what would happen if they came into my room without permission. We have an understanding.  \n\nWell my sister broke up with her boyfriend and she needed a place to stay. I begged my parents not to let her stay with us.  They declined. So I begged again for a lock for my door. No dice. \n\nI have to go to school so I can't guard my stuff at all times.  When I came home on Friday I found my car absolutely trashed and the side of it destroyed.  \n\nMy sister had gone into my room, found my spare key and taken my car.  Then lost control on the ice after a day of eating crap and tossing fast food wrappers everywhere. She sideswiped a tree. \n\nWhen I saw my car I was livid.  I told my parents that I expected her to pay to fix it.  They said she didn't have any money. So I said that I would call my grandparents. They had helped me get the car and insurance.  \n\nAfter talking with my grandfather I came back to talk to my parents.  I said that the insurance would cover fixing or replacing my car depending on the damage. But that I would have to file a police report. And that my sister would probably be charged for stealing my car.  They begged me to tell insurance that she had permission.  I said nope. \n\nSo rather than go through insurance they are replacing my car. But they are using money that they had sett aside to take me and my nieces to Orlando next summer for my graduation.  It's fine. I can do without seeing Disney World again.  But my parents, sister, and nieces are upset with me and saying that I'm an asshole for denying my nieces the opportunity to go on a vacation that they have never had.  \n\nI just asked them if a lock for my door would have been cheaper.  \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA- How about she work and take her own kids to Disney?\n\nShow them this post.", ">\nI just asked them if a lock for my door would have been cheaper.\n\nNTA, I'm crying 😭😂", "NTA. I would file the police report anyways. Let your sister face her consequences and your parents use the money to take your nieces to Disney. I also hope that your parents stop enabling your sister or that they realize they messed up with two kids when you move out and distance yourself from the family.", "By allowing your parents to buy you a car, the kids are getting gypped out of a trip but it is your sister's fault. Personally, I would favor filing the police report since that would force the responsibility where it belongs. But your choice. NTA", "NTA.  You aren't denying them anything.  Your parents are the ones doing this.  Your sister stole your car and wrecked it.  You are entitled to get your car fixed and it shouldn't cost you anything.\n\nIf your sister wasn't a thief, this wouldn't have happened.  If your parents didn't enable your sister, this wouldn't have happened.  If your parents would have allowed you to put a lock on your bedroom door, this wouldn't have happened.", "NTA- When there is a thief in the house, you have to lock up all valuable items. Your sister coming in and out of her kids lives, doing illegal things and not having accountability just sucks. The cancellation of the Disney trip is your parents fault for not installing a lock, and your sister’s fault since she stole a car.\n\nThey were given an opportunity to save the vacation fund by filing a police report. Your parents chose to go out of pocket and cover up yet another of your sister’s crimes. You are not the AH.", "I just asked them if a lock on my door would have been cheaper \n\n😂😂😂😂😂 \n\nNTA \n\nYour parents suck, your sister sucks, and the only ones who don’t suck is you, your grandparents and the nieces who stay out of your room.", "NTA you bloody legend!!!!", "NTA - Your parents are unreasonable. All they had to do was allow you a lock. They could have even kept a spare. (Though your sister would probably look for it) your patents continue to ruin your sister to appease their guilt for ruining her as a child. You may do well to see if you can leave and move in with your grandparents.  At least until graduation. Things won't get better. As far as your niece and nephew, this lose is a directbresult of their mother's selfishness. It's nor due to anything you did. Until your sister is held accountable for her actions she will continue to destroy everything around her.", "NTA - As a human being you deserve to have privacy and be respected.  Your sister is an adult who should be held accountable and your parents did not need to use the vacation money and then blame you.", "NTA They are the ones who asked you to not file a police report. They are the ones who refused to let you put a lock on your door. This was ALL their decision. They don't get to blame you for their decisions.", "NTA, actions have consequences and it sucks you have to teach your parents that.", "NTA\nThey’re just enabling her to be a child. They made poor parenting decisions and now their adult daughter stole and crashed  their 17 year old daughters car. Now they are blaming you when they could have just given you a lock on your door. They can even have the key but it’s the fact that they don’t care about your property at all. They know she’s a thief and they still give her access to things. And now they are placing blame on you when you tried to avoid something like this in the first place. \nCan you move in with your grandparents?", "I think you should actually still make a police report. This situation is throwing you under the bus.", "NTA. But honestly I think you should refuse their money and go with the insurance. Since your parents never taught your sister to deal with the consequences of her actions and keep bailing her out, she’ll just keep doing this and worse. Someone needs to put her in her place.", "NTA and your sister are going to get those kids killed if that’s how she drives maybe you should just call the police", "NTA.\n\nI see your parents are continuing to be bad parents.\n\nIt's not your fault that your nieces can't go to Disney - this is the fault of your sister for being a thief and your parents continuing to enable her crap.", "That last line there is absolute gold!\n\nOf course you’re NTA, OP! The car being totaled, and the redirection of the vacation funds are a direct consequence of enabling your sister’s self-destructing behavior.  I still can’t believe why they are protecting the sister even when the parents know the sister is in the wrong, shielding her from the consequences of stealing and then wrecking OP’s car. \n\nA lock would have been much cheaper in the long run!", "You are not denying them the vacation. Your sister with her selfish attitude that she could steal your car is.  NTA", "NTA - Spending twenty bucks on a lock for your door would have solved this problem you foresaw. Actions and inactions have consequences. I'm sorry you're losing out on the trip, but your parents haven't gotten that much better at parenting that they keep hurling you under the bus. I wish you all the best, and hope you have a plan in development for getting the heck out of that mess after graduation.", "NTA \n\nIt would have been cheaper to just get you a lock for your door. At no point in your story am I hearing that the older sister apologized for totaling your car nor am I hearing that the parents apologized for allowing her access to your property by not helping you secure it before hand.\n\nYour sister sounds like a trainwreck who's parents enable the behavior by bailing her out of every mistake. They shouldn't be mad at you for making her face the consequences they should be mad she continues to screw up", "Tell your parents that their lazy oldest daughter can get off her butt and get a job and give them the money back to take them to Disney. They made the choice jail or money they chose money and are yet again enabling their waste of space daughter. I would demand a lock now, never kind the camera or oven move to your grandparents if that is an option so you have a safe place to live", "NTA. Nice comeback. The fault is with your sister for trashing a car and having to borrow money from her parents to pay it off and thus denying her daughters the trip. The fact that apparently nobody else except you can see this is sad.", "NTA. tbh if you think you can handle your parents lashing out for thwir golden child then I think you should file the police report. \n\nYour sister will never learn her lesson and neither will your parwnts. Having the police and law back you up might make that message much cleaerer to the WHOLE family.", "NTA - Your parents and sister sucks", "Definitely NTA. \n\nYour parents are enabling your sister's shitty behaviour, and between that and refusing to let you have a lock (side note: not letting you lock your own room is ridiculous), it's their own damn fault they're having to spend money to replace your car.\n\nAs several folks have said, play stupid games win stupid prizes.", "NTA\n\nThis internet stranger is proud of you for standing up for yourself.", "NTA - Move out and don't look back. (That's way harder than it sounds, by the way.)", "Nta. Orlando was gor the neicez to begin with! Like a high school grad would choose Disneyworld for vacation. Funny how they aren't saying you are giving up your vacation. Your graduation is being used so they can do things for the necessary, not you.\n\nYour sister ruined the neices chance to go, not you. And your parents shouldn't pay for the car. They are enabling sis to continue being irresponsible and allowing her to pass liability to them, yet again. She doesn't even raise her own kids. She respects nobody, \n\nJust save what money you can. Move out asap! That is the best way to avoid this bullshit!", "Personally, I wouldn't let them pay for it.  Your insurance company will want to know about the accident, so you need to report it.  You don't want to risk your own coverage later.\n\nAnd absolutely don't lie to them about her having permission, for the same reason.", "NTA. Don’t lie to police or insurance because it could bite you in the ass. It’s fair for them to either pay up or you go to police. Just because someone is family doesn’t give them the right to steal", "You are definitely NTA, but sadly, i think they will continue to think that you are the a-hole, and there’s no way to change their thoughts. Hope you survive the drama until you move out.", "NTA and your sister deserves to spend some time in jail from the sounds of it. You did nothing wrong and having to use vacation money to pay for it sits squarely on your sister’s and parents’ shoulders.", "NTA. Your parents made their choices. Now they have to live with them", "NTA you are well within your rights to do this. I would also consider reporting her if anything happens again, and leaving ASAP, as this will not bode well for your home life. In the future, keep all valuables, keys, spares etc in a well hidden lock box if you can't have a lock on your door.", "NTA , your sister stole everyone’s vacation.", ">But my parents, sister, and nieces are upset with me and saying that I'm an asshole for denying my nieces the opportunity to go on a vacation that they have never had.\n\nThis is why I would go ahead and file the charges. Because they are going to make you miserable by trying to blame you for this rather than accepting their responsibility in it all. Much easier in the long run to hold your sister accountable legally and get the money that way. Her bad choices should have consequences.", "NTA report it to the police now. Tell your nieces that it’s their mothers fault for stealing something that did not belong to her. That she is an adult who knows better, but doesn’t care about anyone but yourself and if they don’t want to end up like her, they better pay attention to the way she behaves and not act like that. Keep calling out her behavior and your parents too.", "NTA! Well played, you give me hope for the future.", "NTA, but I wouldn’t even have given them the option. Your sister isn’t going to stop being shitty until your parents stop cleaning up her messes, and they’re not going to stop doing that if there’s a way they can, so just don’t give them the option.", "NTA.  They are enabling a thief.  They won't let you protect yourself and your stuff.  This is the direct result of their actions, and they should fix it.  \n\n***You*** **are not the one denying the children a trip.  Your sister did that,** because it's her mess they are paying for, not yours.  **This is all her fault, not yours.**  Maybe when your parents start to save up again for another trip, they should first save up a larger fund to pay for the next mess your sister creates and gets them to fix for her.  \n\nI hope you can move out of that place soon.  With them all blaming you, instead of holding your sister responsible for her behavior, her theft, this isn't a place that is healthy for you to live.", "NTA... they're mad at you cos you lost them the holiday? 🤔 Didn't your sister lose them the holiday when she stole your car and crashed it?!", "FAFO NTA", "NTA", "NTA. Your parents are not smart. All of this could have been prevented with a simple door lock. I’m sorry your sister is a grown adult loser and your parents don’t have ten IQ points between them. You are the cream of the crop.", "NTA obviously.   Sister is a monster...their monster that they created.   Taking away your vacation is still an AH move on their part but you're right...having the car is more important.", "NTA.  Your parents got an expensive lesson in the value of locks.", "NTA. But your parents are enabling assholes.  Be sure to tell them this could have been avoided had they simply let you have a lock on your door.  Basically they have created a monster with your sister.  Any chance\nYou can live with your grandparents?", "NTA\n\nActions have consequences.", "NTA but I would suggest you file a police report and let the insurance cover the damage.  She still lives with you.  If you get it fixed she will steal it again and maybe the next time you won’t have evidence and your parents don’t have a second vacation fund to cover it.  Or she will steal something else that isn’t insured.\n\nWhat if she had hit or killed somebody and then tried to pin it on you because it’s your car?  \n\nIf she had come to you and offered to work and pay and showed remorse maybe, but she has NO incentive not to do this again (which she will because all she has learned is that your parents will cover for her).", "NTA. I'm not even going to get into the fact that the car was stolen, I'll just address the twisted logic of blaming you for not getting a vacation.\n\nRepairing your car is simply an expense that needs to be paid. There's no debate about that. It doesn't really matter what that money would've been used for, that part of the equation isn't your responsibility in any way.\n\nHere's another example to illustrate that point: if you had dental work done and the dentist sent you a bill, would you then blame that dentist for the misery and death of a young Bolivian child? Because before this expense occurred you were planning to make a charitable donation to UNICEF and now you can't afford it anymore? Of course not, it's not the dentist's responsibility to make sure you have extra money to donate. Accusing the dentist of that would just be a slimy use of emotional manipulation to get out of your financial obligation. And it wouldn't work because the logic of it is so stupid.", "NTA. \nI agree a lock would have been way less expensive. However at some point she will have to deal with the consequences of her actions.", "No, no, no, no, no.  Your parents and sister don’t get to throw you under the bus when you have graciously consented to not filing a police report.  That’s the dealbreaker, right there.  File the report and let it all play out.  They had the choice to replace the car quietly, with no fuss, out of gratitude that you didn’t report your sister.  They complained and brought the kids into it.  It’s time to administer the true consequences.\n\nNTA", "Take my award and turn it into a lock.\n\nNTA", "NTA\n\nYOU are not denying your nieces the trip. Your parents are. \n\nI would say screw that, don’t accept the money and file that report. Actions have consequences.", "NTA. They should just let you have her arrested, then they would have the trip money and she would learn a lesson.", "NTA and you need to get out of there as soon as you can. This is an incredibly toxic situation.", "NTA!! \n\nDisney will always be there but you need your car today. \n\nPut a lock on your door no matter what they say!", "You are my new favorite hero! Good for you for standing up for yourself and not getting the run around.", "NTA. You did the right thing and they are mad at the wrong person.", "NTA and look into other ways to secure your door without installing an official lock. Maybe some safes? Sucks you have to live like this.", "NTA-Smile and say you will be so excited when your sister pays back the Disney World vacation money so you can all go have fun.", "So you are getting punished (no grad trip) for your sister stealing and then crashing your car, AND your parents have the audacity to blame you for messing up your nieces’ vacation? You need a new family, not just a lock for the door. NTA.", "NTA. Hopefully you'll get a lock now", "NTA. And I’d have call insurance and the police. Time to face consequences.", "NTA at all OP. Your sister is solely to blame for this situation. You should seriously consider reporting this to the authorities. She claims it was a tree she sideswiped, this could easily be a lie or half-truth.", "NTA, proud of you. You seem very level headed and soon enough this won’t be your problem in the least. Best of luck.", "NTA is there a way you can move in with your grandparents", "NTA - it sounds like *they're* the ones choosing to pay for it out of pocket when your insurance will cover it. You researched all the options and *they* chose the one that means you have to cancel Disney world, I'm not sure what else they want from you.", "NTA. It's their fault for enabling the 29 year old child, so they're going to pay for her \"mistakes\". Your parents are old enough and knew better than to have tolerated their daughter's behavior until now. I would have filed the police report so she can finally learn to not be an AH. Also, she's trash for ditching her children so she can be with a guy.", "NTA\n\nthey are putting the blame on the wrong person.\n\ntell them they can go see disney world, if they are ok with having their mother in jail. make them choose. \n\nregardless, actions have consequences and the only person here to blame is your sister.", "So they're making u pay for it w/ur trip? I hope they start saving up to celebrate ur graduation still at least. NTA", "NTA \n\nFirst off I love the last line. Second it sucks your parents are so bad at being parents despite the multiple chances they had. You're proof that despite that you don't have to be a victim of theirs", "NTA but pleeeeeeeeease what did they say after you said that lock shit 😭😭", "NTA. Not only do they want to have their cake and eat it too, they want to be able to eat it twice. They don’t get to fix your car AND avoid a charge for your sister AND have vacation. Even this solution is still shut for you, because you’re missing out on a vacation meant to celebrate you even if you’re not overly bothered by it. The audacity to be mad at you when you’ve done nothing wrong. In fact, you’ve been overly kind by making sure your sister doesn’t get in legal trouble, the only scenario in which she would actually consequences for her actions. She has months to earn enough money to pay them back if everyone else is so pressed about not vacationing. They should be mad at her, not you.", "NTA.  \n\nThey didn’t assist you in keeping your stuff safe!\n\nYour sister and nieces are allowed to ruin your stuff because “FaMiLy” \n\nThen they can pay for the penalty", "NTA. They don't have to spend the money. That is their choice. They chose not to take your nieces to Disneyland because they would prefer that their mother not get punished for stealing your car.", "INFO: Why are they replacing your car instead of fixing the damage?", "NTA. Your parents are enabling her, and still don't appear to have learnt their lesson.", "NTA and it may be time to move in with the grandparents. \n\nYou gave them 2 options and they choose the one they wanted. It’s time they learn actions have consequences.", "NTA. Lock would be cheaper. Have you obtained one now?", "I don't think a lock on the door would have stopped that woman.  You suspected something like this would happen\n\nYou had to do it because it will never end and year after year you will be poorer because of her attidue.  A criminal conviction is certain - its a question of when\n\nNTA", "I love your reply to them! NTA, sister needs to grow up and be responsible.", "NTA your sister has a choice. Police report or her kids go on vacation. Reframe it like that and only like that.", "Why do you have to file a “police report”? I got in an accident and my insurance covered it. I have never heard of a requirement of a police report", "NTA, but do you really think a lock would prevented, your self described “chronic thief sister”, from stealing ?", "I have a security cam. I have evidence. It was better than a lock in this case.", "Yup. And they're all wrong. Its not your fault that the vacation is no longer a possibility. Your sis was the cause of that...enabled by your parents. They all can blame themselves.", "Sister could use a good couple of years in jail.", ">NTA - \"Play stupid games, win stupid prizes\"\n>\n>>I just asked them if a lock for my door would have been cheaper.\n>\n>LEGEND\n\nFor real! I wish I had been able to be this on point at OP's age! \n\nNTA. Obviously!", "Heck yeah. Op learned what NOT to do by watching her older sister. My other favorite line is \"my sister, parents, nieces are all mad at me.... \" like WHY would the sister have the nerve to be mad? SHE stole the car and it's her own fault her kids will be disappointed. OPs parents suck too for enabling this absurdity. \n\nNTA op", "I do.", "Yep, OP needs to use that script or variations of it every time they try get her aboard the guilt train.\n\nNTA. Sister stole the trip by stealing and damaging the car. It’s probably really difficult for a 29 year old to understand that actions have consequences given how the parents’ first inclination is to always bail her out of any trouble, but here we are.", "Sister is clearly the golden child. You don’t the parents here wouldn’t happily hand over the key to her?", "Tagging onto the top comment here. OP you can buy a lock box on Amazon for $50 or so to keep your valuables in. If you still have a year left before you can leave, you should invest in one.\n You can keep the key on you at all timess and hopefully it would prevent this from happening again. \n\nGood luck!", "FWIW, Years ago, I was in my car and was rear-ended while my hazards were on. I saw the driver & passenger of the vehicle & got the plate after they took off. I filed the police report, because of insurance.\n\nThe police never followed up on my report & the driver had a long history of similar vehicular incidents (crashes & DUIs). There was a comment made that I should have filed some additional paperwork to press charges to the hit and run, but the police didn't explain anything when I filed my report.\n\nSo, the point of all this is you might very well file the police report - and nothing could happen to your sister. Depends on the police and DA. Often times, as it happened within the family, charges would not be filed where I live - YMMV.", "This, 100%.  NTA", "It's already there.  With my mom's parents.", "I blame her parents.", "Grandmother", "Many insurance companies require this", "My grandfather says I need to do it for an insurance claim.", "Probably cause sis isn't covered on the car, took it without permission, damaged the car and brought it home instead of reporting it at the time of the crash", "Pretty sure OPs insurance will go through the roof if she “authorized” someone to use her car and they crashed it. The insurance will have to pay for the work done in the car and increase OPs rates. \n\nBecause the sister stole her car (unauthorized use) OPs rates shouldn’t go up as much, but the insurance company would need proof that OP isn’t lying about the theft to get out of a major rate hike. Hence the police report. I think this also allows the insurance company to go after the sister.", "Usually when someone takes things without permission, it’s considered theft. Smh….most people report thieves to the police. \n\nMost insurances require a police report since the insured didn’t give permission for someone to drive and crash their car….", ">I got in an accident and my insurance covered it.\n\nAnd *you* are an authorized driver.", "Because if someone stole your vehicles then your insurance doesn’t go up, because it shouldn’t happen again and was out of your control. \n\nIf you or someone you trust destroyed the car the it goes up because it can happen again.", "Yes. She needed a key to start my car.  So she would probably need a key to open my door.  It's not like she's Catwoman. Just a regular shoplifting, stealing from friends and family thief.", "Add the lock and keep the cam. As a thief, your AH sister could still pick the lock and take anything again.", "Back up those video files in a couple different places and in the cloud in case you ever end up making that police report.", "Go to the police anyway, even if they pay back she stole your car and ruined it. Your parents can't keep enabling her and she's old enough to be responsible for her actions. NTA but you will be if you don't report.", "Smart", "Honestly, it could be the best thing for her in the long run. Get therapy, a GED or just learn that being a lying entitled twit will get you pummeled in the cafeteria. It genuinely could be a positive for her going forward. If they began to raise their 29yo, she may actually grow up in her 30s.", "I hope you can save all the money you can and get out as quickly as possible. Good luck.", "Of course you do, but your parents ought to be noticing that she stole and wrecked your car and that is all on her. Well, and them for enabling her.", "Try to explain to your nephews whose fault it is that the trip was cancelled, if they understand how to not invade your room for privacy, maybe they'll understand this easily.", "I cannot imagine that level of assholery, but you might be correct. Uggh, I hate humans.", "Then ide talk to your grandmother and ask her how you should deal with it. Her opinion is the only one that really matters.", "It’s more than likely a location-based requirement because I thought it was totally standard for an insurance co to require a police report.", "You do. And it's easier now than when you eventually have to because the money is not actually coming.", "Umm , unless you’re taking about some crazy nonstandard house lock, anyone with a credit card could break in. Ive had similar issues with my siblings, locks and safes sure didn’t stop them from stealing my crap when they are determined", "Done and done.", "These are people who are taking OP’s graduation trip plus disappointing the grandchildren they are raising to protect their daughter from consequences.", "Her husband, my grandfather is the one who said I need to file a police report.", "Deadbolts don't give way to credit cards. You're talking about a doorknob that locks, but I'm pretty sure OP is talking about a deadbolt.\n\nAnd I guess you didn't have a very large safe? Or it wasn't affixed to anything.", "Honestly, I would. Your parents are enabling your sister at the expense of you and your niblings, but you don’t need to enable them.", "Well yes, I’m sorry as a 12 Yo child I didn’t have a gun safe, and he snuck in through windows even when I had locks.", "NTA. You saw this potential scenario arising and asked  your parents to take some proactive action. They also then chose not to support filing a police report and further protected your sister. This decision was on them, and not you, for why your nieces aren’t going to Disneyland.", "NTA. Well THAT was an expensive lesson! You are better than me. I would have turned into a fire demon when I saw my car. Have your parents put your sister out yet?", "NTA. I’d be wary of your mom having the spare deadlock key. If your parents were willing to manipulate you into not having your sister charged, they could easily give someone else the key to avoid a new family drama.", "Info: where is your mom keeping the \"emergency\" key?  Is it where your sister can get at it?\n\nAt least you've got a camera in your room.", "NTA.  I hope she has a plan to keep that spare key hidden from your sister.", "NTA your nieces should be mad at your sister.", "Idk I have a feeling they're not gonna pay for it. I'd file the police report anyway NTA", "Dude why are you the coolest and most level headed and well prepared 17 year old on this planet. I am so fucking impressed - you go girl \n\nNTA ofc", "INFO: what has your sister said about all of this, other than she thinks that you are mean for taking a trip to Disney World away from her kids?", "Just a quick question, would your parents just pay for the deductible? And whatever increase you’ll get for filing a claim?", "Does this mean they can lock you in?", "NTA. You need a padlocked door, with the hasps set in unscrew - proof metal plates wrapped around the frame...look for security types. A complicated, re-programmable padlock. Give the codes to a friend or something. Really, how likely is it there'd be an emergency need to enter a teen's room? \n\nLaundry emergency? Gotta have that Scrabble games? I need your grey dress? \n\nMaybe a lockbox for your keys, passport, money, etc that you leave home. \n\nYou are my spirit animal. Escape soon. You can be Amazing Auntie from far away.", "NTA. Your final comment really hit the nail on the head, too. Epic.", "File the report anyway.", ">my mom gave me a key. She says that she is keeping the other one for emergency. I agreed as long as it was only for emergencies\n\nSteal the key before your sister does.", "Nta they should turn her in maybe she'll  grow up.", "They should have let you go to the police. Your sister will do this again as your parents are her enablers", "AND THEY'RE MAD AT *YOU* FOR HAVING TO TAKE AWAY GRADUATION PRESENT *FROM YOU*?\n\nJesus fucking christ. Obviously that trip was never for you, you're better off taking a cheap road trip in your new car with your closest friends. Maybe to Orlando to show them a middle finger.\n\nNTA", "Your mom better wear that key on a necklace, or your sister is going to try and find where she hides it.", "It’s pretty obvious that you are NTA.  Anybody complaining about the money for the vacation should be directing it at your sister. And just the fact that they are even complaining when you offered her an out from going to jail for her stealing your car - it’s beyond the pale. They should be falling at your feet you for letting her off the hook. \n\nYou are a legend for that last line about the lock. Just brilliant.\n\nBut honestly if anything like this happens again - go straight to the police. She doesn’t deserve a second chance.", "NTA. Your parents had options. They could have allowed you to protect your belongings. They could have allowed your sister to face the consequences of her actions. They could have required your sister to pay them back the vacation money. They could’ve at some point actually parented your sister so she didn’t think stealing and crashing your car was acceptable. \n\nInstead they chose the option that they thought would hurt you also, and would let them blame you for the repercussions of their bad decisions. A+ parenting. \n\nThat being said, I’d start making sure anything you truly care about gets moved to your grandparents house or another safe place. If your mom has a key that lock is 100% a polite fiction which will be open as soon as your sister demands the key. Which will probably be in about a week once she gets an itch for vengeance against you for… doing absolutely nothing to her.  Maybe see if you can move out sooner rather than later.", "You are the asshole. Your sister is family. You don’t snitch on family. You are hurting your nieces. You just need to suck it up and accept that these things can happen. Accept that you won’t have a car for the time being. Get a job and save up for a new car yourself.\n\nHopefully, you have noticed that the above paragraph was sarcastic. Of course NTA. Your sister made her bed and needs to lie in it. Sadly, the above paragraph is literally how your parents think.\n\nYou should go to the cops and file a police report. If your parents pay for a new car, your sister won’t learn from her mistakes. Then, her parents enabled her behaviour.\n\nHowever, since you live with your parents, there is one problem. They might punish you for going to the cops or demanding that your parents pay for a new car. They might ground you, take your phone away or even kick you out. Your sister is clearly the golden child. Your parents clearly hate you for not just letting things slide. So if you go to the cops or ask your parents for money for a new car, prepare for some heavy consequences, as sad and unfair as it is.\n\nAre you able to move out? Or live with your grandparents? This is very important. You might need to escape if your parents are going to punish and abuse you out of resentment, which is extremely likely to happen.", "NTA. \n\n“I just asked them if a lock for my door would have been cheaper.” 🔥🔥🔥", "NTA, for the reasons given. Also, very wise not to lie to an insurance company.  Insurance fraud is a serious crime and you don't need to deal with that for your idiot sister.", "NTA your parents need a dose of reality like yea you guys fucked up with your daughter but that they all need therapy because what they're doing is what's leading to more problems", "NTA. This is on your sister. It’s fully time she grew up and took responsibility for her actions.", "NTA- if you can go live with your grandparents", "File the report.", "NTA. I hope you are able to move out soon.", "NTA.  Your parents are acting idiotically and enabling their older, ADULT daughter to behave criminally without repercussions.  I don't think I would have even agreed to do as you did and not go through insurance.  Screw that - there are situations to go strictly by the book and this is one of them.  I hope you're able to move out soon after turning 18.", "Nta seems like they all need to learn that her actions have affects  on everyone ...Its not your job to enable her bad life choices or to make sure your nieces  have nice things", "NTA.  You rock!  Glad you stood up for yourself.", "When i started reading this, i thought \"well, she sounds resentful\". Halfway through, \"yeah, resentfulness is very much justified\". NTA.", "Nta, they have misplaced the blame. They are only enabling your sister by not letting her face consequences and learn from her mistakes. This is entirely their fault", "Your parents are assholes.  They did a bad job raising your sister and rather than allowing you to have a lock on your room to protect your possessions they are catering to a selfish entitled and immature adult( your sister) who still doesn’t understand the consequences of her actions. Now they are trying to make you feel guilty because they once again don’t want your sister to face the consequences of her actions.  If your parents had allowed you to put a lock on your room or not brought your sister into the house this would not have happened.  Also your parents don’t want you to file a police report so this is now their problem to solve.  Your sister will never grow up with your parents removing the negative consequences of her irresponsible actions from her all the time.  Nothing like everyone blaming the only mature person (you) for the situation that has occurred.  I’m sorry you have to deal with this.  You are NTA", "NTA. This could all have been avoided if they'd just given you a lock for your door to start with\n\n\"my parents, sister, and nieces are upset with me and saying that I'm an asshole for denying my nieces the opportunity to go on a vacation that they have never had.\"\n\nSo...they are mad because they couldn't use their money and YOUR special occasion to justify a trip for your brat of a sister and her kids? that makes you even less of an a-hole, you yourself said you can make do without the trip, so it's better if you get a car again out of this", "NTA at all. Clearly you’re more mature then your parents.", "NTA...You offered your parents a very fair option...1. Police report and insurance pays 2. They pay. It does not matter that they used vacation money or not...what matters is YOU WARNED YOUR PARENTS AND THEY IGNORED YOU.", "NTA\n\nAnd heck yes for the deadbolt.", "Nta. Man I feel for you with shitty parents. Always amazes me what I read here.", "'...Lock on the door would have been cheaper.\" That is classic, mic 🎤 drop moment for sure.\nNTA", "Insurance may refuse to pay for repairs to OP's car if she tells them sister did not have permission to drive it. That happened to my husband. Young man took his parents' car without permission. Ran my husband off the road doing significant damage to hubby's car. Their insurance refused to pay because he did not have permission to drive the car. Our insurance paid for the repairs, but went after the other company.", "Too bad, so sad.\n\nNTA", "NTA. Your parents absolutely should not have asked you to commit insurance fraud, which could lead to consequences for your future insurability - or worse - if the truth were to come out. If your parents want the insurance money, it has to be obtained through a completely fact-based process, regardless of any risk to your sister, who is at fault. Otherwise the risk is all on you, at 17 years old. NO. However, while it sounds (justifiably) like this may not be relevant to you, it's not necessarily true your sister would be charged because you file a police report. You may have a choice after reporting as to whether you press charges or not against someone who wrecked your personal property. I would look up the law in your jurisdiction, or ask help from someone you trust with this before you move ahead. Only because knowledge is power. Then do with that knowledge what you want.", "NTA. Do you have the option of filing a report and not pressing charges at this moment? Figure out all the information you need to make sure the cops have a solid case in case this  happens again.\n\nI'm glad your grandparents have your back.", "NTA. Either way is a loss for you, you aren’t making a choice in favor of yourself at the expense of others. Now you don’t get to go on vacation, and your car has been in a wreck. Both bad things for you. They should be blaming the people who actually made bad decisions.", "You're sassy... I like it. Nta", "NTA\n\nGreat answer re the lock for your door.\n\nHowever what are the chances of  keeping your sister away from that spare key that your Mom is holding?", "Nta. This are the choices they made. And in fact its your sister fault they decided to rebuy a car.", "NTA\n\nIt would likely be a different story if it were your parent's car, house, or possessions.    If they are angry at you, maybe it is time to find your own place where you can be away from the situation.   Clearly, they are punishing you for your sister's bad behavior.      Remind them that if it were anyone else taking a car without permission, a neighbour, a friend, etc., they would be subject to police charges.", "NTA, make sure your sister knows it's actually her fault that the vacation has been cancelled as she should not have touched your car. If she learned that basic principle of not taking things that don't belong to you then she wouldn't have put her kids in this situation. \nYou need to get out of that house after you graduate highschool and go to college far away.", "NTA\n\nWhen you get the chance, run far, far away from these people. It’s sad that you’re the kid, yet have to be the adult in this situation. That’s good that you can be like that, maturity is great at any age, but your parents and sister look embarrassingly bad in this scenario, which is very sad.", "NTA. \nHonestly you should still file that police report. It sounds like your sister will never learn from your parents. Might as well give her a lesson in life about stealing.", "Absolutely NTA \nalso why are your nieces mad at you and not your sister? Clearly it’s her fault they can’t go to disneyworld", "Call the police and make a report anyway. Your sister needs to go to jail. Let her get away with this and she will end up killing someone.", "NTA. And the only one who isn't.  How is this even your fault seriously.  Sister stole and wrecked the car. Parents were given options.", "It’s just a matter of time till your sister does something worse to your parents, you, the home and vehicles. Your parents are ensuring that she does by not allowing her to face the consequences", "Huge NTA and good for you. You’re going places!", "As your grandmother owns the car, there is nothing stopping her from filing the report. Noting YOU have permission to drive but others do not. Then it’s up to the insurance what they will do.", "NTA and honestly, I’d still go through insurance and file a police report. Your sister is never go to grow up if your parents keep babying her and bailing her out.", "NTA, I'm reading from your edit, I think you should replace the deadbolt that your mother gave you. Because given that your family is trying to blame you when you're giving her an out for her bad parenting, it says you actually can't trust her to have a key to your room.\n\nMake sure you have a say and what car is bought, cuz it should be big enough so you can pack up your stuff and move out since all your family says that you should eat the cost for your sister stealing your car", "NTA- the vacation was canceled because those kid’s mother is a thief and your parents protect her. Not your fault at all", "NTA. Call the cops for your sister taking your car without your permission", "Lol so for YOUR graduation the plan was to … so something specifically for your nieces? Wtf?? NTA.", "Sorry this has happened to you, but hopefully this will get your sister away from you and your parents will \"see the light\"...", "NTA! Your sister’s the asshole and your parents are overprotecting her because they know they’ve done her wrong. \n\nSorry op.", "NYA. This is the same sister, and her kids? They should only learn the serious lesson being taught. This has very little to do with you and lots to do with them. Someone needs to make it clear.", "NTA. Im proud of ya for knowing how to stand your ground. 🙌", "NTA.  You are not denying your parents, sister and nieces anything at all.  The money is your parents'.  They decided that they would use it to repair the car your sister stole from you and trashed, which she was able to do because they would not allow you to have a lock on your door.  They are using the money to repair the car because they are protecting your sister from being charged with car theft.  What has that got to do with you?  Nothing.  You are just trying to get your car repaired.  I am glad you finally have a lock now.", "NTA\n\nSo have they accepted, though begrudgingly, that no one's going to Florida? Or did they flip over and tell you it's ok to file a report on sis?\n\nAlso, I believe your insurance would be impacted if you said she had permission but she's not listed as a secondary driver on the policy.", "NTA. I love that you're 17 and putting down boundaries (legally too) and not afraid to say it how it is.", "Nta", "NTA - OP you kick ass!!", "I feel sorry for OP. She shouldn’t have to deal with this shit", "NTA - You are doing them the favor by not filing the police report. They should be fucking grateful.", "NTA and I think we all know who the adult in the room is.", "OP, your parents definitely did a better job second time around. NTA. \n\nPs. These are going to be tricky relationships to navigate for a long time. Get yourself in a position where you aren’t reliant on them as soon as you can.", "NTA\n\n>I just asked them if a lock for my door would have been cheaper.\n\nWell done for this comment. You were completely in the right anyway, but respect for bringing this up.\n\nIn all honesty, that holiday fund is likely going to get eaten up with your sister being back anyway, so at least your car won't suffer before your parents spend it on your sister's next mistake.\n\nIncidentally, I'm in UK and guessing you're in US. Over here, lying to your insurance company is a serious issue that can potentially result in prison and will get you refused by most providers for years at least. I wouldn't be at all surprised if it were a felony in US. Good on you for refusing to lie about the damage, never let anyone talk you into lying for any legal or insurance matter. You can never get your integrity back once you've ruined it. Your parents never should have asked you to do that.", "NTA. Your parents and sister are w/o a doubt and I’m amazed at your maturity (and zinger about the lock). Let’s review the choices made here.\n\nYour sister made a choice to commit a crime by taking the car without permission. \n\nYour parents made a choice to ask you to lie to the police or insurance company, which would likely be a crime either way.\n\nYou *wisely* made the choice to reject a suggestion which could have had terrible consequences for you.\n\nYour parents made the choice to use the vacation savings to replace your car because they didn’t like the only other legal option. \n\nIt’s 100% fine to calmly respond to your parents’ criticism with “Using that money was your choice, not mine.”\n\nIt’s 100% fine to calmly respond to your sister’s criticism with “Then I’ll file a police report about the stolen car so insurance can take care of it.” \n\nIt’s 100% fine to calmly respond to your nieces’ criticism with “Grandma and Grandpa thought this was the best decision and you will have to talk to them about it.” If they persist, you can say that sometimes grown-ups make bad decisions, it’s rotten that this one is costing them a trip they were excited about, and you hope they’ll make better ones when they’re grown-ups.", "NTA. Your parents learned a hard lesson in trusting their golden child. You’ve been smart and are lucky to have the support of your grandparents. Get away from these people asap.", "NTA. They should've let her get sent to jail. If there's no consequences to her actions, she's never gonna learn. Your parents made a choice. They opted to spend the money. Nobody's fault but theirs.", "NTA, tell your sisters kids that Mommy ruined their trip to Disneyland the next time they bring it up. They need to know the truth. Your parents need to accept your older sister has problems and will continue to take and take until she faces consequences. Honestly it sounds like it would be better for the kids if mommy went to jail.", "NTA and I’m gonna be honest; in your situation I wouldn’t have thought twice about getting her jailed. She stole your car and crashed it. All because your bozo parents couldn’t be bothered to spend a few bucks and your sister just couldn’t keep her hands to herself in regards to your car. Plus, what kind of example is that setting for her kids? If you do the crime, you gotta do the time", "NTA\n\nGlad to see you got the deadbolt. You did everything perfectly.", "NTA. Your sister is going to continue to ruin her life and those around her. If I may offer some advice:  got to college and get a degree in something you can make a good living and would enjoy doing. Then move and limit contact. Your sister will probably take everything your parents have by the time she’s done and will move on to you for handouts.", "NTA", "NTA - good job standing up for yourself and calling out your sister's shitty conduct. What will it take for your parents to wake up and cut the umbilical cord with her? Will she have to steal a car and injure or kill someone? \n\nSeriously, you've done nothing wrong. Maybe your sister can get a job and pay your parents back. And if she already has a job, let her get a second job so she can see to it that you and your nieces can go to Disney World.", "NTA. I wish I was as witty and resourceful as you at 17!\n\nI hate that your sister is getting away with a crime AND they’re using money they set aside for your graduation(so no real consequence for her) though. Hopefully it’ll teach your nieces a lesson since I’m pretty sure it’s too late for your sister.", "NTA, but your sister will likely find the key given enough time.  Somehow thieves ferret out everything.", "Glad you got your lock!! NTA", "THAT CLOSING LINE IS IMMACULATE. NTA.", "NTA. Fabulous negotiation.", "NTA if they had given you the lock this would not have happened and your sister needs to get her life together she is too old for this nonsense and has two kids your parents are enablers that’s why she does what she wants", "> I just asked them if a lock for my door would have been cheaper.\n\n😂 \n\nNTA", "NTA. And you honestly don’t deserve to miss out on your graduation trip either! They should force your sister to get a job and make payments back to them for the costs so you can still go on the trip. They need to hold your sister accountable instead of just cleaning up her messes for her. And if she refuses to pay they need to kick her out and file for child support considering it sounds like they are raising her kids for her. So sorry this happened to you btw!", "Today on Reddit has been a good day for younger people having good values and boundaries. This is the second post I've read today where somebody under 20 has used their words effectively and advocated for themselves firmly and effectively. I'm so impressed. NTA. And congratulations! You are well on your way to a very successful and happy adulthood even if your family life kind of sucks right now.", "NTA. I don’t know you and I’d vote for you for president", "NTA I'm glad you got your door lock. Good on you for standing up for yourself.", "NTA. I'd still file a police report because I'm pretty af. Your sister needs some consequences.", "NTA - Your parents are enablers. They are just as bad as she is in a lot of ways. Frankly, you don't know what else she may have hit, or if they police will come looking for you, so you really should have filed a police report regardless.", "NTA.  Sounds like you are the only adult in the group.  But you are doing a good job raising your parents.", "NTA\nWhen people give you a hard time reply with “I’m happy to file the police report instead if you prefer. We can go to Disney but she’ll be in jail. Your choice.” And then move on", "NTA. It is your sisters fault that her children won’t be going to Disney World first because she is a crap parent who doesn’t take care of her own children and second because she cost the people who do support her children their vacation money by stealing your car and destroying it. \n\nNot your fault and everything you said was true.", "Tell her you could have filed with insurance and she would be in jail if they didn’t use the money you saved her hide", "Your family sucks", "NTA at all but if the grandparents are on the title then this is now an issue with them and your sister and has nothing to do with you. I don’t even think you could file a police report since you are not the owner of the vehicle.", "NTA. You sound incredibly perceptive and sharp, and I am fully empathizing with you and sending you healing vibes.  I'm really glad you're getting your car replaced and have a lock on your door, but I've gotta say: as someone with a mentally ill, similarly-destructive sister, you MUST GTFO of there as fast as you can, and never look back.", "Why are you parents repeating the bad parenting…? If the niblings are ‘brats’ the parents have obviously learned nothing.\n\nNTA.", "NTA, but you are my hero!", "Nta I report the sister regardless.", "Congrats to you for standing up for yourself. NTA clearly. Any update on your car? Have they explained to your nieces why they can’t go on the trip?", "NTA. Parents and sister are the AHs here. She steals the car trashes and smashes it up. And they pay for it because she has no money?  Well maybe she shouldn’t have been driving it! Actions have consequences. Parents are enabling her. Somebody besides you needs to pay. Don’t listen to nieces etc. it’s not their car that was destroyed. They obviously don’t care.", "There are consequences for every action. If your parents want to take responsibility for your sister's failure, then that's on them. Don't feel guilty, they are gaslighting you.\n\nNTA.", "NTA.", "NTA. I would honestly report the damage to the insurance. Your sister committed a crime and your parents are enabling her to do so. I’m glad they finally gave you a lock on your door but that’s just putting a bandage on a gushing wound. I do understand why you’d prefer not to report it to insurance though, your parents would likely be angry and it would make life harder on you.", "Glad you finally got that lock. Make sure your parents understand that if anything else goes missing from your room you will assume it was them that stole it since they have the only spare key. NTA by the way. It was a police report and jail or them replacing the car out of pocket. Keep those hard boundaries in place.", "NTA. Hold them to it!", "NTA. Who will pay your increased (for the rest of your life,) insurance premiums because you filed a claim? That's the part your parents seem to forget? You won't just get your car fixed. You'll pay for the claim through increased premiums fo evah because that's how insurance works. Its great. But when you use it - it goes up.", "NTA, but you need to make sure that the car they replace is signed over to you or your grandparents as well so they don't try to pull the whole \"oh we paid for THIS car\" excuse on you if your sister tries to use it.", "NTA in any way, shape, or form. Your sister is a thief, your parents refused to let you protect your own property, and the end result was that she stole your car and damaged it. Either she or they, or both, need to be responsible and fix what THEY caused.\n\nI'm glad your parents finally saw reason and let you have a lock on your door.\n\nIf your sister ever touches your car without permission again, file the police report. Period.", "You are bad azz. Take a bow. WOOT! WOOT!", "NTA. Your parents framing this as “you’re taking away Disney from the family” is some manipulative horse shit.", "NTA. Maybe the nieces need to know their mom is the reason the vacation is cancelled. Or your parents could make her grow up and make the money to pay them back. Then, vacation is back on...they should exclude her from it though. \n\nHonestly, I would prefer the cops be involved. If she isn't taught a lesson, she will do this again. What if she hits another car next time? What if someone dies because of her next time? What if the kids are in the car next time?", "NTA good job standing up for yourself, I’m sorry your parents won’t", "If the car was registered to your grandmother it's technically up to them to file the report. You have nothing to do with that decision, just FYI. Don't feel bad if grandma just, ya know, decides to do it.;)\nETA obvi NTA", "NTA - Sis fucked around. Sis found out.", "NTA. You’re making the best of a shitty situation. It sounds like you might need to report her anyways, since she clearly has made a habit of stealing valuable items. She probably has a warrant out for her arrest, and she won’t stop hurting people unless she sees the inside of a cell.", "That question about having the lock on the door would probably send your parents reeling. I'm a little mad they cut into your vacation funds to pay for it, it wasn't your fault that she trashed your car.\n\nNTA", "NTA, File the police report, or get the money asap, don't let them delay.", "NTA let’s be clear you are not the reason your nieces can’t go to Disney your sister. She made what sounds sounds another a very long pattern of poor decision because she is too selfish to consider or care how actions effect others. Your parents are enabling her by  shielding her from the consequences of her actions likely from guilt or lack of support from their own families as result of having her so young. Until she has to take accountability your sister is never going to stop and it’s likely going to continue to escalate. My advice file the police report and let the insurance pay. If your parents want to use the money for something other than the trip which honestly I think would for the best tell them to spend it therapy for your nieces and/or family therapy. Also I know it’s hard and I’m sure you have plenty of legitimate reasons but try to cut your nieces a break they have gone something that no child ever should which is watching their parent actively chose someone over them. It’s the kind of stuff really screws people up.", "NTA. She stole your car and trashed it, you were right: a lock would have been cheaper. \n\nIt’s their fault if their daughter is problematic not yours. As a mom if my son broke something that is not his I would have to pay to cover the damages right? Even if your sister is an adult your parents are still responsible for the damages she end up causing to other…", "Nta - Who is the registered owner of the car, you’re still a minor so I’m not sure if it’s you or your parents. But only the registered owner can file with the police. If it’s you, I would file since sister seems to not want to learn and grow even though she has kids.\n\nI would go ahead and put a lock on your door one with a biometric lock and alerts to cell phone.\n\nAs far as the trip, it’s sucks for the nieces and their mom should make it up by getting a job and earnings the money to replace the fund. It’s not on you they aren’t going. It’s on her and your parents for enabling her.", "NTA. If they keep guilting you just say \"welp, the police report it is\" and see how they stop.", "Don't let them pay and throw your sister to jail, pft, those guys, please leave that house asap. NTA", "NTA. So let me see if I’ve got this right. Your parents, (who are allegedly, at this point, adults) are angry with the 17-year-old minor for (checks notes) being upset that another grown adult stole keys to a car and trashed it, and wanting it repairs paid for by the person who trashed it? \n\nDid I get that right? Everyone in this scenario is blaming the teen, and not the near-30 year old who apparently can’t A) keep her filthy paws off other people’s possessions and B) is apparently so non functioning that her parents have to raise her own kids? \n\nYou are pretty damn generous kiddo. I would have filed that police report and let the chips fall where they may. Sounds like your sis could use a little jail time.", "NTA. Mom, Dad, & Sister are TA’s. Mom & Dad knew what Sis was like and still let her move in and didn’t allow the rational request for a lock. The police should have been notified and still should be. You only have her word that it was a tree that she sideswiped. It could have been a hit and run of anything. Your parents are enabling her and are helping her to avoid consequences for violating the law. What if she actually caused damage to a 3rd party’s property, or another person?", "NTA\n\nWait..... they're *replacing* your car? Hmm....sounds like they're buying your sister a used car with tree damage, while you get a new(er) car. I hope the purchase you a suitable substitute instead of a cheapo that isn't as good as your old ride (with or without damage).", "NTA and also a legend for that final comeback.", "I have a lot of respect for you. You keep doing what you're doing\nNTA", "NTA, good on you and I’m glad you have a lock now!!!", "Absolutely NTA. I would’ve still called the police and filed a police report. When you play stupid games…you know the rest. Your parents should’ve allowed the lock. Good for them and your niece. Sorry, not sorry.", ">I just asked them if a lock for my door would have been cheaper. \n\nThis line right here was beyond epic!! \n\n10000% NTA. She enacted the ancient right of fuck around and find out", "NTA! I’m outraged that they are mad at you for your sister making it so YOU are missing YOUR graduation trip! I also just saw your update. Yay for the deadbolt!! I’m sad you need it but glad you have it.", "NTA. You could have saved your family some trouble if you didn't mention that your sister took the car without permission. So that the insurance would cover without her catching heat. But you did what was moral and right if you don't like that kind of thing. \n\nYour family should have let you have your privacy from the beginning, so all in all it had a good resolution would say!", "You say it's your car, but did you pay for it or was it given to you by your parents?\n\nEither way I think NTA simply because you had warned this or something like it would happen without the lock on your door.", "Oh but how will the enable if they do this? At this point, it sounds like it's their second job.", "Agreed. I think it would've taught her and the family a life lesson, too.", "\"Look at this way. If she'd been stupid enough to steal someone else's car, you would have been spending that money on bail instead of a vacation anyways. At least this way she still gets to escape the justice system...\"\n\nNTA!!!", "This particular OP is soooo bad ass 😂", "NTA and OH MY GAWD! I LOVE THIS!\n\nI usually go along the lines of: not my monkeys, not my circus.\n\nBut that was brilliant. Bravo", "Yup.", " NTA\n\nHeart-stopping, right? Almost too perfect.", "Truly a legendary comment from a 17 yr old…not sure I had that amount of poise until well into my 30s! Impressive young woman!!!", "Came here to say this!  She's 29 and living with her parents (while they raise her kids).  Seems like a no-brainer that she should be working and all money going to repay for car repairs until it's paid back.", "*their mother*", "Yup. If they ever say anything. ‘Not my fault - your mom stole and crashed the car’", "I did not think she was going to steal my car to be honest.", "She is pretty banged up right now.", "I've been to Orlando a few times already.  I am probably just going to get a job ASAP so I have spending money for school.", "No. She is hurt from the accident.", "My security camera isn't going anywhere.", "In the gun safe.  My sister can't get into that.  And I showed my sister the video of her stealing my car keys.  She knows I'm not kidding about making a police report.", "It's in my dad's gun safe.", "We already replaced my car.   New car is also registered to my grandmother.  My old car got sold to a mechanic my dad knows for a good price. My parents still won't have enough for a vacation for all four of us. So they put the leftover money into my education trust as a graduation gift.  I am stoked since I will use it for books instead of going to Orlando again.", "She is pretty banged up from hitting the tree.  She isn't happy.", "I don't know all that stuff.", "In the US it can be considered as OP having the wreck & have it counted against OP's insurance AND driving record for a period of years. I believe the time frame is 5 years. (This may vary state to state.)", "Nope. Neep a key to get in not out.", "The damage is enough that replacing it is cheaper and faster.  It's not a brand new car or anything.", "Not gonna lie. You had me going.  I am going away for college next fall.  I will be living with my uncle's family.", "I want to be a lawyer.  I'm not sure insurance fraud is something I want on my record.", "She’s not required to commit a crime (and deal with years of higher insurance rates) so the person who stole her car gets a break.", "You didn’t need to because you were the driver. If OP doesn’t want to have her sisters accident on her insurance record for the next decade, they need a police report.", "Because OP's sister isn't an authorized driver on the insurance, but she was the one who caused the accident. So OP needs to prove, via a police report, that her sister didn't have permission to drive the car when it was damaged, or the insurance might not cover it.", "My grandparents.  It's in the post.", "Honestly, I don't think your sister will learn her lesson until she faces direct consequences like prison. There is no direct financial impact on parents unless they find Don't feel bad, you're not wrong. You're not wrong if you confirm that her sister went to jail, but you should move out ASAP. Staying in a toxic household has a huge impact on your mental health.", "DO NOT let your mom keep the other key. Your sister will get to it and ruin your things again.", "Go to the cops. Your parents will just continue to enable her.", "You rock. This plus the comment about the lock being cheaper give me hope you might rule the world someday. Please be benevolent :)\n\nOh, and if they want to be mad at somebody the correct person is your thief of a sister. You didn't steal and wreck a car, she did. That's what got the trip cancelled. Not you.\n\nEnjoy the lock!", "Agree with others parents might now think a lock would have been cheaper. \n\nHowever if you got one and your parents likely would have the second how long before your sister would steal that key?  \n\nHopefully you will be leaving soon for college. Any chance you could live with your grandparents?  They sound like are more even keeled.", "Check whether or not your state is a “two-party” state. Recording without the consent of the recorded in a private conversation/area is often inadmissable in court.", "Then you definitely need to look at moving out, cuz given that the current compromise is them still having access to your space, you need to get a space they don't have access to.", "Rightfully so. I would have caught a case when I saw my car.", "[removed]", "Exactly- if OP had reported the car as stolen, which she had every right to do, Sister was likely not going to be allowed to leave the state anyway.", "OMGDS I cannot even post what my reaction would have been.", "Because obviously nothing is her sister’s fault. She’s an innocent angel /s", ">Op learned what NOT to do by watching her older sister\n\nI did the same with mine, they sound similar et we have a 15 years gap. I'm 35 now. Sad to admit it but yeah, she was the best anti-role model I could have wished for,  led me to a great life.", "I agree with the others - Good for you OP. Stay strong. You aren't the one who ruined the vacation. Your sis and your parents who enabled her are responsible for that. NTA", "For real.  OP, if you're this badass at 17, you will do well in life.", "Kids these days, its like they know what to say in the moment\n\nBack in my day we did our witty retorts days later to ourselves in the shower", "Why would you quote an entire comment? If you don’t quote or reference anything in it, your entire comment is interpreted as being in response to their entire comment.", "Great suggestion..", "She’s gonna rule the world. I look forward to it.\n\nOp, NTA obviously. Please make the world a better place during your upcoming reign.", "Yep. \n\nEvery. Single. Time. \n\nEvery time they even remotely try and guilt trip OP, use that line. And if they try to joke or laugh off the passive aggressive tone, be straight up. “I will not accept blame or guilt for this. I foresaw Sister’s actions, proposed a reasonable and affordable solution to prevent it, and you refused. You placed trust in Sister that I do not share. She broke that trust. She broke the law. If she hadn’t, filing a police report wouldn’t have any impact, and we wouldn’t even be discussing this. I have every right to pursue compensation for my damaged property. I am not willing to falsify a police report, which is a crime. I AM willing to accept immediate compensation from you, to protect the well-being of Sister and nieces, in the process losing out *myself* on a nice vacation that I was looking forward to. If this does not seem like an appealing or acceptable option, then tell me now, and I will head down to the station and make a report. Otherwise, I do not want to hear about this vacation again.“\n\n\nAnd frankly I would be nervous about its reporting it immediately unless I had the money in hand immediately and a written record of the exchange.\n\nAnd for the love of Christ, take your keys with you wherever you go from now on.", "I think it's time to start moving other things to your grandparents. Literally anything you do not want your sister to steal in spite after her own actions having consequences. People like that don't get that it isn't their victims' fault.", "It REALLY sucks that you have to take all these precautions in your own home. Your sister needs to go, but I am sure your parents won't send her packing.", "Or not keep it somewhere secure.  If sister would go into OPs room and take her key do you think sister wouldn't also go into her parents room to get the key to OPs room?", "My first thought.", "Save up a little extra cash, and get one of the biometric/fingerprint safes.", "I am sorry to hear that.  Hopefully she has shown some remorse", "Don’t let your sister and nieces make you the bad guy for the Orlando trip getting cancelled. This is entirely on their mom/ your sister, and they would do well to learn from this. You should tell your parents not to perpetuate making you the bad guy in their minds, and instead to help your nieces understand what not to do.", "Word!!", "Well im glad it seems like everything worked out considering the shitty circumstances. \nGood luck with college!!", "Oh well poor baby.", "NTA.  Hope that everything calms down for the holidays.", "There likely wouldn’t be an increase for damage incurred when the vehicle was stolen and you were extremely smart to not give in to your parents’ demand that you lie.", ">I am going away for college next fall.\n\nGood. But if you either go to the cops or demand the money from your parents, what are you going to do if your parents will punish you and will become abusive to you, out of resentment? You need an escape plan. Would it be possible to move in with your uncle's family now if things get out of hand at home? Or with your grandparents?", "This is true. As far as I'm aware, if you make the claim without the police report, it will be an at fault claim which will sky-rocket the premiums. Theft makes is a no-fault claim, which should have no affect on the premiums.", "Insurance adjuster here. Your grandfather is correct in this case. You would have to file charges against your sister for grand theft auto. If not, your insurance carrier would consider it “implied use” since she’s in the same household as you and had access to the keys. (Her moving back into the household is what makes this tricky.) \n\nIn general, you should file a police report whenever you’re in an accident with another vehicle. All sorts of issues can arise without one. In this particular case, you’d have to file charges against your sister for theft *and* a police report for the accident itself, even though there was no other vehicle involved. Depending on what she hit, she may owe for property damage as well. \n\nNTA.", "Even if paying for the repairs a different way we’re easily arranged, I wonder if there might be consequences in the future if Sister steals the car again, and it’s revealed a police report wasn’t made the first time.", "keep a spare key in a locked box and keep that key on you at all times", "Yes! Or she will be 40 and still pulling this nonsense.", "If you think prisoners get actual help while in prison - you have a Hollywood view of prisons. \n\nI do believe OP should press charges - but let’s not pretend prison *helps* people.", "THIS.  But curious as to if your parents even know about the security cam? Totally don't blame you for getting one, but just checking because if they weren't going to allow you a lock, not sure how they'd have allowed a security camera.", "Yes they will. But OP is seventeen, perhaps she doesn't want to burn the bridge of a relatively free place to stay just yet.", "That was a real mic drop wasn’t it?", "She's still a minor though.", "Surprised op seems to have turned out even keeled considering the parents give in to the sister and keep enabling her like this.", "[removed]", "If you now have a key, maybe you can get the key changed. Is there any time when you’re home and they are not? I would actually see if a locksmith could we key to lock the only you have the key", "Sister is unquestionably the shining star. You don't think the parents here wouldn't gladly give her the key?", "I still do that 😭", "But in the other hand the fact that a 17yo needs to have the guard up like this in her own home is sad; she shouldn't be worrying about locks and cams to catch people stealing her shit, she should be enjoying her senior year with her friends.", "Some people actually find prison a DETERRENT to going back.", "I bet they didn't know about it", "You're gonna go ~~fast~~ far in life, hon. I'm proud of you", "Just because someone is an adult doesn't mean they have great judgement.\n\nYour parents had to learn an expensive lesson about their oldest child. Now they should have known better. \n\nSometimes it happens parents put blinders on about the Golden Child, until a felony is on the table.\n\nNTA and good on your grandparents for walking you through all the outcomes.", "Don't let the lock let you get lazy and keep the camera going. \n\nYour sister found your car key in a teenager's room (you must be cleaner than the rest), I'm sure she'll find the spare key wherever your mum keeps it, if she's so inclined.", "Also check if the cam will auto uploaded to Google Cloud, DropBox or some other cloud service.", "Also use a good password manager and secure unique passwords on all of your accounts.  Do not share your main password manager’s password.", "I'm a high school teacher, you are doing great OP! I know adults who could take lessons in proper boundaries and logical thinking from you.\n\nGo stay with your grandparents if you need to, you're doing everything right.", "There's always one kid who just \"gets it\" in these kinds of families. That kid is either the invisible child, the scapegoat, or both depending on their parent's mood.", "I thought the same. Like how long until sis steals the key from parents for revenge or more theft or whatever.", "Once the hole for a deadbolt is there, changing a deadbolt is easy! It's only 2 screws and most are the same size. A typical deadbolt is ~$10-15 at any hardware store.\n\nNow, installed on an interior door and frame, it would be easy to break down the door, even with a deadbolt installed. The door will probably give before the frame, but I could probably kick it in, and I'm not all that strong.\n\nI'd start with leaving a trap to see if the \"emergency\" key is used. Like put a cup of glitter behind the door, far enough that you can slip out, but not so far that someone just opening it won't knock it over. Glitter on your floor when you come home? Deadbolt gets changed. There's no way they'll get all the glitter up, so you'd know...", "Couldn't agree more! I hope she gets out of this dynamic asap so she can heal and carry on being a badass far from the chaos!", "Then if the car's owner wants to file a police report...😁", "Depends on the prison. If it's one of those swanky Scandinavian ones, then definitely. \n\n&#x200B;\n\nIf it's one of those American hell holes, then definitely not.", "Sure - let’s ignore the mounds and mounds and mounds of evidence that points to the exact opposite conclusion.", "Most impressive, I’m almost scared and I’m 67.", "And her parents will take credit for giving her these life lessons that made her so awesome.", "After all this I would get one of those combination lock key holder things that people use to lend keys to dog walkers/babysitters. It’s a ridiculous measure but this situation is nuts.", "I mean it can go back and forth. With my mother I could be the golden child or the scapegoat. My sister was too. It was a mess. Unfortunately, my sister got it for a while, and then got sucked back in, probably because our father died.", "And then is guilted via manipulation into supporting them throughout life unless they go NC. I do feel bad for the nieces as they are dealing with a lot, a mom who doesn’t really want them or capable of it, grandparents enabling so they won’t be able to transition into adulthood either.", "Well, they did - in a manner of speaking 😎", ">I mean it can go back and forth.\n\n>or both depending on their parent's mood.\n\nI rather think I mentioned that already. I'm an only child, so I got to be the golden child when my parents wanted to make the other angry and jealous, the scapegoat when things weren't great, or invisible when they just weren't in the mood to give a fuck about me.", "Hey, real quick, I just want to let you know that you're doing incredibly well. You have a better head on your shoulders than people 10 years your senior (not just your sister, other, less disastrous people). You're going to do great in college and as an adult, and I'm sorry your parents and sister aren't helping you excel. \n\nNTA, obviously.", "Uhhhhhh OP, what stops your sister from swiping the key from your mom and going into your room again?\n\nNTA, btw", "**NTA**  I don't understand why you would even ask them about filing a police report.  Your sister took your car without permission and had an accident.   She should be held accountable for it full stop. \n\nIf everyone is going to be mad at you anyway, they might as well keep the money and let her face the consequences.", "NTA, people not going on vacation is not your fault it’s your sister’s fault and your parents aren’t blameless either. Always bailing her out of trouble just enables the behavior.\n\nI feel for your nieces though because I had an uncle much like your sister and with him nothing was ever his fault. He once hit a parked cop car and blamed the cop for parking too far from the curb. He lost his life to drugs and it’s really messed up my cousins for long time.", "NTA. Your sister took the opportunity away by stealing your car", "NTA, \n\nAnd when you turn 18 and graduate high school, get the fuck out of there as soon as you are able to support yourself.", "NTA - But your parents and sister are for guilt-tripping you over a lost trip while your problematic sister takes no accountability or repercussions for her actions.", "Nta. The parents have to deal with the consequences of their daughter actions or the daughter does, either way the consequences exist.", "NTA. You are smart, responsible and it is most impressive how you stood your ground when asked to lie. It shows you have integrity and your quick quip about the lock is epic. Your parents are making a huge mistake continuing to enable their older daughter. They are not doing her or the grandkids any favors and they will continue to support your sister and probably the grands, too in the years to come. Possibly the rest of their lives. It has been said here many times already that you should protect your valuables and important paperwork. I’m glad you have support from other family members. You have a bright future!", "NTA - You're correct: A lock would have been cheaper, but why on earth did you not take your car keys with you when you left?  I can understand not being able to take everything you own, but your car keys??", "NTA I’m happy they gave in and gave you a lock but your sister should be the one paying for the replacement trip she has a year to save.", "Your comeback at the end was simply amazing! \n\nNTA", "> I just asked them if a lock for my door would have been cheaper\n\nI fucking love you. NTA.", "NTA, smart moves all around. The right thing isn’t always the most popular thing and your sister needs to learn some responsibility.", "NTA and when they say you cost them the vacation you respond with \"no...sister cost them the vacation and mom n dad allowed it to happen\"", ">I just asked them if a lock for my door would have been cheaper.\n\n>[...]\n\n>Hey. I just got home from school. There is a deadbolt on my bedroom door. \n\nWonderful end to this story of you not being the AH. It's not you that made them choose, your sister stole from you and you needed your car fixed. Simple as that. \n\nNTA, enjoy the lock.", "NTA. Your parents are choosing to use the vacation money. If they want to continue to enable their daughter that’s on them.", "NTA. Don't let them off the hook for putting a lock on your door now, your car still needs replaced, and frankly, your sister ought to face the consequences. Your parents have done wrong by both of you and think that you ought to commit insurance fraud? Nooooope. The lock now is nice and all but doesn't make up for the damages that've already happened. If your parents don't want to pay their vacation money, file the police report and insurance claim and let your sister take the results of her own actions. Don't let your parents blame you for the choices they and your sister made which led to this.\n\n&#x200B;\n\nWould it be possible for you to live with your grandparents? Seems like it would be best for you to get out of there asap.", "NTA and the blame for the missed vacation is properly placed on your sister, who committed a crime and should have been charged.", "NTA, they fucked around and found out. \n\nGood on you for putting your foot down and standing for yourself because 17yo me could never 👏🏾", "Nta id also concider living with your grandparents as your parents seem like they are the ah by enabling your sister", "NTA. I would seriously consider moving to my grandparents if possible.", "Can you get a Disney stick for the car?", "op=nta\n\nAmazing, they finally saw the light!! I guess the loss of their vacation fund helped clear the clouds.\n\nSo many teenage posters here on reddit don't have a good support system. I'm glad that your grandparents were there to back you up.\n\nPS: I am an admirer of your shiny spine.", "Such a heart warming post, especially with the edit. You are a total Rockstar and obviously NTA. If you keep getting crap about  it being \"your fault\" remind them that they made the choice to use the vacation money because THEY didn't want to have THEIR CHILD held responsible for HER actions, actions that wouldn't have happened if they had been parents to her at any point in the last 29 years. \n\nIF at any time you think the spare key is being used to get into your room without your knowledge,consent and for non emergencies just go get yourself a new lock and change it (YouTube video if you dk how or can't figure it out by looking) and do so without letting anyone in the house know. Keep all keys. If you get asked about it, ask what the emergency was that resulted in needing access to your room. When it's clear there is no such emergency, then question why they were needing access. When they go off about not having a key \"in case\" of an emergency let them know you hid the key somewhere in the house and will let them know where it is if and when the need arises. You get the added benefit of everyone looking for a key that is actually in your possession (petty but hilarious)", "As some have suggested here in reply’s: please have an escape plan. Even if there’s only a small chance for retaliatory behaviour on the part of your parents, have something in place and make sure anything of any importance is not accessible to them or your sister.", "Honestly, a round of fucking applause to you. 👏🏻 \n\n> I just asked them if a lock for my door would have been cheaper. \n\nI bow to you. That’s how it’s done. They have no one to blame but their mother and daughter for not going to Disney- it’s as simple as that. \n\nNTA!", "NTA. And honestly, OP? I hope that, when you can, you leave and never look back. I am so sorry that you've had to deal with this, and had to deal with your parents pandering to your sister and enabling her behavior. Someday, this kind of thing is going to get her into trouble that your parents can't come and rescue her from.", "I’m so sorry you’ve had to go through this you’ve done nothing wrong. You have every right to file a police report. Wishing you the best", "NTA .. not at all", "You keep standing up for yourself & get out as soon as you can. Your parents are so wrong & your sister will always be a leech & they are setting a really bad example to those babies 💜", "Maybe if sis finally faced some consequences, she’d get herself together. Mom and dad need to stop fixing her messes. NTA but she AND they are.", "You are NTA, and don't let them guilt you for this.  Glad you have the lock now!", "NTA, and LOL. \n\nThey're *still* failing as parents. Your parents keep playing the fuck around and find out game, and still losing. \n\nI had a similar situation that didn't change until I became taller, and could bench twice my body weight and made it VERY clear that one way or the other I would be made whole on my losses. The problematic sibling stopped coming around so much.", "NTA.\n\nMy gosh. The fact that they're blaming YOU for not being able to go on vacation instead of your sister is part of the problem. \n\nYour parents have learned nothing from their bad parenting.  If nothing tells them they failed, their daughter kicking her own young children out of her home so she could live with her boyfriend who didn't want them... shameful.\n\nHow did you turn out so well? Are you able to move in with our grandparents? (Maybe take the little girls with you too?)", "NTA. i’d still consider pressing charges.", "NTA.", "NTA.\n\nYour parents need therapy.  It is wrong of them to pin this on you with the Disneyland money.", "That was an expensive lesson for them to learn. Your nieces can go to Disney some other time and stand in line for hours. Their mom needs to be a much better role model but maybe this will be a teachable moment. NTA", "NTA, but your comment about the lock being cheaper was epic. 👏👏👏👏", "They feel too guilty, and even if they had declined to pay for everything, you better believe they would have been unable to resist from hiring her a lawyer that might have ultimately cost them more.", "Good for you for not agreeing to commit Insurance fraud. One criminal in the family is enough!", "Agreed!", "Ha, well she’s got a lock now. My Dad would have called this closing the barn door after the horse is out.", "OP’s remark about how they & the kids “have an understanding” is seriously impressive. OP has more street smarts than I do at 40+.", "Thanks. I hope so.", "My grandmother.", "Key is in my dad's gun safe.", "My car is registered and insured to my grandparents", "Spare set.", "After reading your edit, you need to define emergencies with your mother. Otherwise when you are gone I doubt that door will stay locked because everything will be an emergency for the Golden Child and the grandkids.", "EVERY TIME parents, sister, AND nieces get snarky, make side comments…etc…\n\nto sister: If YOU didn’t steal my car, we would all be going to Disney\n\nto parents: if YOU got me the lock like I asked, we would be going to Disney.  (Lot more to unpack here, but this is the immediate situation) \n\nto the nieces: I am sorry you are not getting the vacation you WANT, but my NEED of the car is important.\n\nI am not going to blame the kids who are not happy, since they are kids. BUT, its a good lesson to learn that NEEDS trumps WANTS any day of the week.", "Rarely does life offer the opportunity to verbally decimate others with the precision of an assassin. \n\nOP saw that opening and went for the fucking jugular. \n\nOP hs definitely earned the title of Legendary Badass.", "No, sister didn't steal the trip. The parents stole the trip by deciding to cover sister's butt and use that vacation money to do so.", "Can you live with them until you go to college?", "No, not when the car was stolen, as long as it was reported to the police.", "Which is why it’s important to consider the premium increase. Plus OP is 17, she is definitely not the policy holder, who is? Who is doing all the talking to the insurance company and who is paying for the insurance?", "It’s up to her then to file. How does she feel about what they have been doing?", "So why wouldn't you file a police report?   Unless she has other theft convictions, she'll probably just get a slap on the wrist -- aka probation.", "Lol your phrasing makes it sound like you're a thief giving OP advice about what their thief sister is likely to do", "Then she’ll have it on security cam and can call the police to report theft or whatever else. She can finally go to jail, which she should probably get used to now because if she doesn’t grow up now, she’ll be spending a lot of her future there.", "It is a security camera in my room. Totally legal where I live.", "Clearly the sister and the grandkids are the Golden Children that can never do wrong and OP's parents will move heaven and earth to make sure they never have to deal with the consequences for their actions.", "I hate that it was a vacation for you that was ruined. They literally had to take something else away from YOU to pay for the damage she caused to YOUR car. Do they not see how out of control this is?", "Oh yeah, well the jerk store called, they're running out of you!", "We only kept our smart remarks to ourselves because we knew we'd get grounded or smacked if we actually said them out loud to our parents.  Anybody else remember the sound of a belt clearing belt loops?", "Still. 😆", "That’s a good point.", "I am almost done high school. They live too far away from my school.", "If they try to punish her for demanding the money, she still has the video of her sister stealing the key...", "> will become abusive to you\n\nthey already are", "Those aren't really related in her parents mind. A camera doesn't allow her to be alone with a boy or get away with smoking weed or something.", "Indeed, didn't notice. Don't worry, I'm no thief, though I played one in D&D.", "NTA.", "I'm hoping OP has option of Grandparents home at 18 or at least college dorm.", "Make sure you back up the recording to at least 2 different places - maybe make a new email & Dropbox account and save it there so that the evidence can't be tampered with. \n\nYou're NTA, but I'd take few extra steps to cover yourself here, since your sister doesn't seem to see anything wrong with stealing & totaling your car.", "That’s great. It’s illegal in California which is a place with 40 million people. Just looking out.", "Until sister steals from them or does something so spectacularly stupid/illegal then they’ll be like “this is not the child I raised!!! Oh where did we go wrong?”", "Seriously, prison is not helpful to most people. They may reform or want to do better,  but then they get out of prison, and people won't hire them, won't allow them to rent, and they end up back in jail if they don't have a good support system.", "Hey OP, make sure you steal the second key back from your mom. She must have \"misplaced it\".", "I think they've learned their lesson,  don't give sister anything of ops unless they can afford to replace it or the sister wishes to spend time in jail and possibly further reprocusons.", "I love OP’s boss attitude though. Does not even let that part bother her since she’s seen Disney World before. And if it’s a graduation gift for OP, why are the parents so concerned with how it’s an experience stolen from the nieces? You’re right that it’s soo out of control that it’s laughable.", "God yes! Still makes my butt cheeks tighten up!!😂🤣😳", "most of the times i can remember being spanked it was because i hit a nerve that absolutely needed to be hit, except i didn’t even have the awareness that it was snarky or out of line. now i think back on those times and i am proud of young me for learning how to dish it back out", "Bummer.  Well you are a rockstar, just keep being awesome until you can move out.", "Why didn’t they file a police report? Your car was totaled, your parents are out thousands of dollars and your sister walks away free and clear?", "The grandparents even know about that child, and the \"uneven\" treatment afforded the eldest child. They taught their child a lesson while teaching their grandchild how to deal with these situations. I bet the parents thought the grandparents would just pay, and it would be done. \n\nLet the be mad, let them seethe. Do what is best for you and don't let your sister take anything from you for herself, or her children.", "The California residential security camera laws state, “There are no laws or restrictions, for a private person to have video surveillance cameras around their property for the purposes of security. However, there are laws, and constitutional rights, regarding privacy.” This means that, although a person is free to use a camera in a residential neighborhood, they cannot violate another person’s right to privacy. As long as the camera placement doesn’t interfere with someone’s right to privacy, the placement is legal.", "A person putting a security camera in their own private space is illegal there? Could you cite a source?", "And a lot of people don't really mind it since there is no responsibility and they're fed, clothed, housed and given medical care for free. Speaking from personal experience that there are plenty of people who just see it as a vacation until they go right back to whatever they were doing before. Usually drugs and the felonies that pay for drugs. \n\nShe'll spend like two or three years in prison, her parents will undoubtedly send her money to buy luxuries which will make her pretty popular if she shares them around. She'll join a car (or a clique) and she'll have a group of people to hangout with. Then she'll get out and now have an accuse for not having a job, because op will have ruined her life and she'll have a record. Nothing will change.", "Better yet. OP needs to buy a duplicate deadbolt. Switch it with the current lock. It's very easy to do, just need a screwdriver and about 15 minutes to switch them.  Then pack up the old one and return it to the store. OP now has a new lock *and both keys. * Mom still has her key but can't get in.", "Or replace it with a different key that looks very similar but doesn't actually work on the lock. That way when mom or whoever takes the key goes to use it in not an emergency, they need to out themselves that they had tried to use it and explain why. \n\nAnd play ignorant about the key not working - \"that's weird, are you sure you got two of the same key when you bought the lock?\"", "&#x200B;\n\nidk man. When I was in college, I passed out in my dorm room after close to 3 hr football practice in nearly 100 degree heat. apparently was due to severe dehydration. Could have died had my roommate not come back when he did. Emergency key may not be a bad idea, just hope big sis doesn't find it.", "This is brutal, but probably true. I can see it possibly being helpful for OP to at least not have to deal with her sister for a few years. Maybe she can make her escape from them all while her sister is locked up.\nSo hard though. Oof", "She could always get it rekeyed", "Or have the spare key shaved down a little.", "If I read it wrong, I apologize, it's Monday, and it's been a long day. But I feel you. It's an absolutely shit situation to be in.", "OP, Kwikset brand locks are INSANELY easy to re-key. You can do it yourself easily with a kit from a hardware store. No tools are even needed.", "S'all good, maybe I just wasn't clear enough. I hope you get some good sleep tonight~\n\nedit: some words", "NTA - Also, about that deadlock. Your parents have the key to it. Would that key perchance be kept inside the house? Maybe in a location that isn't locked and thus susceptible to being stolen?", "Nta well you could always press charges that way you and your niece can go on vacation since there giving such a hard time about it.", "Your parents and your sister sound awful. They didn't only fail her -- they made her just like them. NTA", "NTA and your parents are morons to bail her out (again).", "NTA. Can you go live with your grandparents though?", "NTA. Your parents are doing your sister no favors by always bailing her out.", "“Wouldn’t a lock on my door have been cheaper?”\n\nWish I’d been there to see that!\n\nNTA", "NTA at alll. You didn’t ruin anything. You set clear boundaries and your sister ruined your car and her kids’ vacation. Your parents are selfishly enabling her shitty behaviour. Also you’re such a savage — the line about the deadbolt being cheaper is incredible.", "NTA! For every action they're is a reaction. Tell your sister get of the meth and care for you're childern.", "good job", "change that deadbolt. theyre just gonna toss it somewhere she can find it anyways. \n\nput everything in a backpack and keep it on ur at all times. even if u go pee. i swear to god. and google door security bar. theyre like $25. they jam under the doorknob to the floor. just an extra bit of protection. \n\nand tell everyone they can blame the loser, and block them all on everything if they are taking sides. NTA. \n\nbut seriously, ur parents want to go down with the titanic, thats their problem, but find a roomate or room\n to rent and get out.", "NTA but this is bullshit:\n\n>But they are using money that they had sett aside to take me and my nieces to Orlando next summer for my graduation. \n\nThey're using your graduation trip money to pay for damages your sister - ***their daughter*** - caused.\n\nI guess this is as good of a resolution you can realistically get, until you can make your escape though.", "Definitely NTA OP!  But I hope you're prepared for \"Okay, we put a lock on your door, will you play along with the cops/insurance now?\"", "NTA your parents made a choice not you.  Your parents are enabling your sister to continue bad behavior... That is their choice.", "Well, a lock would have been cheaper. Seems you're the one with common sense in the home. Are your parents upset with your sister at all??? SHE needs to be blamed for the family not going on vacation.", "NTA. But yta for not filing the police report.  By you not making her pay she is just going to keep doing this. I know because my little sister is the same way", "Make sure your sister  doesn't  get that key from your mom. She'll make a copy. You are definitely NTA. Sounds like your mom realized  the injustice done to you and is trying to make amends. I would still work on getting out ASAP.", "NTA, especially if it's a car you're paying (or did pay) for. I can understand your parents position a bit more if they paid for the car and gave your sister permission to take it, but she should still be responsible for the damage done.", "Are you kidding? First, your sister has shitty kids, second, your parents don't let you have a lock which is perfectly reasonable, considering the fact that your sister is likely to snoop around your room and third, she destroys your own car! \n\nNTA", "I’m wondering if the sister is on drugs. Everything about her behavior screams ‘addiction’.", "Upvoting the LEGEND by several thousand times!!!\n\nAnd love that OP finally got that deadbolt. Now are we taking bets on how long it is before sister steals the emergency key to OP’s bedroom from the mom, so she can get into OP’s room and steal more things? Because unless OP’s mom or dad keeps that key on them 24/7, you just *know* it’s going to happen.\n\nAnd OP? Definitely NTA.", "In both the original post and subsequent comments, there are indications that OP has a disposition that's shared by many effective lawyers. Not the least of which is that last line.", "That's the plan.", "Seriously I'm honestly impressed", "The key is in my dad's gun safe.", "Too late.  My grandparents already drove out here and made them replace my car.", "The car is registered and insured with my grandparents.  It's why I asked them what to do.", "What did my niece's do wrong?", "I wish I was this on point now in my 30s", "Just go ahead and file the report. You don’t actually need parental permission. Then your nieces will have their trip and you can get your car replaced and your sister can learn consequences.", "😂", "Lol. Every comment from you is the bomb.. i wish i have a friend or a sister like you. You're fun", "That is a lot more secure than I expected! I'm glad we aren't going to have a repeat, except with the extra step of also having your parents room tossed over or some such added in to find the key.", "Honestly they seem like decent kids. They stay out of your personal space. Naturally they’re upset about missing out on Disney and it’s sucks they’re upset with you about it. But they’re still young so can’t fault them for that.", "Seriously!  Putting that on a 17 year old who wanted to mitigate these issues with a simple lock in the first place?  The parents don't seem to have improved much.  Sis stole the car and damaged it and that's somehow OP's fault?  Nope!", "I think of George Costanza in Seinfeld with “the Jerkstore called…”\nIf you watched that show", "Especially as it's obvious that the adults are telling them its OP's fault. That's not a conclusion they'd come to on their own.", "Let's hope they don't", "Ikr!   I mean, look at the \"graduation gift\" for OP- if it was really for OP, then why is it a big deal that the nieces and sister won't get that opportunity? Parents really showed who that trip is intended to for and it's not OP", "after having to pay for a car bc of this I don't think they are willing to give her the keys", "If there even really was a vacation, and not another way to guilt trip OP.", "No, but I remember what a hand across the face feels like.", "Lol, memories.", "It’s one of the reasons why I prefer using fabric belts instead of leather. I wish they had more styles of fabric belts for men.", "What's the difference? You're their all-time best seller.", "Ah I get you - makes total sense.", "If the sister cares that much about her kids going to Disney, she can always take them.", "That's a great point.\n\nThe trip was her graduation gift, so she's essentially paying for the damage herself.\n\nI love this perspective.", "I have a friend who was a parole officer for 30 years.   She said that a lot of her clients were model prisoners, because they do better in a structured environment.   Unfortunately, they don't learn how to create their own structure, and they go back to the same people who helped them get in trouble in the first place.\n\nShe had a guy who was on parole for a drug charge.   He stayed clean but decided to spend time with his good buddy, a drug dealer.   The drug dealer was stopped with the parolee and drugs in the car.   My friend told him that she believed him that he didn't know that they were there, but told him to have a little sense - don't hang out with a drug dealer, no matter how much fun he is, when you're on parole for a drug charge.", "r/technicallythetruth\nThey kinda did LOL", "Actually be very, very careful having a deadbolt on a bedroom door. It can be deadly in an emergency, especially if the door is solid and not that hollow core garbage. Bedroom locks are keyed knobs for a reason! \n\nIt would be better to replace with an identical deadbolt for when you are away, and to use a flimsier lock like a chain lock or hook and eye when you are home and sleeping. Something that a few hard pushes would break but it'd be loud enough to wake you up if someone tried. I'm only posting this here because it's close to the top and people die fairly frequently from bedroom deadbolts.", "Depending on the brand, some are re-keyable as long as you have one of the original/currently working keys and a little tool.", "This is a really good idea. Deadbolt for when you're out of the house, chain for when you're home.", "Better, better yet. Buy a Weiser brand deadbolt that has the SmartKey tech. You can easily rekey the lock at any time. If they find and duplicate your key, just swap for another…", "Usually deadbolts for bedrooms have a turn know on the back, which doesn’t require a key.", "If you're unconscious from smoke inhalation and a responder has minutes to save you it doesn't matter what's on the back. Emergency responders need to be able to get in, especially if it's a solid, quality door.", "Wouldn't a kit from the hardware store be tools?", "Sorry, I meant *additional* tools like screwdrivers  and such that other people mentioned.", "NTA. What kind of 29 year old steals a car and expects.no punishment. My BIL stole my parents car and went to jail, she should know there are consequences for her actions", "NTA. I'd file a police report so the family vacation isn't ruined and your sister learns her lesson.", "Next time, bipass your parents and go straight to filing the police report.\n\nUntil you sister suffers real consequences for her actions she will continue this behavior.", "NTA. Your parents suck for letting your sister get away with everything and pretty much setting your nieces up for the same life. Your sister should have to get a job to pay for the damages. And if she can’t work for whatever reason, she needs to go to jail. If she doesn’t learn that her actions will have consequences now (which it’s probably already way too late) then she needs to be held accountable for when she messes up so her kids will learn not to repeat the same mistakes.", "NTA. Good for you for standing your ground with your parents. Don't trust your parents to replace your car. They'll find an excuse not to. Call your insurance company and file a police report. Also, your mom will probably give your sister the key to the lock on your room so buy a new lock and change the old one out. It's easy to do and doesn't take long.", "Complete NTA. You had clear boundaries, but you live with enablers. If they don't wish to honour your limits and hold your sister responsible, they need to pay the cost.", "I got a few ‘paragraphs’ in and was like “oh shit, here we go” and took a swig of my margarita!\n\nNTA.  Tell your sister to get a job and pay for the trip.", "NTA \n\nI can't believe the gal your sister has. Stealing your car and wrecking it then saying YOU ruined their vacation. Idk how these types of people can even justify their own stupidity", "It's both sad and hilarious that they are all mad at you-your sister, the thief, included-because of something *she* did.  She could get a job and give your parents the money to replenish the vacation fund.  \n\nOh, wait. What was I thinking? That requires work and a sense of responsibility. \n\nSoooo NTA.", "NTA at all.\n\nYour sister is what your parents made her. She’s a spoiled brat with ZERO sense of accountability. She doesn’t care about anything because she doesn’t have to. She knows that she can screw up as much as she wants and Mommy and Daddy will pick up the pieces.\n\nWhether or not your parents replace the car file the police report anyway. It’s high time your sister learned that actions have consequences", ">But my parents, sister, and nieces are upset with me and saying that I'm an asshole for denying my nieces the opportunity to go on a vacation that they have never had. \n\nNTA- you sister is there reason the vacation money has to be spent fixing your car she stole, that's not on you at all, that blame falls directly on your sister.", " NTA. Your sister is a criminal and your parents have been enabling her.", "NTA, But I’d still report your sister. She does not seem to understand boundaries and responsibilities. She dumps her kids on her parents and is getting away with all this behaviour. Some day she will upset the wrong people and get hurt way worse if her behaviour is not stopped now.", "How on earth is any of this your fault?!!", "Now I'd go buy a new lock that looks the same as the one your parents put on.", "NTA- older sister ruined the vacation by behaving recklessly. parents are paying for her mistakes. she is also the one responsible for her children’s disappointment, not OP", "NTA. My oldest brother took my car three days before I was set to take my driving test (my parents bought the car specifically for me but told me I had to let my brother use it till I got my license) and he took out a telephone pole. My response was to kick his bedroom door in and beat the boots off him. So you reacted better than I did. They fucked around and found out.", "NTA definitely not! I just can’t believe your sister has the gall to be mad at you, as if she didn’t steal the car and crash it in the first place! Honestly I would’ve just filed the report anyway… but that’s because I’m petty af! It’s funny that the trip was for your graduation but everyone else is mad😂", "NTA, can you go live with your grandparents?", "NTA\n\nTell your parents, sister and nieces that it was sister that caused this mess by stealing, littering and crashing my car, that it was parents that enabled sister and tried to cover it up, tell nieces they can thank mommy and grandparents for not being able to go to Disney, tell them this is what happens when entitled people think they can do what they like and that consequences finally caught up with them.\nTell nieces do they want to end up like mommy, because mommy almost had the cops called on her for theft, driving without valid insurance for the car and damaging the stolen car.\nOP time to ask grandparents if you can move in with them because it’s quite clear that mommy and daddy, sister and nieces don’t care for you.\nIf mommy and daddy throw a tantrum tell them it’s their fault you moved out and they have their golden child to keep them company with her entitled, spoilt brats.", "Nta. And it sucks that your parents are basically penalizing you and your nieces by using the vacation money that was for you instead of making your sister repay it. So once again sis gets off scottfree. But at least your car is being fixed and you now have a lock on your door. I wouldn't trust the lock tho because I don't know if your parents are responsible enough to actually keep the key from your sister or if in a few months time we will see a new post \"my sister stole my bedroom key from my mom\"", "Nta. They knew who their daughter was when they said no to the lock. Your sister made the choice to steal your car. Decisions have consequences. It’s time they start learning that. It’s just too bad you have to be the adult in this situation given that you’re the minor and your parents and sister are legally adults.", ">I just asked them if a lock for my door would have been cheaper.\n\n&#x200B;\n\nKid. You're going places.  NTA.", "NTA. You were really smart to hold the line.", "NTA. Unfortunately I’ve seen a situation like this where the guardians are enablers, and they will jump through so many hoops to avoid the real problem. Get out as soon as you can.", "NTA - If they just bought u a lock none of this would have happened \nLike they say \"play stupid games, win stupid prizes\"", "NTA but is it cheaper to replace the car instead of paying out of pocket for the damages? Your sister obviously deserves some kind of consequences though, especially since she can't give you the money to fix the car.", "Oh honey, you have been treated very badly. Being pressured to lie to the insurance company is all kinds of wrong, as you know. The blame lies entirely on your sister and your parents. This requested lock is just too late, but I hope this will prevent future incidents. The lost Disney trip isn't your fault, plus you, too are being denied your graduation gift, as well. I wish you well, dear one.", "You didn’t ruin anyone’s vacation. \n\nYour sister’s inability to tolerate jail did.", "NTA.", "NTA It sucks for you nieces but it's not your fault that their mom and grandparents are shitty people. \n\nYour sister had no right to steal your car period. Why should you pay for her dumb decision? \n\nYour parents should have just gotten you that lock, it would have saved them so much time and money. They forced you to either contact the insurance and press charges or pay for it themselves.\n\nAlso, depending on how old your nieces are, they might not remember any of this.\n\nEdit: Reading this post and the comments makes me so grateful that my sister is an angle.", "NTA, but make sure you take the extra key from your mom. I agree with others that she will absolutely give it to your sister at the flimsiest reason.", "NTA. I would be livid. She’s 29 and a mother yet you sound way more responsible. How frustrating that has to be to see your parents repeatedly enable this crap.", ">But my parents, sister, and nieces are upset with me and saying that I'm an asshole for denying my nieces the opportunity to go on a vacation that they have never had.\n\nI mean the solution is for your sister to go to jail   \nSo its either she goes to jail and let her kids go to disney land or she stays and they dont go  \nAsk her if shes volunteering to go to jail then?  \nNTA", "Good for you, move out when you can.  They are condoning her behavior.  I would of called the police and got the bi*** arrested.", "Well looks like the rest of the family fucked around and found out. NTA.", "NTA. If they're that mad about not going on vacation, then they can let their daughter go to jail. It might teach her a lesson that they were clearly unable to. But since they agreed to pay for it, maybe they should do their jobs a parents and tell your sister to get a job and pay them back. She's not an adult yet, so they can still attempt to parent their teenager.", "NTA. You knew that your sister was trouble and offered several alternatives to avoid something like, say, her taking your car out and wrecking it. Your parents not only enabled her, but then wanted you to lie to the insurance company. Your sister needs to learn that her actions have consequences. She messed around and she found out. \n\nIf anyone is to blame for the Disney World trip being cancelled, it's your sister and your parents. Don't buy their guilt trips for one second; you did the right thing.", "If you still have the evidence of the theft, you can report it once you're 18, if you have another place to stay. I wouldn't do it if you're still staying with your parents. I would look up the statute of limitations for auto theft in your state; just to weigh your options.", "She better keep it where your sister can't find it.", "If she stole a stranger's car and do the same thing, would she go to jail? Of course. I've had family steal things from my room before, they did it out of entitlement. Also, how are you an asshole for your parents paying for the car? They begged you not to file a police report and the car needed to be fixed. It's impossible to get around anywhere without a vehicle nowadays. Again, if she wrecked a stranger's car she would likely have to be bailed out by her parents with that money. NTA.", "NTA. Your parents are enablers and paid the price for your sister's bullshit rather than allowing her to face the consequences. It's her fault that your car got wrecked and it's their fault that she's getting away with nothing but a missed holiday.", "You’re sister denied them the vacation when she stole your car and crashed it, Nta but when you’re 18 get out of that house, maybe go to your grandparents", "Why can't you stay with ypur grandparents? So sorry for you.", "NTA - as a big sister, I'm sorry your big sister sucks so much.", "NTA. There is supporting and there is enabling. Your parents are clearly enablers.", "NTA\n\nYou’re not denying anyone the opportunity to go on vacation. Your sister is. You in fact have every right to still be upset with her for this outcome. You’re missing out too.\n\nReport the theft anyway.", "NTA You didn't deny them the vacation, their mother did.", ">I just asked them if a lock for my door would have been cheaper. \n\nWe'll played M'lady!!!\n\nOh and definitely NTA", "Yup this is perfect. She’s old enough to know better and she’s not sorry at all. Absolutely NTA op, and best of luck to you!", "NTA your parents ruined vacation for the kids by not letting you lock your stuff up and then allowing a thief into the home. What would they do blame you if she had died wrecking your car???", "Right nta!", "Yes,OP tell them . You are honestly a cool role model. No need to let the nieces be turned against you. I am pretty sure they will understand that it was the fault of their mother and not you.", ">You are the asshole. Your sister is family. You don’t snitch on family. \n\nIt's funny because people who say this often forget the next clause, \"don't steal from family, or you'll be dealt with by the family\".", "Seriously! 17 and savage af. NTA, your nieces are unfortunately the collateral damage; but, your parents are the ones that will have to explain that they chose to use the money rather than allow their mother to suffer the consequences of her own actions.", "I was that on point as a teenager, but it only got me a slapped face and grounded for 'having an attitude'.", "But it is still painful and distressing, to live with ppl who blame her because she isn't a liar. Or insurance fraud?", "Oh golly, this was much more than a bad fender bender. If this car is in your grandmother's name, perhaps she could make a document to show that you, and you alone, are the designated driver? Not sure of legal procedures here. Very concerned for you.", "You were even on point to have a camera(s) in your room?  OMG, not only are you NTA, but you're my hero too.", "If your grandmother has the title, would not she have the right to file a police report? Not sure how this works, but she has given you the right to use her property, not your sister or others. Not sure if this would help you, since you must live with parents for remainder of HS, I think?", "I love your grandparents. NTA. This is a great lesson for your parents and sister. 💙💙💙\n\nEdit typo", "Then ultimately it's grandma's decision to file a police report or not.\n\nIf she does and the insurance covers the repairs, the insurance company may choose to sue your sister to cover their costs. It's called subrogation.\n\nAnd this, kids, is why it's a very bad idea to \"borrow\" someone's car without permission!", "Honestly I wouldn't doubt if the sister would steal shit to sell for drugs. She certainly sounds like the type to do that", "Some of us are turtles, others are hares", "Oh yeah.", "I like my nieces but I had to have a talk with them before we got along.", "People have had their lives ruined from jail, so thanks for bringing that up. I got pulled over because my brother (much like her sister) got a ticket in my car and never said shit and tossed the notifications out since I wasn’t living there. He would steal shit too and I did get a lock but he’d find a way and I was blamed because “you know how he is, if he stole something it’s your fault “. Never had a job either and constantly arrested and bailed out. \n\nBut from that ticket I was stopped and told my license was suspended and someone left a tiny roach in my ashtray so I got a possession (later dropped because there wasn’t even enough to test) but they kept the paraphernalia for the “rolling paper “.  It was a Thursday and I wasn’t able to post the $500 bail so I sat til the next week for my bf to come up with the money. Well I lost my job, my rent had been due and since I was 2 days late my landlord cleaned it out and put it in storage and raised it by $400 (illegal, yes but I was now homeless, jobless, and carless) AND now my cars impounded collecting fees every day. \n\nThen I try and pick up the pieces and do my year probation and pay the $2000 in fines and “court costs” and go to get my license back and turns out the cop who confiscated my license never turned it in to PennDOT so while I was suspended that entire time I received no credit for the time served. That’s when I said fuck it and started using street drugs because I had everything taken from me it was easier to say screw it. Following rules while everyone else plays dirty. I think people don’t realize a lot of people have their lives ruined over dumb shit. Jail is just another scam for them to make money off people who have no money to fight them.", "Honestly, OP is lucky that the asshole gene skipped her", "Looks like people would blame OP’s sister that wrecked the car in the first place.", "My mother's thing was that she wouldn't be denied access to a part of her house. I moved back in after college, she still doesn't understand why I left 3 months later and refused to move back in ever.", "*far FTFY", "Exactly. It's not even up to OP. It's up to grandma.\n\nGuess OP's parents/sister better direct their crying at grandma.", "I hate that dumb af reason and I see it all the time. They’ll always have a lock on their door though. God forbid their privacy is easily invaded", "Ohh a lockbox for the spare key! I love it", "To be completely fair, that’s not an emergency anyone could have known about. Your roommate is the important factor here, not the lock or key or the heat or dehydration or football practice. The roommate had reason to enter because they lived there. Nobody else does.", "Or, only lock the deadbolt when you're NOT in the room, since that seems to be the real concern here.  But yes, I agree, this is a safety issue.", "While I agree we're now getting into millions to one territory.\n\nThe odds that there will be a fire/emergency AND you're asleep in your room AND a first responder could get to you in time AND your door doesn't give way with a swift kick\n\nNot saying it will never happen but it depends what your risk tolerance is. Also as somebody who has kicked a couple doors down to help my grandmother and has had an abusive ex kick though a couple doors that I was hiding behind it's amazing how flimsy most interior doors are.\n\nHad to break my grandmother's bedroom door once as she was calling for help, it lasted maybe 5 seconds. \n\nI was even more amazed about how flimsy the solid wood front door was though, her carbon monoxide alarm was going off and she wasn't answering the phone next to her bed, it lasted maybe 30 seconds against a sustained attack.", "NTA\n\n>I just asked them if a lock for my door would have been cheaper.\n\nPower. Move.", "NTA but wow. None of this ends well. Eventually your nieces will learn that it was their mother that caused them to miss Disneyland and that your parents enabled her.", "NTA, Your parents seriously let their own selfish needs get in front of their younger daughter. First they know that your sisters a little goblin thief but don't let you get a lock. And then they refuse to take responsibility for her actions even though they enabled her, like seriously how cant they hear someone rummaging through your room. And they have the audacity to ask you not to file a report, absolutely unacceptable. Again NTA your parents are lazy and are obviously showing who their favorite is.", "I'd still report it. And I'd wouldn't trust that emergency key loose in the house. We already know sister likes to take keys that don't belong to her. I'd change the tumbler in the lock and not tell anyone. (Maybe let your grandparents know where the extra key is.)\n\nOh, and NTA.", "NTA. Your sister needs to learn how to be responsible for her actions. I think she needs to experience what it is like to suffer the consequences of her actions. If she keeps on getting away from the repercussions of her behavior, it is possible that it will just get worse over time.\n\nYou parents, your nieces, and most especially, your sister shouldn't get mad at you. Your sister stole from you and the cancelled trip is primarily at fault.. Your parents are partially to blame because they didn't discipline her.", "NTA.\n\n1. not you, but your sister is the reason the trip can't go ahead.\n2. And not you, but your parents used the money for that trip to repear your car, because they would rather protect there dead beat daughter than teach her a lesson.\n3. Your sister shouldn't suddenly act like she cares about her kids when she dumped them at your parents' house. She chose her ex over her children!\n4. Young parents can parent well, poor excuse from your parents that your sister is on the wrong track because they were too young to parent.\n5. Report at the police immediately next time!\n\nHaving your parents use YOUR gift for your graduation makes them even more TA! And why are your nieces going on something that should be a gift to you?", "NTA I'm not sure I'd have given your parents the choice really. They're saying YOU denied your nieces a vacation?! No, that's on your sister, and if I was in your place I'd have said, \"Since you're just protecting my sister from the consequences of her actions like always and blaming ME, the victim, for this mess as opposed to holding my sister the least bit accountable, you can keep your money. I'll be filing the police report regardless of what you offer and maybe she'll finally learn that mommy and daddy can't always save her ass.\"", "YTA - don’t threaten to snitch on your sister and put her in prison. People borrow cars from their siblings when they shouldn’t all the time - it’s not theft, she was going to return it, it’s barely immoral. A criminal conviction is life ruining, both for your sister and for her children. Reporting it wouldn’t benefit you in any way. You’d still get the insurance money whether she had permission to drive the car or not. You’re obviously an asshole if you send your sister to prison. You’re just creating drama for the sake of drama and as a result you’ve denied your nieces an important family holiday.", "Update for you! Looks like that’s exactly what happened 👍", "ngl that first paragraph did scare me 😭", "Did I read this correctly that the kids aren't with their mother because the boyfriend doesn't want them around? Holy yikes. Yikes yikes yikes yikes yikes. This whole situation is like the tense few seconds before the live grenade that's been thrown goes off.", "Be fucking for real", "Is it possible for you to live with your grandparents? Are they nearby?", "Absolutely. And they SHOULD be upset and angry. But *at OP's sister*. Why is it always the person who does not  enable who gets the blame??", "This is exactly right. My brother is the golden child and it doesn’t matter what terror he causes, they will do whatever it takes to keep him happy. \n\nThese parents know they don’t have to worry about the scapegoat, so they take all their love and give it to the golden child. Because apparently “they need it more,” words straight from my mother.\n\nMy heart aches for OP, because unfortunately this is a forever battle. There will be some big choices to make.", "Isn't it up to the insurance company to file charges? They would do so in order to get back the money they paid out for the car. \n\nIn that case, I would definitely expect them to file charges and force her sister to either pay or go to jail.", "That's great! Books are marvelous, and pricey, glad you have the funds, And The Best Attitude!  My first visit to Disney was age 18, HS senior trip. Visited several times over the decades. Last time was in 2008, after my dad died, and was on Mom's (76 yr old) bucket list to stay/visit The Animal Kingdom. Just incredible! She wasn't up to riding roller coaster rides, but as a single rider, I could get on with little wait times. As an adult, I didn't think things could get better than Epcot, Animal Kingdom proved me wrong. Your niblings have time ahead, probably more enjoyable as older. You know there's a lot of tiring walking involved, anywhere.", ">As a thief, your AH sister could still pick the lock\n\nDef keep camera, but FWIW picking locks requires both tools and practice, neither of which her broke-ass layabout sister is likely to invest in. \n\nSOURCE: am locksmith", "She’ll probably ruin stuff on purpose", "Your generation will save us from ourselves.", "No, but the sound of the belt being snapped in anticipation", "I actually went through a violent phase because my physically weaker mom tried this on me. I am not ashamed of it.", "Grr!", "And big sister escapes consequences. Probably not for the first time.", "Sorry, saw some further comments that the car had to be entirely replaced. Wish you could keep us posted, old 63f still worried for you. Sending a supportive hug.", "Yes please do an update in the near future.  You're an impressive young lady & you're going to kick major ass as a lawyer in the future, I just know it.\n___\nOh & move to gparents asap if possible to get away from these draining people! (I saw you have a plan already. You're on a great path & I wish you the absolute best!)", "Then do it. Don't let your sister get away with stealing and wrecking your car and don't let your parents continue to get away with enabling her.", "> You're gonna go fast in life\n\num", "Yeah people who think prison is actually useful are nothing more than magical thinkers.\n\nYour story is so common - I’m so sorry you had to deal with that.", "100%.  OP's parents are punishing OP by using the money earmarked for her/his graduation celebration. The sister should be working to pay back the parents. OP is blameless.", "Maybe OP should get a written and signed letter from her parents that they won't hand over the key to her sister under any circumstances just to for piece of mind so they can't try to rewrite history when the sister does it again.", "The odds that her mom does something highly fuckery worthy with it is much, much higher than having a life threatening emergency ;)", "Unless you put longer screws in the hinges on the door, it's easy to break the door in by kicking on the hinge side.   I always add extra long screws to the hinges in all outside doors when I move in a place.", "Can confirm. Got locked in a bathroom at work after the deadbolt malfunctioned and it took the on site handyman 30 minutes with a power saw to get me out.", "NTA, but what a sad situation all around. Your parents are in a really, really bad spot here, and they seem to be trying to amend their mistakes now that your sister is older and a mom. You don't deserve your sister stealing your car and destroying it, and getting the bolt is indeed great for you and your peace of mind. I guess I just feel bad for your parents and your sister.", "So they failed as parents to your sister snd to make for that they are failing as grandparents to sisters kids. Then sister fucks up again despite your warning and instead of teaching her a lesson for once they ruin EVERYONES vacation and blame it on and are still failing as parents to both you and your sister and failing as grandparents", "NTA\n\nYou are NTA! Your parents however are! They are dismissive of your feelings and they understand your sister is troubled, but still were unwilling to protect you! Now they have put a lock on your door, which is good, but you should not be responsible for any of the damage to your car! It is their responsibility to take care of you and protect you and they have clearly not done that! Your sister SHOULD have gone to jail because she is a thief! And, there is nothing to stop your sister from stealing that key from your mom! Save up AND MOVE OUT because your parents are showing favoritism that will be detrimental to you!", "NTA. \n\nI’m not telling you to replace the deadbolt with an identical model with different keys to keep your mom from giving her spare to the golden girl, but I’m also not not telling you. Just like I’m not telling you that a deadbolt can be re-keyed by a locksmith, but that might be more expensive than just replacing it. Not going to tell you that you can buy brand-specific re-key kits for less than a new deadbolt or locksmith re-keying if one exists for the brand of deadbolt on your door. \n\nSorry but I am not not not telling you any of that. \n\n\n*I will tell you that it’d be safer to put a chain lock on your bedroom for when you are at home and only engage the deadbolt when you are away. No sense in endangering yourself.*", "✨NTA✨ This is why I love Gen Z!", "Yeah, I'm sure that those kids would have had an awesome time in their vacations while their mother is behind bars, best childhood ever.", "This !", "Ok, but can you trust your mom to not misuse that key by letting your sister get a hold of it? \nI mean this as a real question to ask yourself, OP.", "This is the way.", "Do you think your sister did this intentionally out of jealousy or was there really ice? She seems shady & possibly capable of such. \n___\nEither way, at least no one was seriously injured or worse.", "Well, that paragraph is how those parents think. And the sister.", "Nieces.", "OP has to file the police report, then call Grandma’s insurance company.", "You should still file the report.", "In my brother’s case the blinders are there even after a felony", "Most people are saying a lock for when OP is not there, not for when she is there.", "Yes. This is a good approach.", "It is because he wanted to make minimal damage.", "Firemen have axes for a reason...", ">I just asked them if a lock for my door would have been cheaper.\n\nBOOM GOES THE DYNAMITE. NTA.", "“What would happen if they came into my room without my permission. We have an understanding” how I would love to be a fly on the wall for that! Way to go Auntie!!", "Just a little tip for you, it's common practice on Reddit to put a /s next to a sarcastic comment to identify sarcasm more easily than writing that something was sarcasm! No big deal or anything, write however you want, just figured I would pass that little tidbit along!", "It is theft if you borrow without permission.", "Replying to say that I want to commend you for dealing with all of this chaos as sensibly as you can. And for being brave enough to identify what actions you have agency to accomplish, then actually doing them\n\nI've had friends that live in dysfunctional families where they are taken advantage of, financially abused, etc. And because of the level of mental/emotional manipulation that occurs in these families, my friends have had an incredibly difficult time working themselves out of their family's control or even understanding what agencies they have to \"fight back\" against that. That is to say, doing what you are doing is not easy, and it's really great to hear that you are standing up for yourself in whatever ways you can\n\nNow that you're 17, I'm really hoping that sooner rather than later, you'll be able to separate yourself from your parents and your sister. It's unfortunate that your family isn't able to be the support system for you that they should be. But with a family like that, you're so much better off not living under their roof\n\nI wish the best for you, and again, you are handling this situation so maturely. Good on you for knowing how you deserve to be treated!", "Cool. And just make sure the nieces know they have **their mom** to thank for this, not you...", "NTA, but it might be worth seeing if you can do summer school as an excuse to move out 3 months earlier. Either that or find a summer job close to your college or your grandparents house.", "Nah, she wouldn't be an AH for reporting but she's not an AH for not reporting, either. OP isn't responsible for her much older sister's moral development, and she still has to live with these people.", "A lock is still required.", "Well the statute of limitation for reporting car theft is multiple years (at least where I am at) so if they do OP can just call up the cops and report a car theft which her parents \"forced her\" to bury.", "You should be able to get a police report, without having to press charges. That way if your sister does something stupid again, it’s on file against her.", "Yes, but the parents clearly don't care about the golden child stealing the key.", ">If the sister cares that much about her kids going to Disney, she can always take them.\n\nAnd deprive herself of something she wants? Not a chance! That sister doesn't care about those kids! The sad thing is that those kids are there and now that the sister is there too, they are going to look to her to be a \"mother\", which she clearly is not, and they are going to be confused when she leaves again!", "Considering the lock was for when OP is out of the house, not to lock herself in, the conceivable Emergency would be, like, she gets injured and ends up in the Hospital, and asks for stuff from her room to be brought to the Hospital. That, or a evacuate-within-an-hour order (for flood/wildfire) comes in while OP is out, and Mom wants to take some of her stuff along.", "And what will prevent your sister from stealing you mothers copy of the key to gain access to your room again?", "The Main Problem was always people getting in when OP i not there to supervise.", "A side note, but anyone else pick up on the fact that the kids live with OP's parents because sister's boyfriend didn't want them around? I work in a school system and am always so sad when I see a parent choose a romantic relationship over their own kids. It happens a LOT, probably more than the average person even realizes.", "NTA. Your parents took away the kids' vacation when they decided not to let their oldest daughter take responsibility for her own actions (AGAIN).", "Even if you reported the car to the insurance company and filed a police report, it's not likely the police would do anything since she lives in the house and it's a family member.  Your sister won't be going to jail and even if you demand to press charges,  I doubt they'd do much and her punishment, if any, wouldn't be jail. Plus, is the car 100% registered and insured under your name alone?", "NTA. I’d go ahead with the police report, then everyone can stop ‘being mad at you’ for depriving her children of a holiday and she can pay for the damage herself. You’re losing out on the holiday as well by taking that deal so they can all suck a fart.", "Yep. As long as enabler mom has the spare key, that lock does not exist.", "I have been here long enough to see that first paragraph being posted as literal...", "I’d also invest in a dash cam. You have a cam in your room, which is awesome, but what if she dodges the cam next time and you don’t have concrete evidence she took it? Then you’d be able to show dash footage of your car out and about while you’re at school", "At this point, her facing charges is your graduation present.", "Out of curiosity, who's paying for her medical bills? I hope it's your parents 😂", "Maybe get a second or third camera since they now know that one camera exists. That way if they go in and disable the camera, you still got 2 more they don't know about", "Expect the worst of people and then they won’t disappoint haha", "I'm willing to bet that the car is registered and insured through your grandparents, not your parents, to ensure its your car alone. In my experience, in a unhealthy family setting, when extended family gifts you something, it becomes the family gift since you're all members of the same family. \nI was gifted the down payment for my first car from my mom's aunt, with the instructions of not letting my mom drive the car (she was afraid my mom would trick me into pawning it). My mom tried to convince me to borrow the car to drive to a casino, and I said no. Her argument was \"my aunt gave you the down payment\" My reply, \"call her and ask then, she says yes and I'll hand you the spare key.\" No phone calls were made. Mom drove her own car to gamble.", "Please tell them they used money from your trip! Your grandparents need to know that", "NTA, The actions of your (OP) sister have repercussions", "But they didn't report it stolen so sis didn't have to pay any consequences!", "They already have been abusive, it's obvious which child is significantly favored", "Ya know, there are good reasons posts concerning violence are against the rules here. It’d be nice to leave it out of the comments too.", "Ours wasn't a belt but a switch - when my sister broke / hid it, she was told to go pick another one from the tree. Nothing like trying to work out what type would hurt less while picking it!", "Ah, I misunderstood what the person above you was saying. Yeah, you're right, OP doesn't want that on her driving record, especially since she's a young driver, even if the parents are willing to pay whatever increases come with it.", "Your grandparents are dead set rock stars.", "Why? OP isn't the registered owner, its loaned from grandma and was stolen whilst 'on loan' to OP. Surely Grandma is entitled to make the report?", "Criminal defense lawyer here. Deterrence doesn’t work. Most of my clients are not\nThinking about what could happen to them if they carry out their crimes. Even if they have been in trouble dozens of times before and they know exactly what will happen.", "Eh but some people actually become institutionalized. They get out, can't get a job, and purposely try to go back because it's better than the struggle of being out, and they're used to prison. Just start committing random crimes to get locked up again", "They are punishing the little nieces, too, which is really horrible.", "I agree with you here. My husband is very security concious so all our doors are key locked. They have a setting where they're locked from outside but can be unlocked from inside. He always forgets to do this when he leaves and I have literally been locked inside my own house because I couldn't find my keys! I could smash a window in need but it freaks me out! Had a situation where the building across the road caught fire and I couldn't open the door to help them until I ran to the back of the house to find the keys to unlock the front door", "Nta. You didn't rob them of anything. Your sister did that. You're just not enabling her. You're right, a lock would've been cheaper.", "NTA. Your sister is the one that cost them their vacation, not you.", "NTA, you're right a lock would've been much cheaper.", "I don't understand how it is OPs fault when they didn't steal the car and crash it, the sister did.  Why isn't the sister getting the blame for ruining vacation?", "You may have a lock on that door now, but sounds like your sister will hunt down a key with ease. I recommend you get a Reolink camera for your room and a microsd card to keep recordings. You can get both for about $50 on Amazon. Install is super easy and then you’ll have surveillance in your room as well. There is no monthly fee for this, just the one time purchase of equipment. \n\nNTA and I hope your car gets fixed. DO NOT allow someone else’s horrible decisions and actions to make you feel responsible for them. They are responsible for how the act, not you. FAFO and her bad choices cost the family their vacation. I’d be sure everyone knows why that remotely tries to blame you", "THIS^^^^ absolutely NOT the asshole. The girls mother denied them the right to go to Disney world when she STOLE YOUR CAR AND WRECKED IT! Their grandparents (your parents) denied them the right when they chose to allow your room to remain unlocked giving their eldest daughter access to your spare key in the first place. They need to let her suffer the consequences instead of bailing her ass out. NTA at all, OP.", "NTA.\n\nFile the Police report.", "I would also look into your freezing your credit.  It's easy and free. Just don't lose the password to unfreeze them.    \nWhile you're at it, check your credit to be sure she hasn't opened anything in your name. \n\nhttps://www.annualcreditreport.com/", "Yep the parents chose to cancel the holiday to cover up sister's crime.", "This girl is seriously going places", "I’m still not sure I have it lol. I always think of the best comments a minute too late.", "Even if they don't hand it over to her directly, what are the chances they properly guard the key? If sis can easily swipe it from them and then they protect her from consequences, there may as well just not be a lock.", "Seems a good summary of the situation.\n\nNarcissists are deadly.", "u/Spirited_Boat_6380", "Idt it’s golden child.\n\nI think it’s more they realized the fucked up with her repeatedly and the second kid they had at a normal age (31) made them realize how shit of a childhood they gave her. I mean a parent at 18 and 31 are wildly different of course…\n\nThey feel guilty and want to try to help her now. I feel bad for older sister tbh, I doubt she was given a fair chance at becoming a responsible adult.\n\nThat being said wtf can u do now…", "My husband doesn’t get undressed in front of me after work because his removing his belt still  makes me flinch. We’ve been married 22 years. I wasn’t even the one getting whooped, but it’s still traumatizing.", "Not to mention, they don't seem to factor in things could've been WAY worse...what if sis hit another car and injured or even killed someone?", "The kids live with OP's parents cause her sister's boyfriend doesn't want them around = sister chose boyfriend over the kids.", "Just saying. There are 2 way bolt locks.", ">Oh yeah, well the jerk store called, they're running out of you!\n\nLMAO! I hate the way Reddit lays things out. I don't know WHO you were typing this awesome comment to, but I've decided I'm stealing it and using it forever! I'm going to change it up like this:\n\n* Me: Hey.\n* Them: What?\n* Me: You might want to get back? \n* Them: Back? What? Back where?\n* Me: The jerk store! They called & they're running out of you!\n\n😁Thanks for that u/rocket_sprocket!", "They might have learned their lesson that not providing the lock cost them a lot of money or possibly a jail sentence for the sister in the future. I'm facing this on the idea that they wouldn't have put a lock on the door if they were possibly going to provide the key to the sister.", "Make sure you tell your parents and sister that if you hear any more nagging about the trip she / they ruined that you'll file the police report anyway because you're tired of her not having any consequences for her actions. \n\nIf they don't shut up = file.", "Oh, absolutely. But I meant, getting even worse and actively threatening OP's safety.", "Sorry you went through that. Yep, my parents didn't have the self control to undo a belt. Whatever was to hand at the time would do, thrust in the heat of the moment", "Or herself, since apparently she’s the only person OP’s parents give a fuck about :/ whatever op does with the spare key she should start taking the battery out and hiding it separately- personally I know where in my room I would put mine, but those batteries are thin enough that there are plenty of options, including taped to the underside of a door for maximum cheekiness"]}