{"id": 4602, "submission_id": "zkmbxc", "title": "AITA For not telling my boyfriend how much I pay for rent for my apartment?", "selftext": "I (18F) have been with my boyfriend (26M) for a little over year. We have been off and on a bit over the course of our relationship but nothing completely toxic. We have met personally but have not yet moved in together because he lives in a different state. I live in an apartment with no roommates. I also have a list of medical issues involving cancer so the money I make working from home majorly goes to apartment and medical bills.\n\nAbout 3 weeks ago we had gotten on the topic of money, and I mentioned that I couldn’t watch my favorite shows on Netflix because I could no longer afford it. He started asking me questions about how I spend my money and what I do in my free time. I responded by telling him that I don’t spend my money on anything but necessities because I, like previously stated, cannot afford it due to medical bills.\n\nThe conversation took a turn when he asked me how much I pay for rent for my apartment. I told him I wasn’t comfortable telling him because it felt like a personal question to me.\n\nSide note - I grew up in a very poor and broken family so I’ve always had insecurities about money.\n\nI told him I wasn’t comfortable telling him because, like I said, I felt like it was a little bit too personal of a question. We started to argue back and forth about what is and isn’t a personal question and I tried explain that the definition of a personal question varies between person but he didn’t want to listen. He then accused me of lying to him and told me it shouldn’t be that big of a deal and he lost trust is me and accused me of not being able to make up a “believable lie.”\n\nI gave up trying to explain myself because I knew it would only make me feel worse than I already did. I was already tired from work that day and arguing with him hurts me more and more every time it happens. He is a very logical person and based his opinions on facts and evidence. \n\nI really need to know, AITA? I haven’t been able to stop thinking about it because he seems cold and distant to me now.", "created_utc": 1670905895, "permalink": "/r/AmItheAsshole/comments/zkmbxc/aita_for_not_telling_my_boyfriend_how_much_i_pay/", "score": 45, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1.) I refused to answer his question because it was something I was not comfortable with answering\n\n2.) It could make me an asshole for not telling him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. the age gap in your relationship is also a bit alarming especially if you've been together for a year, making you ~17 and him ~25 when you started dating. older men tend to prey on younger girls that they can control and manipulate, him pressuring you about sharing personal financial information about your living situation then making you feel bad when you don't is definitely coming off as concerning. this might not be what you want to hear, but i'd be cautious.", "NTA  \n\n\nFirst off, he's morally sus for starting to date a 17yo when he was 25. It's not like you have any plans to move in (and you shouldn't, he sounds like a guy to drop!) so he doesn't need to know all of your business. In a healthy relationship, I might understand being iffy about a partner not being willing to share financial info that could be relevant in the future. But between the age gap, it being an off-an-on relationship, and him getting this upset at you not sharing this info with him... this isn't a healthy relationship.", "NTA. So many red flags", "I just can’t get over the first two sentences. You were a 17 year old dating a 25 year old. You’ve broken up and gotten back together but it’s not “completely toxic” which means it’s just normal toxic (which is still quite bad). \n\nBut ignoring all that, asking about how much your partner pays in rent after one year of a relationship is not a personal question, and if you were actually contemplating moving in with this guy or getting a new place that is really important info to know roughly how much each person is expected to pay. You should be able to trust your partner to tell him this info, but it sounds like you don’t trust him well which is very concerning. \n\nYou’re still NTA, but there are so many red flags flying. My personal advise is you cannot move in with this guy, and you should get out of this relationship as fast as possible. The age gap is massive, you two can’t keep the relationship going without falling apart every few months, and it sounds like you get in arguments frequently.", "NTA - that age difference… \n\nThis is also controlling behavior.", "Yikes on a fucking bike girl. Firstly a 26yo man does not want to be with an 18yo unless he can manipulate them. There will be a reason he cant find someone his own age to date. Please look into age gap relationships and the red flags you should be looking out for, I bet he's waving a bunch you're not seeing.\n\nSecondly, on and off for the first year, if you can't be happy and work through any problems without breaking up in the first year when you're supposed to be obsessed with each other I find it hard to believe you never will.\n\nThirdly you're not the asshole you don't have to answer any questions you don't want to, but how much you pay in rent is not a personal thing to tell your partner of 1 year. Many couples are talking about living together at this stage, thus sharing financial information.  If you don't feel comfortable divulging this information to him then you don't feel safe with him and that's a giant red flag.", "- This relationship started when you were 16-17F and he was 24-25M.\n\n- “Nothing completely toxic” - any amount of toxic is too much toxic.\n\n- He repeatedly tried to cross a boundary you set but says *he’s* lost trust in *you*.\n\n- “I gave up trying to explain myself because I knew it would only make me feel worse than I already did.” Oh, no. Oh, you poor thing. OH, NO.\n\n- “He is a very logical person.” No. That is the excuse he uses for bulldozing you and minimising your feelings.\n\nThere’s a reason this guy can’t get a partner his own age. Run.\n\nNTA", "NTA.\n\nIt's none of his business how much you pay because you don't live together and how you budget it up to you as an adult. Plus, you explained why you didn't feel comfortable telling him. His behaviour is a bit concerning though. I'm wondering if this type of reaction is normal for him", "NTA. It's none of his business and unless you are planning to live together, finances are personal and not necessarily open for discussion. \n\nHis behavior in general is full of red flags and it sounds like you have a lot on your plate without dealing with someone who is emotionally manipulative.", "NTA — you owe him nothing and are under no obligation to tell him what *you* pay for rent or any other bill for that matter.\n\nJust for perspective, *nothing completely toxic* still doesn’t sound good, and there’s a big difference between an 18yo and a 26yo. \n\nI’m not telling you to leave a relationship but just remember that you’re still young with plenty of life ahead of you. No need to tie yourself to someone who makes you uncomfortable with money questions at 18.", "NTA\n\nGirl, get out of there.  To accuse you of not making up a believable lie because you're not comfortable telling him how much your rent is and that he's lost trust in you?   FUUUUUuuck that noise.   \n\nBe glad he showed you how trash he is now, before you're legally bound to him.", "NTA\n\nYou don't need a controlling bf to add to your problems. A supportive bf *of one year* would have just respected your desire to keep your personal finances private. Ditch the on and off guy. You need as much peace of mind as you can get nowadays.\n\nHoping for your full recovery. Hang in there.", "NTA\n\nDump him and go NC. He doesn’t respect your boundaries. You tell him you don’t feel comfortable with something and all he does is double down? He’s power tripping on you. His age worries me, too- why can’t he find someone his own age?\n\nYou don’t need stress or his BS. He knows your medical history- he can and will exploit that. This guy isn’t safe for you. Kick him to the curb and don’t look back.", "NTA, and maybe it sounds cliche judging from one post, but dump him and get out of there while he's still a state away.\n\nYou are perfectly within your right to withhold info like your financial status from even a partner if you're not comfortable sharing so long as its not harming anyone(which its not). Him ignoring your boundaries, getting aggressive and dismissive of you, and then gaslighting you and accusing you of lying. Not even mentioning the age difference here of 26 vs 18 with extra medical and financial burdens that he knows about. These are gigantic red flags with red flashing neon lights.\n\n**DO NOT EVER** allow this person to move in with you, do not allow them any access to your private info, do not put yourself in any sort of situation where they would have power over you. Because your story, minus the extra medical issues, is a textbook case of how abusive relationships start. He's already stated he doesn't trust you and is giving you the silent treatment, use that along with the argument as an easy excuse and get out of that relationship and contact while you still can, because farther down the road trying to leave abusive relationships often ends up with the abuser putting you in the hospital. Don't try to justify it if he tries argue it, because he will, just cut the cord and go silent.", "NTA. Also, I know many other comments have mentioned this but I can’t stress it enough: there are so many red flags here. The relationship has already proven to be volatile and toxic, and I PROMISE you, your older self will thank you for getting out early.", "NTA.  This guy is being controlling and abusive.  You have every right to spend your money on what you want and can.  As long as you're meeting your obligations and he's not putting his money into it, in any way, it's none of his business.  \n\n\nYou're very young to be with someone 26 years old.  My guess is, he either wants to lecture the crap out of you for your expenses, or he wants to offer money so he can extend control over you.  Your instincts in not wanting to share this with him are right on the money.", "Please date someone your own age. This dude is TA for being a groomer.", "NTA the math is not mathing tho, what did a 26 year old have in common with a 17 year old? What does a 27 year old have in common with an 18 year old? Isn't there a classic equation for age differences? Y'all don't pass it, I don't believe.", "Honestly I thought NTA from the moment you mentioned the ages. And I was right. You don't have to disclose that information and he is being at best a dick here and at worst  manipulative.", "Okay, first you aren't living together, he doesn't get to decide what he has a right to know. You talk, you disagree, and you move on. But in your own house - No. Two, if he's logical he would have accepted I can't afford it. That's a really practical argument. Three, if he doesn't make you happy he's failing the basics of a BF role and bye-bye.", "NTA - If you don't trust him to know details about your personal finances that's your decision alone. \n\nHowever - he may be trying to gauge your expenses so that he can help you financially. That you don't mention why he thinks he should know in detail how you spend makes it hard to understand his motives for what he will do if you did decide to open up about your finances.\n\nOff the subject - ever consider that a 26 year old might be a little too old for you? \n\nStrictly speaking - you should be at different places in your lives and that it's a long distance relationship, where does this go assuming if the relationship stays intact?", "NTA.  \"We have met personally but have not yet moved in together\" tells me this is a mostly on-line relationship. \n\nWhile some of you think that divulging financial info is realistic as many would be looking to move in together, I know a couple gals that really got cat-phished and lost a lot of money.  I would be very hesitant to share any financial information with this guy.", "NTA, and he really is very toxic. Your line about him basing his opinions on facts and evidence really stood out. I'm guessing that's how he personally describes himself rather than how he actually is, because there was nothing fact/evidence-based about his accusations toward you. You're uncomfortable with disclosing financial information for understandable reasons. A respectful person would accept that and kindly back down. He did not. When people brag about being fact-based and logical, they're actually just saying that in the hope that other people will take them at their word whenever they spout off about things and not argue. Or they'll *use* facts and logic selectively to twist the argument around.\n\nHe's being cold and distant to punish you for not doing what he wanted. Please cut things off with him. Do not let him have information about you. Don't let him love-bomb you or try to push you into a living situation with him either. He sounds so terrible.", "NTA- your groomer boyfriend is always the ahole based on his age alone. Friend- he is a predator.", "Hard to judge for me.\n\nIf you say you have a good relationship together and it's going places, you should be able to share basic info like rent.  Hes not asking your bank acct amount...\n\nIf you are casual, none of his business.\n\nI have a feeling most will day something about later, but I think YTA if you have a serious relationship amd you wont share your rent amount?  What if they wanted to move to your town for pricing info.\n\nMaybe it's just me, but I dont see how it's a big deal.  Seems like he could just call your apt and ask to rent a unit and get the price.\n\nI think you overreacted.  Hes cold because if you cant share basic info he might worry about other things...", "I knew it would be all NTA... \n\nI'm just saying your overreacting.   Your rent is practically public info, I dont see asking that info as a 'red flag'\n\nOther people are stuck on age... that's your deal, I'm not gonna judge that like others.", "If he's not being controlling the age gap is a little weird but not terrible... if you click, you click. Don't let others say shit. If you've been dating him for a year and you won't give him your rent amount what are you doing? I've literally asked girls this on first dates lmao.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (18F) have been with my boyfriend (26M) for a little over year. We have been off and on a bit over the course of our relationship but nothing completely toxic. We have met personally but have not yet moved in together because he lives in a different state. I live in an apartment with no roommates. I also have a list of medical issues involving cancer so the money I make working from home majorly goes to apartment and medical bills.\n\nAbout 3 weeks ago we had gotten on the topic of money, and I mentioned that I couldn’t watch my favorite shows on Netflix because I could no longer afford it. He started asking me questions about how I spend my money and what I do in my free time. I responded by telling him that I don’t spend my money on anything but necessities because I, like previously stated, cannot afford it due to medical bills.\n\nThe conversation took a turn when he asked me how much I pay for rent for my apartment. I told him I wasn’t comfortable telling him because it felt like a personal question to me.\n\nSide note - I grew up in a very poor and broken family so I’ve always had insecurities about money.\n\nI told him I wasn’t comfortable telling him because, like I said, I felt like it was a little bit too personal of a question. We started to argue back and forth about what is and isn’t a personal question and I tried explain that the definition of a personal question varies between person but he didn’t want to listen. He then accused me of lying to him and told me it shouldn’t be that big of a deal and he lost trust is me and accused me of not being able to make up a “believable lie.”\n\nI gave up trying to explain myself because I knew it would only make me feel worse than I already did. I was already tired from work that day and arguing with him hurts me more and more every time it happens. He is a very logical person and based his opinions on facts and evidence. \n\nI really need to know, AITA? I haven’t been able to stop thinking about it because he seems cold and distant to me now.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Your finances are your own business until WAAAAY later in any relationship. He seems a little potentially controlling. Test this as a red flag.", "NTA   And please please dump this guy, he's trying to control you & manipulate you to where your are completely dependent on him.  This is NOT someone who has your best interests at heart, not at all.", "Ah another boyfriend, so classically logical, who bases everything on facts and reason, not EMOTION. They would never to anything emotional like silent treatment huffing.", "Girl, you don’t have a boyfriend, you have a predator.  Let me ask you this - does he nurture you, delight in you, make you feel like a million dollars? Or does it take a boat-load of emotional energy just to deal with him on a day to day basis? You are far too young, and have far too much else to deal with, to need to anchor yourself to this deadweight.  In a side note - anyone who prizes “logic” in a disagreement is basically saying that your “feelings” don’t matter and are not important.", "NTA\n\nDoesn't matter if a question is considered personal or not - if they don't need to know then you don't need to tell them. He's not your roommate or landlord so he doesn't need to know. It's called privacy and he doesn't respect yours.", "NTA", ">I told him I wasn’t comfortable telling him because, like I said, I felt like it was a little bit too personal of a question. We started to argue back and forth about what is and isn’t a personal question and I tried explain that the definition of a personal question varies between person but he didn’t want to listen. \n\nSo, when you said you didn't want to share because it felt too personal he argued with you about whether or not that info is personal?? Sounds to me like he tried to bully you into ignoring your feelings in favor of him getting what he wants. He's already not respecting your \"no\" over your business and your feelings. How else will he try to steamroll you in the future?\n\n>He then accused me of lying to him \n\nBut where was the lie?\n\n>and told me it shouldn’t be that big of a deal \n\nThen why is he having a cow?\n\n>and he lost trust is me \n\nBecause you didn't give him what he wanted? That's wildly manipulative, trying to make you feel like you did something wrong by not being ready to share exactly the info he wanted exactly when he wanted it.\n\nThat's not just a red flag, that's straight crime scene tape. \n\n>and accused me of not being able to make up a “believable lie.”\n\n...what? He's not only manipulative, he's also stupid. One moment he can't trust you and the next he's mad you couldn't convincingly lie? \n\nAt this point he's throwing everything at the wall, hoping something will stick. Hoping that something he could say will make you feel bad enough to just give in and tell him.\n\n>I gave up trying to explain myself because I knew it would only make me feel worse than I already did. I was already tired from work that day and arguing with him hurts me more and more every time it happens.\n\nIt hurts because he is making it hurt on purpose so you'll give in.\n\n>He is a very logical person and based his opinions on facts and evidence. \n\nDid he tell you that? Because right now he looks like an inconsistent illogical AH. There is no logic in arguing against your idea of what is too personal. There is no logic in saying he can't trust you because you didn't immediately give him what he wants. And there is literally no reason or logic behind accusing you of \"not being able to make up a convincing lie.\" \n\nHe is neither logical nor reasonable. \n\nHe is wildly emotional about this topic, can't handle being told no over something as small as info about your rent. \n\nThe facts are: you don't want to share, you don't need to share.\n\nThe evidence is he isn't paying your rent.\n\nHis arguments lack logic of any kind. No facts that support his side. No evidence that he needs to know. \n\nAt the end of the day you were talking about not affording Netflix and now he wants to examine your finances and he is PISSED you won't tell him your rent?\n\nNo. Nope. No way. No thank you. Not a chance.\n\nYou are smart, your boundaries are reasonable, and he's far too emotional about something that isn't any of his business.\n\nI would highly recommend getting away from him. He is a predator, and he is doing his best to find ways to control you. You deserve a partner who respects your boundaries and treats you like an equal. \n\nThis dude ain't it.", "\"We have met personally\"? Like, how many times?\nIt sounds like you met this guy online and have formed a long distance, online relationship with someone considerably older than you. How well do you really know this man? Have you met any of his family or friends? How much time have you physically spent together? Have you been to his home? \n\nThere are so, so many red flags here. Please be careful.", "In my experience, people who present themselves as ‘only being logical’ and then use that ‘logic’ to browbeat you into doing what they want (ie, share private financial info) are bullies.\n\nYour gut instinct was not to share private financial information, and your gut was right. Trust your instincts, protect yourself. \n\nYou already have medical disabilities (and you’re coping fantastically well if, in spite of this, you’re living independently and supporting yourself at only 18). Don’t make your life harder by inviting this controlling bully into your life.\n\nMy instinct is that he only wants the info on your financials so he can tell you you’re doing everything wrong and use his ‘logic’ to make you feel stupid. Does that ring true? Does your gut recognise that as truth?\n\nMake space in your life for people who will treat you well. Not this guy.", "I couldn’t agree more, also it’s a little sus that he doesn’t even live in the same state. What she pays in her state might be cheaper than what he pays in his state. But if she’s uncomfortable telling him he should just drop it.", "Yup, during the first year things should just be getting better and better with your partner. If it's not, it's not the right relationship.", "\"he's a very logical person\" also sounds extremely manipulative to me, like he's using his age to make it seem like he's wiser and she couldn't understand things because she's too young.", "How do you get a 26 year old creeping on a 18 year old online and only meeting a few\nTimes a “serious relationship”?\nLike, is there an adult around you that can help you understand this?", "Asking is not a problem.\n\nRefusing to accept that she doesn't want to talk about it is not good.\n\nRefusing to listen when she tries to explain why she doesn't want to answer is not good.\n\nAccusing her of lying when she feels compelled to answer the question is not good.\n\nThe age difference is the least of her problems.", "Sounds like you didn’t read the post at all.", "Okay found the creep who preys on underage girls", "I don't date girls unless they can go to the bars but I can see how that seems sus.🤣🤣"]}