{"id": 4683, "submission_id": "zln3vb", "title": "AITA for refusing to pay child support to my ex-wife for our children so she and her husband can save for their other kids", "selftext": "My ex-wife and I are the parents of a daughter who is 17 and a son who is 15. We share custody of our kids 50/50 and we have been divorced for 13 years now. Neither of us pays child support because we have equal time with the kids and we split the costs of everything (school, medical, dental, extra curricular's). I opened up bank accounts for my kids when each was born and I have saved from the get go, but around 8 or so years ago I came into some money because I was injured at work and I put that money into their accounts. As well as this a relative died 4 years ago and I was left a sum of money that also went into the accounts for my children.\n\nThe money I have now saved for them will help them tremendously in their futures, whether they go to college or not.\n\nMy ex-wife remarried several years ago. Her stepdaughter is 16, she's got a nephew of her husband's they are raising who is 14 and she has a 7 and 5 year old with her husband. Ex-wife wanted to talk to me about college for our kids and she told me that she and her husband had told all their kids that community college would be the most affordable option for them and that they would get as much help as possible but a more expensive school would be tough on them. I told her that our kids would have that option if they wanted it because I have saved a more than healthy amount for them. She asked me why I never told her sooner and I told her because I was taking care of our children and it wasn't something she needed to know.\n\nA few days after this talk she called me and alongside her husband said that they would like me to pay child support for our kids, so that they can save more money for their other children's futures. I told her I was not going to pay her child support just so she could support the other children in her home. Her husband told me I could always offer to split the money between all of the children. I told him I was not paying for his kids to go to college. I told them I only had a responsibility to my children. I told them if they wanted to save more money, I would happily take the kids more if THEY (my kids) want to spend more time at home with me. Ex-wife called me cruel and said keeping 50-50 and paying money so our kids siblings can go to college should be a no brainer for me. I told her the day I have an obligation to help her support her entire household is a day in another universe where we never broke up. But we did and she has to accept she is equally responsible for our kids as me.\n\nThey both told me I was an ass and even though I feel like I'm crazy for asking, I must ask, AITA?\n\nETA: The courts did not order CS because I only make a little more than my ex-wife and I was well below the threshold they use to determine CS in 50-50 custody cases.\n\nI have control of the money. My children are aware it is there and we have talked about it but they are still undecided on their future plans. They do not have access to the money yet.", "created_utc": 1671012054, "permalink": "/r/AmItheAsshole/comments/zln3vb/aita_for_refusing_to_pay_child_support_to_my/", "score": 14688, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I refused to pay child support to my ex-wife just so she could save for the other children in her household the way I was able to for our two children. So I feel crazy here but where I could be an asshole is the fact this could have a negative impact on our kids. Not to mention the fact it could harm some of their relationships if they have so much more options to the other kids in their mom's house.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Also, I'd be extra careful with the college funds, your kids could be bullied into sharing with their step/half siblings in the future.", "NTA, they are trying to sucker you in to paying for their kids. Don’t budge.", "NTA, what a laughable suggestion on their part", "Wait why should you be paying for their kids?  It makes sense that you have planned for your children's futures.\n\n\nImagine if the roles were reversed and it was you asking her for such a favor. I don't think she would ever agree to such a scenario.\n\nNTA", "NTA. Thier children are not your financial responsibility.", "NTA. You share custody and expenses evenly. There's no reason to pay child support. You are right--her other obligations are not yours and are natural consequences of her decisions.", "NTA. Make sure your kids know their options. Protect their money at all costs. They might get lots of pressure from your ex's side. Child support cuts both ways. They try to sue you and then you sue them right back. Protect your kids. Student debt is not a joke.", "They don't seem to understand what Child Support is. They seem to think it's just means 'free money'.", "Are the funds in your kids' name? If so change it ASAP because 1st they tried to sucker you into paying up, next targets are your kids they will try to convince them to share with their step siblings CHANGE IT ASAP theyll try to guilt trip them", "NTA\n\nIdk why reddit has been full of stories about entitled people lately. OP you need to stand your ground. What they’re proposing is completely ridiculous!", "NTA\n\nIt really sucks that your children's siblings won't have the same opportunities they will, but it's not your fault or your responsibility to provide for them.", "NTA.  The fact that they apparently just realized they should be saving for their large brood isn't your problem.  Luckily for your kids, you did save for their futures.  You have zero responsibility to pay for someone elses kids, or to pay child support when you already pay 50%.  They're just embarrassed and jealous that your kids will have opportunities that they can't provide for theirs.", "NTA. You need to make sure they can’t take your children to the bank and access the money. They are minors and she might try and get to it. You might just want to put the money in your name and pay your kids college and living expenses directly. Their mom might pressure and guilt them into giving her money.", "NTA. Not by any definition. It looks like the money you saved is going to be the only support your kids are going to get with any further education. Good for you making such an effort to push it up as much as possible and protect it from being abused by your ex.", "NTA. Yeah, it sucks for them and their kids but they aren’t your kids. Your kids are your kids. Not your obligation so end of discussion.", "NTA the actual audacity of some ex's that expect their children's other parent to pay for their new children's lifestyle/future is staggering. Her other children are not your responsibility. The fact that they asked you to split your savings for your 2 kids to their other children is ridiculous.", "NTA. Her and her husband are the assholes for trying to get you to pay for their kids. What nerve they had. Whew", "Please don’t give them your hard earned money", "NTA at all. It’s up to them to save for their other kids futures. You are being sensible and giving your kids options. You also have them 50% of the time, so no obligation to give her anything. The audacity to ask you this 😳😳", "NTA. I think you should consider setting up a trust or account that cannot be accessed by your ex once your kids go to college. She may try to coerce your kids into giving her that money regardless of how you feel.", "NTA \n\nThe fact that you already have money for your kids' college means your ex doesn't have to put money towards it (even though she should), hence saving money for her other kids.\n\nYeah you're not crazy, she's got some nerves and her husband even more so by asking money for their own kids. \n\nSome people I swear...\n\nPS: and it's really great that you kept all that money for your kids. Many would have blown it off.", "NTA. 50:50 means no child support. Also, you bear no responsibility towards their children. They are trying to rope you in their problems.", "NTA, you did everything you had to, which was take care of _your_ kids and you are right to say you have no obligation to their kids. You even offered to take on your own more often. So, I think you already tried to help.", "NTA. You are right on all accounts.", "NTA. Your ex wife has got some major issues if she honestly thinks it’s appropriate and acceptable for you to pay for all of her kids. I’m completely stunned at her audacity. To paraphrase Judge Judy, there’s something wrong with her. If you don’t have the disposable income to take care of your kids before you play birth control Russian roulette then you better make sure you’re so safe that nothing short of heavenly help would get through.", "NTA\n\nNot your kids not your responsibility...", "NTA\n\nYour ex and her husband are on another planet. You paying child support for THEIR kids is a no-brainer for them, not you, and you are in no way responsible for making sure they can afford to send their children to college. The entitlement they're showing here is absolutely astounding.", "NTA, but ex wife is stupid as h*ll. Who in their right mind would think this was ok?", ">We share custody of our kids 50/50\n\nNTA. You have no obligation of paying for someone else's kids to go to college.", "NTA\n\nI was so ready to call you an asshole cause parents should always pay child support except you aren't. You have 50/50 custody and you are supporting your children. Your ex and her husband have to figure out something else cause your obligation and responsibility is only your children.", "NTA\n\nIf I were you I would try to tickle the \"Pay us so we can give it to our children\" out of them via text. So if they go for full custody or something like that you have proof of their intentions", "NTA - and you’re right, you sound crazy (I say this in a fun banter).\n\nYou’ve obviously been dealing with this type of baboonery for a while, that their crazy starts to seem almost “normal.”", "NTA. She's totally out of line. Your children, your responsibility, your money. Watch out that she doesn't try to get the money other ways (guildpressuring the kids or so) and speak to your kids and explain the whole situation to them.", "NTA\n\nYou have no obligation to support kids that aren't yours. It sucks for them that their parents can't afford college? Yes. Is it somehow your responsibility? No.", "NTA you don’t owe them any money. Sounds like they can’t afford anymore kids anyway. If you haven’t already I’d have a college discussion with the oldest at least. What are her plans for after graduation? Talk about expenses for college and best way to stretch the money you have saved for them.", "NTA and omg I am so embarrassed for your ex’s new partner! This would go great in the “Entitled Parents” sub.", "NTA If she wants child support, she doesn't ask you; she asks  the court. She can try her luck there.", "NTA.   You are under no obligation or reason to provide for the other kids education.  \n\nJust tell your ex not to tell her kids ‘thems the breaks’", "NTA\n\n\nIf the kids custody is 50/50 and costs are split, there's no child support to be paid. \n\n\nAs in literally, you would be as reasonable to ask her to pay you child support at this point. \n\n\nRidiculous.", "NTA !!!!! That’s a no brainer!!! 🤣\n\nYou made the choice to prepare for your kids future  and your kids will be very very thankful later!!! \nYour ex-wife didn’t prepare for anyone’s future (her choice) so why would she be entitled to the savings for her new family ? \nWhat are your kids saying ? I am not sure they would feel ecstatic to share… \nAlso, the new husband is a real AH !! Your children, your problems… WTH !? So shameless…", "NTA. Your wife and her husband just saw the dollar / euro / whatever currency signs pop up in their eyes when you let them know you have made financial arrangements for your kids. \n\nNo one asked them to have 2 more kids after they got married. \n\nTheyre entitled AH", "Lols no NTA they just lookin for a free lunch. You are right your children are your responsibility.    \n\n\nWhy would you be obligated to in a roundabout way support kids where your only relation to them is they belong to your ex.", "NTA if its a 50/50 split then no you don't need to pay. You most certainly do not need to pay for children that are not yours!! That's a bloody cheek!!  Tell your ex wife and her partner to get better jobs and support their kids better.\n\nThe entitlement of some people really does astound me sometimes", "NTA, the ex and her husband should not of had kids if they believe everyone else has to pay. They chose to have kids. It's thier responsibility not yours. Kick thier ass to the curb.", "NYA, but I wonder which part of their brains told them this makes sense.", "NTA. I'm always astounded by people like OP's ex wife and there seems to be whole lot of them here on this thread. family/children/life choices one makes after the divorce are of no concern to the ex partner. OP is looking after his own children and their future and has no obligations what so ever to his ex wife's new family.", "NTA", "NTA. You’re helping your own children. Other kids aren’t your responsibility just because your **ex** takes care of them.", "NTA.\n\nAre they delusional? Your kids = Your responsibility. Their kids = their responsibility. That is the no brainer. \n\nHis kids and their kids together is NOT your responsibility, they are major AH for bringing this up, trying to milk you, trying to guilt you and putting THEIR parental responsibilities on you. Their kids are NOT your kids, do not give into their shenanigans. I hope the accounts you created for them is secure and your delusional ex and her delusional husband can not get their scaly fingers on your hard earned money.", "NTA and also the audacity and entitlement is gross.", "NTA your ex and her husband are entitled. Says a lot about your ex that she is so comfortable stealing from 2 of her children to give it to 2 others. That money isn't anyone's but yours. And she isn't entitled to child support for children that are not yours. Sounds like you need to sit your children down and make sure mom isn't stealing from them in other ways when they aren't with you. And get ahead of potential emotional abuse as the next step, if ex and her husband start to pressure your kids. Since it didn't work thru you.", "I understand their reasoning (that is: not discriminating against siblings), but it's not your responsibility. \n\nNTA", "INFO\n\nDid your kids know that there was money saved up for them to go to expensive colleges? Your daughter is 17, so definitely old enough that she should be planning where to go and knowing about finances will impact her choice. I can easily see that your kids may slack off school if they think that all they’ll be able to afford is community college.", "NTA. No way in this world you are the AH. But, you need to understand their fear. It is nothing you have to do about, but I think that they, as parents, shot their shoot and tried regardless the fact that their request was crazy. You clearly have no obligation whatsoever", "Nta - but I would seek legal advice for safety.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy ex-wife and I are the parents of a daughter who is 17 and a son who is 15. We share custody of our kids 50/50 and we have been divorced for 13 years now. Neither of us pays child support because we have equal time with the kids and we split the costs of everything (school, medical, dental, extra curricular's). I opened up bank accounts for my kids when each was born and I have saved from the get go, but around 8 or so years ago I came into some money because I was injured at work and I put that money into their accounts. As well as this a relative died 4 years ago and I was left a sum of money that also went into the accounts for my children.\n\nThe money I have now saved for them will help them tremendously in their futures, whether they go to college or not.\n\nMy ex-wife remarried several years ago. Her stepdaughter is 16, she's got a nephew of her husband's they are raising who is 14 and she has a 7 and 5 year old with her husband. Ex-wife wanted to talk to me about college for our kids and she told me that she and her husband had told all their kids that community college would be the most affordable option for them and that they would get as much help as possible but a more expensive school would be tough on them. I told her that our kids would have that option if they wanted it because I have saved a more than healthy amount for them. She asked me why I never told her sooner and I told her because I was taking care of our children and it wasn't something she needed to know.\n\nA few days after this talk she called me and alongside her husband said that they would like me to pay child support for our kids, so that they can save more money for their other children's futures. I told her I was not going to pay her child support just so she could support the other children in her home. Her husband told me I could always offer to split the money between all of the children. I told him I was not paying for his kids to go to college. I told them I only had a responsibility to my children. I told them if they wanted to save more money, I would happily take the kids more if THEY (my kids) want to spend more time at home with me. Ex-wife called me cruel and said keeping 50-50 and paying money so our kids siblings can go to college should be a no brainer for me. I told her the day I have an obligation to help her support her entire household is a day in another universe where we never broke up. But we did and she has to accept she is equally responsible for our kids as me.\n\nThey both told me I was an ass and even though I feel like I'm crazy for asking, I must ask, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta. It is good of you that you saved money for your children. Your ex is not entitled of that money. If you give it to her your own children would be less fortunate because your ex was so selfish to give the money that was ment for your children to someone else.", "NTA, though I would tell your kids if you haven't already. The 17 y/o is old enough to start planning finances and maybe you can talk about their dreams together and find what they wish to do. Good luck op.", "Nta. In what world do they think you have to support their kids? What sort of entitlement is that? \nIf you have the kids 50/50 you can just aswell ask for child support if they're asking it of you. And they are aware child support isn't for their other kids?\nThis whole situation baffles me", "If course you're NTA. That was an astonishing demand. If they want more money for their other children, they need to step it up at work and earn money. They are already saving by not having to pay 50% of your mutual children's college expenses.", "NTA. \n\nBut please speak to your children because I am a hundred percent sure your entitled ex wife and her equally entitled husband will target, gaslight and harass your children since they couldn't get their way with you. \n\nMake sure the funds you set up for them is ironcald so that your ex wife and her husband won't get their hands on it. \n\nBe on high alert from now especially when it comes to your children and their behavior. \n\nIf possible take her to court and fight for full custody and she can get visitation rights.", "NTA \n\nAnd my mind is blown . You think you’ve seen entitled and crazy then you read something like this 😅\n\nIf I were she I would have been beyond delighted that the father of my kids cared so deeply for his children that he had saved for their future and if I was in her position I’d be truly grateful that he could provide them with something I could not", "NTA, but be prepared for your Ex and her husband to be telling your kids lies about you.", "NTA but make sure your kids no it’s their money cause that will be their next move", "They have the audacity & a lot of it! They’re delusional for even asking to pay child support when you still take care of your children. NTA", "U have dond nothing wrong, just ignore them. If they keep asking. Tell ur ex to ask ur kids if they if want share their college fund with four other people. Only when you think ur kids are happy with it will you talk about it.", "Yep. OP should have kept that quiet.\n\nI wonder does OP mean “their accounts” as in accounts that the kids control, in their own names - or accounts set up *for* them, that OP controls access to.", "This.  OP needs to keep control of the money.  Pay the college bills (tuition, room, etc) directly for the first year or so.  If he passes all the money to his kids they may be pressured to give some to the other kids.", "Her ex and her husband are on different planets. Paying child support for their kids is easier for them than for you and you can afford to send their kids to college. We take no responsibility for any of their abilities.The claims they make here are absolutely amazing.", "This. I mean their audacity? Agreed, they absolute jokes.", "In this world you can't be AH. But you have to understand their fear. It's not something you have to do, but as a parent I think they took a shot and tried despite the fact that their request was insane.You clearly have no obligation", "Please try this, ask them for funds to take your kids in a vacation or something", "This one definitely if the accounts are set up so they can access.", "Agree.  OP said no so now it's time to pressure and guilt OP's kids into giving up the funds for the others.  The SF has had 16 years to save for his child and there's lots of time to save for the youngest.  NTA.", "eh idk about that. If the kids have a good relationship with their mother then you are just adding pain to the kids lives by starting a legal battle over them. Say no for sure but I wouldn't rock the boat unless the kids and mom have a unhealthy relationship", "NTA, and you already know this. The entitlement of your ex-wife and her husband is exponentially insane. How they believe the money you saved is to support HIS children is wild. As a man, I could not think of a universe where I posed this to another man.\n\nKeep your conviction here and tell them so sorry, Charlie, but nowhere in the multiverse will this ever happen.", "Hell no, don’t do this.  This allows the mother and step father to put continued pressure on the kids.", "I didnt mean he should go for full custody or anything. But if they are so hungry for money its a possibility that they try to gain it some other way. And with a text stating what they said he could counter with it", "Agree with this. They will use the kids any way they can.", "Agreed, OP, DO NOT give your kids that option.", "That's why I said the dad need to think they happy with it. When he is alone with  his kids. He can tell them not worry about feeling pressure, if they don't want to share them he will just tell EX tell they mother that has changed his mind and that fund is going only to his kids. Of course I don't expect him to do what I have said", "ah fair I honestly dont get a hungry for money feeling out of it persay. But they are in the position of we can't provide for our kids their siblings the same opportunities and are trying to figure that out. Albeit in a ridiculous way.   \nSaving incriminating texts tho is not a bad idea just incase they do decide to go full blown insane. agreed", "yeahhh nah thats all just opening a big can of worms confusion and possibly children being taken advantage of. He should jsut stick with the No. Don't give wiggle room.", "NTA. I can’t believe the nerve of your ex. How dare she? I can’t believe she can’t grasp the concept that you’re not responsible for any kids other than your own. You’re definitely NTA.\n\nJust as an aside, I hope that you’ve got a will, in case something should happen to you - it sounds like your ex would try to get her hands in anything in your estate and wouldn’t put your children first.", "NTA please protect the children's savings so she does not have access to it.", "If she and her husband have custody of his daughter and nephew, do they not get child support from his ex wife and the parents of his nephew? There’s a good two years for the stepdaughter so they should start saving money now and she could get a part time job and apply for scholarships/grants if she wants to go to a better college. Same for the nephew. The two smaller kids have over a decade to go so if they start saving now then they could have a large amount saved up by college time. I think it’s nice that parents want to help their kids go to college and pay for it but there are college loans. Depending on the major, some places will pay for the tuition in return for working at the place for a certain amount of time afterwards. Low income schools and some towns are like that. Mississippi and Alabama are two that have education programs where you agree to work at a specific type of school from a list for a few years, I think it’s only 1 but it could be more now, and they’ll pay so much of your tuition.", "NTA-Ex and husband didn’t get what they wanted from you so their next targets will be your kids. Make preparations to protect the money and to empower your children to stand up for themselves and not be manipulated. Once again-a common theme on AITA-we have straight people breeding and thinking about how they will pay for it after the fact.", "Every time posts like this come around it always blows my mind that people think they are entitled to other peoples money and will weaponize children to try to obtain it. NTA.", "NTA and how did you keep a straight face? Ex should be relieved that she only has to figure out college funds for 4 instead of 6.", "NTA. So custody of your 2 kids and expenses are already evenly split between you and your wife… she learns you have plenty of savings for your 2 kids then asks to get paid for child support to help HER kids, when you said no, she doubles down that the money you saved for your 2 kids should be split evenly with all her children? Wow, the entitlement is so high it went outside the universe.", "Nta and do like other commenters say, dont give them full.access yet, as mom might try to make them guilty and give the money away, explain youll pay for everything snd a year/w into collegue they csn get all of the money, so they dont make life chsnging decitions with just feelings", "NTA. They’re taking entitlement pills.", "NTA From now on, any time they bring it up, tell them not to duscuss it with you but with a lawyer and judge - don't participate in this topic at all ex parte.", "INFO: do you have an actual court order indicating child support is $0? If so, and if she wants support, she would have to move to modify the existing order. Unless and until that happens, why not just follow the existing court order?", "Not gona lie with that title you had me in the first half. NTA\n\nYou have 50/50 and no need to pay child support. \n\nManaging their house hold is on them, you kept your house and the future of your kids in order. That they haven't done it or been fortunate to get enough through similar chance happenings as you, well them's the breaks. \n\nYour Ex-wife should be happy that two of her kids will get those chances for education. You have made a legitimate offer of how you can support them but shouldn't give them money you know won't go to your kids.\n\nkeep an eye on those funds, explain to your kids that it is from you to them (or arrange a more direct way for it to support them) so it can't be taken or coerced from them", "Tell them to tighten them boot straps and get to work. NTA", "NTA, oh the entitlement they have!  Be careful, ex and her hubs sounds like they will bully your kids.", "The benefits of having a reasonable amount of children. You can actually provide them with decent support.", "Clearly NTA\n\nPlease make sure that your children's money is in a space that their mom has no access to, and maybe even set up a trust that parcels things out rather than giving them a lump sum, which I'm sure your ex will try to get them share with their step siblings.\n\nIf you have a family member that you trust, make them the executor of your will so that your kid's money will be protected.", "NTA\nYou are standing up to insanity and entitlement of tje first order.\n\nThis does mean that your ex wont be helping your kids pay for college. She is goingvto do what she can to even thingx out in her mind and try and spin it so its your falt. Just be vlear with your kids what you have set aside for them , what you are prepared to do. And most importantly what you are not prepared to do", "NTA in any way.", "Wow. I’m glad you didn’t tell her about the savings accounts sooner. She would have been trying to bleed you dry for years. And a judge might have felt sorry for her before she took on financial responsibility for 4 additional children. \n\nAnyway, NTA, and thanks for continuing to work and support your kids despite an injury and getting an inheritance. A lot of people might have retired early and said screw college.", "NTA. And PLEASE! Put the collage fund in your name and your name only. Otherwise, they might try to get it from under your nose.", "NTA. Keep a firm hold on the money you've saved for your children - it sounds like your ex-wife and her new family already think they're entitled to it and will use any means to get hold of it. I think that their attitude is appalling.", "I'm kinda shocked at the absolute *audacity* they have. NTA.", "NTA . You've done a good thing for your children. Your exes other kids are not your responsibility.", "NTA, obviously. The only reason your ex & her husband think so is because they want something from you & you're not falling all over yourself to give it to them. Your kids are the only ones you're responsible for.", "NTA", "NTA.", "Lol. People always think they have say about other people’s money. Tell them to eff off. Tell your grown kids what their mother and step dad are trying to do.  Let them choose who they want to spend time with.", "NTA", "NTA - you don't have to pay child support unless the court says you do. And if your splitting things 50/50 then I don't see why a court would side with the mom. Get your evidence straight though and be prepared for a custody battle.", "NTA\n\nYou have no obligation toward your Ex or her other kids.\n\nYour kids are old enough to understand this and you should politely explain this conversation with your kids.  Tell them that your money is for their benefit and they shouldn't allow anyone to guilt them into giving their money or belongings.  They need to be aware in case their mother, her husband, or the other kids start putting pressure on them.", "Of course you are NTA.  You are doing what you can for your kids and their other kids are not your responsibility.", "NTA. If you had re-married or had other children through a new relationship would she and her husband be prepared to pay you child support? No, they wouldn't.", "NTA, protect your kids and tell them they have no obligation to share their money, I'm willing to bet your ex and her husband are going to try and guilt your kids next.", "You are not responsible for her life decisions to have more children with another man. That said man is responsible for his own children with her. They are trying to manipulate you. \n\nYou do not owe them anything except to have a good coparenting relationship with the mother. They are the selfish and irresponsible ones. I wouldn’t entrust the money to your children when they turn 18. I am sure that they will try to pressure them to share with their siblings.", "NTA. Maybe your ex should have thought about this before having two more kids to add to the four she is already responsible for.", "NTA. Tell your ex wife's husband to take his hand out of your pocket and provide for his own damn kids.", "NTA you actually have given them financial flexibility for their other kids. By footing the college tuition for your children, you are relieving them of that financial burden for 2 of the kids in the home.", "NTA her and her husband has some cheek to ask you to spilt the money you saved for your children with his daughter/ nephew and their 2 children. It just doesn’t make sense. I’m getting so perplexed at peoples lack of pride and sense of entitlement and jealousy. I think the best thing to do is talk to and train your children on how to handle their finances and boost their confidence and self worth so that they won’t feel guilted into sharing the money once they have access and settle for less in life instead of going to study what they want and where they want. Let them know that it was 100% done by you and no money was taken from mum and husband and nor did it effect their household or cousin and step/half siblings so the others have no moral/financial rights or claim to it. The same opportunity you took for them the other 5 parents of those kids had but didn’t take. They are not responsible for fixing what 5 individual adults refused/couldn’t to do in 18 years and it shouldn’t be asked of them.", "NTA not your fault they chose to not wear condoms bc that's a hell of a lot more affordable than college. If they couldn't wrap it up or get on birth control then that's their own poor planning and irresponsibility. Not your problem they have too many kids to afford their education.", "NTA You sacrificed to put money in the accounts. It’s funny how people see dollar signs but not the sacrifice attached to those signs. If receiving money was effortless and easy, your ex would have all of the money that she needs.", "NTA\n\n\nBut you need to communicate with your kids about college and the money. I wouldn't tell then the exact amount either. Keep control of the accounts cause the rest if the family will pressure them into sharing the money. Or worse. Guilt them into not applying for certain colleges etc....Make it clear what is doable for them with the money you saved.", "NTA, but write down that conversation and share it with your lawyer!!", "NTA. You are sharing them 50/50. If you took them more, she would owe you child support. They should have thought about this beforehand", "NTA.   They choose to support four kids, plus half support 2 other kids.  That means they chose to be financially responsible for the equivalent of 5 kids.  It costs roughly $1000 a month to raise a child, every month from birth to age 18.  There are no discounts for multiple children.  $1000 each, every month.  Without spending a single penny on education.  They have six kids ranging from 5 to 17.  NOW is not the time to think about paying for college.  They should have planned for that before the first pregnancy.  And re-thought the education finances before each additional pregnancy.\n\nA lack of planning on your part does not make for an emergency on my part.  If I were in your shoes, I think I would sue for 100% physical custody.  If you don't, then you are probably going to end up in family court anyway to re-negotiate the parenting plan.  Because there's no way your ex won't be greedy enough to roll the dice.", "NTA", "PEOPLE - Your exes are not responsible for the children you have with other people.", "NTA and the courts will agree. You had an arrangement for years she can't just change it.", "NTA\n\nSo, she has four biological children, a stepdaughter, and a stepnephew. That's hers to figure out. You're only responsible for two of those kids.", "NTA\n\nThat child support for your kids would go right into your wife’s step kids college accounts. \n\nThey’re the asses for even thinking about asking you to pay for their other kids.", "NTA\n\nThe audacity, no wonder you divorced her.", "NTA Your kid's situation is great, she doesn't NEED or have the right to take your money for her other children.", "NTA\n\nLMFAO that's not how it works. I can't decide if they are being deliberately greedy/entitled or if they're just so stupid they genuinely believe you should pay for someone else's children to go to college. \n\nKeep being a great dad and supporting _your_ children!", "NTA - You have 50/50 and split costs for your kids. You are not responsible for any other obligations or responsibilities your wife took on. That she thinks you should make it your responsibility makes me understand why she's an ex.", "NTA", "NTA. I currently maintain control of the college accounts for all 3 kids so my ex can't access the funds. He would take it if he could.", "NTA. You have your kids taken care of, they need to take care of their other kids.", "NTA. I feel like I am in a crazy, alternative universe trying to understand their reasoning.  \n\nWow OP - your ex can really twist the mind! You are doing right by your kids and are under no obligation to do anything more", "You’re obviously NTA and your ex wife and her husband are ridiculous. Make sure that they don’t have access to the accounts through your children and also - please talk to your children and make sure that they aren’t treated differently in their mother’s home now that she’s aware of the savings. You should also send your ex and her entitled husband this thread and make them realize and the only “no brainer” here is the fact that you have absolutely no obligation whatsoever to pay her support for children that aren’t yours in any shape or form.", "Nta. These people are desperate and delusional", "NTA. You have a long-standing mutual agreement, and it takes both parties or a judge to change that. If they were wise, they could have brought this to a family court years ago.", "NTA. Your responsibility is only to your kids. Make sure you pay for your kids tuition directly or they may be guilted into sharing their money with their step and half siblings.", "NTA. Like it or not, this is one of the disparities that happens when families split up. Something you have to think about when making your plans. \n\nOP you have been more than generous by taking on the cost of college for your children, surely freeing your ex and husband up to save more for the other kids.", "NTA what the hell. Your ex want you to pay for her and her husband's children. In what universe would that ever make sense???", "NTA but I see why you divorced her..the audacity and entitlement is strong with that one", "NTA.", "NTA.  But as others have stated, make sure that there is absolutely no way that they can bully the kids into pulling that money out and giving it away to them", "NTA. The balls on those two 😂", "The audacity!!! Nta. Whew, the two of them got some balls on them. Why are there so many people in this world who have this entitlement over other people's money. It's wild.", "NTA but talk with your kids to be sure they will not be manipulated or pressured to give up their school money for the others! Be very careful", ">  said keeping 50-50 and paying money so our kids siblings can go to college should be a no brainer for me. \n\nI'm so confused, does she want 50-50 or child support? \nShe kept changing the goal posts, and finally admit to what she really want: you paying for their kid's collage. \nWhich you have no obligation to do, since I'm assuming you're aren't in their life in any way. \nNTA.", ">  said keeping 50-50 and paying money so our kids siblings can go to college should be a no brainer for me. \n\nI'm so confused, does she want 50-50 or child support? \nShe kept changing the goal posts, and finally admit to what she really want: you paying for their kid's collage. \nWhich you have no obligation to do, since I'm assuming you're aren't in their life in any way. \nNTA.", "NTA. Protect your children’s money. I highly doubt anything would happen if they tried to pursue legal action. With how long you’ve been divorced it is stupid to now ask for “child support” even though they just want it to support their other children. The audacity of your stupid ex-wife and her husband is astounding.", "NTA. How could they even ask you that? Everything you told them was right and fair", "hard NTA - agree with everything others have said. Watch the money and make sure your ex cannot touch it", "NTA when someone decides to have so many children, it means fewer resources to go around for each child, and on some level the parents are ok with that. It’s up to parents to figure it out.", "NTA\n\nThey are delusional to even think proposing the idea that you’d help support their Brady Bunch household is something you’d agree to. \n\nYou are doing MORE than your fair share and no, you weren’t obligated to tell her about those savings accounts.  It’s something between you and your kids. \n\nThey have some HUGE balls to come to you with that.", "NTA. They have lost their minds. Please speak to an attorney about how to handle the college funds so your ex doesn't have any access to the money.", "NTA. Not your issue.\nEx and hubby are TAs for having the audacity to ask and getting upset with you because you said no.", "I can’t believe what I just read so I really can’t imagine how you felt when they approached you with their outrageous request. \n\nNTA", "NTA i see why you divorced her…", "NTA\nTheir finances are their business. Why would you pay support that you’re not obligated to pay just subsidize their daily. \n\nYou can do it if you want but there is absolutely nothing wrong with saying no to such a presumptuous request", "NTA. \n\nMoney you saved for your children is not theirs until you sign it over to them. But your wife and her husband are going to attempt to guilt your children into sharing that money with their kids. Also can predict that they’ll want his kids to live with yours so that expenses can be “shared.”", "Make sure the money is spent on them, they will probably try pressure the kids into giving money to the others, Honestly dunno whats going on in ur ex and her partners head to be honest.", "I say this all the time in so many contexts but lesson number one for parents is that your kids are your fucking problem and yours alone. Full stop. OP is handling stuff for his kids. \n\nI’m a dad too, not some cynic, but the quicker you realize that, the better you can navigate how challenging the whole thing is. Unfortunately this is one of those things that can happen post breakup is the new relationships won’t be even financially but if both are doing their part for the kids, that’s just life. Sorry OP. Hopefully this doesn’t poison everything with your kids’ mom and stepdad.", "NTA. You have a savings account for both of your kids, which sounds like you have more than enough for them to go to college. \n\nPlus, you still buy them what they need w/o paying child support. But, I wouldn’t have told her that I had money set aside for YOUR kids future. Cause now she’s going to look to you to pay child support and will probably take you to court. \n\nI’m not saying that you had to lie to her, but when she brought up college. You could have told her that you’ll foot the bill for your kids and she didn’t have to worry about it…not saying that would have made her suspicious.", "NTA\n\nYou saved money for YOUR kids. They’re all kinds of wrong here.", "NTA but they will now start guiltripping your kids into giving them money for their other kids \"Because We're Faaaaamilllllyyyy\"\n\nUnfortunately you need to take control of your kids funds and make it IMPOSSIBLE for your ex to access them AND for your kids without your approval as well. I know it's extreme, but it is very likely all this will happen behind your back. \n\nYou also need to update your will so that your own wealth goes to your kids as a trust and not outright because your ex will 100% try to get her hands on this as well.\n\nThere is a reasonable solution that means, as you are fortunate and can cover your kids tuition and start in life, they won't have to and can redirect money to the other 4 kids. But expecting you to fund their brood? Nah...", "NTA the lack of shame from you’re ex-wife \nI fully expected this to be a dead beat dad story not a father who actively pays and gives money for his kid’s future and a bitter and entitled mom", "NTA. OP you need to manage the fund for them as it isn't in a trust per say and no beneficaries are listed so, if you want to ensure that the fund only goes to your children, you need to have a chat with them to ask how they would like to receive this money, it could be:\n\n1. Used to attend a good college or,\n2. Put a downpayment on an apartment, house etc\n3. Or in my opinion, invest in good low to mid risk stocks and shares in a ROTH IRA if you're in the US and take advantage of the tax wrapper ie you don't get taxed on the purchase of shares or the dividends.\n\nIf you're able to use some online stocks calculators, you can show your kids just how much dividends they could receive 15-20 years in the future esp when it comes at a time when they will need to help with a family of their own.", "NTA…I cannot even fathom how your ex wife feels that you should pay child support for her and her current husband’s children?  Because that is essentially what she is asking.  You are in no way responsible for her household other than the care of your children, which you are providing for.", "NTA, they wanna leech. If the situation was you asking for more child support from them to pay for kids they never had created, they'd probably laugh in your face or curse you out.", "NTA your wife and her husbsnd will bully your children into giving up their money to their step siblings. We see it again and again on here from the children's point of view, who are being asked to give up their money and from the step parent bullying the other parent into giving the money to their child instead. Make sure that they cannot do it, especially if you should pass unexpectedly.", "Very clearly NTA. Ex-wife and husband are entitled AH.", "NTA\n___\nNot only are you in it the ass here, but I also did the math\n\n>we have been divorced for 13 years\n\n>and she has a 7 and 5 year old with her husband\n\nI'm not asking you to share more than you want, but the math doesn't add up so considering BOTH of them tried to guilt you tripple-fuck them.", "NTA, and honestly should have been more harsh in conveying how dumb that idea is. I would have really gone hard on this new husband about not being a bum and being able to take care of his own wife and kids. It is amazing how many bad parents think they are good ones. As soon as they would have let that idea out, I would have laughed and laughed until they just hung up.", "NTA. YOU ARE 100% CORRECT. You are not responsible for any kids except your own. Take this as a lesson and know who your dealing with. The shear audacity and entitlement is mind blowing. \n\nDO NOT DELAY:\n\nMake sure that your money goes into a TRUST for your kids, MANAGED by someone other than your ex if something happens to you before they reach the age of majority. IF YOU DON’T SET UP A TRUST, their Mom will spend EVERY DIME on her NEW FAMILY.", "NTA, at all. and please, PLEASE OP, make sure that the money you’ve saved for your kids is secure and you TALK WITH THEM about it. they are 17 and 15 so they’re old enough that you can explain to them that this money is for their future and under no circumstance should they give it to their step dad or mom. because they absolutely will take advantage. explain to them the possibility that they will be pressured and they shouldn’t budge.\n\ngoodluck to you!!!", "... why are they not thankfull that 1/3 of the college cost of all their kids is covered my you? I mean, if they only planned in 50% for the two, everything helps. \n\n\nEspecially considering the ages - 17, 16, 15 and 14- the 17 and 15 year old being covered should be a relieve.", "My first thought was since your kids are 17 and 15, you and your ex should have had the college money talk sooner.  And she should have known that you put money in savings for them.  But honestly, I'm glad you didn't.  Because I feel like from how you presented her here, if she knew about the money it would be gone already.\n\nYou are absolutely NTA, and as others have suggested move the money so your ex can't access it, or coerce your kids to take the money out for her.  \n\nThey are completely crazy for asking you to pay child support for children that are not yours.", "NTA.", "NTA  \n\nThe amount of entitlement here is crazy. You need to find ways to protect that money and make sure it gets used for what you saved it for, assuming your kids want to take the college route.  \n\nYou have absolutely zero responsibility for kids that aren't yours and the nerve they had to even suggest this blows my mind.", "NTA. The audacity of your ex-wife and her husband is unbelievable.", "NTA, da fuq? DO NOT take this away from your kids and make sure they’re not guilted into sharing.", "NTA. They are out of their minds. Make sure only you have access to the savings.", "NTA! \n\nThis isn't the first post where an ex tries to get money allocated for other children, and it blows my mind that there are so many people that think this way. Make sure that you are in charge of your kids money so mom isn't able to access it, and don't share any further financial details with the ex.\n\nThe gall of some people.", "NTA. You were preparing for your children's future. You're not responsible for their half-siblings or stepsiblings.\n\nI see why you didn't tell your ex sooner about the college funds for your kids. Normally, I recommend that co-parents who are no longer together have these conversations so they can remain on the same page, but when her reaction is to use this information as an opportunity to get money that you don't owe, that's icky on her part. It baffles me that her husband would not only go along with this, then suggest that you split the money you saved for your children between all six of their children (including two children you aren't related to and didn't previously know or raise). She really should have had the conversation with you about college for your two kids separately, because that's juat good co-parenting teamwork, and it's her fault that she didn't do that.\n\nIt sounds (just my opinion) like they're embarrassed that some of her kids will have different opportunities than they have already told them they can provide, and they're trying to save face with all of the kids as best as they can. Asking you to pay more than your fair share is not the way to do that.", "NTA, and document everything. Sounds like she may consider taking you to court for child support. Although I don’t think any judge would grant it given that you’ve been divorced for so long and that you haven’t paid prior while being a consistent father to the kids, you need to document these conversations so that she has 0 chance.", "NTA.  Of course it’s a no brainer to support their kids, because you’d have to not have one to think that’s smart.", "NTA -- fine not to pay child support if not court ordered.   Although in some states, even if you have kids 50/50, if your income is much higher, you can be ordered to pay (may not be the case here).", "NTA, you are taking care of your kids. Child support would be to support your kids, not their other children. They are delusional. \n\nMake sure the kids don't a tally get the money aa they may come under pressure from the stepfather and mother.  Pay the tuition bills yourself.", "NTA\n\nTell her to take it to court. I’m pretty sure a judge would laugh her back out - you share 50/50 custody and you each contribute to their needs.  There’s zero reason for either of you to pay child support. \n\nStart keeping track of expenses now though. Ex is going to stop paying for her children at all - she’s going to expect you to pay fully for everything for them now so she can save money for her other kids. Keep documentation of everything you pay for - so if she does decide to waste time and money at court you will at least have evidence.", "NTA. Tell her to take it to court if she wants child support. Which she won't, because what she's asking for isn't child support. That's just you giving them money.", "Info: what’s your regular income, barring inheritance etc as compared to hers?", "The part that really made me laugh is the husband saying you should split the money you saved with his children… NTA", "NTA, but time to talk to a lawyer and set the custody agreement in stone  and make sure  that your ex isn't  filling  your kids heads with lies.   Take care , you are good dad.", "NTA. I do find it strange that the OP didn't let his ex in on the fact that he was saving money for their children's education all during the marriage. However, she can't expect OP to contribute any funds to children that aren't his. What ever happened to owning responsibility...you made your bed, lady...now lie in it.", "Nta", "NTA. Not your circus, not your monkeys. You have absolutely nothing to do with their children", "NTA...just insane she would think u have to support her other kids.", "NTA", "NTA, well done for planning so well in advance to provide for your children's future.", "OMG they are so entlited.\n\nBe careful with this money and see if they don't try to convince your children that they have to split that amount. So NTA!!!\n\nHope updates!!!", "NTA: talk to your bank about setting it up so they can only withdraw it for educational purposes for them and them alone.  I can see this going really badly in a couple years.", "NTA what the actual fuck? The audacity of these people. I would struggle not to unleash the snark. “Of COURSE I’ll pay for your husband’s kids too, while I’m at it how about I buy you a new car and pay off your mortgage, maybe take all of you on a nice vacation too…”", "NTA. Heck, she has more money not having to pay for her first two children to go to college. She should be happy about the funds for them not try to bogart them. Life is never fair. There was no money for my sister and I to go to college. My stepmother got money when her Mom died and paid for my two younger brothers to go to college. I was happy for them. People get so wrapped up in fairness over money. Nothing is fair, it's just how things shake out.", "NTA - Your doing you half for your kids & then generously thought about University & after for them...No way is the Ex entitled to Child Support & her husband is a grub even trying to weight in what is none of his business.", "INFO: in most states, even if you have 50/50 custodial time, there's still an analysis for possible child support, which compares the parents' respective incomes and what they'll be each be providing for the children. How does your income compare with your ex-wife's income, both historically and currently? If there is a large disparity, your wife may have grounds to seek a modification of your parenting plan.", "NTA Their children aren’t your responsibility.", "NTA. Everyone has the money aspect covered. I would also have an honest discussion with your kids about their living arrangements, that sounds like a lot going on in their mom’s house, and they may want more peace and quiet in their last years of high school. Maybe they love it, but just to be sure.", "NTA. You only have an obligation to your own children. Her new husband should be taking care of his, not you.", "NTA.", "NTA, and I hope you didn't tell her exact amounts.", "YTA for not telling your ex from the get go and blindsiding her now. It messes up the dynamic with your kids and their household by omitting something so important about kids you share responsibility with", "Yeah it’s only a “no brainer” for them not for OP and his kids.", "I’m shocked her husband would even bring it up to OP.  How embarrassing.", "Right! If you could see my face when I read it.", "The entitlement is unbelievable.", "Right? I spat out my tea at her saying \"no brainer\" 🙄", "my thoughts exactly.  Start prepping your kids for this to come because you know darn well the mom and ex, and even the kids will start guilting your kids.\n\nProtect the money. perhaps a trust fund for each where until they are a certain age, they don't have access unless it's just for college, or you approve of the withdrawal.  The kids may not like this but at least the money will be protected and it takes the burden off of them.  I'd also let your ex know that the kids money is protected so the kids can't give her money.  Start having conversations with your kids about money and manipulation by others, even consider counseling because this is a heavy burden for them to carry", "Agreed, OP you need to make sure that a) your kids are not forced to choose cheaper colleges and b) any money you pay for their college goes straight to the college from you and not via the kids. NTA.", "OP needs to change it to a 529 account where funds are only available for applicable college expenses. It allows for leniency in college but also ensures any large transfer has to be approved", "100% this. Ex and get husband just sounds like complete money grubbing ahs", "Unfortunately for her and her children, they are not your children.Your children are your children. It's not your duty, so the discussion is over.", "[removed]", "It seems like the money you save will be the only support for your children's subsequent education.So that you can push it as far as possible and keep it safe from being abused by your ex. It's good that you are putting in so much effort.", "I agree with your comment.  However, if they are in the United States, \"child support\" is just another name for alimony.  The money you pay in \"child support\" doesn't help your children, at all.  But mom has expensive purses she throws away every week, a new car every three years, etc.   And the kids can't afford to pitch in for a discounted school trip to another state...", "Lol theyre shifting the definition of Child Support. They think it means that they can take the Support and apply it to whatever Child they want", ">Idk why reddit has been full of stories about entitled people lately.\n\nTis the season?  Christmas can bring out the best or the worst in people.", "Ikr? A more sensible argument would be \"so that means I don't need to pitch in, since they are cared for\". Which still might be wrong, \nBut \"since you have money saved, you can now also pay for my other kids\" makes no sense at all 😵", "I have that set up already! I planned ahead.", "If she wants child support, she won't ask you. she asks the court There she can try her luck.", "The money is already protected.", "That is not entirely correct (at least not in my state/county).\n\nChild support is calculated via a mathematical formula in the dissomaster and *several* factors go into it, timeshare is only one of them. Income in both households goes into it as well, so if one parent earns significantly more than the other, that parent could receive child support as well, even with an equal timeshare. \n\nI’m not sure how one time payments like an inheritance and that insurance payment would factor into it; maybe not at all. In cases where a parent receives work bonuses for example, the other parent can file a form once a year or something like that, so that those bonuses are being considered as well (I live in an area with a ton of tech companies, where the bonuses that many employees receive can be really substantial).", "NTA her and her husband has some cheek to ask you to spilt the money you saved for your children with his daughter/ nephew and their 2 children. It just doesn’t make sense. I’m getting so perplexed at peoples lack of pride and sense of entitlement and jealousy. I think the best thing to do is talk to and train your children on how to handle their finances and boost their confidence and self worth so that they won’t feel guilted into sharing the money once they have access and settle for less in life instead of going to study what they want and where they want. Let them know that it was 100% done by you and no money was taken from mum and husband and nor did it effect their household or cousin and step/half siblings so the others have no moral/financial rights or claim to it. The same opportunity you took for them the other 5 parents of those kids had but didn’t take. They are not responsible for fixing what 5 adults couldn’t do in 18 years", "It is already set in stone.", "We had separate finances while married. That was how she wanted it because she did not want to be reliant on me during our marriage as her mother was on her father. So outside of shared bills, we didn't really talk money and that is just how we were.", "I make more but not significantly more to pay child support. I'm not even close to the threshold for that.", "[removed]", "My sons Grandmother left a substantial amount of money to my sons dad and he allocated a large amount for my son to get a start in life which included covering college and money left over for major expenses including a down payment on a house in the future.  My ex would give my son essentially a payday twice a month for my sons needs and it was adjusted based on my sons expenses (when he moved into an apartment etc) but only allocated large amounts based on need such as tuition, etc and it worked out well while my son was in college.  This is an excellent option and therefore is a good way to maintain control of the money.", "For all four years, just to be safe. Also, he needs to make sure his side of the story gets to his kids. I do not trust this woman not to poison his kids against against him.", "Yup. Not his kids, not his problem. But his kids could be pressured, so either keeping control of the money or putting it in a trust is a good idea.", "[removed]", "I hope the latter..", "[deleted]", "They can't have their own accounts til they're 18 so it would probably be joint in OPs name and theirs.", "Bullshit.", "The amount of child support I received wouldn't even pay for school lunch forget about a purse... I literally didn't even bother checking my child support card every month, just hoped there would be money on it for Christmas.... And btw, that's the same story with all of my divorced friends.  No one's living high on the hog off child support!", "She doesn't want to say that because then our kids would know I contributed everything and their mother nothing, so she wants to be able to take the credit but knows what our kids have will be way more than the other kids in her household.", "Imagine op wins full custody and the mother is the one paying support hahahaha", "Good to hear. I wonder if your kids are aware that their mom and stepdad are doing this. I would hope not as they seem to be doing a good parenting job until now.", "Idk your specifics and if the relationship between you two is amicable, but I would advise to lawyer up in case they decide to go to court and try something. I don't believe they have a case, just to be prepared.", "This is a bizarre and illogical request by your ex and her new husband. You are 100% right saying that it’s not your responsibility to finance education for any other children. There’s nothing wrong with going to a more affordable community college BTW. \n\nMake sure you’ve also changed your 401k beneficiaries to your children if you have a 401k and haven’t changed them already. NTA", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Excellent suggestion", "[removed]", ">I think you should consider setting up a trust or account so that your ex-boyfriend doesn't have access once your kids are in college. Regardless of your feelings, she may try to force your children to give her that money.\n\nCopy-bot.", "Exactly. A trust administered by someone like a neutral attorney who would be immune from bullying.", "Or he pays child support but stops paying for half of everything.", "Considering that the mom didn't save for the kids she has with op, I can't see her as a good parent she wanted the kids to go to a public school, and never through on saving for the kids", "[removed]", "And if OP wants to support kids who are not his, he can also choose to support his neighbor's kids or his kids bestfriends, why specially his ex-wife's kids? Paying for education sucks for everyone... His ex-wife is so entitled!", "I dont think op wants less time with his kids, since thats what it would mean, pay more for having them less time", "Nothing wrong with a public school if it's good that is. But ok I get your point.", "She did save, they did save, but it was not a large amount.", "This. The children do not need to be given that option. Let them work multiple jobs if they have to support his children, but do not let them think they have a way to make you pay for his kids. I can see why she is your ex, damn Skippy just stick with a hard NO.", "Well obviously you shouldn’t have told the ex that you have money saved because I’m guessing they won’t contribute that dime towards community college. No NTA but don’t discuss further with them. Do discuss finances with your own children and help them learn to budget since they won’t learn at their mom’s house", "Put a utma designation on the 529 or brokerage account so they can't be used for other people", "NTA - what obligation do you have to children that aren't yours? Ex-wife is delusional. They were free to save their own money and chose not to. Why would you pay child support for children that are with you 50% of the time? That doesn't even make any sense. Seems like your ex is just grasping at straws at this point because they have more children than they can afford.", "NTA. Ex-wife is delusional", "NTA\n\nBut start educating your kids on how to manage their funds asap because otherwise Mom and Stepdad will pressure them into sharing.", "Umm doesn't your ex realise that you are helping her in a way? Like you basically going to fund your 2 children's college if they choose to do so, so 2 less expenses.\n\nNTA at all, it's just a fact of life in blended households that some kids might get different experiences.  \n\nSeriously my half siblings got flat screen TVs/gaming console and a computer all while they were single digits & never had to get a job as teenagers.  😂 I had three causal jobs plus high school at one point and had to fund some of my items.  It's just the luck of the draw, you have no obligation to fund for the other kids.", "NTA. This is pure financial manipulation via emotional blackmail. Don't fall for it. The audacity. I am sorry that you are so gaslit that you didn't see this for the obvious manipulation that it is. If I were you I would be reevaluating every interaction with those two.", "NTA\n\nThe audacity of some people… I have an idea. Tell them you are planning on having 10 kids with 10 different woman and you are now expecting THEM to pay you child-support. See how they react to that", "NTA. What is it with all these greedy people wanting their exes to fund their new families?", "Nta. You're a good father. You even offered to take your kids more which sounds like a reasonable solution to me. It's not your job to provide for children who aren't yours. You're doing a great job!", "The fact that they had to audacity to ask you for money means they’ll bully your kids into getting them your money. NTA. Please tell your children what occurred. They’re old enough to know what’s up.", "Assuming this story is 100% true, NTA\n\nTwo suspicious parts: 1 - the idea that they “told all their kids” is fishy since two are so young, and 2 - divorce decrees usually include a plan for who pays/is responsible for the cost of secondary education. It seems unlikely there wouldnt have been a clause about that, and based on the 50-50 split down the middle it would probably have been the same thing, so why would there never have been a convo in 13 years about how much the two of you were saving for college and how you were going to work together to finance the balance?", "What is your child support arrangement with the courts? If you've truly got a 50/50 split with time, and you're saving up for your own children's college, it's reasonable that you wouldn't pay child support. Get a court agreement.\n\nAlso, assuming you're telling the truth, NTA", "INFO: should you have been legally paying child support all along?\n\nReason I ask is, 50/50 doesn't automatically mean no child support is owed. If there is a big disparity in your incomes - if she stayed home to raise your kids for a couple years and her career took a long term hit - then it's quite possible you *should* have been paying some kind of child support, and she just hasn't held you to it before. If she can show that in court, you may be ordered to pay anyway, and possibly pay back support for the last thirteen years. So, rather than judge you asshole or not, I think you should consider whether your ex would succeed in legal proceedings over this and, if the odds are high, maybe paying child support voluntarily for the next three years is the cheaper option. \n\nIf you have comparable incomes, disregard.", "Call a lawyer. If there’s significant income disparity between you and your ex-wife, you may be on the hook for some child support.  In the United States there are formulas for this it’s not an emotional question. None of this has anything to do with the other children, it’s about the household in which your children spend 50% of their time.", "Nope. NTA 50/50 custody and she has the gall to ask you for child support for her step kids who are not even related to you. 😂 \n\nKeep all documents of her trying to make you pay for her step kids. \n\nThen sit your kids down and let them know you have a college fund saved for them. Let them know it was only saved by you and your ex wife did not help. Tell them that they are not required to share this college fund and if anyone tries to make them to let you know. And that your home is always open to them if your ex-wife and her husband become hostile. That you will go to court and redo custody if they create a hostile living environment. \n\nIn short reassurance that they can choose what ever college they want and that money isn't a problem. Also that if their mom decides to try to pressure them to share they can go to you to shut it down.", "NTA. Be very careful that the money you've saved doesn't get to the other kids somehow.", "OP, you need to speak to the lawyer, ask the lawyer the risk. the possibility what will happen because you have underage kid", "NTA, you don't have the responsibility to give them the money you saved for your kids. Also if you haven't made a will yet go to a lawyer and make one. If something were to happen to you the most likely outcome is that your ex will keep all your children's money for helself.", "NTA. \n\nAnd you should speak to your kids about it directly. \n\nYour ex is out of line asking for extra to support her other kids that aren't yours. Though obviously she can probably foresee future problems of resentment from her/her husband's other kids if they don't all equally opportunities in life. It's sounds like she's trying to be a good mum to all her kids, so maybe don't be too hard on her for asking either.", "NTA. Tell her to take you to court.", "NTA, but OP needs to contact a custody lawyer. I would be expecting a summons from court soon for child support.", "NTA - but, if you’re in the US you need to talk to your lawyer, and you shouldn’t be discussing child support or your financial situation directly with your ex, ever.\n\nYou already have a custody agreement, and you already seem to know that there’s a reason neither of you pays child support.\n\nYour ex is making suggestions that would not ever fly in court, but she may be doing that to provoke you and gather information to build a case for a revised custody agreement and request for child support.  If her financial situation has drastically changed (don’t assume she’s telling the truth here) she could end up prevailing.\n\nYou need a lawyer.  This has nothing to do with being the AH, it’s a matter of what your rights are.", "NTA", "NTA\n\nMake sure you fullproof that money, so it goes where it's intended. Talk to a lawyer or a financial advisor.\n\nYour ex might convince your kids to share with their half-siblings. \n\nYour kids are young adults. They are old enough to understand the situation. Have a talk with them and explain that you saved money, with what purpose, and that's only for them to use because they are yours.\n\nIt would suck if your ex brainwashes them and your money ends up elsewhere.", "N", "NTA. One place I know to go is Reddit. It’s where people have all the audacity. You don’t owe your ex-wife taking care of her children. Either she needs a better job or her husband does so she can afford to save for their kids. This isn’t your problem or responsibility.", "NTA. Child support is for YOUR KIDS, or WOULD be if they spent more than 50% time at Ex' house, and the only way step/halfsiblings benefitting from child support money from the other side, is okay, is by general household expenses (heating/rent/food) that the child the money is nominally FOR, also benefits from, being paid for with it. There is no logic in why you should pay for your ex' children's education. She presumably CHOSE to breed and to take in a Foster kid, she could have considered if She&husband can afford to provide those kids the education she wants for them, beforehand, and she can still save to give them SOMETHING, and manage their expectations of getting their education paid for, and maybe even instill in your children the family values that would make them want to help pay for their siblings' education once they are done with their own and have well paid Jobs and no debt.", "NTA. Please don’t share the amount of the college funds with your ex. Money brings the most evil above in a person", "NTA, it amazes me how many people and young people think that others need to help kids that aren’t their go to college. Wow", "Man, you better stop worrying about what stupid people think.  You have done what a father should. Good on ya, boss.", "Nta", "50/50 custody, and she still wants you to pay child support so she and her husband can have money for themselves. Very mature of her /s\n\nNTA\n\nIf anything, she should do what you are doing and save for your kids, too, and stop being so entitled. She isn't treating all of her kids equally. Look into seeing how she treats/treated the ones you two had together. She may be traveling them poorly", "NTA don’t share anymore info about your childrens accounts. There’s no child support fo 50/50 custody, that’s ridiculous", "Definitely NTA!!!\n\nWell, it would be admirable if out of the goodness of your heart, you chose to help them out you have no financial obligation towards those other children that are not yours. The fact that your ex-wife, and her current husband would try to belittle you and tell you that your kids should go to community college so they can split the money between the other kids. Is very manipulative, and a testament to the fact that they did not consider their children’s future in advance. You only have an obligation to your direct children and if you have 50–50 custody of them and are not required by law to pay child support I would not waste my time on it. \n\nI would strongly recommend against letting them try to pressure you do use the money that you save for your children in a way that they deem necessary.\n\nThere’s a quote that comes to mind for this \n\n“Improper planning on your part, does not constitute an emergency on mine” \n\nI wish you the best and I’m sorry to hear that from what it sounds like that they tried to gaslight you on this.", "NTA don’t let them anywhere near those accounts & you may have to worry about them trying to convince the kids to share money. No wayyyyyyy.", "NTA.", "I can't believe how many stories like this are out there.  I really feel for the parent that has to explain to one kid how they're not going to get what their half -sibling gets...and that it can drive you to desperate requests.  But the complete expectation that a 3rd party would pay your kid's way through college is NUTS.", "NTA - you know that, but we're happy to reinforce. They are being outlandish to suggest that it is your responsibility to support their other children. I would take the advice here and make sure accounts are in your name and also watch for other strange financial games. We ended up getting medical bills in a similar situation for children that aren't ours, it's mind boggling that people feel entitled to these things!", "NTA \n\nYou have 50/50 of your children. You support them on your time, she is supposed to support them on her time. It’s been that way for years and no child support was ordered.", "NTA it is not your responsibility to take care of your ex-wife’s other children.", "NTA. I’m glad for you your ex is your ex. Congratulations on the wonderful accomplishment you have made in ensuring YOUR children are taken care of financially in the future. I wouldn’t give her a penny cut in half if it was me. Those kids are her new husbands responsibility. Period. If she wants to save for her other children that should come easily now that she no longer has to worry about paying for 2 of her kids schooling because their father has made prior arrangements. Take her to court get everything in writing. Fortunately there won’t be a long window of opportunity for her to collect on your daughter (17). I hope your ex wife learns quickly that child support from you for your children isn’t a career path or an alternate income source to care for her new family.", "Ensure your name is on the accounts and they’re locked. Do not give the kids access and contact a lawyer.. immediately.", "NTA - this reminds me of the horrible 'what's mine is mine and what's yours is also mine' attitude. Why should you have to subsidise someone else's kids? Good on you for protecting your own childrens' future.", "NTA. I would talk to a lawyer to make sure your protected. Also, make sure your kids aren’t pressured by their mom to give up part of the money you’ve saved.", "NTA. What's the deal with all these people who coparent with an ex and have other kids with a different partner feeling as though the children they had with someone else are also the responsibility of the parent they had the other kids with? I see this a lot on this sub. A mother or father asking if they're the asshole for not paying for their ex's other kids with a different person, too. Or if they're the asshole for asking their ex to include their other kids, too. No. That's not how it works. I have a half brother. Neither of our dad's were involved in our childhoods much, but his dad was a bit more than mine. I never once felt entitled to like, join them on any sort of outings they went on, even if it was something I would have liked to do. If his dad had been like, well off or something, I never would have expected him to spend large amounts of money on me or pay for my schooling. His dad actually paid child support, mine never did, but even with that, I never would have expected my mom to spend that money on me. I mean, yeah, she'd use it for groceries I also ate and rent in a place I also lived in, it was just a by product of her using that money to support my brother. When he started getting disability and had some of it garnished since he rarely paid child support, it was actually a decent little chunk from the back pay his dad got, and then he got a check every month, too, but it wasn't all that much. Mom used it to get my brother a car, which I was perfectly fine with. I didn't expect her to also buy me one. Or for my brothers dad to buy me one.  That wasn't my dad. That was just some guy my mom dated for a bit years ago. Not like he was my step dad. It's one thing for your new spouse to like, include all the children since they're now a step parent to the kids, it's another thing entirely to expect your ex to include all of your children.", "NTA. So where is the part where the ex wife has been also saving college money for her first born biological children? Where is the part where your children are compensated for having to have less than a mother because she's too busy playing stepmommy and half mommy? \n\nWith your oldest turning 18 soon and the other getting closer to college age, I say go ahead and start a new child custody and child support agreement. Stipulate that she have to pay for exactly HALF of college in addition to half of all the other wonderful expenses that come with high school and teenagers. As a matter of fact, go for the jugular, ask for full custody. \n\nShe had a good deal and she's going to fuck around and find out. She will absolutely balk at having to retain an attorney and hash out finances this late in the game. She doesn't get to lord over your bank account. You have a nice little piece of paper called a divorce decree that says she can't. \n\nCall her on her bluff. After she sees how much it's really going to cost her in court fees, she will beg you for a redo.", "NTA. BUT it is an issue especially if you live in the states, were suppose to pay already and don’t, ect. Your own children are 17 (last whatever months anyways cause at 18 they no longer qualify for CS unless they are still in HS and it doesn’t sound like this one will be. So courts shouldn’t do anything for her. As for the younger son though. No idea. Best to hit up a family lawyer to make sure your kid’s future stay the way YOU and YOUR kids to be. GL! Hope you don’t owe her. A good lawyer on your side with documentation showing YOU will provide with said savings for college SHOULD put a gag order on you to refrain from spending said money (just to pacify her) and NOT pay a single cent to her in the process. The kids are should be too old to be financially dependent further with monthly CS to ex when no previous arrangement was ever made till now. This should go in your favor but really dig around for a good lawyer on this.", "NTA", "NTA  you are under no obligation to pay for the college education of 4 extra kids who are not even your own.  If they failed to save money for their kids, that is on them, not you.  You are only obligated to pay for your own two kids.  And if you are already splitting everything 50/50 she would have a tough time trying to take you to court to get you to pay child support.  Also the reasoning for her request to you to pay her support is ridiculous and no judge in their right mind would order you to pay child support so she could use it for kids that were not even yours.  Child support is for money for your kids, not for other kids.  She is laughable.", "NTA. Definately talk to your kids. \n\nI'm wondering if you ex's the neighbors might expect you to pay for their kids and if you're going to do that feel free to pay for my kids I mean you have no responsibility to them either. \n /s\n\nI would love to see them try get a judge to change the custody agreement to make OP do this. The judge would have to call a recess he'd be laughing so hard. ( I don't really want OP to have to go to court for this ridiculousness I just believe it would be funny)", "NTA. Your kids are old enough to understand and if I were you I talk to them about what's happening before their mom tries to bend the facts, they are even old enough to choose stay with you if they want an ease the financial on the stepfamily .", "NTA.\n\nThat's bold of them to ask, lol. They're the crazy ones.", "NTA. What delusional universe do they live in?", "Mostly NTA. \n\nThe very small TA is not talking to your ex sooner  - the reveal day of your children having this money has a risk of creating conflict between them and their half-siblings, so some thought needs to be given to how to manage that. A good co-parenting relationship needs that sort of awareness to keep everyone happy with each other.", "NTA, I agree with you you are not responsible to support her children with her new husband who has alot of nerve to think you should. You guys decided that you are responsible for the kids when they are with each of you.    She has alot of nerve.", "NTA\n\nYou don’t pay child support for your own children because you have an equal amount of parenting time with them. So what she’s really asking is for you to pay child support for children who aren’t even yours.\n\nYou have every right to say no, and at the ages your children are there is no judge who is going to strip you of parenting time against your will and put you on the maximum amount of child support for at most 1 year for your eldest and 2-3 for your younger child.\n\nIt’s understandable your ex is struggling, but none of that is your responsibility.\n\nIt would be good for you to talk to your children about the money you have saved for them being for their use only and they are not responsible for covering anybody else’s expenses. It would also be good form to get them in front of a financial advisor who can help them make their money go further and give them realistic and practical ideas about what money can and can’t do, and how to protect their assets.", "NTA, they tried to hoodwink you!!", "NAH as far as I can see. That said, the Court might feel that you have been hiding assets which would have affected the awarding of child support regardless of the physical custody being shared 50-50.", "NTA and you seem to be handling this better than I would. \n\nIf my ex asked me for extra money to support her step daughter I'd explode at her.\n\nStick to your guns, she has no right to ask you for money now, especially after years of 50/50 custody and no payments made", "NTA. And agree with the top comment that your wife and her husband might bully your kids into sharing. I would talk to your kids - they are old enough to know what they have for savings and they should know that you saved this for them and only them.", "We think you should pay us a regular allowance? No. NTA.", "NTA, or they give you full custody or they go to hell, you're not raising children that aren't your own.", "You didn't even need to ask-  NTA", "NTA, obviously.  People certainly get greedy when they smell money.  My ex called and wanted to stop child support so he could save for an engagement ring for his girlfriend.  I had full custody and received enough child support to pay for day care.  My ex was outraged that I refused to let him stop paying support.  I heard the same nonsense bout me being selfish.  I told him to take me to court if he wanted to change the amount the court had set, but since he was making more money than he did at the time we divorced, his child support payments would have gone up.", "The ex wife must realise OP isn't running charity! How entitled she is!", "NTA at all, you only have responsibility for your kids. It’s unfortunate that their siblings will not have the same help at college but that is in no way down to you to contribute to. It would be one thing to decide that your shared kids are taken care of so her and her husband will focus on the other children (though she should be contributing for them) but absolutely not reasonable to be expecting you to pay for her other kids/step kids", "NTA, but ex and new hubby are opportunistic AHs. If she wanted you to fund raising all her kids, she shouldn't have broken up with you! In what universe are men expected to fund whatever blended families their EX takes on??", "NTA at all. They are being unreasonable and sounds like they want to take advantage of you.", "Nta. You're doing your best your kids and thats all you need to do. If they need more money for nephew, and their kids then they can get side hustles, have the kids get part time jobs when they are of age to, etc. Your custody is fair. Split your kids down the middle. They see you have money and want to take advantage of it.", "NTA, it’s a wild suggestion, but you should have communicated with your ex about the college savings, your kids are old enough that college planning is in full swing and you should all be on the same page about what is realistic for them.", "No", "NTA. Make sure there are limits on that money just for education, and another person is watching over that money for them should something happen to you.", "Oof thats quite a yikes. NTA", "NTA and it’s crazy that they felt they could try to pressure you into paying for their kids.", "i would deffo wait till they either go to college or are 25. giving them money say at 18 they would probably blow it", "Based on the information you have provided, it does not seem like you are in the wrong in this situation. You have been saving for your children's future, and it is not your responsibility to support your ex-wife's other children. It is reasonable for you to want to focus on providing for your own children rather than supporting your ex-wife's household. You have already offered to take your children more often, which shows that you are willing to be flexible and work with your ex-wife to support your children. Ultimately, it is up to your ex-wife and her husband to decide how to support their other children and it is not your responsibility to pay for their education. You are not the asshole (NTA) in this situation.", "NTA, like others have said keep control of the money and prep your kids now incase she tries to manipulate or pressure them into sharing the money. You aren't the one who chose to have more kids she did, they are her responsibility not yours. Stick to your guns on this one and don't budge", "my worry is now she will treat your kids different because she knows u have money.  her husband could have opend accounts for his kids at birth", "NTA", "Nta\n\nHow much audacity do people have.  What's yours is mine and what's mine' me own.\n\nOp, don't budge.  I bet your wife will withdraw support from your kids now, knowing you'll pick up the slack, when she diverts her savings to the new family..", "NTA.  Not at all.\n\nCongrats for being part of your children's life.  You and the ex have an agreement that you have been honoring.  It is not your responsibility to support her step child, and her children by another man.", "NTA", "NTA.\n\nEx: Hey, I'm wanting you to pay CS for our kids, so I can take that money and put it straight into an account for their half and step subs.\n\nYou: so you want me to fund accounts for the kids that aren't mine?\n\nEx: oh no! This is CS for our kids, even though we never did this before. But seeing as how you've got so much extra for our kids, it would let me use that money to save for the other kids. \n\n\n\nFirst, hopefully you haven't told her how much was saved.\n\nYou: Ex, you don't understand.  I didn't say I saved a huge amount, I'm just saying I'm going to help my kids when the time comes for college.\n\nNext, make sure the kids can not access the money so she can't guilt them into sharing it.\n\nFinally,  document everything!  She may try to take you to court over this.", "NTA. Tell her this: if you want me to pay child support, you need to file sonething with the court.", "NTA.  I agree with other comments to keep control of the money,  I see the mom and the others possibly trying to guilt your kids about the money you saved for them.", "Their kids, their problem.\nYou're not a charity.\nNTA", "Nta:. Your ex and the new spouse are absolutely insane. This isn't a case of them struggling to provide the basic necessities for your children when they are with them. This is them wanting you to be a third parent to children that aren't yours. That's completely and utterly ridiculous.", "NTA \n\nUnless your children are extremely strong willed and able to stand up to the barrage of pressure they are now likely getting from your ex and their stepfather to provide that money to them for all their children as they are FaMiLy then would agree as other posters have noted don’t let your children have direct access to the funds you have saved for them. \n\nAs other posters noted if your kids decide to go to school then pay any amounts directly to the school for classes, lab fees, dorm and meals. Also pay for the books directly as well. \n\nIf your kids tell you they want to live in an apartment of their own get a copy of the lease and setup an autopay to the entity that collects the rent.  \n\nI suspect you have already done so but in case not you might want to ensure your kids do not have access to this money until they are of an age where they would be out of college and ideally on their own so like say 25 years old in your will. If the kids are on the bank accounts with rights of survival you might want to change that. \n\nMy primary concern is your ex and her husband thinking in the first place it was a valid request that you subsidize anything for children that aren’t yours nor are they related to you. To me that means if your kids had access to that money before they themselves are standing on their own as full adults then your ex just might demand they give all the money to her so it can be shared however she deems right. \n\nBest wishes to you.", "NTA. Why is it that so many people feel so entitled to other peoples money? Its frankly absurd", "NTA. If they’re not your kids, then they’re not your responsibility.", "NTA. But pay any money directly to their school or whatever. Do not give your kids direct access to YOUR money.", "Absolutely NTA. Sounds like you're already on it, but just in case... please make sure your ex doesn't have access to the kids accounts at all.", "just say they money is yours to give to your kids when u think they old enough. you could offer to take on say the extra curricular costs of your kids. i mean did u tell her the amount u saved?", "NTA. You don't owe her new children anything. But be extra careful with those funds. Make sure you are the only one who can access them until your children come of age.", "NTA. Make sure she accounts for money you do give her for the kids now", "NTA. When I was 15 I went to a community college and tested out for a GED when I discovered my dad would no longer have to pay as a stipulation of the agreement with my mom.", "NTA. Her stepkids and kids with her current husband are her and her husband’s problem. You are only responsible for yours. Do not pay “child support” unless there is a court order to do so. \n\nAll 6 kids will eventually learn one way or the other that life isn’t fair. Your 2 kids have more money for college because you saved it. You aren’t the other 4 kids’ dad, they don’t automatically get the same thing just because it’s “not fair.” Tough. \n\nBy saving money for your kids’ college, that’s still helping them pay for the other 4 because it’s that much money they now don’t have to worry about for your 2. They should be happy with that and leave it. Asking for anything else from you is selfish.", "For sure not the A-H in this not sure in where your from but in Canada if a girl or guy gets Remarried the Child support stops", "NTA, its not your job to pay for their kids. They are absolutely not entitled to your money just because you have more than them.\n\nBe careful,  the next thing they will surely do is try to pay absolutely nothing towards your kids' education so they can spend more on their's", "NTA, not even a little bit. You are meeting your obligations and responsibilities as a father to your kids. It’s unfortunate for the step/half siblings but they’re not your responsibility. Make sure their money is locked down that only you can access or is in a trust which is managed by independent solicitors. \n\nIf you start sending money now for them or set up funds for the step/half siblings then where will it end? Little Timmy will suddenly need braces or an operation, they (ex and her partner) could start having more kids and expect you to foot the bill for them too. Seeing that they’re that entitled already, I wouldn’t put it past them.", "NTA. Good job being a good parent.\n\nI think you should have kept it quiet, though. Mom could definitely try to sue you for child support, and back pay is always a possibility. Maybe set that money up in a trust for the kids, just in case something happens to you, or if mom does decide to sue.", "NTA, I don’t understand these stepkids and college posts. My step siblings both had their college paid for by their grandparents. I took out loans. That’s just the way it is. Sure, it sucks and I’m still jealous ten years later. But it’s not my mom’s fault nor my stepdad.", "NTA. And make sure your kids don't have full access to all the money at once. Set it up in a trust that would pay college tuitions and bills (rent, utilities) from the trust itself and give a small monthly allowance for groceries and incidentals. You can have it set up where at a certain age they can have access to any remaining money in a lump sum (if they choose). Most people have it set up for after college age and working a year or 2 so they gain work ethics and saving instead of squandering. Make sure your kids know that this is YOUR money for THEM and they are not obligated to give ANY of it to their siblings no matter how much they get bullied by their step/bio siblings and their mom/SD.\n\nNTA", "NTA\n\nI hate when parents in general only try and get CS so they can fund other things not related to their kids. It just makes it harder for those of us who need it. Like my friend uses it to fund her partying while I use it to pay for doctors visits, his clothes, therapy, food for him, his haircuts, and other Child related expenses. \n\nI would set the kids up with chime cards that you can easily refill so only they have access to it. Obviously once an adult they don't need the supervision but this way they can have college covered or house payment without the ex meddling in their cash because honestly she would. I hope that my gut feeling is wrong tho.", "NTA.   \nWhat kind of ridiculous nonsense is this woman on about?  Do they want you to also pay the light bill?   how about their car payments?  \n\nYour ex wife is the AH for even proposing this ridiculous nonsense.", "NTA, not your kids and not your problem", "Lololol no you are NTA but your ex definitely is. She's basically trying to steal from her own children. That's really disgusting behavior on her part. Tell them to get a lawyer if they want child support. In the meantime I'd have a sit-down talk with your kids about this situation and see if they would like to be with you full time instead of only half. Maybe they're not getting everything they need in the ex's household if these people are asking for money from you.", "Why did you talk to your ex-wife about the kids' money? Educate your kids about their finances and college options, not the adults of a separate household. \n\n(Yeah, hindsight 20/20.)\n\nDo start educating your kids about finances and the difference between what your money should go towards vs what their mother's money should go towards, and caution them not to be manipulated.\n\nNTA", "NTA. Get your lawyer on the phone that handled the divorce and get ready. Also, remove their accounts and put that money in a trust stat! Your wife can eventually gain access to those accounts if she pressures them enough to gain access. Putting it into a trust means that the money can’t be touched by yourself, your ex, not your kids unless certain requirements  are met.", "Put the money into a trust fund with specific conditions that only let your kids can use it. Problem solved.", "This sure does seem to be quite a frequent dillema here. \n\nOf course you're NTA.  You are in no way obligated to help your ex with sending her kids to college.  It's a ridiculous request.  It's time to have a convo with your kids though about the money because if your ex and her husband are unashamedly entitled enough to ask and then try to manipulate you into having your kids share their funds with their siblings they will do the same to your kids. \n\nMy step brother's paternal grandmother is well off.  She paid for a lot of his things as he grew up, including his first car, his college, money for a house, etc.  I've never felt entitled to anything from her and my dad and step mom would have never dreamed to ask her or her ex husband to pay for anything for me.  The only thing I'm really jealous if is that she sends my parents a turkey at Thanksgiving and prime rib at Christmas but them's the breaks!", "NTA. Frankly, your ex-wife actually got a great deal with 50-50 and neither party paying child support. You both got to do the most important thing, which is to spend time with the kids. Perhaps you should remind her that if you were to pay child support, you'd probably have to limit the time you spend with the kids in order to work, maintain your lifestyle and continue to save for the kids future. As harsh as it sounds, it's fair to ask if she thinks you should sacrifice aspects of your relationship with your kids for her and her husband's kids. \n\nFWIW, I think you and your wife should have a talk with your kids and let them know what's going on. I'm not sure how much money you have set aside for them, but I'd give them the option to give 0-20% to their siblings (split equally). I'd set conditions like your sibling must finish high school, you must finish high school...and their parents have to pay to put the money in a trust or some other system of accountability. I'm recommending this because it will help to not create an unhealthy divide between the kids while not making you accountable for kids who are not yours.", "NTA. May I suggest that you arrange the college accounts to pay directly to the college and not to your kids so your ex can’t manipulate the kids into giving the money to her.", "Simply put. NTA", "How is husband #2 not embarozzeeed😂 \"you should take more financial burden for your kids so my wife can give more to our other kids\"", "NTA! That family needs a reality check, sorry.\nLook after your children and do your best to raise them to be decent human beings.", "NTA Not the asshole at all, your ex and her husband are delusional. And as others said lock down those bank accounts and ensure they have no access to them!", "People are wild! I mean WTF??? Entitled much?  \nAbsolutely NTA, and be sure to make sure they can't get their hands on your kids money in any way.  \nPeople baffle me some times.", "NTA\n\nYou are only responsible for your childrens Future, Not for their childrens. \n\nI don't know how the childrens get along and it might be possible that it Drives a wedge between them, bit this is neither your fault, Not your Problem.", "NTA. Not your kids, not your problem. You have done well for your kids and the other dude is responsible for his kids. Don’t budge and do not let anyone have control of those accounts except you. Step siblings might bully your kids into sharing.", "NTA. Secure that money and speak with your kids to tell them to be more open and honest with you regarding how they are being treated at their mother's place.", "**NTA** This is a classic one. Custody and expenses are shared equally for your kids. You have made choices which enable your kids to have opportunity that your wife and her husband have not. They see this and want to use you to level the playingfield between your kids and their kids. This is entirely unreasonable and you should ensure they cannot have any access to the money through your kids. They are essentially admitting that they have insufficient financial resources for their kids to have the same experience that yours will have. This is life. You are not responsible for her household only for your kids.\n\nEdit: The audacity of their request the way you've portrayed it is seriously infuriating.", "woah....\n\nam I the only one cheering him on with his witty come back\n\n&#x200B;\n\nNTA..\n\nthe audacity", "I can’t believe the absolute gall of your ex-wife and her husband.\n\nIt’s difficult when stepsibs have different opportunities but your savings is not a payday for their children.\n\nI’m honestly flummoxed that this man expects you to support his children and nephew. I’m trying to think of a polite way to ask what could be wrong with him.\n\nPlease, OP, continue to be protective of your children; I see a lot of raw feelings, emotional manipulation, and cries of “it’s not fair” in your future.\n\nGod bless.\n\nSooooo NTA.", "NTA. The level of entitlement is unreal. You are in no way responsible for your EX wife’s new children.", "Nta. This person thinks you should pay child support to supplement their income to pay for children that aren’t yours. Are they mentally ill? Are they incapable of picking up extra work?\nThey don’t get to ride the gravy train off your income because they don’t make enough or budget well enough to save for their other children. \nAbsolute morons. Your wife and her new husband deserve each other.", "NTA Your Ex and her new husband are money hungry and didn't plan for those kids. Shame on them.", "NTA. \n\nNo one told his ex-wife to have additional kids\nIn the new marriage. Not the OP’s fault that this new family consists of 6 minor children. And the courts will look at her like she was crazy if she filed for child support, especially with her reasoning.", "NTA. I'm late to the party, but I want to add that by their logic, you would need to increase child support payments if they decided to plop more children.", "NTA", "NTA.  This seems to be a theme on this forum.  Why oh why do exs think their former partner should have financial responsibility for their children with another spouse???  Makes ZERO sense.  You saved for YOUR children and YOUR children will benefit. You know you're not the AH here.  Your former wife and her partner just suddenly realized you're sitting on money and want to make a grab for it.  Absolutely not.", "NTA\n\nWhat are they smoking?! 🙈", "NTA - she and her husband are idiots to pitch it like that - as though there was any other way to pitch it!\n\nthey are choosing to raise 6 children and not 2.   that will be more expensive.  Sure its unfair that some children have more than others but that's what happens .", "NTA. \nI’d make sure to let the bank know that the funds can not be accessed without your signature/consent.", "NAA. 💯💯💯 I can’t believe they had the nerve to as you this.", "NTA. Ex and her husband are just after your new found money. BTW- huge mistake on your part for even mentioning that to her. Nevertheless, only a court ruling can mandate you paying child support. Not “what she thinks you should do” just because she wants it. If the current arrangement has been working well so far, hopefully if she takes you to court for child support, you can argue that she wasn’t interested in it until you inherited some money and now her greedy ass is after it. Good luck, man, and remember: NEVER discuss your finances with an EX.", "NTA, and seriously consider moving the money you've placed in your kids accounts and have an attorney create a trust with restrictions on what the money can be used for and who can access it until they reach a certain age. Guarantee they'll be bullied into splitting it with their siblings.", "NTA you have no court order and you pay 50/50. Make sure the accounts you have for your kids are in your name for now. I would also sit them down when they are getting ready for college (oldest one should be soon) and explain that the money is for their education and theirs only. You don't want them to feel guilty for using it for themselves and not for their potential half siblings. I wouldn't throw your ex under the bus and tell them she's in a money grab for it. I'm sure she will do that herself in time. Just tell them to let you know when they decide on school, if they decide on school no matter if it's a trade school or community college. You will set up the payments to the school and make sure it's good to go. Any extra money not used for school is there's for a car, or other things they may need and want.\n\nAlso your ex is a piece of work. I would switch to text or email only conversations from her from now on. You can keep that for your records if she ever tries to take you to court over it. Also gathe any receipts you can showing you are paying for medical, school, extracurriculars, clothing, food etc. That way you are covered if she decides to get greedy.", "NTA. The arrangement you have is fair. You have zero obligation to provide for another man's kids.", "I don't understand why she feels this other man's kids is op's problem?", "This situation is wild. If I found out my ex had been stashing money away for our kids college fund I would be ecstatic and grateful. I would also have MORE money to put towards my other kids college expenses because I no longer have to pay for the other two.", "There's a lot of NTA and no obligation, but in many states when she takes him to court, he'll owe a portion of his settlement. And back child support for 14 years. The college funds may already be gone. In an income sharing state, the child support payments are design to equalize the income between homes. So if mom makes $40,000 a year and dad makes $60,000, dad pays mom $10,000 a year in child support. Or if dad makes $6,000,000 in a settlement and mom's a stay at home mom, dad pays $3,000,000. Maybe it's capped at 1/3.", "Yes. A trust makes a lot of sense. More protection for the kids.", "And the cynic in me says OP and the kids should expect the ex-wife to not contribute a dime to the kids' college. Since she knows OP has the money for it, she's going to make OP cover everything. Just you wait and see", "Make the kids take out loans, and reimburse them after college is done imo.  Makes them realize they *could* very well be totally on the hook for their decisions, and take seriously their education while in school.\n\nThe money isn't theirs until OP decides.  He can decide he needs it right now and it would be 100% morally OK.  He does not owe them an education or a down payment on a  house or whatever.", "Yes.  Pay the college directly rather than giving the money to your children.", "Posts like that always baffles me. How someone can be so delusional?", "I was thinking this same thing. I used to be a banker and seen first hand how people act when it comes to money. it’s definitely not outside the realm of possibility that mom would take her kids to the bank and drain the accounts.", "They think child support means any child rather than the ones shared", "Too many people jump into having kids without thinking about how expensive they are and whether they can afford them", "Judging by their situation I really doubt they could get full custody. Heck if anything a judge might arrange for less custody for OPs ex since they technically have 6 kids living with them and I really doubt each child has their own room and everything.", "I didn't tell her how much.", "She wants the credit for sending them, so wants to pay some, and knows the kids will know if she takes the money saved for them to spend on the other kids.", "The courts did not order CS to be paid.", "She is an EXwife.... She has zero entitlement to any information  regarding his financial planning whatsoever.", "Yes this is the correct way. Pay/don't pay as the court order reflects. Nothing else matters.", "Fucking stupid people down voting you clearly don't have kids nor understand how child support works with the courts.", "No, our incomes are similar. I make a bit more but not enough to warrant CS.", "There is no significant income disparity.", "Sidenote, I would recommend that you put a trust in place that way if something ever happens to you that money will go to your kids and in that trust you can have it set so they will only use the funds for college related expenses, etc. You should also include a clause that protects the money from them, giving it to their siblings or their parents (your ex-wife and her husband) I only say this, because I have seen it happen where someone receives inheritance, or money that’s specifically meant for them, and someone else tries to finagle it out of them", "It baffles me how some people think that their step kids are also their ex's responsibility.\n\nHow do the mental gymnastics even work for that?\n\nThat would be the same as OP being asked to fund a college account for his neighbor's kid.", "Actually no, they have 50/50 and this type of custody usually means that no one pays child support to no one. Cause all the responsibilities are shared. Child support is for his children not for the children she decided to raise or have.", "If custody is split 50/50 why would there be child support?", "Household income or personal income though?  Because there's a chance that the ex and her husband put together earn more than OP. So if she takes OP to court she'll only end up fucking herself over further since she's got to afford for 4 (I halved the 2 she shares) children with less money than she has now", "In my state the calculation isn't that simple. There's a table that gives the rate of child support based on income and shared children, not a transfer purely based on income. Settlements aren't considered income so are unlikely to be considered income here. If there's no child support order in place there wouldn't be back child support.\n\nA family friend had shared custody and the ex screwed himself by not paying for new glasses when he was responsible for medical expenses. He got hauled into court and because his income had increased she was awarded child support when she had the child when neither had paid it previously.", "Child support payments are generally not that simplified. There's a calculation based on income and time spent with the children and cost to support the children, but it's not as simple as dividing the extra one person makes and giving it to the other. My close friend made 150k vs her ex 80k and they split custody 50/50 and the ex had insurance coverage on the kids. Her estimated child support payment would have been about $15k per year, but they reached other agreements and no child support is paid. Who knows what other financial arrangements were made when they divorced or even what their incomes were like at the time of divorce. If they made similar money, there would have been no child support. \n\nIf he received a settlement after they were divorced, which it sounds like the case, she would have no claim on that. They've been divorced for at least 8 years since she has a 7 year old with her new husband.", "There's money involved. Of course people are going to say they're entitled to it", "He has no shame, he just wants the money", "It's only embarrassing if you have self awareness and self-respect.", "[removed]", "Both? Both. Both is good.", "It's because she has no brain", "He may want to look into setting up a specific trust with a fiduciary, probably through a trusted bank. You can set the terms of how much they can draw and whatnot - often there is an approval process by the fiduciary (if you make the limits on the money more strict) who will monitor what the money is allocated for.   \n\n\nThis is a great option if you would like someone else to manage the money for you and/or if something were to happen to you.", "Agree - I wouldn't put it past exwife to guilt/manipulate the kids. OP needs to be the \"bad guy\" here and have the money in accounts only HE can control, so the onus is off the kids and if mom hassles them, they can simply say \"We have no access to the money, only dad does.\"", "Yes—and the kids may not even realize if they’re being manipulated, or may not disclose. OP should have a plan for how to deal with it if one of his kids says, “Dad, I want to go to LocalCC and live at home, and want you to take the money you would have spent on me and let my step/half sibling have some too. I know that’s not what you planned, but the money is for my benefit, and this is what I want, because I wouldn’t be happy knowing I had this opportunity that my sibling didn’t.”", "I facepalmed. I get it would kind of be lying by omission or even just lying by agreeing community college is cheaper. And what would happen when it comes time to go to college and the kids are managing to get a university paid for? But we could see this issue coming from a mile away. I absolutely wouldn't have blurted that I have plenty of money to cover things. It only invites issues", "I'm not sure that is unreasonable", "Idk about that. A trust seems more optimal. 529 accounts can only be used for education and not all education related expenses are covered. Say there is more money than they need for education. There is penalties for using it for anything not covered under the plan. What if one of the kids don't end up going to college? I did two years and was scouted out of college by a tech company. Then all of that money would incur a penalty if used for anything else (i.e. down-payment on a house).", "Dont do this, as it’s possible to overfund a 529.", "There's a lot of snobbery as well, like 'only community college' - it's still education! I hate to be that guy, but this is what happens when you have/take on more children than you can realistically afford.", "And it's not like OP just rolls in money. He only has money because he got injured, which means as he ages, it's likely those injuries will get worse and he'll lose his livelihood and need that money to feed himself.\n\nOP should actually talk to a financial planner and secure an attorney.\n\nOP- NTA. Get yourself protected.", "/u/Apprehensive_Life is a comment stealing bot. Original comment here:\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/zln3vb/aita_for_refusing_to_pay_child_support_to_my/j065qkh/", "A Trust, set up a TRUST.", "Make sure that you are also the only one that has access to those accounts until your kids move out or finish school. Reddit is full of examples where kids of divorced parents received a healthy college fund from one parent and were bullied or forced to share with their step/half siblings by the other parent. \n\nGood on you for giving your ex a healthy dose of reality and boundary check.", "Not to mention, child support is usually based on the household income rather than individual income (edit, where I live at least). I'm betting OP's ex and the new husband earn more than OP does as a single man. It would be hilarious if it turned out THEY owed HIM money.", "Is child support determined by personal income or household income though? Because if it's the patter then she may end up having to pay OP child support instead", "I think they would lose to OP cause their home is crowed", "Did not know that. Still, the fact that the payment is mostly in their child's account probably counts as child support too. I don't think OP's ex partner has any legal leg to stand on.", "One time payments generally don't factor in from my experience. But it's not a hard fast rule and anything can be challenged.", "Then she  can go and pound dirt or  kick rocks  or  something similar.", "Alright then, NTA", "☝🏼this. Plus since his ex is now married, the courts would take into account the exes & her husband’s income to determine child support.", "I mean you can actually no me all you want, but I have 50/50 custody and pay child support. 🤷🏼‍♀️\n\nhttps://trunorthdivorce.com/child-support-pennsylvania/\n\nGives a pretty good summary. With more time the non custodial parent pays a little less (not a lot less) and there's no point at which it reaches 0. It can't be calculated as equal time on the calculator, so in my husband's case they used \"49.5%\" custody.\n\nNote that the support calculation \"includes income from any source, including employee wages, businesses owned, pensions and other retirement, estates and trust, social security, tax refunds, awards and verdicts, and alimony that is intended to finance the support-receiving parent (aka “obligee”).\"", "If my spouse came up with this stupid idea, I would have said, “no fuqking way, that’s not happening.”  Have some dignity man.", "/u/Fast_Cucumber_5963 is a comment stealing bot. Original comment here:\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/zln3vb/aita_for_refusing_to_pay_child_support_to_my/j065qkh/", "Completely agreed with this. He should make sure that his kids that he saved for get the full benefit of the money.\n\nNTA", "[removed]", "Especially now that mom and stepdad know about the money. OP is NTA, and he probably didn't know it would have just been better for everyone to keep that info to himself until later. I feel bad for the 3 of them.", "Yep!! If his two kids don’t choose to use all the money for college, he save the balance for them to put towards their first home, or wedding, or whatever. \n\nI am gobsmacked that ex wife has the gall to expect OP to participate in paying for step-kids college. It’s baffling.", "It could be in their names only with OP as custodian with an UTMA account or similar, that the kids would get full control of at some point at ~18-21 depending on the state.\n\nNo real reason to set it up like that if it's all OP's money I think. 529s owned by OP with kids as beneficiaries would probably make the most sense (unless it goes above what they'd need for college) in which case OP would retain full control of the funds.", "It is unreasonable. She doesn't suddenly have no duty to those 2 kids just because their father can afford more.", "You do pay a penalty for funds used otherwise but (maybe not now with our current inflation rates) it’s cheaper to put into a 529 and trusts can be easier to be disputed. His kids seem old enough to know what colleges they want to go to so he can evaluate from there.", "Over-funded 529s can go to grandkids  or other kids too. But it's close enough that I would just put the money into either a trust or under a custodian accounts", "yeah, the older two in her household might be kinda boned, but they've got time to start saving for the 5 and 7 year olds... of course, holding your hand out is much easier than saving.\n\nwhy doesn't her husband have money for his 16 year old to go to college? where is that child's mother/family in all this? that's all really not OP's problem. he didn't procreate with the guy", "I wish I would have gone to community college for my prerequisites. It's so much cheaper and you get a better quality education, because you're in a class with 30 students, not 500 students. I hated getting told community college was less desirable than going straight to university. I could have saved myself so much debt if I'd gone to community college first.", "Yeah you can pretty much count on her not contributing to their college at all. Just by telling her about the money you've kind of contributed to the other kids since your ex-wife will feel no need to cover your kids", "That's...even worse.\n\nMy gosh some people are so bad.", "Your kids need to know that she didn't contribute any thing.  Not to drag on your ex and not to put her down;  but simply because she might use her telling them that she contributed any amount/half as a way to try to manipulate your children into giving up their needs and rights and money and being okay with forfeiting for their children.   It's part of protecting your children.  I know it's hard to think like that as someone who wouldn't act like that; but because of how greedily your ex and her husband acted upon hearing about your savings you have to think about the worst possibilities to ensure they don't happen.   They didn't express relief at you working hard and sacrificing and saving for your children, they didn't say 'we're glad you saved but we will contribute and do our best as well', they didn't react positively at all..... Instead they got greedy and told you how you could spend your children's savings on their children...... That's batshit insane. And because they brought it up right away and want you to pay child support *now* they may try to do all sorts of things to get money from you. If you don't think they'll manipulate your kids or take out college loans in your kids name but spend it on their kids then you need to read more threads in r/raisedbynarcissist and r/justnomil and the credit subs, college subs, loan subs, legal subs etc.   Justnomil won't seem to fit at first as it just no motherinlaw, but  there is so much in there about narcissists and about how one set of kids are used against the other and from siblings against siblings and divorced parent against the other.   \n     I would suggest an attorney to set up protections in whatever ways you and the attorney deem correct.   \n     And please whatever you do never tell them that you have life insurance and that your kids are the beneficiaries. But that's just because I'm a true crime junkie and so many people kill for incredibly small amounts of money and usually it's not the money only; more like ' I/we look bad/feel bad in comparison so if he's gone we'll have the money and we'll be the only ones so no reason to feel bad ' or because it's a control/no control thing and money is just the vehicle for it.     \n       Good on you for saving for your kids. Good luck to you all.", "This might be the petty bastard coming out in me, but I would make sure that the kids know exactly how much I was contributing to their college expenses. \n\nYou don't need to blast their mom directly, but there is nothing wrong with making sure they know how much it costs and how much you are putting in. Then just let them do the math on how the rest of it is getting paid.", "A trust is the answer here!!", "Idk seems like probate works fine for this purpose (and every state has laws that disinherit an ex-spouse whether they are in your will or not). Any reason you think OP should get a trust?", "I don't know, in my state child support is based on the income of the parent. The only ones legally responsible for the child are the parents.", "No, that's not how child support works. Your financial responsibility to your children is not based on what your ex's new partner makes. Your child support payments don't go down because their step father or mother happens to make more money than you.", "Well it would only affect the 15 year old but status quo is set. The 17 year old will be an adult by the time the court hears the case most likely.", "Yup, it’s likely OPs ex was only able to get 50/50 custody because they filed 13 years ago before she probably got remarried.", "I also think OP is NTA at all, however on the legal side I really don’t know. The idea of child support was to balance life circumstances in both households as much as possible, so that the kids in one household don’t live on food stamps and in the other household are being driven around in a Porsche.\n\nLike I said, I have no idea if those one time payments would play any role at all (how about a substantial lottery win?), and maybe they don’t. \n\nBut honestly, if I was the mom and depending on HOW big those payments were that OP is talking about, I would probably get at least a consultation with an attorney.", "He just doesn't have 4 additional children to care.\n\nShe is dealing with the consequences of her choices and trying to pin them in OP.", "In this case OP clarified they have similar incomes. But he only have 2 children and she has 6, so.", "If it sucks that badly, why didn't they have savings accounts for the other kids?  For that matter, why were they apparently OK with sending their kids to community college when they were paying for it, but it's suddenly subpar when they learned that OP saved enough to give his kids more help?  OP did a really good thing for his kids.  His ex and her husband are the only assholes here.", "u/Mean-Paint886 is a bot.", "Can't you only add so much per year to one too?", "I went to community college before my Pharmacy degree for that very reason. I had amazing profs with PHD’s rather than being taught in a class of hundreds as a first year by a TA that got the short straw!", "I'm glad I commented here, for the discussion and especially for this very important recommendation.", "Oh OK, fair enough.\n\nI'm in the UK and remember a colleague complaining that, because his wife had got a promotion, they were having to pay his ex more money.", "It happened to my colleague, but this may be a difference-by-country issue.", "I'm not sure the government would see the money from the injury as child support money, either. They tend to base calculations over a longer period of time, not from one injury claim payout.", "Well inheritance is usually handled differently. I don't know how that plays a role but it could depend on the state. Injury payments are likely non liable as those are usually done to compensate the worker for loss in labour revenue. But this is all theory crafting. OP, lawyer up I suppose check if you covered your ground.", "Bot", "This. And how much money do they expect to save in 3 years? In that other universe, OP would still only pay until the youngest graduates high school. OP, NTA, but your ex & her husband are entitled AHs. Keep that money safe", "You might be thinking of a Coverdell college savings IRA. 529s are much less restrictive about how much you can add, how long the money can sit there, and whom you can transfer the funds to penalty-free.", "Naw you’re correct in US it’s state by state so that could happen to them", "Info: Just to clarify, is there a court order related to custody/child support?", "NTA but if your income is a lot higher that may try and take you to court for child support", "NTA. You are not responsible for her stepchildren or her children by her husband. The gall of her AND her husband thinking you’re an AH for not doing it is so entitled.", "I would call the new husband a deadbeat and ask how he as a man can ask another man to help provide for his own family, sucker shit NTA also I'd make sure you record every interaction you have with them so they don't try to lie to courts for child support.", "Somebody is about to get taken back to court. And they're going to lose. Your child support will be recalculated to include your windfalls as assets/income. \n\nYou might not find it fair, but you have had what is legally referred to as a \"substantial change in circumstances\" and that's going to impact your CS, regardless of whether you have the kids 50/50 and split expenses. \n\nPut the money in an education trust for the kids that belong to you and you might be able to squeak it by given their ages. But OP, you have legal liability here, even if you are not the asshole.", "I would suggest converting the Kids' accounts into trust funds with you as the trustee until the kids are old enough to be independent - about 25 or so. \n\nReason being that it will give your kids extra protection from pressure from your ex and their step-parent. Then if the kids choose of their own free will to help family, great, but they won't be bullied into it when they're financially or physically dependent.\n\nEdit: NTA", "NTA.\n\nHowever, I would strongly recommend that you consult a lawyer ASAP. Coming into money and her knowing about it could mean that she could sue saying the income ratios changed and put you on the hook for support.\n\nGet your ducks in a row on this now.", "Nta.... Keep records of a this. They sound like they'd be shady", "There is no legal way they can make you pay child support for children that aren’t legally yours. That’s why they tried to guilt trip you instead of taking you to court. \n\nYour children’s finances are in danger. If they’re willing to guilt trip someone who doesn’t know them, imagine what they are saying to your kids. \n\nNow that you said No, your ex and her husband are going to try to go around you and guilt trip your kids. You might need to reconsider reorganizing the account so that only your children can benefit from it.", "Your ex & her husband are the assholes. I can’t believe they had the balls to ask you this", "NTA.  I don't understand remotely how this is a YOU problem.  Failure to plan on their part doesn't constitute an emergency on your part.  Community college is a great place to start and is not life limiiting.  It's nice you were able to budget for YOUR kids to have more options, but that doesn't mean you need to school a bunch of kids you have no relationship with.\n\nI would be thinking now how to keep that money under lock.  Like I have a college age kid.  We have a direct account to pay tuition without money needing to pass through kid's hands.  I would be worried about them doing underhanded things to try and get their hands on some of it.\n\nI would also tell your kids that it won't be polite to go on and on about college choice in that house and they should keep it on the down low.  Stirring the pot will just keep that money fresh in their mind", "The only thing you could have done differently was to feign regret that you couldn’t help them.   It’s outrageous that they think you should or would take care of their kids too.", "What if your ex wife doesn’t pay her share of your kids’ college (the community college part)? Does your fund cover everything for college, including food/living expenses?", "I hope you can coach your children to know that the money is for their future, because im sure the wife is going to attempt to guilt them into splitting the money with the other kids.", "NTA, but your ex is a riot!!! Thank her for the laugh!", "Absolutely not the AH and please don’t let them bully you into thinking other wise. It looks like you made better decisions that they did in life since you and your ex wife make about the same money. You are absolutely not responsible for no one else’s kids. They just want to take advantage of you.", "NTA. Sounds like you made the right choice divorcing this person. \n\nThis person lives in a 2 income household, and wants you to give THEIR kids money? What kind of CUCKOO crazy person would agree to that?", "NTA\n\nYou may want to change the college accounts to where it is for their college and their college only, or where when they go there, they have to give you the name of the college, where you show up and write the checks to the school and it pays only for them, and not just hand it over to the children right off the bat, that way it still keeps the money away from the ex and her family.  The moment they get ahold of such, chances are it is either going to be less than what your children should be needing or worse, they are left out.", "Keep\nControl of the money . Pay for college directly or your kids will be guilted into helping the other step kids .", "NTA and also , wtf with all this people wanting other's children money to pay for their own ?", "NTA and you’re a good dad for doing that.", "Your ex and her new husband are delusional to think that you should share the money you saved for your biological children with their children. Tell them to get second jobs if they want to save more money. Also make sure that your children know that the money you have saved for them is money that only you have saved. Make sure that your ex wife doesn't claim that she helped save that money. Also let them know that this money is for their futures only eg college, deposit for a house etc. It is not for their half siblings to use.", "NTA. Their kids are not your responsibility. If you truly have a 50-50 agreement and you’ve held up your end of the deal, then you don’t owe another dime. Those other kids *are* your kids half-siblings, but by the other man, not by you. That means they  are that *other mans* responsibility, not yours. \n\nGood on you for actually being an involved 50-50 parent in a divorce situation and for saving that money for your kids. I would recommend keeping control of it and paying their bills for them from the accounts rather than completely turning the money over to them at 18. As others have said, they might be pressured by their mom and Step Dad to forfeit some of it to their step siblings. They might also be tempted to be dumb 18 years olds and blow it.. I know I would have been tempted to do so at 18", "NTA and I would have laughed at ol dude for asking me to help him. Tell em \"these are the breaks\" and enjoy your life king", "Todays world and people’s entitlement. I agree with the setting up a trust fund for the kids with an order that the money is to be used for the two children ONLY, set up a trustee to ensure this. At the age of 24 they are welcomed to the funds if they choose not to go to college. And that the money is not to be used for anyone else. I see an episode of Snapped on this. They kill him for the money.", "Is this even real.. because the audacity is crazy! The husband is worthless if he really feels another man should put towards his children's college expenses. \n\nHopefully the OP ends the conversation by stating this subject I not up for discussion.\n\nNTA", "NTA.\n\nYou're 50:50 with no CS because your incomes were similar.  And that was set BEFORE she got remarried and had more kids--her husband's income wasn't even in the mix.\n\nI'm not sure but I believe that your worker's comp settlement money would only affect your income as it relates to interest, so not much.\n\nYour ex is free to go back to court if she believes your financial situations are now different enough to make CS make sense. Of course she won't get it for long anyway and it has nothing to do with college expenses.", "You are NTA, your ex and her husband are though. \nHow can you expect someone with no relation pay for college?! Like what!", "NTA. It’s ridiculous that they would even ask you to pay more so they can help only their kids. They chose to get married (bringing household kids to 4.) They chose to have 2 more for a total of 6. This is a result of of their decisions. It suck’s theyre not able to provide the same for their other kids as you’re able to provide for your kids, but thats just how blended families work sometime.", "NTA - but I think the ex-wife's reasoning is not unusual. For instance, my step-sibling is executor and only named recipient of one of my parent's will. Step-sibling is around the same age as me, so it's not as if this parent raised this step-sibling. It's simply that they are the child of my parent's spouse, so everything goes to them. And no, child support was not paid. \n\nI think I may need therapy: I clearly have issues 😉", "I can’t believe I just read this! This has to be one of the most asinine “ideas” WTH?", "NTA OP, But you might want to speak with your kids about this. If ex's house turns toxic they need to know they can bail out, they also need to know if things start getting weird immediately. Document everything.", "Put it into a Trust fund.. best way to protect your kids from greedy morons", "Yep, pay the tuition bill directly to the school. Don’t give your kids the money. They could be bullied into giving it away, or they could just take the money and secretly drop out.", "Also, isn’t OP having money for the two older kids actually helping the rest of their children? They now have 2 years to save for the 3rd oldest.", "Yep move that money out of an account they have access to asap.", "This.\n\nAfter that conversation, I'd keep control of the fund and send checks directly to the colleges rather than just releasing the funds to your kids. If they want to do something else, like buy a house, you can help them negotiate it. This will make it plain that they can't be coerced into funding their half-siblings' and step-siblings' futures.", "NTA. This is insane. What a ridiculous thing to say. I hope your kids aren’t being brainwashed into thinking they have to split that money with their siblings.", "OP, Please please PLEASE put the money in a protected trust. I work in law and see the parents exploit their kids ALL THE TIME", "WOW!  The entitlement is just amazing!  Can't believe that she actually had the balls to ask and get pissed when told no!!\n\nMake it air tight or they will try and get the kids to give it to them.", "All I can think is: why do people feel so entitled to other's people money? This seems really regular in this sub and is an absurd to me.", "Yes there is.", "Also, as the parent of a college student and a high school senior and as someone paying for tuition right now, sit your kids down and do some math.  If these are sizable accounts they may have the option of college and down payment on a home or something like that.  Chosing your most expensive college option isn't always the most responsible choice.", "Op commented on another comment asking about child support and said that their incomes are similar. he makes a little more but not enough to warrant child support", "This is what I was thinking! The ex now only needs to supplement what OP's accounts can't cover, which, from how OP describes it, is very little.", "A) They have 50/50 custody and split expenses down the middle\nB) They make similar salaries\nC) The ex remarried\n\nOP doesn't owe anything under those conditions", "This was my thought. The absolute, ludicrous entitlement is astounding.\n\nAlso, feels a bit like she’s willing to sacrifice her older kids to pay for her second family. Which makes her a huge asshole. I hope OP’s kids don’t feel that less-than status from their mom. It’s shameful.\n\nNTA, OP! Good job on being judicious and responsible and selfless in planning ahead for your kids’ futures. And like others have said, protect your kids’ money from your greedy, delusional ex!", "Here's a cautionary tale.\n\nMy mother died in tragic circumstances.\n\nI was shattered by guilt and disoriented. \n\nI unexpectedly came into some money.\n\nMoms best friend who was executrix of the estate persuaded me to sell valuable family jewelry to her friends instead of advising me to keep it and let the value appreciate.\n\nMy best friend covertly turned predatory. She referred me to her therapist who was in a cult.\n\nTook 19 years for me to get away from him and I was close to broke, depressed and close to homelessness.", "Yup. And the next thing you know they'll be taking care of more kids that they expect OP to also pay for. Not his responsibility, NTA", "It's a no brainer in the sense you'd have to have no brain to agree", "Oh yea. \n\nWhen I left for college my dad started giving me money to pay for expenses (rent, tuition, food, etc). It wasn't a ton of money, but it helped me to keep my college debt low. When my mom found out about my dad helping me she asked me to start \"paying her back\", and I was just....heartbroken she would even ask.", "OP needs to talk to a lawyer and get a trust setup. Not a bank account. If he dies, kids will get the cash. And ex-wife will control it if it happens before the kids are 18. In a lot of countries, any property owned by a minor is controlled by the parent. They can be sued if it's entirely wasted, but it's usually too late to matter. \n\nAll of this is bypassed with a trust. The ex can't pillage it without going to jail. \n\nObviously stuff varies by jurisdiction and OP should talk to a lawyer. But in most countries, a trust can be setup very cheaply (< $500) and OP can specify reasons for withdraw. Trust can cut the check to the school directly, so that the ex wife can't skim.", "Pay all the bills directly, period.", "The easiest and best way for you and the kids is to get a lawyer and put it into a trust with very finite rules and stipulations on use.", "NTA.  It sounds like the money is in custodial accounts for his children where he is the main controlling entity.  The kids can apply for cards and access to that accounts but I think he needs to be there to sign as well.  The proper way would be to set up checking accounts for both kids when they reach 18.  And, Of course educate them on the sacrifices OP made for that money and it is theirs alone, not to be used for charity.", "If he puts the money in a trust for each kid then it can be fully controlled. Plus he can designate a trustee who would take over administering the funds if something happens to him.", "This seems like an extremely dangerous response to me. What if the kids don't want to go to college? They shouldn't be forced to just because of that money. OP explicitly says the money is theirs whether they choose college or not.", "This, you can pay college tuition directly to the the institution and there is no limit before it is taxed as income on the child.  So there are also tax implications and benefits to doing it this way.", "Good point. She might tell the kids that since they have a college fund already she won’t be contributing anything. I think it all comes down to the divorce agreement. She may be obligated to pay something towards for kids higher education.", "It's not really something that can be kept quiet for long. Eventually he would need to tell the kids that the money was available to them so they could make their college plans. If/when one decides to go to school, the mother would f*nd out where the money was coming from, then the new husband would know and the other kids would know. \n\nAs long as OP is smart about it, there's really no danger of anyone else getting their hands on the money if he has control of the accounts.", "My sister looked into setting up 529 for my nephews but decided against it after talking to our family's financial advisor.  It turns out 529 accounts are counted *against* you on the FAFSA form and are viewed as either part of the parent's income or the child's (depending on whose name is on the account).  Basically, if you have a 529 account you can get screwed out of grants, scholarships (the one's that use FAFSA to determine eligibility) and other forms of financial aid even if it isn't enough to fund an entire 4-year degree.", "Your ex sounds both delusional and entitled. If they keep bothering you tell them that you’ve given them your answer, which is no, and that you are not going to discuss it any further. If they don’t like that answer they are free to try you to court over it", "OP, NTA and good job on saving for your kids! If you haven’t already, put your kids’ money into a trust that specifically spells out how the money is to be distributed and what it can be used for. This way, ex wife cannot coerce your kids to give their money to the half or step siblings.", "Is there a way to make it so she can never find out the sum or access it?", "It's kind of hilarious how she didn't want to be reliant on you during your marriage but wants to rely on you now that you're not.", "Except OP said that he started the savings accounts *while still married* to his now ex. That’s the strange part. After they were no longer together, you’re right. She’s not entitled to that info.", "Truly unreal?!", "Usually yes, if the circumstances warrant it, but there are plenty of times when even with 50/50 one parent pays child support.\n\nChild support is more complicated than many seem to realize. One of the goals of child support is to maintain a standard of living. If one person has significantly more income they usually pay child support, even if they have 50/50. Every state does it differently but if their finances have changed she could potentially be owed child support. If he now has a lot more money he could be considered responsible for more of their care than she is, depending on what state they're in and other factors. \n\nIf two parents split custody but one makes 200k a year and has a million in the bank and one makes 50k a year with almost nothing in the bank the courts wouldn't say they're each responsible for 50%. The parent who makes the most pays the most.", "You're lucky. Settlements are considered income in my state. My father in law left his house to me so my husband's ex wouldn't get half of it.", "It's personal income, spouses don't count. (Good for me, I'm the stepparent.)", "No, she doesn’t get to take the credit for something she didn’t do. \n\nWhat an odd viewpoint she has. She and her husband belong on r/choosingbeggars.", "I would strongly consider putting it into a tust with stipulations. 0", "Or this could blow up spectacularly in her face if she goes in hard on the kids to get her way. If she pushes them to \"share\" for an extended period of time, the kids could very well say, \"Yeah, no thanks - we want to go live with Dad.\" And depending on where he lives, OP can always file a child support claim if the kids are choosing to live with him, where they won't be constantly badgered into giving their step and half siblings their father's funds. OP doesn't sound that petty, but if she gets really aggressive and makes life hell for those kids, this could go south for her fast.", "NTA OP - I would definitely tell your kids about the money and what it is to be used for and I know it might cause problems, but I would tell your kids exactly what your ex and her husband are doing so they are forewarned.  I would also let them know you control the money and you would not be giving any to the ex and husband.    This is the exact reason you never tell people you have money.", "This is the way.", "I'm so sorry she said that to you. Glad dad helped.❤️", "Wow... your mom is terrible.", "Yep, and we know that she’s not going to help her eldest children with anything and focus solely on the others. This is about to get gross on her end.", "This.  He needs to explore legal and financial options to protect that money from his ex, like yesterday.", "Absolutely this.\n\nWe have seen too many posts here about kids asking if they are the AH for being mad when their parents blew the kids' designated inheritance.", "Excellent suggestion, as it will protect his children's money in the event that something happens to him.", "Even worse... \"Dad, I want to go to community college, but (step-sibling) is really bright and would do well at an expensive uni... Their heart is set on (insert expensive university), but they can't afford it. Please, use my money to fund their studies\".", "That is EXTREMELY unreasonable! What are you talking about!?", "Pretty unreasonable for a parent with equal custody and equal responsibility to say \"Oh you've got a little money? You pay for it all then, I'm out.\" That hasn't happened *yet* but I can guarantee it will pretty much go like that. OP doesn't have to *give them* money. The ex-wife will just stop contributing to their shared kids and will make him cover their college so she can *save* money for the 4 who aren't OP's responsibility", "It's not lying to agree community college is cheaper, it usually is. It would be lying to say that they can only afford community college.", "This is their children's other parent. Of course they're talking about finances and college funds. Nobody expects people to be this completely unreasonable.", "How would it be if the payment was a really substantial lottery win, for example? In our area we had a one billion dollar jackpot a few weeks ago, and I was always curious how that would play out in a situation like this.", "Yes I understand that. But OP said that they have incomes that are equitable but she had 6 children and he has two.", "Not all college/university prereq classes are huge 500 student auditoriums. That's one thing students should look into when deciding what colleges to apply for. When I got my undergrad degree, all of my classes (including the pre-reqs) were maybe 30 students max.\n\nIt's also important to look into whether or not the school you want to go to will accept credits from the community college you're planning to go to, if that's the plan. I know plenty of people who had to retake classes because they transferred and the college wouldn't accept their pre-req credits.", "Not only that but often times in community colleges you have time to talk to the professors and you see them hanging around the small campus and all that kind of stuff. My tiny friend group became best friends with a history professor who ended up being the dean of another campus from that school. I still use him as a reference because his title sounds impressive and he always makes sure to talk me up because we all had time to get to know each other. I have references from my 4-year university, but I know none of them personally and they only have a reference of my education. The professor from the community college is able to talk about me personally in more detail than just a grade on a paper.", "I liked going to community college for my associates because it gave me time to have the growing pains of freedom after the regimented high school and allowed me to make mistakes before I was paying higher tuition costs.\n\nThat said, it is better to allow your children options than to shut doors (more expensive colleges) due to lack of funds.", "I’m upset I went to college in the first place but glad I dropped out after one year. My local uni dropped the ball and lost the accreditation for my program the year I would’ve graduated. I was aiming for an education degree. I would’ve been out so much money it’s insane. \n\nI could always go back, but I’m nearly 30 and I’m in a stable career that I like and I’m not planning on having kids. Maybe foster or adopt but that’s my limit.", "I agree - I think the way to approach this is to explain to the kids that college decisions are coming up, that OP has saved money for each of them, which will give them options in terms of where to attend, that their mother's financial position is very different, that OP knows their mother wishes to contribute as well but it's not clear how much she'll be able to provide, that the financial picture for the step and half siblings looks different from their own unfortunately, and the kids should be sensitive to the different circumstances and respectful to all their family members including the other kids.", "Oh, she will stop paying well before that. She'll give the kids food and shelter but not any other thing they need. She'll tell them to ask dad , since she has to save for the other kids university.", "I don't know what their relationship and co-parenting was like before the discovery of the money and maybe this behavior is out of nowhere. I'm sure my cynicism and the fact that we're even on this post had me predisposed to thinking it was unwise to tell her he had plenty of money for college.", "Kids CAN get control as early as 18 of their UTMAs, but there are steps that they need to go through to transition it to a non-minor account. That's how I have my kiddos account. I chose an UTMA because I wanted the money to be his, even if he didn't go to college. 529s have consequences if the money isn't used on education based expenses, but the plus is that its tax free and the person who owns the account has control.", "I would simply keep it in a reasonable investment that he owns.  He doesn't have to distribute the money to the children until they need it.", ">NTA. I can’t believe the nerve of your ex. How dare she? I can’t believe she can’t grasp the concept that you’re not responsible for any kids other than your own. You’re definitely NTA.\n\nBecause they can try and bully OP's kids to get access to their money.", "Plenty of reasons, one of the most important is being able to set up your own lawyer to make sure they funds are protected and only spent how you determine.", "Trust set up certain criteria like amounts and ages of distribution.  A Will just alots the money and/or property in lump sums. No 18 YO should get their hands on big dollar amounts.  Trusts allows distributions for at certain ages like 18, 25, 30, etc.  Plus certain amounts and where they can be spent.\n\nA Trust protects the money and assigns a Trustee and sets out rules for the Trustee to manage.  This will keep the Ex from getting at the money from the kids.", "That's where I'm thinking a challenge would be successful in most places, because it's a significant enough amount that it is tantamount to a lifelong salary but most inheritances are just enough to pay off a mortgage or something like that. \n\nThat said, it would come with its own challenges because it's hard to not come across as a money grubber with something like that and that kind of thing actually matters to a lot of judges. I've seen people get shot down for being greedy dicks but if it seems like they're genuinely just trying to do right by their kids it's taken into consideration more.", "The original post did not include the information that their respective incomes are roughly equal. Several of us asked, and OP answered, and was advised to add that information to his post, which he subsequently did.", "Not only that but sine he's got their education taken care of they have more money for the other kids.\n\nNTA", "Oh so you guys mean specifically a spendthrift trust? That makes more sense.", "I did not know that! You learn something new everyday.", "Inheritance is not considered income in the US so it's not factored into child support, divorce settlements, or alimony. It's a whole separate category so it gets excluded from those things. It is 100% up to OP what he does with that money and could have spent it solely on himself and legally been in the clear. He put it into his kids college fund regardless and is obviously a loving dad who cares about his kids. Absolutely NTA.", "He was super duper pissed off about it.\n\nHe tried to take his kids on a longer summer holiday, but his ex wife lied and said they didn't want to go. He was really upset until he found out his ex wife had worked out she wouldn't get her full benefits allowance (she was unemployed) if he had the kids for longer, so she just wouldn't let them go or she'd lose out on money.\n\nI mean, I only heard his side but I'm not surprised. Some people are willing to fuck everybody over to continue living an easy, subsidised life.", "NTA but you need to control the accounts for your kids.  Think about rolling the funds into a 539 Plan with you and only you as the primary owner.", "How does people like your ex wife and husband exist??!!! Why would you pay for their children??? What does the husband do?? Is he a free loader or what 😂", "Wow, NTA… I’m surprised her husband was ok w that, that’s embarrassing as HELL.", "NTA and do set up a trust like many are saying.\n\nBUT also I want to sing the praises of community college for a second, because implicit in all of this is the idea that community colleges are inferior to a soley-university track.  They are not.  \n\nI dual majored and got an A.S. in physics and an A.S. in math from a community college, then transferred to a 4 yr university to finish both those degrees with a B.S.  I then went on to get admitted to one of the top schools in the world for physics, where I got my graduate degree.\n\nStarting at a community college in no way detracted from my eligibility or competitiveness in a very challenging and competitive field.  What it *did* do was saved me a ton of money and allowed me to graduate with no student loan debt.  It also was one of the objectively best parts of my college career in terms of quality of education.  The professors at community colleges typically have advanced degrees in their fields and are there because they *want* to teach, and the focus of their entire job is teaching.  Contrast this with my prestigious graduate university, in which the faculty of my department included four nobel laureates, a MacArthur genius grant recipient, and so much more.  Some of the best minds in the field.  But...they don't give a rat's ass about teaching, or about any students except for those working in their labs (and maybe not even really those).  They are there to do research and bring in grant money and prestige to the university, and grudgingly teach a class every one or two calendar years because they *have* to as part of their faculty package deal.  They range from enthusiastic but usually poor/inexperienced teachers to (more typically) disinterested or even openly bitter/annoyed, unwilling participants for the time they perceive as \"wasted\" that they must spend in front of a classroom.\n\nI advocate for community colleges for everyone I know who is starting out.  The first 2 years of your degree won't include any really advanced coursework, but you can hammer out your electives with fun and engaging and interested professors, as well as have a much, much better experience and head start with the fundamental building block courses of your chosen field.\n\nSo...by all means, keep saving for your kids!  Establish that trust fund.  But also, please seriously consider the benefits of spending the first 2 years of their degree at a community college.  Community colleges by definition do not offer 4-year degrees, so they'll be transferring anyway to finish the last half of their undergraduate education at a 4-yr university, which they can list when they apply for jobs or graduate schools.  It'll help your savings for them go even further (especially since the average time to complete a \"4 yr degree\" in the US is now actually 6 years) and they'll probably get a better experience out of it anyway and have a great head start on their peers.\n\nThanks for coming to my ted talk lol", "NTA.  Not at all.  But you HAVE TO set up a trust.  If something happens to you all that money goes to your kids and they are minors so she will ultimately be in charge unless you leave specific instructions and a Trustee.", "You are not the a****** and your ex-wife must be out of her batshit crazy mind if she thought that you was going to give the money up so that everybody can go to college what the f***her other children are not your responsibility where did they sit down and come up with this b******* where they thought that they was right", "NTA. This really is 'not my zoo not my monkeys' especially in relation to the ex's new family.", "NTA \nStop what you’re doing and set up a trust. Do it yesterday. Set up rules stating that only your kids have access to the funds and only under certain conditions. God forbid something happens to you and that money winds up being controlled by your ex.", "You wouldn't be \"paying child support so they can save\", you'd actually be directly paying for their children lol", "NTA. This is a great teachable moment for your kids and theirs. You should never have kids you can't afford. You should begin their education accounts at birth, and keep shoving money in when you have it. His ex should never have had 2 more kids with her new hubby because he already had a daughter and nephew to raise. PLAN BETTER. MARRY WISELY FOR THE RIGHT REASONS. \n\nCongratulations on being a responsible Dad. I am sure your kids will love college, and thank you for it.", "NTA\n\nIs this a real story because what???", "Nta , you take care of yours and she and her husband can take care of theirs , y’all make a similar amount and she still can’t manage to make funds for them , but why doesn’t the husband have funds prepared for his own kids ? That’s their financial issues, not yours . And why does her husband think he’s entitled to your money, is she allowing him to mooch ?", "NTA. Tell your ex-wife that you have already helped her by saving enough money for 2 of her children to go to college. \nI’d also start warning your children now to start expecting the begging and shaming to begin. Also, don’t give the children access to the money just pay their schools directly or if you pay for something else for them pay that directly. You never know they may succumb to the guilt trip and I’m positive your ex will suck them dry if she gets a chance.", "NTA,\n\nThis is just the reality of blended families, for better or worse. You have no obligation to their kids. But the poorer couples with the bigger family never seem to get this. I'll allow kids feeling a bit slighted (they're kids after all) but adults should know better", "NTA. Are you a kidding me. What kind of entitled person would even consider that.", "INFO: How much did you laugh at their suggestion? Be honest.", "50/50, similar incomes = NTA", "NTA\n\nThey are delusional. You have no obligation to these children, they're not yours!\n\n\nBut be careful not to let them convince/bully/brainwash your kids into sharing their money with them.", "NTA. you are taking care of your kids. That is what you should be doing. You have no obligation to take care of any other kids, regardless of their relationship to your kids.", "Your children are old enough to know about the money (as you already did) AND to know that her mother is wanting them to split that money. It needs to be stressed to them that it is for them, and only for them, and that the step father and mother can take care of the other kids and have over a decade to figure that out. That you saved the money for THEM and neither you, or them, are \"selfish\" for not wanting to share. \n\nAlso, definitely keep control of it and dole it out as needed so they don't feel responsible and aren't hassled by their mother.", "NTA.  Because you have money saved up is not a valid reason to change any aspect of your custody agreement.  You reasons to keep everything as is are perfectly valid.", "NTA \n\nbut as others have said I would be worried that your kids could be coerced or manipulated into giving some of that money to their now step siblings", "NTA. Plain and simple. You did what I hope to do for my future children. You thought of the future. She and her new partner did not.", "NTA, your ex-wife might be struggling but that’s not your responsibility.  Your only obligation is to the children you share with her to which you’ve met.  Even if she decided to go back to court to augment the custody agreement her reason for asking for child support are not grounded in reality.  She can’t ask the judge for child support to make it easier for them to take on her additional financial responsibilities.  She got married to someone that has at least two other children to care for in addition to the two they have together.  Their financial woes are their own problems not yours.  The audacity of some people 🤦🏾‍♀️", "NTA of course", "NTA. Your financial obligation is to YOUR children. Since you have 50/50 custody of said children, child support is not an obligation of yours, as you already do support them financially.\n\nIt is not your responsibility to provide financial support for the other children in your ex’s house. And the fact that your ex still feels entitled to your money, and even worse has her current husband feeling entitled to your money is outrageous. It is their responsibility to provide for those children. It has nothing to do with you. If they don’t get the same start in life, oh well. It isn’t your fault they didn’t plan better and had more kids then they could afford.", "NTA", "NTA their kids are not your problem", "NTA. For safety sake I would suggest you continue to be in control of your kids college money until after their freshman year so that mom can’t manipulate them into giving her money for their step and half siblings. Pay the tuition and give them an agreed upon about of living expenses money. Don’t immediately give them access to the full sum.", "They really tired? Why would you pay for kids that are not even yours", "NTA. Ex wife and her husband are trying to take advantage. Why all of a sudden pay child support? Answer: because they now know you have $ stashed away for your kids. Pay for their children? Split it up?? No way. They pay for their own. Stick to your guns. Ex wife and husband are the AHs.", "NTA - how self centred do you have to be to genuinely expect your ex husband to pay for your new family? Did she actually tell you that’s why she wanted the money? Cuz that’s absolutely insane", "Wow. NTA. But you already know that for all the reasons you said. You are spot on.\n\nYour ex and her husband are behaving extremely entitled if they think you have any responsibility to any kids but your own! \n\nThis is like the worlds worst version of 7 degrees of Kevin Bacon...for child support!", "I would not give unfettered access to those funds to brand new adults at the age of 18. I would retain control of the money so I had input into how it is spent. \n\nI've seen too many instances where kids get money at age 18 and then completely waste it.", " Nta.   What the heck is with people thinking their ex spouse should finance subsequent children with other partners??    Blows my mind.", "NTA, but get the funds for your kids set up in trusts so they have the buffer of an independent trustee and specific terms of what the money can be used for until they reach an age where step siblings are adults and it's not an issue in case mom and hubby decide to start pressuring them into \"sharing\" with their step siblings.", "NTA and your ex is dumb, there is no reason you need to help her out with NOT YOUR KIDS, at the same time she should have realized that this means - if you're sending your kids to college she now has more money to spend on NOT YOU KIDS for college and more time to save, \n\nafter all at best we're talking about 3/4 years child support, that would not put even 1 kid thru college not even the first year at some of them, \n\nthat alone proves your ex and her husband are not very smart", "NTA. Watch that college money though. Luckily your kids are almost aged out (though some CS cases have you paying longer than 18 if they’re in school)  but if she did want to take you back to court, I’m not sure if that money could be considered and asset & thus put you over the one to have to pay. \n\nAlso, when did you guys go to court & have the judge say you make under this threshold to not have to pay? And where the hell do you live? Lol, in my state, if you make $50 a week you’re gonna have to pay child support. And they will attach that to automatically come out of your check, to your ex, and they will suspend your drivers license if you X number of weeks consecutively, & also go to jail if stop paying. My ex (we don’t share kids) had his license pulled many times for missing weeks.", "NTA Your ex-wife is though. There's no need to support an ex partners future family ever, lol. She's not entitled to that money that you saved for your children. I would probably be wary about them trying to access those finances after your children are able to use them. I feel like they're the type of people who would guilt them into sharing or giving up a large portion. It would probably be more beneficial for them to pick their school or whatever they're doing in life and then you allocating money as needed until later on in life instead of right when they get out of high school.", "This is like when that lady wanted her baby daddy to buy McDonald's for all her kids not  just his biological son lmaoooooo", "I think you are definitely not the A here. I can follow the ex-wife’s reasoning though because it is based on her idea of her family which consists of four children in total. In that perspective this looks like the two kids are “favoured” above the others because of the money saved for them. However, like you mention yourself, “the family” does not exist anymore. I would only be happy as a mother that at least two of my kids have the opportunity to have a college education if they want to. I am sorry your kids have to go through this", "Ya each time on AITA I think this is the most outrageous demand. Then comes yet another AH who demands something even more outrageous making the previous one look tame. The level of delusion is truly funny and tragic in this case.\nOP NTA do not budge.", "Not the first time something like this has come up in this sun where an ex is getting bullied into paying for or even help raise kids that are not theirs. Where does this even come from??  NTA at all. Kudos to OP for handling it and taking care of his own kids.", "OP did not have this money at the time of the divorce, nor any expectation of it. The money came from unpredictable events that occurred later.", "Some states are beginning to remove the responsibility for secondary education as the children as usually legal adults by then.", "> I would also have MORE money to put towards my other kids college expenses because I no longer have to pay for the other two.\n\nThat's...not how that works. He's been saving up to cover their kid's college tuition, but that doesn't mean she should just reallocate the money she was planning to use to help their kids to the other kids in their household. What part of \"splitting everything 50/50\" is so hard for some people to understand?", "NO.  The kids should NOT be able to access the money themselves.  That leaves them totally vulnerable to guilting and bullying.  Pay everything directly to the source.", "Right! \n\n>Her husband told me I could always offer to split the money between all of the children. \n\n\"You could always just *give away your children's money*. I mean, we'd be willing to take it from you, if you want.\" lmao", "If the ex wants child support, she can take OP to court and let a judge decide what's fair. Until then, OP's under no obligation to pay for child support. And definitely isn't ever obligated to pay for her other children.", "Agree, \n\nI'm stunned every time ex spouse shows up to grub money for child w 2nd spouse and or 2nd spouse's child & expect first spouse to share.\n\nThey are divorced. \n\nSpouse 1 pays for their children as they see fit (separate from court ordered/agreed funds).\n\nSpouse 1 has no relationship w your step children or children w 2nd spouse & most certainly no fiduciary obligation.\n\nThe gall baffles me. Just bc ex spouse has built a family unit w 2nd spouse doesn't oblige 1st spouse to participate. \n\nI don't understand the reasoning, I don't understand the math 😆 & am consistently surprised how 2nd spouses think this is a thing.", "I would definitely “loose” all my money in crypto till the kids are of college age. Otherwise OP is going to be nickel and dimed from now on", "I’d like to know exactly what else OP’s kids are currently being forced to split with or subside on with their step siblings in order to “not be cruel.” Not inclined to think this is necessarily a first.", "Consider this: if healthcare and college education were paid for by the state like they tend to be in most developed countries, like half of the arguments posted to this sub would never have happened.", "but i bet she’s going to put significantly less toward their current living expenses and let you foot the bill. It’s coming, and they’re going to make life difficult for you until college is through for both.", "She’s welcome to contribute then. But she’s out of her mind if she thinks you should be contributing to the rest of her children. She’s doing the kids a great disservice by not teaching them that life isn’t always equitable and fair.", "What state do you live in? In most states, a parent can seek an order to modify child support periodically or based on changed circumstances like lost jobs, income change, disability etc.", "So, if the court ordered no support, then he can and should follow the order that’s in place. It’s up to the ex wife to move to modify. Or not.", "No, that's not what OP was saying. He said she could only afford to send her kids to community college. How would she possibly have the money to pay 50% for a more costly college?\n\nAt no point does he say they are splitting that cost 50/50. He said he made an account for his kids to go to school or use as they like when they are adults. That's a gift to his children that he chose to give them. It doesn't need to be split 50/50. If the kids have enough money in their accounts to cover their schooling, I doubt they would go to mom to cover a portion, as it's already paid for. \n\nUnless a court steps in and forces her to pay half of the increased college expenses (which is doubtful if she doesn't have the financial means to begin with), then this is not a 50/50 split. It's simply a gift from dad.", "The 50/50 agreement stops once the kids turn 18 and/or graduate from high school, unless the custody agreement specifically had a provision for college tuition / savings. Sounds like OP saved for this on his own.", "Agree you with but you just know that based on OP ex wife and new partners current actions that op kids will not be getting a dime from ex and step- dad. 100% they’re going to relocate that money to the other kids", "That's what we said don't yell at me lmfao", "They’d have been able to save just as much since they had similar incomes, if they didn’t continue to have kids", "That’s certainly true, I’m just amazed everyday how unaware some people really are..   btw, I’ve made my own mochi before, it’s addictive.", "I think the husband wants the money for himself and has convinced his wfe to go along with it by telling her it's for the kids. To test this theory, OP should tell them he is exploring the idea with his attorney of giving money to wife's other kids but if he were to do that, the money would be in a trust with him in charge where the kids would submit requests for say, college tuition and OP would have the trust pay tuition directly to the college. Same with all other expenses. None of the money would go directly to the kids. OP should make it clear that ex wife and her husband would have zero control and zero say over how the money is spent. I bet you anything that the husband would throw a fit at the idea that he would have no control over the money.", "Yeah, it sounds like she’s going to be telling them to ask dad for every little purchase now and only put any money toward the other kids. If she wasn’t that type of person they would never have thought of asking this. This kind of argument really kills parental relationships because they will know she’s asking dad to use their college money to raise them the rest of the way out of spite.", "I'm so sorry people took advantage and abused your trust.\n\nWe really need (in US) a 'middle band' of fiduciary oversight of estate distribution.", "...so she wants you to contribute to all of her kids and let them know their own parents are so incompetent a third party had to supplement their finances?\n\nYeah, sure that makes sense.", "Let the kids know. She doesn’t seem like much of a mother to them anyway.", "But you said in your edit that your kids are aware of the savings already. Are they keeping it a secret from their mom? Why wouldn't they mention it, especially when discussing paying for college? NTA in this situation but I don't understand keeping that information from your coparent.", "I am pretty positive if she even took him to court that the judge would throw her out if she even mentions OP's inheritance. Especially if it was a one time lump sum payment because it is not considered annual income to base child support off of.", "This is exactly what my parents did pretty much. Paid tuition and rent directly and then I would send my grocery list with the total (plus a little extra) and they would transfer the money. Anything extra I wanted to purchase had to come from my personal account.", "Pay her back for what?! For her responsibility as a parent?!!! These parents are so messed up! Since when did raising your child become a business deal?! I’m so angry for you right now.\n\nETA: OP is NTA", "Pay her back for…what?\n\nIt’s sad when a parent takes something that was specifically meant to benefit their child personally. No disrespect to your mom, but ma’am, you should be happy they were able to attend college with little stress.", "What self entitled greedy little brats like your mother need to understand is that the children SHE CHOSE TO HAVE is not the childs responsibility to pay her back. She brought you into this world, you didn't ask her to and she has NO RIGHT to ask you for YOUR money like you owe her for her own responsibility as a fucking parent.", "Omg, that is absolutely heartbreaking. I’m so sorry she had the audacity to ask that of you. That actually made me feel sick to my stomach.", "Absolutely.  And to specify how and when the money can be disbursed for the benefit of the kids (not necessarily \"to\" the kids - like to pay their tuition directly to a college, etc.)\n\nHate to be cynical, but growing up, I knew several kids who had trusts from parents/grand-parents who died, etc, and it was nearly always a mistake - those who got the money lump sum when they turned 18 or 21 with no conditions?  They invariably blew thru it in months, and most of them were bone-idle while waiting to get paid - \"why go to college, I have a trust fund coming and ima be rich\"  \n\nAlso, ex-wife is \\*certainly\\* thinking about how they can get their hands on those funds, whether OP passes or not, including guilting the kids (\"It's only fair you share it after all we've done for you\", etc) \n\nOP is NTA, he's a great Dad.  Now, needs to finish the job in the way you suggest.", "> what would happen when it comes time to go to college \n\nIt IS time to go to college. The daughter is 17, so (assuming US) high school Junior or Senior, and should be going through the college process.\n\nIf senior, she ought to already have whatever testing completed, have a list of college choices narrowed down, filled out FAFSA and be applying. My 17 year old niece applied as soon as registration opened and has her first acceptance already", "The problem is tho… your kids have to start thinking and planning ahead of time where they want to go to school. How do they do this if they think there’s only enough for select community colleges? It’s not as though he could tell his kids this, and the mom not find out, either.", "This is such a foreign concept to me. I've had my own account since I was about eight years old (still have it tbh) without my parents having access. Is this an American thing or is it just my country that is the weird one? Or both ofc.", "I'm not from a developed country and healthcare and college education is provided by the State lol", "I mean, I agree Mom probably WON'T pay for college at all now that she knows about Dad's savings, and I actually agree that if she can only afford half of community college, she probably wouldn't be paying 50%, BUT what I was responding to specifically was the idea of \"I would have MORE money to put toward my other kids\" implying \"well since Dad saved up, I don't have to contribute anything to THESE kids, so I'll focus on these other kids.\" Which just isn't sending the greatest message to her oldest.", "Yes, legally she's not obligated. Morally and ethically, however...\n\nThough I agree she probably won't do it now that she knows he's been saving.", "Yeah, unfortunately you are probably right. Hopefully he has enough to cover all of their expenses.", "It was directed at only one post, not you!  Thanks for being cool even when you thought I was bitching at you.  Class act.", "I think she'd want to take credit for all of it, sadly.\n\n\"Give me your money but don't tell anyone, I'll let them believe it's mine! What do you think? Ain't that grand?\"", "The kids didn't share that information because they were concerned their mom would want them to share the money.", "Probate isn't always reliable. Ex-wife can tie it up keeping the kids from getting the money for an extended period of time. \n\nTrust just transfers on proof of death from Op to kids, if property is in a trust there is no gains tax the child has to pay on it, trusts can be set up to pay out on certain birthdays, all at once, a little at a time, monthly, only used for school, only used for a home, etc...\n\n\nMain thing being ex-wife can't claim money, can't force/pressue kids to share that money etc...\n\n\nOp needs to be 100% transparent with kids about money HE put aside for them and how mom has her own money she's contributed that is separate. If she acting like this and wanting to take credit for it as well,  she will no doubt try to convince them/guilt them under those false pretenses into sharing because she also contributed to that amount so she should have some say in how it's spent.", "and add how they won't be given a lump sum, but the money will be paid directly to their school for expenses.", "that’s the best way to do it. then they can work like a part time job or something too just for their wants not their needs. there’s so many kids in college who get parents that will just pay absolutely everything for them. i think it’s important to teach kids to work for their own. not like my parents. i had a bf who was 23 who was that type and honestly it was pathetic. his parents paid for all his college tuition to go to nice ass schools all four years and paid for him to go to spain for a semester and shit. paid for his sister to go to an ivy league and his brother to go to a nice ass university too. paid for his car and everything and many tickets and lawyers. He’s gotten a $200 allowance from both his mom and dad so $400 every single a week since he was fucking 11. just straight venmoing it to their son. they don’t pay child support they have two other kids and would help if needed but they actually did shit w their lives. he still lives at home they still pay his car they still give him an allowance. when i met him he was selling insurance but he only worked there a little over 2 months. he left abt a month and a half into the relationship. he didn’t work for months he said he was gonna “doordash” after i advised him not to quit his job until he finds a new one\n\n*insert eyeroll*\n\n3 months into our relationship i found out he would text our mom anytime he was paying for our dates that we would go on or really any expenses. and he was letting me pay half of everything even tho i was working fucking 80 hours a week and i live on my own in an apartment. i been here a year and i lived in my car for 10 months before that and i was on and off living in my car(that i have always paid for since i first could drive) for another 6 ish months even before that. my parents are not involved in my life. i’m 20 and been basically having to support every financial part of my life since i was like 15. he knew how hard i work where he gets his money handed to him and he let me pay half or a little more than half of every date or whatever we spent money on. \n\n(i usually think it’s right to go half but that’s when both ppl actually work and don’t sit around on their ass their whole life and do nothing)", "My parents did a similar thing with me and It really does help us learn how to spend our money better. Although for me it was more like I had a budget for groceries to stick within for the month than sending receipts (would have probably been better if we thought to do it your way). Could have avoided many months when I was having to be strategic with deals & getting some pasta or staple ingredients from the 99 cents store to make it last. Although that's on me too because some days I'd use grocery money for buying lunches instead of making them.", "But, realistically how was he to know that his Ex had lost her mind? 😅🤣😂\n\nIn no universe would her EX pay for HER children with another man...", "Not necessarily. OP's kids were already being told by the mom that they should only be considering community college. That could easily affect their motivation and enthusiasm for school knowing that is the best they can look forward to. OP needed to let his kids know that their wider options than expected. And as soon as the kids start looking at universities, the mom would know something is up.", "From what I've seen of people who got lump sums, what they think is \"rich\" often really isn't, it's just enough to give a good start.", "My mother not only burned through my inheritance but started using my name to get credit after she'd spent the money and ruined her own credit. It's a long story but she was basically bought a £20k house (UK and early 80s, houses were cheaper then) with what would have been our inheritance and, instead of that asset appreciating, she managed to turn it into 30k of debt in my name. \n\nI have no doubts about who the AH was in that mess.", "I hated even saying so, but people do crazy shit over money. And people do crazy shit when they feel entitled.", "Right?? I mean what?? Does the ex's husband have no pride? Does the ex?", "The mom should just be happy two kids are fully taken care of and she doesn't have to help with them. She can instead apply that to her other kids. But no she and her hubby decide to be greedy aholes. In what planet did they think asking the ex husband to pay for unrelated children would work?", ">The only ones legally responsible for the child are the parents.\n\nThere ya go lol", "Thank you.  I worry I'm too adhd like and say way too much; but I'd rather say too much and it be unnecessary than not say enough to help someone asking for help and leave some possibly fucked up stuff to happen to unsuspecting nice people who could have used a warning.  I used to be that way, silver lining, give too much, think best of all; and then was damaged bad and had to learn to think defensively when it wasn't my nature.  \n     If you'd like to help you could translate my verbose over-explaining into easily readable bullet points and comment directly to him.  I fear the caution re life insurance and the 'i feel bad about myself so let's kill op' which isn't directly about money, it's just the measurement,  are lost in the mess. I worry, lol.  I hope OP read it and me asking you to help isn't necessary; and you, obviously, don't have to help me communicate.  \n   Thank you for the positive feedback. It means a lot.", "But she could just take credit for the money OP saved up. If lying isn't out of the question, anyway.", "Yikes, NTA. Glad to see you’re protecting your children on this, that is their money not their siblings", "But that's what adults do too. Somedays you eat lunch out, sometimes it's ramen or PBJ to make up for the splurges!", "Exactly.  A 17-year-old might think a $200k trust fund will make them \"rich\" - it won't.\n\nI always felt like they weren't done any favors knowing the funds existed; they all seemed crippled by it.\n\n(Of course, if you're a DuPont heir or something, that's a whole different thing)", "She is absolutely the AH.\n\nSome kids get gaslit or guilted when they get justifiably angry at this kind of behaviour/theft.", "Oh yeah, the thought process has taken root. that 50/50 agreement is going to be off the table. Doctor visits, clothes, events, vacations are all going to be on dad. She may put a little toward their college for the credit, but she’s going to put the cost of living completely on dad now.", "Yeah at what point should you be like yeah this is fine I shouldn't have to provide for my own kids, my wife's ex husband can. What. Why would that be OK in his mind. He should provide for the children he had. Like op is. And he should be grateful op is providing so he doesn't have to provide for 5 kids.", "It's not always 18, depends on the state. In NJ I think they can only get control at 21.", "Meh, not your blood, not your problem. Make sure that your kids and your kids ALONE have access.", "Typically, CS Payments are based on income.  Injury payouts and inheritance payments are not considered income.", "Are you the anxiety weasels in my head!? I mean, my separated at conception twin!?\n\nI get so excited when I hear others whose brains work like mine.\n\nEven if it's for coping reasons, or dysfunctional brain (ADHD) our brains do it for good reasons. \n\nI appreciate your brain and the human it controls 😁", "Yes. When I had my confrontation with my mother after finding out about the debt, she tried that. \"I had to raise you as a single mother. You don't know how hard it was!\". It was like she thought I didn't see all the brand new cars, clothes and holidays appearing during childhood. Not holidays for the family either, just her and her husband. I'd been away from her long enough to see through the manipulation by then but I can easily see how kids can get lost in it if they didn't escape.", "Neither are lottery winnings!", "What if it had been a lottery win? Do you know? I was always curious about that.", "I'm only gonna talk in regards to large winnings and only for the US laws cause idk other countries. If you win $50 obviously it's not going to be factored in. In the US they are considered marital assets so if you win and then get divorced after it's split as marital property. If you already were in the process of getting divorced its not considered marital property anymore so you keep it 100% as long as you were already separated. It would be considered income though and therefore gets factored in for child support and alimony. If you have outstanding child support payments they'll automatically deduct those from your winnings to pay off your child support debt. Anything over $600 will be factored in for the US as income so a portion of that particular income would be split up for child support, alimony etc. If you win a jackpot of some kind it will get split up as well regardless of whether or not you get it in the lump sum or annual payouts.", ">She asked me why I never told her sooner and I told her because I was taking care of our children and it wasn't something she needed to know.\r  \n\r\n\nBut I don't get it, it was something she needed to know so she wouldn't steer your kids into community college no matter what. Why not tell her?\n\n>A few days after this talk she called me and alongside her husband said that they would like me to pay child support for our kids, so that they can save more money for their other children's futures.\n\nAh, now I get it! She's going to use you coming into money as a reason to take you to court. That's a really crappy thing to do, punish you because you decided to save for your kids. If you spent the money on a vacation, would she be asking for child support? NTA, no doubt.", "NTA", "Nta tell them you'll pay for a vasectomy tho because petty", "NTA. The other kids are not your responsibility. Her and her new husband should find a way to save for them.  The fact that you have been able to is irrelevant and nothing to do with her and her new family.", "I bet they don’t share expenses evenly anymore. It’s all going to be ask dad from here out.", "Trusts with strict conditions are probably the best option here because it also means if anything should happen to him, it automatically goes to the kids with the conditions placed on it. Honestly, I'd also consult a lawyer.", "He’s got one income. They got two.", ">I understand their reasoning (that is: not discriminating against siblings), \n\nThat’s not an issue, at least not on the OP’s side. He is saving for both of the children he is responsible for. It’s to be hoped that the ex-wife and her new husband are not discriminating against any of the children they are responsible for.", "I can't imagine any planet,  dimension or timeline where they have any right to make such a demand.", "OP, do not put it into a 529 unless you want a whole bunch of problems associated with it. They tend to create a lot of headaches and right now the accumulation by the time they hit college is not worth those hassles. Financial advisors cringe at these unless they have multiple children and at least one will catch the benefit.", "You shouldn't have told them anything. This will be on their minds, and they will be focused on how they can get their hands on it. It won't be the last time you hear about it.", "I love how I, an actual practicing lawyer, with actual knowledge and possible solutions, gets downvotes. OP says it’s a non-payment order, so he can continue to follow it.", "Maybe you need to remind her of this! Tell her you’re just honoring her preferences to not be reliant upon you.", "I have a friend whose ex expected more child support when she had a baby with her new husband.", "Sounds like when new husband found out about the accounts he started asking his wife why her ex wasn’t paying child support if he has all of that “extra” money. There is ZERO legal or moral obligation for ex husband to pay child support in these circumstances. This is a pure money grab.", "Nta\n\n\nThe brass balls of the new husband to say just share between all the kids if you won’t pay us child support…🤦🏻‍♀️ \n\nSupport your own foofing kids you lazy bugger! Op has nothing to do with either them, nor the stepson or the nephew they took in. \n\nThis is the 2nd post about similar subjects in  the last 24 hours!", "Did you tell her to gtfo?", "Any savings are counted against you on FAFSA.", "It also sounds like a lot of OP's savings contributions came from settlement and inheritance money, which I don't think would factor into child support calculations.", "OP had a large pay out after an injury and inherited money. That's not just savings from his pay check. Doesn't mean he should give in to his ex's demands", "Murderino?", "Trusts can have more ironclad provisions, and may have some tax advantages depending on where you are.  More importantly though, at least here, probate will take a not-insignificant portion of the money.  Because of that (again is prob location based), the more you can keep from going thru probate, the better.", "The audacity of ex's husband to say OP should split the money evenly between all the kids. Some of these stepparents on Reddit really take the cake lately.\n\nOP you are NTA. You did what you did for your kids. Unless the court orders CS tell your ex and her greedy husband to kick rocks.", "Exactly. The kids will be adults here soon and need to be aware of what's going on and how they could get blindsided by their mom and step dad.", "But she also has a 2 parent household.", "and probate can take months to a year to settle, which  the 17 year old probably doesn’t have.", "This is exactly why I will never tell my stepkid about any inheritance in the case that something happens to her dad because I know that people go insane once they find out that family is leaving relatives money. My own family unfortunately will only leave money to my bio daughter because they know that my stepchild's mom will try to get her hands on her inheritance and blow it. It sucks but if that is my family's wishes then so be it. We have control over the inheritance. Sucks going through legal loops and a bunch of paperwork to make sure kids do not get screwed over. I have seen people go nuts over inheritance.", "I’m noticing there’s an influx of posts wherein divorced and remarried partners seem to think their ex partner is responsible for children that aren’t theirs. What the hell?!? It’s so crazy to me! \n\nAny children that aren’t biologically or legally yours aren’t your responsibility — why do so many people seem to think otherwise?", "But 4 extra kids and only one extra income, still means they come out behind.", "Omg I would have never had told the other parent. She will try to suck him dry in anyway possible.", "and the kids are going to resent her for it. My dad used to have every other weekend and paid child support because my mom was a teacher and we all know that wasn’t a living wage for a single mom, and he made probably triple that. if something like a soccer game came up and it had me staying an extra weekend with him he’d talk about how if I was with him more then she obviously needed less child support because he was taking on feeding me and stuff for an extra weekend. meanwhile my mom drove me to and from my school, paid for food across the board, shoes, clothes, etc. she covered every basic need and wasn’t out there buying a new car or getting manicures and stuff. she ALWAYS struggled. i was 8. i really resent my dad for pointing out every last thing about my existence had a price tag to him.", "NTA. I'm shocked at the audacity of them, especially her husband. Why would he think you'd do his job in providing for his own kids?", "I'm imagining them bringing this same idea to the husband's ex or the nephew's parents and getting the door slammed in their faces each time.", "Not 4 kids, six kids. 2 are the stepdad, 2 are the stepdad and ops ex, and 2 are ops and his ex's.", "NTA OP -- You chose to have two children, who you can support. Your ex chose to have two, plus two more (despite her husband's responsibilities to a FIFTH child), and they are caring for a sixth child (out of decency, good for them). Their choices about how many kids they had are their choices, and they and their children get to deal with those consequences.   \nI think all the recommendations here to safeguard your children's finances are good, especially given your ex's and their step dad's response to hearing they had money set aside for them. Making it clear those dollars are intended for them to invest in their futures -- either education or career or other investments that will help them long term.   \nBut, know that your children may chose to support their siblings through out different times in their lives, which is absolutely normal. I don't have half or step siblings, but my sister and I have both done a lot to support one another. I used to drive 100s of miles to babysit for free all weekend once a month for her so she could work. She let me live at her house rent free, no utility payments, barely paid for groceries, etc, for three months. It's not loaning each other $1,000s of dollars, but i'd probably do that too if she needed it. Teach your kids good financial values, give them the option of using you as the \"Bad Guy\" if someone pressures them financially in their family, and then be okay with them making their own financial choices.   \nYou sound like a good dad, your kids are lucky to have you.", "If he has the money in a 529, it typically has to be paid directly to the school to count as a qualified education expense.", "Let's not forget to tell OP he sounds like a great parent. He got money not once but twice and put it in his kids' accounts, even though he would have been totally entitled to use it on himself since it was his to begin with. Not everyone would do that, especially as it sounds like he had already saved a substantial amount. Also he sounds like he supports his kids' choice to go to college or not. Also not something every parent would do.\n\nOP you and the lady from the other post who explained to her kids that her stepkids' feelings are valid about being children of divorce win Reddit's parenting today.", "A good idea no matter what - kids in college can get into things that lead them astray - if it's your money being invested - it's not unreasonable that you pay the bills and not hand it to them to pay the bills.    \nThat way if something goes wrong the money doesn't go down the drain and they might have a chance at going back when it gets cleared up. Speaking as someone who had to take a semester off. lol   My full scholarship stayed protected thankfully.", "I remember reading a story on here where a man (divorced) made college funds for his kids. When able to gain access to it one of them was convinced by mother/ex-wife to loan her the money and then it disappeared. I hope that doesn't happen to OP's kids.", "Yep, looking to steal for his kids in the name of \"fairness\", might even end up straight just stealing from everyone.", "It also sounds like they already DID go to court when they split up and the judge didn’t order CS because their incomes are similar. It sounds like OP had fewer kids and maybe also made better financial choices to save the money, not that he makes significantly more", "I would try to get them to repeat what they said in writing in case of the event where they do take him to court.", "I think this type of step parent was the nightmare of every kid with separated parents. My dad dated a woman when I was a teen, that tried to lecture me what to do, I shut that down real quick. \nThe amount of parents that destroys the relationship with the kids in favor of their new partner and step kids, will always disgust me", "Omg, what a terrible mother!", "My nephew was a teenage father, his (then) teenage girlfriend's mother expected child support to be based on what my sister's ex paid her for my nephew.", "Ok, and if he doesn't? Now OP has said he will pay for the other kids' college. Why would he want to do that?", "A trust operates differently than probate, which would likely grant OP’s children the accounts, but their mom could conceivably still get her hands on it. What a trust does is give legal title to the accounts to a trustee, who would manage the accounts and eventually distribute payments for the education of the children. Since OP would not “own” the accounts anymore, ex wife has no claim to it, and neither do her children (or even the children benefiting from it until they are eligible by the terms of the trust to get money from it). Even if OP’s will leaves the accounts to his kids, their mom could still, as someone else mentioned, take the kids to the bank and get access to the money. If the kids can’t access the money, then mom can’t either. Plus, a trust could withhold the remainder of the accounts from the kids for as long as the mom’s other kids are in school as well, preventing her from getting access after OP’s kids are out of school. It’s just kind of a better safeguard given that ex wife seems so entitled to the money, in my opinion.\n\nAnd, the trust can be as simple as a sentence or two in OP’s will along the lines of “I leave [the accounts] to X in trust for the educational benefit of Child 1 and Child 2, with the remainder of the accounts distributed to them upon [insert desired event here, birthday, graduation, specific year, whatever].” Simple as that, and for all we know, that’s what the will does anyways. \n\nIn sum, it just makes it even harder for the ex wife or her current husband to take advantage of the money OP has saved over the years.", "Same for the state I live in.  I know because my husband's ex tried include my income in her child support calculations.  The judge did not go for that.  \n\nI will say that I am very in favor of the PARENT paying child support as required.", "true, but even so. when you have a large family it does mean your paycheck is spread thinner across more people. he only had the two kids, so of course he had more to give fewer people. also, who’s to say neither stepdad or mom haven’t had some kind of modest windfall at some point themselves? there’s also now two incomes factored in.", "I know right. It’s just ridiculous and infuriating that people think they are entitled to someone else’s money!! I mean I’m sure OP doesn’t even know exs kids why would he hand over his money to them😳🤣", "Lol did you mean to put \"text our mom\"? Because that would make this a whole different story.", "You're mad he won't let YOU freeload off his parents", "I am sorry but what the f…? You are not entitled to your boyfriend's money? So what if his parents gave him an allowance? You sound entitled saying oh it’s ok to split a dinner date only if both parties worked for that. It’s still his money, so not your problem what he does or doesn’t do with his money (wherever that money comes from).", "My ex wanted to reduce the support paid for our child because he broke up with his gf, who he had a second child with.", "Cuckoo for cocoa puffs! People are cra cra 😂🤣😅", "INFO: where is the other kids’ bio mother?  Isn’t she contributing to her kids.", "> Also, I'd be extra careful with the college funds, your kids could be bullied into sharing with their step/half siblings in the future.\n\nThe first thought that crossed my mind reading this was that the OP should keep control of the money and make payments directly to the college. \n\nAnd make sure that the kids know not to let themselves be coaxed/bullied into taking out loans to divert the money to the other kids. I honestly wouldn’t be surprised to read an AITA post from a teenager asking if they are TA for not taking out loans for [Insert Relative] because they’re already covered for college and the “fair” thing to do is to “share” [Insert Relative]’s debt.", "Yeah, one of the kids is 17 alredy, and they have just realize that maybe they should have save some money, really?", "Well I think the solution is clear, each time they come and ask about this just tell them \"so you are not paying for college for your own children, and now you want me to pay for someone's else's children?\".\nAnd have a talk with your children to make sure they don't harass them to try and get them to share the money. \n\nNTA", "If OP is only concerned about what happens to the money if he dies, then there are POD (pay on death) and UTMA (uniform Transfers to Minors Act) ways of titling those bank accounts.\n\nA trust would help ensure that the money is used as intended but OP would need to make sure his ex doesn't end up as the trustee if he dies.\n\nThere are other ways to make sure the money is used for college such as a 529 plan.\n\nP.S. Op is NTA but is an idiot for mentioning that money to his ex and not expecting something like this to happen.", "I'm not sure if it's that simple...I recently completed my estate planning as a single dad with a young kid. \n\nI'm sure it varies by country/jurisdiction, but to actually set up the trust would've cost me $10-15k...Instead, if anything happens to me - all of my assets go to my estate and the executors I've named will then set up a trust fund, spending the $10-15k at that time, with the instructions I've outlined to pay my daughters expenses until she reaches a certain age, then she gets a certain lump sum and then at another age, she gets the remainder. \n\nMy executors are from different parts of my family, must agree on expenditures, are extremely loyal and have a vested interest in my daughter's wellbeing...And also (at least at this moment) are well-off and successful in their own right and therefore I can't imagine them being irresponsible.", "There can be stipulations for disbursement if they don't  go to college  or trade school starting at an older age.", "It's just an illustration of how seemingly trustworthy people (longtime family friends, best friends) can morph and turn into predators when they get an idea there's money available.", "In fairness, they wouldn't be on aita if they were good stepparents. We see the worst here. I like to think for every gobshite we see, there's a step parent out there offering to help on a school run and who speaks amicably to the other bio parent at some sport or school event for the kid. I need to believe that because the ones on here are horrendous", "Why are you still with him? Waiting on that proposal, huh? Girl...quit playn. Your plan is too gold dig, aint it? I wouldnt be with a man that treated me that way (unless I had a plan to use him later for money)....Find someone that values your values or shut the f up! The audacity! Wow....", "My parents were both single parents when they met, so I have two half siblings from their previous marriages. We have a large age gap but I'm very close with my siblings... however, I barely know my sister's mom or my brother's dad. As a kid I met them each a handful of times, and I haven't seen either of them in over 20 years. I don't have their phone numbers and all I know about them is what my siblings tell me. \n\nI've never received so much as a birthday present from either of them, let alone expected them to contribute to me financially in any way — nor should they! My siblings' parents care about me to the extent that I'm their child's sibling, and vice versa, but it's not their job to make sure I grow up \"equally\" to their own kids — and my parents would never expect them to throw down on that. To ask your ex to chip in for your stepchild to go to college is a whole 'nother level of entitlement.  \n\nOP, NTA — not even a little. In fact, I'd be humiliated if I learned that one of my parents was shaking down their ex on my behalf.", "I'm grinning so hard my cheeks hurt !  You are as sweet as can be !   Twinsies !!", "Hmmmm… the majority of the time child support is barely enough to cover a fraction of expenses. I think people hear about celebrity child support amounts and think that’s what everyone gets. In reality, it’s often a pittance compared to what the child actually costs. It might feel like a lot to the person paying it; but to the person who pays the majority of expenses, it is not. Raising kids is expensive. Most people are not swanning around living an easy subsidised life on their childcare payments. They are scraping and sacrificing. At the end of the day, divorces are expensive.", "What type of losers believe you should pay child support for kids that are not yours and they can not afford? Dear god.", "NTA. \n\nEither the new husband is an idiot or OP was being threatened.  \n\nIt’s not like YOUR quality of life is being improved by the money, but his the children shared with the ex-wife will definitely benefit from the money. \n\nEx is a little entitled, methinks.", "NTA. My mom was sort of like this with my dad. When she remarried and had new kids, she only wanted me and my sister (from my dad) around so she could use the child support to offset costs of her new family. She didn’t pay for any of our medical bills or clothes or schooling. And she’d try to frame it as my dad being unfair when in reality she just wanted more money to sock away for her new life. Flash forward, my dad is dead, my stepfather of over 30 years since I was 12 doesn’t consider me a part of the family, and both of the younger siblings from him have cushy jobs at his business. \n\n\n\nMy point here is that I highly doubt your kids’ stepdad is going to help take care of your kids if they need him to one day, and he married their mom with them as part of the deal. You did not make that sort of commitment to his kids. Don’t feel bad, just keep being there for your kids and let the ex figure it out.", "That’s something that always amazes me in these disputes.   It’s as if the ex is supposed to be responsible for all the children of the second marriage, as if they didn’t have another parent who is responsible.", "I give gifts to my oldest daughter’s little sister, as well as her stepmom and my ex. They give my younger kids gifts too. \n\nAnd I still think these people are tripping to suggest OP pay for their kids college", "Ask her if her hubby comes into a huge sum of money if he'll be contributing to your kid's futures?!", "Yes! I've seen other AITA posts in the past where this happened! OP is responsible for HIS kids! Also, 1. not every kid HAS to go to college and 2. the kids could go to college on a scholarship or there are work programs too. There are other options other than let's hit up the ex-husband for money.", "What does any of that have to do with OP's question?", "It's what I said. \n\nI may understand their reasoning, but OP is not a AH for not complying", "Not his monkeys not his circus", "I get where she might feel bad about that but seriously - in her home there are 5 kids.  That's a family of 7; unless she & her husband have huge incomes - that would be a monumental amount of $$ to come up with.  \n\nThere's no shame in not being rich, that's a tough thing to admit to ones kids especially if You  seems to be in a better position.", "A trust with someone besides the ex as the trustee. If the kids are minors there is nothing to stop her getting access unless there is a trusted trustee with your interests at heart.", "I knew a few of them in college. One didn't really get his act together until he was in his 30s and his money had almost run out.  \n\nI wholeheartedly endorse seeing an estate planning lawyer.  When you have the trusts and wills drafted make sure your kids know the details and how to get ahold of the trustee in case something happens to you.", "This is how I have my 8 year olds savings account. It's in his name but I'm custodian.  It's for when he graduates high school. It's not a college fund it's a start your life fund. Travel, trade school, college, possible down payment on a place of his own I'm fine with any of those choices. His grandparents have a first car fund for each of their Grandkids. My FIL wants to make sure they all have good vehicles. The rest is up to the parents.  😅", "I concur. And after he has done so, make sure he TELLS HER that the money is in a trust, managed by him, but with provisions already in place to be managed by an attorney in case of his death. And I wonder if the trust can be made the beneficiary of a life insurance policy....cause that would solve the true crime potential mentioned above too! That way she knows there is NO WAY for her to manipulate her way into a single penny of it.", "You sound kinda like you feel you should be entitled to his parent's money, and that makes the rest of your story come across as bitter and ugly. Don't like it. Don't like you.", "He shouldn't have told the ex tho", "There definitely are. When I was growing up, a few of my friends had stepmoms and dads. They all had great relationships with there bio parents.", "This really is the way to go. This is what my parents did with me. Although I’m an only wasn’t in the same position as OP. They helped me for a few years after college as well, but they would only give me what I needed (rent and bills) plus a little spending money for food. It really helped me get ahead because I was working full time and was able to save all of my money for a home. I was able to buy my own home by 25 and they actually gave me the remainder of the money which i used for my mortgage for the first couple years. Their requirement were that I either worked full time or was in school. It really motivated me to try my best because I knew they would continue to help me as long as I was doing the things they wanted me to. Essentially paid me to go to school and save money. I’m so grateful for this and intend to do the same with my future children. I understand not everyone has that luxury but definitely don’t give it to them all at once, at 18 I probably would have bought a Ferrari and some exuberant apartment that would have left me broke by the time I was 20. Also OP not the asshole, you saved money like a responsible parent. If your ex had other plans that’s on her..", "Yay!\n\nMy brain had to say something 🤩", "NTA. You have a legal agreement and are sticking to it and are ensuring YOUR kids futures. Your ex chose to raise 6 kids and didn’t plan accordingly. You don’t have any obligation to those kids and she and her husband need to get off their high horses. \n\nI would talk to your kids though and ensure they don’t feel manipulated into sharing their money with their siblings.", "That happened to my brother but in a slightly different way. His dad died when he was young and he has three half siblings on his dad’s side from his step mom. When his dad died, he had a will or trust or something in the kids names for money that would be used for college, first vehicles, something like that. His wife gained access to the account and starting draining it making improvements to their home so she could list it and move out of state with the kids. \nFortunately, my parents realized what was happening and got an attorney and froze the account. Unfortunately a lot of damage had already been done, and it was only frozen until he was eighteen. The other siblings were all under 12. My brother got his portion and then the account was no longer froze, so none of the other kids ever saw the money their dad left them.", "Bud ur only a couple years away from that nightmare of a ex wife. U got this. Ignore and keep living. NTA", "nta, ur ex wife and her husband need to figure out how to get over it and get better at their own money management or whatever they have to do", "NTA\n\nAnd I would only pass the info on a need to know basis from now on.\n\nAlso if the kids do live with you more, you should sting them for child support.", "NTA. But be very careful of the money. Your kids could get bullied into sharing the money with their siblings and if god forbids something happens to you before they are adults their mom could have control of the money", "I'd be petty as F, after being called an AH by that ex's husband!", "A few years ago, this girl went on a dinner date with me. The next morning, she texts me about how her boyfriend is glad she's meeting good people.\n\n...\n\nUp until then, I'd assumed she was single. I was just thinking, \"Your boyfriend is so bad at providing for you that he's encouraging you to go on dates with other people so that they can do it? That's just... Cringe. I'm out.\"", "Wth, that’s nuts.  It was her way of telling you she had a bf I guess.  Not sure why they don’t just tell you upfront instead of wasting your time.", "I thought the same thing!!  lol"]}