{"id": 4838, "submission_id": "zmy5z2", "title": "AITA for using religion to get an “accommodation” at work.", "selftext": "I(28F) moved to the US last year. About 2 months ago I started at a new company. It is relevant that I am a practicing Muslim, and that I wear Hijab (so visibly Muslim).\n\nI share an office with a man. The office is very small and the window does not open. Also the office has opaque walls and a wooden door (relevant).\n\nMy office mate insists on having the door closed all the time, he says it helps reduce the noise. I would not have a problem with it, except my office mate stinks.\n\nTo be fair to him, I don’t think it’s from a lack of hygiene, in the morning he would smell fine, but two hours into the work day, I would get headaches from how bad his sweat smells. And he sweats a lot.\n\nI tried my best to get him to leave the door open, at least that way the fresh air would disperse the smell, but no dice. I tried talking with HR about the situation, but all they came up with was that he had a medical condition and they could do nothing about it.\n\nI sympathize with the dude, I really do, and he is good people, but I just can’t handle the smell anymore, so I went to HR and told them that per my religion, I can’t be in an *isolated* space with a man I am not married to. Which is 100% true, it’s not like I made it up. So I told them they either had to move my desk, or the door should be open all the time.\n\nThey don’t have the space, so they told him that he is no longer allowed to close the door if we are both there. And finally I could go through the whole workday without having a headache.\n\nBut now he is pissed at me, and is calling me an AH for pulling the religion card to get my way. So AITA?", "created_utc": 1671143191, "permalink": "/r/AmItheAsshole/comments/zmy5z2/aita_for_using_religion_to_get_an_accommodation/", "score": 175, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the AH because I used my religion to get an accommodation at work that impacted my office mate negatively.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. It’s a shame you had to use religion to be comfortable in the office. If his smell is so bad it causes headaches the door should be open. That shouldn’t be rocket science.\n\nI wonder if HR would like to be in a closed room with him for hours?\n\nEdit: Also, don’t let people make you feel bad for asking for religious accommodation. They’re jerks.", "NTA.  It was very clever of you to find such an great solution.  He can't help having a medical condition, and you can't help being very bothered by the smell, to the point of having physical pain (headaches).  You asked HR for help, and they wrongly refused, so you solved the problem yourself.\n\nHis preference to have the door closed does not trump your reasonable need to have the door open because his smell is so overpowering and terrible. He is an AH for not caring that his medical condition is affecting your health and well being.", "Normally I'd agree with him since your religion clearly isn't the reason you need the accommodating since you are fine sharing a space with a man but I'm gonna go with NTA because you really did your best to resolve the situation without embarrassing this sweaty dude and you give him the benefit of the doubt on his hygiene so you had to do what you had to do to do your job. If he comments on it again I'd let him know the real reason you had to take such drastic measures.", "NTA. You should HAVE to pull the religion card to get something done. You did what you had to do to to get a better working environment.", "Hahaha I did not expect to read this. \n\nNAH. You gotta do what you gotta do. He shouldn't be so sensitive about it but at the same time he may have a right to feel a little bit hurt. I'm giving him the benefit of the doubt. You are definitely not TA in any case.", "NTA. I think you handled the situation as diplomatically as you could. (HR people *hate* situations like this). Hopefully he can get some noise-canceling headphones.", "Ehhhhh because HR refused to do anything before, NTA. In literally any other scenario, you would be the AH for claiming a religious need you actually don't observe, but fighting a hostile work environment caused by unreasonable catering to one protected class (medical issue) with reasonable accommodations for another protected class (religious group) is genius.", "NTA.  He has a medical condition.  You have a religious accommodation.  That's life in the grown up lane.", "NTA, you have something and used it. You didnt lie and got yourself an environment where you can actually get work done without headaches. I dont see anything wrong with that.", "NTA\n\nIt is only an AH move if it's not truly in your religion or you don't truly believe it. You are not an AH for finally standing up for your beliefs, even if it took a non-religious motivation to get you to go there.", "NTA - But I would also put in an anonymous complaint about that person's hygiene after so many hrs at work. He either needs more deodorant or may have a medical condition he doesn't realize is 'that bad'. Either way HR can be the one to discuss it with him.", "NTA but you are working with assholes. I'm just jealous I couldn't do this myself.", "NTA, you tried to solve it the “traditional” way, but your HR department were either incompetent or  AHs themselves. And like you said, you did not make it up.", "NTA - You didn’t lie, and even if you had to so be it. Would he had rather you have told him the truth, that he smells so horrid it makes another human being feel physically ill? How embarrassing for him. If he keeps making an issue out of it I’d just tell him outright (and loud enough for all to hear) that you did it purely to preserve his dignity because he smells worse than a hobo. Maybe he’ll get the hint then and shut his gob.", "NTA but if he's going to play the \"you're an ah for playing the religion card\" card then you should tell him it's actually his stink.", "Make a peace offering and get him headphones to reduce the noise", "NTA \n\nYou should not have to use the religion card though!\n\nThat is vile. I could not work anywhere smelling a colleagues body odour. \n\nI would be pushing that higher up. \n\nAnd mate, he can do something about his medical condition!  Shower at work, change clothes, I don’t care. But. Yuck!!!!", "[removed]", "INFO\n\n>  I went to HR and told them that per my religion, I can be in an isolated space with a man I am not married to.\n\nI assume you meant **the opposite** of what you *actually* wrote here?", "NTA but if I was your employer, depending on the field if you have to be separated from 50 percent of the customers or merchants we have to make deals, I would consider you not fit for the job. Taking the smell in consideration, that can be unbearable. Given that hr didn't give a shit, you were using your last chance. I also have a colleague which stinks. Even though we are in a big space it gives me headaches. He doesn't have any right to be angry, if he has a condition he should learn using antiperspirants.", "YTA. The truth of the matter is that you don't mind being in a closed office with him, regardless. Instead of doing the decent thing which is try to have a really difficult discussion with him, you did pull the religion card. Difficult discussions are just that, they're difficult. But it's significantly more unkind to just pull that card that automatically gets you your way for your comfort and over rides what he needs for his own comfort. \n\nNow... when you said forbidden, I assume that the company gave it the same gravity as one would to something \"haram\" like eating pork. If I'm not mistaken, there's nothing in the Quran that makes it haram. It's something pulled from Hadeeth, which cannot render an act haram when it's not set out in the Quran. I'll leave this here because I feel like it's an important distinction to make and probably one that HR don't understand. If they did, I don't know what they would do with it to be fair. It might not change their stance. I completely accept that there's going to be commentary on this. Go nuts my dudes.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(28F) moved to the US last year. About 2 months ago I started at a new company. It is relevant that I am a practicing Muslim, and that I wear Hijab (so visibly Muslim).\n\nI share an office with a man. The office is very small and the window does not open. Also the office has opaque walls and a wooden door (relevant).\n\nMy office mate insists on having the door closed all the time, he says it helps reduce the noise. I would not have a problem with it, except my office mate stinks.\n\nTo be fair to him, I don’t think it’s from a lack of hygiene, in the morning he would smell fine, but two hours into the work day, I would get headaches from how bad his sweat smells. And he sweats a lot.\n\nI tried my best to get him to leave the door open, at least that way the fresh air would disperse the smell, but no dice. I tried talking with HR about the situation, but all they came up with was that he had a medical condition and they could do nothing about it.\n\nI sympathize with the dude, I really do, and he is good people, but I just can’t handle the smell anymore, so I went to HR and told them that per my religion, I can be in an *isolated* space with a man I am not married to. Which is 100% true, it’s not like I made it up. So I told them they either had to move my desk, or the door should be open all the time.\n\nThey don’t have the space, so they told him that he is no longer allowed to close the door if we are both there. And finally I could go through the whole workday without having a headache.\n\nBut now he is pissed at me, and is calling me an AH for pulling the religion card to get my way. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA and I'm glad your headaches stopped. Your coworker can request another office or the ability to work from home.", "NTA. You had to do what was needed to get the result you needed. I can't think of a medical condition which exists whereby the person has poor hygiene. He is causing a health hazard by being there, and in this modern post-pandemic era... he should be doing his job working from home to prevent stinking up the shared office.\nI'd go as far as to gag and puke whilst he's around to show how intolerable his aroma is.", "You're NTA. He may not know it,  but he would have liked it a lot less if you told him the real reason.", "The guy can get earplugs or headphones. He'll be fine. You getting a nose plug would be way more conspicuous and embarrassing for everyone involved. Do what you gotta do. I also saw in another comment that your religious accommodation is genuine, although you were willing to let it slide previously. Obviously and extremely NTA for many reasons.", "NTA because he did the same thing first.\n\nHe managed to claim he smells as a \"medical issue\" so he can't be pulled up on it, so you pulling the religion card to get around the problem is completely fair", "NTA: you did what you had to do, and as a plus you are following your religious guidelines. So win win!", "NTA - the fact that he can’t help smelling bad doesn’t make the smell go away. It’s unfair of him to expect people to be locked in with said smell and unfair of HR to expect you to … hold your breath? It sucks that he’s mad but compromises have to happen sometimes in shared spaces.", "NTA. Thank you for supporting your son.", "You are lying, and using the religion you’re not following to get your way. \n\nOf course YTA.", "If he’s that distracted, he can get noise cancelling headphones.", "I mean, I didn’t like that I was in an inclosed space with him, I just didn’t know how to bring it up. I didn’t want people to start saying my religiousness is weird (which happened in my last job, because I used to have to pray in the break room).", "Obviously she DOESN'T truly believe it because she didn't bring that up at the very beginning. She only used it as a crutch after a period of time, so it's just an excuse, not the truth.", "I already went to HR about his smell, they said it was due to a medical condition, and that there was nothing they could do about it.", "I think you commented on the wrong post", "I'm sure it's a typo", "Yes, thank you, autocorrect got me", "OP did mean the opposite, in islam touching someone of the opposite gender after a certain age without marriage is completely forbidden( unless it happens accidently or its needed ofc).", "I can interact with customers and male colleagues, just not in an enclosed space, which having a simple open door solves.", "Still replying to the wrong post", "Anyone who calls you weird just lock them in the room with him at 3pm!", "Scented stuff at your desk. There are some that can be attached to the back of your computer. You can also put out some small stuff that simply has a pleasant scent you can waft your way. Also, see if you can angle your desk as far away from him as possible (claim it's for the lighting, or to see out the window, better view of the office, anything). But having scented stuff at your desk may be your save-all in this.", "Not actually forbidden, but contact is largely avoided as it would invalidate a 'clean' status gained by wudu' or ghusl (so she cannot do shalat and a few other stuff). The 'cannot be left alone with the opposite gender in isolated spaces' is more safety measure than anything.", "No im not. The stinky man is your son", "Thankfully just having the door open (since I sit facing the door) helps a lot. I bought some small plants and those tend to help too. Air fresheners and diffusers did nothing but make it stink more", "I'm talking about physical contact on skin, that is forbidden. Touching the opposite gender only breaks your whudhu or ghusal if you follow a certain mathhub, I'm pretty sure it's the Shaafi'i mathhab.", "Just get him some ear plugs, the noise problem is solved. NTA", "NTA.\n\nYou played the cards you had in order to get something done about a situation that was seriously impacting your ability to function in the work place.", "NTA I am sorry you didn’t initially feel safe asking for religious accommodation.\nJust because your coworker can’t control his odor you shouldn’t have to be uncomfortable.\nThey know he has this condition but willingly put you in an enclosed space with him", "I’m not a big fan of any sort of religious recognition or accommodations that impact others at work, but this is justified. They need to put him somewhere where he isn’t making people ill.", "“He doesn’t smell what you smell.”  He’s gotten use to his own stench.  Power move.  NTA!", "NTA. While it’s unfortunate you had to use your religion to resolve an issue, it was a legitimate issue. I’ve had to do it with my own disability. Sometimes you gotta do what you gotta do", "NTA.\n\nI mean, not a fan of using your religion when the issue was not really grounded on religion. However, he wanted to keep the door closed based on comfort (noise), but at the expense of yours (smell). So I'd say he's being the AH here. \n\nI usually go with whichever is the most feasible problem to solve. He can do something about the noise, like headphones, or even white noise machines can work. You can have some spray, but effect might be limited and frankly, more annoying.\n\nSo even though not a fan of using the religion card, it's kind of sad that you had to, bc now you're put in an awkward situation.", "NTA. Get a fan, air fresheners, febreeze, ozium, and spray liberally. ‘Something in here stinks’ ‘you don’t smell that?!?’", "Nta but if he keeps on about you using your religion one more time go straight to HR and inform them he is harassing you about your religion since he is now not allowed to keep the door shut.", "NTA. That sounds miserable. Keeping the door open seems like a reasonable request. \n\nPerhaps you could gently suggest that he get a fan.  It would help keep him cool and would help block some of the hallway noise.", "Nope, NTA. Your company should have included hygienic standards within the employee handbook/rules within its dress code etc., I know different companies I’ve worked for have. He may indeed have a medical condition which causes him to sweat profusely, but since he comes to work smelling ok, he should then be vigilant during work hours to touch up his hygiene. His medical condition shouldn’t impact you physically", "It’s people like you who give other Muslims a bad name.", "OP also stated in a comment that they weren't really comfortable being in an enclosed space with him anyway (due to religious reasons), but didn't know how to/didn't want to bring it up for fear of being mocked/ostracized for her religious beliefs. So it worked out for the best regardless, as it gave OP a \"valid\" excuse to request that accomodation (\"valid\" in quotes because it was *always* a valid request, BO or no BO, but as OP stated, people can be jerks about religious accomodations sometimes, and HR couldn't do anything about the closed door unless OP could provide a better reason than just \"he smells\"). \n\nAnd yeah, regardless of the extenuating circumstances, nobody is ever an AH for requesting religious accomodations. Especially not when OP attempted several times to discuss the matter with her coworker directly and politely and he seemingly refused to cooperate or compromise. Hence why she appealed to HR about it in the first place.", "Trimethylaminuria, some diabetes, various types of hidrosis, and there are others.", "Nope.", "That would make me so uncomfortable. I go to the break room to chill, not to watch someone else pray. Even if it is for 10 mins, why do you get special treatment for this? Can’t you pray in a non-public space like a car?", "It’s because she faced ridicule about her religion at her last job (probably why she had to leave) and she was worried it would happen again.", "So HR KNEW he had that condition when they assigned you to his space? Since HR has acknowledged that he has a problem, can you ask to be waitlisted to move into the next office that has a vacant desk? It seems like a reasonable request for you to make.", "Then don't fucking watch you sensitive weirdo", "No, if you're a Muslim, you have to put a mat on the ground, kneel, and pray. Haven't you ever seen a Muslim pray before? Besides, read OP's comment properly. She says that she HAD to pray in the break room, which implies that there was no other space for her to do so.", "Or you could literally just look away. Think about what you are saying. Assuming the prayers are silent, you are dictating what your coworkers can and cannot think. The only valid criticism would be for spoken prayers that were loud enough to disrupt others. The car example might not have worked because a) OP might not own one or commutes to work via public transit, biking, or walking, b) extreme temperatures + not running car is dangerous, c) the employee parking area is a more public, customer facing setting than the break room. Unless you're working from home, there is usually no \"non-public space\" at work except a break room. Are you next going to demand your coworkers can't read books that you dislike because the sight of it bothers you?", "Lol get a doctors note saying you have asthma triggered by strong smells, make someone else sit there.", "Ive gotten reasonable accommodation for an air purifier before. You can also get gonzo and odoban. Or activated charcoal to absorb the smell"]}