{"id": 4876, "submission_id": "zngi06", "title": "AITA for locking myself in my room every time my aunt and cousin come over and making mom lie to them that I'm not there?", "selftext": "My aunt and cousin (10M Andy) live close by and are frequent visitors to our home. Andy and I are close since he was just a toddler, he would spend lots of time in our house so it's not an exaggeration to call him my brother. The problem is that my aunt has zero awareness about what it takes to watch Andy despite how much I love him. \n\n&#x200B;\n\nShe would drop by and leave him in our house even if I tell her I'm studying and can't watch him. She would tell me it's better to have someone with him in the house than no company at all and that I don't need to watch over him as he can fix himself a sandwich or order something himself and he has her phone on him so he can just watch something. She always just takes her purse and abandon him there regardless of how I object. \n\n&#x200B;\n\nIf Andy really sticks to the phone and doesn't disturb me that would be fine but he doesn't and he shouldn't. He's so young. He can't stay glued to a screen for 8 consecutive hours and I don't blame him one bit for that. \n\n&#x200B;\n\nI complained to my mom multiple times about this and she would shut me down too. So I came up with the idea that whenever my aunt came over, I would shut myself in my room and tell mom to tell them I'm not in the house. That way mom doesn't have to get into a conflict with her sister and I don't get inconvenienced, win win. My mom resisted at first but was on board later. \n\n&#x200B;\n\nThis time though, when my aunt came over I could hear yelling as though an argument was going and then my aunt came knocking on my door while shouting that she knows I'm in there followed by my mom also telling me to just get out and that I caused her enough trouble. \n\n&#x200B;\n\nI walk out and there's a storm of berating first from my mom and second from my aunt. I know my mom was berating me like that to appease my aunt but it still hurt and I also lashed out at her that she was sacrificing her own daughter for her sister. When mom saw me like that she apologized to my aunt and told her she'll deal with this and walked her to the door and then went back and asked me what I expected by avoiding her for several weeks like this and that she would start asking questions eventually. \n\n&#x200B;\n\nI was upset and refused to answer her anymore and been cooped up in my room since then. No mood to attend classes either. AITA for acting like this?", "created_utc": 1671202497, "permalink": "/r/AmItheAsshole/comments/zngi06/aita_for_locking_myself_in_my_room_every_time_my/", "score": 80, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I locked myself in my room to avoid aunt and cousin and told mom to lie about it and say I'm not there so aunt can't leave my cousin with me.\n(2) Because according to them I'm exaggerating and there's no harm in leaving cousin with me in the house also the lying would have been exposed eventually and it's bad.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nIf no one is willing to stop their behavior all you can do is change yours. Start studying at the library. When your aunt shows up, grab your books and leave the house.\n\nIt doesn't matter if he is your brother. Even if he was your true brother and lived in the same house, you shouldn't be forced to babysit him, especially when you need to study.", "NTA if she wants you to babysit she can pay for it", "NTA. Your mother and Aunt certainly sound like assholes though.", "NTA First off, it IS babysitting. Second, I REALLY hate when crap hits the fan, people have no backbone. Your mom sold your feelings out to appease her sister.  It doesn’t matter if you like him like a brother, it matters you can do school work and not have to watch a 10yo while they hang out.", "time to start studying at the library. and leave the house before auntie gets there. nta.", "NTA.  And of course it’s babysitting and what is wrong with your mother that she doesn’t tell her sister to take a hike.  She would rather have her sister take advantage of you like an unpaid servant then stand up to her sister.  You have school work, ask mom if she would rather you put aside your studies to tend a child who is your COUSIN.  He’s not your brother, I’m sorry it may feel that way but he isn’t.", "Your aunt is a lazy parent and your mom is a pushover. But I'm very happy to read that you don't resent Andy for his mom's behaviour, which is very mature!\n\nThough, lying shouldn't be easily done, I can see why you took that route. You're not a free babysitter and with your mom letting herself be pushed around by her sister, there weren't many options.\n\nNTA.", "NTA. You were in a toxic situation and being gaslit. Your instincts are telling you to run and hide. Then you’re getting yelled at for having instincts. If your aunt wants somebody to watch your cousin, and she needs to arrange it in advance, and let you know what the hours will be. This is perfectly reasonable what she’s doing sounds perfectly unreasonable.", "NTA. She knows how much work he is but she’s pretending she doesn’t. She’s taking advantage of you. Now is a great time to learn to set boundaries. Tell her if she wants you to babysit then she needs to arrange it ahead of time at a mutually agreeable time and compensate you (it’s still babysitting even if you’re related)", "NTA, your aunt is. And your mom is too. Because you shouldn’t have to be hidden and locked away, or fakely berated because your mom can’t have an honest convo with her sister. \n\nBut I will say, you sound old enough to start learning to advocate your own boundaries.", "NTA, they're treating you as a free babysitter with no notice. They don't give a shit about your needs.", "NTA. You are not a built-in babysitter. Next time your aunt tries to dump your cousin on you, quote her an hourly rate.", "NTA. Your aunt is a huge AH for expecting you to be her on call, unpaid babysitter and your mom is a HUGE AH for not standing up for you. She needs to grow a spine.", "NTA. Your mom sucks, OP. Hopefully you're able to move out soon.", "NTA. You shouldn’t be forced to watch her child whenever she expects you to, and they clearly haven’t respected your objections in the past.", "Hey look, your aunt and mom want you to be free childcare!\n\nNTA", "NTA- if it’s not a big deal your mom can watch him", "Doesn’t feel like babysitting bc you see him as a brother and it’s more like hanging out, but it’s 100% babysitting to them or rather to any other adult. Nta. You are entertaining him and keeping and eye on him. That’s 95% of what babysitting entails.  He’s 10 and not a baby so I can see why you didn’t/don’t see it that way, but trust all of us when we say it, bc again that’s what it is. People nowadays also get paid good money like $20+ an hour to do it. You are free entertainment.  Your mom should have said no or provided the free entertainment.", "NTA\n\n\nFind out about market rates for babysitting in your area, give her a 10% friends and family discount and inform her of your rates. And that since he's family, you've discounted it for her.\n\n\nIf she wants to pay it, great. If not, you're not a charity. If her son is so easy to look after she can just keep him with her all the time.", "NTA, tell your aunt to start behaving as free babysitting is not always your priority and for her to pay someone to watch the child as you have a life as well. Else if you are old enough maybe you can start hanging out at a friends place or make plans to go out so that your mother can start with the baby sitting business. Sooner or later it will lead to you getting out of it. Its your mom's sister, so she can happily do the babysitting if she wants to but expecting you to do it is totally unacceptable.", "Info: just to be sure, you’ve never promised babysitting services, your mom never took money or was paid for you to babysit, correct? She literally just drops her kid off without asking you or your mom and expects you to watch him?", "ESH.  I get that you feel imposed upon, but c'mon man. He's 10. Your aunt is right. He doesn't need a babysitter. Just let him hang out. \n\nYou're doing like a half-martyr thing here that's weird.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy aunt and cousin (10M Andy) live close by and are frequent visitors to our home. Andy and I are close since he was just a toddler, he would spend lots of time in our house so it's not an exaggeration to call him my brother. The problem is that my aunt has zero awareness about what it takes to watch Andy despite how much I love him. \n\n&#x200B;\n\nShe would drop by and leave him in our house even if I tell her I'm studying and can't watch him. She would tell me it's better to have someone with him in the house than no company at all and that I don't need to watch over him as he can fix himself a sandwich or order something himself and he has her phone on him so he can just watch something. She always just takes her purse and abandon him there regardless of how I object. \n\n&#x200B;\n\nIf Andy really sticks to the phone and doesn't disturb me that would be fine but he doesn't and he shouldn't. He's so young. He can't stay glued to a screen for 8 consecutive hours and I don't blame him one bit for that. \n\n&#x200B;\n\nI complained to my mom multiple times about this and she would shut me down too. So I came up with the idea that whenever my aunt came over, I would shut myself in my room and tell mom to tell them I'm not in the house. That way mom doesn't have to get into a conflict with her sister and I don't get inconvenienced, win win. My mom resisted at first but was on board later. \n\n&#x200B;\n\nThis time though, when my aunt came over I could hear yelling as though an argument was going and then my aunt came knocking on my door while shouting that she knows I'm in there followed by my mom also telling me to just get out and that I caused her enough trouble. \n\n&#x200B;\n\nI walk out and there's a storm of berating first from my mom and second from my aunt. I know my mom was berating me like that to appease my aunt but it still hurt and I also lashed out at her that she was sacrificing her own daughter for her sister. When mom saw me like that she apologized to my aunt and told her she'll deal with this and walked her to the door and then went back and asked me what I expected by avoiding her for several weeks like this and that she would start asking questions eventually. \n\n&#x200B;\n\nI was upset and refused to answer her anymore and been cooped up in my room since then. No mood to attend classes either. AITA for acting like this?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA", "NTA. I would still lock myself in my room or leave every time they come over. Even if they know you’re there just don’t open the door.", "NTA - tell her you will call the cops for child abandonment if she pulls that BS again.", "Nta you got forced into that position by your aunt who doesn't want to look after her own child it seems. \nNot your problem.", "NTA. Tell your mother that if she’s okay with her darling sister dropping of her kid like so much trash for you to deal with, then She can be the one to look after him. You are Done being used. Or she can pay you 60$ an hour. That’s the special family asshole taxed child minder price. Oh and if she complains it’s raised with 10$ Each time.", "It's not babysitting though he's my brother. She just refuses to understand that he won't just be a statue sitting still while I'm attending class and that's where I disagree with her", "Here here!", "Was going to say this too. I’d be going to all of the classes, and studying at the library, and probably getting a part time job too so that I would legit not be home and aunt would figure out that her babysitter is not available.", "Of course not she drops him off and goes her way. I never even thought of it as babysitting until people commented that like in my head it was always he's my brother he's allowed to come whenever", "Nope. Not her job, she's allowed to say no. She's allowed free agency. Adults shouldn't bully her. Yelling at her until they get their way is absolutely bullying.", "He's ten, he's not going to just sit there in silence for eight hours whilst the OP does her work. What a ridiculous suggestion. The OP is his cousin, not his nanny or babysitter. Why is his mother not watching her own son?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "It doesn’t really matter if you consider him your brother. Even if it was your brother, you have a right to study and do whatever you need.\n\nYour aunt is his parent and she has no right to expect others to watch her kid especially so often and for so long.  \n\nWhat I would do is I would tell your mom “mom I don’t know why you value your sisters feelings over mine or why you think she has any right to expect that she can stop by whenever she feels like it and leave her child for really long periods of time and expect me to babysit him.”\n\n“I am a person, I am your child, and I have a right to have a life and to study and not be expected to watch Andy. Furthermore she has a selfish view of what Andy can and can’t do when she is neglecting him but expecting that he will just stay on his phone so she can go out and live her life without him.”\n\n“She is the one that chose to be a parent and she needs to find a babysitter or learn how to watch her own kid. Of course I feel bad saying that but the alternative is that I can’t study or have a life based on whatever whim or want of hers. She is saying that her life is more important than mine and I should do whatever she wants whenever she wants without any regard for my own plans or future or welfare - and that I am somehow responsible for her own child.”\n\n“Further, you are my mom and you’re supposed to be protecting me not placating her. I am your child. And you are behaving as if my standing up for myself, when you should be standing up for me, is an inconvenience.”\n\n“You were both attempting to put me in a position of a parent and I am not anyone’s parent and if you would like I’ll go out and get myself pregnant so at least I’ll have to watch my own kid. Even if he was my true brother and not just my close cousin, I would not be expected to watch him at all hours at any time, for eight hours in a row.”\n\n“So you can tell her or I will tell her that she needs to get a babysitter or figure out a different plan and that I’m not going to do this. She can’t keep dumping her kid on me and if you keep cooperating there will come a time when I won’t have to live here anymore and you will find that I won’t come back.”\n\n“But don’t worry you’ll have your sister and her child.“\n\nYour aunt is truly behaving selfishly and with entitlement to your time and effort. Your mother should explain to you why she is prioritizing your aunt or why she can’t babysit. \n\n“Mom if it’s that important to you to accommodate your entitled sister than you can babysit her!”\n\n“And if she wants me to babysit she can make advance arrangements for a set amount of time and she’s going to have to pay me for it. There’s a difference between spending time and time with my cousin and constantly being forced at no notice to babysit for eight hours straight.”\n\nI would not answer my door and I would tell my aunt clearly that if she drops her kid off again without your permission you’re going to call the police or child protective services. “I have to study so that I can get into a good college and it’s unfair for you to expect this or pretend that I don’t have anything better to do or to expect your small child to watch himself for eight hours because you don’t feel like it.”\n\nI’m sorry you have to stand up for yourself, but I think you’re better off having them be outraged then putting up with this treatment any longer. \n\n(also do you not have a dad or grandparents who can stick up for you? On either side? I would rather have people like this think poorly of me because I called the police on them then let them behave in a such a presumptuous way. It’s not even like an hour or two.)\n\nTotally NTA", "She knows. It is still babysitting. She is responsible. She uses you as free labour. You are being taken advantage of. Your mom is an asshole too. She should protect you. Establish some ground rules. If you like Andy and like to spend some time with him do but on your terms. If you tell her no and she just leaves him there, call CPS. You have no obligation to look after someone else's child.", "It 100% absolutely IS BABYSITTING. If it's not your child then it is not your responsibility. Babysitting is a favor. You shouldn't be burdened with constantly looking after someone else's kid. Even if he was your actual blood brother. Your mother is a GIGANTIC AH. For essentially throwing you under the bus and berating you for something that isn't your job in the first place. ABSOLUTELY NTA", "If he isn't *your* kid then it's babysitting.", "It IS babysitting. Even if it was your brother by blood, a child is the parent's responsability, not their siblings or relatives. Your aunt and mother are being inconsiderate.", "Is it your brother or your cousin?", "That’s babysitting. And if your mom wants babysitting to occur, she should do it herself. Go to the library or get a job or classes that get you out of the house so you’re not available", "Actually, even if it's a sibling, that's still babysitting. He's not your child, not your responsibility. You're NTA. if you can move out or be out of the house, leave as they arrive, try that. If aunt & mom complain, tell them you're busy and can't afford to sacrifice your life for their comfort.", "Did you or your mom express this to your aunt? Did you tell her he’s your brother and allowed to come over whenever he wants? The times she came over and thought you were not there, did she leave him or take him home and leave him by himself?\nNTA, I’m just trying to figure out if there was some expectation on her part that you were okay with this. The dynamic here is incredibly toxic.", "When their convenience is being prioritized over your NEEDS, that's a toxic situation at the minimum.\nParentification is an abusive behavior and is happening to you. You are in a bad situation that isn't normal but your reaction is very normal and mature to the toxicity you are experiencing. \n\nConsent is vital in *any* relationship, especially close ones like family. You are being gaslit and manipulated. You have needs. You deserve respect. You deserve CARE from those who proclaim to love you.\n\n Family isn't blood relationships, it's people who care about and are kind to eachother. It doesn't sound like you are being treated as family, just a tool to provide a convenience to them. \n\nGet out of the house as much as posible and I'm sorry your house isn't your safe space thanks to your mom's abandonment of your needs and your relationship", "I have 12, 10, and 8yo children. They don't require a babysitter. They just... do stuff. It's fine.", "Then he doesn't need to come over to OP's house. If he's old enough to not require a babysitter, then he should be fine to be left home alone."]}