{"id": 4882, "submission_id": "znirqb", "title": "AITA for refusing to give up my dog for my dad’s fiancé and her son?", "selftext": "I’m really upset about this right now.  I’m 17F.  My parents divorced when I was 12. It was really rough, they pretty much hate each other and still have trouble doing anything together where I’m concerned. I try not to talk about them to each other and just keep things separate.\n\nAll the fighting and chaos was hard on me and was effecting my mood and school work when it was all going down, so my dad felt bad and let me have a dog to help me feel better.  Someone nearby had malamute puppies, so I picked out one and his name is  Tycho and he’s my best friend. Even on the weeks I’m with my mom I stop by after school every day to take him to the dog park to play and get his cuddles in. I love this dog.\n\nMy dad started dating Melanie a few years ago.  I don’t really connect with her, we’re just really different and she’s way too touchy, but she makes my dad happy so whatever.  Her son Ben (9M) is autistic and needs a lot of accommodations, he gets really upset and has meltdowns when things change or are done differently.  He’s also really scared of Tycho even though as far as I know Tycho has never done anything to scare him, he’s a really laid back and well behaved dog.\n\nDad and Melanie recently got engaged and they want to go ahead and move her and Ben in so that they can get rid of their apartment and save money.  My dad told me about it and said that since Ben is afraid of Tycho and needs a stable environment at home, Tycho is going to have to go somewhere else. My mom’s townhouse doesn’t have room for him and my grandparents aren’t in good enough health to look after a big dog, so we would have to rehome him.\n\nI admit I didn’t take it very well and we had a big fight.  I told him that no way was I going to give up my dog and I’m going to college next year anyway so they can put off the move until the spring when I can find a place to take him with me. My dad says they need to do the move over the holidays and Ben is more important than a dog. I told him if he gives away my dog I’ll never forgive him and that he obviously thinks Ben is more important than me, too.\n\nMy dad is mad because I’m making this a choice between me and his fiance basically, Melanie is having second thoughts about the engagement since I “don’t want to live with them”, my mom is mad at my dad and they’re fighting again, and I’m afraid to leave Tycho alone because he might not be there when I get back. My aunt says I’m being childish and my dad deserves to be happy.\n\nAITA?", "created_utc": 1671208276, "permalink": "/r/AmItheAsshole/comments/znirqb/aita_for_refusing_to_give_up_my_dog_for_my_dads/", "score": 600, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I guess a dog isn’t as important as human family and this really seems to have thrown a wrench in everyone else’s plans, I just don’t want to lose my dog.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nI don't know what the answer is here, but it's wrong for your dad to ask you to get rid of your dog. Wrong, wrong, wrong. \n\nPlus at your age, I'd venture a guess that you're not going to be living with him and his fiancee for too long.\n\nIt's a shame that Ben hasn't found a way to bond with your dog, though. My autistic son loves animals and our pets seem to give him a lot of comfort.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m really upset about this right now.  I’m 17F.  My parents divorced when I was 12. It was really rough, they pretty much hate each other and still have trouble doing anything together where I’m concerned. I try not to talk about them to each other and just keep things separate.\n\nAll the fighting and chaos was hard on me and was effecting my mood and school work when it was all going down, so my dad felt bad and let me have a dog to help me feel better.  Someone nearby had malamute puppies, so I picked out one and his name is  Tycho and he’s my best friend. Even on the weeks I’m with my mom I stop by after school every day to take him to the dog park to play and get his cuddles in. I love this dog.\n\nMy dad started dating Melanie a few years ago.  I don’t really connect with her, we’re just really different and she’s way too touchy, but she makes my dad happy so whatever.  Her son Ben (9M) is autistic and needs a lot of accommodations, he gets really upset and has meltdowns when things change or are done differently.  He’s also really scared of Tycho even though as far as I know Tycho has never done anything to scare him, he’s a really laid back and well behaved dog.\n\nDad and Melanie recently got engaged and they want to go ahead and move her and Ben in so that they can get rid of their apartment and save money.  My dad told me about it and said that since Ben is afraid of Tycho and needs a stable environment at home, Tycho is going to have to go somewhere else. My mom’s townhouse doesn’t have room for him and my grandparents aren’t in good enough health to look after a big dog, so we would have to rehome him.\n\nI admit I didn’t take it very well and we had a big fight.  I told him that no way was I going to give up my dog and I’m going to college next year anyway so they can put off the move until the spring when I can find a place to take him with me. My dad says they need to do the move over the holidays and Ben is more important than a dog. I told him if he gives away my dog I’ll never forgive him and that he obviously thinks Ben is more important than me, too.\n\nMy dad is mad because I’m making this a choice between me and his fiance basically, Melanie is having second thoughts about the engagement since I “don’t want to live with them”, my mom is mad at my dad and they’re fighting again, and I’m afraid to leave Tycho alone because he might not be there when I get back. My aunt says I’m being childish and my dad deserves to be happy.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, pet's are family and you don't have to give up your dog!", "NTA but your dad is.", "If your dad is insisting, you have to make room in your mom’s townhouse and stop visiting your dad.  He can up his child support.  NTA.", "NTA. Your dog is part of the family, and while I understand why he would want his fiancé to live with him, he has a responsibility toward you. He can't just dismiss and your dog you when it doesn't suit him anymore.\n\nThe dog is not just a piece of furniture you can get rid of. He accepted it in the family, now he has to assume the fact that you cannot just throw a dog in the garbage when you are done.", "**NTA**. I'd rather die than rehome my dog. Ben might even grow to love Tycho in time, if they handle the change well and take it slowly. The answer isn't just immediately get rid of a living, breathing, sentient being because the kid is afraid, when they haven't tried anything else. I appreciate the autism will make things more difficult, but there has to be other routes to go down without immediately jumping to \"give Tycho away\". \n\nI hope they don't try and do anything behind your back OP.", "NTA.  Your dad shouldn't have given you a dog to take it away later.  However, you also need to be prepared.  It isn't easy to find a place to take a large dog. If your plan is to bring him with you, you need to be working and saving money.  You will likely need to rent a house(or a room in a house where they let you have him), and you'll have vet bills to cover, food, etc.", "NTA. \"Ben is more important than a dog. I told him if he gives away my dog I’ll never forgive him and that he obviously thinks Ben is more important than me, too.\"\n\nOP you hit the nail on the head. Your dad has a new family now and your thoughts and feelings are no longer being considered. I hope you and Tycho find a good place to stay thats not your dad's. I suggest LC or hell even NC after this stunt.", "you're a hero and your dad sucks - NTA", "NTA. I usually side with parents, but rehoming your dog because he can’t wait 6 months to move his GF into the house seems like he IS choosing his GF over his child, and that’s a huge no-no. Melanie’s son does have a right to feel safe in his own home, but that does not include forcing you to get rid of your dog. That’s just not a legitimate thought to have. Maybe Melanie SHOULD have second thoughts about your dad.", "NTA.  You shouldn’t have to give up your dog because of another kid. As far as I can tell from your post, Ben has no reason to be afraid of your dog. Your dad & Melanie would do better by both you & Ben to help Ben and Tycho become friends. A friendly dog can be a comfort to a kid as you well know.", "NTA - you provided a perfectly reasonable compromise: \"I'm moving out next year.\"", "INFO Why do they need to move over the holidays? Seems arbitrary.", "NTA - so sorry you are going through this, it just sucks.      Your dad has options on timing, I'm not sure why putting off moving in together for less than a year so Tycho can move with you is not something he's willing to do?   In the big picture that's not a long time.\n\nHad a serious bf one time tell me \"It's me or the dog\".   I picked the dog.  Just sayin.", "NTA. your dads primary obligation should be you. you’re his biological child and hes making the choice to put his “new family” over you for whatever reason. for him to dismiss/disregard your needs and feelings about this whole thing is beyond wrong. i hope you’re able to get the situation sorted! i would lose my damn mind if i was told i couldn’t keep my cats with me.", "NTA. Your dad got you that dog and in doing so committed to having the dog the rest of its life. Not to mention you trauma bonded with the dog while trying to deal with what sounds like an ugly divorce. You shouldn’t be expected to give up your most prized possession that means the world to you for someone who just entered your life recently.\n\nHow big is dad’s house? Would it be possible to keep Tycho and Ben separated using baby gates or some other barrier?", "NTA. I am so sick of seeing autism used to excuse everything. Maybe he's afraid, but he's exposed to him in very short increments, if at all. \n\nI think having a 9 year old adjust to the fact that even at home not everyone will revolve around them is something that needs to happen. \n\nMy concern would be for the dog, in the event that the 9 year old may try to harm the dog. \n\nI'm sorry you're dealing with this. Your dad seems like a selfish guy with an inability to compromise.", "Melanie seems to be the person with the most sense here.  She should be rethinking moving in 6 months before you leave.  You are of course NTA.", "NTA dogs are not expendable they are a life long commitment, the kid is not allergic he's just afraid, autistic kids can adjust to change it just takes time and work his mom and your dad are lazy and don't want to do the work. If my parent got rid of my pet i would literally never speak to them, tell him he hopes he never wanted to be a grandparent because someone who thinks something I love that deeply is disposable is never getting near any kids I ever have.", "Sounds like the adults around you really didn’t think this timing through at all well. Or they don’t really “get” pets and they think they’re like furniture you discard because it doesn’t really fit in your new living room.\n\nNTA but you have all my sympathy. At 17 you expect your wants and needs to be taken into account, not just dictated to you by an adult.\n\nMelanie was really deceiving herself if she thought you would happily trade Tycho in for a stepfamily. Of course you don’t want to live with them under those conditions!\n\nTycho should not have to be separated from you when a few months can solve that part.", "NTA\n\nThat dog is a member of your family too, and he means a lot to you. \n\nHave you expressed the importance of when you got your pup, given everything that was happening when you got him?\n\nHave you interacted with her son? Has he been over to the house with you? The change in scenery could be a huge adjustment for him and they might be asking you to move out next!", " NTA. Where I think your dad is, is because he won’t compromise to wait until the spring. That sounds completely reasonable.\n\nMelanie is also slightly TA for making this the hill to die on moment where your dad needs to prove that she’s most important. I get that she’s worried about her neurodivergent kid and his problems with the dog. But had it been her kid’s dog, I can guarantee she wouldn’t rehome him.", "NTA.\n\nIts absolutely cruel to expect you to give up your dog.\n\nIf the stepson has behavioral issues, they need to work with his doctor to address them. How sad they are demanding the doggo get booted from his home and owner.", "NAH.\n\nYour dad is a person too; he's allowed to fall in love and he's allowed to want his fiance and her son to move in.\n\nYou're allowed to be upset about it.\n\nSometimes life is just hard.", "NTA. It’s true, the dog and you were there first and if he gets rid of YOUR dog he sucks. He can wait until the spring when you move out. The other kids feelings and diagnosis does not trump your feelings", "NTA  Pets are not accessories to be discarded on a whim.  You have every right to defend your dog and to let your dad know what is riding on HIS decision about the housing situation.  I would never forgive someone who expected me to or coerced me into giving up a pet for their own convenience. NEVER.", "NTA. I think it's very telling he wants to move now when they could wait for one more year. Can you move with yiur grandparents and take care of tycho there?", "NTA. You protect your dog at all costs. He is a member of the family, & if your dad takes him from you, you have every right to hate him for the rest of your life. If they can't wait a few months, then your dad obviously doesn't care about you at all. Can you move in with your grandparents until you go to college? Shame on your family saying he's just a dog. No. He is your child.", "NTA\n\nWhy can't they try therapy with Ben so he's not so afraid of dogs? Dogs can be so beneficial to people with autism. Really, rehoming Tycho when he's a part of the family?? You're right that your dad is choosing them over you.\n\nWe had a malamute a long time ago, they are awesome dogs, so friendly with big doggy smiles. He was a neighborhood icon, everyone loved him.", "NTA. Tycho is part of the family too. My dog is my kid. I wouldn’t rehome my dog because of a fiancé who is already having second thought. Your aunt is so concerned about your dad’s happiness, but what about yours?! You are not being childish. You are being responsible of your dog. I really hope you could find a way to keep Tycho. Is it possible to keep Tycho and Ben in separate areas of the house? Or is it possible for you get to a housing arrangement that would allow you to keep Tycho with you while you are in college?", "NTA. Fuck these selfish AHs. Get your dog somewhere safe, move out, and never look back.", "NTA. The only painfully obvious AH is the dad. While yes, Ben has a right to feel safe in his house, it is also your house (and also Tycho’s). From what you wrote, I noticed that there is no one that could take him in, but what if you go as well (short term) to your grandparents’ place with Tycho? Just until you can get a place of your own. That way you can take care of Tycho, help your grandparents and get the peace you deserve", "Tycho is not “a dog”, he’s family. You father should know better. NTA", "Nta\n\nMake it perfectly clear to your dad that if he wants any relationship with you going forward, they need to find a way to make you keeping your dog work. If he unilaterally makes the decision about YOUR dog, do what you can to track it and the home it's in so you can get it back when you move out, then go no contact with your dad. He neither loves, nor cares, about you, so he doesn't deserve to have you in his life.", "[deleted]", "NTA. Your aunt's comment is nonsense - don't you \"deserve\" to be happy? No-one else but your mother seems to think so. Your father needs to put you first - you are his child.", "NAH. It's an incredibly stressful situation for all involved, and while I can't fault your dad for valuing the a human child over a dog, I can also see how it would be incredibly traumatizing to you. Is there any way one of your friends might take Tycho in for 3-4 months until you move to college and take Tycho with you?", "NTA. Ben can get used to Tycho. Dogs are very beneficial with autistic people.", "Since your intention is to take him with you when you move out, is it possible to have someone you know foster him for a few months? The dog, not the crotch critter. \n\nWould your grandparents be able to manage it for a short time, or can you stay with them to help them out for a few months?", "YOU ARE NOT THE ASSHOLE!!!!!!!  Read that again.  I'm terribly sorry you are being treated so poorly by the adults in your life.  It appears that they have zero regard for you, your feelings, and your bond with your dog, but instead make everything about themselves and what they want.  I actually thought you had a brilliant compromise about waiting until you move out - yet instead of accepting your compromise they decided to double down.  Shame on them.  I wish I could help solve this problem, but just know this - your are not the asshole, your dad, Melanie, and your aunt are the assholes.  Tycho is your family and should be treated as such!", "NTA - your dog is your family, and they aren’t to be discarded when life changes! 🤬 \nYour dad is a massive AH. Dogs can actually be beneficial to those with autism, and WHY IS IT OK FOR YOUR DAD TO CAUSE YOU EVEN MORE EMOTIONAL DAMAGE BECAUSE OF BEN!? \nI’m so mad for you!", "NTA. Your dad and Melanie suck for sending the “Ben is more important than you” message out loud and clear. I’m sorry. Big hugs.", "NTA - your father is essentially telling you to throw away a living creature who loves and trusts you and is important to your mental health so he can rush to move his new squeeze in.  What happens if Ben doesn't like you?  Do you get thrown out too?  I'm being hyperbolic, but as an animal lover, I just despise people who think pets can be tossed like this.  Your ask to wait until spring when you can take Tycho with you is not unreasonable.  You're not making him choose between you and Melanie, you're asking for a bit of consideration.  Now, you will loose on this issue because your dad has made his decision, so all I can think to suggest is whether you have a friend who might take Tycho for a few months or could you go stay with your grandparents and take care of Tycho there; I suspect your dad would be happy with this since it gets him what he wants.", "NTA \n\nI think you came up with a reasonable compromise of having them wait to move in together so that you can take the dog when you move away to college. \n\nIt’s so cruel of your dad to do this especially if he knows that there are no options for the dog to live anywhere else with your family and would need to be rehomed. Why do they HAVE to move in for the holidays? Is there some detail we’re missing? Also curious if they can just make some kind of arrangement for the time being where Tycho is just kept away from the kid? In a other room or out in the yard depending on where the kid is?", "[deleted]", "NTA. Your dad is being an asshole.", "I think it’s something to do with her lease or something, I don’t know.  Maybe also having time to move.  My dad just said that it would be a lot more trouble and expense to wait.", "“It just takes time” while a young kid is afraid of the animal in the same house as him? That’s not a solution either.\n\nThe solution is to wait until OP moves out since that can be within a year.", "The dad can still date and hang out with his fiance. He has a responsibility to his daughter and dog that he got her. She can move in later and the fact she's rethinking the engagement cause his daughter doesn't want to get rid of her dog is a red flag and manipulative of her.", "Dad isn’t allowed to put his new family ahead of what’s good for his existing family.\n\nI mean, he’s legally allowed to. But it makes him TA.\n\nWe’re not talking about them splitting up. Just waiting a few months for the sake of his daughter. They’re both adults and both parents—they should be able to see the sense in that.", "[deleted]", "His dad’s feelings that a dog is disposable are not valid. Dogs are not given up lightly and dad should have thought through AT LEAST the timing given OP’s age. It’s not *all* about the romantic relationship and its natural pace. He’s a father and has responsibilities, and a dog is a commitment, not just a plaything.", "Nope, OPs dad is definitely the AH here. \n\nNTA", "The dad is being ridiculous! This is not a life or death situation where the kid is fatally allergic to the dog or the dog has attempted to bite this kids face off. Also why does the step mom need to move in on this specific timeline? Will she be evicted from her home and made to live on the streets if they don’t move in over the holidays? I doubt it. I get the dad wanting to save money and live with his fiancé, but it’s not all about him and the fiancé. They have made no effort to compromise and are making plans that are convenient to them while screwing over OP", "I was thinking they should bring in a therapist to work with acclimating Ben and Tycho.  But I don't think the answer is to automatically get rid of the dog!", "this is such a gross take. Why is it on a 17 year old to fix this situation?", "Uh her dad already has family. He isn’t doing his own daughter a favor for trying to “still include her” ffs she’s his daughter and they live together.", "But then it's so easy for his mother to make a move with Ben!? And he is supposed to live from one day to the next in a completely new area, house and room? With two other people he doesn't know well. That's going to be the real horror for him as an autistic person. But OP's dad and stepmother have no problem with that....\nMaybe Ben was just anxious about the environment and not the dog.", "Gotcha. I think you need to have an honest conversation with your dad and ask him if he is willing to deal with that added hassle for the sake of your relationship. His stance on this seems very callous.", "And that’s just it would be more trouble and expense to wait. But it’s still possible to wait. Sometimes we have to do things as adults that are more expensive and time-consuming than the ideally would like. NTA", "What a lame excuse. Basically it’s just about convenience. Then saving some money and not going through the trouble of waiting is more important than allowing you to keep you dog. Omg your dad really sucks.", "Yes, Dad.  Being a grown up means being patient and staying true to your commitments.  Sorry you are in this situation.  I hate to suggest this but you might want to start looking for a temporary home for Tycho.  Many schools require freshmen to live in the dorms, and dogs can't live in a dorm.  If you can find a friend or relative to foster him, you paying for his support and visiting him often, might be a difficult but doable plan.", "i don’t disagree with anything you’re saying. i’m mostly just heartbroken about the situation.", "[deleted]", "Autism can be really weird, and it might be entirely possible that having a dog is indeed too stimulating. That being said, it is true that the stepmother could wait till spring.", "Sure, he might not be TRYING to be one. Unfortunately, he is. It is a tough spot, but the solution he settled on was a bad one.", "Yeah it’s important to him to have them move in but OP is trying to say that dad can’t EVER live with his fiancé and her kid she’s asking them to wait a few months so that she doesn’t have to get rid of her dog??? \n\nDad and step-mom are being insanely selfish right now. Unless the fiancé and kid are going to be evicted and homeless UNLESS they move in over the holidays, I don’t really understand why they can’t just wait in order to keep the peace and not royally screw over OP. That’s not a very good way to start a blended family if you ask me.", "Yeah I completely understand that. I think the thing that’s getting to me is the insistence that they need to move in now. OP responded to another comment that the reasoning for them moving in sooner is to save money and because it will be more “trouble” if they wait. I’m sorry, but so what? Saving money and having things be more convenient is not a valid excuse to get rid of his daughters pet. Dad needs to suck it up and realize that not everything can go his way when he has a daughter to think about. Blending families is tough and it can go SO wrong it’s just such a bad move for the dad to do this and start off on the wrong foot. How can he expect OP to want to be involved in this new family when they’re putting her through something like this?", "completely agreed", "I don't think this family will ever actually blend.  Dad doesn't care about her feelings, it's all about his new life and making sure it goes the way he wants.  This is not an uncommon pattern and I suspect that even without the dog as an issue, she would be last and least going forward.  That he is being so callous about the dog is very telling.  She needs to just get ready to go out on her own with Tycho.", "NTA\n\nDad can get you an apartment for a year until you turn 18. I mean, if he wants to \"accommodate\" you.", "NTA\n\nThere's a lot weird going on here. Melanie is having second thoughts because a SEVENTEEN YEAR OLD doesn't want to live with them? It's like, how long did she even expect you were going to be living with them anyhow?\n\nHave you talked with your parents and grandparents about this without your dad? Do you have any friends who might be able to take your dog in for the next year?\n\n(Also, I hate to tell you this, but finding a college apartment which is going to allow a large dog like Tycho is also going to be difficult. Many only allow small dogs, the ones that allow larger dogs generally only allow them up to 50lbs and often exclude huskies and malamutes explicitly due to their well-known mischievous natures.)", "NTA.    Tell your aunt to eff off. \nWhy the hell is she involved in this?\n\nYour Das pisses me off.  He's an asshole", "Adding, noticed something that's a huge red flag. Melanie is having second thoughts about moving in if you would be moving out. That makes me think she had the intentions of trying to make you watch her kid while her and your dad did whatever they wanted.", "NTA at all. First of all, you are this close to becoming an adult, they shouldn't want to uproot your life in this stage and just let the natural course of events take care of that. When you move out, they can move in.\n\nSecond of all, the logical alternative IF they cannot wait is that the kid is socialized with the dog. They can hire experts for that if they can't do it. \n\nDon't let them give you a feeling of guilt for something so unnecessary. There is no actual NEED for them to move in over the holidays, they just WANT to. And the choice is not Ben or the dog. The choice is 'nobody takes the trouble to get the kid used to the dog' vs. 'dog must go'.", "NTA. You shouldn’t have to give up you beloved pet, who is a living breathing creature who doesn’t deserve to be removed from his loving owner, because someone who is coming into your already established home. The right thing to do would be hold off on the move a bit and slowly get Ben more comfortable with the dog.", "A dog is a living creature, has your Father mentioned how he would ensure the dog gets a good home? Does he know what that dog breed needs? What kind of humans are needed to keep the dog happy and healthy. Has his new Significant Other?", "NTA\n\nAre they saying Ben is incapable of learning something new? Sorry he's unable to adapt to anything.  \n\nIf they can't wait until you move out, perhaps moms townhouse is the best option. As you say, it will only be for a few months.\n\nAs long as you regularly give Tycho enough exercise, it doesn't make that much difference him being in the townhouse.\n\nI have a border collie in my townhome and he's well exercised and happy.  People have told me they aren't appropriate for yardless houses either, but you as a good dog-mom compensate by taking them out for lots of good quality exercise.", "NTA  There are other alternatives and why is the son afraid.  Is it a phobia or does he just need time with the dog to get used to him.  If the dog is aggressive that is different and will pose more of a problem.", "NTA. Please update us OP. If worse comes to worse there might be someone on here that would help you. Reddit is full of great people that are animal lovers and understand. \n\nYour dad has very poor judgement. He and your future step -mother should be accommodating to you and the dog you love. This is a huge red flag for the dad, but he just wants what she wants. Not a great sign for the future. \n\nHoping for the best for you and Tycho.", "NTA, not even a little.\n\nI have a different concern:  Have you checked on the residency requirements for the colleges for which you’ve applied?  A lot of universities and colleges require freshmen to live on campus.  If you’re headed to community college you should be fine, but it can be really hard to find a rental that will take a dog.  You need to get started on this problem sooner rather than later.  If you find there’s going to be a big issue (as you obviously can’t leave your dog with your dad), do you have any family or friends who might be willing to “foster” the dog until you can take him?\n\n(BTW, having grown up with a special needs brother, I can tell you definitively that learning life skills means learning to cope.  There are methods and processes that can help Melanie’s son learn to cope with being around dogs, and the classroom teacher would be able to offer suggestions.  Enabling the kid to avoid life coping skills is bad parenting.)", "NTA.  You and the fiancé's kid are both innocent here.  Your dad and his fiancé are big assholes.  They are putting their issue onto you.  You gave your dad quite reasonable compromise to this and he is favoring his fiance's child in this instance.  He is mad since you called him out on the truth.  Your Aunt is also a massive AH for butting into something she has no business.  Yes, your dad deserves to be happy and you acknowledged it but it's time for the adults to find an acceptable resolution in the short term until you turn 18 (after all it's not that long until then).", "NTA- you deserve to be happy. The fiance and son should’ve known how he was around dogs prior to this relationship, it’s not like they’re rare to find. Noone has a say over your pet and the guilt tripping is so disgusting", "Perhaps you can contact a local animal rescue and ask if they can find someone to foster it fir you until arrangements can be made", "\"If you really insist on the dog you got for me and has been a family member for 5 living somewhere else, I'll move out with the dog and you can pay for my accommodations until I can pay for them on my own.\"\n\nCurrent family members should not be displaced just to cater to new ones.\n\nUnless thew new kid is deathly allergic, a plan should be made to work on acclimatizing him to the dog.\n\nNTA", "NTA.  The dog predates the relationship, and you should not have to give up a dog your dad got you when you will be moving out soon.  The obvious compromise is to find you a dog-friendly apartment near your school as soon as possible.  Dogs are a lifetime responsibility and your dad is being a huge AH demanding that you get rid of your dog when all he has to do is wait six months.", "Oh, you poor darling. You're very much NTA. I'm so sorry anyone is saying you are.", "NTA.", "fuck them, keep the dog.", "NTA.  Pets are not just disposable toys, and this dog is obviously very important to you.  Getting rid of him because they can't wait a short time until you move out is incredibly unfair to you.  Melanie is also not winning any prizes with her reconsidering the engagement because you \"don't want to live with them.\"  What manipulative nonsense.  You just don't want to give up your beloved dog, and you are at an age where you will be leaving for college soon.  You'll probably be \"living with them\" for a limited period of time anyway.", "NTA - you dad is putting someone who is not his wife and child over his actual child. \n\nTell you aunt to shut up and mind her own business", "NTA. Absolutely NTA. Do you have a friend you can reach out to for help to take the dog for a bit, or potentially a long term foster?", "NTA - Dad is one of those wankers who think pet lives don’t matter. I despise people like that.", "NTA\n\nYour well-being and that of your beautiful dog come before anything.", "NTA, when you leave that house don't look back, not for birthdays, not for Christmas, nothing. You dad cares about getting a new partner than he does his kid, fuck all of 'em.", "NTA\nYou dad has a right to be happy, but he doesn’t have the right to take away your happiness to make his own come 6 months sooner.", "NTA. Sounds like your dad is a real piece of work, especially given that his stated reason for not postponing the move is to save money. Clearly he didn't think this through very well, and now he's putting his own convenience ahead of you being able to keep a pet that has become family to you. I would guess his real issue is that he's angry and possibly embarrassed that you feel closer to your dog than to the new family members that he has basically imposed upon you. If he doesn't understand that that's a perfectly natural way for someone in your position to feel, then he's not just an asshole, but a stupid asshole.", "NTA.  Instead of rehoming, they should take steps to help her son overcome his fear of Tycho.", "\"Melanie is having second thoughts about the engagement since I “don’t want to live with them\"\nShe counted on you to be free childcare \n\n\nNTA", "NTA;  You have a right to be hurt that your father wants to rehome the dog you love for his fiance and *his* new family.  Telling him that you will never forgive him is pretty reasonable, he took your dog away.  He is picking them don't ever let them or him forget that.\n\nYour dad is caught between a rock and a hard place on this.  I think Melanie to her credit sees this too, which makes the situation for your father more difficult.", "You are NTA. What a horrible thing for your father to do.", "NTA", "You are NTA, but if you were a little bit of one I wouldn't fault you. If you dug your heels in, made this your hill to die on, and should the worst come to pass and they took your dog away I wouldn't fault you making their lives miserable until you moved out and after.\n\nSee, I don't deny your dad has a right to pursue happiness and love, but that right does not come at the expense of yours. He is treating your dog, a member of your family, a member that has given you comfort and happiness these years while caught in between your parents, as an expendable impediment.\n\nYou offered a fair compromise. Wait the two minutes it takes for you to go to college, but he's impatient, he's cheap, and he's selfish. He wants the dog gone now so he can have it all. So, to that, I say sour the whole situation out of spite.\n\nDisregard his \"happiness\" as he disregards yours, make the woman know she's not acknowledged as a member of **your family**, make her know that you don't even respect her as a person that loves your dad. She's either Firstname(said as an insult) or she's Miss Maiden Name. Give back as much pain as they give you. Not violently of course, but make sure they know that your anger remains present.", "NTA\nThe dog was there first. Melanie should either get therapy to help Ben get over his fear or not move in for a few months.", "NTA, your dad is a selfish ahole and so is you stepmom. I hope you get to keep your dog.", "Ofcourse you are NTA. Your dad had you and the dog. If that not compatible with a new wife he shouldnt have married her. He choose to divorce and he choose to remarry to. A new marriage should fit in your life or you shouldnt marry (yet). What if she didnt like kids... Would he get rid of you too?", "NTA \n\nIn a good and fair world your needs and wants would be respected. Ben’s needs and wants should be respected too. Have they not considered that taking things slowly and respecting everyone involved would generate a better long term situation?\n\nHowever you presumably will be forced to deal with people who aren’t willing to take the time to see if Ben and Tycho can learn to get along if it’s done however Ben needs it to be done. They don’t want to wait - and maybe something happened and they don’t have the resources to maintain separate households.\n\nCan you talk to the shelters or any rescue organizations around you and research if there are any dog foster parents in the area? It’s not ideal but it might give you the time you need so you don’t have to give him up completely.", "NTA\n\nTo summarize: Your father allowed you to get a pet to deal with the toxic battles that he was having with your mother. Now he wants you to get rid of the pet that served the role of an emotional support animal for you because he's involved with someone else who has a child that can't handle being around pets. \n\nHe likely will not admit to it but what he is signalling is that he has not only moved on from his first marriage but moved on from his first family, meaning you. Your father first has an obligation to you until you are an adult. \n\nIn the future I anticipate your father will be posting in estranged parents' forums expressing confusion and lamenting you going full no-contact with him. \n\nIf you are concerned he will take your dog to the pound without your permission there are some steps you can take: Get the dog micro-chipped in your name only, *immediately!* (Maybe you can use your mother's contact info if you can't afford your own cell phone.) If the dog goes \"missing\" one day, immediately report it missing to the microchip company and also to any animal shelters/rescues nearby. Any reputable animal shelter/rescue first checks for a microchip even in a \"surrender\" situation. The dog is not his to surrender.", "NTA Ben can get over it. Just because he’s autistic doesn’t mean he can’t learn.", "NTA i dont understand why any parent would think this was ok, like what? Id agree with your final assessment, he obviously doesnt care about your feelings. You have to suffer for his happiness. Its careless its selfish and cruel.\n\nId feel the same, id take the dog with me everywhere, i would stop going to school id do anything i could to keep a hold of him.\n\nIf he does this he cant possibly expect to get to know you as an adult. \n\nEspecially with such a reasonable demand of waiting till you finish your final year. Why does she need to move in now? Hes making this a choice between you and melanie, not you. Maybe he deserves to be happy but why do you deserve to be unhappy to facilitate this?\n\n\nBad bad bad bad bad dad", "NTA if anyone made me get rid of my dog or even tried, they would be out of my life forever.  If the gf cannot wait six months to move she is using your dad for his money!", "NTA. Malamutes are such beautiful dogs. You're NOT being childish and your aunt needs to mind her own business. Tycho is family to you, of course you don't want to rehome him! Hope things work out for you and Tycho.", "NTA tell your dad there is training that can be done to help Ben be okay with Tycho and both your dad and Melanie are AH.", "NTA, your dad is an asshole by playing favorites with you and his fiance. Stand by your point, it’s your dog.", "NTA  \n\n\ndog came first so he can wait to move in the new family until after a compromise has been made in which you get to keep the dog that he got you to help you handle the divorce.  \n\n\n  \nby asking you to give up the dog, he is already making a choice, not you", "INFO Can you spend some time with Tycho and Melanie and her son, helping him get over his fear of dogs? Maybe if you could use Tycho as a teaching tool for how to interact with dogs things might go more smoothly. The way I see it, you need to get documents that prove your ownership of Tycho, so maybe look into what that entails in your area, and once you're confident that he can't be given away at the drop of a hat you may be able to have a conversation about how to blend families without the stress of that looming over you. Tycho is part of your family, and I wish you luck dealing with this. NTA", "I like this comment because theres many good points to it. Why wasn’t the dog and a compromise conversation happen before?", "People who think pets are disposable are disgusting. I moved states a few years ago and when I was working out my notice at my previous job one of my coworkers asked if I was taking my cats with me. \n\nLike, duh? What else would I do? Give them away or take them to a shelter? I shudder at the thought. \n\nI guess some people just aren't pet people but I don't understand how you live with a creature for a while and don't bond with / love them. \n\nOP is NTA for sure.", "Well it says she rethinking the engagement not the moving in. I’m confused on why such a large change but, she might be feeling like she coming between the two.", "OP and the dog can live in Melanie's apartment.  They won't save money but it beats the other option.", "This is the right answer.", "Our autistic grandson has always done well taking care of his dog. There's no reason an autistic child shouldn't be able to adjust to a dog, especially a gentle breed like a malamute.", "Melanie having second thoughts because op would be moving out is a huge red flag that she totally intended to make op take care of her kid.", "I hadn't considered that, but damn, you're right. OP, PLEASE make sure to address this EXCEEDINGLY IMPORTANT topic like now, and make your boundaries exceptionally clear.", ">Or is it possible for you get to a housing arrangement that would allow you to keep Tycho with you while you are in college?\n\nI think the problem with that is  college is a year away and the dad isn't willing to wait a year for Melanie to move in.", "Oh, and as for your aunt... you know the meme with the greeting card that says \"For a Special Aunt,\" but it's written in a bad cursive font that makes the A in Aunt look like a C? I suggest sending her that.", "I’m going to talk to my grandparents again this afternoon I think.  I’m so afraid my dad is just going to take Tycho while I’m at school so I might just grab him and take him to my mom’s for a couple of days until I can figure something out.  She doesn’t have a yard and the place is too small for a big dog longterm. Maybe if I can move in with the grands I can help them out with chores the property and keep my dog with me, they have plenty of room.  My dad won’t like that, though, and I’m guessing there’s going to be another lawyer show down if I do that.", "\"is it possible to have someone you know foster him for a few months? The dog, not the crotch critter.\"\n\nThis is the greatest clarification I have yet seen on Reddit. Kudos.", "Build a family and still include her? Are you crazy? She and her dad ARE THE FAMILY and they are including 2 new people. And taking his autism into account rushing a move during the holidays is so much change at once and going to interfere with any set traditions that it literally doesnt make sense to do it. And getting rid of the dog you bought your child to help get through a DIVORCE so you can move in your new fiance is so messed up on multiple levels. It shouldnt be the responsibility of the 17yr old to figure out home logistics and accommodations for an autistic child and a woman she doesnt really get along with. The logical and best thing would be to wait until she is gone especially since he is so sensitive to the emotions of those around him. He could end up living in a super tense environment of resentment that would be a constant trigger for him. OP is nta but her dad is.", "Da Fuck is wrong with you? If you ever even entertain the notion of asking your MINOR bio child to find temporary housing so your new wife + step kid can move in then you are a trash parent.", "It’s not about dad not being a person and what he wants…it’s his willingness to displace a family member, and his daughter’s support animal, which directly relates to his daughters healthy MH, for only 4-6 months that makes him an AH.", "Yeah this is the correct answer. NAH from me. Don't get me wrong it sucks, MASSIVELY. However they will be married soon and a small child who has such severe needs may accidentally endanger the dog as well the dog could endanger the kid. Even if the pooch is the most calm dog ever, you can't predict how any animal will react when a small human is having a meltdown *against the animal*. Also it's their home but OP's dog. They are allowed to do whatever they want in their home just as OP should take their dog. I know living in an apartment for the year before you go to uni would be less than fun for pupper but the dad wants him out to protect both the dog's wellbeing and his step-son so yes move the dog in and then get a different place in uni. I brought my pet with me as soon as I was out of residence (one year). \n\n**OP stop making threats and start making plans. This is going to happen regardless and you need to make arrangements to protect the pupper.**", "Oh there was a conversation between Melanie and OPs dad. It went \"You'll get rid of the dog won't you\" \"yes, dear\"", "yes time, because for one they should not be suddenly moving an autistic child they should be introducing him to the change including the dog so he adapts.", "Why hasn't the mother taken small steps with her son to get over his fear? She knew her boyfriend had a dog.  Could the dog be in another room of the house when the boy visits? Can they be at the part together and the dog slowly be brought nearer and nearer to the dog? Has she talked to his doctor about how to resolve the issue to resolve his fear?", "Yeah their reasoning is bizarre. Autism has nothing to do with dogs. I’m autistic, and I love all animals; plenty of autistic people do. \n\nThe kid’s fear of an unknown dog has nothing to do with their neurotype, and they should be supporting him to understand the dog slowly so he is comfortable, and creating boundaries in the home so both him and the dog can co-exist.", "Nope. You take my dog away I take our relationship away. Seems fair.", "Its less harsh than forcing someone to lose a creature they love. It wouldnt be in the heat of the moment either. They would never be forgiven for this", "If OP's dad rehomes the dog then he is choosing his gf and \"stepson\" over his own daughter so yes she should consider cutting him loose if it comes to it. God knows what else the gf can get away with if this happens.", "Ding ding ding we have a winner!", "How long have you had Tycho?", "I wouldnt worry, because not only are you almost old enough for there to be no custody he could take, it would also be your choice and i feel like if it did end up in a lawyer situation a kid saying they do not want to stay with one of the parents ever is pretty strong for single custody. There probably wouldnt be enough time before you turn 18 for it to work but yeah, id move out either to gparents or mom with the dog and stop going to your dads all together. And you make sure you tell him that its you who doesnt ever want to see him", "If that works out and he doesn’t like that that’s on him, he made his choice.", "Why would he care if the dog goes to the grandparents? It solves the problem....", "Have you interacted with her son? Has he been over to the house with you?", "5 years.", "I'd say that's somewhere along the lines of intentionally causing you grief. \n\nTake your dog to your mom. Work on getting out of there if you can. Tell your mother what is going on. \n\nYeah, I get it, it's a small place, but it's short term. I don't know where you are, but as you move out soon, finding a place that really IS big for that type of dog might be tough. The good news is, dogs are generally pretty flexible and don't need a lot of room as long as they get exercise. \n\nIf it comes down to no other way than moving the dog out,  find someone that you trust that can keep him for you until you're away from this situation.", "OP, please don't leave your dog alone with your dad. I'm so sorry you're going through this and you are absolutely NTA.", "Info: Can you stay with your grandparents?", "Melanie is having second thoughts because she sees your dad as a person who is willing to get rid of an inconvenience,even when it is a living being. What will happen in a few years when Ben is going through puberty and becomes more emotional, and quite likely physically larger and stronger than Melanie. Maybe  even OP's dad. Will dad insist on Ben being re-homed because of this? You are doing Melanie a favor by showing her this side of your dad. If you find you cannot take your dog with you when you move, look for a breed specific organization or at least a reputable rescue in your area to take the pup in. They will make sure to find your pet a safe  and loving home. Good luck to in your future.", "NTA. Rehoming a large, middle-aged to senior dog is going to be so difficult. Plus it’s cruel to both you and Tycho. Just because he’s “only” a dog doesn’t mean that you don’t have a real, meaningful friendship with him.\n\nAs others have pointed out, it seems like working slowly and carefully with Ben to help him adjust to Tycho before the move is a third option that wasn’t fully considered. (I assume this would require delaying the move by a month or few). Does Ben have a therapist or counselor who can walk everybody through that process? That might even be a good experience for you, OP, and your dad to learn more about autism and specifically being supportive family members who can be part of a network who help Ben thrive?", "You will be 18 in a year. Melanie and Ben can wait a year to move in and then you can move out and get your own place with Tycho. Your dad is being an AH by rushing this move. NTA", "NTA \n\nHe bought you that dog to bandaid the pain the divorce caused you. He doesn’t get to take the dog away now that he’s moved on and your pain isn’t front and center. Remind him of what the state of the divorce did to you and how Tycho has gotten you thru it. Certainly he never could have expected to fall in love with a woman whose kid is scared of dogs but when he chose to get you a GIANT breed he should’ve considered what that may mean for the future. He’s the adult.", "NTA dogs aren’t furniture", "NTA rehoming a dog is horribly cruel. They should postpone the moving in together if it is so hard for them\n\nHonnestly if it happened to me and they manage to get rid of the dog I would never speak to him again.\n\nFiancé is manipulative and tries to gaslight you by making it about you wanting her when it's about your dog.", "NTA. Ben is not more important than your dog, and he’s gonna have to learn sometime that the world isn’t gonna stop for him because he’s autistic. Sucks but such is life. Melanie and your dad also need to realize this. \n\nYou could find a way to keep the dog separate from him in the house. You could keep him in your room, or section off one part of the house with a doggy gate. That seems like a fine compromise. Ben won’t have to see the dog, and you get to keep him. It makes no sense to ship the dog off altogether, and your Dad is definitely the AH for even suggesting that. He’s also choosing his new family over you, which is not okay. Your own kids always come first, before women and definitely before step kids. \n\nDefinitely do not leave your dog alone. Your dad WILL get rid of him.", "NTA.  He doesn't have to do this move over the holidays. He WANTS to do the  move when he wants to, and wants you to just go along with it.  I'm so sorry about your dog.  I hope you're able to figure something out.", "NTA\n\nMake it clear to Melanie that if it means giving up your dog, you don't want to live with them. That is a fact. You have bonded with this dog for years and forcing you to give it up now is cruel. Your dad and Melanie need to figure something out here because they created this situation. She 100% knew you had a dog before moving in came up. You've already offered your solution, which is to move with the dog as soon as you are able to\n\nThe other possible solution would be is it possible for you and the dog to move in with your grandparents?\n\nAlso, your aunt is an AH who doesn't care that making your dad happy makes you miserable in this situation", "NTA at all. Your Dad sure is though. Especially since he can't be bothered to wait just a bit of time until you move out. All this just to save money 🙄\n\nI would actually ask your Grandparents if you could move in with them until you're able to get your own place. They might not be able to take care of him themselves, but you can definitely take care of him there. \n\nPlus you won't have to worry about your Dad rehoming him when you're not around. \n\nI also really feel sorry for Ben because they aren't actually helping him. They're just trying to avoid a meltdown. They aren't helping him learn to deal with change and are instead teaching him that if he has a big enough reaction then he'll get what he wants.", "NTA, but you don’t have many options to exercise right now honestly-", "NTA - Your Dad should have prepared better.  It shouldn't fall on you or your Dog for your Dad's poor planning and insight.  That being said, have to spoken to any of your friends?  Would their family be able to house your dog until you can find a more permanent arrangement?", "NTA \nPs. Dog tax 🐶", "NTA but the logistics here are complicated. It’s very difficult to find rentals in most college towns that are dog friendly and usually costs extra money both upfront as a deposit and every month. Plus added vet bills etc. I am confused why you would start dating someone who hates/is scared of your pet? That’s just fundamental disagreement that is impossible to be overcome right there. Pets are family.", "NTA.  When you have children you choose to put them first.  He needs to remember this.", "NTA. Your dad is literally choosing them over you. \n\nBest of luck, OP", "NTA - your dog is obviously part of your family and is very important to you. Your dad and aunt are basically disregarding your feelings. They can suck it up until you can move out.", "NTA. Lean in on Melanie if your dad persists. You can make their lives very difficult. She’s as much of the problem as your dad is and easier to chase away.", "I wonder how the girlfriend would feel if she had to re-home her kid because it didn't suit the dog. Dogs are family too. \n\nThis whole situation is bonkers but keep hold of that dog OP. NTA.", "NTA\n\nBut be careful. You dog might... disappear. That happens a lot on this sub.\n\nCan you and Tycho move in with your grandparents? Then you can take care of him more?", "op=NTA\n\nThey aren't even trying to compromise--If you can afford it--get your dog chipped(See if you can get it in grandparents name or something for now).  \n\nBecause this is a matter of months until spring, I think they should work with you rather than force you to rehome your pet.  Maybe you could check local organizations to see if someone can foster Tycho for a few months.", "NTA\n\nYou should make sure Tycho is chipped with your name and contact info, in case your dad tries to give him away. If you can write your info onto the inside of his collar, do that too.\nAlso, if you can, add a geotracker to his collar, like an Apple airtag or Tile etc\n\nBut this whole issue is also a big indication that your dad and Melanie have not thought through or discussed the many implications for the future that come with a blended family.", "NTA - \n\nToday it's the dog, tomorrow something else you care about.   Sit your father down and ask him for all of us: \n\nDad - EXACTLY how much does  HIS CHILD have to sacrifice for YOU to be happy?  Seriously OP get an answer how much?   Can he not be asked for another year or two for you to grow up before she moves in? Must it be now?   \n\n&#x200B;\n\nTell Auntie that you are being childish because it is your right to be so when you are a child, Adults don't ask kids to make adult sacrifices.   \n\n&#x200B;\n\nPS.   Adults should not leave the things they valve the most near people who had to sacrifice what they value the most.   I once new of a boyfriends son who threw the girlfriends family heirlooms into ocean over a rehomed cat.", "The pup is a commitment and needs to be cared for.", "NTA  May sure Tyco is chipped right away.  You dad is putting his fiancé and her child above you.  You matter.  Tyco has helped you adjust to your parents' divorce.  Hasn't your dad done enough to you already?", "NTA\n\nI think you have a right to be worried about Tycho not being there. I have a feeling that somehow he would disappear \"accidently\". I'm sorry you're having to go through this. Your dad deserves to be happy but not at the expense of you.", "NTA \n\nOP, you are right, if your dad does in fact love you he can bloody well wait to move in his fiance until you move out. You've already promised to do it in the Spring.", "OP, I will say living with a dog in college can be very difficult. I have a service dog, and because he can't be legally denied I've been able to secure housing and still have him. \n\nIt seems like Tycho might already be acting as an Emotional Support Animal for you, as it seems he was adopted with the purpose of helping you through an emotionally turbulent time. Would you be able to work with your dad to secure therapy if you don't already see a therapist already? That way they can help you through this big life change of step family, and help you secure the legal paperwork to make Tycho an official ESA if he qualifies. That way when you go to college, you'll have more rights and protections in housing with Tycho. \n\nWishing you all the best", "Nta. Maybe a compromise can be met,  can your dad afford a one bedroom apartment for you and your dog for the next few months while you finish school up?", "NTA, every adult you've mentioned is the A here. I'm so angry on your behalf.", "NTA - I hate to suggest this but take the matter out of your father’s hands and try to temporarily rehouse Tycho with a friend or family member who is sympathetic to you. You’re right to worry about leaving your dog alone at home, it seems very plausible that your father could take the matter out of your hands and take Tycho to a shelter.", "Huge red flag on your dad's fiancé having second thoughts cause you won't be living with them. If you had a relationship that's one thing, but it sounds like she's upset to lose a default babysitter.", "NTA at all and I’d double down with dad and say flat out if he forces you to rehome the dog you will go NC forever and he will never be a part of you and any future life you have, including grandkids if you ever have kids.", "NTA,\n\nyour dad's first priority should be his own daughter. That clearly is not the case.", "NTA. Reiterate that you will never forgive him if he even attempts to give away your best friend. If they can’t wait a few months to move in then there is something seriously wrong with the relationship.\nTycho is your closest companion, you are NOT overreacting.", "NTA but your dad is a major a-hole for thinking that giving up a pet because it is inconvenient is in any way ok!", "I feel like there are NAH.\n\nSounds like Melanie is having second thoughts about if this new home is going to be a safe space for her Autistic child. She is putting her son's wellbeing before her love life, which is honestly the right thing. Autistic kids *need* so many things that neurotypical kids can live without or adapt to. It's not their fault, their brains are wired differently.\n\nOP, you shouldn't be asked to give up your beloved dog of 5 years, and an Autistic child shouldn't be forced to live in a house with an animal that triggers him.\n\nI feel bad for your Dad, but he might have to let Melanie go for everyone's comfort and health.\n\nIt just sounds incompatible all around and no one is at fault.", "As much as you love him you may need to reach out to a malamute rescue. So start doing research now, just in case.", "NTA your dads a fucking asshole", "NTA your aren't making this a choice between them and you, your dad has already chosen them over you.\n\nIs there anyway you can move in with your mom or grandparents temporarily with Tycho? Then when you go to college you can find a place with him.\n\nI grew up with malautes and they are giant teddy bears and the best doggos", "NTA — your dad and Melanie are though. Pets are not disposable and it boils my blood when people think they can just get rid of them when it becomes inconvenient. I would move mountains to keep my cat. Your bond with Tycho is just as valid as your bond with any human. I’m so sorry that you’ve been treated so poorly. Your dad hasn’t made any effort to try to come up with an effective solution or compromise with you so he’s being a shitty parent. There’s no reason why something can’t be done to try to help Ben get over his fear of dogs or for them to move in after you move out in 6 months. It also seems weird that Melanie is having second thoughts about moving in if you’re moving out. Sounds like she’s looking for free babysitting. Ultimately, you and Tycho were there first. I really hope something works out and that you and your boy can stay together. ❤️", "NTA. Dad can be mad all he wants, but when it comes down to it, yes, he is facing a choice between his child and his fiance, and his child should come first. If their engagement is so tenuous that something like this has her reconsidering the marriage, then maybe they aren't ready to get married and manage a blended family. You've offered a reasonable compromise; why do they NEED to move over the holidays? I would get a GPS/tracking collar for Tycho if it were me. Please update!", "Nya, your dad and fiance are way out of line here. Your situation would already have damaged my trust in a parent beyond repair . I hope it'll work out for you and your dog.", "NTA. Your dog was there first. Your dad is the one that encouraged the dog. You have a bond with him. I don't think it's fair for them to just disregard your feelings. The new girlfriend clearly doesn't care that this hurts you. Which is selfish and your dad not seeing this self centered attitude, that her child is more important...that's sad. Of course her sons feelings matter too but I agree that they can put off living together until you go off to college and can find a better solution. Your dog is important.", "NTA at all", "Again, another baffling blended family story where the adults are being selfish and the kids are facing the consequences of it. Your father IS choosing his fiance and son over your comfort. Sure, his stepson should feel safe in his own home, which is WHY his mother should wait to move in. I get that housing costs are expensive which is why they want to downsize, but not at the expense of her future stepdaughter/your fathers ACTUAL CHILD. \n\nAlso, can we talk about how emotionally manipulative it is for her to hold you up as the reason for \"calling off the engagement\"?! She's putting him in this position, not you. \n\nYour father does deserve to be happy, but not at your expense. I bet if you asked your aunt if you and Tycho could move in she'd balk. \n\nNTA, and start saving money for vet care and pet deposits", "NTA \n\nI swear I’ve read this story on here before though.", "NTA.  Very cruel of your father.  Could you contact a malamute rescue organization and see if someone can foster your dog until you are ready to leave for college?  It might be close enough for you to visit your dog regularly, which would be good for both of you.", "NTA\n\nIt's crazy anyone thinks it's ok to get rid of your dog.", "NTA. There is a time your dad needs to understand having a child comes with its own sacrifices. If Melanie has an autistic son who doesn't like the dog and your father has a child (you) who os attached to the dog, they are simply not made for each other. You did offer the solution that is a good one and he rejected it? You can't just give your child a dog and then rehome him 5 years later, especially not when it's so easily avoidable by *check's notes* just telling your girlfriend \"Not yet, wait for a bit\". This will emotionally ruin both you and the dog. It's not about stepson or the dog, it's about stepson or bio daughter. Doesn't he care enough about you to just WAIT, that's literally all? Now your father has to choose: is his relationship with his girlfriend really more important than one with his own daughter? Because he WILL lose you if he goes forward with this and honestly? He should. Also, tell your dear auntie to look after the dog and solve this, since she is so interested in your business", "NTA", "NTA. You deserve to be happy. Your dad could do many other things - like even putting things off.", "NTA, but it definitely seems like your dad is the AH here.", "NTA - how about getting a trainer or a therapist to work with the kid & the dog & the family as a whole? I'm sure that with some time & effort, they can find a peaceful coexistence.", "NTA.\n\nI am a parent of an autistic child.  There were things that she didn't like but now doesn't mind.  I.e. she hated anything touching the back of her head - not even water and she refused showers.  Now, she is in swimming lessons doing her starfish floats on her back.\n\nAccomodations include getting her son help to deal with certain issues so perhaps get a therapist to help him with his dog issue.\n\nThe dog is pre-existing in this whole dynamic.  He is not a lesser than anyone else.  He is a member of your family.", "YTA. I think you are being childish. I'm going through a little different situation that involves my dogs and my relationship so I can see the other point of view. I don't think it's fair that your dad's relationship should suffer because of your dog. You're demanding that he has to drop his life and put things off for your dog while continuing to take care of a dog that is upsetting to the family he's trying to move on with. Plus, what makes you so sure you'll be able to afford to keep your dog while you're at college? Not all dorms and apartments allow dogs and most have size restrictions. Unless money is no issue there's still the cost of feed, routine care, veterinary care, and doggy daycare because between classes, studying and possibly a job you'll not have much time for your dog. I think you need to consider being a little more reasonable and maybe look for a foster home or actively search for a stable home for your dog. Your dad was trying to make you happy by getting the dog but didn't consider the reasons that might not be a good idea.", "Agree. This is sad, but OP should be prepared that it is going to be very, very difficult as a college student to find a place big enough for such a large dog.", "This is such an important thing to consider. I have a lot of sympathy for OP and she's definitely NTA, but realistically, she's looking at a hard time ahead. Pets are expensive for all of the reasons you've listed, and I hope that she's able to manage it but she needs to start preparing ASAP", "There’s also the option of getting him registered as an emotional support animal and taking him to the dorms with you. For you, he is a huge factor in helping with your emotions and you should have no trouble getting a letter from a therapist. Your college may also require other documentation so you’ll need to contact them to find out. It may require you to live in a specific dorm, though, so know that. You will still have to cover food, vet expenses, etc. though so you’ll need a job regardless.", "Agreed. Both OPs dad and Melanie are thinking too much about themselves and not enough about their kid's needs.", "Agreed, op and her dog were living there first too, also a best friend pet can be really important for a teenager's/young adult's mental health especially considering turbulent past. Since she said they're gonna move out quite soon with the dog, the father has multiple options and compromises available, like blocking off a part of the house so the dog can't free roam in whole house while op is at school, just postpone his gf moving in until op moves out, maybe building necessary structures (dog house, fences etc) in the yard and keep the dog in the yard during daytime until op comes back from school and takes over dealing with the dog inside (obv only outside when it's not too hot or cold and that fresh water and housing/kennel for shade is provided etc etc), or something else. Most things in life are compromiseable. Well only if parties involved want to compromise, not just bulldoze over everyone else.", "This is a really good point. OP should ask her Dad what his expectations are of watching the stepson, because OP might need to move her timeline up to get out of the house faster if they expect OP to be consistently available to watch the 9 y.o. \"Needs a lot of accommodations\" sounds like he isn't very high functioning and they may see OP as the ticket to getting the child taken care of for free and still getting to enjoy a honeymoon phase.", "Sounds like Melanie is having second thoughts about if this new home is going to be a safe space for her Autistic child. She is putting her son's wellbeing before her love life, which is honestly the right thing.\n\nI feel like there are NAH.\n\nDad wants his new relationship to work out, OP needs their dog and Melanie is looking out for her son. It just sounds incompatible all around and no one is at fault.", "I doubt she was counting on OP being free childcare.\n\nShe seems to recognize that she would be disrupting OP's life in a big way by moving in, so much so OP is willing to move out. Melanie seems like a kind person who isn't going to break up a family for a romantic partner, nor cause her son distress for the same reason.\n\nShe's bowing out of the situation instead of forcing the children involved to be unhappy so she can get what she wants. She's acting with grace and maturity, not vindictiveness.", "Ben is Autistic. His brain is wired differently and if dogs are a trigger for him they will be for his entire life. It would cause him serious mental harm to be forced to live with Tycho.\n\nHis mother is looking out for him, like she should be. She also seems to understand how difficult and hurtful it would be to make OP give Tycho up, which is why she's rethinking the engagement entirely.\n\nThese two families just aren't compatible it sucks but that's life.", "I’m going to see if they would be willing, they could probably use the help anyway, but my dad is going to throw a fit and I don’t want him to make things hard on them either.  I’m going to talk to them this afternoon after school.", "Yes.  I have a cat and people even struggle to find rentals with them.  Unfortunately, dad likely got the dog to keep them coming over but didn't seem to be committed to keeping the dog.", "NTA. It’s true, the dog and you were there first and if he gets rid of YOUR dog he sucks. He can wait until the spring when you move out. The other kids feelings and diagnosis does not trump your feelings", "Yep.  Heck I pay a lot just for flea meds for a cat!  Plus, her food is pricy (I do buy better quality foods though).  Buying food and flea meds alone for a dog that size is going to be a significant expense.  Let alone vet bills and the extra money to pay for housing.", ">Pets are expensive for all of the reasons you've listed\n\nThe least her dad could do is help out with costs. He bought the damn dog, and then decided he didn't want it anymore.", "I completely understand that everyone cares about what he will feed the dog etc. but I think a dog much rather eat cheap food than be taken away from someone they love. Many dogs/cats never recover from being abandoned or re-homed. They continue to struggle with anxiety, stop eating or get sick. Me and my husband live in a tiny apartment and had to take in his family cat, she’s lived with his family for 9 yrs, but they bought a new house and got a dog so they “couldn’t” keep her. She was miserable after being sent to a family friend, so we took her. She was pulling her fur and was depressed. Now her fur is back to being soft and she’s even starting to play", "Dad was too busy getting his dick wet", "I can pretty much guarantee she’s just putting the pressure on Dad to get her way. Some stepparents see themselves as taking on a parenting role, others see the kids from the old relationship as an impediment. If she’s making “your daughter’s dog or me” ultimatums, that’s ultimately means “your daughter or me” and Dad here looks good and ready to make the shittiest choice.", "How do you know that?", "Take Tycho to the vet and get him chipped in your name, if he isn't already, as soon as possible.\n\nYou're also old enough to choose where you want to live, and court can move slowly. I'd see about living with your grandparents for a while if that's possible. If you're close with them, it's great to have that quality time with them. I lived with my grandmother for a while as a student, and some of the best memories we had together were made during that time before she passed.", "Get Tycho chipped OP and also check the laws in your state. It's completely possible that you're independent enough now that a court will simply let you do as you please.", "You're almost 18.\n\nCourts will take your wants and needs into account as to where you want to live.\n\nIf your Dad wants to have a showdown over you having to give up your dog so he can have other people move in,  which is forcing you to choose your grandparents' place,  the courts may take a dim view of your father.\n\nIt won't go his way.\n\nIs he a controlling or combative person?\n\nMany divorces are contentious, but the fact that you're predicting that he'll have a meltdown because you'd want to move in temporarily with your grandparents, so you can keep your beloved dog, makes him look petty and volatile.", "Update us when you can!", "Let them fight. It’s not your problem or your fault that your parents are incapable of being civil with each other (although given the circumstances your dad is a total AH and your mom would be right to be pissed). You’re 17, no judge is going to override your wishes about where you want to live, especially given *why* you want to live there. They can tell and scream and go to Family Court all they want. Talk to your grandparents, figure out how to help them with the property, and have a wonderful time with Tycho! NTA obviously", "It's so hard to successfully blend a family in the first place, and OP's father will have blown up any chance at this if he goes through with it.", "Don't forget about how important grooming is for a dog like that. If OP is planning on being a full-time college student, they need to work out the schedule to make sure the dog gets adequate enrichment and exercise. They've been put in an awful position right now, honestly. Fingers crossed for her to he able to figure everything out.", "If you want really good flea meds for your pet but don't want to pay out the butt, go to pet friendly.com. They do a flea treatment monthly box thing. I got dogs and pay $11/month/each treatment and they send it to you throught the mail", "This they haven't bothered because its hard so instead they want to emotionally destroy op by giving the dog away.", "Yup. Full nuclear at that point.", "Because she would move with the dog to the grandparents."]}