{"id": 4990, "submission_id": "zoi58u", "title": "AITA for refusing to go to my mom's wedding because my sister's fiance is walking her down the aisle and he previously pranked my wife?", "selftext": "My younger sister \"Tessa\" has been with \"Brian\" since her freshmen year of high school (currently seniors in college) My mom has always loved Brian and treated him like family. He has some issues with his own mom and spent most of his time at our house. \n\nSix months ago Brian \"pranked\" my wife on a family trip by destroying all of her makeup. she found it in the toilet and in the sink filled with water and was irate. I've never seen her like this. We woke my mom up screaming and demanded she find out who did it. She didn't seem to think it was a big deal and tried to go back to sleep. Finally she realized we were serious so she woke Tessa, Brian, our other sister, and her boyfriend up to get to the bottom of it.\n\nBrian couldn't keep a straight face and finally admitted to it. My mom again tried to act like it wasn't a big deal, but I cussed Brian out and demanded he replace everything. We came up with an estimate which was just over 1K (makeup is her passion) and my mom paid it because she said Brian was just a college kid. I was pretty pissed and we cut contact with Brian. It has since been implied that he was bribed with a fancy watch to do this ANd EvERyOnE wAS dRUnk, but to me there is no excuse. I still don't fuck with Brian.\n\nWell my mom is currently planning a wedding and was talking about how she has no one to walk her down the aisle as she is mad at her father, but she feels like it's weird to not have someone. Brian volunteered and she was clearly really moved by it and said yes. I internally felt sick. I told my mom that if she publicly honored Brian like that I would not be able to go.\n\nMy mom seemed really taken aback and said I was being crazy and we need to put this aside for a wedding. I said I was sorry, but I could not go if Brian was in a position of honor, because what he did was despicable. My mom said I was selfish and an asshole and was like fine don't come. Brian got mad and said I was punishing my mom, and Tessa was screaming at me, calling me selfish and a horrible son.", "created_utc": 1671316041, "permalink": "/r/AmItheAsshole/comments/zoi58u/aita_for_refusing_to_go_to_my_moms_wedding/", "score": 130, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > It is my mom's wedding and that is a huge thing to miss. She didn't do anything wrong and was not involved in the prank. She loves Brian like a son and wants him there for that big moment\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "(Who the heck was behind Brian destroying your wife’s makeup with the gift of a fancy watch? THAT should deserve some unpacking…)", "So NTA.  \n\nFirst of all, it wasn't a prank.  Cambridge Dictionary says a prank \"is a trick that is intended to be funny but not to cause harm or damage.\" Destroying $1,000 of anything isn't a prank, it's bullying. \n\nSecond, I'd be pissed that mother's fiancé put Brian up to it. \n\nThird, I'd be pissed that Brian did it. \n\nFourth, and most importantly, I'd be pissed that my mother and her fiancé and Brian don't seem to get that it was a big deal.  I'd be pissed that mom paid to protect Brian.  I'd be pissed that despite his act of abuse, she decided she'd rather have him walk her down the aisle rather than her own son.  \n\nAnd frankly, if some little twit destroyed $1,000 of my stuff, I'd feel violated and abused and disliked.  I would absolutely expect some groveling, and it sounds like that didn't happen.  Honestly, your family sounds like a piece of work and I'd probably not want much to do with them if I were you.", "NTA\n\nYou aren't comfortable with Brian after he did what he did,  unapologetically and found it funny. \n\nNobody is required to attend the wedding,  I would not make a big deal out of it,  but just politely decline.\n\nAlso,  it wouldn't be bad if you just put up with it for one day for your mom.", "NTA fuck them all, don't go", "NTA.  It sounds like you are in a difficult situation where you have strong feelings about Brian and his actions, but your mom and sister are both defending him and his involvement in the wedding. It's understandable that you would feel upset and frustrated in this situation.\n\n  \nIt's important to remember that you have the right to make decisions about what makes you feel comfortable and what you are willing to participate in. If you don't feel comfortable attending the wedding with Brian in a position of honor, it's okay to express that to your mom and sister. It's also okay to set boundaries and not participate in events that make you feel uncomfortable or upset.\n\n  \nAt the same time, it's important to try to communicate your feelings and concerns in a respectful and understanding way. It's understandable that your mom and sister are upset with your decision not to attend the wedding, but it's important to try to approach the situation with empathy and understanding. It might be helpful to try to have a conversation with your mom and sister to explain why you feel the way you do and to see if there is any way to find a resolution that works for everyone. It's also okay to seek support from other family members or friends during this difficult time.", "NTA. It's funny that your mother can be mad at her father, but you're not allowed to be mad at Brian and those who encourage him.", "NTA and why wouldn’t she ask you her son to walk her. Gees. I would be upset too.", "NTA first of all destroying $1000 of makeup is not a prank. Secondly why wouldn’t she want you, her son, to walk her down the aisle?  I feel that there is a lot of background info missing here. However I absolutely do not blame you for not attending the wedding.", "NTA", "NTA.\n\nIt’s not about the damn makeup. It is about not respecting someone’s items. It’s about how Brian had ZERO CONSEQUENCES for his action, since OPs mother paid.\n\nThis wasn’t a 5 year old who did the prank, no it was a grown ass adult who disrespected someone’s items and didn’t give two shits.\n\nOP is mad because his mother doesn’t care about his and his wife’s property allows Brian’s actions to go unnoticed. It was never about the prank/makeup, it was about the lack of respect regarding their property and ZERO accountability on the Brian.", "NTA\nI'm pretty sure that where I live, over 1K worth of property damage is a felony. Basically, Brian committed a felony against your wife, got away with it, and your mother adores him. Your reaction makes sense.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy younger sister \"Tessa\" has been with \"Brian\" since her freshmen year of high school (currently seniors in college) My mom has always loved Brian and treated him like family. He has some issues with his own mom and spent most of his time at our house. \n\nSix months ago Brian \"pranked\" my wife on a family trip by destroying all of her makeup. she found it in the toilet and in the sink filled with water and was irate. I've never seen her like this. We woke my mom up screaming and demanded she find out who did it. She didn't seem to think it was a big deal and tried to go back to sleep. Finally she realized we were serious so she woke Tessa, Brian, our other sister, and her boyfriend up to get to the bottom of it.\n\nBrian couldn't keep a straight face and finally admitted to it. My mom again tried to act like it wasn't a big deal, but I cussed Brian out and demanded he replace everything. We came up with an estimate which was just over 1K (makeup is her passion) and my mom paid it because she said Brian was just a college kid. I was pretty pissed and we cut contact with Brian. It has since been implied that he was bribed with a fancy watch to do this ANd EvERyOnE wAS dRUnk, but to me there is no excuse. I still don't fuck with Brian.\n\nWell my mom is currently planning a wedding and was talking about how she has no one to walk her down the aisle as she is mad at her father, but she feels like it's weird to not have someone. Brian volunteered and she was clearly really moved by it and said yes. I internally felt sick. I told my mom that if she publicly honored Brian like that I would not be able to go.\n\nMy mom seemed really taken aback and said I was being crazy and we need to put this aside for a wedding. I said I was sorry, but I could not go if Brian was in a position of honor, because what he did was despicable. My mom said I was selfish and an asshole and was like fine don't come. Brian got mad and said I was punishing my mom, and Tessa was screaming at me, calling me selfish and a horrible son.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. That was not jUsT A pRaNk and good for you for standing up for your wife. Your mom sucks.", "NTA  but I would still go to wedding for your moms stake not for that AH Brian", "NTA. It wasn't a prank. It was destruction of property and the fact that your mom paid for  him makes me think your mom doesn't like your wife much. Do yourself and your wife a favour and cut them out of your life.", "How come you didn't volunteer to walk her?", "NTA \n\nWeird she would have Brian walk her down the aisle and not her own son!?!\n\nHow did Brian end up the golden child?", "YTA\n\nBut, only in this instance. (Brian is ultimately an asshole for what he did, but that's another topic)\n\nYour Mom has made a choice about her wedding. This obviously means the world to her. This has absolutely nothing to do with you, or your feelings. The fact that you insist on making it so, makes you an asshole. \n\nSuck it up, swallow whatever (rightful) hatred you have for Brian, and be there for your Mom.", "YTA\n\nI wouldn't have been happy with Brian either, but you don't get to cause drama at your mother's wedding over a makeup prank. He didn't abuse someone. He showed poor judgement and you were reimbursed.\n\nAlso, your willingness to \"scream\" and wake up your entire family to seemingly get to the bottom of what happened to makeup in the middle of the night is way over the top. That's the kind of reaction I'd expect in a serious emergency. Not over some ruined makeup. Are you and your wife always this uptight?\n\nRelax.\n\nThat was awful, but you should have just waited until the morning and had an adult converastion about it.\n\nETA: Just to be clear, I'm not saying you're wrong to be upset with Brian, but the fact that you'd drag that situation into your mother's wedding just makes you particularly petty. That is not the time. The wedding has nothing to do with you and you don't have the right to dictate how the rest of your family feels about Brian.", "YTA.  It’s her day, not yours.  Why didn’t you volunteer to walk her down the aisle?  Time to move on from the prank.  It was dumb and I’d be pissed too if someone destroyed my markup but your wife was paid for it.", "YTA.\n\nWhen that particular prank was executed, Brian was the AH. When your wife discovered the prank, you & her were both AHs for dragging the entire family into it in the middle of the night on a family trip. Your mom paid Brian's AH tax, as she thought he couldn't afford it, and made it right. There was no physical harm, no emotional trauma, no ongoing threat...just a poor decision that turned out expensive, but reparation was made.\n\nThe situation at hand is your mother's wedding. You are emotionally blackmailing her by telling her that her son (you) refuses to be at her wedding if Brian (who she also considers a son by circumstance) walks her down. Unless you apologize, admit to her you clearly have emotional issues you need to address regarding her affection toward Brian (jealous? insecure?), and tell her you would like to share the honor and walk her down WITH Brian...you are definitely TA. \n\nBlows my mind resentment had gone this far... over overpriced makeup... that was replaced.", "ESH. \n\nThe prank *was* despicable and incredibly stupid. Unfunny, disrespectful and inconsiderate. \nHOWEVER, Is this honestly the hill you want to die on? Are you really willing to miss celebrating your mom’s happiness over this? This is your mom’s wedding. You might regret allowing a stupid and unfunny prank to come between you. \n\nBrian seems like he’s got lots of maturing and growing up to do - and your mom will find that out the hard way. But you don’t have any control over that. That is not your problem. Sometimes it’s best to let bygones be bygones and let time teach the lesson.", "ESH Reading between the lines… it kinda seems like your mom doesn’t really care about your wife the way she does about Brian. I’m also going to guess that it bugs you that she treats him more like a son than she seems to do for you. Yeah your wife got paid for the makeup, but I’m guessing your lingering anger is that your mom won’t admit that he shouldn’t have done it, that it was a big deal, and instead acted like you and your wife were the problem. I don’t think you are the asshole for not going to a wedding, but that’s not really what you are doing - you are trying to get your mom to value and like Brian less. And that’s manipulative because there’s no reason why she shouldn’t bond with and love him as a part of her family. I don’t know if you are ready for the consequences of skipping this event though. I hope you know - This isn’t going to make your mom pick you over Brian. It’s just going to cement him further in place as being her inner circle while you drift out. Instead, consider trying to talk to your mom about what’s actually bothering you and remember, you can ask for a different relationship with her, but you aren’t going to be able to control or change her relationship with Brian.", "YTA- this is your mom’s wedding and you’re behaving like a whiny baby. Grow up and put your anger aside. You don’t have to associate With him.  You’re choosing your hate for him over your love for your mother", "ESH. You would be the AH to skip the wedding (it's the mom's wedding, not Brian's), but it was crappy of your mom to not have the kids walk her down the aisle.", "YTA. Yes it was a dumb prank, and yes, you and your wife have the right to be mad about it. But are you really going to miss your mom's wedding just because you don't want to watch Brian take like a few minutes to walk your mom down the aisle? That's more childish than what he did in the first place. Way to show you love your wife's makeup more than your mom.", "[deleted]", "YTA. It was a stupid prank that was out of line but the makeup was replaced. He didn’t kill a fucking puppy. Sounds like you’re a bit jealous of her relationship with him.", "If you hate Brian (because of makeup that was replaced *by your mom*) more than you love your mom that's your choice but it makes you YTA", "Nta. That honor should gave been yours.", "NTA.", "Nta. Also why is he walking your mom down and not you? To me if she didn't want her dad it makes more sense for her son instead of her daughters bf", "How is that a prank?  Isn't that just theft and destruction of property?\n\nNTA, I wouldn't go anywhere near this guy.", "YTA- you're punishing your mom here, not really Brian.  \n\n>I still don't fuck with Brian.\n\nI'd make a special point of it, viciously, anonymously, and unpredictably.", "ESH - but clearly Brian has some “college kid” growing up to do. I’d suggest asking mother politely after setting out the reasons calmly, to rethink having this non-related idiot who is immature, representing. And if it’s still a no, talk to the wife and let her make the final call too as to turning up.", "YTA. Brian is not a good person and you should be no contact with him, but it's your mother's happy day. Don't focus on the 30 seconds he's even minimally in the spotlight, focus on the fact that you're there to celebrate HER and her stb husband. Don't let him get in between you and your family... that's just giving him power he doesn't deserve. Make him nothing to you... just ignore his existence.", "YTA, but read on because it's not all clear cut.  \n\\[edited because my feeble brain read years instead of months\\]\n\nWow. You've held all this anger for six months?\n\nI mean, I understand the initial anger. Personally, I HATE pranks, especially ones that involve destroying someone's personal property.\n\nBut it was six months ago and everyone except you (and I assume your wife) has moved on. Restitution was made. I don't agree with your mother making it -- it should have been her fiancé since he's apparently the one who \"humorously\" suggested the Rolex in exchange for said prank. But whatever. That's something your mother and he have to work out for themselves.\n\nSo Brian has born the brunt of your anger over all this. You're not upset that your mom is marrying the dude who came up with the hairbrained idea of destroying your wife's makeup.\n\nLook, I can understand that you're pissed, but I'd be pissed at the dude your mom's going to marry, not just at Brian. But you don't seem to be bothered by him at all. Even though he took zero responsibility for instigating the entire situation and paid zero dollars towards the restitution. You didn't cut him out of your life, just Brian.\n\nWhich makes me wonder what else has gone on with Brian. Do you wish it was you who was walking mom down the aisle? Are you upset that your mom considers him as a son from another mother? Or are you just so invested in this six-year anger marathon that you can't see a way to drop the whole thing, even for a few hours to attend your mother's wedding?\n\nEither way, you need to find a way to get past this. Everyone else has (don't know about your wife) and this six-month harangue you're on is hurting you more than anyone else. I mean, beyond the wedding everyone else has simply gone on with their lives. Meanwhile, you've been walking around nurturing this resentment.\n\nLook, all of us have done things in our past that we regret and that were AH moves of some sort. No one is a perfect ray of sunshine. I certainly would not want to be judged forever by one thing I did that was stupid for this long. In this situation, no lives were lost. Restitution was made. Apologies were given (I hope). C'est la vie.\n\nDecide if you want to be there for your mother or not. Go or not. But cut Brian a little slack. You don't have to be best friends, you just have to tolerate him for one event. If it bugs you to see him walk down the aisle with your mom, look away or close your eyes, and be there for the rest of the wedding. Or not. I mean, after all, the dude who started the whole thing is marrying your mom and he never seems to have suffered any kind of consequence for his part in the whole mess that started the problem. <sigh>", "YTA. It's not your wedding and you're an adult. This is not the type of thing people break families up over.\n\nBe there for your family and know that you've taken the high road and keep your head high", "Apparently my mom's fiance offered to give him a Rolex but he claims the whole conversation was a joke and it isn't his fault that Brian was too wasted to get that.", "It was a few years ago, and my brother-in-law was always up to something mischievous. One day, he decided to pull a prank on me while we were at a grand gala at a lavish mansion in the countryside of England.\n\n  \nI was dressed in my finest evening attire and enjoying a glass of champagne when I suddenly felt a tap on my shoulder. I turned around to see my brother-in-law, dressed in a dapper suit and a mischievous grin on his face.\n\n  \n\"Come with me,\" he whispered, leading me down a quiet hallway. I was a little bit hesitant, but I trusted my brother-in-law, so I followed him.\n\n  \nAs we walked, I couldn't help but feel a sense of unease wash over me. I had a feeling that my brother-in-law was up to no good. And as we approached a closed door, I knew my instincts had been right.\n\n  \nHe swung the door open, revealing a room filled with smoke and the sound of gunfire. My heart raced as I realized that this was no ordinary prank – it was a simulated shooting range!\n\n  \nI was terrified and begged my brother-in-law to stop the prank, but he just laughed and handed me a gun. I refused to participate, but he insisted, saying it was all in good fun.\n\n  \nI was relieved when the simulation ended and we were able to leave the room, but I couldn't shake the feeling of fear and disgust that had overtaken me. I made it clear to my brother-in-law that I never wanted to be involved in one of his dangerous pranks again.", "!isbot <Contrarian_ChatGPT>", "She has been pretty distant since I married my wife and I felt if she wanted me she would have asked", "Tessa is literally my mom's mini me, so she went for the type of guy my mom wanted and I think my mom feels she wasted so much time on her dad, and it makes her happy to see Tessa getting this so young. They are both difficult and he totally accepts her and it took my mom a long time to find that. Also she's been cold ever since I married my wife", "This is the way.", ">Also, your willingness to \"scream\" and wake up your entire family to seemingly get to the bottom of what happened to makeup in the middle of the night is way over the top. That's the kind of reaction I'd expect in a serious emergency. Not over some ruined makeup. Are you and your wife always this uptight?\n\nThis stood out to me, as well. It was a crappy thing to do, but did not rise the the level of screaming bloody murder in the middle of the night.\n\nOP needs to love his mother more than he hates Brian.\n\neta: YTA", "Thank you!! I don't get all these N ta's. Some drunk teenager did some stupid shit after he was egged on. The makeup was replaced. You and your wife sure know how to hold a grudge about something so ridiculous and innocuous. He didn't smother your puppy, ffs. YTA and your wife (who the HELL takes a grand worth of makeup on vacation...bet THATs a story) sounds insufferable, too.\nGrow up and apologize to your mom for emotional blackmail.", "Sounds like Brian was the only one to offer.", "i'm mad that my mom bailed Brian out and protected him from consequences. I'm mad my wife's property was destroyed and she had to go through the hassle of replacing it", "six months", "Six months, not six years.", "…so, bullying your wife and destroying her property was on your potential future step-father’s mind as funny joke? \n\nI’m thinking skipping the wedding and wondering aloud to Brian that maybe it’d be “funny” for him to wear clown shoes down the aisle and leave him to it to ruin things on his own.", "This should probably be stated in your post.\nClearly NTA. You don't have to attend a wedding with moms fiance (who hates your wife enough to pay someone to destroy her property), Brian (who hates your wife enough to actually destroy her stuff) and your mom (who doesn't care about you wife at all).\n\nNTA. But it's time to set some boundaries with your family and maybe talk to your wife if there is more she didn't tell you because she wanted to keep peace", "Huh?", "[removed]", "Why doesn't she like your wife?", "I am so sorry this happened to you!\n\nYour Mum sounds like hardwork!", ">OP needs to love his mother more than he hates Brian.\n\nSo much. \n\nI would be ticked over this for a while, but it's not something to let come between you and your family. Is OP's relationship with his mother worth less than that 1K makeup?", "Those are annoying things. But do you really want to ruin your mother's wedding over it? That is honestly worse than the prank Brian pulled and show's even poorer judgement than any of your family members did that night.\n\nWhat you are doing is almost unforgivable. It's your mother's wedding! What Brian did was something worth being mad at and then moving on so it doesn't destroy relationships for the rest of your life.", "[deleted]", "Oh, geez. Brain really farted. Still think that's too long to hold this grudge. Editing my comment. Thanks!", "Edited. Feeble brain leapt ahead on me. Thanks.", "I mean - never mind Brian, the rest of them don’t seem like much fun. “ You know what’s do for fun? Destroy some lady’s high end make up kit. I double dare you!”", "Man, I'll never complain about my family anymore...", "but he isn't her son. if she wanted me she would have asked me and i feel at this point it would have been presumptuous to volunteer", "She finds her abrasive, controlling, and shallow. Really they are just so different and get on each other’s nerves", "What was the prank, though? That scenario was just straight up destroying someone's stuff. That's not a prank, and the ensuing anger is not entirely about the prank. It's about the disrespect and the fact that it was never properly addressed.", "How so? Not that it matters, Brian's a dick and it's good you're standing by your wife. It's going to further damage the relationship though but your mother is so dismissive of 1k worth of damage, it's just...that's rent for a month for most people. At least. It's like none of them value the money. Are you people richl?", "Yeah she is. 1k just isn’t a big deal to her and she’s kind of not like other girls when it comes to makeup. She thinks my wife is vain and upright about her looks and pressures me into keeping up with the Jones’s. My wife is extremely type a and my mom finds that controlling", "YTA. It was a very bad joke. The money was paid to replace it. You & your wife need to Get over it. Be there for your Mom. Why didn’t you offer to walk her down the aisle?", "YTA. Grow up already. So much drama about makeup ffs. It’s over, you’ve been paid, apologies made, move on. Sounds like your wife is quite the piece of work and you’re the willing sidekick - screaming in the middle of the night about MAKEUP?!?!?Who tf does that?! What happens when your kid gets into mommy’s makeup, a quick trip to the orphanage? Seems like there’s a reason for mom not asking you to walk her down the aisle.", "ES - it never occured to your mother to ask you to walk her down the aisle.  Instead she clearly favours this man / child.\n\nWas it your mothers fiance who bribed Brian with the watch to ruin your wife's makeup? It sounds like they don't like your wife who might be a bit high maintnence.\n\nIf you're not going to your mothers wedding, you won't go to your sisters either.  Its a big stand to take, if Brian was a drunk child one night but if this is typical Brian, ruining other peoples possessions ....", "NTA.  It's really good that you're a married adult. Your bio family doesn't seem to be in your long term future. Let them go. They have interesting takes on things. Best plan: fall back, go LC, live your best life. Quit giving these people your emotional energy.", "NTA.    And your her son, to me it shows your place.  Brian then you.\nNo contact sounds good if mom would rather have Brian at the wedding than you.", "NTA\n\nYou and Tessa should walk your mom down the aisle. Why would she not have asked her own children?", "NTA \n\nYour mom’s future husband was the one that egged Brian on to destroy your mom’s makeup? Brutal! \n\nAnd they want you to support their wedding and act all happy? \n\nDid anyone apologize? Brutal!", "NTA. How is this a prank?", "NTA, sorry they don’t like your wife", "NTA. Apparently, your relationship with her isn’t all that great to begin with if she is walking with her daughter’s fiancé and not her son.", "Nta.  Nuff said.  She didnt ask u? What an insult.", "NTA. You are a good husband . You should give some advice to the other poster who is still going to his mom’s wedding even though her fiancé called his wife ugly.", "NTA\n\nAnd that wasn’t a “prank”. A prank would be if he got similar dollar store makeup and destroyed that making your wife THINK hers was destroyed, but it was safe and hidden Until the reveal . \n\nThis wasn’t a prank. It was an act of destruction.", "You should not go along with their term of \"prank\" -- he intentionally destroyed her property for no reason.  I would never have anything to do with him, either. NTA.", "NTa\n\n&#x200B;\n\nTHat was no prank, that was vandalism. You should have called the police. \n\n&#x200B;\n\nYOu are fine to go no contact with brian, he abused your wife. Not going to the wedding is a good idea. You are a great partner.", "The fact that your mom’s soon to be husband was behind the bullying definitely seems like an an important factor in all this. NTA", "Also like if she wants someone to walk her down the isle why did she ask her daughters boyfriend and not her own son", "Even if it was a $5 makeup item, throwing it in the toilet says exactly what you think of the person who meant to put it in their face.", "I mean, yeah I regret blacking out at the family reunion when I was Brian's age...but I never destroyed $1,000 worth of someone else's property and then had someone else swoop in to cover for me...especially the mother-in-law of the victim of the crime...", "Apparently $1,000 worth of makeup (that was PAID FOR) is a hill this guy wants to die on. I hope that he, his wife, and MAC and Chanel live very Happily Ever After.\n\nEdit: typo", "Why? It doesn't seem like his mom loves him more than Brian.", "You can be charged with two separate misdemeanors for destruction of property between $750 and $2,500 in my state. Brian literally committed a crime.", "Wonder how funny Brian and Mom's fiancé would find it if someone \"joked about them dressing fancy for the wedding,\" and their tuxedo/suit pants went missing the night before the ceremony? /s\n\nPranks are never funny and basically are just another name for bullying!", "\"Brian\" doesn't even seem like the worst of the bunch here.", "One thousand dollars worth of makeup. Just think about that for a minute. And it was paid back. La Prairie, VERY expensive makeup, will set you back about 300 bucks for foundation. A Chanel lipstick will set you back about 50. Even if you add all that crap up to make $1000, it was USED. Do you know how much used makeup costs? Zero dollars. None. Nada. 0. So, if you're going all \"felony\", OP's makeup was worth Zero dollars. And yet, it was replaced.", "Lol me too....\n\nReddit has shown me how wonderful I have it when it comes to my husband, and my inlaws. \n\nI feel like if I ever want to complain on here about mine, I just need to read some of these stories and I will remember how good I got it", "Gentle reminder that it's not a competition and there is no prize for winning the \"Worst Family Ever\" Olympics.", "Actually, your mom sounds controlling and shallow.\n\nNTA\n\nGo or don't go to the wedding. Maintain a relationship with your mom but not at the expense of your wife or your self-esteem. If possible, take a trip out of town so you have the excuse of the vacation to not be at the wedding. If you think that would work for you.", "That's not how that works...at all. The cost of the makeup was valued at $1000. He stole it and then destroyed it. That's illegal. The end.", "Gentle reminder for people to learn how to take a joke.", "Says who? OP? If I have a $300 foundation that is half gone, and 4 $50 lipsticks and various stages of use, it could feasibility be worth less than 250 bucks. You may have paid 20,000 dollars for your car, but if it's hit with 100,000 miles on it, it is no longer worth 20 grand."]}